{"ref": "https://www.eurogamer.net/beowulf-review", "date": "27 Nov 2007", "game_name": "Beowulf", "text": "I studied English Literature at university, you might be interested to know. Structuralism, death of the author, post modernism. All that. I wasn't very good at it, though, so sorry, I had to scrap the Anglo-Saxon poem concept review. Besides, I never got the opportunity to study Beowulf, and putting in the effort to read it for my own personal enjoyment seemed like a bit too much. Why so? Call me an unsophisticated lout, but it's old news, a little tedious, and there are countless other, better things around right now that improve on it in so many ways. Plus, I was waiting for the movie. Maybe I shouldn't have. Angering elbow-patched professors up and down the country, the movie isn't afraid to take liberties with the source material, reinterpreting the story to suit an over-saturated Hollywood's focus-tested needs, and its hunger for twists, set pieces and love interests. That there was no author around to complain about it and take a cut of the cheque was probably a bonus, too. Of course, it also helps that the CGI movie has the look of a high quality videogame cutscene to it already. It lends the predictable game adaptation an air of authenticity it wouldn't normally get with live action. Looking beyond the epic poem and the movie, the game takes the basic framework, fleshing out the film's main plot with a couple of other adventures in between Beowulf's classic fight with the monster Grendel, his mother and his final battle with a dragon.Nevertheless, the game fails to convey much of its Hollywood source material's spectacle. The scenery is rather drab and murky given its ancient Northen Europe setting, and big name actor Anthony Hopkins, in particular, is wasted on some dull voiceover work and disjointed cutscenes. The game's attempts at injecting a little drama that occur back at the castle between missions are pretty weak, too, restricting you to slight fifteen degree movement around a couple of rooms and some brief, needless discussions with a couple of cohorts.It's an indication of Beowulf's confused approach. There was talk of extra effort being put in to elevate this above normal movie dross. Yet while the potential is there, it wastes it in a structure that never has the confidence to break away from linearity or do justice to the games it wants to ape. In fact, it doesn't take very long at all for the game to lay its cards on the table and show just that. Just ten minutes in you're thrown into a basic battle with a group of sea serpents in a scene oddly reminiscent of God of War's first level. Surprise, surprise - a Quick Time Event then rears its ugly head, and that trip down memory lane veers sharply into overused alley.Those awful Simon-Says sequences crop up everywhere. The best that can be said is that they're relatively short. The worst is that they don't just rely on tapping once; they're tedious button mashers too. Grappling with an enemy feels like you're doing the 100m dash in Track and Field, and one level - revisited a few times throughout the game - has you repelling the advances of some sultry devils in exactly this way until your finger hurts. Surely there would have been a better way of doing things?Speaking of which, you're also followed by a group of soldiers. While they fight beside you, their other purpose is to help you open and close doors (Ray Winstone's cockney ~shut that door~ command has a touch of Larry Grayson camp about it, amusingly) and the like, which they're happy to do all too often. Words of encouragement are given through a small rhythm action minigame in which you tap buttons in time to musical cues. It's not so much that it feels a little incongruous in the midst of the blood and guts, it's rather that this sequence is used all the time without ever really changing. You open one door, you've opened them all.When they're not opening doors, those soldiers are usually as pointless as those you'll encounter in Ninety-Nine Nights. The spectacle of a small army is impressive, but it wouldn't make any difference if they were there or not, you'll often be thinking as you take care of things yourself in a close quarters battle with the enemy. There's no way to command them in a fight and they'll merrily go off on their own to look for trouble. Because they're not as clever as you either, it isn't long before they're pinned down by their foes and begging for your help. Worse than that, you can't ignore the idiots because it's game over if all your men are killed. Another attempt at punching above its weight comes via a moral system. As a way to play through the game more than once, Beowulf stands to gain a reputation in legend as a heroic king or an infamous brute depending on your actions, but what this boils down to, simply, is what kind of attack you use in combat.This is tied into your health meter. It constantly recharges when in the clear and instead of corresponding to your physical sense of well-being, it represents your skill in battle. Perform well, attack and dodge and the bar fills up to the top, offering the opportunity to boost your soldiers' performance and earn you heroic points to spend on upgrades. It's slightly more comprehensive than the carnal route which allows you to hold down a trigger to activate bezerker rage, giving temporary invincibility and a blood-red screen effect for a short period. It's easier to do, but the trade off is the depletion of your health and a couple of vulnerable seconds being stunned when it wears off. Do enough of this and the balance tips the other way. Whichever way you choose leads to your final assessment and the ending you see. But the journey is pretty much the same, and the absence of any moral choices outside of fighting renders the system a disappointing way to extend the experience. What it really does is falsely restrict the amount of fun you can have by forcing you to limit one set of moves over the other if you want to see everything. That's not fun.Generally, Beowulf is not a very difficult game (easy Achievement Points go without saying). What drains it of excitement and make it more of an endurance test are some annoyingly resilient enemies, particularly on hard mode. More specifically, the lumbering trolls that pepper the game take an age to defeat. Despite a limited and graphically brutal combo system that cuts through standard enemies, you'll sigh with resignation when another one crashes into view. All this tediousness then culminates in one of the most boring final boss battles I've played this year: fighting a dragon which performs the same exact easily-dodged attack over and over again until you've worn his health bar down half a bleeding hour later.Beowulf is also encumbered by a number of other glitches - loss of gamma levels, fuzzy sound, levels not loading and more. None are enough to ruin the game, but a sign that maybe this never got the polish it needed to meet the movie release date.That's not to say that Beowulf is entirely a rush job, and the clunk and roar of combat can be satisfying in parts. In the end, though, it's sadly little more than a dated, bog-standard hack and slash with misguided pretensions. The bottom line is that there are countless other games of this type around that are superior in every way."}