{"ref": "https://www.eurogamer.net/naruto-rise-of-a-ninja-review", "date": "25 Nov 2007", "game_name": "Naruto: Rise of a Ninja", "text": "This would normally be the bit of the review where I explain what Naruto is - but frankly, if you don't already know, you're reading the wrong review. All licensed titles rely on knowledge of their source material to some extent, of course - but with many of them, you can enjoy the game without really knowing much about the media it's based on. Fans of the original media just get an extra layer of enjoyment, that's all.That's not the case with Naruto: Rise of a Ninja. Unless you're familiar with the spiky-blond youngster's shenanigans, you're going to spend most of this game wondering what in the name of all that's holy is going on. That's fine, of course; it just restricts the target audience to people who know about Naruto, and given that it's pretty much the most popular cultural export from Japan of the last five years, that's not a restriction anyone is likely to sweat too much about.This is not, of course, the first time that Naruto has had a console outing. The series' extensive cast of teen ninja weirdos has been the subject of a large number of beat 'em up titles, several of which have even made it past Japan's rocky shores - but none of which really stuck their heads above the parapet as being particularly great games.Naruto: Rise of a Ninja is peculiar, though, because it wasn't developed in Japan at all. For the young ninja's first outing on a next-gen console, the rights were handed to Ubisoft, with the game being developed in Canada. Cue predictable groaning from fans of the series; a Japanese anime and manga franchise, being translated into a console game by a North American studio? A recipe for disaster, surely?Well, no. From the outset it's clear that Naruto: Rise of a Ninja is by far the best game in this franchise - and, in fact, it raises the quality bar for anime adaptations in general by quite a few notches.Loosely following the plot of the first eighty episodes of the TV series (up to the end of the invasion of Konoha village, in effect - look, if you don't know what that means, you probably shouldn't be playing the game anyway), Rise of a Ninja is really two very distinct games in one. It's a platform adventure title, featuring dozens of mini-quests and missions in a free-roaming version of Konoha village and its environs, and it's a beat 'em up game where you fight enemies from the series (and random bandits) using the powers you've acquired in the adventure mode.Both aspects work remarkably well. Ubisoft has done a superb job of bringing Konoha to life, mixing the cluttered nature of Japanese urban environments with the series' unique, colourful visuals. The town is relatively easy to navigate at street level, and features all of the famous locations from the series; as you progress, however, Naruto will gain abilities like sprinting and double-jumping, which allow him to access rooftops and jump across wide gaps, which opens up new areas and secret items.Within Konoha's environs, there's plenty to do - with loads of tiny missions such as delivering Ramen for the local shop, collecting hidden coins to unlock combat items, or playing hide and seek with snot-nosed brat Konohamaru. One of your overall objectives is to change Naruto's status from being despised by everyone in the town to being widely liked, and each mission you undertake converts some villagers to your side - signified by an angry face floating above their head changing to a happy one. Happy villagers will help you with quests - and, in a nice touch, will say pleasant things to you as you run past, rather than shouting insults at you.The beat 'em up game is closer to what we've come to expect from Japanese-developed Naruto titles, and of course, you can play this mode in multiplayer. It's far from being the most deep or involving beat 'em up we've ever played, though. The basic strategy of the game involves using heavy attacks to drive a character away from you and knock them over, giving you room to set up one of the game's ~jutsu~ moves - non-interruptable button press sequences which take off vast damage if you get them right. The balance, however, is a bit odd; jutsus are so powerful that the developers had to add in long-range attacks that easily interrupt them, which means that against a remotely decent opponent (either human or AI) you generally end up opting for straight-forward combos and blocking. It ends up feeling a bit like a beat 'em up lite - there's not a lot of complexity, but there are some nice ideas in there. We like the concept of levelling up a beat 'em up character as you progress, for a start. We also liked the game's ~memo clips~, good memories that Naruto has collected on his journey which allow you to refill your health to a certain degree if you're defeated in combat during the story mode. However, after a while, this feature basically felt like a sop to the incredibly uneven difficulty of the game.Rise of a Ninja, you see, is a game which is designed for kids to a large extent - young teenagers, at least. That's fair enough, and with that in mind even cynical old beards like ourselves were still enjoying the game to large extent. Then - out of the blue - the game throws you into a battle with a story character (Zabuza, to be precise) which completely, utterly annihilates you. Struggle through, and you fight him again immediately; and note that your health doesn't recharge between battles, unless you use items to replenish it.Compared with the incredibly simple delivery missions in Konoha village (which are, in fact, so simple that they start to get a bit repetitive after a while - another failing of the game being a lack of variety in the missions spread around your hometown), the character fights are bizarrely difficult. It reinforces the idea that the game really is two games in one; it feels like there was a total disconnect between the design of the adventure (simple, fun, light-hearted) and the beat 'em up (technically relatively simple, but absolutely kick-arse difficult), which they tried to resolve by throwing in memo clips. Indeed, if you get your butt kicked too badly you'll be given the option of fully refreshing all your memo clips - very handy, certainly, but a better difficulty curve would have been a lot more welcome.Rise of a Ninja is by far the best Naruto game around, and its absolutely lovely cel-shaded graphics and gorgeous, authentic environments set it head and shoulders above the competition in terms of anime licensed games. However, the difficulty curve is nothing short of utterly random, and the Konoha missions lack the variety to make the game truly compelling - even if the series' wonderful drama shines through at all the key moments you'd expect. The lack of Japanese voice acting is a major negative point against the game, too, because the US dub is ~controversial~ to put it mildly; a huge number of Naruto's fans are familiar with the original Japanese audio, and the American voices on offer here will grate terribly as a result. Especially since most of the voice actors don't even seem to be able to pronounce the name of the series and its lead character consistently, let alone correctly.The phrase ~one for the fans~ has never been applied more honestly than in this case; it may be flawed, but we're happy to recommend Rise of a Ninja to Naruto fans - albeit with a few reservations. Believe it. (Sorry.)"}