{"ref": "https://www.eurogamer.net/ace-combat-6-fires-of-liberation-review", "date": "23 Nov 2007", "game_name": "Ace Combat 6: Fires of Liberation", "text": "Is there anything in the world quite as intrinsically homoerotic as being a fighter pilot? It's not a topic we'd normally dwell on, but playing Ace Combat 6 this week has caused the question to raise its head. Every single person who's stopped by to watch has made a point of offering to ~be your wingman any time!~, generally in their best affected camp voice; the joke got old, but we got the point. Top Gun has a lot to answer for. We were half expecting a locker-room mini-game after each mission where you have to try to slap your wingman on the bottom with a rolled up towel - your disturbingly needy and passive wingman, that is, who plaintively asks you to choose his equipment for him before you fly. ~What plane should I fly?~, he whines. ~What weapons should I bring?~, he implores. ~Which flightsuit does my bum look best in?~, he simpers.Okay, we made up the last one. But you get the point. Top Gun really does have a lot to answer for.We've had a bit of a chequered history with the Ace Combat series here at Eurogamer Towers. While there's no question that it looms large over the combat flight sim genre on consoles, and that its early iterations were bloody brilliant, there's a distinct feeling that Namco has done little but rest on its laurels since the seminal Ace Combat 04.Titles like Ace Combat: Squadron Leader, Ace Combat: The Belkan War and PSP iteration Ace Combat X have all been little more than effortless rehashes of a well-established formula. It's been very hard to hate them, because Ace Combat is always polished until it's as shiny as any of its line-up of fighter jets, and that's very shiny indeed. On the other hand, it's been very hard to like them either, because they've offered nothing remotely new or interesting to get our teeth into.Ace Combat 6, then, treads a fine line by introducing itself in terribly familiar terms. A nation called Estovakia, which is vaguely Russian, has come under the control of its military generals, and promptly invades their peace-loving next-door neighbour, the Republic of Emmeria, which is vaguely American. Except for the peace-loving bit, obviously. You are a fighter pilot, and after an abortive attempt to stop the invasion, the first major plot thrust sees you fighting to establish a beach-head and re-take your country.In other words, it's broadly the same set-up as every other Ace Combat game, so you'll excuse us if our initial reaction was not dissimilar to seeing yet another annoying missionary type appear on our doorstep - different face, different uniform, but you're pretty sure that five minutes in, they're going to be peddling the same crap. And telling you off for immoral sexual activity. (The missionaries that is, not Ace Combat.)Not so. In fact, despite the unpromising setup, Ace Combat 6 finally delivers what long-suffering fans of the series have been waiting for since Ace Combat 04 - change, innovation, and a welcome refresh of some tired features that have been growing increasingly long in the tooth.On the surface, admittedly, the changes aren't all that apparent. Ace Combat locked down the fundamentals of handling an aircraft, dogfighting and so on years ago, and there's very little reason for the series' creators to try to fix what wasn't broken. Newcomers to the series should note that it offers two entirely different flight models - an arcade-style system and a simulation mode. The arcade system is likely to be the choice of most players; it arguably gives you less fine tuned control, and is certainly less realistic, but it's eminently satisfying and turns the game into a great dogfighting shooter.The simulation mode, on the other hand, is a very competent stab at emulating the flight controls of real aircraft - not exactly easy on an Xbox pad, admittedly, but the game doesn't do a bad job all the same. It's somewhat intimidating, frankly, and while we appreciate the solid job the team has done of making it realistic, we suspect most players will give up and go back to arcade controls after crashing into buildings upside-down a few times. Still, it's there, and if flying planes properly is your thing, then its presence will be welcome indeed.The basic flight mechanics - or fight-and-flight mechanics, if we're to make an awful psychology pun for no good reason - are hugely enjoyable, as you'd expect from a series with this history. Dogfights are satisfying experiences that rarely descent into the kind of endless looping around chasing each other's tails that is found in many other combat flight games, and zooming low over the terrain to unleash a barrage of missiles over a column of tanks delivers a visceral, back-of-the-neck-tingling kind of thrill.Where Ace Combat 6 really delivers the goods, though - and this, frankly, is where the series has fallen down in its last few iterations - is in the mission design. For the first time, the game delivers a genuine feeling of being a part of a rapidly developing and evolving battlefield, with multiple units on land, sea and air taking part in combat across a number of fronts. Where previous games have delivered fun dogfighting (or less fun bombing runs)and a vague sense that something else is going on around you, this time you're really at the heart of the war.Most missions have a large selection of objectives - some optional, some not - which are simplified down into a few key mission ~strands~ for you to follow. An early example is a D-Day style beach-head landing, where one landing force is aiming to retake the airport (allowing you to refuel and re-equip once that's accomplished), another is establishing the beach-head, and a naval fleet is mopping up enemy resistance around some strategically important oil rigs."}