{"ref": "https://www.eurogamer.net/wwe-smackdown-vs-raw-2008-review", "date": "12 Nov 2007", "game_name": "WWE SmackDown vs. Raw 2008", "text": "I find wrestling fascinating. Not in the sense that I obsess over the fine stitching on Rey Mysterio's mask, but in the sense that over the fifteen years or so since American wrestlers chased our homegrown spit-and-sawdust sportsmen off the screen, like invading grey squirrels with outrageous mullets, it's grown into such a bloody weird phenomenon.Let's face it, nobody takes it seriously as a sport, hence the euphemistic ~sports entertainment~ tag, and so the TV shows have actually begun to reflect this with evermore outlandish storylines and audacious twists. Yet the guys who take part are clearly incredible performers putting themselves through punishment that, while never as dangerous as it's made to look, still requires astonishing physical skill. It's an utterly unique collage of the realistic fakery and fake-looking reality, where fans can openly talk about the quality of the script while discussing those taking part as if they were more than just the stars of a corporate soap opera performed in the style of a theme park stunt show. And it's this schism that runs right through the latest Smackdown, a game that treats the fights as actual full-contact combat while openly admitting the carefully choreographed nature of the phenomena itself.Now that I've incensed those readers who invest too much energy into following such things, let's take a look at how Smackdown's 2008 iteration plays as an actual videogame. And I mean, how it actually plays.With such a self-contained niche audience to cater for, it's easy to review these things by simply listing the new features, maybe grumbling about roster changes or changes in beloved game modes, but ending on a generally upbeat note that reaffirms the devotion of the faithful. If you like old Smackdown, you'll like new Smackdown. Awesome.With that in mind, I'm duty bound to mention the major tweaks to the formula this time around. The right stick control introduced in Smackdown '07 is enhanced further, now allowing the pressure of submission holds to be accurately controlled with the stick, just as your opponent can use their stick to try and break free. This actually works very well, making submission moves a genuine push-and-pull battle, and goes even further than the last game to shake off some of the more daunting and unnecessary control quirks that had accumulated around the game. Also affecting the way you wrestle is the introduction of eight fighting styles. Powerhouse impacts your ability to use strong attacks. Showman deals with your ability to wow the crowd. Dirty enables you to play the heel and use more illegal moves. You get the picture. Each wrestler can access two of the eight, with one primary and the other secondary. Again, this idea works well since it means that wrestlers have been assigned styles that match their real life performance, and you can no longer play as a jack of all trades. The only downside is that the only in-game explanation you get of this system is a series of short video clips. No hands-on practice, no interactive tutorials of any kind.ECW joins the line-up for this edition, though they've clearly been deemed too scruffy and poor to deserve title billing. While this is good news for those who like hardcore blood-and-bruises wrestling, don't go thinking this means you're getting a monster roster to work with. With just over 50 fighters to choose from, including Divas  and unlockable legends, the head count is actually down from last year by over ten characters.More controversially, the Season and General Manager modes have been scrunched together under the 24/7 banner. Here you choose whether you want to play as a single wrestler (either existing or created) and build them up to Legend status, exercising different skills, tending injuries and performing promotional work, or you take on the role of the manager of one of the three wrestling brands in the game and try to win the ratings war by combining popular wrestlers and throwing out those beloved twists and storylines. It's the same as GM mode last year, basically. It's here that you can feel the game stretching to accommodate the real/fake nature of the source material. As general manager you're actively hiring writers to pen stories for your wrestlers, and deciding who gets to be clean or dirty, but as a wrestler you're taking part in real full-contact fights with real internal injuries that can end your career. Not really a criticism, just something for those who enjoy the tang of irony."}