{"ref": "https://www.eurogamer.net/battlestar-galactica-review", "date": "11 Nov 2007", "game_name": "Battlestar Galactica", "text": "I'm not sure whether he was feigning surprise or what, but Dan was rather upset when he found out Wing Commander Arena was rubbish. Xbox Live Arcade may have lots of shoot-'em-ups, but it was short of the sort of thing WCA offered: quick-fire online dogfights in famous spaceships. Battlestar Galactica seems to be going after the same niche, and cocks it up just as spectacularly.If not more, actually. WCA had lots of different play modes and unlockable ships. BSG has deathmatch, team deathmatch, and domination. The single-player Campaign mode, which builds ten increasingly tricky levels around scenarios from the re-imagined TV show's first three seasons, can be finished in an hour, leaving you to hunt for ridiculously difficult Achievements. A week after the game came out though, it's a struggle to find online opponents, so we might as well start without them.Played out on a flat 2D plane, with the camera angled downward so you can't see much and have to line up targets using the radar, BSG plonks you in various human ships depending on the mission, but they all behave much the same. Mark II and VII Vipers are the mainstays - nimble fighters that you direct with the analogue stick, boosting backwards and forwards using bumpers, with a defensive bubble on the left trigger, guns on the right trigger, and missiles on A. The right analogue lets you do barrel rolls, or the fancy 180-degree flip turn like Apollo and Starbuck.For those who haven't seen BSG since Ronald Moore revived it, you are missing out, but this game doesn't try all that hard to fill you in. Starting off during the mini-series that predates season one, it jumps erratically across the various plot arcs without attempting to construct a narrative. Basically you're just doing bits off the telly that fit the concept: trying to stop Heavy Raiders reaching Galactica, sparring with ship-mates to be top dog, attacking the Resurrection Ship, hunting down mean old Scar and escorting Raptors away from New Caprica.Combat is incredibly simplistic. Find an enemy, point at them, mash your guns and missiles, overshoot, turn around and repeat. Enemy craft hone in on you unfairly and your NPC wingmen are mostly rubbish, so you die repeatedly, respawning at the bottom of the map and picking up where you left off. The more you die, the longer the respawn time, although it's not so bad that you won't finish everything on the first or second go on Medium difficulty.When it tries new things, like using the Blackbird's stealth to approach the Resurrection Ship, it mostly fails - stealth proving largely useless. Another mission has you picking off Cylons one by one using Kara's stolen Raider, which is a change of pace if nothing else (and my ambivalence as I think back to it suggests nothing else). Once you finish everything off, your best bet is to gun for Achievements. You'll struggle to get any more than the basic ones, because they involve things like beating Scar without dying or killing all the Cylons on the Blackbird level.Once you run out of enthusiasm for that, you have multiplayer, providing you can find opponents. Judging by the leaderboards, a few hundred people have given it a go, although not many lasted that long. The reasons for that are the same as the ones that render the single-player such a chore: combat is repetitive and one-dimensional (alright, two-dimensional), the ships all handle like ice cubes and there's virtually nothing to it apart from luck and resolve. If you end up in a laggy game, which I did more often than not, it's even worse.Really there's nothing here to be nice about. The graphics are dull and dated, there's no atmosphere or narrative cohesion to speak of, and even the keyboardy music - which mimics the show's clips and clops - is a bit feeble. Dig out the mini-series and watch that again instead. And if you haven't ever watched it, buy the mini-series instead. The DVD costs less than 800 Microsoft points equates to, let alone the USD 19.99 Sierra wants for the downloadable PC version, and is some of the best sci-fi TV of the past decade. This, on the other hand, is the worst kind of licensed game: utterly ignorant of the series' charms it's designed to complement, and bad enough at what it does attempt to make baby Hera cry."}