{"ref": "https://www.eurogamer.net/dynasty-warriors-gundam-review", "date": "9 Nov 2007", "game_name": "Dynasty Warriors: Gundam", "text": "The Japanese launch of Gundam Musou inspired a surge of interest in the PlayStation 3, with the 170,000-odd copies of the game that shifted in its first week on sale helping to double sales of Sony's console. That's because the game marks a conjunction between the massively popular Gundam anime series and the massively popular Musou videogame series. When the time eventually comes for the game to come out over here, it will no doubt inspire only a ripple of indifference - a mark of the stubborn apathy with which western audiences view both Gundam and the Musou series (better known as the Dynasty/Samurai Warriors series in the west). It's their loss: Gundam Musou - Dynasty Warriors: Gundam to you and I - is absolutely brilliant.Compared to the regular Musou games, the Gundam setting provides a license to go even more histrionic, but the battlefield button-bashing will essentially be familiar to anyone who's played a Musou game before. Although the sci-fi setting does mean that the game features long-range weapons they're mostly little more effective than pea-shooters, so the real focus remains firmly on melee combat - against hundreds of opponents, with no slowdown. The bright, vibrant visuals are interspersed with cut-scene interludes at key moments and dramatic close-ups when you cross swords with significant enemies. And pilots and mobile suits both level up over the course of the game, providing more health, a wider selection of skills to equip, and better musou attacks. Indeed the main part of the game consists of destroying hundreds of enemies to charge your musou gauge in order to unleash an even more substantial wave of destruction. And your musou gauge also automatically refills when you're critically low on health, making it a high-risk, but viable and rewarding strategy to sashay across the battlefield stringing together musou combos avoiding any armour pick-ups. That, to a lesser or greater extent, is true of all the Musou games. The addition of a dash manoeuvre, however, dramatically alters the game, opening up new types of attack and increasing the furious pace of the game. It also allows you to access battlefield hotspots more quickly, which is important because the great strength of the Musou series has always been, perhaps surprisingly, its strategic depth. The immediacy of the button-bashing brawling has always seemed to obscure the fact that, at its heart, the Musou series consists of direct control realtime strategy. By breaking down the battlefield into clearly delineated strategic areas, this becomes even more apparent in Gundam Musou. To take control of an area you have to eliminate a certain number of enemies within that area, occasionally along with some more highly powered guards. Once under your control, the area will provide support for any engagements in surrounding areasSo you're always faced with a strategic choice: whether to take a measured approach, building an extended support chain, or to rush in to try to attain key objectives quickly, before your enemies have time to build up theirs. And, of course, you always have to take account of the movements of key enemies, who provide the game with various mini-boss and end-boss moments, some of which can actually be quite challenging - particularly because they, like you, have musou attacks at their disposal.All this is wrapped up within two main modes: Official Mode, which follows the Universal Century timeline of the Gundam series, and takes its narrative from Mobile Suit Gundam, Mobile Suit Zeta Gundam, and Mobile Suit Gundam ZZ); and Original Mode, which is a full-bodied melange of mobile suits from various different Gundam eras and continuities. If you're a Gundam fan you'll either find the latter to be brilliant or unbearable depending on the religious zeal with which you follow the Gunam canon. To anybody who can't tell their AMX-004 Qubeley from their MSZ-010 ZZ Gundam, or their RX-78-2 Gundam from their MS-145 Gelgoog/CA (or even their MSN-00100 Hyaku-Shiki from their XXXG-00W0 Wing Gundam Zero) it'll make no difference, of course, apart from adding about a million different missions to the game. It's a testament to the game's brilliance that none of them ever get boring. Whether it's the enormously varied environments, or the vast array of different combat styles, the thrill of slicing through enemy mobile suits simply never pales. Underground caverns and futuristic space hangars sit alongside massive deep-space battles, and even paddy fields, miniature fishing villages, and loads of tiny torii arches. And although movement is essentially restricted to the horizontal plane in space, it's still a breathtaking and dramatic departure for the Musou series that works enormously well. As for the combat, start out as Amuro Ray and you'll quickly get used to his conventional sword-style. Switch to Char Aznable, however, and you'll need to reacquaint yourself with the nuances of his whirling staff, before an even more fundamental shift as you come to learn the subtleties of Quattro Bagina's karate style - and there's about a million other pilots and mobile suits to unlock over the course of the game.So Gundam Musou is never boring and always thrilling. It's a brilliant combination of two massively popular brands and a clever blend of subtle strategy and bombastic button-bashing. And yet it will, still, probably sink like a stone in Europe. That would be a tragic shame. It's the most fun I've had with either a Gundam game, or a Musou game, and that's pretty high praise. And yet I'm still compelled, on the evidence of previous Gundam games and previous Musou games, to add the caveat that this game may not appeal to everyone. You owe it to yourself to find out for sure."}