{"ref": "https://www.eurogamer.net/rev-fearep-pc", "date": "6 Nov 2007", "game_name": "F.E.A.R.: Extraction Point", "text": "What an interesting idea! Remember where F.E.A.R. left off? With the First Encounter Assault Recon team flying away from the mushroom cloud that buried the corpse of Paxton Fettel, apparently about to be thrown back into the rubble as Alma crawled threateningly into the cabin? Well it turns out it was all a misunderstanding. She just wanted to come round for tea. So after going home and having a warm bath, everyone turns up again refreshed and sets out on a new mission, laughing and dancing with Alma, off to investigate another paranormal siege under different conditions, exploring other areas of the horror story spectrum in the process.Reader, reader! Wake up! Time to go to school!Were you dozing? I'm sorry - I was just explaining how, in Extraction Point, the chopper went down, you woke up in the rubble, it was night again instead of day, and you were thrust into another trek through the broken city of the first game, off to reach a hopefully safer extraction point in a hospital on the other side of town. The Replica soldiers are back, Alma's back, there are a couple of new guns and some invisible enemies scampering about, and Paxton Fettel's making no apologies. ~I know this doesn't make sense. Nothing much does any more,~ he says, as he comes back to life in the first five minutes. It's alright, Pax - we knew what to expect.We knew, because single-player first-person shooter expansion packs are always, always, always more of the same. Quake had Scourge of Armagon and Quake 2 had The Reckoning; Half-Life had Opposing Force and Blue Shift; Medal of Honor had Breakthrough and Call of Duty had United Offensive. Half-Life 2 is sort of an exception, but even Episode One was structurally similar, carrying on Half-Life 2's tactic of reinventing itself at intervals to keep the player engaged.And this is okay. I buy them and I'm rarely disappointed. Extraction Point has lots of corridors, warehouses and industrial bits; lots of slow-mo gunplay separated only slightly from the battles of the main game, with the same excellent AI and well-weighted mechanics; a vaguely palatable extension of the original plot, and not a lot else. And so TimeGate Studios - drafted in to continue where Monolith left off - delivers half a dozen enjoyable hours of the same.F.E.A.R. hasn't aged a huge amount, graphically, because it looked really nice in the first place (although it's a shame there's still no official widescreen mode). In terms of what you get, it's a monomaniacal sort of shooter, with one big trick that it loves pulling because it knows you'll never get bored of it.That of course is the slow-mo gunfights. As you waltz into a new area you hear the crackling radio voice of a Replica troop, and spin in his direction crashing the base of your left palm into the Ctrl (Slow-Mo) and Shift (Zoom) keys as you do, directing a stream of gunfire into his leaden frame. As the game moves through the gears, you'll need to switch weapons to tackle tougher enemies (the Penetrator being better for the armoured troops, while the shotgun or the assault rifle's best for grunts, and the new chaingun's better for pretending you're Jesse Ventura in Predator), practice restraint as you marshal the slow-mo meter, which recharges slowly and needs to be put to good use, and try and avoid over-exposure.F.E.A.R's enemies are extremely potent, obliterating you in seconds if you try to tackle them in the open without the Ctrl-crutch, and they're not stupid either, moving ably through the deliberately open and maze-like settings, coordinating and generally only worse off than you because they can't meddle with time the way you can. The new, semi-visible enemies and giant mechs of the first game's latter stages make things difficult, forcing you to be even more careful and conservative, and the chances are you'll be fast friends with the quick-save key, and not to the game's detriment either - played out efficiently, a well-managed quick-loaded action sequence is engaging, balletic and not a small bit stylish.The main thing that F.E.A.R. does well away from the gunplay is the eerie spook sequences - the little screams and flashes that make you jump, and the horrible lucid-dream bits where you're at the mercy of Paxton or Alma or some other disquieting force, blood filling the corridors and weapons useless. F.E.A.R. had lots of these and used them well; when you mount a ladder you turn around as you grab hold of it, rather than doing the silly FPS thing of moving down it apparently head-first, and the third or fourth time you did this Paxton materialised right in your face as you turned, and you almost fell off the ladder. Extraction Point has these bits too, and TimeGate has little trouble adapting to Monolith's lead.That said, it never quite works the same way for the obvious reason: F.E.A.R's a bit demystified now. If you finished the original game (and you'd have to be a bit silly to buy this if you didn't), then you already know what happened, who's who and why you're able to act like something out of the X-Files. Extraction Point has its own story, of course, and it's fine, but it suffers from the usual rule of expansion packs: they have to make excuses for their lack of plausibility.Extraction Point also feels a bit contrived for another reason; we're not bored of the combat, which is the main reason it's fun, but the places the game takes you, the events that occur and the way the characters behave is rarely more than expected. New locations, like the church, just blend into the general dark, grey, industrial look of the thing, with little effort made to distinguish them. Only the hospital, reached toward the end of Extraction Point's new run of ~Intervals~, really offers anything different, and that's mainly because it's the revelation bit.None of this will be a problem if you simply want a single-player first-person shooter expansion pack, of course. Extraction Point ticks all the boxes. But with everything including the multiplayer modes largely the same, you could achieve much the same effect just by playing the original game again. After all, it's been a year, and you've probably half-forgotten what the story was about anyway. Basically this is still worth a go if you're obsessed with what happened in F.E.A.R, and must know more, but otherwise you'd be better off buying an FPS you haven't played yet, or renting a few horror films instead. Anyway, go back to sleep."}