{"ref": "https://www.eurogamer.net/eye-of-judgement-review", "date": "6 Nov 2007", "game_name": "Eye of Judgment", "text": "A year and a half has gone by since Eye of Judgment was first unveiled. The game made its debut at E3 2006, which did for Sony what It's a Royal Knockout did for Prince Edward. EoJ got a bit lost while everything else was going on. Mixed in with all the giant enemy crabs, drunken aircraft and grazing rhinos flying about the place, the sight of Phil Harrison faffing about with a pack of cards and a camera just seemed like another bizarre piece in a rubbish puzzle. But that was 18 months ago, and now Eye of Judgment's here, and turns out it's really rather good. It's got depth, impressive visuals and innovative use of technology. The technology actually works like it's supposed to, even in living rooms which aren't as brightly lit as the heart of the sun. All this makes EoJ more fun than any of the PS2 EyeToy games we've played. In essence, Eye of Judgment is a high-tech trading card game. It comes with a cloth mat you spread out in front of the TV and a plastic stand on which you position the PlayStation Eye camera. This is included in the package along with a starter deck of 30 cards. You can build this up with the booster packs sold separately, but 30 is enough to get you through plenty of games without getting bored. Like all good strategy games, EoJ becomes more complex the more you play but is initially easy to pick up. That's providing you ignore the tedious non-interactive tutorial, where a gruff man jabbers over a brain-grinding nu-metal soundtrack for about eight years. You're better off taking a quick look at the manual for the basic principles and getting stuck in.  Each player starts off with a 30-card deck. If you've purchased boosters you can design the deck yourself, which should appeal to fans of traditional card trading games. It's a bit of a shame there aren't two decks bundled with the game as the highlight is definitely the offline multiplayer mode. However, we found splitting the one deck between two worked fine.  The game plays out like this: players take it in turn to lay cards in squares on a three-by-three grid. The cards either summon monsters or cast spells. Once you've laid your card down, you can attack one of your enemy's squares. The winner of the game is the first person to occupy five squares on the board. That's the gist, but there are plenty of other elements to make things more complicated. You need mana (earned at the start of each round or returned if one of your monsters is killed) to lay cards. Weaker monsters only require one or two mana points, while you'll have to save up to summon stronger ones. This might involve declining some opportunities to attack, which also costs mana. Each monster has health and attack values and belongs to an element category - fire, water, biolith (neutral), wood and plains. The squares of the board are also tied to elements. Placing a monster onto a square of its own element type will boost its health. Summoning, say, a fire monster on a water square will cause damage.Monsters vary not only in the power of their attacks but which squares they can attack and in which directions. Their defence capabilities also vary. When an attack is launched, the camera zooms into the board and you see a short combat animation. It's possible to turn these off, but they're impressively rendered and don't go on too long so you probably won't need to. There are many other strategic bits to the game. Some monsters have an effect on your other characters just through their presence on the board - making those on adjacent squares invisible to the enemy, for example. Each square has different elements on each side and you can use special cards to flip them. So if you flip the square your enemy's fire monster is standing on and there's water on the other side, they'll be damaged. The more you play, the more you understand the complexities of the squares and cards and how to use them to your advantage. The best way to play Eye of Judgment is with a friend in the same room. That way you've got plenty of opportunity for trash talking, jeering and hiding your opponent's best cards under the sofa when they're not looking. Battling against the computer quickly becomes dull, and the option to watch the computer play itself is dull from the start. The online mode, while not quite as enjoyable as playing with a friend, is comprehensive and well-designed. If you've bought any additional cards, you must scan them with the PlayStation Eye before you can use them in online matches. This is a bit tedious but it's necessary so the PS3 can track which cards are being placed and prevent cheating. The PS3 also tells you which card you draw at the start of each turn, so you can't just rifle through the deck for the best one. There's text and video chat support, and you can choose from ranked, custom or friend matches. So, the online mode is fun enough to be an acceptable substitute when you haven't got a friend to hand. And you'll probably want to make use of it, since Eye of Judgment can get quite addictive. We playtested the game with someone who could only be persuaded to join in after we described it as ~a cross between Top Trumps and Star Wars holograph chess~ (yes yes it's not actually chess but you have to come down to these people's level sometimes). We promised them it would ~only be for one round~. Two hours later they were asking if the booster packs were on sale yet and what time did the shops shut. The game isn't cheap at GBP 69.99, although you do get the PlayStation Eye and all the other stuff for that price. Everything does the job, though the stand's a bit plasticky and the cards have very small images on them. Presumably this is so the camera doesn't have any trouble distinguishing their identifying marks, but if you're used to painstakingly designed trading cards with big lush pictures you'll be disappointed. So is it worth the money? Most definitely if you live in America, where it's the equivalent of GBP 34.99. If you're in RIP-OFF BRITAIN, 60 quid for an excellent trading card game and an okay camera is a bit much. Especially when you consider you'll need to buy booster packs to get the most out of it. In short, if you're a big fan of trading card games Eye of Judgment is worth the money. If you're not but you're planning to get a PlayStation Eye anyway, you might as well get a great game into the bargain. Those who don't care about cards or cameras should think more carefully about making such a big investment, and perhaps wait till it comes down in price."}