{"ref": "https://www.eurogamer.net/ax360-axpc-headphones-review", "date": "4 Nov 2007", "game_name": "Reviews", "text": "Gaming is not generally known as a quiet, relaxing hobby. Sure, you can spend a few hours intently clicking away at a sedate strategy game but, for most of us, most of our gaming time involves shooting, shouting and vehicles smashing into each other at high speed. It gets noisy - and this isn't always welcome. Flatmates can't hear the telly, babies wake up screaming, cats do their business on your duvet by way of dirty protest.The idea of sparing your nearest and dearest from the din of yet another explosive deathmatch by wearing headphones may not be anything new, but the AX360 (from GBP 79.99) and AXPC (from GBP 64.99) models by US manufacturer Tritton aim to enhance the games by applying surround sound technology, as well as a rather terrifying rumble function.So how do you get surround sound from a pair of headphones? Each cup contains four small, yet surprisingly beefy, speakers for a total of eight - two at the front (40mm, 64OHM), two centre and two rear surround speakers (30mm, 32OHM) and a duo of subwoofers (30mm, 80OHM). The subwoofers have a frequency response range of 20-120KHz while the others have a range of 20-20KHz. Considering all are strategically placed for maximum efficiency within a relatively small space, it proves more than enough. They're also Dolby-approved, so you know you're getting the real surround experience.In terms of construction both the console and PC models are identical, though the former comes in a nice metallic graphite colour while the latter features a less subtle orange colour scheme. They feel robust, and they're solid enough that you won't worry about them flying off your noggin should you thrash about like a chimp, but crucially they don't feel like someone's clamped a pair of bricks to your head during all-night deathmatch binges. The band is adjustable, of course, so those with freakishly shaped heads are accommodated. Each comes with a detachable microphone (the PC one is Skype- and Teamspeak-compatible) so you can use them for online play.The difference in price is because the AX360 model is, by necessity, more flexible in its connection options. The AXPC is a simple USB affair - install the CD, plug it in, away you go. For consoles - the headset is directly compatible with the 360, PS2 and original Xbox - you get an external 5.1 audio controller which plugs into the mains, with sockets for two headsets while the included cables offer optical, coaxial or four-way analogue input. For 360 owners, who are clearly the main market given the name, it's simply a question of popping the optical cable into the slot at the top of your output cable housing. The same cable can connect directly into the PS2. The other cabling options mean that the headset is compatible with pretty much any audio setup, so you can connect directly to a PC with a 5.1 sound card or an existing home theatre speaker system. There's also a delay switch, so if things are going awry while the sound particles travel down the tubes (this is how it works, honestly) you can snap them back into sync. Whichever method you're using, and whatever setup you require, it takes just a couple of minutes to have everything wired and ready.Both headsets also feature an inline control pod on the headphone wire itself, with four separate volume dials for convenient mid-game tweaking. A standard enough feature, though I found that the decision to write the function of each dial in black on a black background rather annoying with the AX360 model. Squinting to make out the embossed letters so I could see if I was altering the front or subwoofer speakers was a bit of an annoying fiddle.So what of the audio performance? I tested both headsets on a variety of games carefully chosen to offer the widest range of surround experiences, but ended up using the midsection of Half Life 2 as the central test case. This is because it's available on both 360 and PC, allowing for a fair comparison; it features everything from eerie horror to all-out fire fights and even some vehicular action, so the speakers would have lots of different soundscapes to cope with; but mostly because it gave me an excuse to spend two weekends exploring the wonders of The Orange Box and write it all off as vital research.After fiddling with the settings to get just the right balance between the different speakers, it's rather unnerving and uncanny just how well the 5.1 experience can be without the expected external speakers. Rather foolishly, I chose the Ravenholm level next and it's here that less thoughtful writers would insert a gag about needing new trousers. Not me. I'll just come straight out with it - I damn near shat myself into extinction. The hiss and rattle of those poisonous spidery head crabs is bad enough when it's floating around the room - when it sounds like it's right on your shoulder, the game takes on a whole new dimension. The front and rear speakers really got a workout once I reached the open street sections, leaving me in no doubt as to where the unearthly moans of the zombies were coming from, as well as the other less flashy sound effects, such as the creak of a floorboard or the tinkle of a distant broken window. The headset serves up this creepy atmosphere with phenomenal success, largely because you're not only getting surround sound, but it's free from ambient interference. No cars outside, no family members yapping in the room next door - it's just you and the game, an aural overdose."}