{"ref": "https://www.eurogamer.net/r-vcround-wii", "date": "3 Nov 2007", "game_name": "Reviews", "text": "There's no real common thread or unifying theme behind this week's VC additions - not even a made-up one - so I'll have to ditch my usual nonsense about badgers, cakes or whatever else I use to pad these intros out and just get on with the games.Is that cheering I can hear?It was a pretty reliable rule of thumb in the '90s that a long-running series suddenly sprouting a ~3D~ suffix was your cue to make like Bruce Dickinson and run to the hills. Mario aside, few platform heroes made that leap with anything resembling success while those who bore witness to Bubsy 3D are still fighting to have their melted corneas recognised as a legitimate medical condition.Sonic's first excursion into additional dimensions, released in 1996, is nowhere near as bad as some of its grotesque peers, but it still stands out as a curious and only partially successful speed bump in his career.Although programmed by UK dev folk at Traveller's Tales much of the design and level layouts were already supplied by SEGA, so it's they who must take the blame for the generally pedestrian feel of the thing. An isometric platformer, coming at the very arse end of the Megadrive's life, it failed to impress those bowled over by the ~real~ 3D of the PlayStation, Saturn and N64 and though time has evened the playing field where graphics are concerned, the gameplay is still problematic.The main gripe is that the switch in perspective essentially kills Sonic's main selling point - his speed - stone dead. The spiky blue mascot trots around the level, only picking up speed when you use gyros to send him hurtling up ramps or loops to reach new areas. It's not as if the pseudo-3D effect is used to enhance the gameplay in any way - you still just collect rings and free cute animals - so the result is a Sonic game that just doesn't work as a Sonic game.Taken on its own merits as an isometric collect-'em-up it's not that bad. Those with younger kids may like to give it a try, since the game is fairly easy, but if you were to draw up a list of Sonic games that need to be on the Virtual Console, this wouldn't be on it. And if it is, you're weird.6/10"}