{"ref": "https://www.eurogamer.net/digitalfoundry-2016-nvidia-geforce-gtx-1060-3gb-vs-6gb-review-14", "date": "7 Jul 2018", "game_name": "Reviews", "text": "The 3GB version of Nvidia's GTX 1060 is a curious product. Is it actually a GTX 1060 at all? The cutbacks made to this product aren't just memory-based in nature. In addition to chopping down the full-fat product's memory allocation, we also see a drop in available processing cores. The full complement of 1280 shaders drops to 1152 - and most of the time, this tends to be accompanied by a change in name. GTX 1050 Ti any one? Scratch that, it's taken, GTX 1060 LE perhaps?It seems that Nvidia is using its product names now to group its GPUs together in terms of performance as opposed to actual spec. Based on the firm's claims, the three gig GTX 1060 should offer just a five per cent deficit in performance compared to the same product running the fully enabled GP106 processor. Essentially - in practise, you probably won't be able to tell the difference. Thinking about upgrading your gaming PC? Take a look at our recommendations for the best graphics cards on the market. Pairing your graphics card with one of the best gaming monitors is also important, so check out our latest picks!But it's the drop in available memory we should be most concerned about. High quality texture modes are on the increase, downloadable 'HQ' texture packs are also a thing, not to mention the beginnings of memory hungry hyper-level presets - as seen in Mirror's Edge Catalyst. Now, generally speaking, based on our experience playing the likes of Gears of War Ultimate Edition, Mirror's Edge, Rise of the Tomb Raider and Doom 2016, the difference can be quite subtle. But the point is that generally speaking, memory requirements are only moving in one direction and there's a definite sense that even with its cut-back shader allocation, GTX 1060 3GB doesn't fully balance its performance with its framebuffer resources.What we're looking at here is the exact same technology as the full-fat GTX 1060, with a couple of cut-backs - there's 90 per cent of the full CUDA core count, and obviously the framebuffer memory is halved.The Nvidia GeForce GTX 1060 in its 6GB guise starts at £240/$250, while the cut-back model sees a £50/$50 reduction, starting at £190/$199. But there are mitigating factors here. The GTX 1060 3GB is only a touch more expensive than AMD's RX 470 and the performance advantage Nvidia offers is undeniable in most titles. It's $60 cheaper than the fully enabled 6GB model, and even the UK price is reasonable at £180. And then there's the fact that Nvidia's memory compression is good. It's really good. It's demonstrably more efficient than AMD's, to the point where comparisons between the three gig GTX 1060 and the four gig RX 470 should prove fascinating.While there have been compromises to bring the price down, it's important to note that while some elements of the GTX 1060 3GB spec have been pared back, other aspects remain fully intact. Base clocks and boost clocks are exactly the same, for example. In fact, there is no Founders Edition this time - no reference board, in effect - so most of the GTX 1060s out there will have a factory overclock of some description. The MSI Gaming X card we were sent for review actually has a meaty 88MHz boost to the core clock and a somewhat less significant 40MHz added to the GDDR5 RAM. The memory base spec also remains unchanged from the six gig GTX 1060 - we're looking at a 192-bit memory bus running 8gbps memory for a final memory bandwidth tally of 192GB/s.Testing here is split into our usual resolution breakdowns - and for a card of this class, we're looking at 1080p and 1440p resolutions. Our aim here is to confirm GTX 1060 3GB's relationship performance-wise to its bigger brother, and also to stack up the card against AMD's four gig RX 480 and RX 470 (note: our data here comes from an MSI factory overclocked model). And finally, we really need to get to the bottom of the VRAM situation - to stack up Pascal's enviable memory compression and Nvidia's driver memory management against the 'luxury' of an addition gigabyte of VRAM found in the RX products.As a sub-£200 graphics card, the new GTX 1060 is clearly aimed at those gaming at 1080p resolution - by far the most popular type of display. And that's where we'll begin with our benchmarks. There are few surprises here - the GTX 1060, overall, is a best in class performer, winning seven of the eight benchmarks against AMD products in the same price bracket.The numbers are confirmed. By running the MSI Gaming card in its silent mode, the GTX 1060 3GB we have here matches the reference clocks - with boost topping out just below 1.9GHz, just like its bigger brother. However, a 10 per cent deficit in CUDA cores does indeed translate to the five per cent drop in performance stated by Nvidia. This delta is mitigated somewhat by the factory overclock found in our MSI model, which generally sits as a mid-point between reference GTX 1060 3GB and 6GB models. In almost all cases, the budget Nvidia offering outperforms the RX 470 (and remember, this will be boosted by a couple of frames owing to its factory OC) along with both iterations of the RX 480. Even Ashes of the Singularity - a weak point for Nvidia - sees it offer basic parity across the run of the clip. In all of the benches here, there is no evidence to suggest that the 3GB framebuffer causes issues - except in one title, Hitman. Here, the performance drop-off on GTX 1060 3GB is significant - and we strongly suspect that DX12, where the developer takes over memory management duties, sees the card hit its VRAM limit. Notably, this does not happen on the AMD cards with four gigs of memory.Hitman is also notable in that it is the only benchmark where we see the GTX 970 pull ahead of the GTX 1060, if only by a small margin. However, again, VRAM is the likely culprit - in terms of processing power, GTX 1060 3GB is clearly ahead of GTX 970, so by a process of elimination, the three gigabyte limit on the new card is the limiting factor.At 2560x1440, the numbers tend to close up when the lower-end GTX 1060 is stacked up against the AMD competition - and the five per cent delta in performance against the full-fat model remains in effect. In addition to the noticeable deficit that remains in Hitman, there is a clear deviation in the data for Assassin's Creed Unity and Hitman, showing that we are hitting VRAM limits. This is confirmed by the memory utilisation when monitored using MSI Afterburner, but more telling are the frame-times, which sees regular latency spikes - a classic sign of VRAM over-commitment. It's interesting to note that the GTX 970 hands in the same average frame-rate overall, but has none of the spikes - once again it suggests that the additional memory demonstrably helps here.Titles like Crysis 3, The Division and The Witcher 3 amongst others clearly show that there is no degradation in performance when VRAM is managed well. However, the higher you scale native rendering resolution, the more desirable higher quality textures become. From a processor performance perspective, clearly the cut-down GP106 chip has the power to run 1440p gaming - but memory is clearly much more of an issue here; we need to house the same texture data as we do at 1080p, but the render targets internally generated to create the final scene increase in size by up to 77 per cent. Pascal's excellent memory compression here can only go so far and its effectiveness will vary on a scene-by-scene nature.By and large, the three gig GTX 1060 copes with our benchmarks well, but a closer look at the VRAM problem titles - Hitman and Assassin's Creed Unity - show something interesting. Stutter isn't a major issue as we thought it might be (as data shuttles to and from system RAM to VRAM) but instead we see a general depression in performance. So in Unity for example, the expected five per cent delta between the 3GB and 6GB GTX 1060s increases to 15 per cent at 1440p. The 4GB AMD cards exhibit more stutter, but still operate roughly at their expected performance level. This begs the question - can a 3GB Nvidia card match or beat a 4GB AMD product?The AC Unity data suggests so, but our next test - designed to heavily over-commit VRAM - demonstrates that having that additional gigabyte of VRAM certainly helps the Radeon products. We re-ran our Rise of the Tomb Raider benchmark at 1080p with the very high textures engaged - something the developer warns against specifically. There are three sections to this bench: in the first, the three gig GTX 1060 keeps up with its more expensive sibling, but as we move into the second and third areas, we hit a short period of stutter followed by sustained, lower frame-rates.And what we find here is that the RX 470 - demonstrably the weaker card when VRAM is not being tested - actually moves into the lead during the majority of the bench, and it seems that it's just about capable of housing the required texture data without dropping performance. Of course, it's just a limited set of data on a test that the developers specifically recommends we don't run. But the point is that we can demonstrate that there are some applications where four gigs at 1080p is indeed better than three - even factoring in Nvidia's superior memory compression technology.Bearing in mind that the GTX 1060 3GB supplied by MSI already has an 88MHz factory overclock in place, hopes weren't high that we could push this card much further. After all, it boosts to 2GHz out of the box (!) when set to OC mode. However, we were wrong. Pushing up power to max and adding 190MHz to the core, we could hit a remarkable 2.19GHz - rock-solid on our Crysis 3 stress-test, but buckling as soon as we hit 2.2GHz. These are the highest core clocks we've ever seen from any Pascal chip, but unfortunately our surprise was short-lived - Ashes of the Singularity wasn't stable at all, and we had to drop down to 140MHz. However, this is still on top of the factory OC and a remarkable result overall. The GDDR5 RAM handled a +450MHz offset, bringing up up to 8.9GHz effective. Again, that's not bad.Re-benching a few titles, the impact of the overclock becomes clear - we're looking at a 12 per cent increase in performance over the GTX 1060's stock configuration, dropping to eight per cent when compared to the factory OC we have with the MSI Gaming X's set-up. This isn't exactly a revelatory increase overall - the days of 20 per cent overclocks with the last-gen 900-series Maxwell cards are clearly over. However, it is enough to push the cut-down GP106 clear of the fully enabled version when we're not limited by VRAM.Power consumption from Pascal continues to be highly impressive. Perhaps not surprisingly, the MSI card - with its custom PCB and factory overclock - managed to consume a touch more power than the standard Founders Edition 6GB version, but we're still looking at an extremely creditable result overall at 234W. What's remarkable here are the thermals. Even when we had the MSI model running at 2.19GHz, the core hit a maximum of just 67 degrees Celsius. This is way, way better than the six gig Founders Edition we have and based on our much better overclock and lower temps, we reckon that the six gig MSI version could be rather impressive.Going back to our GTX 1080 review, we were pleasantly surprised to see how well the old GTX 780 Ti held up on our modern benchmarking suite bearing in mind its 3GB of VRAM. The new GTX 1060 3GB has the same amount of memory but an additional two generation's worth of memory compression optimisations - the end result is that three gigs is indeed enough for top-tier 1080p60 gameplay - as long as you stay away from memory hogs like MSAA (which tends to kill frame-rate) along with 'HQ/HD' texture packs and extreme resolution texture options. By and large, the visual impact of these options at 1080p is rather limited anyway - generally speaking, they're designed for 4K screens.That said, as good as Nvidia's compression technology is, it is lossless in nature, meaning that its effectiveness won't just change on a title by title basis, but at a per-scene level too, according to the content. And with the Hitman benchmark suggesting that even at 1080p, we might be hitting the three gig limit and seeing an additional hit to performance not caused by the reduced CUDA core count, we do have to wonder about the level of future-proofing this cut-down GTX 1060 has. The visual improvement found in super high resolution texture packs may be limited, but we certainly wouldn't want to drop down to medium quality artwork on future titles in order to sustain the expected level of performance.In the here and now, the three gig GTX 1060 is a good card with excellent performance at its £189/$199 price-point, but its VRAM allocation may well hit its limits more quickly than the four gigs found in the AMD RX 470 and its successor. None of the new wave of sub-£200/$200 graphics cards should be entirely ruled out, and this pared back GTX 1060 still packs plenty of punch - but investing just a little extra in the GTX 1060 6GB would be our recommendation. With certain six gig versions retailing under the initial suggested price-point, grabbing the more capable model needn't break the bank."}