{"ref": "https://www.eurogamer.net/age-of-empires-iii-the-asian-dynasties-review", "date": "31 Oct 2007", "game_name": "Age of Empires III: The Asian Dynasties", "text": "Having a third-party developer make the expansion pack for another team's latest magnum opus is hardly an uncommon occurrence. It's an odd practice, but I can understand the thinking behind it - ~we spent all this time making this game; can't we just sit back and enjoy the big pots of cash for a while? Hey you, here's a biscuit - go make me some levels.~ It's rare that such cases suffer the complete quality breakdown of the direct-to-DVD movie sequel, enthusiastically but cluelessly directed by the original's lead stunt guy or chief tealady, but it's really rare to call in another superstar developer to do the money mop-up the first guys can't be bothered with. To continue the movie analogy, Big Huge Games (Rise of Nations/Legends) stepping in to handle this latest expansion for Ensemble Studio's long run of Age of Empires games is like James Cameron directing the sequel to Ridley Scott's Alien. And like Aliens was to Alien, this is flashier and lighter - almost a different prospect entirely.Except, of course, Age of Empires III wasn't anything like as smart and experimental as Alien. It's the least interesting of the AOE series, playing things far too safe and making some really dubious font choices to boot. It's got its crazy, angrily defensive fans, but for all their efforts it hasn't managed the mainstream breakthrough AOE2 did. So maybe that's why the big name studio's been called in.It works. There's something immediately far fresher about the Asian Dynasties than either AOE3 or its first expansion, The WarChiefs. It looks great (those nasty fonts aside), remarkably vibrant, but carefully exaggerating its architecture and colours just enough to ensure some sense of authenticity remains alongside the tooniness. Its colourful trio of Japanese, Chinese and Indian factions are a far cry from the muted brickwork of the original's European forces. I dunno about the mysteries of the East, but their equivalent of Homebase certainly has a better paint selection than ours.They play different but the same - familiar to AOE convention but with some genuinely interesting tweaks. Mercifully, there's none of The WarChiefs' comical screwing around here - buffing fighters' combat skills by having villagers dance around a fire-pit on the other side of the map, or hypnotising bears on the field felt at pantomime odds with AOE. We're back to sensible harvest/construct/fight mechanics here, with the possible exception of the oddball Indian Sacred Cow field, which chucks out experience per idling bovine. The big difference between the Asians and the Europeans is that stepping up to another Age (unlocking another level of the tech tree) doesn't involve upgrading the town centre. Instead, they build Wonders, which is one of the more obvious hints that Big Huge's Brian Reynolds, formerly one of the chaps behind Civilization, has his hand quietly on the wheel here. The Wonders are far more engaging than just waiting until you've got enough resources and then clicking on a button to beef up the town centre. You get to choose where they're placed; they're towering, ornate constructs that add extra visual character to your settlements; and, because you've got to task a few of your villagers with constructing it, there's a real sense of event to it. You can see it gradually being built, and once it is it's an eye-catching tribute to your awesomeness. Or to your ability to make tiny men chop down trees, depending on how you look at things.Most importantly, you get to choose from a selection of Wonders (six per faction), each of which come bearing passive or active bonuses. The Chinese Confucian Academy slowly produces free artillery pieces, Japan's Great Buddha temporarily shows you what your enemies can see, and the Indian Taj Mahal can intermittently force a brief ceasefire. This last can be a hilarious annoyance, rendering the giant, angry enemy squad that's just turned up in your base unable to do anything but stand around, while you cheerfully roll over some reinforcements. Other Wonders increase resource trickle or provide buffs, so choosing which you're going to build and when adds an extra layer of gentle tactics to the game. And fun - being that much more engaged with the tech tree strips away more of AOE3's coldness.There's a slew of other tweaks and abilities that set the Asian Dynasties apart from the Euro bores, but hell, there's a perfectly good Wikipedia page about this expansion if you just want a list of them. What's important is that they add up to sides that are way more entertaining to control than the vanilla factions, but without resorting to the jarring wackiness of The WarChiefs' Native Americans. This is the expansion that AOE3 needed, one that makes a wilting game feel fun and contemporary.The single-player campaigns are interesting, too. There's one for each of the new factions, and though the storytelling suffers from exactly the same confusion, tedium, charmless heroes and puppet-like animations of AOE3 and The WarChiefs, a lot of effort's been made to make each mission feel vaguely novel. There are a lot of high concept levels that may use familiar themes - defending a castle, using a cave system to stealth past enemy patrols - but mix stuff up enough to make the campaigns moreish and motivating, rather than just grinding through a series of escalating battles. Be warned they're pretty challenging, though - the Asian Dynasties expects a reasonable degree of familiarity with AOE3, so doesn't present a particularly easy time of things for newbies (unless they play on, uh, Easy, which feels so obviously softened that it's hard to take much satisfaction from it). It's a good kind of challenging, though - genuine challenge, not simply overwhelming odds. Again, the narratives really are lame, though, spamming far too many uninteresting cut-scenes at you and failing to grant much sense of accomplishment. It's great that the single-play isn't just a token add-on to some new factions for multiplayer, but tragic that there's been very little done to make you care about why you're fighting.Unfortunately, AOE3's ship has sailed for most folks, and this just isn't exciting enough to quite justify also splashing out on the original game if you don't already own it. If The Asian Dynasties had taken a leaf from THQ's current clever Big Book O' RTS Marketing, it would be standalone (as demonstrated with Company of Heroes, Dawn of War and Supreme Commander) and not an add-on. I know it's unfair to expect a publisher to copy another (although hell, they do that all the time anyway), but we're now reaching the point where an expansion disc feels a bit Dark Ages. It's a barrier to new players, and especially a shame when, like this, the add-on makes a pretty good game, because most people simply won't see it.So, without doubt a must-have for the fans, but anyone with just a passing interest is probably best off waiting for the inevitable Age of Empires III Gold budget collection. That said, in the current fairly quiet RTS times (there's not a lot going on other than the upcoming Supreme Commander: Forged Alliance at the moment) it's worth a look if you're not sure what else to play. Big Huge Games has artfully awoken an RTS in danger of slipping into a coma with a hypo full of big, huge fun."}