{"ref": "https://www.eurogamer.net/the-simpsons-game-review", "date": "31 Oct 2007", "game_name": "The Simpsons Game", "text": "Given that The Simpsons has been on TV for longer than most of the TV channels that show it, you could forgive EA for pillaging the existing scripts and building another dull, 5-million-selling platform game to fit. Fortunately they haven't done that. Instead, they've come up with new scenarios, recorded tons of new dialogue and proper animated sequences, and, er, built another dull, 5-million-selling platform game to fit.Split into 16 episodes - self-contained stories bound by their mutual desire to send up videogames - what we have here is a third-person platform game full of simple combat and puzzles, most of which is defensibly average, potentially stabilised by a lot of good jokes and the occasional moment of mild inspiration. The Simpsons have discovered that they are in a game, and have special powers to match, and each has different ideas about how to put them to use.As with the show, Homer's the star - he can burp people to death and transform into Homerball to bowl them out of the way, and gets most of the best gags. Bart can fire his slingshot, or turn into Bartman and hover across gaps; Lisa can stun enemies with her saxophone, or use Buddha statues to assume an aerial view of the level and deploy a hand-of-God UFO-Catcher to move things around; and Marge can use a megaphone to rally NPCs to help her, or shove Maggie into vents where she can pull switches and uncover collectibles. All that in addition to the usual button-mashing punch attack.Each of the four-and-a-half Simpsons keeps their special abilities fuelled by boffing enemies and gathering pick-ups, and each can take advantage of a special temporary power-up to become super-strong and invincible. Homer, again, gets the best - a fabled chilli that turns him into a swollen blob of red rolling death. Each level is played by two Simpsons at once - you can either switch between them using the d-pad, or a second player can jump in at any time - and in between bashing things, you're expected to draw upon their diverse characteristics to solve minor puzzles - often in collaboration. Solutions are completely prescribed, but reasonably varied.For example, if Lenny and Carl are about to be minced by Monty Burns' logging machine, Lisa needs to use her Buddha-backed levitation ability to rearrange some nearby pipes so that gusts of air can carry a floating Bartman up to an elevated lever, which then opens the way for Lisa so she can free everyone's favourite comedy duo. Elsewhere, Marge orders her mob to build a platform for Lisa to climb, and Homer weighs down one end of a giant dinosaur skeleton so that Bart can jump from high enough to float down to the next room.Each level is built around a particular theme, with numerous pleasing touches and references to soak up as you play. Asked to rescue Professor Frink from Donkey Kong on a videogame production line (~His touches are unwelcome!~), you'll spot a downcast Mario trudging along in a hamster wheel (~I haven't seen a mushroom for days~), or chuckle your way through the marketing zone (~You can do anything! But you won't~), and there are plenty of interactive elements to match, including nods to Space Invaders and Frogger. You also get to enjoy ongoing gags about Grand Theft Scratchy, despite Rockstar throwing a hissy-fit, and the associated level stands up as a decent joke with a splendid punchline.The Simpsons is also aware of its own shortcomings - and keen to highlight them - allowing you to ~collect~ clichés like invisible walls and crates. Sadly though, by the time Bart wanders through the videogame machine muttering, ~With all this equipment, you'd think games would be better,~ you'll probably agree for all the wrong reasons. There are 31 irritating clichés to collect in all, but that total is well short of the number you'll actually encounter. There's no acknowledgement of having to wait for one Simpson's lever-pulling animation to complete before switching characters, or of the disappointing camera, which starts off facing the wrong way in the tutorial before embarking on a 16-level tour of all the dizzying mistakes a third-person viewfinder can make.Nor does the game acknowledge some of its other, sillier mistakes, like hiding one of Homer's collectibles (a Duff bottle cap) behind a layer of cake, tweaking your gamer senses such that you'll waste time traipsing around each of the others on the off-chance that there's another (there isn't). That's on the tutorial level, too, for the record - shooting yourself in the foot at that point might be Simpsons-esque, but it doesn't amount to good game design. The difficulty, overall, is that sustained satire needs to be largely infallible to function as intended. If not, it becomes a touch hypocritical, and The Simpsons veers that way a few too many times for my liking, telegraphing a few too many puzzle solutions and generally dumbing itself down and settling into the sort of off-puttingly repetitive patterns it is otherwise racing to mock.There's also the absence of online play to argue about, although I'm inclined to side with EA on this one: it works best if you're sat in the same room, sharing the experience. Some will also criticise the visuals, which - outside the cartoon sequences - don't really do the source material justice, even in HD, but they are reasonable alternatives, and certainly the best a Simpsons game has ever managed to look without relying on the fuzz of a rubbish display to mask its shortcomings.The big debate will be how far the (largely excellent) writing and performances of the main characters, not to mention the satisfyingly gorgeous animated sequences custom-built for the game, go towards balancing out its real shortcomings. There's certainly a lot of good material in here. I can't remember the last game that made me laugh within five seconds of turning it on, but ~Achievement Unlocked: Press START to Play~ managed it, and some of the voice-over gags for Burns/Kang-Kodos/Duffman/etc would probably satisfy the TV show's famously democratic writing table enough to make their way into the real thing. I don't think it's going too far to say I liked some of this more than the film, and it's nice to see EA actually laughing at itself, too.On that basis, then, the developers deserve a lot of credit for getting all the best Simpsons people involved with the game. For me though, the humour can only carry it so far. If you want a videogame platformer to make you and a friend laugh, you'd be better off playing Lego Star Wars. If you want to enjoy The Simpsons, you're better off buying one of the box-sets. Seasons 3 and 4 are almost completely brilliant, and you could buy either of them new for the price of the game, and probably pick up both of them second-hand for less. Easiest. Conclusion. Ever.The Simpsons Game is due out on 2nd November on Xbox 360, PS2, Wii and DS. (Editor's note: We previously reported that ~Grand Theft Scratchy~ elements had been removed. This was relayed in good faith, but turned out to be wrong.)"}