{"ref": "https://www.eurogamer.net/playstation-eye-roundup-review", "date": "30 Oct 2007", "game_name": "Reviews", "text": "The success of EyeToy was undeniably one of the factors that kept the PS2 ticking long after its peers had slunk away to the hardware graveyard, so you can hardly blame Sony for introducing the next generation PlayStation camera package early in the PS3 life-cycle. Launching it with a collectible card game, however, seems like an odd option, such things not being famous for their cross-generational appeal, and the first two downloadable PlayStation Eye offerings don't exactly scream mainstream either.Now, neither Mesmerize or Tori Emaki are really games in any meaningful sense of the word, so there won't be a score to pick apart at the end. Rather, this is a look at how Sony are supporting the Eye and what you can expect to be able to do with it over the next month or so.This chilled-out collection of interactive visual effects is a fun way to show off the PlayStation Eye, although the only people likely to gain long-term amusement from it are those glued to the sofa at 3am, spannered off their gourd on drug flutes.You'll be able to download new effect suites, and add or delete them from the front menu according to taste. According to the disc, I've been playing with the Distort and Trace packs, which between them offer ten different effects. Once an effect has been chosen, your movements are translated on screen accordingly. You can opt for a black background, or a live camera feed so you can see yourself gurning behind the swirling shapes and colours.Urban, for instance, gives you wireframe skyscrapers and roads that spring to life in the wake of your movements. Wave your hand over objects that have already been created and they'll become brighter and more active - a feature that is common to many of the effects. Twister has you swirling both hands to create twin neon trails, which you can bring together by making a loud noise. Again, several other effects use this ~loud noise~ notion, presumably to remind people that the PlayStation Eye features a microphone as well as a camera. In practice, it feels a bit random, while the concept of making people shout rather contradicts the ambient mood being created.It's all achingly stylish, and more than a little pretentious (you don't Quit, you Exit The Experience), but it's hard to imagine many families gathering around the telly to play at being hopeless acid casualties, while adults will soon grow tired of the repetitive ~make glowy shapes~ formula. The fact that you can't combine the visuals with your own music collection also seems like an opportunity missed, especially if Sony wants to keep pushing the PS3 as an all-round media hub.This offering is much more beautiful than Mesmerize, co-opting the Japanese art style of Okami, though its longevity is even more open to question. Basically, you guide a flock of birds through a painted landscape by making them follow a floating globe, which mirrors your hand movements. Guiding them past certain elemental scenery items - such as a volcano - triggers appropriate visual accompaniment. And when I say ~basically~, I really mean it, since that's all you do. If you stop moving, the birds land and have a rest.It's all very lovely, billed as an ~Interactive Art Experience~ no less, and will no doubt look simply super if you want to impress visitors to your loft apartment with your bold lifestyle fusion of high technology and ethnic arts, but it's hard to see what purpose it serves beyond giving you something to do with the camera.As demonstrations of the EyeToy technology, both Mesmerize and Tori Emaki are successful enough, even though they don't really do anything that wasn't possible on the PS2 and certainly don't showcase much in the way of the new camera's gameplay potential. At just GBP 1.99 (EUR 2.99), they're certainly worth a try if you're so inclined - after all, people spend more than that to download tiny photos for their phone screen, and these will at least keep you entertained should you drink too much cough syrup."}