{"ref": "https://www.eurogamer.net/uridium-review", "date": "29 Oct 2007", "game_name": "Uridium", "text": "After about forty five minutes, my best friend Marc put down his controller in disgust. ~This isn't a game,~ he raged. ~This is an assassination!~This seemed like a fair assessment. Back in 1986, he and I had been hacking away at the first level of Uridium for nearly an hour, only to become a little too familiar with the explosion animation. Space mines spawned below us, incinerating us immediately. If we took our time, fighters would vaporize us before we realized they were even a threat. If we sped through a level, there was no shortage of objects to collide with. We were teens that were groomed in the arcades to expect something entirely different than what Uridium offered, and our gameplay suffered for it. Marc insisted that we play something else. I agreed, only to return to Uridium once he'd left. I'm not quite sure what drew me back to the game so quickly - I'd reached my maximum frustration level sooner than Marc had. Admittedly, the game was beautiful and well polished (especially for the Commodore 64 in 1986) but my attraction to the game went well beyond that. Uridium had a whole new ~rhythm~ to master and a fresh atmosphere to savour compared to its coin-operated brethren. It was exactly what I thought an intergalactic conflict should look like, and it sounded like a space battle should sound (noiseless vacuum notwithstanding). And deep down, I knew the designer didn't create his game to frustrate the player; I just had to approach it a little differently.I found that in order to be successful at Uridium, I needed to unlearn what I'd been taught by the coin munching arcade machines. I had to discover when to fight, when to run, and how to balance speed with patience. In fact, I had to rebuild my shoot-em-up skill set from the bottom up. While I never managed to actually finish the game, my triumphs over the first six levels were a fine personal achievement. Among many Commodore 64 gamers, Uridium is remembered as a prime example of a shoot-em-up done right. But make no mistake-Uridium has a fairly steep learning curve. Unlike other games in this genre, the introductory level is very demanding of a rookie player. But while tough, this ~adapt or die~ approach functions well to prepare the player for the challenges of later levels. On top of this, the bonus ship score is set relatively low- a mere 10,000 points will earn another Manta ship for your arsenal which offsets the difficulty quite a bit.However, the levels are cursed with a certain degree of being too samey. While the random attack formations of the fighters and the slight colour differences change from level to level, the variations are such that the player might experience a distinct feeling of déjà vu. The true ramp of difficulty lies within the layout of the Dreadnaught itself, as the enemy attack craft never seem to get smarter or tougher- the player only has more things to crash into.But the real challenge of the game isn't so much the strategy of navigating the Dreadnaughts or blasting the enemy vessels, but controlling the player's ship. The directional changes of the craft are not done in an instant, but are subject to inertia. The Manta slows down, flips around and then continues in the opposite direction. To the uninitiated, the time it takes to turn the ship around (especially while zipping towards an obstacle at a high rate of speed) can be particularly daunting and frustrating.As a gamer of some thirty years, it can be a little difficult to look at the aesthetics of such a classic game critically and unbiased. It's a little too easy to look at a 21-year old game through a prism of all of the shoot-em-ups that have come after it and nitpick the features that were done ~wrong~. For example, while the player's Manta craft is animated beautifully, the enemy ships are not animated much at all. Aside from drifting to and fro in their attack patterns, the enemy craft are simple static sprites that fire an occasional projectile at the player. 21-years ago, this wasn't a particularly big deal, but through modern eyes, I believe it detracts from the overall feel of the game.A few months back, I brought home a Commodore DTV that featured Uridium. My children were in awe of the DTV, and even danced around to the music on the menu screen. For this review, I asked them to spend some time with the game and tell us all what they thought of it. After finding every possible way to destroy their ship on the first level, they switched the DTV off. Their review was quite simplistic:~It's hard,~ they said.Marc would agree."}