{"ref": "https://www.eurogamer.net/r-gyruss-360", "date": "29 Oct 2007", "game_name": "Gyruss", "text": "Some of the most renowned old games ever have a terrible knack of ageing horribly. Take Gyruss.  By virtue of the fact that it was created by Yoshiki 'Street Fighter 2/Final Fight' Okamoto in 1983, it appears to have been granted a disproportionate level of historical interest, despite not actually being anything special in its own right. It's yet another luke warm addition to Microsoft's downloadable games service, and one that sure to beg the question: why are they bothering with  crap that wasn't even that interesting at the time?Take away the fact that one of the true gaming luminaries was responsible for it, and it all starts to get a bit dull. Slightly uncharitably, but with complete accuracy, you could describe Gyruss as a classic 'cut-and-shut' shoot 'em up. It takes the swooping wave-based attack runs of Galaga, and the  'tube shooter' gameplay of Tempest and fails to come even close to matching the pure thrills of either.At the start of each level, enemies (spaceships mainly) swoop round the perimeter, giving you an opportunity to snag them early before they descend down the 'tube' and settle into formation. With repeat play you can start to memorise where they appear from, and clear wave upon wave before they've even had a chance to start firing things back up at you. Eventually, the stragglers start to work their way back up, and you get a chance to blast a trio of 'satellites' that award you with points bonuses and a weapons upgrade - just the one, mind. This was 1983, remember, when just one 'power-up' was pretty much the rule across the arcade scene.With a bit of extra fire power, taking care of the swooping, circling waves of enemies is slightly easier than usual, and the arrival of a bonus stage (again, very Galaga) after every third stage definitely benefits from the beefier laser. But with progress comes more hazards, with ships more inclined to stray into your path around the perimeter, or fire back. Eventually, you'll be dodging between asteroids and dancing gingerly between fast-moving projectiles as you cling on for dear life to your tiny stock of ships. As was the law back then, one hit death mechanics made for profitable arcade games, but short-lived entertainment for all but the bug-eyed twitch gaming ninjas who could afford to sink endless loose change into their greedy innards. Freed up from such constraints, and 24 years down the line, there's neither the incentive nor the tension to repeatedly come back for more. In the space of half an hour you'll have played it more times than anyone could reasonably expect you to, and gleaned any residual entertainment that might come from revisiting a part of the past you might not be too familiar with. As with all of Konami's XBLA releases to date, the usual raft of fairly meaningless 'enhancements' are stamped on the package rather lovelessly by retro stalwarts Digital Eclipse. Graphically, there's a cursory attempt at sharpening the sprites up a notch, but the extra jazz applied to the explosions merely serves to inadvertently make it harder to see what's going on. On the latter stages, the blizzard of explosions makes it pretty much a lottery as to whether you survive or not, so switching the graphics to 'original' becomes a necessity quite quickly. And on a point of preference, the original audio style suits the old school gameplay far better than the dreadfully re-jigged version used here, and fortunately you can switch that over and banish the, er, future to the past. Little known fact, fiends, but Gyruss was apparently the first game to ever feature stereo sound. Imagine that. Toccata and Fugue in D Minor in Stereophonic sound. The mind boggles.Elsewhere, there's the usual attempt to utilise Xbox Live with co-op score attack modes as well as competitive if that's your idea of retro dreamery. In reality, it works fine, with each of the vertically aligned screens stacked next to one another (how this works on 4:3 sets we're not exactly sure), but as a contest, it doesn't exactly lend itself to Live play. The usual plethora of online Leaderboards give you the chance to lord it over your buddy list, but that's only really of use if you hang out with the kind of people that actually care about third rate shooters from 1983. Still, it's there at least. And finally, there's the usual set of hard-to-attain achievements, with a fairly stingy roster of off-limits requirements, such as winning 50 online matches. Even playing that many matches would be a feat in itself, while reaching the latter levels in the single player game would take an awesome degree of painstaking repeat play. And unlike the Namco retro efforts, there's not even the opportunity to grind your way through them by continuing from the last level you got to. It's simply a case of starting from scratch every single time. Boo.So that's Gyruss. A popular shooter of its time, but not one that warrants a place among the classics, and certainly doesn't justify the 400 points required to purchase it. The best thing you can say about it is that it's a pixel perfect conversion, and one that will sate the needs of those that pumped their loose change into it back in the day. Anyone else who's merely curious to find out what Yoshiki Okamoto's early work was like should check out the free trial and swiftly move on."}