{"ref": "https://www.eurogamer.net/mario-rabbids-kingdom-battle-donkey-kong-adventure-review-a-generous-grin-inducing-expansion", "date": "28 Jun 2018", "game_name": "Mario + Rabbids: Kingdom Battle", "text": "So often DLC can feel a little forced, but every once in a while there comes something with a real sense of mischief - an expansion showing you that not only does the developer know why the initial release was a success, but that they aren't afraid to get really weird with the next instalment. By reflecting and riffing on the core experience, these bits of DLC elevate the base game while reminding players what made it great in the first place. The Witcher 3: Blood and Wine is a great example, and so too is Mario + Rabbids Kingdom Battle: Donkey Kong Adventure. Donkey Kong Adventure is a substantial piece of DLC, but it's also one that knows its limits - it doesn't dawdle in getting straight to the action, nor does it waste any time with filler dialogue or half-hearted jokes. The writing is razor sharp, as you might expect, but it also has a real sense of pace to it - as though it's trying to cram the same number of memorable moments into an experience that, by its very nature, is destined to be shorter than than the core game. The main premise of Donkey Kong Adventure involves inter-dimensional travel through the medium of a wildly malfunctioning washing machine and quite frankly the word count on this review is too small for me to delve into the whys and wherefores on that one, but suffice it to say that the DLC transports you (and Rabbid Peach) to an entirely new region - namely the homestead of Donkey Kong himself. DK is flanked in this adventure by Rabbid Cranky, a curmudgeonly twist on an already cantankerous character, and both breathe new life into Mario + Rabbids not just with their personalities, but with their playstyles. As a team member, Donkey Kong takes the established rules of Kingdom Battle and tears them in half. With the aid of a series of carefully placed vines (denoted by special DK platforms), he can swing across the map and cover an astonishing amount of ground in one go. Add to this his ability to pick up any character, be they friend or foe (but not, it should be said, a boss) and toss them yet further at the end of his movement phase, and he has the capability to hugely disrupt enemy lines or punt an ally into a previously unreachable spot on the map. Oh, he can also grab bits of cover (even the status effect ones) and chuck those about, if that's more your thing. Either way, with a whacking great health pool and some tremendously fun offensive abilities, DK is the tactical crux throughout this DLC. Strange as a whacking great gorilla covering more ground than any other Mario + Rabbids character sounds, however, Donkey Kong has nothing on his grumpy elder Rabbid Cranky who, without exaggeration, might just be the perfect assault character. Not only does he have a weaponised walking stick that works both as a shotgun and a grenade launcher, but he deals respectable area of effect damage whenever DK lobs him across the battleground. He also boasts a special ability called Long Story that puts all nearby enemy characters to sleep for a turn. Donkey Kong Adventure emphasises character synergy in a way we haven't really seen before. DK can charge across the map with Rabbid Cranky tucked under his arm like a newspaper, only to have the old codger pop out and deal a surprising amount of damage before putting everyone down for a quick nap. It's tightly orchestrated stuff that's immensely satisfying to play around with. Where there are new player characters, of course, so Donkey Kong Adventure also offers up new enemy types and new mission types. These are all welcome additions not only for the sake of variety, but for balance - with such powerful new squadmates, it's actually a relief to see enemies designed around negating those newfound strengths. One such enemy will constantly flee the player characters (while hoarding an objective), for example, while another enemy lugs an enormous shield around with them, negating all damage done by any means other than a good old fashioned flank. These innovations are all extremely good fun to play around with, and thankfully they don't stop with the turn-based combat. The game's overworld is typically gorgeous, for one thing, but it also boasts some really pleasing riffs on classic Donkey Kong tunes and environments. The puzzles on offer are more substantial than previously seen, making the traversal between combat encounters considerably more rewarding. There are also toucans that warble along to the music, for crying out loud. There's an awful lot in Donkey Kong Adventure that helps to freshen the experience, in other words, but the real delight comes not only from the new area and the satisfying puzzles or the dazzling combat innovations, but in the fact that every last bit of it is delightfully, determinedly silly. If Mario + Rabbids: Kingdom Battle was the brainchild of a man who couldn't hold back the tears when his game was announced at E3 2017, then Donkey Kong Adventure is the product of a man who knows and relishes in how well liked his child really is."}