{"ref": "https://www.eurogamer.net/lords-of-midnight-review", "date": "29 Oct 2007", "game_name": "Lords of Midnight", "text": "The thing everybody remembers about Lords of Midnight is the scale it managed to evoke. Placing the fate of an entire realm in the hands of the player, Mike Singleton's gigantic roleplaying-strategy-wargame-adventure hybrid unfolded across 4,000 locations and featured scores of characters - all controlled through keyboard shortcuts. Beginning with four absurdly named champions (Luxor the Moonprince, Morkin the Moonsprog, Rorthron the Wise and Corleth the Fey), further Lords had to be swiftly united under your banner lest the hordes of bad-geezer Doomdark engulf the world.Going by the rather nifty title of Witchking of Midnight, Doomdark has unleashed a wave of cold (handy for coding purposes, because it means everything is white), and only the Free Lands can prevent perpetual winter. Should they falter, one hope remains; if Morkin can destroy Doomdark's favourite ice-crown, the sorcerer will pack in the invasion plans in a huff and go sulk in a cold corner.So far, so Lord of the Rings. Indeed, this title made no secret of reimagining the vast scope of Tolkien's novels. Like those books, players would either dismiss the fantasy piffle or become utterly engrossed by it. Given little more than a short back story and the controls, would-be heroes were thrust into the game with no other help. This sink-or-swim approach was brutal, but cemented the feel of a bewildered group of defenders against an army of darkness. As forces clash upon the plains, the player has the freedom to do as he pleases; seeking allies, exploring the realm or simply dispatching packs of pesky wolves and trolls.Although daunting at first, pursuing the (extremely difficult) quest without restraint is highly liberating. The lack of any linear structure ensures patience and dedication are required in amounts as sizeable as the map itself, but it's easy to see why Lords of Midnight remains a cult favourite."}