{"ref": "https://www.eurogamer.net/swat-target-liberty-review", "date": "29 Oct 2007", "game_name": "SWAT: Target Liberty", "text": "Did you know that as well as a games, music and pointless-format movie player, the PSP also works as a time machine? Or so it seems when you're playing SWAT: Team Liberty. Boot up this game and you too can journey back, way back, to a time when it was okay for videogame characters to be implausibly stupid, capable of saying only three different things, and called names like Kurt Wolfe. Unfortunately it's 2007, and these sorts of things are not okay any more, and SWAT: Team Liberty is not much fun at all. You'll probably be familiar with the SWAT games as a series of PC first-person shooters. The first PSP instalment, however, is a tactical squad-based game with a top-down perspective. It stars the aforementioned Kurt Wolfe, who becomes embroiled in some rubbishy old plot about Korean gangsters and nuclear weapons. This is explained via sub-PSone cut-scenes featuring characters who talk without opening their mouths. At least you can skip them.Kurt is accompanied on his adventures by a couple of team-mates. They have nicknames like Python and Hollywood, and specialist skills like interrogation, intimidation and observation. At the start of each mission you can choose which SWAT operatives make up the team, according to what skills will be needed and your particular approach to defeating the Korean gangster-related nuclear threat. That's the theory, anyway. In practice it doesn't seem to make much difference which men you pick. Or which weapons you equip them with. Or which of their skills you choose to build up, using the experience points you earn for subduing rather than shooting enemies. Regardless of the decisions you make, all the levels tend to play out the same way.They go a little something like this. You lead the way through interminably grey environments, frustrated by the fact that even when ~running~ Kurt moves at an extremely slow pace. As do your team-mates. They're easily distracted and sometimes, when there's been a bit of action, they'll forget to follow you. You'll need to press the square button to make them ~fall in~, and they'll respond with one of three stock responses about having your ~back~. Then you'll need to wait while they wander, extremely slowly, to your position. As you and the team amble about you'll come across enemies to try to subdue or shoot. Subduing is preferable if you care about experience points. You won't. It has they advantage of allowing you to interrogate suspects so they give you useful information. They won't. They'll just say things like, ~The Gangpeh are a joke and will never command the same respect that we have.~ Righto. It's altogether less tedious to take the shooty approach, despite a confusing context-sensitive targeting system. You can switch between enemies by holding down L and pressing the various shape buttons. This is fiddly when you're being fired at though, and you'll most likely end up blamming away wildly while your team-mates, who are decent marksmen, do most of the work. In fact you can make your team-mates do most of the work most of the time, if you feel like it. In the tutorial, there's a load of gubbins about entering rooms with caution and looking under doors with mirrors and using flash grenades to confuse enemies and so on. In-game, it's often easier just to open a door and send your pals in to sort things out while you retreat to safety. You can get quite far in the earlier levels simply by walking on through room after room, leaving the rest of the squad to follow you and take out gangsters in your wake. It helps that enemies are spectacularly stupid and won't see you until you're just feet away or, in some cases, won't start shooting till you've walked past them. A pattern quickly emerges: enter room, shoot things, restrain any surviving baddies, continue to next room, repeat. The whole squad-based thing doesn't work very well, and not just because your squad will often hang around having a lovely chat instead of keeping up with you. Your team-mates are good at shooting people, but they'll do this without you having to tell them to anyway. You can get them to restrain or interrogate suspects for you, but commands are context-sensitive so you have to be next to the suspect to issue the order; if you want something doing you might as well do it yourself.The game doesn't look too good either. Everything is so grey you wonder if they're trying to start a new trend and whether brown videogames will be a thing of the past come spring Y2K8. You and your SWAT pals are also grey, and far too tiny. It all feels like you're manouevring a team of very slow, armed ants across a series of car parks. In short, there's not much to like about SWAT: Target Liberty. The squad-based mechanic is imbalanced. The levelling-up and weapon selection systems don't have significant effects on how things play out. The plot is silly, the cut-scenes are rubbish and everything's so small it makes your eyes hurt. Unless you live in 1992, this game is highly likely to disappoint."}