{"ref": "https://www.eurogamer.net/california-games-review", "date": "27 Oct 2007", "game_name": "California Games", "text": "Haven't we included enough Epyx sports games in our C64 selection? Clearly not if California Games isn't in there. Imagine the uproar. ~You missed off the best game in the series, you morons!~ Someone call the ROLFcopter.So, was it really the best in the series? That's a matter of opinion, obviously, but it's certainly a strong contender for the most fondly remembered in Epyx's canon in my anecdotal straw poll of random old gaming farts over the past 20 years. Scientific? No. On the money? I'd say so.Having spanned the globe's quirky sporting favourites in World Games, we were now treated to an even more 'out-there' selection of daft events, which were as bizarre as they were fun. Scooping a coveted Zzap Gold Medal in September of 1988, it marked the end of an era at Epyx, with personnel changes sending the firm falling from grace with alarming speed.At the time, though, events like Footbag demonstrated Epyx at its best, capable of coming up with dexterous gaming experiences quite distinct from anything else - and so far ahead of their imitators it was comical. Playing events like Surfing and Half-Pipe make you realise where a lot of the extreme sports games control ideas first appeared, while even the more normal sounding events like Flying Disk (think Frisbee), BMX Bike Racing and Roller Skating have such an effortless wit and charm about them, you want to play them over and over again. We could spend ages describing the play mechanics, but the best thing is to just try them for yourself. They're still amazing fun to play today, especially in multiplayer.As you'd expect from Epyx, California Games is a technical showcase for the C64. Perhaps unsurprisingly for a game which came out right at the very peak of the C64 era, it boasts absolutely top-drawer animation, a wonderfully slick visual style, and the usual array of hummable ditties that stick with you for life. But as with all Epyx's 'Games' titles, it really is best played on disk if you can hunt it down, especially with custom tournaments in mind an saving those all-important high scores.To paraphrase Brian Wilson, I wish they all could be California Games..."}