{"ref": "https://www.eurogamer.net/the-great-giana-sisters-review", "date": "26 Oct 2007", "game_name": "The Great Giana Sisters", "text": "If the 'Super' Mario Brothers were ever to stop sodding about chasing after Princess Peach and get themselves girlfriends, they'd almost certainly be called Giana and Maria: The Great Giana Sisters.But back in the summer of 1988, Nintendo wasn't amused at the idea, and when Rainbow Arts published a spot-on riff of the Big N's popular NES platformer on the C64, the legal eagles flexed their considerable legal muscles and forced this 96 % scoring game off retail shelves within days of its release. It might have denied the vast C64 audience the chance to play arguably one of the best games ever made for the system in the short-term, but via piracy and emulation, this notorious title built up a huge following and was widely regarded as an all-time cult classic. Nevertheless, anyone who bagged an original copy is now holding onto a seriously valuable retro treasure.As for the game itself...Time Warp really did do an amazing job of replicating Miyamoto's efforts. Kicking off in a world 'inspired' almost room for room by SMB, the premise was the same, the power-ups identical, as were most of the enemies - it even matched the colour palette closely, and had the same bonus blocks and treasure rooms. Almost everything was so closely based on SMB there was no room for doubt about what they were trying to achieve. Amusingly, a determined hacker even replaced all the game's sprites with ones that match the NES original and released it into the usual channels - not that Nintendo could exactly do anything about that.Featuring 32 colourful side-scrolling levels, the aim of the game was simply to work your way from left to right, stomping on enemy heads, leaping over pipes and bottomless pits to reach the flagpole to move onto the next stage within the allotted 100 seconds. In gameplay terms is wasn't anything new to those gamers rich enough to own a NES (with its vastly overpriced games), but to most teenage C64 owners of the late '80s, it was an essential release at the point when the best developers had already started to migrate to the 16-bit systems and leave the dear old  machine behind.These days, though, with such a wealth of top retro classics available this feels like a bit of a footnote in gaming history, but let's not forget what was a special game for all the right reasons - rip-off or not."}