{"ref": "https://www.eurogamer.net/delta-review", "date": "26 Oct 2007", "game_name": "Delta", "text": "In an era when talented lone programmers could quickly churn out top-notch, technically amazing titles to order, the arrival of Stavros Fasoulas' second horizontal shooter, Delta, came as no surprise. Yes readers, we were spoiled rotten back in 1987.Riffing on the progressive power-up system employed in the big-name Japanese horizontal scrolling shooters of the day, Delta brought the concept to the C64 in as slick a fashion as anyone had attempted at the time.Just like Nemesis/Gradius and R-Type, the game relied on your ability to memorise and wipe out wave upon wave of enemy attacks. Doing so would grant you a crucial power-up, which generally equated to speed-ups, and various forms of bolt-on weaponry of progressive power. It's a lovely formula, if a complete and utter rip-off.But it's all about context. What was lovely and special and important about Delta was the fact that it was the first game of this type that was actually any good on a home system: with Delta in your life, it didn't matter about those lovely arcade games which were always just out of reach (a similar, if flawed argument used by Superfrog-owning Amiga fans who didn't care that they didn't have Mario or Sonic. Honest). What else was good about Delta? Well, you might find it hard to appreciate through an emulator and stupidly pin-sharp monitor, but through a crappy old CRT it looked pretty bloody impressive.  Using practically every graphical trick in the book, Fasoulas perfected that trademark Braybrook-esque C64 look, with great sprite animation, varied backgrounds, and excellent use of a limited colour palette. Smooth as you like to play, it was one of the few bastard hard shooters that was really worth putting the hours into mastering it's 32 levels. Better still, the longer you played, the more of Rob Hubbard's epic theme tune you got to hear - truly one of his finest compositions, and yet another reason why the C64 was still going strong despite the arrival of 16-bit machines. Oh, and special mention for the mixing desk loader. Hours of fun."}