{"ref": "https://www.eurogamer.net/r-missilecommand-arcade", "date": "26 Oct 2007", "game_name": "Missile Command", "text": "Back in 1980 the world was a very different place, and it could be said that Missile Command was a product of its volatile time. Twenty-seven years ago mankind was in the grip of The Cold War; a period when it seemed that the slightest political blunder would tip the planet into World War III, and the excitement of global thermonuclear war. With tensions between East and West at breaking point, Atari's Dave Theurer designed and programmed what would become a legend amongst video games.Your goal in Missile Command is a simple one; defend six cities from the incoming nuclear missile attacks using your trusty track-ball, three fire buttons, and a limited arsenal of 30 rockets. The first couple of levels are wonderfully designed: the enemy attacks drop down from the top of the screen in a slow and pondering fashion. It's at this point you have a chance to get to grips with the innovative controls, and pick off the enemy at your leisure, before things really get underway.This introductory period is a short-lived one however, as within a couple of levels the enemy have increased the speed and variety of their onslaught, combining heavier missile strikes and an assortment of overhead enemy craft, hell-bent on raining destruction from the heavens. With practice you'll soon fend off these attacks with relative ease, only to be rewarded by the arrival of The Smart Missile. Aptly named, it evades your defensive blasts with relative ease, proving to be the ultimate killer, homing in on either your missile bases or the cowering populations of your vulnerable cities. Only the split second timing of a direct hit, or a mass of barrage of explosions can put an end to this destructive force.Recently released in revamped and original form on Microsoft's Live Marketplace, the bustling leader boards are testament to the continued appeal of Atari's ageing classic, and whilst an analogue controller can never capture the feel of the arcade's track-ball, it's still an absolute steal at a mere 400 points."}