{"ref": "https://www.eurogamer.net/cultist-simulator-review", "date": "12 Jun 2018", "game_name": "Cultist Simulator", "text": "Cultist Simulator is about forbidden knowledge, forgotten histories and ill-advised pacts with entities who aren't so much gods as unsettling cosmic frequencies, felt rather than understood, but it would be nothing without its monotony. Starting the game, you are confronted not with a squiggle of eldritch geometry but a wooden table covered by a worn leather mat, its scratches picked out by a strange cobalt light. An hourglass timer begins to drain away, sucking Fund cards out of your hand with every revolution; you counter by plugging Reason, Passion or Health cards into a Work timer to generate more. This mundane rhythm keeps up throughout the ensuing 20 or 30 hours, as cards and timers of all kinds slowly cover the tabletop, each accompanied by a gravid yet delicate prose snippet about the game's curious, alternate-1920s England. It's the bassline for an experience that is as much an investigation of mind-killing drudgery as it is a homage to the wayward imagination - indeed, an experience that derives much of its mystery and threat from their inseparability.Many of the challenges and setbacks you'll face during your career as a cultist will be crushingly ordinary: injuries in the workplace, humiliating demotions, a fatigue mechanic which renders certain cards briefly unusable, periods of bleakness or dissociation that may doom your character if you let them fester for too long. You'll deal with bullying superiors as an underpaid bank clerk, paint rapturous vistas in your spare hours that nobody buys, push paper as a police inspector, haul cargo as a labourer. Sometimes you'll dream of endless roads, locked doors or being trapped under wormy floorboards. Often, you'll dream of nothing whatsoever. And eventually, if you're tenacious enough, you'll break through to a comfortable plateau, with a sustainable income, robust health and a little time for hobbies such as walking and reading. One of the endgame options lets you commit fully to this existence, to a blameless everyday world of graft, rest and idle recreation, a world without either light or shadow. Of all Cultist Simulator's deadly temptations, this could be the most seductive. It is, perhaps, the closest thing the game offers to happiness.But somewhere, there is More. Whispers in sunlight. An icy atmosphere when you wake. Appetites whose origins and objects you can't quite place. Somewhere there is a house without walls, fringed by moth and moon-ridden forests and tossed on a painted sea - a realm beyond dimension wandered by inhuman agencies whose desires and griefs trouble the surface of our own. This is a place where you might obtain power, enlightenment or extremes of sensation for a terrible price. First, though, you'll need to get there, by dreaming the correct dreams, performing the correct rites, combing blasphemous texts, probing the Earth's darker corners and enlisting touched souls to your service. It's a journey that requires a willingness to experiment in the face of probable destruction, a sound strategic brain and above all, patience, especially the patience to try again.In practice, all this boils down to plugging cards or combinations of cards into the game's activity timers to create or expose other cards - a mid-noughties Facebook sim-style alchemy that immediately conjures up writer-designer Alexis Kennedy's previous projects at Failbetter Games. Besides Work and Time, the main activity timers are Study, Talk, Explore and Dream. Study lets you read or translate books you've found and cobble together fragments of the game's vast, knotty mythology; given certain resources, you can also use it to increase your all-important allowance of Reason, Health and Passion. Talk is for reaching out to potential partners-in-crime, sending your minions out on nefarious errands and enhancing their capabilities via certain rites. Explore lets you research and dispatch expeditions to mystic sites across the world; you can also use it to visit places within London in search of a rare tome or something less tangible.  And Dream, finally, is how you'll access the Mansus of the Hours, making your way through its unreal precincts as your stockpile of lore and understanding of the game's well-obfuscated logic expands.In the process, you'll attract both adversity and adversaries. Cult activities typically generate Mystique or Notoriety cards that will eventually rouse the attention of a hunter, who will try to convert Notoriety into evidence of your sins. Allow the hunter to build a compelling case and you'll be tried by the Suppression Bureau, London's paranormal police. Fortunately, you have many ways of getting rid of hunters or the evidence they concoct, some more subtle and profane than others, and in any case, the greatest hazards in Cultist Simulator are those you create. Dream awry and you'll wake up with a nasty dose of Dread or Fascination that might lead to a breakdown. Send ill-equipped minions to especially baleful ruins and you may lose them forever or trigger ancient curses, which wreak all kinds of havoc. Rites - complex, four or five-card ceremonies that require special influences, tools and usually, a more-or-less willing sacrifice - may backfire, as summoned creatures escape your control and spells gobble up assistants without warning. Pretty much every decision is a gamble, with plenty of surprises thrown in amongst the things you can predict, and the consequences of failure are steep. There is a mighty spell of winter in the game that destroys a person at random. I'm not sure if this includes the player's character, but I haven't been bold enough to try it.Staying afloat amid this constant bubbling of timers, dangers and opportunities is a source of grim satisfaction, but the great joy of Cultist Simulator is discovering another card combination, and the great joy of discovering combinations is finding something else to read. Far from the leaden chunks of ~world-building~ offered by most fantasy RPGs, Cultist Simulator is a universe of the unspoken, a protean clutch of riddles, scholarly marginalia, back-alley rumours and pointed epithets. The Mansus at the game's heart never quite assumes a literal form, though you're eventually treated to something like a map - rather, it exists between the lines of censored tracts and in the gulf between contradictory histories and creeds. Kennedy remains a master of the Dread Surmise, to steal a term from his first game, Fallen London - he is adept at infusing a sentence or two with the maximum of dire implication. But just as important are his self-parodying mannerliness and fatalistic sense of humour, which keep the grandiosity and hamminess of much cosmic horror at bay. His writing is at once ~Lovecraftian~ and the work of somebody who considers Lovecraft in frightfully bad taste.Also as in Kennedy's previous games, there is a more-than-usually-chronic sense that the writing is at war with the systems. In practical terms, the trouble with Cultist Simulator's fondness for verbal ambiguity is that it sometimes teaches you to look for connections where none are permitted. It's been intriguing to watch the game struggle with this through Early Access, as Kennedy and fellow Failbetter veteran Lottie Bevan have shaved away obscurities here and there, introducing the odd square-bracketed hint in a way that feels like a betrayal of the premise. Language at large is a volatile creature, crowded with duplicity, ripe with past usages that hang perilously over ever utterance. Cultist Simulator does a wonderful job of revelling in this, but it is also a card game made up of piecemeal, linear connections, subject to the basic economic principle of adding things together to create other things of greater value. At its least marvelous, the game is almost a prison for its own wit, a factory where vivid, open-ended fantasies are melted down into bitty commodities. This is especially apparent when you start over, of course, as hitherto exciting card combinations grow routine - and you will do a lot of starting over in Cultist Simulator, though there's a choice of opening backstories and vocations to ease the pain.If this discord may frustrate, it's arguably to the purpose inasmuch as Cultist Simulator is consciously about how moments of unearthly insight might arise from the grind and dust of the temporal sphere. The gap between where the writing inspires you to go and the deadening arithmetic of getting there is the point, not a weakness - and when you happen on another scrap of proscribed lore, it's like a moment of deep shade after a day in the sun. Cultist Simulator's achievement is that it teaches you to search for such moments, to demand them even as you contend with the suffocating greyness of practical reality. It is a tribute to human myth-making and malevolence which understands that other worlds are not invented or found but torn, limb by limb, from the one around us."}