{"ref": "https://www.eurogamer.net/3d-starstrike-review", "date": "25 Oct 2007", "game_name": "3D Starstrike", "text": "Star Wars euphoria over spilled into the arcades in the early 80's with Atari unleashing Star Wars the arcade game onto a public hungry for an immersive experience in a galaxy far, far away. After spending your weekly pocket money shooting down Tie-Fighters and generally saving the Rebel Alliance over and over again, playing the latest Star Wars clone on your home computer did not really live up to the arcade experience. That was until Realtime Games Software Ltd released 3D Starstrike on the Spectrum, a blatant clone of Atari's flagship title. With a little imagination, your Quickshot 2 turbo joystick was transformed into the yolk of the illustrious X-Wing fighter. The vector alien ships that insisted on hurling powerful plasma bolts at you on your Fergusson 12~ TV became the Tie-Fighter scourge of the dark side. And with screams of ~I'm going in...~, you fought for the good of all men against the evil Empire as wave after wave of ships were shot down, laser turrets on sprawling landscapes destroyed and fortified trenches traversed. The icing on the cake for all Star Wars fans would have been the chance to fire a proton torpedo down the exhaust port of the Deathstar, whilst shouting out, ~Let's blow this thing and go home~. A shame then that 3D Starstrike replaces the exhaust port by a force field that, on destruction, totally fails to instil the sense of elation felt at the arcades when seeing the Deathstar being blown to smithereens as the torpedo hits home. With the official Star Wars game some way off, 3D Starstrike was the closest a fan could get to being immersed in the Star Wars universe from the comfort of their bedroom. Realtime Games Ltd became synonymous with ground breaking titles on the 8-bit computers, astonishing game players with immersive 3D environments that pushed the technical boundaries of the hardware to the extreme. 3D Starstrike continued Realtime's technical march forward from 3D Tank, their previous offering. A year later the benchmark was moved forward once again with 3D Starstrike 2, boasting revolutionary ~filled~ vector graphics."}