{"ref": "https://www.eurogamer.net/jetpac-review", "date": "25 Oct 2007", "game_name": "Jetpac", "text": "Ultimate Play The Game is a company synonymous with producing ground breaking titles for the ZX Spectrum with their 1983 debut, Jetpac, re-setting the benchmark for shooters on Sir Clive's Technicolor wonder machine that other game developers thereafter had to measure up to.Only 16k in size, Jetpac thrusts (pun intended) the games main character, Jetman, into an intergalactic quest of spacecraft construction, fuel economics and alien annihilation. The game's objective is simple: Build a spaceship, fill it with fuel then blast off to the next planet. Each level is contaminated with multicoloured baddies that home in on our intrepid action hero with the sole intent of taking away one of his limited lives. Fortunately, those fine scientists back at base had the vision of integrating a laser gun into Jetman's spacesuit on the off chance that our space explorer bumped into such disposable aliens on his intergalactic travel. A quick blast on the fire button sends a satisfying, vibrant laser bolt across the screen devouring any extraterrestrials in its path. Activating the latest in Jetpactm technology strapped to our stalwart technician's back sends him flying across the ledge ridden single-screen levels with inertia-based aplomb. Spaceship parts, fuel canisters and bonus point collectables can be easily retrieved with a well timed thrust of the boosters.  Jetpac's graphics and sound effects are basic, even by Spectrum standards, with colour clash attribute in full flow and spot effects limited to burps and belches as aliens meet their maker. The game nonetheless holds the player's attention purely through its simple gameplay mechanics and a faultless presentation from Ultimate. With the clearance of each level seeing the player's score leap forward thousands of points, one more go is never enough on the quest to better one's high score.Only one more go before bed mum. Honest."}