{"ref": "https://www.eurogamer.net/spider-man-friend-or-foe-review", "date": "23 Oct 2007", "game_name": "Spider-Man: Friend or Foe", "text": "Friend or Foe, Good or Bad? The answers are 'foe' and 'bad', I'm afraid. Spider-Man: Friend or Foe has 'filler release for the young 'uns who don't yet know better' written all over it from the moment you start mashing those buttons in earnest, and scarcely gets any better hours later. It's a game with precious little content, piss weak combat, and some of the blandest graphics yet to hit the 360. No wonder Activision's not shouting about it.Problem number one: Friend or Foe is yet another isometric Marvel game. That's not necessarily a   bad thing in itself, but Activision has long been guilty of milking the ageing formula to death over the past few years. This, frankly, stretches Marvel fans' patience beyond breaking point - especially in a year when we've already had to stomach one lacklustre Spider-Man game.At least last year's Marvel Ultimate Alliance was exhaustive attempt at packing in more content than any previous isometric brawler. Having so many different characters and permutations (not to mention online play) offered a fair incentive to carry on, even when your brain was being numbed by the inherent repetition of the gameplay. By comparison, Friend or Foe is limp and insipid, with a mere fraction of the features on offer in Raven's surprisingly decent effort.Central to the general boredom surrounding this game is the aforementioned piss weak combat. Evidently designed for morons who derive pleasure from joylessly stabbing X or B and killing everything without, you know, requiring any hint of skill whatsoever; it's a game you can romp through by repeating the same boring moves against the same dull, lifeless drones, across five bland environments. So lacking in ambition is this game, it could have easily have been designed for the PSone and the ancient Sony hardware wouldn't have broken sweat. There's no place for games like this in the full price market - even for die-hard Marvel mentalists. It's a fun-free zone, where you're going through the motions.Not convinced? Then I'll attempt to describe a typical encounter in Friend or Foe. You, and one of the 14 unlockable characters wander around lifeless environments on the hunt for some evil dude or other. From nowhere, Bad Guys enter the scene. You clobber them to bits by mashing X, or web-line/shoot/stun them with B. Hit B again and you'll probably swing them them around a bit and smash them on the floor amusingly. When all the various respawning goons have finally been beaten to a pulp and disappeared (convenient!), you'll wander on through boring, linear environments, smashing random boxes for currency. Another cluster of enemies will enter the scene. And again. Eventually you'll find a 'secret' key, and a 'secret' arena, where you can (optionally) fight a bunch of more boring drones. From there, you'll plough through dozens more idiotic enemies, using the same old tactics, reaping the same rewards and barely ever feeling remotely threatened. After a few more tiresome encounters you'll face a mini-boss with a health bar. You'll pluck his projectiles out of the air and fling them back at him. You'll dodge waves of determined attacks. You'll notice that even when you're being hit a lot, you die rarely. And while all this sterile nonsense is playing out, you'll either have an AI player helping out occasionally, or one of your actual real-life friends (or foes, who knows?) will be dishing out some clobbering too. To begin with, you only have one character to choose from, but as you defeat each corrupted boss monster, they go from being your foe to being your chum in a united battle against whatever's raining comets down on various parts of Planet Earth. That in itself is quite a neat touch, and being able to swap over to different characters during the game or between levels makes for a fair bit of variety - in theory at least. In practice, the core piss weak combat is just so dull, and the sense of challenge so muted that you'll quickly lose the will to see the game through.In between levels you'll get the obligatory chance to upgrade your character or characters as you see fit. On a basic level you can power up your health, strength and resistance to damage, but beyond that you can choose to spend your winnings on unlocking more powerful or more exciting special moves. Not that you need them, of course. They're there for show as much as anything, dishing out perceived rewards and offering a tiny carrot to continue.Another thing to mention is the ability to pitch any of the unlocked characters against one another in a traditional 3D beat 'em up in an arena-based environment. While this could be quite interesting in its own right, the game's rather inept combat makes it feel like a clumsy, tacked-on afterthought. Sure, you can use all your special moves and settle a few scores about whether Spider-Man's really harder than Green Goblin, but it's no substitute for a proper Marvel beat 'em up, put it that way.Whether you agree that the gameplay is a shoddy, lightweight travesty, or a pleasant diversion for younger or casual gamers is one thing. What's indisputable about Friend or Foe is just how rubbish the graphics are. Cribbed from mid-90s brawler design, the hilarious lack of any attempt to lavish the game with any love in the art department is stunning. The character models are acceptable (in cut scenes, at least), but beyond that the game takes place in such depressingly vanilla locations that the only possible explanation for how the game ended up like this is down to severe deadline restrictions imposed on Next Level. Given the Canadian team's serviceable track record to date (including Mario Strikers Charged), we can't think of any other reason why the game ended up being such a waste of everyone's time. It hasn't been a good year for Peter Parker, has it? First, a lacklustre movie tie-in, then a critically murdered movie, and now a thoroughly unnecessary isometric brawler that ranks alongside Transformers and Pirates of the Caribbean as being one of the worst uses of a high profile license we've seen this year. If you're skipping to the final paragraph, here's what you missed: Friend or Foe's main punishable offence is for being bland to the point of irrelevance. Skill-free button-mashing combat, crappy AI, uninspired level-design, horribly sterile environments and a game so short you could finish most of it in an evening. Please: stay the hell away from it."}