{"ref": "https://www.eurogamer.net/speedball-2-brutal-deluxe-review", "date": "18 Oct 2007", "game_name": "Speedball 2: Brutal Deluxe", "text": "Cribbed from the 'How to Play' section is possibly the most succinct description of The Bitmap Brothers' 1991 classic ever written, so it bears repeating here: ~Speedball 2 is a brutally fast-paced game of two 90 second halves, where points can scored in an instant. You'll need to wrench the ball from the opposition at every opportunity and viciously smash in the scores if you want to emerge victorious.~One of the most beloved of all Amiga games, it succeeds for two reasons: it's so easy to pick up and play, and has that indefinable replay value that makes you want to have another go as soon as one match has finished. Unlike a lot of ham-fisted attempts at future sports, it keeps things incredibly simple. You try and gain possession of a metal ball, and either try your luck running with it, or chuck it to one of your eight team-mates. Plucking it out of the air, you'll face a barrage of burly, armour-clad opponents trying to knock your block off, so possession doesn't last long. Bouncing it off walls, charging down anyone in your path and trying to fire it into the goal is the main meat of Speedball 2, and it's very very addictive. As the name implies, it's hilariously brutal, with the kind of casual violence that would have pressure groups up in arms if they could only see the effect it has on breaktime playground games.So it's a 180-second game where the most points wins, but gaining those isn't as simple as merely throwing the ball into a goal. Dotted around the rectangular arena are various other score enhancers, such as stars, score multipliers and domes. Hit one of the five stars on the wall and you'll gain two points, hit all five and you'll get a 10-point bonus - and the same in reverse if you switch off your opponent's stars. Elsewhere, the score multiplier adds an extra five or ten points when you score a goal, depending on how many times you've sent the ball whizzing through it. And, finally, if you ever find yourself in space with enough time to pull it off, pinging the ball off the bounce dome gains you two points every time you hit it.If you're really good, you'll also be able to make use of the Warp Gates to set up opposition-confounding manoeuvres which teleport the ball from one side of the arena to the other. Likewise, once you know your way around, you'll also want to take full advantage of the Electro Domes, which electrify the ball and leave an opponent stunned and with Speedball pie all over their face. Also, scattered around the pitch are all manner of temporary power-ups, which may affect individual players or the entire team. Evidently, there's much more to Speedball 2 than might be initially apparent.As with the Amiga original, you can play the game in quickie two-player mode, or engage in a number of competitions, including an eight-player league (and rather pointless manager version where you just watch the AI duke it out), knockout cup, and tournament. The big draw with this version, of course, is the ability to play the game online, in ranked or player matches. In this instance, there's a little more incentive to get stuck into the league mode, because it gives you the chance to use your career team online - which, as any veteran will know is vastly more entertaining than using the rather hapless team you get by default. That said, you can only use you career team in the ranked matches, so be prepared, because there's a good chance you'll get smashed up by old hands who've been playing the game solidly for 16 years and have ranked up their players to the max. Initial impressions of online matches are fairly positive - lag is definitely a factor, but as with all Xbox Live matches it's the luck of the draw. Our advice? Find a pal who doesn't insist on downloading during online matches.Visually, Speedball 2: Brutal Deluxe offers you the choice of the original Amiga graphics, or a spruced-up version. The gameplay is identical either way, but for some reason the deliberately clunky gameplay just feels better using the old-style visuals. One of the main problems with the updated version is the fact that they fill the entire screen - meaning that you'll most likely have to sit further away from the screen to take it all in. Strangely, the Bitmaps didn't take the opportunity to allow you to see more of the pitch (presumably because they felt it might change the gameplay dynamic), but at the same time, seeing such a small portion of the pitch zoomed in to such an extent seems odd. Or maybe our TV's just too damned big.Regardless, the updated visuals aren't a disaster (like Double Dragon was). The character models are nicely detailed, and it's hard to find fault with the way they've added shadows and made the arena look much nicer. The problem is, in order to make sure the game still plays identically, they've had to adhere to the original clunky movements of the players, meaning your eyes are drawn to the unnatural animation much more than when you're playing it in the original mode. Such trifling issues don't really detract from the gameplay once you get used to it, but don't be surprised if your first reaction is one of gurning disappointment. Just switch back to original, get used to the gameplay again, and then maybe come back to it later. You might be surprised.Despite the claims of the game being built with the original Amiga code-base, Speedball 2: Brutal Deluxe is unfortunately marred by a few minor bugs that spoil the game a little. Apart from players occasionally running into thin air, one that we have difficulty understanding is the way the game occasionally freezes your player for second or so at kick-off, giving the AI the chance to steal possession when you ought to be able to charge in an challenge them. It's not something that happens every time, but when it does it's usually at a point when you can ill afford to be on the back foot. Having run through a couple of league campaigns, I can ruefully report that it's not uncommon at all, and unless Empire and The Bitmaps patch it, the game simply doesn't represent the Speedball 2 that you'll remember.One nice touch that's worth mentioning is how the controls have been slightly tweaked, giving you the option of a low throw or high throw in one of two ways. Either you can do a light tap of the A button for a low throw and it hold down for a high throw, or just hit the B button for a high throw. Obviously that wasn't possible on the one-button Amiga joysticks of the time, but it'll be interesting to see the effect this subtle tweak will have on more proficient players. As ever, the achievement system adds a further layer of fun to an already excellent game, and unlike a lot of XBLA titles, it'll take a while to mine the game for all 12 of them - just as it should be.In most ways that matter, this is a fine conversion of an enduring classic, and is exactly the sort of game that makes Xbox Live Arcade one of the most exciting gaming platforms around. Available for 800 points, Speedball 2: Brutal Deluxe is not necessarily the sort of game that newcomers will take to, but for those of us who were around at the time, it's damn near essential. The Bitmaps deserve credit for not messing around with what made it great - but fix those bugs soon, eh chaps?"}