{"ref": "https://www.eurogamer.net/street-fighter-30th-anniversary-collection-review-capcom-gets-this-compilation-mostly-right", "date": "4 Jun 2018", "game_name": "Reviews", "text": "Now this is more like it. Last May, still uncertain about the prospects of Nintendo's Switch, Capcom tentatively tested the waters with Ultra Street Fighter 2: The Final Challengers. The end result, though, felt more like a kick in the face; a bastardised version of Super Street Fighter 2 Turbo HD Remix, Capcom filled out the package with a suite of unwelcome extras in a clumsy attempt to justify the full-fat pricetag. People were upset at the unconvincing results, and you can understand perfectly well why. Street Fighter is more than just a game. It's a cult at times, a worldwide cultural phenomenon at others; a cornerstone of communities that bring people from around the globe together, or just the best place to play with a friend for an evening of bawdy brawling. Street Fighter matters.Street Fighter 30th Anniversary Collection gets that, and gives the series the respect it deserves. It does a more effective job than any harsh words online could in proving just how bad The Final Challengers was; for around the same price as that game, here you're getting some 12 complete, perfectly ported games culled from the series in its pixel art prime, taking you on a journey from 1987's slightly unconvincing original Street Fighter all the way through to 1999's Street Fighter 3: Third Strike - the end of one particular, fascinating path Capcom elected to take the series, and a high watermark for 2D pixel art as a whole.  They're great games - the creaky original Street Fighter aside, of course, though its presence as a curio is more than welcome - but you knew that anyway. No-one really needs reminding of the brilliance of Street Fighter 2, which remains just as vital today as it was upon its release in 1991, of the mastery and hard-edged challenge of Street Fighter 3 Third Strike or of the generosity and the vibrancy of the Alpha series which climaxed with Street Fighter Alpha 3's vast roster of playable characters (which is capped at 28 fighters here, sadly, seeing as it's the vanilla version that's offered rather than the Upper update which added the likes of Fei Long, Dee Jay and T.Hawk). 30th Anniversary Collection presents near-flawless versions of the arcade originals, and while they're fantastic to play, it proves just as fascinating charting the evolution of the series throughout its 90s pomp.Developer Digital Eclipse - previously responsible for the exceptional Mega Man Legacy collections - has done some outstanding work here. Fancy a peek at the fighter's extra curricular activities, as afforded by 1993's Memorial Album? Then feast on a selection of 4K artwork, where each sketch can be zoomed in until you're able to see the finest detail. Elsewhere, there's an exhaustive look at the making of Street Fighter 2, charting the game's many twists throughout its development, how Final Fight - once known as Street Fighter '89 - was spun out during that process and how the characters evolved to their final iconic forms (though I for one am sad that we never got to see boxer Dick Jumpsey make the cut).  The detail can be satisfyingly granular. Character bios are included in full, but so too are movesets and frame-by-frame animations, allowing you to see how, for example, Ryu's hadouken has changed over the years and over the many iterations, and how that iconic pose has been told across various art-styles. It's phenomenal stuff. And you can see that evolution in the games themselves, of course, from the seemingly endless iterations of Street Fighter 2 - five of which are included here - to the short, striking journey Street Fighter 3 made from New Generation to Third Strike. The emulation appears spotless, though there might be some debate about what exactly 30th Anniversary Collection has chosen to emulate. These are the vanilla arcade editions, without some of the balance tweaks that later editions made to particular games. So that means a smaller roster in Street Fighter Alpha 3 than you might have been used to in console versions of the same game, a Third Strike with a slightly spottier soundtrack than the beefed up one that appeared in the Dreamcast version and countless other discrepancies. There are countless other fidelities too, mind - such as the option to play Street Fighter 3 Double Impact in true 16:9, taking advantage of the fact this interim outing was the only Capcom CPS3 board to support 496x224 widescreen. Thanks to the limited but effective filters included in this collection - TV and arcade are both offered, one mimicking a regular home CRT set-up while the other apes a monitor found in a typical candy cabinet - it looks absolutely splendid. And some of those fidelities perhaps go a little too far. Online play is included as part of four titles in Street Fighter 30th Anniversary Collection - for Street Fighter 2 Hyper Fighting, Super Street Fighter 2 Turbo, Street Fighter Alpha 3 and Street Fighter 3 Third Strike - but it's not quite perfect. In Super Street Fighter 2 Turbo, Akuma - a character considered so overpowered he's been banned from competitive play for some time - is available in Ranked play, effectively breaking the mode. Elsewhere, the relatively slim online mode offers private and public lobbies as well as ranked and casual play - though be warned that, if you're playing on Switch, the net code simply isn't up to scratch at launch. Since release, I've only played a couple of games I'd deem close to acceptable, with the majority bordering from uncomfortable to unplayable, an issue that's simply not present when playing on PlayStation 4. The Tournament Mode that's exclusive to the Switch is scant compensation, though the fact you can now play perfect portable ports of some of the 90s greatest games still makes it a worthwhile bet. It detracts but doesn't completely undermine what is an outstanding package, a true celebration of one of gaming's greatest series done with the passion and attention to detail that something as iconic as Street Fighter demands. Legends should only grow in their retelling, and with 30th Anniversary Collection and Digital Eclipse's fine work Street Fighter has never stood taller."}