{"ref": "https://www.eurogamer.net/flight-simulation-review", "date": "16 Oct 2007", "game_name": "Flight Simulation", "text": "When released back in 1983, Flight Simulation flew (pun intended) off the shop shelves selling more than 130,000 copies to would be Spectrum pilots that fancied a trip into Britain’s cloud infested sky.The titles author, Charles Davies, gave interviews to popular magazines of the time boasting of his title's authenticity and its ability to accurately teach gamers a thing or two about flying an actual plane. A great deal of complex mathematical equations later and what we actually have is a representative cockpit full of moving dials and multicoloured buttons accompanied by a blob of blue representing the sky and a splodge of darker blue representing the land underneath. Even the effect of wind has been simulated with stirring effect.Moving the plane left or right shifts the angle of the horizon accordingly whilst moving the plane up or down increases the amount of blue or light blue visible to the joystick waggling pilot. It's wonderful, realistic stuff.A major gripe with Flight Simulation, apart from its woefully dated graphical style, is that there is very little to do. A typical outing sees the pilot taking off, pointing the plane in the direction of the destination airport and landing the craft. The return trip is just as exhilarating.  A few graphical representations of lakes break up the monotony of the lacklustre scenery as well as 'invisible' hills that unfortunately come to your attention after your plane has crashed into them.Written in BASIC, the simulation chugs along at a sloppy frame rate complimented by sluggish controls. On inevitably crashing the plane the concussed pilot is asked if he would like another go. When replying in the negative the BASIC 'STOP' command is invoked showing all would be developers Charles' clever programming skills.A first of a kind on the ZX Spectrum, Flight Simulation was a truly a unique experience for the Spectrum enthusiast, especially for the Dads who were often seen nudging their siblings aside just to have one more go at landing a 747 at Heathrow Airport in gale force crosswinds. It's amazing how colourful the imagination becomes with age."}