{"ref": "https://www.eurogamer.net/r-dirt-ps3", "date": "4 Oct 2007", "game_name": "Colin McRae: DIRT", "text": "It's fair to say that being a PlayStation 3 owner has, to date, demanded the sort of patience that would test even the most hardened Sony apologist. If the European launch delay wasn't enough of a bitter pill to swallow, this year has seen all manner of top-tier titles launch weeks - if not months - later on PS3. By the time games like GRAW 2, FEAR, Rainbow Six Vegas, Splinter Cell: Double Agent and Oblivion turned up on the Sony system, they were already old news. And the trend has continued recently, with a succession of irritating delays to highly regarded titles like The Darkness, Skate, Stranglehold, Medal of Honor Airborne, and Colin McRae DIRT. We've taken the unusual step of re-reviewing the latter title for a few reasons. Firstly, PS3 owners might not necessarily appreciate just how good this game is - by their very nature, tardy ports tend to go under the radar, with hard-pressed publications likely to prioritise new stuff ahead of a conversion that's likely to be functionally identical. But DIRT deserves an extra push, partly because it's largely excellent, but also because it got unfairly overlooked when it was originally released on Xbox 360 June. Unfathomably released alongside the juggernaut that was Forza Motorsport 2, it didn't quite get the attention it perhaps deserved.Aside from all the scheduling recriminations, it's a game which deserves to be hailed as one of the best racing games of the year on PS3, and certainly up there - if not better than - Motorstorm in many respects. Needless to say, Colin McRae's untimely passing the day after its release on PS3 also grants it a special significance. His enthusiastic input, inspiration and influence on this excellent series is something worth celebrating.As you may know from its release on PC and 360, it's a long way from the Colin McRae Rally titles of old. Taking several cues from Codemasters' hugely admired TOCA Race Driver series, it's a driving game packed with variety - most of which comes off extremely well, and a small proportion which definitely does not, but more of that later.Without needlessly trawling through a long list of features (all of which are more than adequately tackled in our original review) the general gist is you find yourself racing in a variety of off-road disciplines. Sure, traditional point-to-point Rally's in there, and is as authentic and exciting as it's ever been, but the whole thing's embellished and fleshed out with all sorts of other racing styles that contribute towards making DIRT such a great all-round package. For a start, there are a few rally spin-offs, such as Crossover events (where you race head-to-head in a two-lane circuit) Rallycross (again, circuit-based, but combining off road and on-road elements), Rally Raid (off-road circuits, US-style), CORR (Championship Off-Road Racing, throwing buggies and Pro-4 trucks into the mix), and ~the most extreme discipline~ Hill Climb.In the game's main Career mode, you're presented with a tiered pyramid of events, with the eventual aim to earn enough points in each race to unlock the next one - not to mention enough prize money to buy progressively better vehicles to aid you in your quest. The order in which you race them is relatively loose, giving you a degree of freedom over how you approach the game, and as long as you meet the point requirements, you could feasibly skip entire events if you have a particular aversion to one or more of the racing disciplines.But the most striking thing about the game initially isn't necessarily the freshness and variety, but the terrifyingly irritating input of Travis Pastrana. Not since the Americanisation of Burnout 3 has a game benefited least from the supposedly 'cool' lingo heaped upon the early part of Colin McRae DIRT. Within seconds of starting the career mode, Pastrana comes out with such gems as 'sweet', 'gnarly', 'wicked' and the kind of cringeworthy 'pumped' utterances more befitting a 'totally stoked' skateboarding title. We can only assume it's some kind of cynical attempt to break the all-important North American market, but, to our poor fragile English ears (regularly subjected to more jock speak than we can take) it's the sound of serrated fingernails down blackboards. Mercifully, most of the really nauseating stuff is crammed into the intro, so you can mostly just get on with the racing, but now and then such eye-rollers as ~Smooth and steady - I'm Mr Smooth and you're Mr Steady~ come at you just when you think you're safe from a prescription from Dr. Cheese. That said, even the main game has some vocal irritations too, with the pace notes read by a Yank. It simply doesn't feel 'right' that the notes are no longer read by Nicky Grist. That was always an integral part of a McRae game's appeal. Couldn't Codies have, you know, localised it properly?"}