{"ref": "https://www.eurogamer.net/grimgrimoire-review", "date": "2 Oct 2007", "game_name": "GrimGrimoire", "text": "The sad fact of the matter is that there will have been many hundreds of Eurogamer readers who chose to bypass this review for no graver reason than its quirky name and art style. The heavy, nonsensical title combined with the overtly Japanese super-deformed fantasy characters that give face to the article on the front page bespeak one thing to knowledgeable gamers: Japanese RPG. But they're wrong: GrimGrimoire is a Real Time Strategy game, more Command and Conquer than Final Fantasy and, thanks to its unique sideways-on perspective it's an especially intriguing take on the genre to boot. Published by in the US by Nippon Ichi, KOEI in Europe, and developed by the hands behind Odin Sphere, Vanilla Ware, GrimGrimoire, as you might expect, approaches things with scant regard for tradition and convention. Viewed as a side-scrolling 2D game - albeit one with delicately drawn characters and exuberant animations - the game is an RTS flattened, one where your task to expand and grow your influence up and down the cross sectioned floors of a towering castle.This interesting gameplay premise is backed up by an equally interesting story- albeit it one that might be eerily familiar to fans of J. K. Rowling's enthusiastic prose. Your character, a young wizard, enrols at the start of the game at a school of witchcraft and wizardry, home to the philosopher's stone, where she studies under the beardy guidance of one professor Gammel Dore. In synopsis it sounds worthy of litigation but in practise the similarities are superficial. This is partly because the game's structure borrows from another Western entertainment reference point: Groundhog Day. Throughout the game you relive the same five days over and over again, each journey revealing more of the odd magical melodrama that makes up GrimGrimoire's story.The structure and setting are important because they provide impetus to play through the slow-burning early levels. As you meet the various teachers and personalities of your school, and they challenge you to battles, you'll want to push on through these seemingly interminable tutorial levels (though they're never called that) just to find out where it's all heading. The lush 2D character portraits (similar in cliché-dodging style and artistry to those seen in Odin Sphere) bristle with character and the witty, well-translated dialogue betters many a role-playing game in both set-up and pay-off.The core of the game though is undeniably the real-time strategy. The basics are orthodox: collect resources (in this instance mana from crystals littered around the castle's floors) create units and try to overwhelm and dominate the opponent on the other side of the board who is seeking to do the same. The ebb and flow of battles is instantly recognisable and comfortable and, as you grasp to claim territory and establish defences all of the fundamentals that have fuelled the ongoing success of this ancient genre feel solid and familiar.At the start of a level your first job is to place a rune, the epicentre from which you can create units. There are twelve different runes to collect in the game, spread across four different classes (necromancy, sorcery, glamour and alchemy). Each rune allows you to create different types of units. Initially you'll ant the basic gatherer units, imps and elves who'll gather mana from the nearby crystals. With the mana collected you can then create more expensive offensive units (fire arrow-wielding fairies, sharp-horned unicorns and angry ghouls) and direct them off into enemy territory to do battle. The decision to have environments viewed sideways on, like the cross section of a castle complete with stairways and pillars, is an interesting one. Some units can fly up and down floors while others must walk and so working out the timings required to co-ordinate an attack is crucial. Unit path finding is good in the game and, any time an attack unit is wiped out it's unequivocally your fault - an important factor in any videogame but one especially pertinent in a game in which you manage others. The game's complexities quickly ramp up thanks to the fact that units spawned from different rune types are variously effective and ineffective against other rune types. For example, a chimera, a huge and effective battle unit that's expensive to build and hard to beat is completely ineffective against astral-based units through which his claws pass without effect. However, by sending a homunculus support unit along with the Chimera it's possible to turn the ghostly enemies into a physical form for a short amount of time, providing a window for the Chimera to decimate them all. With support units providing healing and defensive units such as fire-spewing columns to guard your mana gatherers, success is a careful balancing act of spending your man in the right areas and applying the most effective unit types to each situation.The 12 runes in the game also level up with repeated use, providing new units and effects as they grow. Later in the game there's a dizzying array of tactical possibilities open to players. While the game does pause every time a unit is selected (a useful feature that allows you to take your time making decisions) occasionally it's difficult to select the unit you want quickly because it's hidden behind a mass of other bodies.Despite the deeper complexities of the system, with environments that are barely distinguishable from one another and core mechanics that expand in depth and not breadth there is little variety to the basic flow of play. Difficulty is introduced by sheer numbers and, for players who aren't grabbed by the core mechanics, the game will soon become tiresome. But the combination of sumptuous 2D art style, interesting structure, enjoyable storyline and ever more unmanageable fights to tackle, for those who are, GrimGrimoire will be one of the most interesting games to come out of Japan in some time."}