{"ref": "https://www.eurogamer.net/moonlighter-review", "date": "29 May 2018", "game_name": "Moonlighter", "text": "Yes, I know, I'm selling sticks, but these sticks fell off of something that nearly killed me in a deep, dark dungeon just a few minutes ago. I risked my hide for that limestone over there, too. This particular starter cable is most certainly a priceless relic, and if you want me to get more treasure like it, you're going to have to pay the price I've set for it. Or at least a price we can agree on.In Moonlighter, your RPG hero's inventory, perpetually overstuffed with all the things you're absolutely sure you're going to need one day, is a vital part of the experience. You control Will, the young, white-haired owner of the eponymous shop in the small town of Rynoka. The shop's name is everything, as Will sells only items he's gathered while moonlighting as an adventurer at the dungeon not far from his house. When we first meet him, he's in there armed with nothing but a broom, and despite giving his all our adventurer promptly receives the beating of his life. This is the game's first and most important lesson: to make it through the dungeon, you're going to need more than just skill - you're also going to need a whole lot of cash for equipment.At first, Moonlighter feels like a bit of a vicious circle. To get better weapons, you need materials and quite a formidable stack of coins, but to get either of these you're going to have to go into the dungeon and fight monsters for parts to sell once you return. The procedurally generated dungeons, five in total, have Zelda written all over them: exploring the interconnected rooms, there are always plenty of pots to smash, innocent bushes to stab and ravines to tumble down. You face off against a variety of enemies with different behaviours, and that means adapting or getting cornered quickly. An escape is possible at any point using a talisman that drops you right back in town. Using it costs money, getting away in one piece is thankfully a bargain.There's much to find, but your inventory is purposefully tight. Items can be stacked up to a certain limit depending on their rarity, but even that only gets you so far. During the first hour or two this isn't much of a problem, as I was more likely to leg it before I got killed, but as soon as I had the necessary skill to deal with any threats without much fuss, I found a lot more items than I could carry. Moonlighter both helps and hinders the decision-making process by assigning items different attributes. If you pick up a cursed item for example, it may destroy something else in your inventory, and you have to shift things around or break the curse with an item carrying the curse-breaking attribute. Other items can send something adjacent to it straight to the shop or turn a material into something more valuable. If something really has to go, you can turn it into a small amount of coin using a magical mirror of money-making.Once home, it's time to decide what you want to sell, put a price on it and wait for customers to swarm the shop. You want a balance between selling your wares too cheaply and having them gather dust on your shelves. People will look at the price for a moment and then let you know what they think of it via an icon over their heads. If they smile, you hit the sweet spot, if they become over-excited you're giving things away for peanuts, and if they sigh, your offering stays where it is. You can adjust prices at a moment's notice and customers will give it another chance, turn them off too often and they might steal it instead. Items periodically lose and regain popularity, especially later in the game people become more discerning to the point where they'll put the odd request in. All of the shop management is easier than it sounds, as you can find all the information about the popularity of items as well as their ideal selling price, once discovered, in your trusty notebook.I soon developed a rhythm that, like with all the best games, would suck me in for hours at a time. I either went with the working schedule of the average freelancer and sold off my inventory during the day before I went back to the dungeon at night, or I went exploring during the day, when easier monsters spawned. From my first money, I gave back to the community that presumably taught me everything I know and provided the starting funds to the blacksmith's and the alchemist's. New weapons, armour and potions often cost money as well as resources, so from time to time I had to stop mindlessly slinging wares at people and hold something back for myself - a wish list helps to keep track of the materials needed.There isn't much need for a story, since the prospect of unlocking the next dungeon and seeing what's in it proves the perfect motivator. Five dungeons may not seem like much at first, but you have to spend a fair amount of time in each before you can unlock the next and there's a whole town to develop besides. Rynoka isn't what it once was, and as Will makes a name for himself, more merchants ask for help to fill the place with life again. There's also the matter of developing your own shop and lodgings from a small ramshackle hut to a formidable business empire.Moonlighter's only downside is being too rigid in its insistence in an absolute balance between bartering and fighting. Whenever I felt ready to tackle the dungeon boss, decked out in shiny armour and eager to try out my newly-purchased weapon, the game would immediately slap me on the wrist because I decided to forgo an upgrade or two. As long as there's a stronger weapon to be made with resources from your current dungeon, you need to get it or alternatively spend half an hour barely making a dent in the boss you're facing.It's a similar formula to that of this year's grindiest smash hit Monster Hunter World, which has you killing the same monsters multiple times to gather enough resources, only with less variety. As nice as procedurally generated dungeons are, it was occasionally frustrating to know the only reason I was going back yet again was that one particular type of leaf because I couldn't move on without it. There's generally enough to do to distract from this minor sore spot, however, as Moonlighter's clear dedication to its idea manages to suck you into both the exciting adventurer's life and the more sedate job of selling your wares."}