{"ref": "https://www.eurogamer.net/company-of-heroes-opposing-fronts-review", "date": "27 Sep 2007", "game_name": "Company of Heroes: Opposing Fronts", "text": "The British - tea-drinking, moustache-twirling nancy-boys. Usually dastardly, or at the very least conniving. This much, Hollywood and games have taught us. Clearly, uber-RTS developers Relic have spent some time hanging out at branches of Wetherspoons, as they've managed to paint a rather more accurate portrait of the denizens of our sceptered isle, whose forces make up one of the two new factions in this World War II RTS 'expandalone'. Apparently, we're incredibly foul-mouthed, angry and violent. Sounds about right, really. Though I did hear at least one cutscene mention putting the kettle on.While some may be mortified by the plucky Brits' stiff upper lips uttering such unpleasantness, I can't tell you how relieved I am to not hear some hackneyed ~Jolly good, let's go show them what-for, what? Fnarr Fnarr~ soundbyte when I select a unit. ~Let's show these F*@#ING WANKERS!~, bellowed with the full, furious force of a beefy cabbie who's just been dinged by a scrawny, bug-eyed tracksuit kid in a Ford Escort, really puts the spirit of war into me.And what a joy they are to play as, too. Turtling, the RTS practice of building up a heavily defended base and waiting for the enemy to wear itself out trying to break in before you go for them, is still considered a bit dirty in some quarters. Like it's not really playing along. Most RTS games will have a faction that's a bit better defensively than offensively, but it tends to be a polite tip of the hat to the practice rather than a passionate bearhug. This is the bearhug.The Brits are an incredible turtle race. Weak for much of the early game, digging in and setting up a defensive line is critical. Their build-'em-anywhere trenches, for instance - such a simple technology, but you can't really beat a dirty great hole in the ground for keeping bullets away from your face. Even the most basic infantry becomes devastatingly effective in a trench, as only incendiary attacks can realistically clear them out. Otherwise, they'll just keep on chipping away at whatever's fruitlessly trying to blow them away, an often insurmountable barrier to a vital victory point. Somewhere at the back of the sector, the uniquely British Captain and Lieutenants lurk, passively generating major buffs to any friendly units. Meantime, Sappers - a sort of engineer/anti-tank hybrid - will be setting up turrets, having access to the game's best selection of fixed anti-vehicle big guns. Pretty soon, there's enough resources in the bank to build Howitzers, and from thereon in, the nature of the Brits changes. Stupidly damaging and stupidly long-ranged, the switch to artillery enables a remote near-wipeout of their foes without the Limeys having to send a single man into harm's way. Or they do, but they do it with gliders, crashing great metal birds behind enemy lines which then spew Commandos - or even, if you've chosen the appropriate upgrade options, tanks right into the enemy's weak spots. I'm not prone to patriotism, but these British make me oddly proud. We won the war. Yeah! We didn't need those damn Yanks' help. Yeah! F*@#ing wankers. There's a complex art to using them, and online matches will see the Axis forces fixated on preventing the artillery going up, which will make playing British something of an endurance test for the earlier stages. If survived though, that switch from panicked brickies to WAR MACHINE makes them Company of Heroes' most exhilarating side to date.Which rather ill-favours the other new recruits, the German Panzer Elite. Like the Brits, they're based around a fresh principle rather than repeating an existing faction but with new hats. In this case, they're a fast anti-tank and anti-infantry side, sacrificing the heavy armour to saturate the field with panzershrecks, light vehicles and tankbusters. It's an effective approach, particularly against COH vanilla's tank-heavy Americans, once you've gotten your head around it, but they're a much less accessible side to play as than the others. Even once you do, though they have their moments they lack the ~bloody look at that!~ element of the hilariously excessive Brits.They're a bit weird, even. In contrast to the Brits, they're fantastic in the early game, able to immediately spew out fast (but weaponless) scout vehicles capable of claiming territories. Half the map will have turned their colour before the British have got their first Sapper out of the door. After that, the micro-managment gets pretty heavy. Repair and munitions vehicles need to accompany the fighty ones out to front lines, Panzergrendiers require multiple upgrades to turn into the powerhouses they need to be, and there's an emphasis on pairing certain units together. It's all hugely effective, more than a match for the Brits, when played with complete understanding and careful strategy, but I worry it robs CoH just a little of its crossover appeal. The Brits contribute to this too - the micro-management across the board is a wee bit heavier, and anyone who found COH vanilla involved a tad too much pressing of very specific buttons will find this far more demanding."}