{"ref": "https://www.eurogamer.net/skate-review", "date": "25 Sep 2007", "game_name": "Skate", "text": "The fact that the Tony Hawk series has been running for almost a decade now has really changed the world's perception of what an extreme sports game should be. During that time, we've seen others try in vain to edge into the market, but somehow, even the best of these (like Aggressive Inline) failed to draw people away from the annual Hawkstravaganza. But now it's time for somebody (well, a company of somebodies) to step up and change the rules. Curiously, it falls to what many see as one of the most by-the-book publishers out there.Whereas the Tony Hawk franchise churns out arcade games loosely based on skating, EA's latest shot at toppling the market leader is skating. With the likes of Fight Night, NHL and Def Jam, EA has tried to shoehorn analog control into a good deal of its output with varying degrees of success, but for the first time here, we find something that lends itself to the mechanic perfectly. Pulling down on the right stick makes your skater crouch down in preparation for an ollie, and then a swift flick upward sends you soaring. Altering the direction of your upstroke and adjusting your weight distribution on the board before you leap triggers the various flip tricks, with some of the more complex ones being a real challenge to master - just as they would be in real life, naturally. Chuck in the triggers for grabs and you've got the vert basics down, but with a little experimentation, there's a staggering amount of variety offered by this seemingly limiting move pool. Grinds and manuals are also handled extremely differently to Neversoft's series, and without a designated button for grinding it becomes all about the approach and your initial ollie. Also absent is any kind of balance meter, but as long as you still have momentum, you'll seldom bail out of a grind or manual unless you hit something.Manualing is something of an art form, requiring delicate use of either up or down on the stick upon landing to come down on just two wheels, and then a steady hand to stay that way. Once again, this feels far closer to actually trying to balance on a real board, and with everything adhering to a believable physics system, any hope you may have had about grinding, manualing or even pushing uphill goes out the window. When you do finally manage to hit a rail in reverse, you'll feel the need to run off and find somebody to high-five. Going up a rail or hubba is so tricky that its one of the most satisfying things you can do in Skate.In this aspect, Skate is so dangerously superior to Tony Hawk's that it makes you wonder why nobody made this game sooner. Even busting tricks across the simplest of gaps fills you with a sense of pride and power that none of Tony's 50-million point combos ever can. There are no new moves to learn or stat points to collect here, and all progression comes by way of your understanding of the game's mechanics improving, mastering controls to make getting around and getting noticed that much simpler. And once you start nailing more advanced moves and lines, you'll be oh-so-thankful for the integrated video editor tool that lets you record the last twenty seconds or so of your run. You can then edit it with various effects and camera angles, and upload it and share it with the world online.Already, the online side of things is bursting with creativity. It's not just about scoring huge amounts of points, but rather putting together impressive lines or coming up with things that nobody else has tried. And given the size of fictional city San Vanelona, finding sweet new spots to tear up and make your own shouldn't be too troublesome.Split into several very different areas, Skate's environment is perfectly in keeping with the down-to-earth skating mechanics. Don't expect every building to taper out into a quarter-pipe at the bottom, as though the city was built with skaters in mind. This is a totally believable area and getting from one end of the map to the other without the handy ability to teleport around to various goals and subway stations will take you about ten minutes. It's massive. It's varied too, offering quiet suburbs, huge downhill runs and built-up city areas as well as designated skate parks and 'No-skate zones'. These are patrolled by security guards who will bowl you over and fine you if they manage to catch you.Intrepid explorers will find all manner of secret spots tucked away behind buildings, but since you've no way of getting off your board, actually getting to these can sometimes be rather taxing. Stairs and gravity conspire against you to make reaching higher spots tough without good preparation, planning and execution but it's often worth your while to see what EA has tucked away in the furthest reaches of San Van.Like the Tony Hawk games, Skate does occasionally stumble by throwing annoying goals at you, although only the races really fall into this category - even then, only a couple are more than a minor nuisance. If you were looking to pick holes, you could question the game's difficulty, the lacklustre character customisation and, indeed, several of the tasks. But to do so would be to do Skate wrong, as while it does occasionally hit a bum note, it does so many things absolutely perfectly that it'd be criminal to dwell on shortcomings for too long.As a first stab at something new, EA has landed one hell of a trick for the judges - and those of us who exist outside of this tenuous analogy - to enjoy while they await the arrival of one Mr Tony Hawk to see if the Birdman has finally had his wings clipped. The demo (which went up on Live recently) certainly doesn't wow in the same way that Skate does, making declaring this the definitive extreme sports experience somewhat easier for us. Punishingly difficult but ultimately rewarding, games of Skate's caliber are a rare breed and as far as first attempts go, it's been years since we saw one this accomplished. Just... sick, man."}