{"ref": "https://www.eurogamer.net/r-vcroundup-240907", "date": "24 Sep 2007", "game_name": "Reviews", "text": "It's week two of Nintendo's ker-azy ~Hanabi Festival~ and, following last Friday's Mario-themed blow-out, this week it's all about the ninja. And baseball. But mostly the ninja.Still going strong as one of the most notoriously hardcore action games around, the temptation to take a spin in Doc Nintendo's DeLorean and see what Ryu Hayabusa looked like when he first skulked from the arcade and into our homes.Well, thanks to the NES colour palette his ninja jim-jams are royal blue rather than ominous black, but the fact that the Ninja Gaiden template is still recognisable in the latest 3D iterations would suggest that this is one franchise that got things right from the start.The emphasis is more on nimble platform negotiation than combat in this outing, but it suffers from none of the clunkiness that often clouds beloved memories of games gone by when the fugue of nostalgia lifts. It's a fast moving, neatly designed highpoint in the scrolling action adventure genre. Dispatching foes with sword strikes is swift and accurate, while shurikens and other power ups and weapons can be nabbed by shattering the numerous lanterns decorating each level. Ryu comes with a generous health bar, and the difficulty curve bends in just the right way, rewarding those who are fast through a level as well as those who take the time to explore a little.There are some irritations - the respawning bad guys are a pain, while scaling higher sections using Ryu's wall-grab move is clumsier than I remembered - but for the vast majority of the time Ninja Gaiden is a fine example of the sort of solid, honest gameplay that retro gaming should celebrate.8/10Here's this week's Never Seen By European Eyes release, a sweet little ninja romp that went on to spawn an entire series of games you probably never heard of. The gameplay is firmly in the pick-up-and-play arcade mould, with a seemingly simple task to repeat in each level against enemies that get faster and tougher with each round. It's also got just the right amount of Japanese quirkiness.You play as a chubby faced little ninja boy, and must rescue the obligatory kidnapped princess from an evil catfish. You do this by scampering around levels made up of parallel floors, zapping ghosts, demons and monsters using your throwing stars. To move between floors, you must headbutt your way through weakened sections, something which can also reveal power-ups (collect) or deadly bombs (avoid). When all the baddies are defeated, you move on to the next stage.Even in its original Japanese form, there's no way you can't grasp such a deliciously simple concept almost immediately and it's immediate and charming enough to win you over in about the same time. How much gameplay you get for your 500 points will depend largely on how much you enjoy doing the same thing over and over but, with its lo-fi Bubble Bobble appeal, JaJaMaru-Kun is definitely well worth a download.7/10Baseball games have a long but not very illustrious history. Quite apart from having to simulate ball physics with no small amount of accuracy, the sport relies heavily on different pitching styles, coordinating fielders and reams of stats for its strategies.Remarkably, Hudson's 1988 baseball game for the TG16 does a very good job of condensing a lot of fairly complex sporty stuff into an accessible 16-bit format.As always with this sort of game, it takes a while to master the timing required to hit the ball - a task complicated by the fact that both pitcher and batter are free to move left, right, forwards and backwards within their boxes - but pitching is easy to get to grips with, so you needn't worry about the other team steaming ahead while you master the home run.It boasts a worthy array of game modes, from two-player matches to solo tournament and even the chance to watch an exhibition match between CPU teams. You can edit the starting line-up of your team, using the fairly detailed statistics to position the best players in your roster. It even includes things like the Pop Fly Rule, pinch hitters and stealing bases.It looks good, plays well and is accessible even to those who only want to smack a few balls over the plate. Whether such casual players will get the full 600 points benefit is open to question, but baseball fans will certainly be happy with how much of the sport this game recreates.7/10"}