{"ref": "https://www.eurogamer.net/sonic-the-hedgehog-2-review", "date": "17 Sep 2007", "game_name": "Sonic the Hedgehog 2", "text": "Has it really been 15 years since Sonic the Hedgehog 2 first hit screens? Yes, buy a calendar. Then look how far games have come. 3D graphics! Free-roaming environments! Intense online multiplayer battles for up to 32 racists at a time! All very well but sometimes you want to be reminded of how good games used to be. When they were good, obviously, not when they were Top Gun movie tie-ins or had the word ~Gex~ in the title. The new Xbox Live Arcade version of Sonic the Hedgehog 2 shines as a candidate for the job. Primarily because SEGA has been sensible enough to Leave Things Alone. All the original levels are present and correct. They are as expansive and exciting as ever. The sheer speed of the game still has the power to thrill as you send Sonic zooming, spinning and bouncing in all directions. The variation in level design is also just as impressive as it was in 1992, all spikes and springs, cannons and levers, pinball flippers and floating platforms. Racing furiously through the Green Hill Zone is still fantastic fun, as is pausing to rack up stupid amounts of points in the Casino. Each environment features a host of hidden areas and secret shortcuts. Completists will want to find them all, but to be that good takes ages. Those who feel the need for speed rather than the need to find every last invincibility power-up may even find the XBLA version of Sonic 2 more enjoyable than the original. Way back then, racing along without a care wasn't always possible. With no save points, you were forced to seek out extra lives and focus on ring collection in order to reach the later levels. The option to save your progress at any moment in the XBLA game means there's much more freedom to zoom on through. Purists might complain this takes away the challenge, but you don't have to keep saving and they're probably people who also complain those new two pound coins are too big and why can't you pay cheques into the post office any more and whatever happened to On the Buses. Just as the great things about the original Sonic 2 have made it into the new version, so have the flaws. Including the biggest flaw, whose name is Tails. Or to give him his full title, Miles 'Tails' Prower. The fact alone he bothers with a proper name proves Tails is pretentious and hateful. It's just stupid, like it would be if the game also starred Ian 'Sonic' Davies or it turned out Dr Robotnik's real name was Steve. But the main problem with Tails is he's bugger all help. Yes, he'll collect the odd ring, but that's not going to help you kill a fat man in a space helicopter. He's just an irritating distraction who makes you think those country people are right about foxes after all and wouldn't it be nice to see Tails's blood smeared all over Camilla Parker-Bowles's face. There's an option play without Tails in single-player if you really hate him, but not so in Co-op mode where he is even less use than usual. There's no split-screen and the camera follows Sonic if Tails gets left behind or too far ahead. This means the player controlling him has to sit there and wait for him to come back into play, again and again. Sonic 2's Co-op mode isn't quite unplayable, but it's certainly no fun for the person controlling Tails. Nor for the person controlling Sonic as they constantly have to keep slowing down. Not to mention the endless conversations you have to have about where you should go next and why did you do that I said that way NO THAT WAY YES I DID OW OWOW I'M TELLING MUM ANYWAY LET'S TURN IT OFF PRESS GANG'S STARTING. Or so it was in 1992 anyway. Nowadays the kids are probably all watching Skins and Channel Five documentaries about women who can turn themselves inside out. Anyway, SEGA has missed a trick here. An online Co-op mode could have been good fun. There might still be an issue with one of you racing ahead, but at least the other one wouldn't have to constantly wait for Tails to float into view with all the urgency of a feather.   At least the online Versus mode works well. Quite simply, you race against an opponent to see who can complete levels fastest. Seeing as speed is such a key element of the Sonic games this makes perfect sense. An option to play in full-screen might have been good, but split-screen does have its advantages. Along with keeping an eye on your opponent's progress, you can laugh down the headset when they get stuck in a tricky area. There are three zones to race through in Versus mode: Green Hill, Casino (much potential for headset-focused laughing here) and Mystic Cave. Even better, you can compete in the Special Stage. Here the camera is behind Sonic and Tails and you're running down a half-pipe trying to collect the most rings. It makes a nice change from straightforward racing and it's superb for multiplayer. You have to jump in front of the other player to get first dibs on rings, and consequently both characters end up bouncing around like water off a mogwai's back. Unfortunately the Special Stage levels are dreadfully blocky. It's odd, because everything else in Sonic 2 for XBLA is nice and smooth. Here Sonic and Tails are running along tracks made out of Ceefax. If the Rainbow Road in Mario Kart gives you a headache, this will give you a brain tumour. That's one of only a few complaints we have about Sonic 2, though. Yes, the Co-op mode is rubbish and it's a shame there's no online option. True, there could have been more level choice in Versus mode. And okay, Tails is shit. None of that matters when you're in single-player mode, zooming left and right and upside down and smashing open a tunnel and spinning round an s-bend and hitting a springboard and soaring into the air. All in the space of two seconds. Sonic the Hedgehog 2 was brilliant in 1992, and it's brilliant today. It's also much cheaper. Just GBP 4.25 will buy you hours of fun. Not millions of hours, because games were shorter in those days. Not all of them were better, but Sonic 2 is an all-time great."}