{"ref": "https://www.eurogamer.net/r-vcroundup-140907", "date": "17 Sep 2007", "game_name": "Reviews", "text": "It was, as Lennon and McCartney so presciently trilled, twenty years ago today. OK, they were talking about Sergeant Pepper teaching the band to play, not the release of Super Mario Bros, but the point still stands. Even though, yes, Super Mario Bros was actually released twenty three years ago today. And, admittedly, by ~today~ I actually mean ~the Thursday just gone~.Gah. It's not going well, is it?So, as I stumble awkwardly from the wreckage of that ill-conceived intro, the point I'm trying to make is that to celebrate two-and-a-bit decades of Italian plumber action, Nintendo have designated the rest of September as their Hanabi Festival.  Over the next three weeks, we'll be getting themed VC updates of cult games never seen outside Japan. This week it's Mario, next week brings ninjas, the following week Sci Fi games.Sadly, and rather cheekily, this Very Special Event also seems to have resulted in a few curious price hikes...This is the real treat of this whole Hanabi business - a title steeped in gaming lore, officially unseen in its original form and available only for a limited time. Unlike the other games to be released over the next three weeks, this one will vanish from the VC at the end of September. Possibly in a little puff of smoke.What is it? Well, to Mario fans, it's the real sequel to Super Mario Bros, released as SMB2 in Japan but deemed too hard for us feeble gaijin. Instead we got a re-jigged Doki Doki Panic with Mario sprites. The Lost Levels finally saw the light of day over here as part of the SNES Mario All-Stars pack, but here you get the chance to sample the unaltered Famicom Disk System version - which is presumably why the price has crept up to 600 points, rather than the usual 500 for an NES game. Cheeky.While The Lost Levels are considerably tougher than the original Super Mario Bros, they don't stand out as particularly savage when compared to some of the other games of the mid 80s. It's no longer a two player game, but you can choose between Mario and Luigi at the start. Both now have different abilities - Luigi is better at jumping, Mario is faster - though the game itself looks pretty much identical to the first.What you do get are some fiendish level designs, new enemies, and even environmental effects such as gusts of wind that make precision jumping even more difficult. There are even some sly tricks, such as poisoned mushrooms that can kill you (they were recoloured for the SNES version to make them easier to spot) and some very nasty warp gates that actually send you back to earlier levels, rather than allowing you to skip ahead.For the Mario purist, this version is vastly preferable to the SNES do-over and it's technically a much better game than the western Mario 2. Retro collectors will appreciate having such a historically important game in its original form, but for casual players I'm not entirely sure it's worth the extra points for a game that can often feel more like a remix than a true sequel.8/10"}