{"ref": "https://www.eurogamer.net/r-vampire", "date": "12 Sep 2007", "game_name": "Vampire: The Masquerade - Redemption", "text": "Being a vampire in Redemption is                 really no harder than being a human being - once you have                 taught yourself to stay indoors in sunny weather (though I                 dare say that most people who play this game do that anyway)                 and stick to the red liquor, things are remarkably easy. That                 is, unless you have done something silly, like get                 romantically entangled with a mortal...                    As the hero-turned-vampire Christof you spend most of Redemption            traipsing through the catacombs of Prague, Venice, London and New            York. The level of detail throughout these locations is            astonishing; in fact Vampire's graphical style is so well defined            that it is truly unequalled amongst other role-playing titles. The            fully 3D environments are a far cry from the pasted images of Final            Fantasy VIII, and even though they are detailed, they don't slow            you down to a crawl as with Ultima Ascension.                    Looking the part is something Vampire does with relative ease. The            moody ambient lighting that illuminates the night is a trademark,            and you will see a lot of it, since Christof doesn't get out much            during the day. It's echoed by the moody ambient music that            accompanies the action throughout, racey in places while subdued in            others. It all looks great and sounds great.                    The only areas of Vampire that look slightly suspect are in its            opening sequences, prior to your conversion to the dark cause. The            level of detail is remarkable, but only when bathed in shadows and            eerie darkness - with full lighting things look a little too            garish. Once darkness descends though, even the usually            clichéd sections like abandoned mines and sewers seem fresh            and original.         The characters in the game are also                 superbly rendered, with fantastic, smooth models that really                 look like humans, albeit rather bulky ones. The weapons they                 use are fearsome-looking, and everything is bathed in                 pseudo-realism, right down to the way the weapons glint and                 shine as they are brandished openly in combat.                    Although the visuals are mostly stunning, the texture mapping on            characters, and particularly Christof with his cape, is a little            flat. The animation of the characters' faces during dialogue            sequences is also slightly out of sync with their motionless pose,            and the overall effect suffers as a result. This is especially true            of the in-game cut-scenes and cinematics, which lack tension due to            feeble camerawork and the stock-still deliverance of the dialogue.            People involved in action sequences should look fastidious; these            characters look like they are attending a funeral.                    That's not to say that the story isn't very good though - the game            is based on a cracker of a tale, with love, hate, flashbacks and            adventure. Your character Christof is wounded in action and nursed            back to health by a young damsel, whom he falls in love with.            However when he's converted to a vampire he has much to struggle            with, as he learns to disregard his strict religious upbringing,            and retain his impossible love.                    Disappointingly, there is no real development of Christof's            vampiric side, he just seems to become and live as an isotropic            vampire, without first struggling with his identity as one would            expect. It doesn't help that the voice acting is unconvincing, and            to disguise this fact there is hardly any character interaction            whatsoever. The plot becomes largely forgettable...         The inconsistent nature of the plot is                 also unhelpful. For starters, if one of your party is killed                 in combat you often have the clerical ability to revive him,                 but if the plot dictates that your character is to die and                 they do so in your arms during a cutscene, regardless of how                 much blood and magic you have coursing through your veins, it                 isn't going to help.                    Dying is a bit of a moot point to be honest; you expect vampires to            be rather tough customers, but not if Redemption is anything to go            by. The fact that the combat system is simplistic and muddled            doesn't help either. The point-and-click nature of the game extends            to the combat, and it's totally unsuitable; you just keep clicking            on a target until he, she or it perishes. This may have worked in            Diablo II, but in Redemption it's just boring, and leads to many            unfortunate deaths as you wildly swing your weapons this way and            that, only to be out-foxed by a little blighter who has run in            knee-high and swiped you.                    Combat allows you to command a number of diverse ~disciplines~,            which is shorthand for ~magic spells~ that you can use either            offensively or defensively. The former allow you to summon            creatures and the like, and your defensive spells allow you to            enhance your perception and increase your strength. Many of these            powers are a bit muted when actually playing the game, although            they look good on paper. In fact, that's the key to most of the            redundant spells and attacks; they have been carried over from the            pen-and-paper version of the RPG, despite their overall            uselessness.         Nevertheless, the action isn't                 too difficult to deal with, especially with the abundance of                 spells and attacks. That is, of course, unless your ~friends~                 jump into the ruckus.                    If you have one to three other people in your party they will race            in, swords drawn, and attempt to liberate you. The problem is that            as they are rather bulky and the action rather concentrated, they            frequently get in the way of your spurious mouse-clicking, halting            your attack until you can get a clean click at your intended            target. To compound this, the collision detection is atrocious, so            actually hitting an opponent is often down to pot luck.                    Another problem is when battles take place in tight confined            spaces. Your character is a chubby chap, and your allies can't            exactly slip past, so they just line up behind waiting for an            opportunity to get through. Of course, since there won't be one,            you are forced to soldier on until the steady flow of enemies            subsides and you can get out for a breather.                    Later on you get guns and such, but unfortunately your friends do            little aside from shooting randomly at walls, and this doesn't            benefit you to a great extent. The guns themselves are underpowered            and overspecced, so it's largely academic, but they are ironically            representative of the transition from the past to the present. The            Dark Ages look stern and very dreary as you would expect, but the            modern day world just looks the same really, except for nicer            clothes and updated gadgets.         You've probably                 realised by now that I am bitterly disappointed with Vampire.                 I had really hoped for so much more - the concept after all                 has staggering potential, but Nihilistic haven't capitalized                 in the way they should have. The weak cutscenes, poor combat                 system and somewhat redundant spell system don't help its                 cause, and the game falls far short of what it could have                 been."}