{"ref": "https://www.eurogamer.net/rogue-galaxy-review", "date": "7 Sep 2007", "game_name": "Rogue Galaxy", "text": "For a new and unknown universe populated by foreign characters and unfamiliar places, Rogue Galaxy has enjoyed a rare weight of anticipation. Likely one of the last major JRPGs to be released for a system that has celebrated the genre in the West more than any other, it's natural for players to hope somebody thought to save the best until last. That the game follows in the glorious slipstream of developer Level 5's previous RPG triumph, Dragon Quest VIII, has only added to the burden of expectation placed upon these newly birthed shoulders.The points of interest don't end there either: for the setting the makers have opted neither for the medieval knights and castles of yore nor the steam punk post-apocalyptic desolation of more recent fashion. Rather, interplanetary space piracy with one keen eyeball on Star Wars and the other on Jack Sparrow aims to fill the galaxy-backdropped niche recently vacated by the Xenosaga series. And, finally, the game has the unenviable distinction of being the PS2 RPG that came out after Final Fantasy XII, and as such it's likely many players (even subconsciously) will be expecting that game's new lessons in design to have been absorbed and even evolved here.So in a sense, that the game mostly fails to meet these expectations right from the beginning is wholly understandable - even if it's no less disappointing for it. The opening scenes draw back the curtain on Jaster Rogue, the 17-year-old orphaned protagonist who lives in a prettily cel-shaded desert town, eking out a living as a beast bounty hunter on the nearby dunes. Jaster's home planet Rosa is under occupation by the Longardia Commonwealth. Soldiers stand guard supposedly against the Draxian Empire, but actually to facilitate the mining of the planet's rich resources. As these details emerge it's immediately clear the game's mythology and political climate is well-developed and mapped out with detail and coherence. The more micro plot elements also show themselves quickly and the first four hours of play seldom pause to draw narrative breath. Jaster is compelled by a passing mysterious bounty hunter to take on the huge monster attacking his town. No sooner is the monster broken and you're approached by the game's resident comic partnership, the staidly-monikered Simon - a kind of squat, lobotomised, bazooka-wielding Billy Connolly, and Steve, a super-camp downgrade to Star Wars' C3-PO. The pair persuade Jaster to leave his home and only family of 16 years - the kindly local priest - in order to join the crew of the notorious space pirate, Dorgengoa, and the Boy's Own-style adventure is begun. What's apparent right from the off is that the game shares all of its cousin Dragon Quest VIII's good looks. Only the occasional low quality texture sullies the otherwise resplendent patchwork of polygons that makes up the game's environments.  Characters, from robots to aliens to Amazons, are imaginatively designed and dressed and, save for Jaster's Luke Skywalker-esque poise, offer fresh and pleasing alternatives to most of the generic archetypes we're used to. The game magically seems to eliminate the vast majority of loading - each environment streaming from area to area in what is initially an extremely impressive coding accomplishment. However it quickly becomes clear that the game achieves the effect by herding the player through corridors of environments and as such it offers none of the sprawling, seemingly limitless (and reachable) vistas of Dragon Quest VIII.The battle system also seems initially fresh and compulsive only to reveal its true nature hours in. Battles are random but are generously segregated and, mercifully for many, they take the form of free-roaming action sequences in a kind of Devil May Cry-lite style. You take control of one character in your team (although you'll likely just play as Jaster throughout) running, jumping and switching on the fly between a close combat and ranged weapon to take down enemies. Certain quarry requires some thought and technique but, thanks to the very limited repertoire of moves, generally the game quickly settles into a repetitive grind.Your team-mates mostly take care of themselves only pausing every now and again to offer a suggested action they might take (such a healing themselves with a potion or unleashing a special attack) which you can then trigger by hitting the L1 button. Using the standard attack and defence functions most enemies can be quickly defeated, but all items (there are no traditional healing spells as such) and any special abilities have to be triggered via a more orthodox RPG menu interruption.These special abilities are unlocked for each player in a similar way to Final Fantasy XII's licence board. Each character is given a pre-determined grid (dubbed here the 'Revelation Flow'), which must have collected rare items inserted into its slots to unlock the abilities. Some abilities require multiple items (which can be found on the game's various planets) while others require just one to unlock. However, by limiting the bonuses to just special move abilities rather than also incorporating stat bonuses and more general iterative character upgrades, the game fails to compel players to drill its depths in the same way that Final Fantasy XII's superior system does. As abilities have to be accessed through menus rather than, for example, being mapped to unused buttons, their use breaks the fast flow of skirmishes giving them an awkward staccato rhythm that will see you often ignoring those abilities you've worked so hard to reveal. These small design annoyances are sprinkled throughout the game - but are nearly always balanced by a positive opposite that keeps the game from tearing. Invisible walls and barriers in almost every environment smack your face through the plate glass of disbelief while imaginative character designs and backgrounds bandage it up again. Likewise you'll curse the cumbersome equipping menu, which offers no direct statistical comparison between currently equipped items to those collected in your inventory while simultaneously praising the excellent item fusion mechanic that allows you to create new undiscovered weapons and items. Quick wipe-outs that fell your team in unavoidable seconds cause a frustration that is soaked up by the frequent save points and ubiquitous teleports.Similarly the dialogue oftentimes seems childish, wafer thin and dumbed down in a way that fails to simultaneously appeal to youngsters and a more mature audience in the way Level 5's earlier games did. However, the bug fighting tournaments, bounty hunter missions, assembly line mini-game and host of optional side quests provide a width not previously seen in the company's work. The story arcs in an impressive and straining curve but its conclusions are all foreseeable and, besides, only the most immature gamers confuse size and scope for depth and quality. But these are minor niggles and the generous and tolerant audience that Rogue Galaxy is vying for will take these on the chin. Many used to excusing the genre's lazy shortfalls may not even notice the unnecessary hoops they're being made to jump through in order to manage their team and the game's flow in Rogue Galaxy. But viewed objectively and set against the newest highpoints of the genre, aside from its gorgeous aesthetics and removal of load times, Rogue Galaxy just isn't the marvel it's been set up to be. That the game tries its hand so many ideas that Final Fantasy XII does better (the licence board, the bounty hunting, the political wrangling, the real-time battle mechanics) is unfortunate - after all, the games were both developed over the same period of time in Japan. But that is the risk any multi-year development project undertakes and, ultimately, the one game systematically bests the other in each area. That said, the games are not directly comparable in many other ways and, even where they are, this is undeniably still a good, enjoyable and very pretty game. Nevertheless, at this time, from this developer, Eurogamer won't be alone in mourning the fact it's not nearer a perfect, staggering and beautiful one instead."}