{"ref": "https://www.eurogamer.net/worms-open-warfare-2-review", "date": "4 Sep 2007", "game_name": "Worms Open Warfare 2", "text": "In 2000, Japanese director Takashi Shimizu helmed a direct-to-video movie called Ju-on. The same year he directed a sequel, which was pretty much the same as the first movie. In 2003 he directed a theatrical remake of the first Ju-on, this time subtitled The Grudge, and then promptly directed another sequel/remake before the year was out. In 2004 he remade the movie yet again, this time with Sarah Michelle Gellar for American audiences, and then in 2006 he directed another American-skewed sequel to this remake of a remake of a sequel. He's currently working on - you guessed it - The Grudge 3, which comes out next year. That's the same source material, reworked seven times, by one man.Don't panic - Eurogamer hasn't gone all Total Film on you. It's just that the arrival of the latest in the endless procession of Worms games is usually our cue to grumble about how Team 17 now seemingly exists solely to rejig an old 2D strategy game ad infinitum. Many have sniffed and sneered at such unyielding reliance on one idea. Not that I begrudge (ho!) them this indulgence. Done well, Worms is still one of the purest and most amusing games of its type, and if this is what it takes to keep one of Britain's oldest independent developers above water then so be it. Even so, to see the company that once bestrode the Amiga scene, colossus-style, working on the same game over and over does make an old hack like me feel a little melancholy. Bring me next-gen Superfrog, dammit.Naturally, when trying to keep the same recipe fresh over so many years, mistakes are bound to slip into the mixing bowl. The ill-advised move to 3D is now firmly in the past, but last year's grotty Open Warfare DS and the cute-but-truncated Xbox Live version both showed that remixing isn't always an improvement. Thankfully, with Open Warfare 2 the series has reached a sort of zen-like equilibrium, evolving the familiar Worms template in smart new directions and taking full advantage of the PSP hardware while retaining the fan-pleasing elements that have allowed the franchise to endure.For a series so shackled to a decade-old formula, Open Warfare 2 actually represents the biggest shake-up in how Worms is played in years, all without damaging the beloved core gameplay. Options, options, options are the order of the day, with a bulging bowl of customisation on the side. And blue cheese dip.There are several new game modes, each of which take the gameplay to fun places. Puzzle mode, as the name suggests, gives you a set task to perform and limited means with which to achieve it. Sometimes it'll be reaching a checkpoint, nestled on some seemingly impossible outcrop. Others involve killing a set number of worms (who don't return fire) from some disadvantaged location, or using a limited weapon set. As well as offering a nice change of pace from the turn-based slaughter that made Worms famous, there's also a strong educational element to these challenges. Success relies shrewd use of the various means of traversing the terrain - ninja rope, teleport, jetpack - or skill with the core weapon types. By getting better at Puzzle mode, you're also getting better at Worms proper.There's a more carefully constructed Campaign mode, which offers up more interesting scenarios than the usual four-on-four deathmatch. Starting in the Pirate era, you work your way through levels set in both World Wars, the Cold War (ie ice levels) all the way up to space combat, with reduced gravity. Each Campaign mission boasts some new tactical obstacle - such as an enemy worm bunkered at the bottom of the map that lobs air strikes your way once his comrades are disposed of - and there are even boss battles at the end of each time period. These pit you against a single worm, who is either tricky to reach (the first is on top of a mountain surrounded by mines) or hard to defeat (the second has over 200 health)."}