{"ref": "https://www.eurogamer.net/madden-nfl-08-review", "date": "4 Sep 2007", "game_name": "Madden NFL 08", "text": "A violent trivia: each sack a quarterback endures lessens his life expectancy by two days. Two days! A legitimate week's end, as it were. Forty-eight hours the chap could've spend picnicking, dating female leaders-of-cheer, inking an uninteresting memoir, or playing video game football, presumably. Sport is a sacrificial job, but for all their million-salaried selves, what's braver than gambling moments of your life over a few yards of turf?And indeed, what's braver than handing off £40 for a mere roster renewal? This is the hypothetical Maddeners size up with each sequel; in totality, a situation not unlike the one faced by real-life QBs. Cumulative concussions, tackles and tumbles invite brain hemorrhage like clowns to carnivals; the gamer endures similar erosion. They trust linemen to protect them, and we faithfully deposit our cash to upgrade degraded virtual downs. The annual update is an opportunity to refresh away some of the natural repetition sports supply - setting a skipping record to a slightly new rhythm. Successful? Sort of, in this instance.EA continues to pile features onto its flagship. We've bagged a questionable QB vision cone and well-integrated superstar system in a pair of prior next-gen releases, but is Madden still meaty with content? Sure. Stable mechanics are retained, as well as well-animated models and enough appended mode madness to extend the experience. Donning the hat or helmet of manager, owner, scout, player and coach all at once (or independently) is a depth most athletic titles can't attest. In this way, 08 is still a Katamari, steadily rolling up new code among the debris. This Madden's new matter is lead by a ~weapons~ module. No, NFL stars' criminal personalities don't come into play (a missed double entendre for the shotgun formation, sadly). Instead, 21 abilities describe the most gifted players in the league. Cannon arm QBs, smart safeties, crushing run blockers, brick wall defenders, and big foot kickers are included, with some stars strapping more than one armament from the arsenal.Weapons essentially boil down to a counteracting component that nicely extends existing metagaming. In use, the system stems from a left trigger pull during pre-snap. Doing so highlights weapons on the field and identifies any mismatches - noting Ladanian Tomlinson's status as an elusive running back invites an exploit of the average linebacker he's paired against. Brainy Tom Brady's smart QB ability lets him read the opposition's plays on occasion. Most munitions have a converse, too: Torry Holt's qualified as a spectacular catch receiver, meaning he's prone to making acrobatic grabs but vulnerable to big-hitting defenders while airborne.The weapons are essentially accentuations of what we already know (Peyton Manning throws effectively, etc.), but they do present something visually accessible for casual fans and deepen the avenues for strategy already in place. It's welcome condensation, really. Rather than weeding through tables of ability ratings to calculate the virtual difference in Randy Moss's and Steve Smith's stiff arm stat, (they're still there, if you're the scrutinizing type) stars are better served by these little icon underlays. Oppositely, EA's attached receiver spotlighting to negate some of the arms racing. Maybe Shaun Alexander, last year's cover athlete, is shouldering through your line irrespective of the perfect plays you're drawing up. Tagging him with a spotlight whispers a polite ~ahem~ to your secondary, helping to neutralize nagging threats if they're relied on too often. The interface snaps snugly into the array of standard pre-play options: feigning a blitz, shifting the defensive line, zoning your linebackers, calling up an impromptu run when it's transparent your opposition is protecting the pass. It's these adjustments that fashion the freedom to outsmart opponents online, and they remain a rewarding aspect of competitive play. More, they emboss Madden as the grassy chess match it's been developed to be.Ah, but there is that ~exclusive licensing arrangement~ thing, isn't there? How's that faring? It's reasonable to say that the lack of established competition hasn't much motivated EA Tiburon to genuinely grow its golden goose. Online play is the prime platform for Madden's tactically-aligned features, but it’s received only novelties with 08: trackers of personal statistics and the real-time scores of Xbox Live games-in-progress. Hooray. Online leaguing is a gaping hole in EA's gameplan still tapping its foot. It's also something that sister title NHL 08 will deliver later this month. Hmm.Head-to-head is continues to be a blast, if a bit unbalanced by turnover probabilities that seem programmed for an amateur (Canadian?) league. In single-player, interceptions can thankfully be tweaked with a slider (fumbles can't, oddly), but the default setting remains fixed in ranked games. Expect the ball to exchange hands at least a half a dozen times in a 20-minute match - secondaries pull passes out of the air like they had ripe papayas pinned to them, and fumbles are equally frequent. When so much hinges on precision play calling and outsmarting the other sideline, it's annoying to have stratagems deconstructed by unplanned possession swaps. At least they work both ways. A handful of other quirks from last year's edition are now quashed, including the non-functioning fatigue meters we enjoyed in 07. But there's just as many still marooned. Superstar mode is made awkward at most positions with an inflexible camera. Players still struggle to stay in bounds on down-and-out routes. Otherwise, we appreciate the added branching animations, which actually improve the responsiveness of the controls a tad because players transition as they should. The models that perform the motions are better proportioned than the bulky, inconsistent ones we saw last season, too.Athlete avatars impress, but the outlier in Madden's presentation is undeniably its audio. Turf-level sounds are fine (aside from a crowd that could be more dynamic), but the commentary lacks color. Literally. A lone radio reporter spouts some of the blandest broadcasting you'll hear, with no added anecdotes, insight, observation, or history shared with the gamer whatsoever. There's a sense of anonymity, almost. Brilliant plays aren't highlighted beyond a generic exclamation. Even when you've bulldozed your way to the Superbowl, the crown gem of the gridiron, a unique word won't be heard. Considering the culture of the sport and the broad budget backing Madden, failing to perpetuate any celebration (immersion, dare we say?) in the player is inexcusable. Expected in something like a FIFA Street game, perhaps, but not a title with in-game sponsorships from a cellular phone, clothing line and candy bar. Still, save for the turnover magnets they've embedded in defensive backs, Madden's pocket of core content is well-protected. Superstar mode adds the ability to play as an incoming rookie in addition to a created player. The truck stick still handles great. If you could care less about NFL clubs, create-a-team's finally been reinstated. And hey, the 360 release runs at double the frame rate of the PSThrice variant. What's, ahem, maddening, really, is that there simply isn't much new to play with. The weapons feature, for all the proliferation it promotes, is kind of redundant. Marvin Harrison is a quick receiver? He'd be just as fast with or without an icon to indicate his agility. Weapons broaden the tactical scope and contribute some accessibility, but as we await an outright improvement of the (still quite fun) online mode, what we get in the meanwhile is more a car wash with wax than an outright engine swap. Which means the software runs solidly for newcomers, of course. The ~if it ain't broke~ claim still applies, but in this instance, Madden 08's competition is its younger, cheaper self. Where 07 elevated the play significantly over the thin, crammed-to-Christmas launch offering of 06, 08 lacks a proportional progress to justify purchase for many returning fans. Madden 08 stands by itself as a respectable, rewarding sim, but judged in the context of last season, it's merely a mild, expensive improvement."}