{"ref": "https://www.eurogamer.net/umurangi-generation-special-edition-review-a-uniquely-thoughtful-game-about-crisis", "date": "24 Jun 2021", "game_name": "Reviews", "text": "To plan ahead, or just jump in? Umurangi Generation is a game about taking pictures, and at the beginning of each level you can begin, if you wish, by having a look at the list of specific objects you are asked to snap. These are the bounties for you to deliver. Two disposable cameras. Skateboards. Two cats, but taken with a telephoto lens. A mortar and a shotgun and - hey wait, what?So you can go in all methodical. You can yoke yourself to the ten-minute time limit always ticking down, which gives you a bonus if you get your work done within its bounds. You can head out into the world thinking, ~Skateboards. Two cats. Two cats. Cats!~ It's pretty entertaining. Where are those dang cats anyway? Where's my telephoto lens?Or you can just jump in. I often jump in. I take a few pictures, I try a few lenses. I get acquainted with the fluttery, mechanical, intricate thing that is the camera I'm holding, its riot of moving pieces and tight grasshopper windings somehow making themselves known through the Switch I'm actually holding. Through the magic of haptics, perhaps, or the sheer suggestibility of the brain. I snap a few things and maybe I get lucky - oh, that was on the list, was it? (Each item ticked off the list is accompanied by a sort of musical wind chime effect that is always a thrill to hear.) And then I am confronted by something or other. In the middle of a level, I will see the wall. The huge wall. The wall that is stenciled as property of the UN, with a fine for any damage caused to it. Hey wait, what?Umurangi Generation is a game about an awful lot of things beyond taking photographs - I am going to have to be selective here. One of the things it's about is the point at which two worlds intersect. The place you're dropped into in order to get your photos is Tauranga, Aotearoa, in the grip of a great crisis. The crisis is the stuff of sci-fi, and I won't spoil it because a lot of the game revolves around teasing it out. But I will say that like so much sci-fi it's in there to channel stuff that is very real and very topical. Tauranga itself is seen from the perspective of young punks and skaters - a friendly, artsy domestic scrabble of marker pens and spray cans, ramps and tape decks and intricate graffiti designs. On top of this - and it does feel like something imposed on top of the existing landscape rather than something that exists in any kind of harmony - the UN has moved in to ~fix~ things - too late, and with all the wrong ideas. They've brought walls though! And shotguns. And so you see the walls and the shotguns alongside the tape decks and the skate ramps and the marker pens and the graffiti. It's an aid mission, I think - one that looks increasingly like an invasion in of itself. Look at it: the UN settling in alongside the corporations and the ineffective, distracted government.This is a game with a vital, necessarily angry message from a generation and a group of people that feels unseen and unheard, while those in power ignore obvious dangers and have stupid priorities - forget the climate collapsing, what about that economy? - and only respond to disaster too late and in muddled, arrogant, self-serving ways. Here's the thing, though. While this is a game that comes from anger - Naphtali Faulkner, the designer, who is a member of the Ngāi Te Rangi iwi, was initially inspired by the Australian government's bungled response to the 2020 bushfires, as well as Covid - it's far too thoughtful and ingenious to be interested in delivering a lecture. This is a generous game that uses the camera it places in your hands to draw you into a narrative and give you the freedom and the tools to decide what it all means for yourself. To a player like me, an outsider who is shamefully ignorant of Māori culture and history and experience, this felt like an act of supreme generosity. To be among people and to take in the details and start to understand them: on Switch in particular, Umurangi Generation is almost a magic trick. Sure, you can do new stuff like use the motion controls to line up your shots now, (and sure, the frame-rate can chug in places) but on a deeper level, I swear some part of me disappears into that glowing screen and only emerges when I finish playing.The way it works is simple - you move through 3D dioramas taking a selection of pictures, capturing the objects requested in each level before you move on. It turns out this is an ideal way of getting to grips with a story, by looking at the world and the things in it, the way they're laid out, the relationships that suggest themselves. But more than that, it makes for a game in which that story enriches everything else. This is an exploration game in which you poke around in things and try to make sense of what's going on. It's a traversal game - yes, a slightly elbowy traversal game with its share of snags - in which you jump and double jump and eventually are able to rocket about on skates to get the perfect angle for a snap. It's a photography game in which you get the pictures you need but always in the way you want them - the game tells you what to look for, but you can frame the image and process it as you wish, and nobody judges you for that too strictly. What matters is your sense of expression - what you were going for with a shot and whether you got it the way you want it. And this encourages, rather than discourages, tinkering and experimentation.It's a beautiful thing. Set to the shifting cut-up soundtrack of ThorHighHeels' music, with level-loading announced by scraps of radio static, we get to see the world from the viewpoint of a group of friends, young and all but ignored by the government and the money people and the incoming UN who bustle around them with their walls and guns and solutions. Each level feels like its own universe. Underground - are we underground? - the landscape is viewed through pixelated grain, the spare forms of bicycles and poisoned trees disappearing into purple mist. Graffiti glows with angry, disappointed messages, and candles send up bright little lights at makeshift shrines. Elsewhere, up above the city in a kind of rooftop skate spot, paint cans and breeze blocks are sharply in focus while nearby skyscrapers are sketched in, looking over an uneven UN wall that seeks to hold back the sea itself. Bill posters for lawyers and bad sci-fi movies jostle with artefacts of a world that has become a bad sci-fi movie. There are gamer havens, VR bars where electrical girls ghost dance on tables. There are tents set up in sewers, makeshift bars in shipping crates. All of it bright fuzz-edged textures, expanses of blues and pinks and daiquiri yellows, with MS Paint detailing overlaid.  To be in this world with a camera is very special - to line up shots, to understand which items on your list of targets is actually a perspective challenge, a puzzle to frame it all, to dabble with optional bonus items, but also to slowly understand the role that having a camera puts you in. After a while you are of this world, but also outside of it, the camera a sheet of glass between you and what's going on. Until--!Crucially, there are the people you see. Pointed triangle noses and facial details Sharpied on in brisk dabs and dots, but an aeon of people-watching visible in the posing. The way people sag against walls, or bob their heads to distant music is deftly captured. The way people congregate around candy-chrome cars with downlighters staining the road beneath their chassis. On a train a soldier leans back in a diner car chair that is not made for leaning back in, hands awkwardly behind head, an ostentatious display of ease in a time of chaos. On a battlefield there is the real panic of field-medic work, a tangle of arms and legs, no sense of where someone ends and someone else begins, and you hover with the camera nearby. Themes emerge. The UN seems not to truly see the people around them; the two groups exist alongside each other but are separated, ghosting, while a late level in the campaign serves as a call-back reminder of how much the UN has chosen to ignore in their work in the first place, how little they have understood and engaged with, and how much less will be cleaned up when they inevitably leave. On a battlefield there is the real panic of field-medic work, a tangle of arms and legs, no sense of where someone ends and someone else begins, and you hover with the camera nearby. Locations get more complicated - and more vividly domestic - as the game progresses. Mission objectives constantly play with the large and small, the geopolitical and the personal, peace and crisis. You move between a rooftop party and a rooftop shooting range - you find spray cans and disposable cameras, but also a mortar installation with a face drawn on the barrel. At an underground UN facility in a later level (the Switch version also includes the four levels of the game's glorious Macro DLC) you're asked to navigate gatling guns and vast aircraft to find a half-heart locket hanging from a golden chain. It's a hidden object game in the same way that the Arnolfini Portrait is a hidden object game - it understands that there's a wonderfully poky nosiness about the things that the world's surfaces can suggest, that the things people own and live around have a power to move us.And for a player like me, who knew very little of this world going in, the whole thing drove me outwards to try and understand things even a little bit more. I first played Umurangi Generation on PC last year, and since then I've read Sea People, by Christina Thompson, a recent study of the Polynesian Triangle. In it, I read about a series of islands that had the misfortune to be on a route used by the Spanish Conquistadors, which meant that it was the fate of these islands' residents to be repeatedly ~discovered~ by the Europeans, forced again and again to play a subservient role in someone else's heroic - and entirely mistaken - story about themselves. Reading things like that, it's hard not to see Umurangi Generation in part as the coda to a situation that has been unfolding for centuries. This is a generous, brilliant game, then. Timely, but also timeless, like a perfect Polaroid snapshot."}