{"ref": "https://www.eurogamer.net/ecco-the-dolphin-review", "date": "20 Aug 2007", "game_name": "Ecco the Dolphin", "text": "Is there an echo in here? There is if you're a fan of SEGA's 16-bit output, with no fewer than three opportunities this year alone to get your hands on its lauded late '80s/early '90s output. Ecco The Dolphin first appeared this year on the Wii's Virtual Console service, downloadable for 800 points in unoptimised form, (complete with ugly 50hz borders if you're unlucky enough to be European). Then a few weeks later gamers had the chance to pick it up on PS2 or PSP via the fantastic value Mega Drive Collection which, lest we forget, cobbled together more than 30 titles for less than half the price that it used to cost to buy one of the flippin' things. Better still, you could even run all the games in prog scan and eliminate the borders. Perfect.And yet, after all that,  having already spammed the Virtual Console channel with all sorts of forgettable filler, Sega's now seemingly intent on re-issuing each and every title via Xbox Live Arcade as well. Colour us bemused. Admittedly the 400 point fee required to download Ecco The Dolphin works out significantly cheaper than it does via the Wii (£3.40 versus the almost criminal £5.60), but it's yet another one of those pointless additions to the service that you'd have trouble justifying purchasing at a quarter of the price. Sadly, despite still representing some of the most sumptuous visuals that the 16-bit era had to offer, the gameplay on offer is some of the most teeth-grindingly irritating we've come across in ages.It's a shame, because Ecco was a one-of-a-kind game with a wholly original premise. The gist is that some of the marine life has been mysteriously sucked out of the bay in a freak storm - and all that just because you wanted to show how high you could jump. How guilty do you feel?And with practically zero direction, you're left to try and figure out what to do next. This might have been normal practise in 1992, but in 2007, if you've never played the game before it's hugely irritating to be left to swim around with precious little idea of what you're supposed to do. With a little persistence, though, you'll suss out that strange 'glyphs' (whatever they are) are blocking your path, and in order to get past them you'll have to seek out a corresponding 'glyph key'. Confusingly, both look the same, and the only confirmation that you've even picked up the key is that circles appear around it. From there, you need to swim back to the glyph and squeak your sonar at it. Well of course.If the game's total inability to point you in the right direction doesn't immediately grate, then the fact that it's incredibly easy to die will leave you scowling with disapproval. In a curious concession to pointless realism, you can only explore underwater for a limited period before you'll drown (so why don't the Dolphins you end up rescuing drown? Huh? ANSWER ME!), rendering much of the game's initial exploratory charm redundant as you desperately try to find the next air pocket. But on the way to these safe havens are an unending population of what are officially known as spiky gits - the kind that you can easily ram into and get rid of, but which reappear the second they're out of sight. Turn around and they're back, ready to steal precious health away from you and cause maximum irritation. On top of the that, the controls just aren't particularly helpful to precision navigation, which is an absolute basic requirement in a game as pedantically difficult as this one. So, with broken controls, unhelpful game mechanics, and a total absence of any helpful signposting whatsoever, the game basically requires you to blunder around haplessly until you suss out what trial and error task it wants you to complete next. The truth is, most of the time you're just working out how to plot a path through the currents, finding keys and unlocking glyphs. It's hardly inspired stuff. For the game to then kill you off and dump you back at the start of a level...well. It's a wonder anyone bothered persisting with it when it came out.Nowadays, the whole farce is made slightly more tolerable on 360 thanks to the 'save anywhere' system, ensuring that you don't have to put up with such arcane mechanics. That said, you can't simply reload a save game when things are going wrong - you have to manually exit the game before it will allow you to do so. Hrmph. Quite what the point of doing that was we'll probably never know.Still, if you're some kind of Ecco apologist who poured their entire childhood into solving its many complex mysteries, then you're doubtlessly wondering why the hell this dribbling idiot is gibbering on about. How dare we urinate on your childhood memories! If this over-hyped relic still means a lot to you, then  fair enough - you don't need us to tell you that you imagined having fun with it, and we'd be the first to admit that it's a serviceable conversion that can't be faulted on a technical level. You even get the option to smooth out the graphics, stretch the screen and enhance the audio, which is a plus, and, as we mentioned, the save game ability is a real bonus. You even get achievement points to aim for, which, as we all know, are a curious fascination.But seriously. Do you really need to delve into this game now? And if so, wouldn't you feel much better about it if you could do so in the company of all sorts of other big Mega Drive names for a fraction of the price?  Although you can excuse Sega for trying it on with a true classic like Sonic, foisting dated crap like Ecco on us yet again feels like a monumental waste of everyone's time. Download the free trial if you must, but don't even think about parting with your hard-earned cash for this. It might still look pretty, but Ecco plays like a dog. Avoid avoid-o!"}