{"ref": "https://www.eurogamer.net/the-settlers-review", "date": "16 Aug 2007", "game_name": "The Settlers", "text": "Deep down, I think we all knew this wasn't going to end well. Multiple console versions of the venerable resource management game (spawned on the Amiga, popularised on PC) were promised as far back as 2002 yet never actually materialised. Eventually only the DS version remained, and even that slithered around the release schedule like the last fingernail-sized remnant of soap in a large bath. And then even that quietly vanished from retailer websites, finally emerging into the daylight as a GAME exclusive.Certainly not the sort of treatment usually dished out to games that are actually, you know, good.Such a beleaguered history has sorely tested the patience of those who fell in love with the series way back when, in the era of the Amiga and DOS, but most remained faithful. The DS port was, after all, based on Settlers II, widely heralded as the series highpoint and a game of the just the right vintage for the DS treatment.So why, with so many years in development, is this one of the most clumsy and broken games to receive a commercial release?Part of me feels obliged to run through the usual explanation of what the game is, and what it entails. Mostly this is because the original Settlers II is such a sweet and clever game that I want to try and restore some of its dignity before bringing my bootheel crashing down on the skull of this misbegotten impostor. In short then: The Settlers is part Populous, part Sim City. Indeed, it was one of the first games to combine elements from the two series and create the template for what would become the RTS genre. Unlike later variations on the theme, The Settlers is a remarkably pacifist little creation. The emphasis is squarely on establishing a thriving community, with military protection taking a backseat to forestry, farming and little geologists who whoop with glee when they discover something useful.It was also a rather slow and ponderous game, though this isn't really a criticism. For instance, providing food for your people is a multi-layered affair. Bread must be made by a baker, who must get flour from a miller, who gets his grain from a farm, which needs water to grow. Each must be joined up with roads, divided up by flag markers, between which your industrious citizens ferry raw materials around your domain. It's absorbing, it's challenging and - with its funny little pixel people - it's endearingly cute. Settlers II was all of this, and more, and a 10th anniversary PC remake came out last year. For the sake of your sanity, buy that instead.At first glance this DSercised version is utterly faithful, to the extent that the graphics are virtually identical. However, within thirty minutes play you'll discover that the switch to stylus and dual screen hasn't been entirely without problems. Pointing and clicking feels frustratingly imprecise, both in terms of accuracy and response. Selecting the tiny flags to build roads can be hit or miss, while icons can require repeated taps before the game responds. The scrolling is jerky, lunging about one square at a time, and navigating a large settlement can be a queasy experience.The game also makes no concessions for players new to the series (which seems especially idiotic when changing formats) with no hands-on tutorial to speak of, and a fairly useless manual. The basics are grudgingly sketched out, but you're left to figure out the intricacies of the game by yourself. Most inexperienced players will probably give up around the time your first pig farm fails to produce any pigs, because the game doesn't tell you that you need to burrow into the options and tell your Settlers to distribute wheat evenly between the mill and the farm before anything can happen. There's a lot of info to digest, so the game makes use of both screens, allowing you to swap them over with the left shoulder button at will. In theory this is a smart solution and, with its click-drag windows, does a decent job of cramming monitor-sized data into a tiny space. In practice it soon becomes a cumbersome trial. Basic functions require multiple screen swaps, and its easy to end up muddled. It's also prone to slowdown as your kingdom spreads, and even the opening movie chugs like it's being streamed from a floppy disc.All of which still wouldn't be enough to completely dim the Settlers appeal, were it not for the sort of frequent crashes that leave you wondering if anyone playtested the thing at all. For instance, saving your game and then switching zoom levels freezes the DS entirely. Urk. Clunk. Dead. Power down, reload, restart. It's the sort of repeatable, quantifiable error that even the most basic QA process should eliminate, yet here it is. In a finished game.And that's not all. One mission that requires you to launch ships to discover new land grinds to halt when the ships in question refuse to move. Game over. And so it goes on. The game is littered with units that don't seem to be doing what they're supposed to. There are even reports that it can be impossible to load the seventh mission. Not that many will be willing or able to get that far and find out.Games like Age of Empires and Anno 1701 have shown that PC strategy games can not only work on the DS, but can make the switch from desktop to handheld with commendable success. Even the rather flimsy Sim City DS managed to offer something that at least worked as advertised. Settlers II is a great game. A classic. This version isn't. It's a travesty, and one that should never have been released. Without the fatal bugs it'd be a disappointing put passable conversion but you can't play a game not knowing when or if the game will actually work the way it's supposed to, or if saving your progress will cause it to crash. There's only one score for a game like this, and it ain't pretty."}