{"ref": "https://www.eurogamer.net/r-vcroundup060807-wii", "date": "6 Aug 2007", "game_name": "Reviews", "text": "It's another good week to be a Wii-owning Megadrive fan, as three of this week's four new VC titles hail from Sega's sleek black beast. And, for once, it's a solid line-up of good games, across a decent spread of genres.This makes a nice change. While many games debut on the VC in their earliest incarnation, leaving fans to wonder when their preferred sequel will make an appearance, the mighty Shinobi arrives on the system in its finest version.It's not the first ninja platform adventure to make an appearance - the decent-but-obscure Ninja Spirit is already available - and nor is the VC short of side-scrolling hack and slash titles. Even so, Shinobi III (which, in typical Japanese fashion, was actually the seventh Shinobi game to be released) is still noticeably better than its rivals.Slick visuals and intuitive gameplay lure you in, and retro wimps will be pleased to learn that the difficulty curve is relatively tame for a game of this genre and vintage. OK, the boss fights can be tough, but you won't have to worry about being killed every five seconds and having to start over. It's not all katana and shuriken though, as there are occasional vehicle sections to vary things up a notch - ranging from a stint on horseback to a jetski, which may just be the least ninjary mode of transport ever.Seven stages, with loads of special bonuses to aim for, and you're looking at a fine slice (oho!) of vintage ninja action that still holds up today.8/10This cult Megadrive RPG doesn't start well. For one thing, the full title is Shining Force: The Legacy of Good Intention, managing to be nonsensical and pretentious in one go. For another, the game opens with a story so generic you'd be forgiven for thinking someone just mashed up Final Fantasy, Zelda and Chrono Trigger in a blender and strained out all the interesting bits. Magical kingdom...ancient evil...asleep for a thousand years...dark forces are stirring...world must be saved by inexperienced young apprentice. Blah blah blah, wake me when its over.Things get worse when you finally gain control of your naïve young hero, and you're tasked with wandering around the traditional top-down village, having unavoidable expositional chats with various characters and trundling from building to building as you wait for the game to just...bloody...start...So once things do get underway it's actually a nice surprise to find that, rather than the expected trawl through sprawling overworlds and chest-filled dungeons, what you've actually got is a tactical turn-based strategy RPG, very much in the vein of Final Fantasy Tactics. It's not quite that good, obviously, as the menu system is a little clunky and the free-roaming sections can be a chore, but amid the ocean of shoot-em-ups and platformers sloshing around the VC, anything with that little extra depth and scale is a welcome change of pace.7/10"}