{"ref": "https://www.eurogamer.net/atelier-iris-3-grand-phantasm-review", "date": "3 Aug 2007", "game_name": "Atelier Iris 3: Grand Phantasm", "text": "Three Atelier Iris games within two years and yet few who so eagerly put the boot in EA's sequel-spitting loins have cried foul. Partly that's because we're not used to cash cows arriving in the form of quirky Japanese alchemy RPGs, a genre in which it's perhaps harder to reuse art, assets and story from debut to sequel. But also, there's undoubtedly a romance to the idea of a small-time development studio nestled somewhere in the heart of the Nagano Prefecture working hard to improve their craft game by game. It's easier to forgive such brazen money-spinning when it's to fund an underdog Japanese studio whose children are probably on the brink of starvation or something.  But don't be fooled, while this is only the third game from the cutesy 2D RPG series to reach Western shores, in Japan it's the eleventh Atelier game to roll out since its 1997 debut. That Atelier Iris is essentially the Fifa of Japanese alchemy-based RPGs would be more forgivable if its quality was systematically on the rise. But, while Eurogamer described the first game as being ~executed delightfully~ the sequel fared less well due to feeling too much like ~tiresome and often unrewarding work~. And with Atelier Iris 3, the series settles into a steady conservatism (albeit within its niche) that ensures the game will find no favour outside of its core audience. In fact, even amongst this most forgiving of videogame demographics, this quirky game brings with it precious little to delight in.Nevertheless, for fans of the first two games Atelier Iris 3 is immediately comfortable. A familiar bright and vibrant palette colours the lush forests and remote town that forms the game's hub. These environments lack a little detail and intricacy (even when compared to some ten-year-old Super Nintendo titles) but, nevertheless, they do have something of a simplistic childlike appeal. Perhaps it's too much time spent with the PS2's other recent 2D offering, Odin Sphere, but this time around Atelier Iris' cheap and cheerful sprites feel tired, samey and shallow. This isn't helped by some sparse animation work: characters glide over environments, an obviously economical approach which hinders the player's immersion. Dialogue reaches for the kind of quirky and characterful humour that the Disgaea series has made its own, but which, in this case, mostly falls a little short. In part that's because Atelier Iris' set-up and scenario is nowhere near as fun or engaging as Nippon Ichi's strategy wunderkind. But while the dialogue (and accompanying character portraits) do have something of an over-the-top appeal, the story which they flavour is particularly weak.Lead character Edge and his alchemist friend Iris are on a quest to gather magical gems which, once collected will unite to form a book that can grant any wish. Along the way you meet up with the Mana sprites from the first two games that help them in the quest to unravel the gems' mysteries. It's a dull prospect introduced with a short and sharp opening which fails to unfurl into much at all over the course of the game.More interesting is the way that the game's missions are structured. Edge and Iris belong to the Raiders Guild, a group that supplies quests to mercenaries looking to make some money. In the same way as you might take on a bounty in Final Fantasy XII or pick up a mission of discovery in Etrian Odyssey  you must take on jobs posted to the guild billboard. Once a quest has been signed up to you must seek out the person who posted the initial advertisement, collect the details of your assignment, and usually find and retrieve some item or other for them for a reward. The story's development is triggered by your achievements within the guild. You have to take on a certain amount of quests to raise your guild rank level and, once these hidden criteria have been met, the overarching narrative continues. Problematically these side-quests are disparate and disjointed. This isn't an issue in Final Fantasy XII's bounty hunting structre (from which this game surely takes its inspiration) as in that game they function as an optional extra. Here, side-quests are integrated to being a central part of the game's progression and the fact that they are for the most part unrelated to the main story is something of a missed opportunity.The Atelier games are known for their more adventurous design ideas and, while this is the most orthodox of the three titles in the series, there are some innovations. The games dungeons and forests are known as Alterworlds and, once entered into, a countdown timer triggers. When the timer reaches zero you and your entourage are kicked out of the world and whisked back to the main town again. On one hand the urgency this brings is a welcome addition; you'll frequently find yourself racing through areas desperately in search of a specific item or monster. However, arbitrary timelimits are also one of videogaming's most obvious design crutches in other genres and they lose none of their occasional irritation in this context.An alchemy system, in which you'll be helping Iris to concoct all manner of items in her cauldron, also forms a core part of the game - some unique creations are specifically required to gain quests. This element is fun but, as it's now a stock feature in most modern JRPGs from Dragon Quest VIII to Blue Dragon, it's does little to make Atelier Iris stand out these days. Fan of the first two games will initially feel at home here but, under prolonged scrutiny it reveals itself to be the weakest of the set. Gust clearly has some very hard working and dedicated employees. For gamers, at least, it would be preferable if their managers focused more of the studio's efforts on quality, invention and refinement rather than expending everybody's energy on increasingly mediocre quantity."}