{"ref": "https://www.eurogamer.net/guitar-hero-rocks-the-80s-review", "date": "2 Aug 2007", "game_name": "Guitar Hero: Rocks the 80s", "text": "As you've probably established by now, we - like most other right-minded gamers - are rather fond of Guitar Hero. Time and time again, we'll go back to the old favourites from the first two games, particularly with the addition of co-op play and the bewildering sense of accomplishment that accompanies every successful phrase still awes us to this day. Even most of the best games out there aren't getting played for nearly two years solidly after release, testament, if it was needed, to the outstanding quality of Harmonix's titles. And although this time-travelling song pack might be enjoyable in as much as it's still Guitar Hero, you can't shake the feeling that something just isn't right here.Menu screens and so forth come straight from GH2 for the most part, this time with a slightly more garish palette in a bid to convince you that it comes from a time when Timmy Mallett was still a household name. New character models offer slightly more hope as to the quality of this release but with fewer stars than we're used to and some lacklustre efforts (Axel barely changes while the Grim Ripper gets 3D glasses and a Flava Flav inspired clock medallion), even this early on it's clear that we're not off to a flying start. Arenas and instruments go untouched save for the odd colour change or slight alteration but there's little here to convince you that this is a proper new game.But it's song selection that really lets this package down, presumably pieced together to appeal to the older end of the series' demographic yet alienating almost everyone else. Harmonix appears to have rounded up some rather niche tunes from an already niche genre with the end result being that we've yet to find anyone who knows even half of the tracks out of the thirty on offer. That's not to say that they're all bad, though. Oh no. Dio's Holy Diver gets the comedy value vote every time, Turning Japanese and Ballroom Blitz (a song from the, er, 1970s) are always crowd pleasers and Extreme's Play With Me is a suitably insane finale to test the skills of any would-be guitar hero. One thing we did notice about Rocks The 80s is that while Neversoft is reportedly set to make GH3 'more accessible' (read: easier), this stopgap title doesn't pull so much as a single punch. Even the first few sets feature a couple of noodling solos that wouldn't be out of place in the latter half of GH2, making for quite a shock for those people who have recently moved up to Hard or Expert modes. While good for seasoned players, progression through the six sets isn't anywhere near as well structured as in the two 'proper' games - tricky songs crop up early while some later tunes could easily be bumped down a couple of sets. Further evidence for the 'rush job' case, then. Elsewhere, all the multiplayer modes and practice room from the second game are ported straight over here with nothing gained or lost. Head to heads are still wonderfully strutting affairs (particularly with some of the songs that have been dredged up) and being able to slow segments down and learn them is not something we ever want to be without again. While we'll always welcome more tunes for Guitar Hero, Rocks The 80s doesn't manage to feel like anything more than the cheap cash-in it so clearly is. The cheap front end, bizarre choice of tunes and total lack of extras make the fact that this is a full price title somewhat jarring - at GBP 15, a lot of these shortcomings could be forgiven as is so often the case with expansion packs but putting it out at full whack is cheeky indeed. At its best, Rocks The 80s is as good as Guitar Hero ever was, which is just phenomenal. Nailing tough passages is no less rewarding than it was the first time we aced Bark At The Moon and if nothing else, it's a fair appetiser for the double main course of Rock Band and GH3 which will be with us before the year is out. At its worst, though, this is a meandering cock rock 'anthem' you've never heard and worse still, one that hints of the Guitar Hero franchise being sullied by constant SingStar-style stopgaps. Most disappointingly, the specialisation makes this rather an obscure little thing for anyone not already familiar with the series, which normally boasts enough diversity and flavour in its track list that everyone can find something they like and rock out. For enthusiasts, it's thirty new tracks to master at a rather inflated price and will certainly entertain for a while and add extra variety to your Guitar Hero collection. For those of you who haven't yet been bitten by the Guitar Hero bug, though, the second game is still your best bet until GH3 and Rock Band arrive to shake things up at the end of the year. One for 80s obsessives (you know who you are...) and die-hard GH fanatics only."}