{"ref": "https://www.eurogamer.net/civilization-iv-beyond-the-sword-review", "date": "24 Jul 2007", "game_name": "Sid Meier's Civilization IV: Beyond the Sword", "text": "Bad news - they didn't bring back Leonard Nimoy. The highlight of Civ IV, was of course, the befuddled-sounding Mr Spock solemnly intoning ~BEEP. BEEP. BEEP~ upon the discovery of satellites, or confusedly quoting Velvet Underground lyrics when rock'n'roll was created. While Beyond the Sword is an excellent expansion pack in all other ways, that a few more shillings could not be raised to have the poor soul record new lines deserves a mournful moment of silence. Instead, Sid Meier steps into the breach to dole out the requisite quote whenever a technology not already in the parent game is researched. The man's a legend for sure, but unfortunately he has exactly the voice you'd expect of a middle-aged American game developer. Hint: it's a few octaves higher and a whole lot more whiny than you'd really want of a disembodied voice that announces you've just made one of all history's greatest discoveries. Let's have Spock for God again, please.So, the second expansion pack for the fresher-than-ever strategy stalwart, and as observed in our review of the last one,  Warlords, it's hard not to go at it without a certain preconception along the lines of ~hang on, exactly what in this game needs expanding?~ Especially as Warlords has already redressed its parent's accidental bias against military victory. Well, what makes Beyond the Sword arguably the Civ series' finest expansion pack is that you don't really notice it's there. You play Civ 4 more or less as you've always done, and most of the extra bits slot in so neatly and logically that it seems they've always been present. They're so exact a fit, in fact, that were they not included in the vanilla game of any future Civ 5, Firaxis should be made to go and stand in the same corner of money-grabbing ignominy as Maxis have skulked for several years now.Traditionally, an expansion pack is like a benign tumour for its host game, a new lump crudely grafted onto a spare bit of exposed skin. Beyond the Sword, by contrast, is more like a new organ. It's a third lung for Civ 4, allowing it to breathe more easily - and you to craft a slightly more unique victory. 'Beyond the Sword' refers not really to the expansion having a slight modern-age bias, but to Civ IV now being less war-centric than ever. There are piecemeal tweaks throughout (for instance, far-flung colonies can secede from an Empire and set up shop on their own, while a space race victory now involves waiting for your rocketship to reach Alpha Centauri rather than simply building it), but the three most obvious additions are espionage, corporations and random events.This former is a ramping up of the fairly basic spy games in Civ IV vanilla. Rather than laboriously and expensively sending spies across the land to gather intel on your rivals, you can now gear a city or your whole civ towards espionage in the same way you can towards culture or production. With enough relevant buildings and manpower, you'll start automatically receiving info on what the other empires are up to, and can even choose to concentrate your efforts on a certain nations. Thus if Egypt are getting dangerously close to researching nukes, you might find out enough in advance to launch a pre-emptive strike (or desperately shower them with gifts in the hope their radioactive gaze falls from you). Of course, all this subterfuge will eat into your R&D, so the degree to which you favour intelligence over brawn or commerce can affect your game enormously."}