{"ref": "https://www.eurogamer.net/pc-roundup-review", "date": "23 Jul 2007", "game_name": "Reviews", "text": "Hardcore flight sim enthusiasts can switch off now, because this particular program contains aircraft physics of a disturbing nature. They're extremely basic, but then they're supposed to be, as Attack on Pearl Harbor has been designed to be a pick up and play arcade game. The controls amount to tapping the space bar to take off, then banking and firing.The player has the choice of a quick dogfight or four campaigns, two American and two Japanese. The campaigns are actually quite neatly implemented, with a selection of missions and planes to carry them out with. If you lose a plane, you lose it permanently, and once your hangar is empty it's game over, although extra aircraft are awarded for scoring a number of kills (as are medals and promotions).Initially, it's all quite enjoyable and easy to get into, with some reasonably impressive graphics and a smooth frame rate even with the details notched up. There's a heart warming low-tech buzz about the destruction, whether you're screaming down in your dive bomber and blowing up battleships, or raking the enemy's fuselage with your fighter's machine-gun. It isn't long, however, before the cracks in the fuel lines start to appear.One of the biggest problems is the missions themselves are overly similar. There's a core set of scenarios - attack, defend, escort and recon - and they soon begin to feel rather repetitive. Elements of the HUD design are poor, in particular the small black crosshair which is too easy to lose sight of. And the less said about the throttle control, the better. This allegedly dips (or boosts) your speed while the appropriate button is held, but it seems to make little difference, which isn't very handy when you're desperately trying to slow down to keep behind an enemy bandit.Still, if you fancy a spot of no-frills arcade dogfighting this will keep you entertained for a while, and there's also a LAN/Internet multiplayer (offering free-for-all and teamplay modes).5/10Hands up who's played Doom 3? Hands up who wants to play it again? Now that's not an entirely fair comment on this first-person shooter - it's not exactly the same, but its dark corridors, sci-fi setting, completely linear path through the levels (ooh another locked door) and the odd puzzle thrown in which involves shifting boxes around will remind you strongly of the realm of the cacodemons.Where the game is different, sadly, it's generally for the worse. The cinematic cut-scenes are poorly voiced, the characters unconvincing, and the plot is so-so at best. The developer has thrown in bullet time to try to spice things up - which is activated by taking a drug called Hubbardium that the story revolves around - but that's hardly a master stroke of originality either.The graphics - average. The sound effects - average. The music - below average. Even the arsenal of guns - painfully average (shotgun, machine gun, sniper's rifle, blah, blah). There's only one area where the developer has managed to pull its head out of the arse crack of mediocrity, and that's with the AI.Enemies will charge you at times, or take cover appropriately, and sometimes act a little unpredictably in a sort of human-like way to keep you on your toes. Unfortunately, sometimes they'll also act unpredictably in a sort of random running up and down the corridor while you shoot them way, so even the AI is patchy.Alpha Prime isn't even all that long, boasting just ten levels (and no multiplayer), although you could argue that's a blessing given that as drugs go, Hubbardium is about as addictive as cod liver oil.3/10"}