{"ref": "https://www.eurogamer.net/tom-clancys-ghost-recon-advanced-warfighter-2-review", "date": "18 Jul 2007", "game_name": "Tom Clancy's Ghost Recon: Advanced Warfighter 2", "text": "Perhaps I'm just a bad leader. Even though I don't get my men killed that often and they diligently trot out ~nice shooting, sir~ when I make a headshot, I don't get the impression they're happy. Or even conscious, to be honest. They don't talk to each other, they don't joke, they don't complain about being told to walk backwards into a firezone. Occasionally, if left to his own devices for a while, one will pathetically inquire ~sir?~ in a voice that sounds like a slightly butchered C-3PO awaiting instruction. But that's it. It's creepy. That's why I've started tackling missions on my own, leaving my squad back near the insertion point to stare blank-eyed at the floor. I might well be in extreme danger as a result, but at least I no longer feel like I'm being followed around by three shop dummies wired up to dog brains.Such unease aside, GRAW 2 on PC is a significant revision from its earlier console incarnation, especially in terms of squad control. A new overhead tactical map mode means long chains of orders can be set for one or all of those dog-robots in the guise of men, even down to the direction they face and the width of their firing arc. While this does mean your control over your Ghosts (for the uninitiated, they're a squad of near-future US commandos fighting insurgents) is absolute, a certain self-sufficiency has been sacrificed. These guys can only do what they're told. More positively, this means GRAW 2 is entirely your game - your dog soldiers will only do your dirty work if you're canny enough to tell them how to do best do so. Your own glory is never snatched away by gung-ho AI.There's a real pleasure to setting a skirmish up then watching it be played out exactly as planned. Your men move into position, there's a handful of bullet noises, and one by one the red diamonds that signify enemy locations blink out. It's over in seconds. These Middle-Eastern terrori... ah, 'Mexican renegades' are no match for US might, it seems. (~Thees ceety, what haff we done to her?~, asks a Mexican loyalits you're allied with as he regards the ruins of Juarez. ~It's called the price of peace,~ responds your character, apparently only just holding back a yee-haw afterwards).  You don't need to fire a shot yourself, though conversely being an accomplished mouse-jockey means most skirmishes can be mastered without your mates on the easier difficultly settings. In either case, such military precision, if you get it right, rarely fails to raise your mouth into a smug half-smirk. While GRAW 2 might be lacking personality, this is certainly a slick game. The tactical map is far easier and more intuitive than anything involving the word 'tactical' usually tends to be. Its odd, satnav omniscience is not a requisite either - you can direct your men through the FPS HUD instead, with a couple of mouse-clicks sending one or all of them to anywhere within sight distance. This is just dandy if you're only sending them to a wall five metres away. Unfortunately, if they're a way off from your position, they're agonisingly slow to catch up. Give such an order and half the squad will stop to have a think about it first, often just stand still or only go halfway. The maddening AI problems of the beta code we had a look at a few weeks back have been fixed somewhat - there's no getting stuck on a rock and running on the spot until the end of time here. Instead, anything that might cause pathfinding breakdown is sometimes entirely ignored, requiring your giving multiple orders to coax your glassy-eyed compatriots over to where you want them. Particularly ridiculous is getting them to the extraction helicopter needed to finished most missions. You'll sit inside it on your own for a good couple of minutes while they bimble unhurriedly over and squint at the doorway in apparent bafflement. It's like having your bus wait at one stop for ages whilst a pack of doddery pensioners struggle to climb the step and fumble for the correct change. Only you're supposed to get out of there before a bomb goes off, and they don't seem to care.Enemies aren't much better. There's similarly no life to them - faceless and identical, they wait where the game spawns them, created alternately as either hawkeyed sharpshooters or villains from a Bruce Lee movie, running into the path of your fire one by one. Notch up the difficulty and they're all suddenly crack snipers, changing the nature of the game entirely from the fairly straight FPS it is on Easy or Normal to almost a strategy game, wherein you spend most of your time on the tactical map, placing your men and orchestrating flanking manouvres. It's a gruelling challenge this way, where a single mistake brooks complete failure - frustrating for anyone with a lingering desire to be Arnie, but a well-realised itch-scratcher if the one hit, one kill approach of Operation Flashpoint is your cup of death-tea.The net effect of the blatantly robotic AI on both sides is that GRAW 2 feels at all times like a simulation of war, not war itself. And of course it is, as all games with guns are, but there's very little of the adrenaline of, say, Call of Duty here. Everything hinges on how you set up the combat, rather than the combat itself, which is somewhat perfunctory. One could argue, of course, that this is how an impeccably-trained death squad should be, and that the pop-gun feel and sound of the firearms is far closer to reality than the juddering mega-splodes of Doom-y weaponry is. Me, I want something that gets the heart pounding, not just the knowing raise of an eyebrow as I overlook the resulting pile of mathematically-decimated corpses.So, an improvement on the (initially) buggy port that the first GRAW on PC was, but even with the pleasingly significant interface and visual tweaks over the console version, this is still very much a an adequate but not spectacular sequel to an adequate but not spectacular tactical shooter. It's GRAW, but a bit better, and that's it. Certainly, it's without doubt one of the more accomplished depictions of that cold-hued near-future-war videogames have been so hung up on of late, but it's not even slightly trying to improve gaming."}