{"ref": "https://www.eurogamer.net/golden-axe-review", "date": "16 Jul 2007", "game_name": "Golden Axe", "text": "Say what you like about SEGA, but it certainly knows how to milk its back catalogue harder than pretty much anyone else. Released on every gaming system from the ZX Spectrum and C64 to the Wonderswan and GBA over the past 16 or so years, Golden Axe is not a game that's exactly been given a chance to build up dewy-eyed nostalgia for. Seemingly every few months, this tired old hackandslash is ported to yet another format, and we're given the task of re-running through this 1989 arcade 'classic'. Makoto Uchida  must have laughed until milk ran out of his nostrils when he found out about its arrival on Xbox Live Arcade. Coming soon to digital watches...Peeping through the vines of this overgrown jungle of retro exploitation, you can just about make out what was once considered an impressive and important title. Back in 1989, the game's impact was huge for many reasons. For starters, it looked brilliant, with three big, bold, diverse characters in Gilius Thunderhead, Ax Battler and Tyris Flare to choose from, each with their own strengths and weakness and spectacularly destructive magic attacks. Unleashing these for the first time was thrilling.In game, you'd have even bigger foes to dispatch, with relentless but simple clobbering violence, comedy finishing moves and the appearance of gigantic tail-swishing, fire-breathing creatures on the way to defeating Death Adder. The icing on the cake was, of course, co-operative two player mode. For a few quick sessions, this, along with Capcom's Final Fight, represented the primary wave of arcade entertainment back in the day and made you all fuzzy inside. It was brash, exciting, juvenile and uncomplicated. No wonder it did well.What was reasonably good fun in single player was utterly transformed by the benefits of playing with a mate. In short, some might observe that the game was cynically designed to basically require two players in order to play it properly, but its raison d'etre was to extract maximum coinage from arcade visitors, so you can hardly blame SEGA for that. This was its stock in trade at the time.Inevitably, translated for the home systems of the time, something was immediately lost. Not just a few frames of animation here and there, but the 'shall I, shan't I?' dilemma of pumping more coins in to see the game to its conclusion. When a home version just lets you continue indefinitely with no penalty whatsoever, you might lose interest - and that's Golden Axe in a nutshell: a game that isn't built to stand up to repeat play. As such, bashing, walloping and boofing your way through all nine stages of the arcade original takes all of about 15 minutes. Converted with typically faithful aplomb, you can't ask for more as far as the standard of the conversion to Xbox Live Arcade goes. As you'd expect, the game's exactly the same as it was back then, right down to the front end, character select screen, audio intro and sound effects. The simple controls work exactly as they should, and you can even turn on rapid fire if you'd rather just hold down the button to attack.As ever, some spurious 'achievements' have been tacked on to offer a degree of incentive to play it all the way through, but you'll scalp half of them without even really trying during your first attempt. Demonstrating the utterly random nature of what warrants an 'achievement' on a Live Arcade game, some of the demands, on the other hand, would require remarkable feats of endurance in a game notorious for cheating you out of your health as often as possible. Fortunately for a game that relies on co-op to make it fun, the game lets you play locally or online, and set-up is a breeze, with no discernible lag spoiling the occasion. In addition, your final score gets posted on the worldwide leaderboard, allowing series obsessives to claim bragging rights once and for all.Elsewhere, there are a few items of note for diehard fans. You can smooth out the chunky sprites if you want to, but the effect isn't that great. Although it's not as jarring as the effect used for Double Dragon, the truth is it doesn't really suit Golden Axe's art style to do so - keeping things in their original form might be preferable for most. Meanwhile, the ability to save your game seems unnecessary for a game as easy to romp through as this. Still, it's there if you want it.It's impossible to be too hard on Golden Axe, though. As much as we want to give it a proper Ninja Turtles-style beating for being another vacuous title that hasn't stood the test of time, that'd be missing the point: it still represents one of a few elite '80s brawlers that people will continue to enjoy specficially because of its dumb simplicity. Like we always tend to mention in these reviews, if cost is important to you, then you can easily pick up the expanded Mega Drive version on the recently released SEGA Megadrive Collection, although, obviously, you'll miss out on the leaderboards, online co-op and Arcade authenticity.Golden Axe, then. Big, brutish, three-button sprite-based fantasy brawler with bags of nostalgic moments and inexplicable co-op charm: Yours to buy for the 39th time for just 400 points."}