{"ref": "https://www.eurogamer.net/ufo-extraterrestrials-review", "date": "15 Jul 2007", "game_name": "UFO: Extraterrestrials", "text": "The first game I ever reviewed, way back in a distant time they called the early-to-mid nineties was the A500 version of UFO: Enemy Unknown for Amiga Power. I gave it an over-generous 36 per cent. You may be confused on two points. Firstly, if you're an American, you may not know that what you know as X-Com: UFO Defense went under that particular title in the UK. Secondly, you may be wondering why such an well-loved classic got such a low mark. The A500 version simply didn't work properly, which made me - as you'll know if you follow that link - get all het up in a late-teenage manner and sniffle. I always wanted to review a version which worked, which makes me really glad to play UFO: Extraterrestrials. Because - y'know - it's UFO: Enemy Unknown. Like, exactly.When I went to the manual, I was genuinely surprised that instead of ~The Gollop Brothers~ I find a couple by the name of Michal Dolezal and Irou. You can only presume that their methodology of design involved gathering the team around an old PC running UFO: Enemy Unknown and saying ~Guys - do it like that~. And the differences in the final game were due to communication difficulties or spiteful art staff or rebellious programmers refusing to code an old-skool character control system for something a bit more accessible or something.While there have been other games that have taken from it, they've always been considerably more distant than this. Most obviously, the successful UFO: Aftershock/Afterlight/Aftermath/AfterEightMint series - which, you'll remember, was real-time. Conversely, this keeps exactly to the formula of the UFO series.... okay,  just to make it less confusing from now on, we'll call the original series X-COM. That is, strategic management of the world defence which runs in real-time with a turn-based tactical missions.To elaborate, you're a world defence organisation. Rather than the original X-com plot of defending Earth, we have the colonized planet Esperanza under threat from Aliens (And, yes, you should get that I'm exaggerating for comic effect by saying it's exactly the same earlier. I only say so to a) be cleared, and b) make it harder for someone to sue us). You have to build bases to protect each section of the land, purchase equipment for your soldiers, build useful things to help with research and production and generally get ready for the appearance of flying saucers. (Because, stating the bloody obvious, they're not UFOs. They're highly identified flying objects, full of zap-gun totting alien bastards )When they appear, your jets set off and ideally send them crashing into the ground. Most of the time there will be alien survivors, and you'll send off your ground team. On arrival, you enter the turn-based mode. Everyone has action points. Moving, shooting, whatever uses them up. Keep enough at the end of a turn and they'll be able to do a snap-shot at any enemies who cross their field of vision. The most important aspect, however, is the vision cones of the characters - they can only see in the direction they're facing, with the majority of the map blacked out until you explore it. Eventually you'll have cleared the aliens - or lost. At which point it's back to the strategic level, where you get all the alien-salvage to pore over, leading to fresh routes for your experimentation or just junk to sell to keep your enormously expensive operation running. Your success in keeping various nation's alien-free leads to your monthly pay-cheque.It's a genius design, to say the least, and the clear spiritual forefather for things like, say, the Total War games. The interaction between the micro and the macro is especially relevant, the pair of them increasing the power of the other. In the strategic mode, since you have to manufacture the weapons you research, you're regularly forced to go into battle half-way through a refit - that is, there are not enough of the snazzy new weapons to go around. That's both convincing, and incredibly atmospheric. Of course, the tactical part of the game is all about the ~incredibly atmospheric~. It's the exact tension, fear and careful military precision - moving individuals to a corner, covering each other, making sure people can't outflank you - which perfectly captures that twenty-minute period of the film Aliens where the Colonial Marines are sweeping through the deserted colony. It's rarely a stand-up fight. It's primarily a bug-hunt, with no option to bug out and nuke the site from orbit.Okay. What goes wrong?"}