{"ref": "https://www.eurogamer.net/king-of-fighters-xi-review", "date": "14 Jul 2007", "game_name": "King of Fighters XI", "text": "When even the cornerstone franchises of the 2D beat-'em-up are trying to stay alive by making the unnecessary leap to polygonal combat, you have to wonder what the future holds for the ailing sub-genre. With a huge community surrounding many of the finest representatives of the oeuvre and services like Xbox Live Arcade rejuvenating faith in what has long been considered a dying genre, could it be that sprite based fighters are on the verge of making a timely comeback? Unfortunately, probably not. But as long as companies like SNK are committed to supporting advances in this extremely quiet field with excellent titles such as this, you have to say that there's always a chance that the simplicity and accuracy of the 2D fighting world could well win over a whole new audience. One of the key strengths of KOF XI is its broad and extremely varied cast of selectable characters. Veterans like Kyo, Iori and Kim have all stuck around for one more outing but it's with some less predictable appearances that the roster impresses most. One team comes in to represent Garou, bringing a welcome grappler in the form of Tizoc, flashy pirate lass B Jenet and tech mix-up master Gato into the fray, not to mention the insanely tricky Hotaru popping up as an unlockable character. Some new faces join the cast too, the pick of which is undoubtedly Oswald, a card-flinging maniac reminiscent of Gambit from the Versus series. You'll even see less familiar faces from SNK's past such as Duck King and Eiji get a new lease of life here. No matter what type of character you usually plump for in a fighter, you're covered with at least a couple of viable choices - even though popular choices like Joe and Leona are curiously absent. Once you've settled on a complementary trio of fighters, committed all of their moves to memory and tried out a few basic combos in practice mode, the real beatings can begin.While the three-on-three action on display here adheres pretty firmly to the usual 2D beat-'em-up blueprint, a few interesting new concepts carve XI a niche of its own. The first of these is a vastly reworked Tactical Shift System compared to when we last saw it - switching between your three fighters on the fly can now be done to avoid an opponent's relentless onslaught through the Saving Shift or done to prolong your own combos and confuse opponents with some crazy mix-up thanks to the Quick Shift ability.As with other technical moves, these function in unison with the game's new Skill Stock system where a section of the constantly recharging two-part meter must be expended to perform many more defensive abilities. Leader Desperation Moves are still in there too but XI introduces the Dream Cancel option to make the chances of ever landing some of these more realistic. While expensive on both special and skill gauges, being able to cancel out of normal super attacks into your leader's most powerful move can do horrible things to your opponent's life bar.As with any other fighting game, the two-player mode should be the one you get most use out of but even if you don't have a regular sparring partner just yet, there are plenty of single player options to tide you over until a challenger turns up. The usual spread of arcade, survival and versus modes are all present and correct as well as an odd little challenge mode, featuring a series of increasingly demanding tasks from performing big combos and advanced attacks to just taking down rivals under hindering conditions. Beating some of these unlocks extra characters such as Mai, Mr Big and Robert so it's worth putting some time into this aspect of the game if you want the full roster of fighters at your disposal.Given its attractive price point and wealth of excellent features, King Of Fighters XI is absolutely essential stuff for anyone still keeping the 2D dream alive. It's hands down the best new sprite-based fighter in years, and while purists will probably find it hard to drag themselves away from genre favourites like Capcom vs SNK 2 and Street Fighter III, SNK has done an exceptional job of proving that there's still life in 2-D fighting. The cheap bordered 50Hz conversion is a touch disappointing but when the rest of the game is so damn great and taking into account the fact that you'll get change out of fifteen notes for this little beauty, it seems harsh to keelhaul XI over cut corners like this. Unlikely to win younger or more fickle gamers over from the sumptuous eye candy of Soul Calibur and DOA as this may be, KOF XI displays intricacies and technical possibilities far beyond these showier titles and marks a resplendent return to form for SNK's best-loved franchise."}