{"ref": "https://www.eurogamer.net/r-papermario-n64", "date": "13 Jul 2007", "game_name": "Paper Mario", "text": "It's easy to dismiss the Nintendo 64 now that we have the            PlayStation 2 and GameCube. Watching some of the latest Xbox games            in action, you could be forgiven for thinking the N64 a relic of a            past era, and Nintendo don't seem all that keen to drag it out            either. But they do have a couple of good titles left in them.            Paper Mario was given a rapturous reception by fans of the console            when it hit the States earlier this year, and the PAL version has            finally been released this October in Europe. For N64 fans, it's            the game of the year.                         One of the hallmarks of Nintendo's success with the Super Nintendo            was Super Mario RPG. It was widely criticized by diehards, but it            had a lot of in-jokes, plenty of cameos from famous Mario            characters and above all else it had class. It was a one-time            crossover from the collective talents of Nintendo and Squaresoft,            and it showed in its cutesy graphics, expert battle system,            spellbinding atmosphere and excitable storyline. The only thing it            lacked was Square's trademark muddling complexity, and was that            such a bad thing?                         Paper Mario is a vastly superior game to SMRPG. It starts out            innocently enough; Mario and Luigi receive an invitation to join            Princess Peach at her castle for a party. Finding her alone in her            private chambers away from the hubbub of her guests, Mario and the            Princess share an intimate moment, and then with a crash the whole            world starts slipping away from them.                    The evil Bowser and his sidekick Kappa whisk the castle away into            the stars, making it the centrepiece of their nefarious plans.            Mario bravely fights Bowser, but the fire-breathing shell-clad            brute rips him a new one, and throws him from the castle balcony.            Plunging to his doom, poor Mario has only a fleeting opportunity to            catch a glimpse of the wrong he must undo.                         When he awakes in a strange village in the middle of nowhere, he            sets about defeating Bowser. Before he takes the wily old trickster            on once again however, he must learn a few tricks of his own, and            with help from a number of sources (including a friendly family of            Goombas who teach him the basics), he begins his rehabilitation and            training. Along the way Mario invites a number of friendly            characters to join his party, the first of which is the Goombas'            youngest, Goombarrio.                         Mario's exploits in his latest adventure are best described as a            cross between a classic 2D platform game and an RPG. You spend most            of your time moving about an ostensibly 2D side-scrolling view            (although you can move in an out in some areas too), searching out            coins and other bits and bobs hidden in trees and bushes, and            taking on the local nasties. When you spy an enemy, you can rush up            and hit him with your hammer, getting first strike. This robs the            little git of a couple of health points and sets him up for a quick            despatch on the battle screen.                    The battle system is actually quite sensible. Whenever you go into            battle the proceedings switch to a battle screen, where the            turn-based fighting begins. Your health (or Heart) points number            ten to start with, and gradually increase as the game develops. You            never reach Final Fantasy levels of silliness, but you still feel            the benefit of the extra points.                        Mario and his compatriots also have Badge points and Flower points.            Badges are hidden items that allow you to enhance your characters'            abilities with new attacks. You use a badge for a short while,            limited by the number of badge points you have, and like Heart            points the capacity for these goes up the further you get. Flower            points are equally important, used for magical attacks and such.            When you level up, you get a choice of which of the three types of            point you want to increase. Levelling up involves a fourth kind of            point; Star points. These accrue like experience as you plough            through battle after battle.                         The thing that will really strike you about Paper Mario though            isn't so much its rampant disregard for the conventions of the            traditional role-playing game, such as limitless hitpoint numbers            and shameless plot clichés, but its graphical style. Various            elements of the game have a three-dimensional feel - the trees, the            ground, the buildings - but the rest of the picture is decidedly            2D. This is particularly true of your movement, with Mario and            friends sauntering along from left to right, bopping from ledge to            ledge, and even the battle screen is 2D. Moreover, the sprites that            represent the characters are flat and cartoony, hence 'Paper'            Mario. The effect is initially quite confusing, but it grows on            you. It's the sort of audacious graphical style that only Nintendo            would think of implementing in its flagship N64 role-player for            2001.                    Some will perhaps find the linearity of the game disturbing, but I            can't recall a single recent RPG that wasn't in some way or other -            Final Fantasy VII, one of the best games on any system ever, was            for all intents and purposes a collection of cutscenes linked by            battles and text.                        The seven varying lands explored by Mario and his band of merry            cartoons contain much excitement, and the game design is for the            most part ingenious. Of the various characters you meet, none is of            less import than any other. Take the Fish, for example. You don't            meet him for a while, but by the time you do there are            impossible-to-reach areas that a water-dwelling companion would            make short work of. For each character there are hundreds of            puzzles in the game that require their interaction, and battles            that demand their particular talents.                         Paper Mario is an RPG rich with ingenuity and style, and it's good            fun besides. There are twists and turns in the plot, plenty of            familiar faces and those all-important Mario moments that only a            true fan will understand. It's also the best RPG on the Nintendo            64, and acts as a superb gateway to the genre, particularly for            young fans to whom the bewildering complexity of games like Final            Fantasy means nothing. This is the N64's Secret of Mana, with a few            more familiar faces to boot. Buy it and forget about the GameCube,            for now.                        -        Paper Mario previewPaper Mario preview"}