{"ref": "https://www.eurogamer.net/touchmaster-review", "date": "6 Jul 2007", "game_name": "Touchmaster", "text": "As timely releases go, this must be set to the Atomic Clock. Just as the pubs boot smokers out in the rain, so Midway pitches up with a compilation of crap old touch-screen pub games. You know - Target 21, Phoenix 13, 5 Star Generals, Trivia, Word Search. If the bells aren't ringing, picture the three blokes in paint-splattered t-shirts leaning against a huge lump of space-age plastic, pints atop, tapping icons on the screen. 80% chance, 20% practised anticipation, they're all a bit naff - but if you've been banished outside with a tab, why not take the best bit of the pub with you? This could be your 42 All-Time Classics.You could argue it's gone the other direction. Forget Nintendo's increasingly prevalent Daily modes, downloads and redux editions - all bright colours and clear presentation - because this is as rough and ready as they come. The menus resemble a Geocities homepage from 1998: crap frames, chunky buttons, too much colour and not enough information. You half expect to stumble upon that ~Under Construction~ graphic of a man with a spade. There's no ~look beyond~ here, either: some of the in-game graphics would shame an IT class playing with Paint. For the first time. The better ones are functional. The best you can say is that you can make out the details without having to squint in more than a handful of cases.The games aren't even very memorable unless you've ever been a drunken builder. They just have something. Target 21 tees up cards and the idea is to distribute them between five piles so that each is as close to 21 as possible. When you can't get any closer, or you run out of ~skip~ prompts, you bank the points and proceed to the next round. You can't predict how it will go, but you can develop the odd tactic to avoid premature catastrophe, and eventually build up quite high scores and unlock bonus rounds, with a bit of luck.The same's true of 5 Star Generals (which is basically the same as Pick-Up 6, the game next to it on the menu), where you're shown five dice and given a list of combinations you need to get. You can re-roll any two dice per hand, and, again, simple tactics could take you higher, but more often than not it's Game Over before you've hit the score at the top of the leaderboard. Offline, that's just your previous attempts, but Midway has included Nintendo Wi-Fi Connection leaderboards here. (There are even tournaments, although this is where the game spills over from ~kitsch~ to ~bollocks~ in implementation terms).Other games range from the completely dispensable (draughts/checkers played with frogs) and meaninglessly enjoyable (Hot Hoops, where you time free-throws to land in a basket) to the almost incomprehensible (Artifact - a sort of Othello game which looks like the little blinking lights on Predator's arm panel, and makes about as much sense), but the combination of variety and accessibility, for some reason, lift it above its origins. Word Search is simply a Word Search. So why did I spend half an hour on a bus playing it? There's Solitaire, too, among quite a few other card games, and some knock-off puzzlers like Crystal Balls (part Puzzle Bobble, part Tetris, all cack) and even Mah-jong.There are a few things you might concertedly moan about. The touch-screen controls are an almost straight grab from the pub screen, which means very little drag and drop (although Word Search does have drag-select), while the presence of a timer was originally meant to stress you out as your money slipped away from you, but here feels like something you ought to be able to turn off - perhaps at the cost of excluding you from Internet leaderboards. And why do the two-player bits demand two copies of the game? Cheapskates.As to whether you should buy it though, that's harder. Do you want a compilation of crap touch-screen pub games? Common sense says no (play Slitherlink/Puzzle Quest/Picross DS/Puzzle League/Actionloop/Touch Darts/about 8 billion other DS games instead), but common sense isn't what got you to put the quid in the slot in the first place, is it? Tell you what, I'll give it a fittingly meaningless score, and then you can all secretly buy it when it turns up somewhere for just under a tenner. As pointless distractions go, this is one of the best in a while."}