{"ref": "https://www.eurogamer.net/flatout-ultimate-carnage-review", "date": "24 Jun 2007", "game_name": "FlatOut Ultimate Carnage", "text": "It's not exactly a new or innovative phrase, but there's one line that springs inevitably to mind every time I try to think of a way to describe FlatOut: Ultimate Carnage. The series - now in its third incarnation - has been called ~Burnout's Redneck Cousin~ before, and will undoubtedly be called that many more times over the coming weeks. Not only does this description have the benefit of being entirely true; it also seems likely that that's exactly what the developer was aiming for. Where Burnout has you racing through gleaming cityscapes and exotic global locations in a progression of increasingly shiny and improbable racing machines, FlatOut is all about ripping through rough tracks and hillbilly back-yards, weaving a trail of astonishing destruction in muddied, roaring old rustbuckets.If you're thinking, ~well, that actually sounds like more fun~ - you're not wrong. Feature for feature, second for second, crash for crash; FlatOut is, quite simply, a better game than any of the recent incarnations of Burnout. It's a gleeful, wanton rampage of a racing game, an orgy of vehicular destruction and high speed which makes Criterion's well-loved series look sedate and old-fashioned. That, alone, is recommendation enough to turn the heads of any arcade racing fan - and we give that recommendation with only one caveat.The caveat, sadly, is somewhat significant; significant enough, perhaps, to be a deal-breaker for many people. But more on that later. Let's stick to the positive for now; let's talk about the basic commandments of FlatOut - Go Fast and Break Stuff - and exactly how well they're implemented. The structure of FlatOut: Ultimate Carnage isn't remarkably complex. The game has three classes of vehicle - namely Derby, Race and Street - which progress from slow but deliciously smashable old rustbuckets in Derby, through to gleaming speed demons in Street. Within each class, there are plenty of events (ranging from straightforward races and time trials to ~last man standing~ destruction derbies) to take part in, and multiple cars to unlock and purchase with your winnings. Each car can be upgraded by spending a bit more money on parts in the ~upgrade shop~; at first, this seems a bit confusing, especially to those in the audience who aren't car nuts (and therefore haven't entered a catatonic state due to playing Forza Motorsport 2 and forgetting to eat, sleep or watch Top Gear for the last fortnight). However, it quickly becomes clear that each upgrade you buy just fiddles the statistics of the car slightly, and you can see exactly the effect it'll have on things like top speed, acceleration, weight and handling on a convenient set of bar graphs.That, in a nutshell, is the progression system of the game - but unlike many other racing games, FlatOut does a fine job of making sure that there's quite an enjoyable, different experience available at each level in the game. Certainly the cars get faster as you go along, but each class has unique attributes aside from speed. You may well find that even after unlocking the later classes, you voluntarily return to Derby class for a fun, exciting destruction event, or to Race class for the stronger vehicles which allow you to zip around with a little less care than is needed in Street class.Although there are a variety of game modes open to you, the heart of the game, unsurprisingly, lies in its races. Each one of these is a delightful festival of carnage, with the game taking the now commonplace approach of building multiple tracks out of a relatively small set of actual locations. This has allowed the developer to lavish detail on each location, and it shows - FlatOut's tracks are among the most visually impressive and astonishingly detailed we've seen in any racing game, ever.Much of that detail comes courtesy of the insane number of fully interactive objects which are littered around each track. The developers estimate that there are 8,000 interactive, breakable, smashable objects on every single track, and we don't doubt that figure for a second. Cars in this game don't bounce off the stacked-tyre barriers at the roadside; they smash through them, scattering bouncing tyres all over the track. Chain link fences, picnic furniture, boulders, electricity poles... They're all fair game. Everything goes flying, causing a massive, glorious, physics based mess.Aside from the obvious improvements to the graphics and physics afforded by the move to next-gen, one of the most noticeable upgrades in Ultimate Carnage is a 50 per cent increase in the number of cars on the track. 12 vehicles now zip around each racing and destruction derby stage. This, admittedly, may not sound like much of a change to the formula, but when you consider that each one of those vehicles is also a physics object, capable of tearing, smashing and destroying the track around itself, or of slamming into other nearby vehicles, you suddenly start to appreciate how much difference four extra cars can make.Perhaps most impressive of all, the game doesn't stutter for even a second when confronted with all of this frantic action. Twelve cars, 8,000 physics objects, and absolutely gorgeous scenery with amazing lighting, reflective water and high-quality textures... No sweat. Ultimate Carnage sings along at a high framerate, just as you'd hope from a hi-octane racing title. It's great to see a game which really utilises the power of a next-gen console, but doesn't sacrifice the basic requirement for decent framerate in the process - a fine balancing act which the developers have managed almost perfectly."}