{"ref": "https://www.eurogamer.net/overlord-review", "date": "21 Jun 2007", "game_name": "Overlord", "text": "I had to genocide the elves. I had no choice, you understand. Well, I had a choice, but that'd involve not killing the elves, so it wasn't really a choice at all. So, as the remaining elf-maids cried to the heavens, my giggling serfs dragged off an enormous pile of gold which I'd spend on an old fridge which leaks CFCs constantly or something.Cheerio, eldest of the races. I hardly knew ya.Overlord is about being Evil. I'm giving 'Evil' its capital, because it's not really about being evil. This isn't about being evil like in dealing crack to kids, or death camps or telling your girlfriend you're working late in the office when you're really screwing your secretary. You're evil, but not like - say - Hitler. You're Evil like Mum-Ra the Ever-Living. Your character is silent throughout, but you know if he ever laughed he'd go ~Muhahahaha~ and be entirely unashamed by it.Overlord is about the Pantomine of Evil. The ~you~ when the children cry ~HE'S BEHIND YOU!!!!~ That's you.Overlord's probably most succinctly described as Fable meets Pikmin with Dungeon Keeper's plot, with splashes of Diablo and Sacrifice. Succinctly, but almost entirely incomprehensibly. Let's break it down.You're the Overlord. The land is in peril - the peril is you. Well... if the land realised it was, it would be. From your stronghold, you venture out into areas of the world in an attempt to initially reconstruct your home and then gain as much power as possible. This involves hunting down and killing the heroes of the land. Except, as you rapidly discover, the heroes aren't exactly Heroes. The Paladin's a pervert. The Dwarf is phenomenally greedy. And the image of the enormous bloated sac of the halfling hero rolling towards you, like Monty Python's Mr Creosote turned nasty, is terribly memorable. Don't expect wide roaming - the model for the quests is Fable, in terms of branching - because instead you've mainly got linear paths with hubs, but there's still a considerable degree of freedom, with you able to return to previously explored areas to harvest more life essences for your diabolical purposes.The harvesting life brings us to the Sacrifice/Pikmin aspect of the game, and its main device. While you pick up spells and improve your weapons throughout, your real killing power is derived from your minions. There's four life essences in the land, each of which allows you to summon one of the quartet of servants. Brown minions are the largest, and basic hand-to-hand bashers. Red minions lob fireballs at a range. Green minions perform vicious backstabbing attacks on opponents, if they can get into position. Blue minions are ludicrously weak but can resurrect their fallen companions if they get to them in time. In a Zelda-derived fashion, the last three are also able to unlock routes further into the game - reds can remove fire, blues can swim and greens can clear poison clouds.The reasonable skill-set expands its appeal with the specifics utilisations. For example, you can leave groups of minions in a set position rather than trundling after you. This means you can leave Reds in a safe cliff to provide covering fire. The greens when given a station to guard will go invisible, allowing you to set traps. Between your ability to lock onto opponents and send minions charging with a trigger-press or being able to use the right thumb to move the mob through the terrain, there's a lot of control."}