{"ref": "https://www.eurogamer.net/brothers-in-arms-ds-review", "date": "13 Jun 2007", "game_name": "Brothers in Arms", "text": "Okay. Brace yourselves. I've got some news. It turns out that between 1939 and 1945 there was something of a war, taking place all over the world. I did a bit of research, and it turns out this is called ~The Second World War~, or ~World War II~. If you find a more obscure, esoteric history book, you might find a few details about it. Well, it's certainly news to us here at Eurogamer - so we were more than intrigued to discover a game about it, played on the little-known device from Nintendo called the ~DS~...So while yet another WWII game, let alone yet another BiA game, isn't exactly the sort of news that gets us out of our beds, there is a reason to be interested in this handheld incarnation: technical achievement.It's always the case that as machines get older, developers find new potential with the hardware. Look at the beautiful Tomb Raider: Anniversary on the PS2, and compare it with, say, Tomb Raider: Angel of Darkness. But I honestly didn't think the DS was capable of a game as complex and detailed as Brothers In Arms.If you've played 3D games on the DS, such as Metroid Prime, or even the peculiar Deep Labyrinth, you'll know how the system handles the extra dimension: it goes blocky. And that's just what happens here, but in a way that's so busy and involving you don't really care. Yes, the textures on walls get to half-centimetre-sized pixels, but look! - There's a plane crashing in front of you! - The ground's exploding! - Those Nazis in the background are waggling around as they're filled with bullets! - I'm driving a tank! - And so on. However, and it's a rather important however, BiA demonstrates the potential we never knew the DS possessed, rather than a satisfactory result of it.But let's begin by being positive. This really does work. It's a busy FPS that only occasionally grinds due to too much action on screen. And that's fairly impressive considering how much is rumbling around at any one time. Compare it to the (superior) barren world of Metroid Prime, and the jeeps driving by, tanks fighting, planes swooping, and number of NPCs fighting at any point is rather remarkable. Missions are as you'd expect - run and gun, reach a mounted machine gun and defend a position, drive a tank and blow everything up, etc. Mixing the goals over the three chapters (Normandy, Tunis and Ardennes) keeps things as interesting as every other WWII shooter that does exactly the same.However there are, as mentioned, some rather serious problems. The first is the steering. Controls are nicely arranged, with the d-pad for movement, the touch-screen in the place of the mouse, and the left shoulder for fire. Then any extras such as grenades or reloading are handled on the touch-screen. Regular aiming and moving about is fine. But, frustratingly, the speed of rapid turning on the screen is far too slow; as a result, spinning around involves tiresomely scraping the stylus across the touch-screen again and again: not so much spinning as lumbering around, then. This is countered by the jeep controls (oddly the tank is mostly fine, and rather fun to drive), which steer manically, sometimes hilariously spinning on the spot. (Although it's not quite so funny when you lose for the seventh time as a result of not being able to drive in a straight line).To simplify things for the DS, and to stop you racing off the path that the game wants you to take, all is controlled by a series of checkpoints. You are constantly told where to stand; guided by green cylinders of light every few feet. While in no way ruinous of fun, it does cause the whole game to have the faint atmosphere of a tutorial, overly holding your hand. Despite this, there is relative freedom about how you approach each scenario, and I found alternate paths through enclosed locations offered greater advantages in sneaking up on the ~Krauts~, as the game constantly refers to the Germans.The other trouble is that it's all a bit too easy. While the ~Veteran~ difficulty mode is unlocked by successfully completing each level, it's the first play-through that counts, and here it's a little too simple. And - presumably in deference to the limited controls and more awkward aiming of the handheld - while it doesn't auto-aim, you do appear a little invincible. It's only after repeated barrages of bullets or bombs, and failing to find cover when the game frantically insists you do, that you'll pop your clogs - that is, until you reach one of the occasional peculiar moments when the game is suddenly insisting you do something really rather very quickly, but it's not going to tell you exactly what. The excellent check-pointing means you'll never have to replay too much, but it can get tiresome trying to fathom exactly what it is that's being demanded of you to prevent the confusing game-overs.But I must come back to the opening thoughts. Despite brevity, simplicity, and the slow turning, it's really very exciting to be playing an FPS of this complexity on the DS. The above problems are significant, but never stop the fun of blamming your way through a level, sniping out distant soldiers, or, best of all, explodifying everything in a tank. The story is hugely underwritten, but ultimately unimportant; the motivation, always the need to reach B from A without the Ns shooting you in the face with their Gs.So let's see some more FPSes coming to the DS please. I want me some Doom, some Quake, and most of all some No One Lives Forever. There's no excuse any more, as Gearbox and Gameloft have shown here that it can be done with limited slowdown. With some tighter programming, and far fewer invisible barriers and dumb deaths, BiA could have been rather good. As it is - flawed and fun - it's a fantastic signpost."}