{"ref": "https://www.eurogamer.net/puzzle-league-ds-review", "date": "11 Jun 2007", "game_name": "Puzzle League DS", "text": "Puzzle League DS is a derivative of Panel de Pon. In the interests of full disclosure, I think Panel de Pon is a bit crap. ~Bit of a handicap for a Panel de Pon reviewer,~ you might think. In practice, it doesn't make a huge difference. Describing why it's so liked or loathed isn't hard. And it's worth getting that stuff out of the way quickly, anyway, because it'll leave more space to talk about Intelligent Systems' superb DS port job. This really is one of the best puzzle game packages around.Concept's simple. Jumbled up blocks rise from the bottom of the screen and you have to form rows or columns of three or more of the same colour to get rid of them. The challenge is doing this when you can only move individual blocks left and right, which is the limitation Panel de Pon places on you. There's no restriction on which you move - so unlike Zoo Keeper/Bejeweled/etc. you can grab one, and move it to somewhere where it has no effect on its surroundings - but you should bear in mind that columns are worth more points than rows, as they're a bit harder to arrange, while groups of four or more are also more valuable, and chains are like mana from heaven. Naturally you're meant to avoid running out of space while building up your score.So, people like it because getting a big score without pootling along listlessly for 84 hours in a row is quite a haul. You have to be able to spot good chains, and more significantly the nebulous elements that go to the genesis of a good chain. When you can, you get good. What's dull, from my perspective, is how easy it is to just float on. Even on the hardest difficulty, I don't have trouble keeping the game alive, as the blocks creep ploddingly up the screen. You can accelerate their passage, but the fact they felt you'd need to sort of underlines my concern. There seems to me more neatness in the concept of a game like Lumines, and equally more variation.But never mind. I'm not going to try and sell Panel de Pon to you. If you've played it, you're fine, and if not, you're probably new here. These are the DS puzzlers you need to play first: Zoo Keeper, Tetris DS, Picross DS, Slitherlink, Meteos, Actionloop/Magnetica. See you next year.What elicits more excitement is the devs' amazingly good work getting it here. Most puzzle ports are hit and miss. Zoo Keeper was stunningly good value once you'd got into the high-score Time Attack obsession, but the Quest mode - completion of which was crucial to unlocking the higher-score top difficulty level - was embarrassingly awful. Picross' and Slitherlink's stylus controls are rubbish. It's the same story off-DS: THQ's been remaking Tetris badly on other formats for years, for example. Puzzle League does the impossible: it riffs on the original game's usual offerings, introduces new controls and themes, and comes out all the better for them.Riding the ~Touch Generations~ brandwagon, it's got a ~Daily Mode~, where you do three short, derivative modes and have your results pecked into a graph, building up a record of your progress day by day. It has the Brain Training-style ~hold the DS like a book~ option, with left- and right-handed stylus control options, as well as a traditional horizontally orientated d-pad-and-face-buttons offering. It's got the good sense to blow up the size of the play area if you're holding the DS like a book. Most games wouldn't bother. The stylus controls themselves actually work. You can drag blocks the whole way along the line in one sweep. Both sets of control option are fairly effortless to pick up and play, and once you master the stylus option you'll be sliding blocks into gaps before blocks above can slot down and all sorts.The modes it offers are varied and, often, actually good. ~Endless~ mode is your standard ~until it's over~ Tetris-derived offering. ~Vs. COM~ is the versus-mode against the CPU, obviously, where your bigger chains dump garbage blocks on the computer-player's screen to slow their progress. ~Garbage Challenge~ just dumps blocks on you regularly to force you to work in tight conditions. ~Clear~ is about getting rid of blocks until you've cleared things to a certain depth at increasing speeds, and is the most immediately challenging of all the modes - I hit a brick wall within about an hour, and had to develop my tactics significantly to keep making progress.~Puzzle~ is a more sedate offering, about ridding the screen of all blocks in a set number of moves, or following instructions like ~make a 5-chain~ with limited blocks available. It's analogous to the (draining) capture sections of Puzzle Quest, for those who've played that, or Lumines' own Puzzle tasks. It's an acquired taste, but it teaches you a lot about how to look ahead, and in the main challenge area there's a ~Hint~ button for showing you how the solution unfolds. Bit of a cheat, that, but if you can't restrain yourself then I can't help you.Rounding out your options, you can play four-player games on one copy of the game, or go online to compete. There's even a facility for voice communications for people you've exchanged ~friend codes~ with, and this doesn't require a headset (the DS has a microphone in it, after all), but you can use one if you want. Really there's very little to get in the way of a high mark. Execution is near-flawless throughout, and while the presentation's a bit on the garish side (and seemingly influenced by Q Entertainment's Meteos, which is a sort of hyperactive sideways space-based Panel de Pon anyway), you can stick to the graphical layout you like best by tweaking options pre-game. So yes, this is a very fine Panel de Pon game, and one of the best buys available for DS owners this month. For people who like Panel de Pon, obviously."}