{"ref": "https://www.eurogamer.net/osu-tatakae-ouendan-2-review", "date": "5 Jun 2007", "game_name": "Moero! Nekketsu Rhythm Tamashii Osu! Tatakae! Ouendan 2", "text": "Or, to give it its full complement of titular insanity, Moero! Nekketsu Rhythm Damashii Osu! Tatakae! Ouendan 2. I could translate that as ~Burn Up! Hot-Blooded Rhythm Souls: Hey! Fight! Cheer Squad 2~, but it wouldn't make much more sense. In a glorious, kanji-covered, supremely Japanese way, this is the kind of game where translation would add little. Ouendan will never make sense in any language.In this second instalment in the series - third, if you count the western Elite Beat Agents - the black-coat-clad all-male cheering squad are back in action, popping up from the most unlikely places to cheer on hapless citizens as they battle their various problems. They are joined by a rival cheering squad, who wear blue military school style uniforms (and foppish hairdos), and make a dramatic entrance on the deck of a yacht a couple of missions into the game.In essence, Ouendan 2 follows exactly the same pattern as its predecessor. Each stage sees a character faced with a problem, which is illustrated using a semi-animated manga sequence; a catchy Jpop or Jrock song fires up, and the Ouendan then appears to do its funky cheering dance. As before, you have to tap points on the screen or drag balls along tracks in time with the music, with the number and arrangement of the points becoming increasingly complex as you advance through the levels. At regular points throughout the song, your attention will be directed back up to the top screen to see how the character for whom you're cheering is getting along - and will get a brief scene showing either great success or epic failure, depending on how accurate your stylus-tapping has been so far. Finally, you'll get an overall score for the level, and will be judged either to have passed or failed. Simple as anything - but utterly, utterly compelling, as anyone who has played Ouendan or EBA can tell you.So, aside from the single, core argument in favour of Ouendan 2 - namely ~it's more Ouendan~, a positive factor as unshakeably true as it is boringly obvious - what else does this sequel have to offer?First off, Ouendan 2 imports all of the improvements which we saw in Elite Beat Agents back into the Japanese branch of the series. So, for example, the Easy mode is now actually easy, which means that you'll be able to unlock songs even if you're not very good at the game. The storytelling system gives you the option to skip forward past intros, which means that when you retry a song you'll never have to sit through any of the prologue sections. There's also an extended tutorial level, which is worth playing even if you're an old hand at Ouendan, since it's really very funny - and is capped off with a wonderful sequence where you cheer a cat on in her race to escape from a barking dog, all to the strains of a disgustingly catchy martial theme.Like Elite Beat Agents, Ouendan 2 offers a 3D world map in place of the 2D town of the previous game. Like the original, though, this is still a town rather than a rotating globe; it's a minor touch, but the 3D really gives it a certain life, especially thanks to the trains and cars which wind their way through the town as you pan around looking for more citizens in trouble.Ouendan 2 also builds on its predecessor - and, indeed, on Elite Beat Agents - in the quality of its storytelling. Not in the sense that its writers will be winning the Booker Prize any time soon, but rather in terms of how playful and experimental the game is with the manga comic format it uses for its stories. Simple animation frames, pop-up sub-frames, moving dialogue bubbles and the likes are lavished on the simple tales being told in each sequence. It's absolutely gorgeous to look at, and very funny even if you have no idea what's actually going on, thanks to the dense reams of Japanese on each screen - none of which, we might add, detract from your enjoyment in any way.The stories themselves, too, remain lovably bonkers. A doctor in an overwork frenzy must ~heal~ a microwave and a variety of other appliances alongside his existing patients. A businessman blasts off from the spaceport to set up a department store catering to aliens. A boy who turns into a werewolf at the drop of a hat has to make it through a date with the girl of his dreams without changing. A small child with a bed-wetting problem must make it through the night without pissing himself. And so on.Running alongside each individual story, there's also a sense of story progression as the two Ouendan teams battle against one another to be the city's top cheer squad - although, in typical fashion, they pool their talents at the very end, in a final mission whose premise is so singularly stupid and magnificent that it makes the last game's asteroid-deflection mission look perfectly sane."}