{"ref": "https://www.eurogamer.net/wii-virtual-console-roundup-review", "date": "25 May 2007", "game_name": "Reviews", "text": "Ever since the arrival of PS3 on European shores, both Xbox Live Arcade and the Wii Virtual Console have significantly beefed up their downloadable output, which has to be good news for those of us addicted to bite-sized chunks of retro gaming. Of course, the old Virtual Console doesn't give you the option of trying a game before you fork over those precious points, so consider this your weekly guide to what's gone up, and whether it's worth your time.(And please note that we've resisted the urge to use the phrase ~Wiikly Round Up~.)There are a generous four games to choose from this week, all released in the US in the past few weeks, though only one is truly essential. What say we start with the pick of the bunch and work our way down? Hmm?Original platform: SEGA MegadriveWii Points: 800Before he grew up to be Jack Black, Wonder Boy was one of SEGA's many pre-Sonic mascots who failed to survive the transition between the 80s and 90s. With a typically complex labyrinth of confusingly numbered sequels, Japanese games retitled for the west, and re-branded versions shovelled out on every available format, it's entirely possible that you've played a Wonder Boy game and not even realised it.This Megadrive offering from 1991 marked the young hero's final appearance (although another game in the series did appear, with a female protagonist) and as such presents the Wonder Boy format in its most evolved and impressive state. And, yes, it's pretty great - a charming blend of Mario World and Final Fantasy that deserves a place in any retro gamer's library. The story is endearingly simple. Despite the name, Monster World was once a peaceful place. Then, hey, monsters arrived, sundry royals were kidnapped and Shion, our manga-styled hero, sets off to sort everything out. So far, so retro.Where Wonder Boy makes his mark is in the rather seamless blend of platforming tradition and role-playing depth. Neither is allowed to overwhelm the other, and the result is the sort of gameplay that can truly be called timeless. The graphics may reveal the game's age (although with its bright and colourful sprites it's a perfect fit on a Nintendo platform) but the game itself still feels fresh and enticing. Weapons and equipment must be found and levelled up, non-player characters must be quizzed for vital information and money must be spent wisely on items and upgrades. It always skews more towards the platform side of the equation, but the adventure elements are just enough to keep you coming back with Shion's speed and magic attacks improving along an addictive curve.It reminded me most of the time I first fired up Chrono Trigger back when SNES emulation was still a newfangled treat, and discovered that it was every bit as great as I remembered it. Wonder Boy has that same compelling and confident genre-straddling design, backed up by well-tuned gameplay and just the right amount of depth to keep you playing and exploring.With Paper Mario still AWOL in Europe, this makes for a surprisingly effective temporary replacement, ticking many of the same boxes and thoroughly deserving the 800 Wii Points it'll cost you to download.8/10Original platform: PC EngineWii Points: 600Actually the second game in the relatively obscure PC Engine Schbibinman series, Shockman drops you into a story already in progress with little in the way of explanation. You play as either Arnold or Sonya, two manga-haired teens with the ability to transform into Megaman... sorry, Shockman. You're summoned to a Professor's lab, where he promises to fix your body, even though he's told you ~nothing but lies~. It's all very kinky and, unless you played the first game (never released in the West), you'll have no idea who these people are or what's going on. Not that it matters as it soon transpires that the alien Ryo Empire is invading Earth, and inevitably the task of repelling these conquering mechabots falls to you. Run left to right, zap the baddies with your chargeable gun, leap over obstacle, get to the end of the stage. Business as usual for a Japanese side-scroller then. Shockman does mix things up a little though. It features a nifty co-op mode, for instance, which livens up the proceedings enormously. It also switches to a scrolling spaceship shoot-em-up for a sprinkling of much-needed variety. And the whole affair is pleasantly designed, with a nice touch of humour, despite the generally uninspired Capcom knock-off vibe.Shockman can also be headbangingly hard, the sort of game where you struggle for half an hour to get past the next five-screens-wide area. Boss enemies take a lot of beating, even if you manage the finger-juggling required to charge up your weapon while moving and jumping to avoid their relentless attacks, and there are sections rammed full of environmental hazards and missile-lobbing enemies that can't help but chip away at your meagre health. As with all these games, patterns can be found to make things easier but while you figure out these tactics it can be a punishing experience.Not the greatest offering on the Virtual Console then, but a solid enough example of early 90s gaming with all the pleasures and pitfalls that entails. If you've already downloaded Gunstar Heroes (and if not, why not?) then you only need to give this a spin if you're absolutely desperate for something broadly similar.6/10"}