{"ref": "https://www.eurogamer.net/pirates-of-the-caribbean-at-worlds-end-review", "date": "23 May 2007", "game_name": "Pirates of the Caribbean: At World's End", "text": "Almost a year ago I remarked that Pirates of the Caribbean: Dead Man's Chest was ~a bit like an entirely brainless Prince of Persia without the subtlety or design genius~. Worse was to follow, in the assessment of it being ~one of the most crushingly generic gaming experiences ever designed. As in, in the history of gaming.~ And, predictably, the public lapped it up despite the dire 2/10 warning.Buoyed by last year's Top 5 success, Disney has gone all Activision-EA-THQ on us and released this year's PotC title on a gazillion formats to ensure that every living soul (and probably a few undead ones, too) gets the chance to play the game of the summer blockbuster movie, At World's End. Eternally optimistic, we plumped for the 360 version on the off chance that it wouldn't make us want to rake the eyeballs out of our own face in despair. But, as usual, such misplaced positivity only made the process of playing through this rancid mug of grog all the more intensely torturous.Developed by movie license stalwarts Eurocom (of Batman Begins, James Bond Nightfire and Ice Age 2 'fame'), we weren't exactly expecting it to realign our opinions on loveless, bloodless movie tie-in fodder, but you never know. In fact, for about ten seconds you might even be fooled into thinking that there's evidence of rich potential in the game, largely thanks to the respectable degree of effort that's gone into the artwork. Glancing at any of the 11 levels in At World's End you'll want to admire the rather lovely game engine, with detailed environments, lovely rain effects and consistently uncanny likenesses for all the key characters.But the very moment you get your hands on the game, you know that any chance the game had of being good has been crushed by whoever designed the truly execrable combat system. At some point during the game's development, someone very deliberately wanted to make the game 'accessible'. Not an unreasonable decision to make given its target audience and the fact that it's a mass market summer movie, but you can go too far with making games 'accessible' when it takes any challenge or enjoyment out of the damned thing. A dog with a twitch could finish this game if you cellotaped a joypad to his paws, but even Fido might get tetchy after level 3.Rather like last year's PSP abomination, for most of the game, all you have to do is repeatedly hammer the A button and point in the direction of whose swash you want to buckle. The process of dispatching endless identical AI-free goons not only lacks any vague semblance of wit or skill, but feels so dispiritingly flimsy that it beggars belief that Disney would want its good name attached to this utter filth. You literally slash your brain-dead opponent two, three, four times in quick succession, and at no stage does this army of the dead look capable of teaming up or fighting back. Then, bizarrely, after taking a few blows, they turn their back on you and stand there swaying gormlessly. You then apply the finishing blow and set about clearing the next obliging zombie in the rabble, one after the other, thousands of times in this tragic comedy of a game. The farcical scene of being surrounded by four or five enemies, and each one waiting their turn to face you just about sums up why this game should be roundly slaughtered by the critics. In this day and age, games that make no effort to even engage the player deserve to be held up and made an example of what not to do when you design a game."}