{"ref": "https://www.eurogamer.net/all-walls-must-fall-review-the-tactics-genre-gets-a-quirky-new-treat", "date": "12 Apr 2018", "game_name": "All Walls Must Fall", "text": "I have heard All Walls Must Fall described as a blend of real-time and turn-based tactical action,  set in a retro-futuristic Berlin in which the Cold War never ended and where all matters of consequence unfold in the procedurally-generated nightclubs favoured by gay time-travelling superspies. Deep breath. Influences cover everything from Twelve Monkeys and X-Com to Invisible Inc, Superhot and - when it comes to the wonderfully grungy animation that chops together 2D character models and low-poly 3D backgrounds - the old Paddington Bear children's series that was so memorably narrated by Michael Hordern. It all sounds a bit complicated really. But it isn't. When you get into a fight here, All Walls Must Fall is gloriously, deliriously, skull-shakingly straightforward.Gunfights are when All Walls Must Fall switches from behaving like a real-time nightclub exploration game (one of my favourite genres) and becomes a turn-based, grid-based tactical battler (which happens, rather neatly, to be my other favourite genre). You play as a hulking metal-armed killer who has been sent looping back through time within a single night so as to stop a bomb going off in the present. This means that time is as much his plaything in shootouts as space is. In fact, when you're exploring in the real-time mode, time is space. Each room you scout out rewards you with a few units of time resource that allow you to do all sorts of rewind-based shenanigans when the guns emerge. Time is space! Einstein would be proud. I bet he'd be well up for some futuristic clubbing, too.Oh dear. I've made it sound very complicated again. It really isn't. Once the guns emerge a grid is imposed on the landscape and enemy targets are picked out with bright highlights. You can shoot them - weapons frequently have a couple of distinct attack modes - and you can dash around from one square to the next dodging incoming fire. The system's sufficiently kind so as to warn you when you're planning on moving into a square that means you'll be taking damage. The perks of a time-traveller, I guess.Given the turn-based nature of the action, you can do pretty much impossible things from the start, skipping past bullets and flanking during reloads, running backwards from spreading shotgun fire and escaping behind a wall without so much of a scratch. Add to this drones you can hack to help you out, environmental destruction and cover and the fact that you have to remember to reload by yourself - or switch weapons if you've unlocked them in the shop - and there's plenty to keep you busy already.But then time gets properly involved. If you have enough time resources - because they're time resources you lose them steadily by going about your business too slowly, and you can also trade them in to hack doorways and drones and various other computery things - you can rewind time and take back bad moves. Or, once you've unlocked it in the shop, you can rewind your own personal time while leaving everyone else where they are, so you can take damage while shooting people and then wind back the damage you've taken while everyone else remains dead. Or - and Einstein would absolutely love this one - you can rewind the world but leave yourself untouched, so you can skip through alarmed doorways, for example, and then untrigger the alarm you just triggered. Time travel! What a thing.The best temporal trick All Walls Must Fall actually plays, though, is purely ornamental. You chug through what can be quite prolonged gunfights one move at a turn, spending ten minutes or so on piecing an epic shoot-out together - this is particularly fun once enemies start turning up with their own time-meddling tricks. Then, when it's all done and the shooting has concluded, you get to ~drop it~, which means you exit turn-based combat and then watch a real-time replay of all the mayhem you've just caused. You realise, at such moments, that what you're really doing in each shootout is animating. You are putting this wonderfully crude, gloriously scratchy cartoon together one frame at a time with every dash and every kill. And then you get to sit back and enjoy it. It's the death-ballet thrill of Superhot, but rendered in a completely different manner. Frankly, it is something else.Outside of the gunfights, All Walls Must Fall has benefited from Early Access with a lovely range of additional elements. There are the procedural missions that make up the Cold War storyline, accessed via a map screen that always gives you a couple of choices. There's the shop where you can buy your best time gadgets, or heal yourself between jobs, or kit yourself out with better weapons and armour and augmentations. There's a Daily Challenge mode, which is always a welcome thing, and there are the missions themselves that, while they may all be set in similar locations, offer real variety and encourage you to get in and out without triggering any alarm as often as they urge you towards the mother of all gunfights. Oh yes, and there's a conversation system that allows you to use everything from menace to open flirtation to achieve your goals. Conversations - I will be honest - are often rather hard to play tactically, since it can be tricky, say, to work out which one of a handful of assumed names is going to have the right effect on a person you've never met. But they add an element of tension and sexiness and sexy tension to proceedings that feels entirely in keeping with everything else that's going on. They befuddle me slightly, but in an entertaining manner.Best of all - and I think I am getting this right - you exit each mission by making it back to your retro-futuristic Trabant. At least I think it's a Trabant. Trabants were often known as 'the cardboard car', sufficiently flimsy to ensure that, as you rode in them, you were often moved, in your own way, to consider the fact that time and space are ultimately the same thing. They add the perfect touch of punkish melancholy anti-glamour to this wonderfully strange and inventive and oddly lovable clockwork blaster. If this really is the retro-future, I'm pretty happy with things."}