{"ref": "https://www.eurogamer.net/snk-vs-capcom-card-fighters-review", "date": "6 May 2007", "game_name": "SNK vs. Capcom Card Fighters", "text": "Not like this. This isn't how the story's meant to go. No, this should be the tale of the underdog made good, of the unknown fighter hoisted high upon critical shoulders, receiving the praise and mainstream adulation that should rightfully have been his eight long years ago. We should be writing about how the plucky little card-battling guy stuck two fingers up at fate and circumstance, threw off the need for a GDP-size development budget to punch above his weight and deliver a miraculous victory. This should be about faith and justice and redemption. This is meant to have been the redemptive life developer SNK should have lived but, instead, it ends up just being the story of how SNK actually lived: A sorry tragedy of squandered potential, wasted talent, vision clouded and international humiliation.Let's go back a bit. SNK's Neo-Geo Pocket and its subsequent color upgrade were the Game Boys who never grew up. Despite being utterly brilliant pieces of hardware - the NGPC indisputably boasted the finest control stick to grace any handheld console - this was a system squashed under Nintendo's sheer boisterous weight of product. Its games were too arcade-y (Metal Slug, King of Fighters), too sparse and there weren't enough third party supporters. Perhaps inevitably the machine, along with the company that created it, slipped into a quiet death in 2000.One year before that SNK signed a deal with arch rival Capcom to team up and release two co-branded games. The first, SNK vs. Capcom: Match of the Millennium was perhaps the greatest (thanks to that aforementioned control stick) 2D fighting game to grace a handheld. It brought together SNK's King of Fighters and Capcom's Street Fighter characters to glorious confrontation for the first time and dazzled fighting fans. The second game in the partnership was released in two collectable editions and was, to the incredulity of fans, a card-battling game. With the system nearly dead, nobody save obsessive arcade fighting fans paid much attention to this game and, of those, not many were interested in a kiddy card game anyway. More fool them because, to this day, the NGPC's Card Fighter Clash games simply haven't been bettered for depth and elegance in the card-collecting genre. The game (and we can give you more detail here because, at this point the older game and this sequel share some DNA) was a Pokémon clone in style but for your deck, a multitude of card-bound SNK and Capcom characters were pulled from every series imaginable. The considered gameplay revealed its depths gracefully over the long haul neither overwhelming a novice nor under-serving an expert. The chibi-style reworkings of each company's luminous back catalogue of characters exuded charm and style and, on a personal note, the game provided a delicious videogame-track to a sunny honeymoon, providing welcome respite from all the riotous lovemaking and cautious Chlamydia-dodging.So when this sequel was announced for Nintendo's flagship platform, coming from Playmore - the poor but nevertheless welcome custodian of the SNK name - the game's fans hummed with keen excitement. Here was the chance for a truly wonderful game to swim into the mainstream of contemporary games and posthumously vindicate an old and tragic handheld system. Twenty minutes in and Eurogamer wants to cry and shower.Before even a step is taken, the panic sets in. The introductory cut-scene, featuring three school kids talking excitedly about a card tournament in barely comprehensible strings of words, sets the scene. You make out that said tournament is to take place in a skyscraper and that the ginger kid (who looks a bit like he might be the lead character) is going to compete. The scene dissolves and you're asked to name and choose a character. That done, it's back in for another cut-scene except, instead of the character you just picked to be your character appearing as your character, the ginger kid is back in the lead role. We restarted the game three times because we thought we must have made a mistake.But no, in a stunning display of what could either have been logic flow incompetence or simple resource poverty (and, as the game progresses it's clear it's probably a lot of both) the character you pick only looks like the character you pick during fights. The rest of the time he looks like someone else. Excusable, you, devoted fan, think to yourself (though you know it really probably isn't) until, the next cut-scene continues with the nonsensical script. Throughout the game the words are familiar but, on the whole, they just take on ill-fitting formations, occasionally making up new words altogether (e.g: ~misunderestimated~). Still, from the pictures it's clear that the skyscraper's megalomaniacal computer, Max, has brainwashed all the championship attendees to work for him (all except you) and you need to work your way up the tower, un-brainwashing competitors by beating them at cards before pulling the plug on the angry PC on the top floor.Speaking of the skyscraper, it's comfortably the least inspired and inspiring location any videogame's ever been set in. Composed of 21 floors, you must painstakingly make your way up, level by level, beating every competitor on every floor before progressing to the next one. You don't even get direct control of your character (or rather the character who represents the character you picked at the start of the game). Rather, the top screen shows him walking around, while the bottom screen, the one that you control, simply contains three or four dots (representing people), which you flick between and activate.Still, we're here to play cards, right? That much can't be broken. Devastatingly, from the first match it's abundantly clear that Playmore has tried to reinvent WHAT WAS UNQUESTIONABLY A PERFECTLY FUNCTIONING wheel. It's like Tolkein died and his illiterate son tried to rewrite Lord of the Rings for him. This kind of thing literally never happens. The hallowed CFC mechanics have been complicated ten times over and, predictably, there is absolutely no hand-holding - no clue as to what Force or CP or BP or HP mean in relation to what. To find out, y'know, how to play the game, you'll need to dive into some deep and hidden encyclopaedia-style term explanations which are, naturally, written in broken English.We'll spare you the gritty minutiae of the card battling mechanics as, to adequately cover them would take hundreds of words and you probably still wouldn't understand them even then. Suffice to say you have a deck of fifty cards (which you swap cards in and out of as you buy them from shops) of various strengths and abilities. You must use your cards (up to eight at a time) to attack the other player's HP while also cleverly managing them to take the damage that his cards would seek to inflict on your own HP. The finer details are massively more intricate but they would be largely pointless recounted here. Nevertheless, it takes between five and ten battles before the mechanics start to make sense. Problematically, the special moves that some cards can trigger (by using the Force gems) are incorrectly assigned on many cards so that the actual effect often isn't what you're told it will be. Also, at the start of each game, you must roll a dice to decide which player goes first and, as Playmore has butchered SNK's masterful game balance, going first is a gigantic advantage that in most cases will pave the road to swift victory. At least, it would if the AI knew how to play its own game. Frequently, the DS will hold back (or fail to notice) moves that could finish you off and so, besides being a chore, the game's just too easy in the main.Once complete, you're able to play through again, working your way up through the skyscraper's floors (which are separated into SNK and Capcom themes) a second time. This is essential for completists as gaining many of the higher ranking cards to populate your deck with is only possible the second time through. However, a crippling bug makes the game freeze on the ninth floor the second time through, breaking the game completely beyond repair and upgrading its problems from irritating to terminal.Obviously, this is the kind of colossal cock-up that is not only deeply embarrassing to the diminutive Playmore and the stringent Nintendo but is also, potentially financially crippling to the smaller company. As such it seems a little cruel to further put the boot in. A QA mistake of this magnitude is simply the ultimate conclusion to a localisation process that was clearly stammering from the start. Of course, once re-localised for Europe this devastating problem will hopefully be fixed. However, as publishers will usually simply just translate from the American rather than reworking from the original Japanese, the translation will likely stay as poor.Either way, currently, this game should not be for sale in its current state. It is broken in the literal sense of not working as sold and, as such, must be scored appropriately. That the game underneath the bodged localisation is also, figuratively, a broken shell of what it once was and absolutely nowhere near as good as it should have been, is more than anything, deeply, deeply sad."}