{"ref": "https://www.eurogamer.net/ds-game-roundup-review", "date": "4 May 2007", "game_name": "Reviews", "text": "Sifting through the ranks of obscure Japanese videogames used to be the sole preserve of the risk-taking importer; the chancer with a smidgen of kanji tumbling around his brain, some product listings cut from the back of a magazine, and a wacky bridge adapter for fooling his hardware into compliance. But now, thanks to the massive success of Nintendo DS, more of these games than ever are turning up locally, as small publishers like 505 Games take one look at Nintendo's figures (23 million DS consoles sold in the last 12 months, 123 million software sales, casual games outselling Mario) and start cutting cheques to Japanese companies like Taito, Success and Star-Fish. Budget-priced and in some cases roughly translated, the six titles reviewed on the next few pages are all available in this country, either this week or next, and it's all thanks to that man at work who says games are rubbish but secretly plays Brain Age with his girlfriend. You might have to look behind a few Nintendogs to find them, but they're there. The question is, will you want any of them?So, anoraks, throw away your magazines and join us for a sift.It may not be a name that sticks in the memory, but Monster Puzzle is probably worth nailing to your pre-frontal lobe for a few hours at least. It's a falling blocks game that works a bit like Jewel Quest; there are lots of icons with monster faces on, your basic work is eliminating them in groups of three, and wherever you delete them the colour of the squares on the grid behind them changes.Stages in the story mode ask you to change a certain number of squares' colour, perhaps several times over, while the shape of the playing area changes from stage to stage, so covering all that ground is more difficult than simply spotting a few easy chains would be in Bejeweled, Zoo Keeper or Puzzle Quest.The method of eliminating monsters is different too. Instead of moving one tile one space at a time, and only being able to do it when it forms a set of three in adjacent squares, here you use either the stylus or the (much better) button controls to move an entire line back and forth, so if you have two furry blue monsters lined up then you can actually reach to the other side of the screen to locate the third.Obviously this leads you down different strategic paths, and the things the game chooses to reward are interesting too. Whereas the shape-association games we name-checked earlier all reward lines of four and five blocks handsomely, Monster Puzzle is nonplussed by this, preferring to see a pair of twos sliding alongside one another to form a square of four - at which point all four disappear along with those directly around them.More immediately familiar is the game's principle means of building up tension: running down a timer quicker and quicker. Fortunately you can amass little clock power-ups to help claw a bit back when you're on your last legs. Other power-ups delete certain shapes, but you need to watch out for negative effects too, like a spider that reverses movement controls, or cobwebs that hold monsters in place, forcing you to work around them until you can kick off a deletion in an adjacent square.All in all it works fairly well, but it suffers from the same problems as a game like Jewel Quest, where you end up treading water for ages with meaningless clearances just to keep the timer alive, all the while the other half of your brain's scrambling to work out a way to clear tiles in hard-to-reach areas. Becoming proficient is inevitably rather strained, since half the time you get it right you do so by accident, and the opportunity to practice only emerges when you're under pressure.Nevertheless, some players will enjoy the way it works, and our constant references to Jewel Quest certainly should be interpreted as a signpost for fans of that. But there's a much wider pool of excellent and far more accessible DS puzzle games out there to sink into, and even single-cart multiplay probably won't keep Monster Puzzle alive for those who've bathed in warmth of games like Puzzle Quest. Worth a look, then, but not very memorable. Perhaps the name's apt after all."}