{"ref": "https://www.eurogamer.net/pc-game-roundup-review", "date": "30 Apr 2007", "game_name": "Reviews", "text": "They can't all be Gods of War and Legends of Zelda, so with that in mind we take a dip into five PC games that you might not have heard of, and emerge with some scores. Let us know if the format appeals.Game pageImagine, if you will, that you're a photo-journalist. Which is basically a lazy bastard of a hack who can't be arsed actually thinking or writing, so swans about the globe here and there taking pictures [not bitter - Ed]. Wild Earth Africa casts you in the khakis of one such layabout, tasked with completing photo assignments for a magazine.Think of it as an educational family-oriented version of Deer Hunter in which the rifle has been replaced by a camera. The player runs around the competently rendered landscape - with driving and a helicopter ride involved in certain missions - and objectives pop up on screen. ~Snap elephant gouging tree~ for example. ~Photograph rhino having a piss.~ If you're not quick, you'll miss the action, and if you overlook too many photo ops the mission will be deemed a failure.Along the way, pertinent facts about the environment and animals are imparted to the player, and the kids will likely find these quite interesting. Indeed youngsters can build up full photo albums of their shots and show them off to their parents, which more creative types will doubtless revel in.The weakest element of Wild Earth Africa is that to snap some pictures, you have to be pretty quick-eyed and fleet-footed. Which is fine for adults, but that really isn't who the game's aimed at, and children may find this frustrating. Especially when coupled with the fact that you can be unsure as to what you're being asked to photograph, which can lead to the player snapping away repeatedly at all the beasts in sight in the hope that they hit the correct target at some point.Despite these issues, Wild Earth Africa is a reasonable slice of edutainment which will hold the kids' attention for a while."}