{"ref": "https://www.eurogamer.net/ancient-wars-sparta-review", "date": "26 Apr 2007", "game_name": "Ancient Wars - Sparta", "text": "Okay, come on, get it out of your system. If you're in the privacy of your own home, it may help to stand up and shout. Come on - ~THIS IS SPARTAAAAA!~ There you go. And the other one. Out with it... ~TONIGHT WE DINE... IN HELL!~ Very good. Now, doesn't that feel better? You can now safely read the rest of this review without feeling overcome by the urge to shout like a mad beardy Scotsman with computer-generated pecs. That's just as well, because anyone who's still got a bit of an afterglow from their cinema expedition to see 300 is probably reading this review for the wrong reasons.Ancient Wars: Sparta isn't a game based on 300, and it draws no noticeable inspiration from Frank Miller's incredibly loose adaptation of the Battle of Thermopylae. Now, you can call it a cash-in title if you like. We'll admit that it's pretty convenient for this game to be appearing just when a whole generation of historically challenged types has discovered that the word ~Spartan~ meant something before Halo was released. Let's run with the benefit of the doubt, though, and call that a lucky coincidence. After all, Ancient Wars: Sparta, being a fairly extensive real-time strategy experience, isn't exactly the kind of game you churn out overnight to match an upcoming film release. Sadly, however, that's not to say that it's exactly a labour of love either.Ancient Wars: Sparta, in brief. It's a real-time strategy game where you control the forces of either Sparta, Persia or Egypt, and engage in a variety of campaign missions aimed at bringing conquest and glory to your forces. In the now well-established manner of ~ancient world~ RTS titles, you have a few named heroes on the battlefield whose abilities level up. Combined with the ability to equip your units with different weapons, this gives the whole thing a smattering of RPG-esque features.Now, there's no problem with any of that - it sounds like the basis for a fairly solid game when you put it in those terms, in fact. No, the problem is that Ancient Wars: Sparta doesn't actually step beyond those fairly familiar boundaries, except in a few very limited cases. Worse again, while remaining within the boundaries, it fails to actually deliver an experience which is up to the standards of previous, incredibly similar games.Each one of the three sides in the game plays in pretty much exactly the same way. Each one has their key strength - the Persians have War Elephants, the Egyptians have a catapult style device that fires a massive volley of arrows, and the Spartans, unsurprisingly, have great infantry units. However, on a basic level, you'll find that there's no major difference between playing the different sides.Part of the reason for that is that there's actually disappointingly little strategy involved in playing any of the sides. Combat tends to dissolve into a jumbled melee within seconds of being initiated, which leaves the player's actual tactical options reduced to ~throw more units at the situation, or retreat~ - and if that kind of decision was fun, there would be a hell of a lot more games out there based on the Iraqi civil war.Instead of the kind of solid, varied combat which the RTS genre has been steadily evolving towards over the years, Ancient Wars: Sparta falls back on resource management for its core gameplay. Distressingly, this is a sub-Age Of Empires affair which rapidly becomes a chore; you'll probably spend a significant majority of your time directing peasants to gold, wood and food supplies by hand. There's no way to convince your peasant population to micro-manage itself, annoyingly; you click each peasant and order them to work by hand, or they'll just stand around looking generally bone idle.Once you've actually got your peasants to shift their lazy, peasant backsides, you'll hit the next problem - building anything useful in this game is slooooooooow. Every single one of those o's is needed to emphasise just how badly things crawl while you're building your base and amassing a decent army. While occasional enemy sorties to nip at your defences provide a certain amount of entertainment, you'll still rapidly come to associate Sparta with progress bars, not action.So, you amass your army, at long last, and you charge for the enemy stronghold - hurrah! Except, there's really not very much you can do on the way, as a strategy game player. A shocking number of levels in the game are actually completely linear pathways, which see you moving a single large force through a pre-defined path taking out opposition on your way. Each enemy force you come across is dealt with by simply running headlong at it and hitting it until it falls down. The whole combat experience has all the finesse and grace of a drunken tramp falling down the steps of a rapidly braking double-decker bus.Now, a few words in Ancient Wars: Sparta's defence should be said here. Firstly, let's be clear; these sins are not unique to this game. We have played plenty of games over the years which follow the same school of design as Sparta, with heavily funnelled missions, excessive focus on sitting around watching your army being built, badly differentiated sides, and so on. Sometimes, those games can rise above such issues and end up being extremely good - Age of Mythology is a very relevant example, albeit quite an old one.It's also worth adding that if you invest some time in the game and carry on to later encounters - or, indeed, try it out multiplayer, where the predictability of the AI is altogether less of a concern (although the slow build speed really rankles) - it does get somewhat better. Once you're throwing around impressive units like War Elephants on the battlefield, you do start to get a feeling for the combined arms system which underlies the game, but it's still buried under too much mediocrity to rescue the experience as a whole.The one feature which we'd pick up on and highlight as being genuinely clever and well-implemented is the ability to equip your troops with different weapons according to the circumstances in which they find themselves. This adds a great deal of flexibility to the game, because it's not just a case of upgrading the stats on the bows carried by archers; if the situation calls for it, you could actually arm an entire group of archers with short swords and send them into melee battle. They won't be as effective as properly trained melee troops, but the ability to do this gives the game a whole new ~last resort~ strategy to play with, and forms the one truly, strongly positive thing we can say about the gameplay found here.Now, in fairness to Ancient Wars: Sparta, it certainly isn't a slouch in the graphics department. While it's by no means the best-looking PC game we've seen recently, it does hold its own very well compared to the majority of other RTS titles - and the action is very nicely animated once you get in close. We're also fans of the art direction in many parts of the game - and the three cultures represented each have a unique and nicely realised style to their settlements, which is a great touch.However, beyond the graphics engine and in-game art, the presentation of the game is weak. The voice acting is extremely amateurish in parts, and while some of that is obviously down to simply using poor actors, some of it is also down to the dreadful scripts they are given to read out. Also worthy of note - in a bad way - is the decision to occasionally drop the player into pre-rendered video of in-game graphics. The idea, presumably, is that by doing so, multiple angles or scenes can be shown off without having to load in piles of textures and risk framerate trouble. In practice, though, the video segments are badly compressed and ugly, and simply look atrocious and jarring next to the in-game graphics themselves.It's not exactly what you might call inspiring stuff, overall - and while releasing a game about Sparta so close to the cinematic success of 300 might seem like a canny move, from a gamer's perspective, it actually heightens the disappointment. The rich, stylised Sparta we've seen on the silver screen - or indeed, the overblown Spartan mythology of God of War and its ilk - are ultimately much more interesting than a more stuffy historical view strapped to an exceptionally mediocre RTS game. However, it's not comparisons to 300 that hurt this game most - it's the fact that its icon on your PC desktop will probably sit next to things like Supreme Commander, Medieval 2, and even Command & Conquer 3. Any one of those games, or half a dozen others, is a telling reminder of just how stuck in the past Ancient Wars: Sparta really is. We thought the title referred to the historical setting; in hindsight, we might have been assuming a little too much."}