{"ref": "https://www.eurogamer.net/wing-island-review", "date": "25 Apr 2007", "game_name": "Wing Island", "text": "Game development is such a minefield these days. And you know whose fault that is? Yours. You continue to read websites like Eurogamer, where mean-spirited stupid-heads like me continue to claim, outrageously, that some games are just a lot of dull nonsense tacked on to one half-decent idea in a vain, plodding attempt to justify it. How dare you?Well, I'm not going to stand for it. I'm not going to be mean to Wing Island. I'm not going to turn our focus immediately to the story, and stamp it into the introduction like a blob of waxy indifference. I'm certainly not going to give it its own paragraph.~Once upon a time, in a world ruled by birds, there was a young swallow who lived on an island in the south seas. His name was Sparrow Wing Jr. He ran a handyman business using an old biplane. He had inherited both plane and business from his grandfather, who was also a pilot. The other birds from the island chain paid Sparrow Wing Jr. to do various jobs, which he liked to call 'missions'.~What's more, I'm not going to spend paragraph four questioning whether Wing Island's jobs (missions - I'm certainly going to get that right) were also tacked on. I'm not going to point out that they all consist of flying somewhere and pressing the B button to drop something, or the B button and then the A button (watch out, IL-2 Sturmovik, I won't joke), and I won't add that the most complex involve pressing B to pick something up on the way to pressing B to drop it off, and that for extra variety some involve circling over the same bit of land repeatedly until you've done the same thing enough to satisfy the game's bizarre fetish for having the B button rubbed across its tummy.Moving on from that, I won't explain that all of the other birds on the beakipelago or whatever it's called are stingy bastards who yank most of your reward the second you make a mistake. Almost to the second, and certainly on account of any extras. I won't claim that having to spend an extra 5 or 10 seconds looking for the last of five cows because it was hiding in a cave robs you of most of your money, ranks and points, or that simply travelling by the shortest distance possible at top speed between three distant islands to deliver medicine is second only to the Arsenal strike force in this fowl resort's vision of profligacy.Nor will I castigate your wingmen for singularly failing to exhibit any artificial intelligence whatsoever, instead hovering obediently in formation around the leading plane whether it's flying into the ground or a wall or a gap too narrow for them to do anything. Having not made that point, I won't clarify the extent of your wingmen's stupidity by mentioning that, in situations where you've been unable to evade whatever cliff you're trying to circumnavigate to a complete degree of success, they choose to follow your failure into the rock-face and bounce along it rather than taking evasive action or - heaven forbid - manoeuvring out of formation. Live together, die together, I won't conclude.And I certainly won't kick off the next paragraph by revealing that I was articulating all this angst in service of the belief that the only thing in Wing Island that took any time to come up with was the control scheme. Because why would I do that? Why wouldn't I just open the review that way instead? Why wouldn't I begin by saying that everything else was made up on the spot in order to justify selling those priceless lines of code to the gullible early adopter, who flaps unhappily into his nearest games shop in desperate need of a new Wii title? It's an easy conclusion to reach - the Wiimote is used as though you're actually gripping the fuselage of a plane, allowing you to roll your hand left and right to turn, or tilt the Wiimote up and down to direct the plane's nose, and as a result the system is extremely intuitive. It was inevitably going to be a game where that came first. Only a complete meanie wouldn't get that out of the way before everything else.In fact, virtually my only concession to criticism would be to quietly and respectfully point out that the control system itself is somewhat flawed. Your on-screen plane may capture, almost perfectly, the movements of the Wiimote in your hand, and a trio of extra moves - the speed boost, rapid brake and 180-degree turn, activated by thrusting the Wiimote, pulling it quickly back and flicking the point to the left or right - allow for a greater range of movement options, but the degree to which it accepts input is actually counter-productive, often forcing you slightly off-line when you're trying to approach something at a precise angle. Having ditched my old tactics though, I won't be adding that in a game where approaching things at a precise angle is virtually all you're asked to do with any competency, having a control system this fidgety is the sort of bad news that in any other context would have us glued to CNN for 48 hours in a row using the couch as a toilet.Nor, finally, will I ram the point home by adding that Wing Island barely qualifies as a flight simulator, given that wind has no effect, you can slow to 11 knots, upside down, without stalling, and that you bounce repeatedly off the scenery as though you're being crap at a 16-bit racing game. I won't mock the two-player mode, where one of you uses the Wiimote and the other the Nunchuk, by dismissively adding that it inherits all the single-player game's inadequacies, and I certainly won't conclude that the overall game is barely worth your time, half-marks, or the evening or so you could spend extracting what slight entertainment it has to offer. I'm a new man. Get used to it."}