{"ref": "https://www.eurogamer.net/first-eagles-the-great-air-war-1918-review", "date": "24 Apr 2007", "game_name": "First Eagles: The Great Air War 1918", "text": "Hi Matt. It's Oliver here. Sorry to bother you at this hour, but I was wondering if I could pick your brains about a combat flight sim?Sure. Go ahead.I'm supposed to be giving Eurogamer a First Eagles review tomorrow morning, but because of that business with Zoe's toe, I've only had time to fly a handful of missions. From what little I've seen, I'm thinking a 'five' or a 'six' - ~Third Wire wring another agreeably accessible, but achingly unimaginative lite flight sim out of the Strike Fighters engine~. Sound fair?Pretty much. I gave it 52% over at Game-Gauge.com. My main gripes were the absence of atmosphere and lack of content.What - you mean the lack of flyable planes?Yes. I know TW are a small outfit and the download version is only 15 quid, but still... just three rides? That's meagre. It's not even as if the trio are particularly charismatic or deeply modelled. With no engine management, or big differences in size, firepower or role, the SPAD, SE5A, and Fokker DVII end-up feeling very similar.It does seem strange they didn't include famous machines like the Camel and Fokker triplane. Or maybe a flyable bomber.I think the plan is to add other warbirds - other phases of the war - via expansion packs. Also TW know full-well that fans will fill in a lot of the gaps themselves. Sites like Combat Ace and Capun Skunkworks already offer dozens of user-made crates.Mod abundance. That's good.It is, but you've got to be fairly committed to take advantage of it. Most add-on aircraft don't have installers, won't automatically appear in the game (you'll need a customised campaign) and can cause problems in multiplayer. For a series that relies heavily on user-made content, the mod utilisation facilities aren't fantastic.    How did you find the campaigns?Cream-cracker dry. The system is similar to the one used in Strike Fighters, Wings Over Vietnam, and Wings Over Europe: randomly generated sorties sandwiched between dreary text briefings and debriefings. There's no attempt to evoke the life of a WWI aerodrome, or flesh-out fellow pilots. There's no real sense of the scale or savagery of the fighting on the Western Front either. Ultimately the campaigns feel like mechanisms rather than milieus.Couldn't you say that about a lot of recent flight-sims - the IL-2 series for example?Yes, I suppose you could, but IL-2 has richness elsewhere.Right, I'm going to have to pretend that I finished at least one campaign. What kind of sorties would I have flown?The usual stuff: patrols, recon flights, balloon attacks, some ground-pounding; occasionally you get to strafe and bomb columns of trucks and troops of tanks.What about interceptions? Any opportunities to bring down big bombers or zeppelins?Nope. The supporting cast is about as tiny as the selection of flyables. No lumbering Gothas, Handley Pages, or dirigibles. Well, not unless you download community-crafted creations.This is starting to sound like a demolition. You must have liked something about it to give it 52%.I did enjoy some of the dogfighting. AI foes aren't as unpredictable or as skilful as they might be, but, since the patch, they do make you sweat on occasions, especially if you're playing without targeting aids. With the red identification boxes, screen-edge arrows, and data panels deactivated it's surprisingly easy to mistake friends for foe, fail to spot tailing bandits, and lose sight of targets against the ground. There's challenge available if you go looking for it.I wasn't overly impressed with what I saw of the damage or flight modelling.Yes, it's all fairly simplistic isn't it. No splintered spars, flapping canvas, slumped pilots or spluttering, oil-spraying engines. I might be wrong but I don't think FE does stress damage or blackouts either. You can put your aircraft or av(i)atar through aerobatic hell with no ill-effects whatsoever. Landing parameters are about as forgiving as they could be.But you still went with 52%?A portion of that score is probably subconscious acknowledgement of FE's rarity value. After almost a decade without a serious standalone WWI flight sim, it's nice to be peering out over a pair of chattering MGs again, nice to be duelling at close quarters and snail speeds. If it wasn't for the presence of Over Flanders Fields, a high-quality Combat Flight Simulator 3 mod, and the approach of Knights of the Sky, a promising WWI sim from Russia, the effect would be even more pronounced.I'll have to check those two out. Hmmm, what about the accessibility angle - do you think that's worth emphasising?Definitely. The combination of the low-tech aircraft and weaponry, the forgiving flight models, robust undercarriages, and kind collision detection (a lot of trees and buildings are incorporeal) make FE very friendly. The first time I fired-it-up was the night of Rob's house-warming party. Despite being several sheets to the wind, I figured-out the keys, configured the joystick, and flew half-a-dozen successful missions without a single glance at the manual. Talking of drunken endeavours, how's Zoe doing? She's doing fine. The surgeon that sewed it back on said it would probably put an end to her high-wire work, but all the trapeze and horse stuff - it shouldn't affect that at all.That's good to hear. Well, if you've got enough info now, I think I'll leave you to your reviewing.Yes that's plenty. Very helpful. Thanks a lot Matt.Any time.Bye.See you.CLICK"}