{"ref": "https://www.eurogamer.net/backbone-review", "date": "18 Jun 2021", "game_name": "Backbone", "text": "There's a melancholy to Backbone. Like a stale perfume, it permeates everything - the environments, the weather, the dialogue, the music, the story, even the characters' names. It's not out of place, exactly, because at first it fits this pixel-perfect, ~post-noir~ detective tale, but later, when that tale takes an astonishing and inexplicable turn, it feels disingenuous. A long-con, even. Because what Backbone purports to be is very different to what it really is in the end.Your life as PI Howard Lotor - a raccoon detective with the obligatory trenchcoat and a penchant for the dramatic - kicks off pretty much as you'd expect. He lives in a small, run-down apartment, unable to let a single thought pass through his mind without lacing it with a healthy dose of cynicism. His work - an endless parade of cheating husbands, apparently - is neither exciting nor inspiring, and Howie's keen for you to know exactly how unrewarding it is to him.Despite its moodiness, though, Backbone's journey through dystopian Vancouver takes you to some truly stunning backdrops, painstakingly fashioned in stylish pixel art. Jogging up the street in Glanville, rain speckling the screen as neon reflections dance in pavement puddles, you can peer into the windows of the apartments stacked above the shops and offices along the main strip, watching as the creatures within eat or smoke, silhouetted against the flickering light of their TV sets. It's endlessly fascinating for a voyeur like me and - accompanied by a broody score and fantastic sound effects - it's testament to masterful world-building that successfully delivers a universe that feels authentic and relatable despite the anthropomorphic creatures lining the streets. Howie himself is endearing in that grizzled, tough-shell-warm-heart kind of way most fictional detectives are, too, and there's a delightful tinkle of self-awareness that runs throughout the story, from the acknowledgement of his predicament - ~Look at me; I am a raccoon in a trenchcoat,~ he tells one passerby - to his curt To Do list: ~Call mom. Buy soap. Pay bills. Don't die~. Good lessons to live your life by, I guess. Gameplay-wise, however, there's decidedly little variation. Beyond a handful of perfunctory if criminally underused puzzles and stealth sequences, Howie spends most of his time stomping from one chatty NPC to the next, asking questions and gathering intel. It's great that so many of the creatures you encounter on your journey are beautifully realised and keen to talk, every one given a name, but the lack of voiceovers can leave these encounters feeling a little flat, even if the dialogue is usually pretty well written. There's only the illusion of choice when it comes to Howie's interviews, though. Sure, he can adopt different tactics to question various NPCs, but I've played through twice now, and it seems that regardless of your dialogue selections, all roads end roughly in the same location. Sometimes the back and forth seems little more than pointless busywork, too - sure, it's cute that we've paired up this elderly Gastown couple in the hope they'll give each other companionship in their twilight years, but was it strictly necessary? Did it propel the story forward? And did they really need a detective to pair them up given they were standing about 12 feet apart? There's a lot of this sort of thing - Renee really needs to learn how to brew her own bloody cuppa, you know - as well as cult stuff, and a strange, dark pivot to the questionable choices of the local meat suppliers. There's also a thoughtful subplot of what it means when the upper echelons of society conspire to bend rules and amend the law to keep the poor firmly under the heel of the rich, privileged few. But then you move into the final act. Oh, that final act.I've played a lot of games in my time. I've played a lot of bad games in my time. None, ever, have prepared me for the final third of Howie's adventure, and I suspect if I asked you to guess the ending - even if you plucked the most ludicrous, ridiculous, far-fetched, utterly unbelievable scenario from the deepest recesses of your head - you still wouldn't guess what happens. Backbone makes such a ludicrous narrative pivot it essentially leaps right out of its genre, and in the process does an injustice to both its characters and the work that has been done to this point, while leaving crucial plot threads unresolved and members of the cast ignored. It unstitches all of the careful, thoughtful preamble in a way that leaves me both open-mouthed and utterly infuriated, even though part of me is delighted that Howie's managed to - finally - stumble across a story that's worthy of investigation.And look, I get it. Video games. They're incredible things that let us entirely uncouple from the realities of the world. Simple universal truths like gravity and rain and death and love no longer apply, and we can conjure up impossible worlds with improbable people because the magic of a medium like this is that we can tell tales beyond the scope of our world. But again, Backbone doesn't just take a curious turn as much as a total non sequitur, and the result is a broken mess of incomplete storylines and plot holes that left me grossly dissatisfied.~Backbone will likely be remembered by all those who encounter it, but probably not for the reasons the developers hoped.~Despite its truncated running time - you can complete this in a single afternoon - there's little incentive to replay, too. I could forgive a concise experience if the gameplay was rewarding and the story worth telling, particularly if there were multiple endings, but at £18 it's not exactly cheap, and given there are no multiple endings (narrative designer Danny Salfield Wadeson confirmed on Twitter that there's ~just the one ending... [as ]it's the story we wanted to tell~). Consequently, it's hard to recommend Backbone knowing how fleeting your adventure will be, particularly as its thorough lack of interactive gameplay elements make it more like a visual novel than the RPG it's purported to be.Ultimately, Backbone will likely be remembered by all those who encounter it, but probably not for the reasons the developers hoped. Despite a strong start, stylish design, and a truly likeable lead, little will prepare you for the game's jarring, nonsensical final act. There's no doubt here that Backbone has intentionally left its story threads hanging in order to segue into a follow-up instalment; here's hoping a sequel capitalises on its strengths and gives its players a more satisfying conclusion next time."}