{"ref": "https://www.eurogamer.net/q-bert-review", "date": "14 Apr 2007", "game_name": "Q*Bert", "text": "Having bought most of the games available for download on the PlayStation Store, I'm struck by the ambition Sony has shown, along with the strong sense of innovation, experimentation and value. The quality level is somewhat variable, but you can't help but get the sense that many of PlayStation 3's downloadable offerings are doing their best to push boundaries and go the extra mile in their own way - just as Bizarre Creations' Geometry Wars did at the debut of the Xbox Live Marketplace. Unfortunately, Q*Bert is somewhat akin to the stagnant depths that Microsoft's games-on-demand content is capable of plunging to, only worse.At its most basic level, Q*Bert is a direct translation of the quarter-century-old Gottlieb arcade machine, re-coded for PlayStation3, and given an extremely basic 1080p (!) high-definition facelift. The gameplay itself is identical to the original coin-op - you take control of the eponymous Q*Bert, your aim being to leap around the isometric-3D pyramid, changing the colour of each square until the entire structure is resplendent in its shiny new paintjob. Standing in your way are bouncing balls, creepy-crawlies and Q*Bert's arch-nemesis - Coily the Snake - who relentlessly pursues our long-snouted hero all the way to his ultimate destruction. The more levels you complete, the harder the overall task gets. Green balls drop that re-colour tiles you've already visited, and the general population of death-bringing monsters gradually increases until all of Q*Bert's lives are drained away. Additionally, later levels require you to jump on tiles multiple times in order to get them to the correct colour.Q*Bert's burden is only lightened by the inclusion of two helpful additions to the pseudo-3D arena. Discs on the side of the structure provide a lift to the top, and can also be used to bait Coily to leap off the side of the pyramid - a cunning trap that also wipes the level clean of any other bad guys that happen to be causing aggravation. The tile re-colouring green blobs can also be leapt upon to freeze the screen and give Q*Bert precious seconds in which to polish off a level.So gameplay-wise everything is in place from the original arcade game, and this conversion is slavishly close in terms of audio too - the apparently random speech synthesis of the old coin-op is dutifully recreated to voice Coily and give power to Q*Bert's trademark intelligible exclamations of life-losing anguish. Unfortunately, aside from the pin-sharp 1080p graphics, nothing much else of note has been added. There's the obligatory online leaderboards, but that's literally it - unless you include what must be the most useless, comedic implementation of support for Sixaxis yet seen in any PS3 title. This token support for Sony's tilt-sensitive controller is so laughably imprecise and unusable that one wonders how it passed through Sony's QA procedures. However, this game's biggest flaw is essentially the lack of core 'classic' quality in the original coin-op - that intangible 'something' in the gameplay that transcends the ages. Q*Bert may well be one of the most memorable videogames characters from the early '80s, but his on-screen doings are too simplistic and repetitive to make them worthwhile in 2007. More than that, the game is also hampered by an annoying control method - the isometric 3D perspective doesn't translate particularly well to the Sixaxis joypad, and often you'll find Q*Bert bouncing around in directions you don't want him to. Poor controls, lacklustre source material and almost non-existent extras all combine to make this one to avoid unless you have a particularly nostalgic longing for this particular slice of gaming antiquity."}