{"ref": "https://www.eurogamer.net/spellforce-2-dragon-storm-review", "date": "14 Apr 2007", "game_name": "SpellForce 2 - Dragon Storm", "text": "The original SpellForce spawned two expansion packs, and this first add-on for the sequel probably won't be the last either. Developer Phenomic is playing the RPG trump card here: dragons. The big fat scaley fire-breathing loot-hoarding lizards which are everyone's favourite beastie. But is Phenomic merely milking the dragon? Indeed, can a dragon be milked? And (perhaps the most important question of all), will they still include the obligatory mage who sounds like a German version of Julian Clary, but a touch camper?The answer to the latter question is apparently not - although instead there's a weird creature who talks just like Yoda - and the former, yes, there's a degree of lizard-milking going on but that's not nearly as bad as it sounds (particularly if you're euphemistically minded). Along with the lure of dragons, the game has also had its RTS-RPG balance further tweaked, and a few +1 bells and +2 vorpal whistles added, but fundamentally the experience remains much the same.The story, as ever, is interesting in parts - with clever ideas like a whole city which has been magically transformed into a giant ship (not sure whether Norwich Union would quote you happy on that) - but it's rather a mish-mash of generic fantasy and plot twists which don't always make sense. Interface-wise, nothing of note has been altered, although SpellForce 2 had a very orderly house in this respect anyway. In fact, after a year of playing other RTS games, I'd forgotten just how smooth those quick-click bars for your heroes' abilities made micromanagement in the thick of combat. What also hasn't changed, unfortunately, is the somewhat dodgy pathfinding which doesn't make those intense battles any easier.Dragon Storm even employs some of the same locations as the original, and you'll soon be back in Sevenkeeps talking to General Redmond about the latest disaster to befall the city. But before you start thinking that the sense of deja-vu might be overpowering, there are fresh features here which begin with the obvious new race to command and new loot to find (although we did find upgrades for our heavy weapons and armour fighter depressingly thin on the ground early on in the campaign).A system of item-crafting has also been implemented, albeit a rather unsophisticated affair, and on the character development front there's another option to invest your levelling points in alongside the melee and magic trees: Shaikan powers. These include pet summons, substantial debuffs and sizeable healing and hit point buffs.If you've played through the SpellForce series, you'll know that SpellForce 2 pushed the game more towards the RPG elements and away from the RTS base-building (without abandoning the latter completely). Dragon Storm pushes even further in this direction, often presenting you with maps which are tackled by your small party of heroes as opposed to an army of troops. When bases are involved they're largely pre-constructed, and the game takes a completely different tack on army building in some missions. For example, the aforementioned General Redmond's problem this time around is that his troops are besieged and starving. If you can get food to him, some of his men will recover their strength and fight for you, and there are two different ways to acquire the necessary rations to bolster your ranks - take to the wilds and hunt game, or raid an enemy supply convoy.It's pleasing to see some imaginative scenarios such as this throughout the game's quests, and greater effort has been put into fleshing out your recruited party members, with not only back story but sub-quests specifically involving them. When solved these reward that particular character with goodies such as an upgraded weapon.The online multiplayer has been embellished slightly, with a special skirmish duel map which allows one party of characters to face another in a small arena. Four new maps have been tacked on to the enjoyable ~free game~ mode, in which you team up with others to tackle a series of scenarios while levelling your character up just as in the single player campaign. These are minor changes, although the duel map is definitely entertaining.So while nothing substantial has been added to the SpellForce cauldron, the sequel's focus on smaller battles and quality questing has been refined, and the end result is a palatable expansion pack. With dragons."}