{"ref": "https://www.eurogamer.net/super-rubadub-review", "date": "13 Apr 2007", "game_name": "Super Rub'a'Dub", "text": "It has been five months since the PlayStation 3 was first released, and it's curious to note that support for the Sixaxis controller is still somewhat thin on the ground. Sure, we've had the odd spot of lacklustre optional support (MotorStorm, Virtua Tennis 3, Need for Speed and Q*Bert spring to mind) but there's been nothing to test the Sixaxis motion sensor as a precision controller; no showcase game to suggest that wobbling your joypad about offers anything better than using the bog standard analogue controls. SCEA's flOw boasted full motion-sensitive support of course, but its ketamine-fuelled pace was barely a test of the controller's mettle.Enter Super Rub'a'Dub; a Sixaxis-based title that charges you with the task of guiding a plastic mother duck around a series of bath-time derived aquatic mazes, popping bubbles to free trapped ducklings and then guiding them through to the exit. Rather than control the maternally-driven fowl directly with the analogue stick, you move about by tilting the entire gameplay arena using the PS3 controller. Everything on-screen not encased in a bubble is affected by your movements, a state of affairs most dramatically demonstrated by shaking the joypad sharply - an action that sends everything flying into the air, useful for levels that require you to jump from area to area.Clockwork sharks infest the majority of the game's 60 levels and wildly shaking the Sixaxis reaps rewards here too, as all but the largest predators can be tossed onto their backs and then flushed away from the gameplay arena with a skilled twist of the controller. However, the biggest challenges facing you are the ebbs and flows of the on-screen waterways. Here's where absolute control of the Sixaxis is required in order to battle the tides and stay on-course. As you progress into the game's trickiest levels, the power of the tides becomes far more pronounced, accentuating the challenge and pushing the control method beyond its limits and into the realms of gaming annoyance.The core of the problem is that you never feel quite sure of the accuracy or the limits of the Sixaxis. Just as a current begins to sweep you away, you instinctively adjust the controller to counteract the effect, but you never quite know whether you have enough tilt at your command to successfully battle against the tide. This makes key sections of the game's later stages little more than trial and error, and immensely frustrating. There's also the small matter of the game's water physics being far more precise and potentially impactful than the control method you have to compensate - hit a certain point of a wave at speed and you're sent flying, and there's nothing the Sixaxis can do to stop you and your duckling charges hurtling off the edge of the level. As the controls are not precise enough to let you control how you hit the water in the first place, it all becomes rather frustrating - a test of luck over actual skill.Control niggles aside, Super Rub'a'Dub has a lot of positives that make it a compelling purchase at its initial GBP 3.49 price point. While the concept is staggeringly simple, it's fun and extremely easy to get into. The Sixaxis control method might feel slightly unwieldy to joypad veterans, but it's different and rewarding enough to feel fresh, and has a mainstream appeal that doesn't alienate core gamers. Graphically, Super Rub'a'Dub keeps things simple, but it's still a good looking game - the water effects are very attractive and the physics make everything look and feel just right. It's also another native 1080p title, with no perceivable performance shortcomings compared to running it in 720p - another technical feather in the cap for UK developers Sumo Digital.Internet gameplay and simultaneous two-player options are absent, but the online leaderboards do actually increase replay value for a change, as opposed to making you feel like a club-fisted gaming simpleton. It's possible to download and view the best players at work on each level, and this spurs you on to try again and improve your performance, giving you new ideas on how to tackle a particularly bothersome stage. While Super Rub'a'Dub is by necessity a content-lite game, it does feel as though some degree of thought has been put into what it does offer, and you can't help but appreciate that.We're still waiting for a title to validate Sony's pre-release claims for the Sixaxis concept. All the evidence in Super Rub'a'Dub suggests that for non-demanding gameplay, it makes the grade but the motion sensor just isn't crisp enough for precision control. This does lead to the unfortunate (if predictable) conclusion that Sixaxis is a novelty, with very definite limitations. While the lack of absolute control has the unfortunate effect of making Super Rub'a'Dub a repetitious annoyance when you reach its hardest levels, there's more than enough fun overall to warrant the game's GBP 3.49 introductory price tag. I'm not sure it's worth much more than that though, so you're best off downloading the trial levels pronto and giving them a whirl before the price is hiked on 23rd May."}