{"ref": "https://www.eurogamer.net/rainbow-six-siege-re-review-an-exceptional-tactical-multiplayer-experience", "date": "30 Mar 2018", "game_name": "Rainbow Six Siege", "text": "Editor's note: Back when Rainbow Six Siege first launched at the tail-end of 2015, we found it a slight and occasionally spectacular multiplayer game. In the time since, it's flourished into something else, and with the start of season three recently, we thought it an opportune time to jump back in and reassess Ubisoft's tactical shooter. History suggests that games like Rainbow Six Siege do not last especially long. This is the sort of tactical shooter that modders used to craft out of bits of Quake or Half-Life, a paean to depth for depth's sake that seems destined to be adored in hindsight by the passionate minority that actually played it at the time. Yet here we are: now entering its third year, Siege is one of the world's most popular shooters. Its success can, in some ways, be seen as a forerunner of the dazzling rise of PUBG and Fortnite: in rejecting Call of Duty's Skinner box simplicity, Ubisoft has found an audience hungry for games where failure is unforgiving and success means more.The top line for the unfamiliar: Siege is an adaptation of the venerable Tom Clancy tactical action series, taking the principles of breach-and-clear counter-terrorism and marrying them to modern competitive multiplayer design principles. A team of attackers must invade a secure location in pursuit of an objective - a bomb, bioweapon or hostage - while defenders set traps and prepare to repel them. Death comes quickly and eliminations take you out for the rest of the round. The result is something like hide and seek in Kevlar: a game where discretion is almost always the better part of valour, where acts of planning and foresight win the day just as often as marksmanship.Team Rainbow - the double-tapping multinational Power Rangers of the Clancyverse - are more superheroic than ever. Each unlockable operative has access to different weapons and gear, and each has a unique special power. The initial roster of 20 has almost doubled in size since launch, and while not every operative is created equal they are a consistently dynamic bunch. There's a good balance of 'always useful' characters that new players can rely on to get a foothold - like the armour-dispensing defender Rook, or omnipresent battle medic Finka - and more technical characters for veterans to explore. Seeing a clever play by the hammer-wielding Sledge or window-creating Mira gives you something to aspire to. Then there's Tachanka and his turret, whose irredeemable crapness grants him a special sort of relatable celebrity.There are single-player challenges that collectively form a tutorial, and multiple forms of co-op: Terrorist Hunt, which apes Rainbow Six games of old, and a time-limited, Left 4 Dead-style zombie mode called Outbreak. The latter is impressive and odd in equal measure. It's lavishly produced and finds clever ways to make Rainbow Six's traditional gadgets and strategies applicable to a monster hunt - like zombies who don't become a major threat until they detect you, rewarding well-planned breach-and-clear maneuvers. Even so - limited-run cosmetic items aside - it's a mode that sits to the side of Siege's key appeal, which is and will always be competitive multiplayer.Siege's skill ceiling is high. Like its great inspiration Counter-Strike, the best players rise to the top and stay there and veteran judgement will triumph over beginner's luck nine times out of ten. This is no bad thing: this is a hobby game where you invest time with mastery as your reward, and it's refreshing to see a design like this come out of Ubisoft - a publisher so often associated with spiceless mass-marketability.When I say that Siege can be frustrating, then, understand it as a disclaimer rather than a criticism. Your best matches - win or lose - will be dynamic, exciting, and legitimately competitive. Your worst matches will be drawn-out drubbings, your best plans countered by gadgets and tactics that you couldn't have foreseen before they took you out of the round.While part of Siege's learning curve is comprised of widely-applicable skills and techniques - learning to peek, hide, disable traps, breach and so on - an equal (and equally important) element of the game is knowledge. Each new map and operator contributes to an ever-growing playbook of tricks and tactics, and as a consequence the game at the dawn of year three is an even more daunting prospect than it was at launch.Undertaking my ranked placement games I was constantly aware of how much I still didn't know. For every decent play I'd cobble together, I'd see something I'd never considered - a tiny hole blasted in a wall at a specific angle that lets defenders on a specific map snipe attackers charging in from a specific spawn, or a flanking counterattack timed perfectly to coincide with an easily-anticipated breach attempt. I watch attackers expertly snipe every tiny exterior security camera on a map in a few seconds and the prospect of memorising each of their positions - on every map in the current rotation - hangs over me like overdue homework.As with any other competitive game where players depend on one another for success, Siege has the potential to both bring friends together and create impossible gulfs of hostility between strangers. My recommendation for new players is that you embark on the slow journey towards competence with a few equally-new pals, and ideally an experienced and understanding mentor. Playing solo requires a little more patience - particularly a willingness to forgive yourself for mistakes that other people will leap on. Years of enthusiastic but amateurish performances in competitive shooters, MOBAs and strategy games has taught me that sometimes the cost of doing business is being called a fucking idiot by a very serious teenager. Even so: it's a thing. And again: this is a disclaimer, not really a criticism.Siege's success is owed, in part, to a wallet-friendly starter edition that allows you to play for much less than the cost of any of the game's full versions - which scrape the bottom side of £100 at their most extreme. This is not an act of charity, however - the more you choose to pay for Siege the less grinding you'll have to do to unlock operatives and cosmetic items, and while Ubisoft has recently made the game more generous with unlocks and upgrades this whole aspect of the game is its weakest element.The joy of Siege - and it is a joy - comes from really getting to grips with a particular map or character. Grinding through unlocks is a different, less gratifying form of progress - and being able to opt-out of the climb in for an eye-watering fee makes doing anything else feel a bit like a punishment. The fact is that you're unlikely to actually use many of the characters you unlock - this is a game where players specialise - but the anxiety of not having everything, and the attendant drive to spend, is a very modern design problem overlaid on a game with old-school multiplayer credibility.It has also undoubtedly played a role in Siege's success - microtransactions may well be the reason we have the opportunity to revisit the game at the start of year three. Even so, this overwrought array of entry points does not help you appreciate the game for what it ultimately is: one of the most rewarding tactical multiplayer experiences available, an exercise in well-managed complexity and lethal competitive verve."}