{"ref": "https://www.eurogamer.net/diddy-kong-racing-review", "date": "12 Apr 2007", "game_name": "Diddy Kong Racing DS", "text": "What's worse: a lazy, direct port of an older game to a handheld console, or an older game that makes a valiant effort to fit in with the hip younger crowd on its new platform, but ends up worse for it? Depends on the game, I suppose; I'd rather have put up with the enormous proliferation of near-unchanged-but-excellent SNES ports than seen them all mangled by botched attempts to bring them 'up-to-date' by replacing all the turn-based battles with minigames. The DS, though, has suffered exactly the opposite problem with what few N64 conversions it has enjoyed; Super Mario 64 was a game so perfectly created for its original console that its control system rather suffered in the transition, and SBK (in happier times, once known as Snowboard Kids) insisted upon ruining everything by teenagering up its lovably deformed protagonists and making you blow and yell at the screen every two minutes for no reason whatsoever.Diddy Kong Racing manages to incorporate the worst of both worlds. It is exactly the same sickeningly cute, single-player centric racer as it was ten years ago on the N64, but with enough pointless and inappropriate new features shoehorned in to sour the experience for anyone who might have enjoyed it back then. DKR was pretty unique as a multi-vehicle 'adventure-racer' in 1997, and it remains so now, but its visual style and design have aged rather badly, and the repetition inherent in its gameplay grates rather more today than it did back then. Its focus on single-player also means that the online multi-player falls rather flat, especially next to Mario Kart's riotously competitive racing. Worse, the touch-screen features range from mild irritation to insurmountably broken.DKR was something of a testing ground for Rare's N64-era heroes. Banjo and Conker both featured here before starring in their own games - Banjo without his backpack-dwelling companion, and Conker as a fresh-faced, irritatingly cute, squeaky-voiced annoyance devoid of any of the personality he later found in Bad Fur Day - but they've both been replaced here by Dixie and Tiny Kong (who I always thought were the same person, cunningly rebranded, but you live and learn). What's left is the dregs; Bumper the badger, Pipsy the mouse and a selection of other inconsequential characters with the customary differences in speed, control and acceleration. It was never the world's most inspired character design, but the years have not exactly been kind to it. The courses, too, now fall into the category of 'woefully cliched' - we've got Water World, Jungle World, Ice World, Medieval World and the secret Space World.Working through these worlds in Adventure Mode involves racing all the courses and finishing first before facing a special boss - a giant walrus, say. In the N64 version, you were then challenged to do all the races again whilst collecting eight coins, but here, you're thrown into an on-rails minigame where you float around each course, popping balloons with the stylus. This is the first of the completely incongruous stylus features; it's inoffensive, but completely out of place and horribly repetitive after a while. After that, you race the boss, again, and then you race all of the tracks in order, again, to win the world's trophy, and after that the boss challenges you to a completely broken, stylus-based race that's like a cross between Kirby Canvas Curse and Mario Kart; you have to draw a path for your kart on the touch screen, periodically spinning a little tyre in the corner to keep up speed. Sadly the kart almost never follows the desired path, and spinning the wheel prevents you from being able to steer; the races are near-impossible to control, impossible to win and absolutely no fun. At least they aren't mandatory.To make all this repetition worse, Rare has introduced a new feature - unlockables. These must be bought with coins collected in races, and cost a fortune, meaning that you'll have to race the courses even more times if you want to buy anything good. There's a lot of stuff in there, from new courses to vehicle upgrades to miscellaneous things like a sound effects recorder, which enables you to record yourself shouting various creative obscenities for every in-game effect. Sadly, that might just be the best thing about the game Despite remaining, after ten years, the only 'adventure racer' that I can remember appearing on a Nintendo console, Diddy Kong Racing still manages to feel unoriginal. Insipid character and course design married with inherently repetitive gameplay, obsessive collecting and an array of horrible touchscreen features make this feel like a waste of time. It's got plenty of content, and is a perfectly serviceable, occasionally competitive kart racer, but there's not much distinguishing about it. Ten years ago, I rather enjoyed this, but in retrospect, it probably belongs back in 1997."}