{"ref": "https://www.eurogamer.net/free-running-review", "date": "10 Apr 2007", "game_name": "Free Running", "text": "Despite what the title may lead you to believe, the Free Running game actually has more in common with Parkour. ~Aren't they the same thing?~ you cry, understandably confused. ~No~, I reply. ~No, no, no.~I once thought as you did, that there was only one urban sport involving running around and jumping off rooftops, and that it had two interchangeable names - a flouncy French one, and a more prosaic English version. Then I did a little Wikiresearch for this review and discovered that Free Running and Parkour are now totally different things. David Belle, who appeared as the runny-jumpy guy in Luc Besson's District 13, represents Parkour. This involves getting from one point to another in the most efficient way possible. Sebastien Foucan, who appeared as the runny-jumpy guy in Casino Royale, represents Free Running. This involves getting from one point to another in the most stylish way possible.See? Totally different. Don't laugh. It's a serious distinction. Google it. People get into fights over this stuff. Tsk.So, even though it's called Free Running and features a virtual Foucan as your mentor, this game clearly adheres more closely to the Parkour philosophy. Scores and success come from agility and speed rather than flair and flamboyance. No doubt free running message boards are imploding with volcanic outrage already.With that annoying semantic distinction out of the way, what to make of this first videogame outing for the self-proclaimed art of urban movement? It's been officially described as ~Tony Hawk without skateboards~ and that does a pretty good job of encapsulating the style of control and gameplay while also summing up the general redundancy of the whole experience.As in every skateboard game since 1999, you navigate purposefully designed environments in search of things to trick off. Over fifty moves are available, depending on the context. Some, such as somersaults and flic-flacs, can be pulled off while running. Others, like the slingshot, require a specific situation - in this case, a horizontal wall-run with a drainpipe at the end. There are oodles of mini-challenges to complete, from simple checkpoint races to more bizarre fare - such as a free running robot that must be subjected to as much damage as possible. Variety is never a problem, but the controls are simply too fussy to fully capture the grace and fluidity of the free running concept.It's all about flow, you see, chaining together your moves into one effortless glide around the scenery. Just as in skating games, there are moves that can be used to segue between larger stunts, most notably the Breakfall - a little forwards-roll used to maintain your forward momentum when landing from a jump. Prodding square at the right time is all that's required to use this vital manoeuvre, yet the timing has to be precise to a split-second. Get it wrong and you stumble, losing precious flow.This problem blights the game in general. The camera and controls are too stiff and awkward, so there's a definite limit as to how agile you can realistically be. Even the most basic trick can be hit or miss, while more complex acrobatics are even more infuriatingly elusive when the chips are down. It's not that I think the game should be easier, per se, just that it seems so determined to make you master every last handspring and footfall that the inherent appeal of free running - the ~I can't believe I just did that!~ factor - is all but lost amid a sea of unwieldy control combos and stern admonishments for not pressing X the nanosecond your feet touched a railing.Still, it's easy to see why this game exists. A rising new extreme sport (though the more precious practitioners will snootily insist that it's neither extreme nor sport) with considerable youth appeal and an undeniably cool visual aesthetic - it's almost custom made for the videogame treatment. Except...it already exists in hundreds of other games. Making impossible leaps and nimbly navigating obstacles has been the bread and butter of gaming for, what, over a quarter of a century?In fact, as I lunged for ledges and struggled to point in the right direction for an important leap, a nagging little thorn of familiarity kept pricking at my mind. For all the ~first game of its type~ fanfare, I was plagued by déjà vu. It was only when I remembered that Rebellion's Derby studio, where this game was produced, used to go by the name Core Design that it clicked.Free Running is Tomb Raider.Maybe not literally, I wouldn't go so far as to accuse them of using the same game engine, but there's an undeniable whiff of Lara in the boxy locations, the awkward movement, the very feel of the thing. The penny probably should have dropped sooner - they even make a sly reference to the series when you learn the Pharoah Walk manoeuvre. Yet it's a Tomb Raider devoid of narrative or any other tangible objective beyond running, jumping and landing for no other reason than because that's what the game is about. Commentators with more cultural deconstructionist tendencies might find value in such a post-modern minimalist concept, I suppose.Still, seeing a real live human being leap from one building to another is undeniably astonishing. Making a videogame character do the same is...nothing special. Especially when that's all the game has to offer. It's almost too obvious to point out but, with its superior controls and camera, Prince of Persia is already a better free running game than the Free Running game. It just has silkier pants and a ruddy big scimitar. Hell, there's more ~wahey, look at me!~ exhilaration to be found while hurling yourself into empty space collecting Agility Orbs in the Crackdown demo. By contrast, Free Running feels joyless and rigid, a game so obsessed with functional efficiency that there's little room for anything else. Like, you know, fun.Free Running is a noble effort to apply the platform game template to a seemingly appropriate real world pastime, but it's hamstrung from the start by gameplay that is neither agile nor fluid enough to deliver an engaging experience, and by a concept that is considerably less unique on a joypad as it is in reality. Certainly an interesting experiment but not something that's likely to appeal to more than a few die-hard aficionados."}