{"ref": "https://www.eurogamer.net/earth-defence-force-2017-review", "date": "5 Apr 2007", "game_name": "Earth Defence Force 2017", "text": "There are many good reasons not to buy Earth Defence Force 2017.You might not like shooters. Because if you don't like shooters, really, you're in the wrong place. Earth Defence Force is about shooting. It's just about shooting, in the same way Tetris is about rotating blocks and MMOs are about slowly getting alienated from your friends and family. Sure, as you progress it reveals itself to be a little smarter than it initially appears, but considering it initially appears to be as smart as soup, that's not really saying much. You may believe that videogames should be making a serious attempt to become the primary narrative voice of the twenty-first century. Because Earth Defence Force 2017's plot would be summed up by its title if you added the rider ~shoots an army of invading ants~. There's minor cut-scenes and voice-overs about what area of the planet the invaders are trashing at the moment, but it's not exactly Tolstoy. Except it's actually the perfect plot for the game. It's a game about shooting. It tells you what to shoot, and the real narrative of the piece is How On Earth Am I Going To Kill That Thing With Legs The Size Of Manhattan Before It Steps On Me? And as far as stories goes, that's pretty compulsive.You may believe that in the modern age, games should be a complex cocktail of sensations and approaches. You can't get away with just a direct assault game in this day and age. The designers here disagree with you. They believe that rather than spread their efforts, they'll better concentrate their limited funds on doing something as well as possible. Earth Defence Does that. It gives you well over a hundred weapons to try out, masses of difficulty levels, and explosions so big that you'll worry they may crack the front of your television. Earth Defence Force 2017 isn't a complex cocktail. It's a Molotov cocktail.You may believe that the Next Generation games demand AAA production values. Because, as mentioned in the last paragraph, this is a B-game. Animations and models are generally a little below par. Off an ant, and he'll grow stiff, and bounce around the landscape like a Buick-sized powerball. Technically speaking, there's fairly regular slowdown when things get too hectic. The latter is, actually, its saving grace. When EDF goes hectic, it really goes hectic. The models, individually, won't impress, but seeing a wave of insects crawling across the surface of a skyscraper is a visceral thrill. The physics are ludicrous, yes. But ludicrous is a good thing. The best of things, in fact.You may believe that if a game doesn't embrace the full Xbox Live experience, it's underselling the format to an offensive degree. Because EDF has literally nothing online. It's got a highly compulsive and entertaining split-screen mode, which somehow manages to make the battles even more hilarious, but if you want to play a mate online or similar, you're out of luck. But - genetically speaking - this is a game whose co-op is based around friends sharing a frontroom rather than bandwidth. Invite 'em round. You don't see 'em enough.You may believe that no matter how much a game costs, there's no excuses for rough edges. The AI is Doom-level. The in-game cut-scenes where you get control dragged away from you, while the game continues, are just bizarre. The vehicles - jetbikes, choppers, tanks and a exoskeleton robo-death-suit - are noticeably underdeveloped. EDF mitigates against everything by simply costing twenty-five quid. To some people, this doesn't matter. These are very rich people. Reviews are buyer's guides, and a correctly priced game helps its mark. You can stop thinking about how anyone could release a full-price game with team-mates who have a tendency to shoot walls underground and just concentrate on how someone managed to a game as constantly, relentlessly, stupidly entertaining as this.You might be some sort of importer who was in love with the previous version on the PS2 (which was apparently released as Global Defence Force this year though no-one appears to have seen it), and thinks that the features have changed and the original was better and stuff. Yay you! You might like your shooters brutally realistic. So, when presented with a soldier armed with a thinly-veiled M-16 (who is pretty much single handedly fighting off an army of skyscraper-sized robots with weapons so big that your character could comfortably live inside it), your reaction is to tut disapprovingly, rather than, say, pray silently to your own personal gods and start writing fanfic about the EDF 2017 world. A world where an all-conquering alien-race arrives and discovers that, actually, the rest of the universe wear enormous big girl's blouses, and it was probably a design fault making their killer-death machines out of tin-foil.You might not like the idea of unlocking 150 weapons, any two of which can be taken into any level. Far too much trouble. I'd settle for this shotgun, if that's all the same to you. Deciding whether you want the missile launcher which fires quickly and kills things really dead, or the one which fires slowly and kills things REALLY DEAD is boring. And flamethrowers, acid-sprays, flying sloth missile-things, sentry turrets and sniper rifles that can down stadium-sized UFOs with a well placed shot... well, who'd want that?You might be suffering post-911 trauma related to falling buildings, and being in an environment when a single stray rocket can bring down literally anything is going to leave you distraught. Be warned: the game prominently features fully-destructible cities which are prominently fully-destructed, on a level for level basis.You may be an arachnophobe. Seeing dozens of spiders the size of cars bounce over the horizon before capturing you in a tsunami of fluids - like some kind of weaponized bukkake - will give you a month of nightmares .You might have a heart condition and can't stand loud-noises, bright lights or excitements. EDF2017 has the loudest noises and brightest lights of the year so far - at its best - can go trade excitements with the best of them.You may think that Robotron x Rampage + Serious Sam doesn't equal ACEIOSITY. You might believe violence solves nothing when - in fact - it solves over fifty levels of action, across multiple difficulty levels.You may have friends and family who are ants. I understand. It's difficult.You might not like smiling.You might be stupid. Because there's always that, isn't there?If none of these apply, you've got no bloody excuse."}