{"ref": "https://www.eurogamer.net/after-burner-black-falcon-review", "date": "30 Mar 2007", "game_name": "After Burner: Black Falcon", "text": "It's probably fair to say that the impact After Burner made on young gaming minds back in 1987 was only partially down to the hectic high-flying gameplay. Yu Suzuki took the forwards rush of the sorely overrated Space Harrier and tweaked it into something more visceral. Arriving to an audience already primed for bombastic fighter pilot thrills by the cinematic release of Top Gun the previous year, After Burner also boasted the sort of monstrous eye-catching arcade cabinet that guaranteed fevered playground word of mouth.~My brother's played it and says you sit in the actual cockpit from a real plane!~~My Dad says it's a stimulator and they're using it to test people who can be real fighter pilots ...~~That's nothing - a kid in America made it go upside down and his brain turned inside out and then he DIED.~While the grapevine hyperbole rarely lived up to the reality of that hulking machine over by the soft toy grabber, it was enough to forever burn the game into the collective gaming consciousness. That may be why the various home versions, while fondly remembered, never quite recaptured the heady arcade buzz. The smaller the screen became the more you were aware that, without being lurched hither and thither by servo motors, there wasn't really a whole lot of meat on the bone.Fifteen years since the series last official outing (the redubbed Strike Fighter, shovelled onto Sega CD as After Burner III in the US and Japan) After Burner is finally back - and on the smallest screen yet. Well, unless you count the original's inclusion Sega Arcade Gallery on the GameBoy Advance, in which case the PSP provides only the second smallest screen to host thundering sky-jockeys. Either way, for a game that previously relied so heavily on sheer size and spectacle, going handheld would seem to be an odd decision. Thankfully, this remarkably entertaining remake/reboot turns out to be a veritable case study in How To Update Old Games, and is actually a more interesting game than After Burner Climax, the erotically titled new version now noising up the arcades.Wisely resisting the temptation to expand the concept of the original into a free-roaming flight sim, something that would render the whole enterprise utterly generic, what you get is a truly old school linear blaster in which you hurtle down corridor-like courses, dodging missiles from land, sea and air based foes while retaliating in kind with an arsenal of weapons that make stuff blow up, big style. Much like Capcom's rejiggered Ultimate Ghosts ‘n Goblins, for all the greased-up graphics it's immediately recognisable as After Burner, an undeniable continuation of its own gaming lineage.There's also a welcome streak of humour running through the proceedings. While some developers clearly think that the only way to interest modern gamers in old titles is to turn them all dour and serious, Planet Moon Studios has embraced the cheesy over-the-top stylings of Sega's classic years, serving it up with just the right amount of tongue-in-cheek irony. It may be more Iron Eagle than Top Gun these days but, from the stomping rock soundtrack to the ludicrous animated opening sequence and pilots called Sonic, it's clear that despite the presence of officially licensed warplanes the tedious realities of aerial warfare aren't even close to being on the agenda.This is more than a fresh lick of paint on a flaky shell, though. While the core gameplay still revolves around hammering wave after wave of enemies using bullets, rockets and missiles, the game has been beefed up in other areas. Most obvious is the inclusion of a story mode, which casts you as one of three elite pilots sent to retrieve thirteen experimental planes, stolen by the Black Falcon terrorist group. It's an obvious and rather clumsy skeleton from which to hang a series of relentlessly destructive missions, but it does mean the violence has some measure of structure, via a barking general who gives you primary and secondary objectives - blowing up a certain number of convoys, destroying a bridge, flying through the middle of a volcano. You know, the usual everyday pilot stuff.Control via the analogue nipple can be skittish to begin with but your thumb soon finds the right amount of twitch for maximum precision. As before, you lock on to any target passing through your reticule with the square button then unleashing missiles for airborne foes and circle lobbing rockets at ground or sea-based targets. In this regard, the rhythm of the game is not unlike Rez - a hypnotic pulse of target target dodge target target fire fire fire dodge fire bang bang bang boom. As well as the titular afterburner mapped to the right shoulder, you can also slow down with the left - pretty much essential if you want to deal with enemies that now lock-on from behind. There are twenty four missions in all, spread across such environs as tropical islands, parched deserts and snowy tundra, and this proves more than enough space for the game to develop a commendable learning curve. It's not overly tough, but you are definitely made to work for your progress - it never feels like advancement is being spoonfed. Admittedly, my initial reaction was hardly ecstatic - the game hits a frenetic pace right from the start and, after being shot down for the tenth time by missiles I didn't even see, my mood darkened. And then...a moment of clarity. I clicked back into that retro groove. Playing it like a modern air combat game, I'd been holding back on my limited supplies of missiles and rockets, figuring it made sense to conserve them for when they were truly needed. I'd been thinking, rather than reacting.Next time around I just let rip with everything, never staying still, throwing in barrel rolls (now assigned to the triangle button rather than the stick waggle of old) partly to avoid enemy fire, but mostly because it's fun and looks awesome. Running out of ammo was no longer a concern - for every wave of enemies blasted, power-ups on parachutes restocked weaponry and health at just the right time. Before I knew it, I was barrelling through level after level with a big stupid grin plastered across my hairy face. Best of all, despite this old fashioned bias towards ridiculous excess, it's never just a case of mashing the buttons and relying on luck to get you through - the game always hovers around that sweet spot between perfect control and eye-boggling mayhem, and your concentration is rewarded.Luckily, as the game gets harder, your arsenal gets bigger. Money is earned for each successful sortie, and can be used to purchase enhanced weapons, additional payload space or improved afterburners. New paintjobs, ranging from practical camouflage to outlandish tiger stripes, can even be unlocked and swapped to your hearts content. You can also snap up additional vehicles, ranging from small and nimble fighters to stealth bombers and A10 tank busters. It's not as if the game has untold depths that require a multi-vehicle strategy to fully explore but, as one of the many loading screens advises, it's fun to pick your favourite jet and customise the hell out of it.While my initial frowns soon warmed into amusement and, occasionally, giddy enjoyment, repetition does become a problem. This isn't a game designed to be played for hours on end, and it's a shame that the multiplayer options don't do much to stretch the longevity. It only supports local ad hoc wireless networks and, while the co-op mode isn't without merit, the competitive play is merely a bizarre game of tag that only scratches the surface of the mayhem you'd expect from multiplayer After Burner. It's certainly worth getting some mates together to give it a try, just don't expect it to become a regular thing.Surprisingly faithful to the feel of the original, the reanimated After Burner of 2007 makes valuable improvements across the board rather than letting rose-tinted nostalgia carry the load. The result is an effortlessly engaging, if rather slender, dose of wanton destruction that should satisfy the appetites of both retro fans and mainstream gamers without alienating either group. File it next to Out Run 2 as another classic Sega comeback that was long overdue."}