{"ref": "https://www.eurogamer.net/r-zookeeper-ds", "date": "27 Mar 2007", "game_name": "Zoo Keeper", "text": "Order yours now from Simply Games.Play the demo. All right, yes, that's a cop out. Not everyone is in a position to try demo versions when they sit down to read a review, and really it's our job to convince you of a game's worth or lack of it without having to rely on electronic props. But in this case we reckon it's a valid approach because a) it's not a demo; it's a freebie version of Zoo Keeper's primary mode of play, b) the basic system requirement is simply a Flash compatible Internet browser, and c) the probability that anybody likely to buy a Nintendo DS and Zoo Keeper this March isn't sitting in front of a PC capable of running that Flash game right now is so miniscule that it could happily share one of the animal squares on the DS screen with a herd of particularly busty gorillas. And still have enough room to feng shui them and cram in a couple of elephants. And a three-piece suite. And China.Enjoying it? Keep going. Meanwhile: entertaining as it is, Zoo Keeper is one of those DS games that seems destined to be overshadowed by other titles that represent better value for money. And even if not, some combination of its quirkiness, low-key approach and shameless aping of Bejeweled is bound to step in and put pay to it anyway. It's a wonderful, improbably absorbing puzzle game that's kept us happily occupied for hours on end, but it's just not worth the £30 that retailers are quoting ahead of its release. In fact, we'd think twice about spending £15 on it.Did you like the Flash game? No? Then play it some more. As you can see, the idea is very simple: you're faced with a grid of squares with different-coloured animals on them, and the idea is to make them disappear in lines of three or more by swapping adjacent squares. The catches are that you can only swap squares over if doing so will create a line of three or more of the same animal, and that all the while there's a timer gradually ticking down to oblivion.The subtleties are mostly obvious: the squares slide down to fill any gaps when a line is removed, adding more squares at the top and potentially creating chain reactions further down; there are some power-ups of sorts, including a square that cycles swiftly through animal faces and eliminates whichever group it happens to highlight when you press down on it; and after you've cleared a certain amount of animals the entire grid is refreshed and as well as fighting against a less accommodating timer you'll also find it harder to spot easy groupings. The subtler of the subtleties is that if it's literally impossible to make any sort of line of three, the game will reward you for managing to do everything possible and refresh the grid so you can keep playing.How are you getting on with it now? Presumably you're starting to get a feel for it and it's becoming easier to spot the animal groups dotted around. Graphically the DS version is a lot cuter to look at, and the control input is more responsive; sliding the square-shaped tiles around using the stylus is extremely smooth and comfortable, and even controlling the game with the D-pad and A button feels much less stunted than it does in our Flashy example. The DS version is also home to a few other power-ups like binoculars, which highlight possible groupings if you're totally stuck but should only be used sparingly due to their scarcity. You may also notice that the Flash version has some very irritating music and sound effects. The background music options on the DS are much less annoying, although they're hardly up to the timeless standard of Tetris's default accompaniment, while the sound effects are a bit softer and less like having someone smash glass next to your head.Even so, it's hard to imagine anyone taking offence at the online offering. You like it, right? We've been playing Zoo Keeper every spare moment for a couple of days and we still wound up sitting in front of the slightly less aesthetically and mechanically appealing online version for a couple of hours before bed last night (thoroughly spoiling our appreciation of Twelve Monkeys on BBC1 in the process, actually, despite its slightly comforting relevance). Well, the various alterations outlined above aside, the main mode in the DS version of Zoo Keeper is the same as the one you're playing online. The DS's top screen is given over to cute little cubist caricatures of the various animals and a running total for each, but we hardly ever looked up except to glance at the score, so it's hardly worth mentioning.It does come into play in the multiplayer mode, though, which is probably worth dwelling upon. You can't play two-player with that Flash version, but on the DS you'll be pleased to hear that the requisite wireless head-to-head mode is available with just one copy of the game. Or maybe you won't be. Playing it last night for an hour or so it became rather apparent that the initial random arrangement of squares probably has just as much if not more impact on the outcome as actual skill. The issue is that Zoo Keeper is a bit random; you often find that big chain reactions come about without your even considering them ahead of time, and that means that multiplayer games - where your opponent's grid is shown on the top screen and the goal is to run down their timer by eliminating as many squares as possible on your own screen - are often fleeting and rarely a clear-cut reflection of the skills of the players involved. The extra power-ups, including one that drains the colour away and another that inserts immovable man-shaped squares, merely exacerbate the problem. Kristan winning a couple of rounds was ample illustration of that.Fortunately that doesn't make the single-player game any less absorbing. It's a bit like when we hop onto the rowing machine at the gym to warm up. Most of the time we're just on autopilot; rowing and rowing without really pushing ourselves and letting our minds wander off (onto things like silly metaphors to shove in reviews). But every so often we glance up at the timer and start concentrating and really putting our backs into it. It's awfully easy to just play Zoo Keeper and make decent progress without really thinking too hard about it; your stylus just seems to automatically glide around doing the work for you. But if you really focus you can be clever and realise that going for the lower of the two obvious link-ups will make the other one fall into place by itself and net you a nice little points bonus.Which must be obvious to anybody who's given up on this review completely and decided to play the Flash game all day instead. A game that you can play with various degrees of mental application is certainly something to be applauded. It's just a pity that you can play it online for free, really, isn't it? Well, it is for the publisher anyway. To be fair to them, there are some other game modes on the DS cart, including a mode that involves collecting a certain number of animals instead of fulfilling a level-by-level quota, a Quest mode that sets you various specific tasks to complete and a six-minute Time Attack effort. But they don't add a huge amount of value, and the much more challenging difficulty level you can unlock is hardly a deal breaker either.There's undoubtedly a lot of fun to be had playing Zoo Keeper. It's simple, single-player sessions can potentially last as long as the marathon Tetris games that used to run our Game Boy batteries down virtually the same day we bought them, and it's noteworthy for being perfectly playable even if you're virtually comatose despite having the capacity to satisfy those puzzle fans capable of mustering serious concentration. But it's just not worth buying unless you can get it really cheap or you're a Russian oligarch or something. The portability, extra modes and various refinements of the DS version make for a much more satisfying game than the Flash effort we're continually referencing, but the DS is already home to a good few equally satisfying puzzlers (including Mr. Driller and Polarium) and we'd seriously suggest looking to them before haggling for a copy of Zoo Keeper. The Internet ruins everything again.Albeit somewhat fortunately for you...Order yours now from Simply Games."}