{"ref": "https://www.eurogamer.net/r-callofjuarez-pc", "date": "20 Mar 2007", "game_name": "Call of Juarez", "text": "Call of Juarez makes an inspired design decision, which impacts on the game in such a hugely positive way that I can't work out whether its creators are actually geniuses in terms of understanding gaming psychology or just got incredibly lucky. The case for the former is, pretty much, how good it is and how it makes the game better in just about every way. The case for the latter is how rough and awkward many other sections can be. I suspect it may be a little of both - Call of Juarez is a maximalist game which lobs pretty much every idea it can think of at the wall and sees what works. That it's not incoherent in the slightest is one of its greatest assets and a direct consequence of its Inspired Design Decision.Call of Juarez is a first-person action game with a western setting, from Techland who you'll probably know - for better or for worse - from great-white-hope/great-white-elephant Chrome. And its inspired design decision is to have two characters with hugely different abilities, then alternate levels between controlling one and controlling the other.Doesn't sound like much. In fact, it sounds like the sort of thing we've seen in games forever.It's all in the details.The dual leads of the game are a man of the cloth and a borderline outlaw. Our religious fella Reverend Ray is like Lee Marvin got Brokeback Mountain with Clint Eastwood, somehow managed to get him pregnant and gave birth to the hardest son of a bitch who ever walked the Earth. Who then became a preacher to repent for being the hardest son of a bitch who ever walked the Earth. And then decided, actually, God wanted him to use being the hardest son of a bitch who ever walked the Earth for a Higher Purpose. Our rogue is Billy, orphan child, wanderer, searcher of lost Gold (though he's given that up for a bit), who spends the vast majority of the game without any weapon whatsoever. He does have a whip, however, which allows him to climb like a latter-day Garrett from Thief when he still had his rope-arrows. Essentially, Reverend is the fighter character and Billy is the stealth character.Clearly, as long as you're relatively reasonable with your division of labour (i.e. you don't do a Desperados and have almost all your characters refuse to pick up bodies, as if there's some complicated union rules they have to obey at all times), separating your characters' abilities makes a hell of a lot more sense than what most games do when they're trying to create a little variety. Why is my character - who previously was wading through gore - suddenly deciding that, yes, being very quiet (at least until a checkpoint is reached, at which point anything goes) is the best plan? If it's two people, you don't have to make the sort of leaps that always feel false. One guy is into this. The other guy is into that.But the real genius is how the game alternates the two characters, and the reason they alternate, which is tied explicitly into the game's plot. An old lesson returns: at least in action games, plots are important in how they give a justification and weight for what you're doing rather than plots in and of themselves. Plots, in most games, are best at a ~Why are we doing this anyway?~ level. The plot of Call of Juarez, at its most basic level, is a chase.Billy is on the run, prime suspect in the murder of his parents. Ray is the man who's hunting him down.Playing both the pursued and the pursuer has been seen before, of course, most recently in the (excellent) Fahrenheit, but it's a little different here. While there are a few exceptions, it's mostly Ray close on the heels of Billy, sometimes within minutes of traveling. This leads to a brilliant sense of tension and release. You pass through a level as Billy, keeping out of line of sight and avoiding the attention of its residents. Eventually, you reach the end of the level. Next you're Ray, trying to catch up with Billy and following his trail takes you right through the area you were just creeping through.AND NOW IT'S TIME FOR REVENGE AT THESE BASTARDS WHO'VE KEPT YOU CROUCHED IN A PILE OF COW POOP FOR THE LAST HALF HOUR.Sneak past them all. Then kill them all.It's so simple, but so rewarding.Good work.It wouldn't work as well if Call of Juarez didn't manage a mass of invention to support it. While its combat mechanics are solid, its stealth is a little undeveloped compared to most games of the genre. It gets away with it by simply having you do a lot more things than just sneaking and also having a variety of different ways to accomplish sneaking. For the latter, take the fact the game features a dark-meter where the shadows you're crouched in affect your visibility... but it only uses it in the single level set at night, and then makes it a night set during a thunderstorm so you've got the added worry of a lightning flash exposing you. For the former, it actually leans heavily on the whole form of non-violent interaction and exploration, like the moments in the first Thief game where things took a few pages from Tomb Raider's book or even a simple adventure structure in some places.Ray's missions, while perhaps a little more traditional, are also agreeably varied, with the developers showing a great love for the Western in terms of what they ape. The final confrontation, borrowing from the Wild Bunch, is exactly what we wanted to close the game, genuine apocalyptic violence straight out of Revelations. The bible's a key word - Ray's equipped with a Bible which he can draw out at any moment and read from profoundly, which... well, is just a good thing to do, really. Add your usual selection of stagecoach chasing, railway raids, minecart adventures and all the usuals, and you've the basis for as good a cowboy shooter as I've played.Its best feature is its reinvention of the slow-motion mode. Yet again, a simple change, with profound implications. The slow-motion kicks in when your draw your pistols, allowing you to quickly bead in on your opponents. This is normal. The difference is that rather than just giving your free motion, each of your pistols has its own separate aiming reticule. These are moving slowly up in an arc towards the centre of the screen, mirroring the way a gunfighter's hands move when quick-drawing. Each gun can be fired separately, on the right and left mouse buttons. This means that rather than clinically just taking your shots, you're having to compensate for this predictable movement, while deciding which gun would be best to manoeuvre into position next. Most slow-motion in games just feels like a cheat. Call of Juarez's feels like... well, a new skill you should master.Not that it hasn't considerable problems. While graphically beautiful on a decent machine, it doesn't exactly have a polished, coherent graphic look. As perhaps predictable, a game that tries one-off ideas as it does leads to some which simply don't work - which is mostly forgivable, as they're passing annoyances. Less so is its tendency towards trial-and-error play in certain sections, where you'll find yourself leaning on the quick-save in an atmosphere-distracting fashion. And while most of it is excellent, it's got an uncanny ability to choose the worst time to be bad. For example, the opening level playing Billy is one of the worst in the entire game, with you trying to learn how the stealth works in a closed environment and learning the controls. Uninspired rather than dreadful, it may turn some away from the game before its even begun.Which would be a shame. Of all the cowboy games in the last few years, Call of Juarez is the one which most feels like it has a soul. Impassioned and imaginative, its velocity of invention can make you smile through any flaws. It's a game which you feel someone actually cared about making. We don't see nearly enough of those."}