{"ref": "https://www.eurogamer.net/the-warriors-review", "date": "19 Mar 2007", "game_name": "The Warriors", "text": "Rockstar had a really good idea: dust down its ace PS2/Xbox brawler from 18 months ago and release it on the PSP at a knock-down price. After all, this is a game you can now pick up in the bargain bins for well under a tenner if you shop around.The only problem is that someone, somewhere forgot to whisper this somewhat fundamental detail to the European peeps. So while our friends across the pond can pick this game up for an ear flick under $20, the good people of Europe are being mugged for more than double that. How very rude.But if the amount of spare cash in your bank account is somehow not important to you, or you're well versed in cheap and cheerful importers (the PSP is region free, remember), there's plenty to admire about this manic street brawler.Back in October 2005  Ellie was effusive in her 8/10 assessment and reckoned it was ~a great movie tie-in~, and noted that ~it's a game for anyone who enjoyed the classic brawlers of old~. She was dead right, too.You didn't even have to be a cult film nerd, or know anything about the 1979 Walter Hill New York gang movie to thoroughly enjoy it. It was essentially a stylish slice of ultra violence for those who enjoyed a bit of uncomplicated windmill fisticuffs, head smashing and general law breaking - just like in the old days before it all got a bit predictable and went out of fashion. With little more than a working knowledge of the square, X and circle buttons, the game sports one of the most flexible and intuitive control systems ever to grace a brawler. Regardless of whether you really know what you're doing, it has the kind of reactive, context specific control system that allows even nine stone weaklings to string together some wince-worthy manoeuvres without breaking sweat. This is good and bad, depending on how you look at it - on the one hand, it's no Ninja Gaiden, but on the other, it's a game that you can make decent progress in without intimate knowledge of the combo system. The game helpfully leads you through the basics early on, with the kind of combos that basically lend themselves to those who probably have a square and X symbol tattooed on their left and right hands by now. With circle to grapple, you can easy pick on anyone nearby, pummel them to a bloodied pulp on the floor, and kick them into next year. It's horribly satisfying - at least at first. The one downside of all this accessibility is the dawning realisation that the unfolding story just adds breadth to the knockabout fun, rather than any real depth.The gameplay occasionally diverts to rather irritating graffiti tasks, where being 'street' means playing a thuggie game of buzz bar where you try manfully to trace the outline of a wobbly 'W' (or variations of) without straying off the line. Elsewhere you might steal car stereos by smashing cars and twizzling the analogue nub to simulate the removal of four screws, creep stealthily around to avoid detection from gang sentries, or break into local stores and swipe their wares from the glass cabinets. You might even just fancy smashing things up for the sake of it. The game likes random acts of violence, theft and vandalism. This is a Rockstar game we're talking about, obviously.That said, the routinely gratuitous acts of bored, youthful masculinity do add up to a surprisingly engaging whole. Regardless of whether you know the film or not, there's a really unique atmosphere to the game which leaves you in no doubt that this is the wired end of the '70s. And given that the game takes place in history's most unselfconscious, irony free era, we get to giggle at an array of the campest, most unintentionally amusingly dressed game characters ever to grace a videogame. And with each of the game's gangs approach to 'cool' ever-more ludicrous and improbable (the loony Hi-Hats mime artists, the dungaree-clad Punks, and the deranged face-painted Furies baseball supporters being the most memorable), there's a bigger incentive to take them on. They all have faces you want to punch, if you're ever lacking an incentive to lose control.Rockstar's impressive eye for period detail is also in evidence in the aural backdrop that accompanies each environment. The original Barry De Vorzon score seeps subliminally into the background, and little incidental synthesizer riffs burble away to remind you that this is very much a dystopian vision of urban 1979. These small but significant details wrap the game up in an aura which makes the game feel so much more than a mere movie tie-in. In some respects, it has more artistic respect for the source material than possibly any gaming interpretation of a classic movie than we've ever come across. The addition of licensed tracks also from the soundtrack only help make it even more of a treat for fans.And once you factor the effort that Rockstar Toronto has gone to develop a credible back story to the movie, it makes it an even more worthwhile accompaniment. As you'll be aware, some of the original actors were even brought back to reprise their roles, which will no doubt please the ageing hardcore fans of the film. That said, this is hardly the sort of game you'll come seeking a chin-stroking back story - the dialogue routinely turns the air blue in a way that would have Mary Whitehouse spinning in her grave. It's all completely over the top, of course (we wouldn't have it any other way), but you really wouldn't want little ears to be present while you're playing it. One to play with headphones, ideally.The game doesn't exactly get off to a flier, mind you, but it's a necessary ramp up to teach you the ropes. Sure, the early missions can't shake the tutorial stench that invades your every action, but it does a nice job of integrating Rembrandt's initiation into The Warriors gang, and how they began reclaiming their Coney Island turf. About halfway into the game, the story finally catches up with the movie, and by then the game has done a decent job of filling in the blanks and making you aware of who everyone is before the action descends into full-on insanity. It's certainly a better way of introducing the movie premise than simply lumping you in at the deep end with no explanation.But as much as the game impresses on many subtle levels, there's never any stage where you're absolutely bowled over by it. It's cute, uncomplicated fun, no more. Also, as with many of Rockstar's efforts over the past five or so years, there's a certain clunkiness to fundamental things like camera control and lock-on. And while the PSP does a fine job of making up for the loss of the second stick (with a relatively intelligent auto camera), there are still occasions where you'll be frustrated by being locked onto the wrong enemy, or having to fumble for L1 to wrench the viewpoint back round where you want it. But, to be fair, in a game where you can get by most of the time by mashing two buttons, it's not that much of an issue.Having spent a while prior to the review playing the Xbox version to re-familiarise ourselves with it, other areas of the game actually benefit the transition to the small screen. The visuals, for example, could look horribly badly textured on a big screen, but relatively sharp and stylish on the PSP. The frame rate, meanwhile is pretty solid even when massed battles are kicking off, and very little appears to have been sacrificed in terms of the animation or character model detail. Load times, meanwhile, are swift for a PSP game, and certainly no worse than the full-blown version. And as with the original, you can play the main story mode and arena-based Rumble mode and in ad-hoc wireless two player mode. The include a capture the flag variant (involving a 'chick' amusingly) and king of the hill, but feel a teeny bit tagged on to pad out the content more than anything. Still, the addition of the retro inspired side scrolling brawler Armies of the Night is a lovely touch, letting us get all misty eyed about the days (admittedly in the late 80s, rather than the 70s) when Double Dragon and Final Fight were the king of the coin-op. Better still, you can still play Armies of the Night in co-op multiplayer, though you're limited to only being able to join at the start of the game, rather than jump in or out like the PS2 and Xbox versions.So, The Warriors is yet another PS2 port to emerge on the PSP, right? Yes, to an extent that's all this is, and all it will ever be. Yes, it does nothing to address the platform's urgent need for fresh and original content, and yes, it doesn't quite play as well as it did 18 month ago thanks to minor control and camera niggles. Despite all that, The Warriors more than holds its own on its transition to the PSP. For a start, it's still a perfectly playable, charming and downright brutal game - there really is nothing quite as ludicrous on the shelves today. If you're after a handheld reinvention of all those classic side-scrolling brawlers of 15, 20 years ago, then this is the closest anyone got to recapturing that raw, mindless intensity. Definitely worth a look once the price comes down."}