{"ref": "https://www.eurogamer.net/worms-review", "date": "14 Mar 2007", "game_name": "Worms", "text": "When I got back from holiday and Kristan asked me to review Worms, my shoulders slumped a bit. ~I expect I know why that is,~ he said. ~It's because you think that - having slaved half to death while you sunned yourself on a beach somewhere - I am deliberately punishing you with a game that a) everyone has played, b) the two people who haven't can download off Xbox Live and try out anyway, and c) that is probably exactly the same as it always used to be.~~Correct,~ he added.Worms' longevity is, of course, tremendous - even by the standards of an industry that continues to support Mega Man, Trip Hawkins and whoever it is that accidentally uploads all Ubisoft's product information to a public FTP once a month. It was 1994 when it first popped up, if Wikipedia remembers correctly, and won plaudits for its delightfully surreal premise, daft weapons and funny accents. Since then it's become something of a national institution, a bit like Terry Wogan or Babs Windsor, at least in the sense - if we're prepared to dispense with the usual games industry standard of ~is it ripping off enough films~ - that it's failed to do anything particularly inspired in the last ten years and now just sits there reciting the same punchlines while we all applaud like an audience of poorly medicated Kilroy disciples.Worms is, as everyone knows, a strategy game where teams of up to four spineless pink cartoons batter one another across a 2D landscape, having to overcome severe movement restrictions, proximity mines and harsh terrain in their attempts to sling explosives at one another or dispense rougher justice hand to hand. Often described simply as turn-based, in effect it's still an action game, with players taking it in turns to wiggle, hop, swing and jetpack their way around each randomly generated level in real-time, trying to cause as much damage to the enemy as possible within a time-limit.Reviewers continue to pay tribute to Worms' ~British sense of humour~, but it's not as witty and irreverent as seems to be its reputation - really it's just a lot of high-pitched squeaking and silly names. The animation system's often pegged as delightfully expressive, and the big eyes with moving pupils were definitely a good idea, but most of what counts for comedy is icons in thought bubbles and a lot of expressions that suggest the worms are as weary of my company as I've become of theirs. Sometimes they get a bit het up by the action, but they'll be pleased to learn I'm here to maintain their frowning vigil as the AI takes 20 seconds to decide whether it wants to skip its turn or, more likely, fire at me in an unplannably precise, wind-assisted arc of perfect, incredibly unfair exploding death. What was I saying again? Oh yes - after staring at roughly the same thing for the best part of a decade, it occurs to me that it hasn't really done much more than blink and wear a sign on its head that says ~Willy~.One possible response here is that Worms on Xbox Live Arcade was simply intended as a restrained port rather than a new game, with the mechanics and weapons already set in place. But that would simply beg the question, where have all the weapons gone? Someone on our forums compiled a helpful list of the FORTY-EIGHT that aren't included here, and while some of them were hardly indispensable, others - the Holy Hand Grenade, the bungee rope, the petrol bomb and the napalm strike to name a handful - are sadly missed. All we've got left is the bazooka, grenade, cluster bomb, uzi, shotgun, fire punch, airstrike, sheep, banana bomb, prod and fireball. At least you can still place girders, blowtorch your way into hillsides and swing around with the ninja rope - although the latter is harder on a console pad than with the PC's three-finger d-pad, and, come to think of it, people placing girders and tunnelling are quite irritating to compete against.The other possible response is that Worms was the lantern but YOU were the light. When you threw a grenade and it trickled down a hill at just the right speed to blow somebody into a stack of mines, killing them when your best hope was a wound, you'd be left hooting at your own good fortune. That still happens now and then, and it's certainly funnier when it happens to a real person.Indeed, played with a couple of friends sharing a controller, it will happen enough to ensure GOOD TIMES, and since the game only costs about the same as three pints, it's ideal to slump giggling onto the couch with. Then again, you probably own one of the previous versions capable of supporting round-the-computer gameplay, so perhaps it's the online multiplayer bit you'll be interested in. In which case, you'll need to know that games with lag are annoying, but that you should be alright once you stop people downloading legally obtained media in the other room. Admittedly you're reliant on the good, non-quitting nature of your opponent if you want to see out a round that becomes one-sided, but it certainly does what it needs to do. Beyond the online, you've got random games against the AI, or 20 ~Challenge~ levels, but these only really earn the name when the opposition starts behaving impossibly.But for a few missing weapons, then (sorry - a few dozen missing weapons), this is as close to the series' peak as we've been since the days when the novelty hadn't worn off on the PC, and given the right company you'll find it quite approachable, with simple controls and the usual potential for comedy failure. Whether that's enough though is debatable - and it's a safe bet you already own plenty of games less reliant on fluke and pratfalls to entertain."}