{"ref": "https://www.eurogamer.net/wario-master-of-disguise-review", "date": "14 Mar 2007", "game_name": "Wario: Master of Disguise", "text": "I've always considered Wario as one of the most unusual characters in Nintendo's roster; while he plays a stock baddie in Nintendo's sports and party game titles (little more than an evil, palette swapped Mario) he's starred in two innovative series of his own, making a mark with the Wario Land series before the celebrated Wario Ware games made him a bankable star in his own right.Wario: Master of Disguise is the first new Wario platformer since Wario Land 4 was released on the GBA over five years ago, and, intriguingly, Nintendo handed over development duties to Suzak, rather than develop it in house. Suzak has developed F-Zero: GP Legend in recent times, but it has also produced an astonishing amount of Japan-only licensed shovelware.  (I'm personally saddened we never got ~Deco Tora X Geijitsuden~ which would easily have been localised as ~Pimp My Truck.~)Although this most recent Wario doesn't include the Wario Land subtitle, like the previous games it has its own unique twist: eight costumes that give Wario a variety of different powers, which he requires to explore fully labyrinthine levels that he's trying to (as usual) steal as much treasure as possible from. As the game is on the Nintendo DS, of course, you can't just select the costumes from a menu; you have to draw a specific symbol over Wario on-screen. This doesn't actually sound too bad, as far as shoe-horned touch screen use goes, but it's hard to convey how unbearably tedious this becomes in play. But I'll give it a go.For example, usually when entering a room you'll have to change into ~Genius Wario~ by drawing a circle with a line through it, so you can see hidden objects in the room. Then, a quick change into ~Cosmic Wario~ (by drawing a circle) will allow you to zap all of the enemies on screen. Often, you'll have to change into ~Arty Wario~ (draw a square with a line through it) to draw some blocks on screen to use as platforms, before turning back into ~Thief Wario~ (a tick) to jump on them.If the symbols I've just described sound remarkably similar and easy to confuse, then you're not alone, because although it's easy to remember what you want to draw, it's not always a given that the game will agree with you. If you don't exactly sketch out the symbol as it requires you'll either find yourself repeatedly drawing it or, irritatingly, wearing the wrong disguise. This is a problem that becomes epidemic later in the game and during boss battles, where you are required to make several quick costume changes in a row. With the amount of time you spend drawing and redrawing symbols, Wario: Master of Disguise soon seems to take as much effort as writing a short novel.Because of the heavy stylus demands, directional control of Wario is either entirely with the control pad (for right-handers) or the face buttons (for lefties) which means, horrifyingly, that you have to use ~up~ to jump. These unsuitable controls seem to work in collusion with the level design to irritate the player as much as possible. Despite the length of the levels (they feature multiple save points and can take up to an hour to complete), they have been designed to be as claustrophobic as possible, with a truly hideous number of jumps in the game requiring pixel perfect placement lest Wario bump his head on one of the many low ceilings and fall to a point where he has to go through yet another series of costume changes. Gnngh!The level design isn't entirely bad; though fairly linear, they have a design that at least pays lip-service to Metroid and Castlevania's system of exploration and puzzle solving, but the level themes are terribly uninspired. Is there actually any excuse for a character to visit an ice cave these days?Though they might not have put a lot of effort into thinking of kinds of levels (~how about a desert level?~) they clearly, and unnecessarily, put a lot of effort into the absurd plot. While watching TV Wario becomes so excited by a programme about a rich gentleman thief that he invents a helmet to transport him into TV land (an invention I'm sure is worth millions, but never mind) steals the thief's magic wand, and goes on the search for the Wishstone, a legendary stone said to (can you guess?) grant any wish.That would be fair enough if that was recounted to us entirely within the intro movie, but instead the plot drags on for an interminable amount of time during levels, with characters waffling on (and on) about their motivation, or making very weak fart jokes. Even Wario's stolen wand won't shut up! You can, at least, skip the majority of these scenes, but as in some cases you require information from them to solve puzzles, you really do have to sit through them.  Grinding your teeth. With boredom and frustration.But perhaps the most disappointing thing about Wario: Master of Disguise of all is the included mini-games. With Wario's name roughly synonymous with short bursts of pure joy thanks to the Wario Ware series, that every time you open a treasure chest (which is all the bloody time) you have to play some of the most offensively dull mini-games possible is almost too grand an insult. Offering a limited selection of games such as slide puzzles and colouring in (yes, really) there's no challenge, as you can try as often as you like, and they begin to repeat themselves before you've even finished the first level. It got to the point where I wasavoiding treasure just to not have to play them.I don't doubt that Suzak tried to make yet another innovative instalment in the Wario franchise, with their stressful demands for constant touch screen use - but the sad fact is that there isn't a single spark of imagination or joy in this entire game. Despite some obvious effort, Wario: Master of Disguise is just utterly tedious in every respect and an absolute chore to play."}