{"ref": "https://www.eurogamer.net/super-swing-golf-review", "date": "10 Mar 2007", "game_name": "Pangya! Golf With Style", "text": "I must begin, in the manner of Dave McCarthy, by declaring an interest. Super Swing Golf is an adaptation of a fantasy golf MMO called Albatross18 (or Pangya in Japan and Korea) - a game to which I have been harbouring a substantial addiction for the better part of six months. Pangya is freely downloadable and free to play on the PC, but they sucker you out of your money by plunging you into an insanely bright, colourful world populated entirely by people who are much, much  better than you. Want to stop losing so embarrassingly often? Better buy yourself a better character, then, or a nicer hat, or prettier gloves, or more advanced equipment, or a caddy, and so on and so on until you’re sitting there in your socks and underpants having sold all your worldy possessions in order to kit out a cutesy virtual golfer, whose incessant V-popping (the peace sign, not Viagra) and gleeful dancing soon begin to take on an air of mockery.Pangya is all about making your character your own, and the actual game of golf itself becomes almost secondary - essentially, playing the courses becomes little more than a way to earn in-game currency, which can be used to pay off caddies or buy some of the more mundane items. Super Swing Golf, by contrast, strips away all of the online aspects and most of the character customization, leaving us with what would be a really very normal golf game were it not for the extreme silliness of the setting - and, of course, its as-yet-unique control system. You have to swing like a golfer (albeit a rather slow one), with a consistent and even swing at a 45 degree angle, in order to hit a perfect shot; it takes quite some getting used to, but impatient killjoys can always switch to button control.  Birdies, decent shots and risky chip-ins are rewarded with Pang Points, which are used to buy stat-boosting equipment in the shop, which enjoys a constant influx of new items - but unlike in PC Pangya, the only way to test out your souped-up character is against the AI, which is considerably less rewarding to beat than another human player.The single-player modes consist of Pangya Festa, which is an enjoyably nonsensical story mode, and straightforward Match and Stroke against the AI. Demonstrably, this lacks imagination, but the setting amply makes up for it. The courses are pleasingly varied, littered with obstacles from windmill blades to ice floes and cannons to strategically-placed signs designed to mess up particularly risky shots. These courses have been played thousands of times online, and consequently they are extraordinarily well-tailored to the player, full of clever shortcuts and get-arounds that reward risks with super-long runs, advantageous lies and, of course, the all-important Pang Points. Super Swing Golf’s courses are easily its highlight, but equally, they are to some extent designed for showing off - in single-player, there are no real competitors or ostentatious players to goad you into taking that enormously risky shot, and there’s no taunting or heckling to prevent you from playing over-conservatively.Despite the quality of the courses, though, playing Pangya in single-player quickly becomes a grind. The characters and their respective stories are completely baffling, and there is altogether little incentive to succeed, as the only rewards are some more unlockable baffling characters, which thanks to the equipment system are not inherently any better or worse than each other, and more clothing to buy in the shop, which equally begins to feel pointless very quickly. Rope a friend in, and watch them struggle to get ahold of the swing system whilst annoying them by scribbling on the screen or waving about to make their controller vibrate in the Balloon Pop multiplayer mode, and things start to look a little brighter - but sadly, it’s not enough of a novelty to hold much appeal beyond the first two or three rounds.Super Swing Golf is caught between a rock and a hard place. Fans of Pangya on the PC will find it over-familiar and somewhat hollow without the online community aspects, and for anyone else the random and entirely unexplained Korean fantasy setting might be a distinct turn-off. It plays a decent game of golf, and the swing system works encouragingly well, but this was not designed as a single-player game (as evidenced by the dearth of game modes), and as a result it feels incongruous. Indeed, the entire game, courses, characters et al, was originally designed around the concept of online multiplayer, which on the Wii is no longer there. Super Swing Golf is a decent golf game, but it is difficult to justify spending money on this particular decent golf game when there is a free, constantly updated and considerably superior version readily playable on the PC."}