{"ref": "https://www.eurogamer.net/battlefield-2142-northern-strike-review", "date": "6 Mar 2007", "game_name": "Battlefield 2142: Northern Strike", "text": "I'm sure there's some deep, underlying psychological explanation as to why I always play Support class in Battlefield games. Integral to the team effort Support may be, but he's basically a walking ammo box - the rest of the squad's caddy, expected to come running when his more highly-regarded fellows run out of armour-piercing balls.It'd be quite humiliating, if it wasn't for the really big gun I get - and the fact that faithfully doling out replacement bullets wins me points at an incredible rate. The point is, whether I'm everyone else's lapdog or not, I'm basically roleplaying, because that's the sort of game Battlefield 2142 has become. This first mini-expansion pack may have a couple of extra maps and vehicles, but, like its parent, actually it's about picking a role and sticking to it, and grinding to earn experience points which can then be spent on new abilities that might give me an edge over other players.It's The Burning Crusade, but with hovertanks, glass skyscrapers and team-killing.There were a few of these download-only, £6 booster packs released for 2142's predecessor, Battlefield 2, and frankly they were a little unexciting. Partly, this was because most were on the slapdash side, and partly because BF2's modern combat shtick limited what could be included to variations on a pre-existing theme. 2142's subdued sci-fi (2042 would probably be a more suitable title) means there's a much broader palette to play with - and thus also a greater onus on the developer to do something interesting. In this micropayment age, ~it's only six quid~ isn't an adequate excuse for churning out uninspired clone content any more.Fortunately, EA has done pretty well here. Northern Strike reeks of cynicism - for roleplaying reasons to be discussed shortly - but the new core Battlefield elements introduced have been handled fairly thoughtfully. Its nuts and bolts are three new maps and two new vehicles. The latter are interesting enough that it's a real shame they're limited to the new maps only. The Pan Asian Coalition gets the Hachimoto, a sort of two-man hoverbike equally deadly to infantry and vehicles alike, so long as it can keep moving. It's the fastest, most manoeuvrable vehicle in 2142 by far, but it'll crumple like a kitten booted in the ribs with a steel-toecapped jackboot in the event that someone manages to get a bead on it. The EU possibly gets the better deal with the Goliath. It's a ridiculously well-armoured base on slow-turning wheels, bristling with weapons, able to infinitely heal and rearm nearby allies, and even self-repair itself. This means it can calmly shrug off the likes of orbital strikes, stuff that usually means insta-death for anything else in the game; taking out a Goliath means a co-ordinated assault of multiple players destroying certain areas of it before it becomes vulnerable. It's pretty awesome, which unfortunately means it has to be handicapped - in this case by speed. A Goliath isn't the cavalry: by the time it crawls, like an angry snail, across the map to wherever a firefight's going down, everyone's going to be a bit too dead for it to bail them out. Instead, it's the spearhead of a slow but deadly assault on a heavily-defended position. Everything about it is, in hindsight, an entirely obvious addition to this sort of game, but not possible until 2142 loosened Battlefield's waistband to allow for more experimental fare.The maps themselves are almost secondary. Two are fine-but-forgettable, sticking closely to templates laid down by 2142 vanilla, and very much the sort of acceptable if entirely unexceptional thing that Battlefield expansions since time immemorial (well, 2003) have offered. The third, the Bavaria map set in an Alpine base, is a lot more interesting. It's a sequence of large indoor areas linked by horribly-exposed mountainside paths, and thus is brilliantly set-up for chokepoint skirmishes and carefully timed suicide runs. Though it sadly doesn't escape from 2142's muted palette of white, grey and brown, it manages what the other maps don't, which is to look markedly different from what's in the parent game. The overall vibe of all the maps, though, is one of fairly close-quarters combat, roadblock design forcing infantry scuffles at vital points rather than long-range tank bombardment. It's not hugely different from how 2142 normally works, but does, on a full server, offer an increased intensity and directness; a greater focus, at times, on being a first-person shooter, rather than the jack-of-all-trades-plus-robots the core game is.And so to the biggest draw, the unlocks; the roleplaying element of 2142, and the reason even casual players give it more hours than they otherwise would. Successful, long-term play eventually levels you up, at which point you can pick a new improvement, weapon or ability. There's been a mild redesign in Northern Strike. Rather than grinding along an experience point bar, performing certain actions earns badges and ribbons, each of which means a new unlock. It's a better way of doing things. The unlocks here feel more like a reward for heroism rather than just long-term service. What's troubling, though, is that the new unlocks (you can spend your badges on 2142 vanilla abilities or on a raft of NS-exclusive ones) are available in core 2142 matches as well as Northern Strike ones. If everyone playing 2142 already intended to buy NS anyway, that's kind of fine. Everyone gets everything in any match. Great. Instead, though, people who haven't invested six more quid in this booster pack will see, and on occasion be killed by, other players with lethal gadgetry they don't have. Worse, (or, depending how you look at it, better still) the NS unlocks are available as temporary field upgrades in core 2142 - so folk who haven't bought the booster pack get to try them out for a very brief time and thus have their appetite whetted to drop cash on this. The slim price of NS means it's dangerously close to paying to make your character slightly better - a micropayment stat boost, of the sort that doomsayers worry Xbox Live purchases will eventually become about. While only long-term bedding-in of NS will prove whether its unlocks truly shift the balance of play or not, right now it feels like people who otherwise weren't going to buy it now have an unnatural incentive to do so, just to level the playing field. Still, Northern Strike is a polished offering, a lot more than the token handful of stuff draped around the glinting trophy of new unlocks it could have been. It just about manages to reach the tiny no-man's land between patch content and full expansion pack. Bargain price or not though, there's no escaping that it offers a comparable amount of new stuff to what we've seen in free official or community updates for Unreal Tournaments and Quakes in days gone by. Instant online micropayments mean those days are all but gone now. Hang your head in rueful nostalgia, then ride a Goliath to victory."}