{"ref": "https://www.eurogamer.net/battlezone-review", "date": "1 Mar 2007", "game_name": "Battlezone", "text": "Maybe twenty-seven years ago, when the original Battlezone was released into the arcades, game names like this excited the kids. Nowadays, with ten thousand other near-indistinguishable, testosterone-beckoning rivals on the shelves, Battlezone newcomers would be forgiven for occasionally checking the box to see which one it was they bought again. Not only is the game generically titled, it also rejects updating the original's famous minimalist, striking vector graphics in favour of dressing the tank battling mechanic in more obvious visual clothing, making it even harder to pick out from the PSP crowd. Then again, what Battlezone's name lacks in titular creativity it makes up for in functional accuracy. In the game you're given control of a futuristic hover tank in which to fight (battle) inside a confined space (zone). The basic rules are deathmatch simple: get more kills than everybody else before the timer runs out and you can have a biscuit.It's a simple premise that requires little further explanation because there's really not much more to it. What's immediately apparent is that this is a slight game, with simple rules and simple environments that intends to give you your value for money by setting up some memorable Quake-ish multiplayer moments rather than by providing any extended single player options. Indeed, with just three ways to play (single player match, single player tournament and ad-hoc multiplayer) there's not much on offer to those looking for some time alone with the game.The actual gameplay is uniform across all of these modes. Battles take place in enclosed areas of generic theme including the ice level, the desert level, the Aztec temple level, and so on. There are a number of respawning power-ups and traps in each environment and, by using the large floor fans, you can also propel your tank up onto higher ground.  Engaging a rival tank is as you'd expect and follows the Twisted Metal template of hammering your tank's various weapons to incapacitate your three rivals as quickly as possible. You also have a nitro move to propel your tank (rather uncontrollably) away or towards from a skirmish. On the whole, contrary to what you might expect, these vehicles are all easily manoeuvrable. The PSP's controls work surprisingly well and, unusually for a handheld shooter, you rarely feel as though any of your death's were at the hands of a clunky control scheme.The single player campaign has the most meat on it but it's still a simple course of progression requiring you to complete a collection of contests in order. Placing third or higher will unlock the next while finishing first unlocks new tanks, weapons and upgrades to use across all modes. There are six different game types: Deathzone (deathmatch), Team Deathzone, Capture the Flag, Hotzone, where you must win different territories to win, Lone Wolf (hold the ball for as long as possible) and Blackout, where you must destroy the enemy's generator first to win. Even with just three opponents, each mode is enjoyable, if a little orthodox.Indeed, the game offers practically nothing that you have not seen elsewhere before, other than the fact that the metaphor is tanks rather than Master Chiefs or Doomguys. The choice of vehicle does allow for some believable upgrades and, in this sense, Battlezone delivers. Starting with a medium-sized tank you'll quickly unlock a smaller, faster one and of course, a larger, more powerful vehicle. Weapon upgrades include mines, machine guns, homing missiles and sniper rifles all of which can be swapped in an out of your tank before each respawn. Unlocking ‘tweaks' allows you to increase the speed or power of your tanks and up to two weapons and three tweaks can be equipped at any one time. For a game that is so clearly geared around multiplayer you'd have thought Atari would have made more of an effort to make this mode of play easily accessible. Instead, the game allows up to four players (empty slots can be filled by AI controlled bots) in Ad-Hoc mode only and each player is required to own a copy of the game. As such Eurogamer wasn't able to test this area of the game but, needless to say, if you can provide the necessary hardware, software and humanware all within a tight geographical proximity, you'll probably have an OK time.Visually the game is fine. There are some pretty lighting effects and particles but it's all terribly middle of the road. For a series that began so stylishly, and at the cutting edge, it's a little depressing to see it so conservatively dressed here. Nevertheless, the explosions, bullets trails and framerate are all functionally acceptable. Occasionally there are camera issues (the cameraman suffers the odd epileptic fit when you drive too near walls, for example) but in the main it does a good job of presenting the action in a helpful way and the PSP's wide screen ensures that it's rarely frustrating trying to find an angle on an opponent.Despite competent AI, the game is easily breezed through. This is good in that, had the developer chosen to string out more challenges based on the six core gameplay types it likely would have become quickly tiresome but it also makes the game a short proposition. The intriguing online editor, where players can go to the game's website, customise a map and then upload it to the PSP for multiplayer games is a good idea but far too limited to be of any serious, long term use. All of which leaves the player with a slender package boasting little replay value. It's a wholly unoriginal game, devoid of interesting play options and mostly inaccessible for the multiplay ambition around which it was designed. Nevertheless, even the most average things can still be enjoyable, and in this regard Battlezone is not an unpleasant distraction."}