{"ref": "https://www.eurogamer.net/trackmania-united-review", "date": "26 Feb 2007", "game_name": "TrackMania United", "text": "Here are the two greatest things about Trackmania: The instant restart, and bouncing on water. The two encapsulate everything you need to know about the lunatic action racing, with its crack-like ~one more go~ addiction, and the nonsensically playful fun of when you when and you and... CRASH.Nothing makes me swear like Trackmania. The language that's come out of my mouth over the last few days would wilt a field of the sturdiest flowers. My little kitten has been blushing through his fur and jumping from the desk in horror at the new words his cute widdle ears have been learning. And indeed the new combinations of words. I think the phrase about which I am most proud so far has been ~cockflaps~. Let alone the astonishing stringing together of all manner of foulness as I've failed to make a jump for the forty-seventh time in a row. As if a sailor were bred with a... oh, um... PUS-FILLED BUM-SHI...If you've liked Trackmania games in the past, then you're sure to love... KABOOM!Remember when you were a kid, and you have one of those pull-back cars that would then zoom forward? And so you'd build it tracks out of whatever you had. For me it was a collection of deathly dull, but tall and narrow, Christian hard-back picture books. Placed on stacked up encyclopaedias from the shelf in the lounge, these could create fantastic long roadways for my car to race along, flying off the end and landing in a potted plant. The trick was, getting the angles of the slopes correct, such that they'd support the car at top speed for the longest distance. Twenty five years later, and Christian picture books are no longer necessary... Well, not for, oh, well, you know... CLANG.It is, as a wise man once said four paragraphs ago, like crack. You can't stop, no matter how much it's hurting, no matter how much other work you should be doing, no matter when the review's due in. Trackmania's is a world where mistakes last only until you hit Delete and inject yourself all over again. Except, of course, it's nothing like a terrible and dangerous drug, just in case Nadeo object to the comparison for some silly reason. Oh dear. CRASH.Come on Walker, concentrate. Stay on the tracks.Trackmania is a splendid idea. It's the PC's little treat that it doesn't share with the other boys and girls. It's instantaneous fun, playable in a fifteen second break, or an afternoon of swearing fury. It's, as this review should have said a long time ago, a racing game where the tracks weave madly about, loop-the-loop, and spend more time vertical than is reasonable, challenging you to fling varied cars along their harebrained, hairpin routes. Trackmania United is the same principle, this time with its gaming community put right at the centre.The third proper incarnation of the series (ignoring add-ons and the downloadable Nations), little of the core has changed since the utterly superb Sunrise. The game is still split into three modes: Race, Puzzle and Platform, and then there's the options to create your own tracks to play and share. What's strikingly different this time is that the sharing is integrated throughout, and even given currency.In each mode you can practise a track in Training as often as you like, with the game recording your best times, and unlocking new areas as you complete courses at least at a bronze level. However, this is only for your own private play. At any point you can restart a track as Official, and suddenly you're competing with the whole world. Even better, you can specify the localised nature of your competition, such that I've been taking on those in the South West of England. (Nadeo have rather sensibly shipped the game in French to France, Australia, Canada, Belgium and Switzerland, so that there's already a decent community established for us English lot before the game's launch). Your time (for Race and Puzzle) or your number of restarts (for Platform) is posted on the high score tables present on the screen from which you selected the level, and should you do well enough, you'll be reward with Coppers.Coppers are the in-game currency that funds everything. Getting Bronze, Silver or Gold finishes awards you Coppers (5, 10 and 20 respectively), and sharing tracks or skins you've created will earn you a few too. Even booting the game each day gives you a few coins to spend, so you'll never be stony broke. Your first Official attempt at a track will be free, but after that it's going to cost you 10C a time to try and post a high score. Want to download a new track for the Island section of the game? 10C please. It will appear on the menu as a new track, created by another player, which upon completion you can rate its quality. Then there's even an in-game marketplace, Manialink, with (rather ugly) in-game MySpace-style websites from player groups offering their wares at varying prices.You may well say: But hang on, couldn't I download people's tracks and skins without all this Copper business in previous versions? To which the answer is: Er, yes. So is it a good idea? Answer: Not entirely sure.As discussed, you'll rarely be out of coin, but at the same time, charging 10C to attempt a high score, for which a Silver result only rewards you the Coppers you spent trying, seems imbalanced. This is not an easy game, and Gold isn't always a synch. But you can practise a track as much as you wish ~for free~, before attempting an Official, until you've got it perfect. And of course, you never need even touch that whole side of things, playing resolutely offline in Training, and have the very same experience the original Trackmania or Sunrise would have offered.The other worry is quite how hard United is. By far my favourite part of Sunrise (and indeed United) is the Platform mode, where rather than racing, the aim is to reach the finish line with as few checkpoint restarts as possible. This is made difficult by the courses being ludicrously shaped, requiring pinpoint jumps, perfect corners, and ridiculous leaps into the sky. Figuring out a route, then perfecting it, is amazingly fun. The trouble is, this time around it gets madly tough really early on. Of the four difficulty levels - Easy, Normal, Difficult and Extreme - Normal features some tracks that seem like they should be nowhere near such an innocuous sounding mode. There's a line between swearing at yourself for messing up over and over, and swearing at the game for being so idiotically unfair at certain points. Of course, there's Official scores posted by everyone else in the world completing them with 0 restarts, but screw those people - I want more Platform levels at my useless level, rather than so very hard so early on.Race is much more balanced, with the huge number of tracks getting more challenging at an ideal pace. Plus, if you're rubbish like me, completing Easy is all it takes to unlock the next area of tracks, so you'll have dozens and dozens easily accessible almost straight away. And as you do move up past Normal, the race courses begin to take on many of the aspects from Platform, requiring much more finesse and trickery than simply handling the corners well. It manages the factor that so many games forget - it gets more /interesting/ rather than simply speeding up the opponents.Puzzle, as Trackmania was bizarrely meant to be played originally, once again takes Bronze. There's nothing wrong with it at all, but its necessary fiddliness takes the edge off. You're given a simplified version of the track editor, a limited number of tiles to place, and a time limit to complete the course you create. It's still a lovely idea, and often bewilderingly hard. Balance your limited resources with the need for imaginative short-cuts, and you'll get there. And the game's amazing ability to render itself from editor to playable track without a pause, simply zooming in and plonking a car down, remains deeply satisfying.Then there's the multiplayer, letting you play over LAN, or just leap in with a bunch of strangers attempting to score best times on a selected track. Oh, and you can download players' ghosts if they're top of a track's chart so you can see how they achieved such excellent times.That's Trackmania's secret. It's deeply satisfying, while at the same time being more frustrating than you could possibly imagine. It's a contradiction until you've played it. Its instant, load-free restart alone deserves a place in gaming's imaginary hall of fame. However, this time out, it does seem to have gone just a bit too difficult. Putting the community at the centre, and integrating the sharing tools is absolutely fantastic. The Coppers system inhibiting your ability to interact with it with complete freedom seems less so. And the menus with which it's all controlled feel clumsy and are near-impossible to navigate with a gamepad. (Ah yes - which do you use: the keyboard or a pad? My choice: both. I switch back and forth as the mood takes me, the analogue of the pad excellent for smooth cornering in races, while the digital steering of the cursors making for much more precise platform movement).It's only going to get better after release, with the accompanying explosion of downloadable tracks (there's already 200 new ones, and a bunch of classic tracks in there), which will presumably take care of the lack of courses for the less lightning-fingered-perfect-pants types. So throw away your religious hardbacks and fill your young pets' ears with cotton wool. Trackmania's back.Woo!"}