{"ref": "https://www.eurogamer.net/pro-evolution-soccer-6-review", "date": "20 Feb 2007", "game_name": "Pro Evolution Soccer 6", "text": "Let's be honest: the main reason we're interested in Pro Evolution Soccer 6 on the Nintendo DS is that it's easy to imagine a footballing catastrophe. And not your everyday footballing catastrophe involving 19-year-old girls and mobile phone cameras, either, but something to put even Craig Bellamy to shame, with artists pretending to be injured so they wouldn't have to draw faces, and programmers hacking away features like tipsy Norwegian ankles in the dead of the Portuguese night. Impressive, then, that Konami does better than we expected. Not much better, but still.There's a surprising depth of modes. There's no Master League to toil over all year, but World Tour mode is built around a similar idea: starting off with a team of unknowns, you progress through groups taking on all the game's teams, and earning coins for doing so. These coins can then be fed, peculiarly, into a capsule-toy machine that dispenses players when you use the stylus to turn the handle. We don't understand why, either, but the further you get, the better your luck gets with players. One capsule even contains the entire Japanese national team.There's Internet play, too. You can input Friend Codes (joy), search for a player of similar skill or just settle for anyone who's connected. Games are sometimes jerky in unhelpful areas, and switching off doesn't seem to be a blot on anyone's record, but the fact it's there at all is fairly surprising. There's an option for single-card multiplay, too, in addition to the expected wireless multi-card option, and it's also possible to track stats for wireless play and view your overall record with the game. Meanwhile, player and team names can be adjusted up to a point (you can't change licensed club names, or some of the national licensees, for example), while wireless player-trading is also permitted.On the pitch there are a few sensible nods to the DS' feature-set. Replays, most notably, are handled rather nicely, with a touch-screen interface allowing you to orbit the camera around the ball using the stylus. Even without the option to change the camera height, it's an impressively versatile system for such a diminutive device. Elsewhere, penalties are controlled, whether you're shooting or keeping, by tapping one of six sections of the goal, with each tap sending the ball flying or your keeper sprawling into the relevant sextant. Sure, it's a lottery, and if your player's a bit crap at penalties then you might miss wherever you aim, but... Actually, thinking about it, there is something slightly daft about having an interface allowing for precision pointing dumbed down to a game of footballing battleships, isn't there? Especially when some of the battleships can't even hit the target.Team selection is very limited as well, and slanted heavily towards international sides. You can still play as a few licensed teams, including Arsenal, Manchester United, Inter and AC Milan, Parma, AS Roma, Bayern Munich, Porto, Rangers and Celtic, but on second thought that is in fact the entire club-team selection. And while you might appreciate having an overhead view of your squad formation on the touch-screen, along with buttons allowing you to change between attacking and defensive stances, it all seems a bit less welcome when you realise that the icons don't move, instead sitting still and highlighting player fatigue with fancy colours. Thankfully though, you can replace this with the incredibly important top-down radar, which shows player movement, rather than having it reduced to a postage-stamp-sized dotty mess at the foot of the top screen.There's also faint praise to dispense on the field. While pixellated, the picture's clear enough for the games to play out more convincingly than some. Goals look good, with the ball sliding satisfyingly beneath keepers or looping over them, and while the traditional ongoing commentary is absent, let us rephrase: the traditional ongoing commentary is absent! Hurrah! Inadvertent praise for that, however, was never likely to extend to other areas of limitation, and so it proves. The second phase of a one-two pass is no longer manual, for example, while set-plays are harder to orchestrate thanks to severe slowdown caused by the appearance of multiple players. Sprinting is single-speed, and shots and passes tend to angle along the eight directions of the d-pad, which makes for a less nuanced game than you'll find on any of the other formats PES frequents, including PSP.The DS' relative lack of brain power is also apparent in its handling of matters outside your control. Relatively vicious sliding tackles go unpunished, sometimes thanks to inconsistent collision detection that misses connections where there ought to be one, and sometimes just because of a lack of refereeing intervention. AI players are weaker, too, almost ignoring the ball on lower difficulties and often discounting the chance to make progress up the field if the ball isn't pressured. Goalkeepers are particularly rubbish here, failing to stop shots from obscure angles or prevent you from rounding them with a bit of nimble-fingered pad-work.In the end though, PES6 still works thanks to the series' long-standing ability to do ball physics convincingly. Simply carving open defences, unleashing an unstoppable volley or breaking away from a corner and smashing the ball into the opposing goal is believable enough to satisfy, regardless of how weak a lot of the other aspects have become under the weight of dilution. In other words, if you're looking for a fully featured PES game, you'll obviously need to look to other formats, but if you're just after a decent facsimile that allows you to enjoy the magic of a flying football, you might find the series' best feature to be its saving grace on the DS. Not to be taken too seriously, then, but the sort of thing you might take on the train anyway."}