{"ref": "https://www.eurogamer.net/burnout-paradise-remastered-review-driving-perfection", "date": "14 Mar 2018", "game_name": "Burnout Paradise Remastered", "text": "Maybe it's something about Renderware. It must be, right? 500 Agility Orbs in the Renderware-powered Crackdown, daring you to allow anything else in the game to rival those humming green treats for sheer narrative appeal. And in Burnout Paradise, another Renderware joint, 400 yellow crash gates. They're shortcuts ostensibly but, given the way they scatter on the wind in your wake, I suspect people would happily charge through them even if they lead to nowhere more exciting than a small out-of-hours pharmacy.  400 yellow gates, twinkling their lurid twinkle and lending a throbbing emergency-yellow shape to the wild city looping and tumbling around you. And 120 billboards to smash through. And 50 super jumps to super jump. And ten multi-storeys... Coming back to it after all these years, peeling out of the auto shop, mentally buckling in, physically shunting through the best worst soundtrack ever constructed in order to find the best worst song of them all - Avril Lavigne's Girlfriend - and then heading for the hills, for the wind farm, for the docks, for the first, hundredth, thousandth time? Doing all of this on instinct alone, it is so clear, so thrillingly clear, that you have found yourself at the centre of something very special. Burnout Paradise is one of the most energising driving games ever created, one of the purest zone games in years, and one of the most thoughtful and surprising and integrated takes on what makes an open-worlder tick and what keeps an open-world feeling connected, readable, and coherent. And hilariously - hilariously! - it's not even the best Burnout.In fact, at times, Paradise is barely Burnout at all. It ditches the chevrons, for Pete's sake! It ditches those glowing gutter guards that appeared alongside the tracks you raced down meaning that you never really had to worry about steering very much when you were pushing your way into infamy in Takedown or Revenge. Instead, you can get lost on races in Paradise! You can take a wrong turn and suddenly drop from 1/8 to 8/8 like the Pope himself hitting a holy air pocket. (I don't know why I've brought the pope into this; maybe all that talk of Paradise, maybe it's just that Criterion has a way of making its players feel special.) Equally, though, when you do get lost you can take shortcuts - those 400 yellow gates again! - and you can devise your own weird strategies for finding a better path to the finish line. You can bring things back from the brink, using an E-brake so perfectly suited to the landscape it belongs to that its implementation feels almost telepathic as you use it to cross four lanes of traffic and insert yourself exactly where you want to be. Or you can abandon the race and decide to do something else. How do you abandon a race in Burnout Paradise? Glad you asked. You don't page through the pause menu. You don't squeeze a magical arrangement of buttons. You just stop. You pull over and stop moving and the game will know that you're done and that you want to do something else.What else? Paradise ditches the crash junctions and the after-touch Takedowns, replacing the series' signature moves with a mode that sees you erupting into shrapnel and bouncing down any street you fancy, a movable crash mode, pranging off cars until you've run out of momentum. It tracks your score and attaches it to the landscape, obviously. It tracks every score and attaches it to the landscape. But for some, these absences were absences too far. Burnout without a lot of what makes it Burnout.So what is Burnout Paradise if it isn't Burnout as the earlier games defined it? It is a machine. It is a machine for allowing you to drive fast and feel a steady chug of achievement and know that everything you do in this place - every single thing you are doing - has value and is worth doing in and of itself. Like Mario, someone you may think about a surprising amount while playing Burnout Paradise, there is nothing here that the designers have not already foreseen.And this machine! It is so organised! It is so brilliantly, so idiosyncratically structured.Paradise City is a playground, and we will get to that in a bit, but it is also a menu. Its events lie all around you, each one scattered at its own intersection. You drive around and you are browsing: Marked Man? Too much. Stunt Run? Not enough. Road Rage! Just right! I will take this junction. A squeeze of the triggers and you're off.And these events, when they have finish-lines, are very tidy about it. From each intersection, every race terminates in one of eight landmarks scattered around the city like the points on the compass. You are told this upfront, of course, because Paradise comes to us from the day when games would start with unskippable videos explaining their numerous inventions. But you don't realise what it means until you're hours deep, 300 gates down, 87 billboards in glowing red shrapnel behind you and you start to realise that there is something about this place that is rigorous and accommodating all at once, something that suggests a comforting underlying framework that you don't so much notice but instead simply benefit from as you zig and zag, back and forth, always headed somewhere interesting, never needing to stop, forever cast along a new road aimed at a familiar destination.Getting around is a dream, then, and so is levelling up: just complete events, and each event will add points to your licence. When you get a new licence, old events are suddenly there for the taking again, which means you can race, road rage, stunt run and marked man your way even further along the progression system. Look at those event names. Deep down they are all the same: travel fast, drive badly to earn boost, ram everyone who comes your way and jump off everything that so much as looks like it might be a ramp.And almost everything looks like a ramp. Paradise City is probably not that big by modern standards but it uses all the tricks in the theme park book to shunt a huge number of different ecologies into such close proximity. To put it another way, Reyner Banham would comprehensively lose it as he raced from alpine folly to Brooklyn underpass in the space of a few gear changes. It's not just nicely slotted together, though, it's also beautifully balanced, new routes announcing themselves as you hit the requisite speed for fresh racing lines to appear. I have no idea how the team at Criterion did it, how they understood not only that the right momentum and the right angle would bring an otherwise unbridgeable gap swiftly into the realm of possibility, but how they worked out to convey all this to a player who was already travelling at one hundred miles an hour, the screen contracted to a single sparking dot of possibility in the very centre of the asphalt. Zooming through the glorious mid-game of Paradise, where there are still un-jumped jumps and uncrashed gates if you can keep your eyes peeled and one hand on the E-brake, Paradise starts to look like a bit of a category error, in fact. With its hidden chains of tricks and consequences, its gate-giving-way-to-leap-giving-way-to-pixel-perfect-turn-through-oncoming-traffic, it seems to have far less in common with modern open-world driving games than it does with freewheeling, make-your-own-punch-up open-world action games. It belongs to the lineage of Crackdown and Far Cry. Chain stunts together with multi-storey car parks and train tunnels and it almost comes on like a new strain of platformer in which you just happen to be a car.Before I lose it completely and start to just reel off my scribbled notes - Debussy Flatspin is not the name of my family's favoured PI but refers, instead, to a moment during Clair de Lune where I hit the E-Brake accidentally while leaping off something sharp down on the waterfront; DJ Atomica really does sound like Guy Fieri sometimes to the modern ear; Road Rage and Marked Man do kind of feel like American Football with bumpers and headlamps - there's the question of the remaster, of course. Probably should have gotten to this a bit earlier, shouldn't I? But Paradise is one of those enveloping games - an early master in the modern Ubi-arts of endless distraction - that takes the things you planned to do and lofts them all out of the window. Anyway, for my money, the developers have handled this quite smartly: everything's gone into delivering the smoothest of frame-rates and the sharpest of edges, but it may disappoint some that the textures and geometry have been left largely unchanged as far as I can tell, and the price-point lies well outside of the £15 impulse range that doubles as loft-tax. In other words, EA's charging a bit too much for you to write this off as the price you pay not to move HDMI cables around or hunt through a few dusty boxes for an old disc. What I would add, though, is that the art direction holds up surprisingly well: Paradise City has character even if it doesn't have an abundance of glittering detail, and besides, it's generally zipping by at the speed of sound anyway. On top of that, if you think of value as a question of how many things a game contains, the DLC is bundled in from the start, which means you get a holiday island, a DeLorean, bikes, toy cars, Ecto-1 and various other bits and pieces from the off.Is it worth it? It is worth it in terms of responsiveness that makes the controls feel like an extension of your unspoken impulses. It is worth it in terms of speed and adrenaline and the rare thrill - rare for games, at least - of total consistency. Every part of Burnout Paradise clips together. Every part is designed to get the most out of all the other parts. And so, to ease behind the steering wheel, to slot in the imaginary seatbelt and fumble through EA Trax for Girlfriend? All of that is to begin the strange invocation ceremony that ends with you giving yourself up to something vast, speedy and gloriously overwhelming. All this, and it's still not even the best Burnout."}