{"ref": "https://www.eurogamer.net/metal-slug-anthology-review", "date": "20 Feb 2007", "game_name": "Metal Slug Anthology", "text": "Forget Alan Wake, Metal Slug Anthology showcases the best graphics ever seen in a videogame. One day soon, people will realise that there are only so many virtual suns reflecting on the surface of virtual lakes that one can go 'wow' at. Yes, sunsets are pretty to look at and yes, it's terribly impressive how life-like the metal on this AK-47 looks when viewed through that particle effect, but surely we play games to visit new worlds: not marvel at slightly more rubbish versions of the current one?Excuse the antagonism but, for fans of 2D pixel art, the decade-old Metal Slug series has never really been bettered for intricacy, personality, character and colour. Indeed, it's thanks to this series that there are those of us for whom the prettiest face of videogames lies not in the future but in the past. Sure, the latest 2D Street Fighter or Guilty Gear may have sharper characters and backgrounds but this isn't a stationary beat-'em-up. Rather, SNK's side-scrolling, run-and-gun war parody takes in a hundred different locales, from the deepest jungle to the deepest sea, each bristling with an individuality and style that a Tom Clancy cast would kill for.The gameplay couldn't be simpler: make your way from left to right shooting enemy soldiers and vehicles before they shoot you. There's no life bar: it's one shot one kill. Your basic pistol has unlimited shots. You have a fire button, a jump button and a bomb button and, should you find any vacant vehicles or willing animals along the way, feel free to appropriate them to the cause. And that, in sixty-nine words, is how the seven Metal Slug games, each brilliantly emulated here on the PSP, function.That said, the devil is in the detail and Metal Slug's simple mechanics have sub-surface depths that allow for those near infinite high-score possibilities Japanese arcade developers are so good at providing. For example, try to shoot an enemy at close range and your character will knife them instead for a slightly higher point bonus. Likewise, throughout levels you'll find kidnapped allied soldiers who you must touch to rescue. Defeat the level boss without dying and you'll earn a satisfying bonus points (and the name and rank) for each hostage saved since your last restart. Random items and different weapons can be uncovered for bonus points and there are numerous hidden areas and hostages scattered throughout the exquisite levels. If that all sounds a little orthodox then that's because, in text, it very much is. However, like with all good things, the genius is in the balancing and, as you might have gathered from the above introduction, the style and personality with which it's all presented. And these are things that you can't really express in words. Rather they must be experienced to be understood and appreciated.If you're worried that misty eyes might be clouding Eurogamer's judgement here then rest assured: unlike many retro titles Metal Slug doesn't need nostalgia in order to milk your adrenal gland. Every level is a glorious orgy of micro-strategising and precision-timing. Even if you do go weak-kneed at the prospect of playing through these games as 1st Lieutenant Marco Rossi or 2nd Lieutenant Tarma Roving again, the value of any nostalgia is still comfortably surpassed by the value of the gameplay.And, of course, the value of these quirky, humorous and wonderful visuals, which might need a little explaining. Like SNK's other flagship series, King of Fighters, the Metal Slug games have attracted a fierce and enamoured underground following but have never managed anything approaching mass-market fame. The stabs at mainstream success with handheld conversions of the games to Neo Geo Pocket, GameBoy Advance and, more implausibly to mobile phone devices have done little justice to the series. In main, this is because, despite being retro games, the system that originally powered the series was vastly more powerful and competent at pushing 2D sprites than even the PlayStation 2. The Neo Geo Advanced Entertainment System, released in 1990 for a PS3-trumping US$ 650, was arcade developer SNK's home console super-power and it exists on a separate technological timeline to the SEGA Megadrives and Super Nintendos of our history. Its architecture was an exact replica of SNK's MVS arcade system and its games, which came on enormous clunky cartridges, cost upwards of 200 quid each. The console's vastly superior 2D power allowed for incredible levels of detail at virtually no slowdown cost - a double whammy of technological achievement that, until recently, virtually no console systems have been able to accurately emulate due to their bias towards handling 3D.So, that the PSP does such a good job of replicating the original Neo Geo experiences (and, in the case of the recent Metal Slug 6, the Atomiswave experience) is good news. Each of the games in the anthology runs near arcade perfectly in either the original aspect ratio or stretched to widescreen. There's now a slight pause between each level for loading, but these are acceptably brief and generally comparable to the Xbox release of Metal Slug 3 and the PS2 versions of 4/5.Indeed, to get all of these games in one compilation is incredible. Viewed individually the games vary slightly in quality (although not really in function) and debate will rage on amongst aficionados as to which is the best in the set. Undeniably there was a slight dip in inventiveness and quality after the third game when SNK folded and development shifted to Playmore, but nonetheless, the later games are still expertly produced and, as they build on solid gameplay foundations and reuse timeless sprites, they are all good.It's not all happy news, however. Ignition's porting of the games might be brilliant in that they run perfectly on the PSP, but the presentation of the package and the functionality of the menu screens by which you access the games is nothing short of a disaster. Perhaps there had to be some kind of trade-off: the games would only run as smoothly as they do if the menu system was abortively slow. Even if that was true, as an end user, that doesn't really concern me. What does concern me is how trying to select the next option in a menu list requires a five to ten second wait before the cursor to moves. Likewise, the functional loading text (which makes no attempt to co-ordinate with that in the games) and the basic and basically presented unlock extras (art, screensavers and a text (!) interview with SNK), do little to treat the series with the care, love and respect it so richly deserves.All of which presents a problem. The games that are presented on Metal Slug Anthology are a marvel of art and design. There are, frequently, excruciatingly tough but all of their peaks are surmountable by the persistent and/or the talented. Indeed, as side-scrolling action games go these better almost every other title both retro and contemporary and, to have all seven games packaged together into one collection is overwhelmingly generous and commendable. However, their actual presentation - the tortuous loading screens, the ugly front end and the menus that need repeated input to activate - is inexcusable.But while reviewing games is undeniably more than just critiquing gameplay, we're not going to mark Metal Slug Anthology down for its menu design and some shocking ugliness in the surrounding package. You should still buy this game, and not because it shows us how far we've come either - but rather because, in the case of 2D art and gameplay design, it shows us just how far we've since regressed."}