{"ref": "https://www.eurogamer.net/xbox-360-wireless-steering-wheel-with-force-feedback-review", "date": "19 Feb 2007", "game_name": "Reviews", "text": "Console steering wheels are prima donnas. Awkward buggers, they park their clunky bottoms on tabletops where they immediately demand pampering: cables snaked all over the room, clamps tightened, options selected and then all of that done in reverse whenever they're to be put back in the cupboard. Because you can't leave them out, or they constantly get in the way, and probably teach your budgie rude words when you leave the room.Microsoft's effort starts ticking these boxes before you've even taken it out of its own. It's called the ~Xbox 360 Wireless Steering Wheel with Force Feedback~. Try scrawling that across your website without breaking anything (note to admins: try scrawling that across the website without breaking anything). And, as everybody will delight in pointing out, it's not even wireless in the traditional sense of, you know, not having wires. The ~wireless~ bit of the name, you see, refers to the lack of direct connection between console and peripheral, not the unit overall. So if you want the ~with Force Feedback~ bit, you'll still need to have it plugged into the wall socket at all times, and if you want to use it at all then you will need to run a little cable between the ports on the wheel and foot pedal units, so that they can talk to one another (sample dialogue: ~Vrrrooom?~ ~Vrrrooom.~)But then of course the other characteristic of prima donnas, besides their egotism and irritability, is that you can't really be doing without them, and with this Wireless Steering Wheel, Microsoft's hardware designers have done all they can to ensure that the set-up rituals - while slightly more complicated than simply picking a pad up off the coffee table - are still more worth than they're trouble.Even as you're setting it up, you're enjoying the sense that care and attention went into every aspect. Most steering wheels screw themselves to your surface with as much thought and gusto as a jaded prostitute, and come loose the minute you start getting into a rhythm. Not so the Wireless Steering Wheel, whose clamp design is a marvel of engineering. The bit that comes into actual contact with the table can be angled, the screw mechanism is firm, and there's a separate flip-clamp bit on the front that helps lever a bit more grip out of the device once you've tightened it. It's definitely not coming loose, and it's quite liberating to realise just how much you can yank the wheel around without worrying. What's more, if you have no tabletop, you can simply remove the top section and park the Wheel on your lap. Force Feedback is diminished, but it's nice to have the option.Meanwhile, the steering wheel itself is rubberised around most of its circumference with a slick square bottom (a nod to the restrictions of the average race car - or perhaps a nod to the tummy of the average gamer), and all the Xbox pad buttons are located within easy reach of your thumbs and fingers as you grip the wheel. The d-pad and face buttons fall within easy thumbing distance, while the bumper buttons translate to a pair of paddles that make for easy gear changes with the fingers. The back, start and Guide buttons sit in the centre of the wheel. You'll also find a little port down to the right of the wheel for attaching your headset mechanism, next to a button for synching the Wheel with the console, while the battery compartment is hidden behind a removable grey panel on the right side. As for the pedals - the accelerator has a nice metallic appearance and a healthy surface area, while the brake requires a bit more force to depress, just as you'd expect.Describing it all in this much detail is a bit of an indulgence, you might be thinking, especially with all the photos dotted around the page. Then again, I'd counter that this is an expensive piece of kit - I thought it would be nice to note that it actually looks and feels like one. Dive into the bundled copy of Project Gotham Racing 3, and you'll discover that it behaves like one, too.When the Wireless Steering Wheel was announced last year, of course, it was originally aiming to launch alongside Forza Motorsport 2 - a racing game of supreme depth and one that's designed to showcase the Wheel's capabilities. That didn't happen, what with one delay and another, but as it turns out PGR3 is a worthy substitute - at least in technical terms. The bundled copy is ostensibly the same as the normal one, except the disc also includes the requisite drivers for the Wheel. Don't worry though, because the install procedure is invisible - the only reason we know of it at all is that they point it out on the disc label, so you don't forget. Indeed, the only loading snag comes if you activate the Wheel having already turned on your console using a regular controller. The Wheel is nobody's sidekick, so it needs to be considered ~controller one~, and hooked up to your onboard profile in the usual Guide-button-tapping way.It's a good thing I wrote all of this down when I was getting it set up, really, because once you're in the game you might as well be in another world. Immediately you feel the slight tug of the road pulling your tyres around, as the excellent Force Feedback replicates the changes in surface incredibly well. Even so, the initial races are a horror-show of under-steer, over-correction and spinning Ferraris. What's going on? What's going on is that it's actually a lot like driving. Moving over from the analogue stick is jarring enough to floor even the best driver (and I am our best driver, what with my all-platinums PGR3 record), and it takes a good hour or so to start realising just how brutally exacting a subtle, well-engineered steering wheel can be. You certainly won't be driving one-handed, put it that way. More likely you'll be gripping the wheel tightly, laughing into every corner and slamming your feet into the pedals with real vigour. PGR3's a new game again. A harder, more exhilarating one, where driving is suddenly driving. That's not even hyperbole, really.And so the question becomes whether it's worth buying a Wheel to play a 15-month-old racing game that was already a bit like the one from 24 months prior to that. (And believe me, it does become that question - the other alternatives are Need For Speed Carbon, which I refuse to play on principle, and Test Drive Unlimited, which doesn't support Force Feedback and has a big fat steering dead zone blighting the experience.) Well, hard for me to say, depending as it does on a number of factors - whether you intend to buy Forza 2, whether you've played PGR3 before, whether you'll have to keep putting it away because your girlfriend's a frightful nag or your budgie keeps saying ~Waaaark, cocking sandtrap~. For me, I went into the experience with an irrational downer on console Steering Wheels, and having really seen as much of PGR3 as I was ever going to, and I left it - when I eventually left it - wondering how long I'd have to wait for Forza review code. You can work out for yourself if you want a steering wheel - just know that this is a good one."}