{"ref": "https://www.eurogamer.net/fuzion-frenzy-2-review", "date": "14 Feb 2007", "game_name": "Fuzion Frenzy 2", "text": "I've always had a soft spot for Fuzion Frenzy. I'm not entirely sure which soft spot, but, you know, one you wouldn't mind laying your head down on. Despite it being possibly the most uncool launch title ever, it was one of the best four-player post-pub games around.Famously Bill Gates' favourite Xbox 1 game, it was a pretty easy target for the critics when it first came out. Stood next to Gotham and Halo, a geeky looking futuristic party game was hardly going to be held up as a poster child for the next generation, but it was pretty much damned to hell despite actually being rather good. Shame.So why is the sequel so crushingly bad by comparison? Surely the addition of online play would make the whole concept irresistible, right? You'd think.Despite the entire tournament structure, cast of characters, visual style, game modes, and even the feel being aped as closely as possible, the mini-games just are nowhere near as entertaining. In fact, most of the 40-odd games you can choose from are downright irritating.The first clue comes in the choice of developer. Out go Britsoft stalwarts Blitz, and in come Hudson, the long-time developer of the never-ending and interminably dreadful Mario Party series. But as hard as Hudson tries to deliver a bunch of instant-thrill pick-up-and-play gems with intuitive controls and simple objectives, the whole collection feels woefully uninspired and cobbled together.Playable in Tournament, Mini-Game Frenzy or Custom mode, you can choose from the same six different (yet all utterly charmless) characters that lined-up over five years ago, choose a difficulty level, and then watch the game go rapidly downhill from that point on. The first crime against gaming is the staggeringly awful gameshow host 'DJ' - a  man so vacuous that Dyson is reportedly interested in utilising him to power its next generation suction technology. Like the anti-Buzz, his interminably dull delivery lacks any charm or sense of irony whatsoever, to the point that before the first round is over you'll feel your soul slowly ebbing away. It's as if Hudson sat around and actively worked on devising the least cool Man of the Future possible - and decided he needed Light Emitting Clothes just to remind us that this is The Future.And if that wasn't bad enough, the characters you choose from have been 'updated' from the slightly goofy-cool flared trouser n' big boot-wearing kids of the original into bland animé anonymity. Ugh.But we'd happily forgive all that were it not for the inescapable fact that the mini-games are almost exclusively rubbish. Regardless of which of the seven planets you opt for, you're forced to run the gauntlet through one crushingly awful example of uninspired design after another. It's a pot pourri of tedium: take the Amoeba Hunting game where you're tasked with running around an arena, picking up pesticide bombs and lobbing them at the giant blobs (i.e. Amoebas) that emerge out of the floor. Obviously everyone else is also trying to do much the same, so the whole thing descends into a veritable riot of players lobbing bombs and trying to catch not only the amoebas, but your fellow players in the splash damage.And, typically, the formula for many of the games involves also being able to kick, jump and punch your opponents out of the way - often into electrified forcefields, or lava, or off the edge into a veritable pit of doom. Sometimes it's a case of trying to avoid your opponents for as long as possible to conserve your energy, and hoping that they stray into the path of the many obstacles that (often) rain down. But that would be fine, except for the fact that the controls for many of the game are sloppy, poorly implemented or just generally designed in a way that doesn't make the task at hand in any way fun or interesting. Turbine Jumper, for example, distinguishes itself by having easily the most hopeless jump controls we've seen in a videogame since the late '80s, and yet places the players on a rotating turbine and tasks you with jumping or ducking over or under laser beams as they appear. Super Slam Dunk is similarly horrible to control, with the idea to move and attack players, snatch the ball (or barge them out of the way) and then jump and shoot for goal, with, woo, futuristic gravity that allows you to jump really high. Like a lot of the games here, it has the random element to make it easy for anyone to win by luck, but just doesn't grab you at all.And then there are some crushingly awful button-matching games that are insultingly basic - such as Over The Falls where the idea is to match the sequence of face pad buttons (A, B, X, Y) as they appear on the screen. Another places you on top of a pillar, with the last man to input the sequence losing a segment of their pillar until you're out. It's fun for about ten seconds, and just lacks imagination.Elsewhere, the whole ethos of keeping it simple kinda works. Games like Don't Sink The Boat have that frantic Track & Field appeal, where hammering the button as quickly as possible and aiming your turret sinks your opponent, while another does a similar thing on a treadmill. But, as easy as they are to get into they're hardly the sorts of games you'll be desperate to fire up to play after a night out.Others are just too simple for their own good, and therefore too boring to be worth a second glance. Take Turbine Coin Collector: you, again, run around a spinning turbine (essentially a turntable, but hey) and gather coins while staying between moving laser beams - a task so dull that you'll barely reach the end before wanting to see what's next. Games like Ice Sculpture aren't much more interesting either, with a perfunctory aiming task where you have to point a jet of water at an ice statue in order to melt it before your opponents. Fortunately, there are some games we quite liked, such as Hot Shot, the four-way air-hockey style game where you're all defending your goal and simultaneously trying to knock the balls into everyone else's goals at the same time. That was fun. Sadly, too many resort to dire last man standing rules, made ten times less interesting thanks to the poor combat mechanics and rubbish 'avoid the giant falling obstacle' filler fodder.We could tortuously list all 40-odd games and point out the relative merits of each, or simply warn you in a hopefully more helpful, less tedious manner. It's like this: Fuzion Frenzy is depressingly basic when it gets the controls right, and when it doesn't (which is most of the time) the game feels like a badly assembled jumble of failed game concepts that rarely get even close to hitting the mark.To compound the misery, there are some astonishing design decisions that completely screw with the concept of, you know, actually winning rounds. At the start of the game you get given a couple of Frenzy Cards to use as you wish at the start of each round - such as 2x score multipliers or reverse multiplier cards that divide your opponent's score for the round. So, for example, you could comprehensively win a round, and then find that your score has actually been divided by a factor of 2, 4 or 6 (depending on what you played), and you're the round loser. In another round, a player who has been consistently losing might find themselves with a 6x multiplier, win the round, scoop 60 points and end up winning the entire series through a complete fluke. Sure, it adds an element of chance to the game, but it's so badly weighted, and so utterly arbitrary as to whether you deserve it, it can render the results of the mini-games completely meaningless. Fortunately, you can set up custom tournaments that not only remove the Frenzy Card element, but the sodding DJ as well, which is by far the best way to play the game - with sensible scoring systems like, gasp, one point for every mini-game you win. Needless to say, playing Fuzion Frenzy has always been about the human element, so don't even consider playing it against the computer if you've got the choice; they either cheat or are so rubbish it's not even funny. Preferably you'll want to play it in the same room as fellow party game fans, but if all your friends live bloody miles away then you'll be happy that Hudson at least bothered to include online options this time - even if they are pretty rudimentary. The problem you'll have, of course, is finding anyone on your friends list who can be motivated to buy the game, and judging by the lack of activity online, it's not distracting too many people from their Xbox Live favourites at present. If you're wondering whether to buy it for the vague possibility you might like a couple of the games, then don't.Fuzion Frenzy 2 is, you could argue, the 360's finest multiplayer party game. Dishonest types would emblazon that on the box and forget to mention the score. The reality is that it's a sub-par offering in almost every respect, chock full of insipid, charmless, half-baked zero-fun games that would embarrass a start-up indie studio. The fact that Microsoft is only charging about £30 for it softens the blow a little, but it's still by far the worst first party offering from the Redmond giant for many years."}