{"ref": "https://www.eurogamer.net/tiger-woods-pga-tour-07-review", "date": "10 Feb 2007", "game_name": "Tiger Woods PGA Tour 2007", "text": "Being the best isn't always great (or so I'm told). Sometimes, it's enough to make you cry. Or, er, offend people with disabilities. People like to pick on a winner - especially if he's clearly not as good as he could be. That's been the case with the Tiger Woods games for a while, culminating in 2005's totally rubbish Xbox 360 opener, which stumbled drunkenly onto the course with all the grace and vital content of a Fat Les reunion tour. This one's a big improvement.The basic analogue swing and shot-selection buttons remain, but on the fairways control is refined to emphasise the risk that golfers take trying to cover that extra dozen or so yards. The aiming marker is dispatched, replaced instead with a circle that encompasses any number of potential landing spots, and also grows in size the more ambitious your shot selection. Its impact actually develops you into a better golfer, encouraging you to play safely. You may not make as much ground as an opponent who attempts a shortcut, but most of the time you will find yourself on surer footing with a better chance of success on the next shot. This you remember. Online, it helps nurture the occasional upset - a 315-yard drive might put an opponent on a par-4 green in one shot, but more than likely it will put them in thick rough, or leave them with an 80-foot putt, whereas a sensible tee shot and a reliable 9-iron approach could put you on the lip of the cup.Putting is also a bit trickier now on default and higher difficulty levels, thanks to the removal of the ~ideal putt camera~ and caddy tips, leaving you to use movement lines to make putting judgements. As with your other shots, it's possible to tilt the club-head to add spin (off the green it adds height, too), but putting in general is harder and requires consideration, concentration and a gentle swing rather than a vicious thwack. Just like the real thing.Pleasantly though, Woods 07 is a game of breadth, and those who prefer golf with pace are still caddied for. All of the above is effectively optional - you can enable putt cameras and caddy tips, you can simply play a round as Tiger Woods, you can search for online games where the training wheels remain in place (and, thankfully, find some). The Y button continues to speed up your own and opposing shots' flight (although you can't skip as many animations as you might like), while a broader range of arcade modes and some new mini-games, played out in an attractive golfer's-playground sort of training complex, allow you to dig in without having to wear a frown all the time. Modes like T-I-G-E-R, where the idea is to attempt a shot that your opponent then has to either match or better, introduce a competitive element that fills smaller holes in the day than Tiger's ever aimed for in the past. Think of them as golfing's kickabouts.These tasks, and other training mini-games, also allow you to develop your custom player's stats without having to embark on 18-hole rounds or gruelling PGA Tour events at every step. The experience system is better in general. Pay attention and hole a long putt and you'll get a luck boost - something that makes a difference to your chances of seeing the ball roll that final inch the next time you're in a similar position. Basing player-growth on actual experience is better than simply giving you points to distribute, and while the system also limits your growth at certain points until you've played a few single-player rounds against proper opposition, we can live with the inconvenience.A word is also due here for the character-creator in general, because it's much improved, divorced from last year's 'acne randomiser' X button effect, and complemented by a fairly diverse range of accessories that, for once, are quite easily navigated - and offer a small skill boost in places, too. Naturally most of the kids use the tools to dress up like The Neptunes or whichever tightly bound plastic idiot is on MTV that week - because the latest Nike shoes are a profound statement about their individuality - but there's a decent array of frumpy-looking schoolteacher avatars golfing along as well (me, for instance). Anyway, the point is there are lots of options.And that, obviously, it's not all training, ~Battle Golf~ and dress-up. Game modes continue to include stroke and match play, as well as four-ball rounds and other rules variations. The big stuff takes the form of Tiger Challenge and the PGA Tour. The former has you face off against a mixture of real and fictional golfers (on the real side, John Daly, Vijay Singh and Arsenal-shirt-wearing Ian Poulter are new, while the fictional gang now boast voice sampling in addition to their ~wacky~ animations), with several potential opponents usually available at once, and the eventual goal of beating Tiger himself. The PGA Tour is longer-form, as you'd expect, with multiple rounds on the same course, and new FedEx Cup scoring.Meanwhile, those who found last year's half-dozen course quota stiflingly slight will be pleased, if not overly thrilled, by the addition of six more this time around. But more significant than that is the general improvement in visual quality and presentation. There's a tournament atmosphere again thanks to hundreds of spectators visibly lining the course, but little touches like cloud shadows drifting across the surface of the fairway add further life to the image. Previous games were sometimes like watching motion-captured polygon fidget contests set against a blurry photograph, but you couldn't render the accusation here because everything's crisp and vibrant, not to mention slick - I wouldn't be surprised if the new menu system's snapped up for a VO5 advert.There are some things you could pick on. Lag in online matches sometimes means it's physically impossible to complete a stroke before the shot-clock expires; groups of spectators are often seen performing the same animation at the same time in the same area, which is one of my all-time gaming bugbears; quite a few of the mini-games are actually rather similar; and it's also fair to say that while some of the courses match the description in the preceding paragraph, others have been shuffled to the back and paid less attention, or suffer from occasional frame-rate dips. What's more, a PS2 or Xbox owner might point out that their (albeit slightly inferior) version boasts 21 courses rather than 12.EA's made some Orwellian marketing decisions too. We're used to the sort of fluff that argues a game is supernaturally intelligent when it offers to change the skill level after you thump someone by 84 strokes (~reactive difficulty~, everyone), but the presence of ~NEW!~ labels next to individual menu items, as if we're supposed to froth with excitement at the fact less than a quarter of the game is visibly changed at all, is a definite signature of evil. No wonder MGM took the Bond licence away - imagine a Casino Royale game with Daniel Craig loping about wearing a ~NEW!~ sign on his face.But then I expect EA will give us the odd duff game to kick around the Internet later this year (Harry Potter and the Order of the Phoenix, anyone?), so we might as well be nice to the ones it does relatively well. And this is certainly one of those. Over the years, mistakes in Tiger Woods games have come into sharper focus with each uninspired retread, but this one claws back a few strokes with just a few tweaks and a more accommodating approach. Woods games have often done volume, but this one does fidelity - and while the next-gen golfing genre isn't exactly broad, we suspect being the best in a field of one will do them fine, especially since, in this case, it feels like it is mostly as good as it could be."}