{"ref": "https://www.eurogamer.net/toca-race-driver-3-challenge-review", "date": "8 Feb 2007", "game_name": "TOCA Race Driver 3 Challenge", "text": "Post-publication shouting: Attention! Sumo Digital made this game! We forgot to put that the first time! This is quite surprising as they also ported OutRun 2 and did OutRun 2006, which we usually mention at least once a day! Exclamation exclamation oneoneshift normal service resumes.Wacky game features are always the best. You know what TOCA was clearly missing? An option to turn the screen upside down. This lets you use the analogue nub for acceleration and braking, while the PSP's face buttons act as a d-pad. This, I'm reliably informed, is how ~the hardcore~ play. It is, as Kieron would probably point out, ~very emo~.It's also symptomatic of TOCA Race Driver 3's devotion to its new home. There's no shortage of viewpoints to opt for (bumper, bonnet, in-car, third-person), there's a rare outing for the game-sharing option (we'd forgotten how to use it, it's been so long), there's replay-saving and even custom soundtrack support. Nice work, Codemasters.Of course, some of that was there in the last handheld TOCA. New to the PSP's confusingly named second outing - and responsible for its longer title - is the World Challenge mode, which throws you onto tracks in various bits of the world with specific objectives, the idea being to develop your skills before it plunges you into qualifying and Grand Prix. This does mean that your traditional dour Scottish mechanic is absent, but it (and indeed that) is not entirely without merit.The difficulty of picking up TOCA's handling isn't sufficient to warrant quite so many skill-building tasks, but the decision to chunkify the game does help you to learn the track layouts (crucial during races, obviously), and more pointedly aims to school you about racing lines, braking distances and so on. Advanced stuff, you might say.The best examples of this are fun rather than simply educational. One recurring task involves snaking through cone gates before your time is up, and it's hard to resist the temptation to repeat this until you've claimed the gold medal. Project Gotham Racing fans will certainly understand. Keeping up your average speed over two laps is similarly engrossing. Meanwhile, ~No Damage~ is about trying to win a race without simply bullying other cars out of the way by messing up your paintwork.But while these work and the ~Challenge~ theory is certainly sound, other areas fall down for the same reasons that everyone slags off Gran Turismo's licence tests. Braking challenges are tedious affairs - it's hard to sell the fun of driving by focusing on the bits where you don't drive, after all. This is particularly apparent when the task involves trying to park a car you've never encountered before on a series of distant squares that, at the point you need to start slowing down, are sometimes only visible on the mini-map. All this is done against the clock, too.Elsewhere, ~Drive the Line~ ought to be more helpful, illustrating the optimal route around complex circuits, but in practice it's a constant battle to remain within the narrow confines of the line indicator on the track. If you stray too far to one side your success percentage starts to dip, and you're often so preoccupied with this that you fly uncontrollably into corners, all of which somewhat negates the point of the exercise. I suppose it teaches you about when to expect the meanest corners, but not exactly via the medium of fun.Fortunately the qualifying laps and GP races are much more entertaining, largely because the handling is up to TOCA's usual standard and the choice of tracks is brilliant. Nurburgring's F1 circuit, Silverstone, Brands Hatch, Hockenheim, Leguna Seca - and there are meaner ones in there with all the poster-children, too. You should tour through 36 in total. Car-wise, things aren't quite as distinct from race to race as I remember in the PS2 version, but there's little arguing with the core handling, which screeches around corners in that satisfying middle ground between Hollywood simplicity and brain-deading realism.All of this is brought to surprisingly vivid life, too, by a handheld game engine that improves on its direct predecessor. TRD3 Challenge manages impressive draw distances and detail levels. You wouldn't mistake its trees and hoardings for the real thing, but their volume provides a nice backdrop to the tarmac your eyes are focusing on, which itself is handsomely bitty. As for car models, texture detail pops in a bit late here and there, but when you're racing off in a pack of 20 cars you can't complain.Sadly, the price of all this luxury is a frame rate that starts off acceptably but often brakes too late, so to speak. Certainly in a packed field you'll notice a distinct loss of smoothness, but in fairness to the game you'll put a high enough value on the draw distance to justify it, and it doesn't ever become something that puts you off actually playing. Just something to beware of, like.What does get in the way though is the difficulty, but perhaps not in the sense you're expecting. Despite TOCA's relatively fierce reputation among its hybrid racer friends, I was able to waltz untrained and unhindered through the first three tiers of the Challenge mode without needing to use the (impressively instantaneous) restart option on more than a couple of occasions. If you can handle the idea of having to brake heavily before entering a corner, and avoid handling the accelerator button with a sledgehammer, you should find yourself in a similar situation.Target times are forgiving enough that you can afford to spin off the track in a couple of places and still finish in first place, and the damage system - for all its blinking indicators on the speedometer - doesn't seem to cost you much performance until the wheels actually fall off. Being able to ride over S-bends and nudge people off corners to claim victory doesn't inspire proper driving either. With the exception of the ~No Damage~ races, aggression is encouraged - an annoying side effect of which is that the tougher examples of that task end up as difficulty spikes.It wasn't until the ~Hard~ and ~Master~ tiers that they really skewered anything, though. Up to that stage, the AI hadn't given much indication of its talents either. Often filing quietly along the racing line, and annoyingly capable of swerving into you on the starting line, oddly, it's otherwise quite robust - and knows how to take a decent amount of speed out of corners, catching you without cheating.But unless you're playing with Manual Transmission (or perhaps flipping the screen) to up the ante, it's too many hours until that starts to push you. The rigid structure also feels like a step backward, limiting your options should you come up against something you can't beat, while the inconsistent quality of the challenge tasks means there are only a few you'll bother to pursue to gold-medal standard if you don't get there first time. Put that way, it's hard to recommend this over any of its particularly fine PSP contemporaries. OutRun 2006 may be completely different, for example, but it's more expansive and moreish in the medal-hunting department.Still, that game-sharing option should have potential. It's home to some neat touches too - pause the game, and your car keeps on moving around the course at reduced speed, as though it's following a pace car. But we'd argue that only offering one track, coupled with the slightly silly load times and convoluted set-up limit its appeal. 12-player is available if you have multiple copies of the game, but if you're part of a group that devoted to racing games then you can probably just play the PS2 or Xbox version instead. And have done.For all this nitpicking though, TRD3 Challenge is still enjoyable, technically impressive, and attentive to the needs of its fans. The decision to adopt a ~partner product~ approach ought to be applauded, since it instantly raises the game's appeal among people who quite fancy a bit of TOCA on the go and have already spent money on it. People in that category with a fondness for time trials and free races will certainly find it fills a gap. And, if you can put up with some inconsistencies and a bit of axel-grind before you hit the meaty stuff, there's no reason why you won't feel that way too."}