{"ref": "https://www.eurogamer.net/europa-universalis-iii-review", "date": "8 Feb 2007", "game_name": "Europa Universalis III", "text": "Pushed into a tiny handful of provinces, regularly bothered by backstabbing Englishmen to the South and generating barely enough cash to keep the Shetland Islands clean, prospects for 16th century Scotland weren't good. And yet it was the first country to discover and colonise both North and South America. Go figure.Of course, it was cheating a little. Thanks to me, the power behind the Highland throne and bringer of geography from the future, Scotland knew full well exactly where it had to go to discover America. To any other nation, the Scots pouring their entire GDP for about 50 years into constructing one little boat that would sail the apparently infinite ocean blue must have looked like insanity. They grovelled, they begged, they thinned the royal blood with countless foreign marriages - anything to stop other nations invading them. All Scotland had was that one little boat, going nowhere ever so slowly. It was a joke of a country. That was before it found a whole new continent, and promptly filled every inch of it with Scotsmen. And my God, I was proud of it.Europa Universalis looks incredibly dreary, plays agonisingly slowly and is so unforgivingly complicated that I had a panic attack while playing through the tutorial. And yet, it's capable of inspiring immense self-satisfaction. It's a strategy game without any prescribed goals - your victory is what you want it to be. Mine was colonising America with Scotland. Yours might be invading France, taking over the entire planet (all 1700 provinces of it), establishing a merchant empire, or all of the above. It's very, very hard to get into, but its impressive openness means it offers a personal experience very rare from strategy games. The most immediate comparison is Civilization - both posit the player as an ageless, formless national leader overlooking a world map, managing matters of military, economy and diplomacy, and taking an awfully long time to get anything done. Civilization though, that you have to win. Yes, there's some pride in being the fourth-best nation of 12, but you're still a loser really. EU3 lets me win on my own terms.It also made me do a Really Bad Thing.So desperate was I to claim ownership of each American province before the filthy English took advantage of my discovery that I had to take some steps to help my colonists out. I, um, did a little bit of genocide. Ethnic cleansing, in fact. I had a regiment of soldiers touring the continent, deliberately wiping out every last native, so there wouldn't be even the slightest chance of resistance once my pioneers arrived. It was so easy to do - all it required was pressing an innocuous grey button. Every time I did so, 100 people died. I think it's the worst thing I've ever done in a game - I didn't have to do it, and I wasn't punished for it. It was an option, one of a great many the game gave me, and I took it. I could have bought off a load of Cardinals to gain Papal favour, or falsely declared rights to the crown of Munster just so I had a credible reason to invade Ireland. But because my personally-selected goal took the form it did, I was worse than Hitler - and just to increase the chances of a new colony taking off by a few per cent. I'm history's greatest monster, but dammit, I conquered America with Scotland.Once I had, I'm afraid I did start to become a bit bored. The future that lay before me, of gradually growing each of those new colonies to city-size, maintaining global trade routes and researching new economic and military technologies, seemed so immense that it was an effort to continue. My options thereon in were simply too vast - I could pick a fight with someone, or just hang fire until 1789 (when the game ends) and see how I compared to the other nations. Each would take ages, an iron will and an ungodly amount of pratting around in number-filled menus. With a narrow focus, I had a lot of fun; with a broader one, the exhausting amount of stuff to manage and the austere, difficult way it's presented meant EU3 became dramatically less appealing. That it managed to make such an initially daunting prospect as absolutely compelling as it did during my American adventure is an impressive achievement, however. I have no doubt that my next game of it, with a different state and a different personally-selected objective, will offer similarly pleasurable obsession, at least for while.Its trouble is it's a wilfully obtuse game in so many ways. For instance, I could never have discovered America if I hadn't adopted the exploration National Idea. The game only allows so many Ideas to be active at once.  Had I swapped to another (by selecting from a huge grid of squares in a sub-menu), my boats and armies would immediately lose the ability to enter unknown territory. That's slightly ridiculous, and one of a barrage of counter-intuitive elements to remember from a long-winded but somehow still cursory tutorial. There's little in the way of in-game helpfulness either.I worked hard on developing friendly ties with Munster - a royal marriage, a trading agreement, even the occasional backhander. The numbers stated that my relationship with them was 200 - as good as the game allows. And still I'm told that the odds of them agreeing to an Alliance (to help each other in the event of war with another nation) were 'impossible'. Why? I was never told. Presumably it's something to do with each of our existing network of agreements with third-party states, or with Munster's puny military ability, but there's not even a hint to either or any other effect. I couldn't work out what I needed to do to fix it, and eventually bloody England invaded Munster so the option was entirely lost anyway. Bringing up Civilization again (number 4, to be precise), that's a game of similarly massive complexity but one that offers in-game advisors and automation to take some of the weight off your struggling shoulders. This one doesn't care a jot if I'm exhausted and confused.That said, EU3 needs to be hardcore, in a way - it's part and parcel of what it is, and of its appeal to a certain audience. It's deep and complete in a great many of the right ways. It's just that it'd benefit enormously from having options to be friendlier. But once you're in you're in, and beneath that fusty layer of endless menus and cold numbers there's a strategy game of near-unparalleled flexibility."}