{"ref": "https://www.eurogamer.net/sam-and-max-ep3-the-mole-the-mob-and-the-meatball-review", "date": "25 Jan 2007", "game_name": "Sam & Max Episode 103: The Mole, the Mob, and the Meatball", "text": "Episodic gaming might not make business sense for Mark Rein and Epic. It might not even be working out for Valve the way it had hoped, and Ritual's episodic adventure appears to have stalled too. But for Telltale Games, it appears to be working a charm.It is what it is. An episode every month, at a price that makes sense, and roughly three hours of great entertainment every time. Stick it on after dinner and you'll have it licked before an early bedtime.The reason it works in this instance isn't necessarily because the price, frequency or length are right, but for the simple reason that adventure games lend themselves particularly well to being broken down into bite-sized chunks. After all, any linear narrative-based experience has logical 'chapters' to it; all Telltale has done is ensure that each episode reflects the latest 'case' that our favourite rabbity-dog crime-fighting duo are working on.And in Episode 3, we start, once again, in the offices of Sam & Max, with the usual routine of scouring the area with your pointer and talking to Bosco and Sybil (via the usual, simple dialogue trees) in their respective shops before moving onto the main meat of the latest case. It turns out that, in this instance, Bosco is utterly paranoid about the so-called 'Toy Mafia', and has gone to even more extreme lengths to halt the suspected delivery of more unwanted goods. Sybil, meanwhile, has another career change to explain - and one that inadvertently gets her into a whole heap of trouble.Without further ado, you have to go and pay a visit to the Toy Mafia, where you encounter a succession of teddybear-mask-wearing thugs who, of course, deny all knowledge of any criminal activities. Nevertheless, in the confines of the local casino, you get to experience a whole new Mafioso spin on the 'Whack A Rat' game you might recall from the 1993 vintage Sam & Max Hit The Road. After working out how to be an even better cheat than the local card shark, you eventually get given three tasks to complete by the infamous 'mole' of the title - predictably involving death, torture and more than a little misdirection. All in true Sam & Max style, you understand.Without giving anything else away, the puzzles aren't exactly going to hold up an experienced adventurer for very long, but will, at least, make you chuckle along the way. In fact, the dialogue (and the quality of the voice acting) in The Mole, The Mob and The Meatball is arguably the sharpest in the season to date, while the secondary characters are also well up to scratch. And, as with the previous episodes, the ability to complete some of the key puzzles in any order helps give you a pleasing degree of choice when you need it most.On the other hand, the self-contained nature of the episode means that there aren't a great deal of locations - with just four new ones to visit (and the five that also feature in both previous episodes), it's fairly 'light' in that respect, with the familiarity being our overriding disappointment so far. If each episode had an all-new set of locations, we'd be happier than having to revisit portions of the game that we associate with earlier episodes. Clearly it makes it easier to get an episode out every month doing it this way, but at the same time a small but significant portion of the fun of playing point and click adventures gets taken away. Besides, we really like the visual style and animation in Sam & Max. It's a delight to roam around any of the new locations; merely clicking on the random items dotted around is half the fun of the game when almost every one prompts something sarcastic or amusing in return. More of it please.The other point to mention about how we feel about Telltale's episodic reinvention of Sam & Max is to query whether making the puzzles so straightforward is the smartest thing to do. With Bone (Telltale's other episodic experiment), an excellent in-built hint system seemed to allow the team to stretch the player a little more than it appears to be daring to here. On just one occasion in Episode 3 were we in any doubt of the best thing to do next (which was a cunning puzzle, admittedly), but came away, again, feeling that being tested just a little bit more would have made the game feel a little more satisfying.Presumably Telltale hopes to build an audience first, and get a whole new batch of players familiar with the conventions of point and clickers before really laying on the puzzles too thick. Hopefully we can start to see a return of the more involved, challenging style seen throughout the '90s. Part of the 'problem', if you like, is the general lack of locations and objects on your person - inevitably it's not long before you join the dots. But then again, the very reason there are so few items and locations is that Telltale is keeping the size of its episodes small, so it's a bit of a chicken and egg scenario.But before this review spirals off into a discussion about episodic limitations, it's important to stress that Sam & Max's latest adventures are immensely enjoyable chunks of entertainment. So few games display such effortless charm, and even fewer are rammed with as much warm humour. On that basis alone, the chance to sit back and be thoroughly entertained for three hours for $8.95 should more than make up for any other reservations you might have about this pioneering experiment."}