{"ref": "https://www.eurogamer.net/virtual-console-turbografx-16-review", "date": "24 Jan 2007", "game_name": "Reviews", "text": "To the wide-eyed European gamer in the late 1980s, the idea of owning a machine capable of playing arcade perfect ports seemed like a fantasy. But if money was no object, the release of the TurboGrafx-16 in Japan on 30th October 1987 went some way towards fulfilling that fantasy.A collaboration between Hudson Soft and NEC, the diminutive console impressed hardcore gamers with a succession of extremely faithful ports that made most of the popular systems of the era look very dated indeed. Blessed with a 16-bit graphics chip, it had absolutely no problem handling some of the cutting edge coin-op games of the era.A quick run-down of its top titles includes late '80s arcade classics such as R-Type 1 and 2, Pac-Land, Gradius, Salamander, Parasol Stars, Chase-HQ, Galaga '88 and '90, Operation Wolf and more. But although it was very popular in Japan, its chances of reaching its full potential was effectively scuppered by Nintendo's utter domination of the US and Japan at the time, ensuring most publishers remained loyal to the NES (whether they wanted to or not) and never unleashed their teams on what was the most powerful system on the market for a while.Needless to say, its belated European release in 1990 meant that actually owning one over here in the early days required the sort of spare cash that made grown men cry (and young boys dream wistfully). And even when it did get a limited European release, the price and range of games compared to, say, the Commodore Amiga gave it no real hope of having an impact on the mainstream gamer.Still, that said, the Turbografx (as it was known over here, no unnecessary capitalisation required, apparently) retained a hardcore following especially with shoot-'em-up fans, and its appearance on the Virtual Console service has been met with a ripple of excitement among veteran gamers who were either too young or too poor to experience the machine first hand. Of course, the emulator community has had access to its entire back catalogue for the best part of the last decade, but for many, the line-up that appears on the Wii will be their first opportunity to delve into an enigmatic part of gaming's history.And with that, here's what's currently available.Arguably the pick of the bunch on the TG-16 channel, and certainly the first one we wanted to download.Great in single-player and insane fun in multiplayer (up to five players, again), the premise is as simple as it ever was: run around a maze and try to blow up your opponents with your bombs.At first you're limited to dropping one at a time, but once you find some power-ups the insanity level increases exponentially - but also makes it easier to wind up killing yourself in the process.One of those genuine all-time classics that hasn't really dated with age. Go get.Retro rating: Five starsOne of the first must-have titles to appear on the TG-16, Irem's 1987 arcade game was ported to the system in early 1988 and was almost identical to the coin-op - something that was almost unheard of at the time, especially so soon after it was released in the arcades.Like many of the very best side-scrolling shooters of the era, it was immensely challenging, requiring no end of repeat play to suss out its inner workings. Simple in conception and arguably one of the best looking games available at the time (the bosses, in particular, looked mesmerising), it represents the classic 'get the power-ups, destroy everything, kill the enormous boss' affair, but required players to go about things the 'right' way - making it a pretty sobering experience to play nowadays, obviously.For those that invested their lives in this game back in the day, playing R-Type will be a real trip - but for the unwary traveller, expect to have your arse handed to you on a plate.Retro rating: Four Stars.Originally released in the summer of 1988, this Giger-inspired pinball game was hardly the height of next-gen gaming excellence, but seemed to serve as a showcase for the pretty background graphics more than anything.Like most pinball games at the time, the action takes place over two screens, with flippers in both allowing you a chance to rack up a decent score without too much genuine skill or effort required. Far easier than the NES Pinball game, and far better looking, but ultimately an utterly pointless inclusion on Virtual Console nless you're an absolute pinball game fanatic...Devoid of neat ideas, and restricted to just one table (with two tunes to select from - be still my beating heart), this is a game that even hardcore pinball nutters will (or should) tire of after a few minutes. Retro rating: One star.This is more like it. If you're a fan of the kind of simple, absorbing turn-based strategy found in the Advance Wars titles, then you'll appreciate the slow-burn appeal in 1989's Military Madness.Known as Nectaris in Japan, the game is set on the moon in 2089 and basically involves marshalling your units to engage with the enemy and capture their base. Similar in many ways to the popular Intelligent Systems turn-based titles, use of cover plays a crucial role in the face-offs, and even now the game is instantly playable and evidently well designed.Don't be put off by the rudimentary visuals - this is a solid effort, and justifies its place on Virtual Arcade.Retro rating: Four starsApparently the best-selling PC-Engine/TG-16 game ever, Bonk's Adventures was Hudson and NEC's answer to Mario, and enjoyed success at the height of the platform game boom of the early 1990s.You play as Charlie Brown lookalike Bonk, a cave boy who can headbutt his dinosaur enemies, use his massive jaws to the clasp on the side of platforms, and, hilariously, eat big chunks of meat to power himself up. Aside from that it's your typical 'loveable platform romp' with jolly graphics and enough good ideas pinched wholesale from Mario games to make it pretty playable even this far down the line.But with the real deal available on VC elsewhere (and Super Mario World coming this month) this is one for platform completists only.Retro rating: Two starsA vertical shooter that was popular in Japan in 1990, this is one of those games from the era that's appeal seems to centre more on its ability to dazzle you with the ABSOLUTELY MASSIVE gun effects that streak and arc across the screen somewhat unnecessarily.Yes, the visuals are pretty and impressive, especially for the time, but right now the only really important thing is how well it plays, and sadly it hasn't aged very gracefully. It's a solid period piece, slick as anything released at the time, a great bombastic selection of weapons, challenging (but not insane) bosses, and one that has a decent following among the shooter crowd.Even so, a degree of caution is advised before you splash the cash.Retro rating: Three starsOh dear god. The TG-16 wasn't renowned for racing games, and if this is anything to go by it's hardly surprising.One of the first games to come out for the system back in 1987, it bears all the hallmarks of shoddy racing games of the time; opponents which appear in front of you in three stages of scaling animation, poor road effects, horrible handling, garish visuals, the list goes on. If you waste your money on this you'll be mortified.On the plus side, it does have an upgrade/customisation set-up, but it's highly unlikely you'll reap the benefits.Retro rating: One starReleased in 1989, this has more than a whiff of Zelda about it, but with elements of Gauntlet strapped to it.So, yes, it's a top down dungeon battler that gives you the ability to play as a bard, dwarf, witch, thief, warlock, fighter, elf and bishop, and is notable for its ability to support five players at the same time - which is nice, albeit chaotic. Essentially you run around mowing everything down, picking up goodies and eventually facing off against bosses.It's nothing special these days, but one to pick up if you've got nostalgic associations as it's perfectly playable in a mindless way.Retro rating: Two stars."}