{"ref": "https://www.eurogamer.net/virtual-console-sega-mega-drive-review", "date": "23 Jan 2007", "game_name": "Reviews", "text": "It still hasn't really sunk in that we're sitting here playing SEGA games on a Nintendo system. Sonic and Mario holding hands. The mere concept of it bends the laws of gaming physics so far out of shape that it has created a cultural black hole that's busily dragging the past kicking and screaming towards it. The last remaining hope is that these games are strong enough to withstand the force, or else we face the prospect of SEGA's rich 16-bit legacy becoming another footnote in the amorphous mass of gaming history.But this latest chapter in the SEGA story is fairly typical when you look back at some of the struggles the Japanese veteran had to endure in the console market; just look at company's aborted attempts at the SG-1000. Eventually the Master System (as the mark-three SG-1000 was re-marketed as in 1986) found acceptance across Europe and, in particular, in Brazil. But as far as the gaming public of Japan and North America were concerned, it was all about the uber dominant NES - they really couldn't give a flying fig about any other system in the '80s, with astonishing market shares of over 90 percent typical in the latter half of the decade.Somehow SEGA had to capitalise on the success it had been having in the arcades throughout the '80s, and the Mega Drive was designed from the start to make it easy to port its coin-op titles to. In fact, the hardware was used in SEGA's Mega-Tech, System-C and Mega Play arcade systems, so releasing decent versions of all its big games of that era was a given (though the sprite scaling wasn't as good).By the time the Mega Drive made its debut in Japan on 29th October 1988, the NES was already five years old. Needless to say, SEGA didn't have to try too hard to make Nintendo's title look (and sound) ancient by comparison, and with (for the time) great conversions of Space Harrier (in the form of the all-new SHII), (Super) Thunder Blade, Altered Beast and Golden Axe arriving in the early days of the console along with the hugely anticipated follow-up to Phantasy Star, SEGA soon had a distinct advantage to press home.SEGA made the most of the momentum behind the machine, with the North American launch (known there as the Genesis) in August 1989 better than expected. By the time of the Mega Drive's belated launch in Europe in November 1990, the system had built up a solid catalogue of titles, and had little difficulty carving itself a respectable niche as the Master System had done over the previous two years.But it wasn't until the release of Sonic The Hedgehog in June 1991 (incredibly Europe and North America got the game fully one month before Japan) that the system gained mass acceptance. Not since the days of the Atari 2600 had a console been as successful in Europe, and SEGA found itself on a crest of a wave, backed by almost every major publisher in the West. By the time Nintendo got around to releasing the Super Nintendo in Europe in April 1992, SEGA had already built up a strong following - and the eventual release of Sonic 2 in November was arguably the first 'event' release of a videogame. Suddenly videogaming had a media profile again, and it hasn't looked back since.But for SEGA, this was arguably as good as it got. Rather than trump the technologically superior SNES with a true 32-bit follow-up, it tried to bridge the gap and extend the lifespan of the Mega Drive by releasing ill-advised add-ons, such as the 32X and Mega CD. This messy episode is well documented elsewhere, but suffice to say both add-ons were poorly supported, badly launched and expensive aberrations that ensured a sour end to the Mega Drive's existence.What's done is done, though, and whatever business mistakes were made, the Mega Drive left a lasting legacy of top-notch titles that represent some of the best of the 16-bit era. You'd think that this fact would be a cause for celebration on its own, and that we could just get on and give you a straightforward run-down of the titles and get on with enjoying them all over again - but nothing ever seems to be that simple when it comes to discussing games on Virtual Console. The problem relates to the legacy of the differences between PAL and NTSC display standards, and, in particular, the legacy of shoddy ports of NTSC games. Not only were they nearly 17 per cent slower than the 'proper' versions, but featured black borders at the top and bottom of the screen. Unbelievably, the Mega Drive games on the European Virtual Console service have not been converted to correct these issues, so forums are once again awash with indignant gamers ranting like it's 1992.Whether SEGA and Nintendo are working on a 'fix' for this problem is unknown at the time of writing, but it's something that's worth bearing in mind before you part with your cash. It's also worth considering that SEGA is releasing a 30-title Mega Drive Collection on PS2 and PSP on 9th February. Not only will it be a whole lot cheaper than downloading them for almost £6 each on the Wii (as opposed to, err, 57 pence each via that compilation if you buy it for £16.99 on Play), you'll be able to experience them full screen, and at their original speed. Now, why, exactly, was that so hard to achieve on the Wii? Answers in the usual place, please."}