{"ref": "https://www.eurogamer.net/children-of-mana-review", "date": "22 Jan 2007", "game_name": "Children of Mana", "text": "There are certain games whose beloved status one does not question. Towering like mute colossi over the gaming landscape, these pillars of their respective eras leave people misty-eyed, reminiscing fondly; they're the games that tie people to the medium itself. Each of them, in their own way, is a pinnacle of artistry and game design craft, a perfect expression of the feats that the gaming medium was capable of at a certain moment in time.Back in the SNES era, Squaresoft had something of a knack for developing those games. Employing unquestionably some of the finest 2D pixel artists of the day to work alongside designers who were mixing conventional statistic-based combat up with action and adventure elements in new and exciting ways, the studio was on a roll. There were the glorious SNES-era Final Fantasies, which some would argue are still the series' high point. There was the magnificent Chrono Trigger... There was Secret of Mana.Many greats of the era have now adopted a certain, ~oh, I guess you just had to be there,~ air about them, having been largely overtaken in every way by modern games which know all their tricks and far more besides. Not so Secret of Mana, however; the 2D artwork is almost timeless, and the core of the game, a beautifully crafted action RPG system, remains just as entertaining, challenging and downright fun as it ever has been. It's a beautiful game whose place in the annals of all-time greats is richly deserved, and which remains worthwhile even for gaming's habitual Retroskeptics (a group among whom I number myself).It's no wonder, then, that there are plenty of people for whom a properly realised Secret of Mana game on a handheld platform would be a dream come true. Which leads me, after much procrastination (call it bedside manner - after all, you don't expect the doctor to just roll up and tell you that your test results really aren't very good without any preamble at all, do you?), to the first problem with Children of Mana - it's not the properly realised Secret of Mana game it could have been.Instead, Children of Mana is set up as a sequel to the distinctly underwhelming Sword of Mana, a GBA title which robbed Mana of most of its interesting RPG elements in favour of button-mashing hackandslash gameplay. This is the approach favoured by Children of Mana, which is a slavishly traditional dungeon crawler in which the entire game focuses on hacking your way through multiple levels full of foes, with a save point every four levels or so, before taking out a boss and moving on to the next dungeon.Unfortunately, while many games have taken that basic structure and built something really fun around it, Children of Mana seems determined to provide an experience as retro as possible. Hence you can teleport out of a dungeon whenever you like, but you have to start the whole thing from scratch when you do so. You can only save or change equipment at a save point, and they only pop up when you've cleared through three or four levels - which is the cause of some serious frustration, given that the DS is the ~I've got seven minutes before this tube gets to Oxford Circus and I want to accomplish something in that time~ console of choice. On the positive side, Children of Mana does manage to get the thirty seconds of fun principle right. The colourful, well designed characters and monsters bounce around the levels using a fake physics system that's entertainingly chaotic - and the game gives you the unique ability to dual-wield weapons, so you can take two out of the four weapon types with you into a dungeon and operate them independently using the A and X buttons. This is handy for clearing your way through tricky situations, since each weapon has a different attack pattern (the flail's circular sweep and the bow's long-range attacks are especially useful) and combining attacks from two weapon types so easily is a nice touch to the game.The trade-off for the cool weapon system, however, is that the magic system in the game feels crippled and dull. Your magical attacks are carried out by a mana creature who accompanies you on your journey; however, you can only bring one mana creature along at a time. When you summon the creature, you can either leave it be (in which case it will perform an elemental attack on your foes), or go and touch it to get a healing effect or a buff of some description. All of the mana creatures work in broadly the same way, and this simplicity leaves the magic element feeling utterly anaemic. A few hours into the game, we'd pretty much given up on magic for anything other than healing, and even then it was a second preference to just popping a few healing items down our gobs.Unfortunately, the combat system is fun in microcosm but quickly becomes dull and repetitive when it's spread out over hours of play. Levelling up in the game makes little odds to the basics of how you actually interact with your enemies or environments - it simply makes your numbers bigger so that you're able to take on enemies with correspondingly bigger numbers, an accusation often unfairly levelled at RPGs but which sticks like glue to Children of Mana. By the end of the game you'll still be performing the same attacks and being frustrated by the same annoying design features, like having to clear your way through multiple levels again because you died further on in the dungeon. As mechanisms for introducing a challenge go, we'll add that one to random encounters on our big list of RPG features that deserve to be consigned to the last century.If anything, Children of Mana is a fine disproof of the thirty seconds of fun theory; the basic fun interaction of the game completely lacks a decent framework or any kind of development to keep the player hooked. Character progression is purely a case of increasing your stats until the next boss dies, your head explodes or someone shouts ~that's numberwang!~ at you, and the plot is a gossamer-thin layer which tries and fails miserably to hold everything together. There's really nothing to it here in plot terms apart from a few RPG clichés stitched together to make up a painfully short (but padded out by interminable dungeon crawls) quest.Where Secret of Mana got more interesting - and where Children of Mana picks up points - is in the multiplayer mode, which allows you to hook up with other players (local wireless only, no Wi-Fi Connection support) and tackle the dungeons together. This definitely lifts the game for a while, and the wireless connection was rock solid and superbly playable, although we did notice some frame-rate drop off when things got busy. However, the simple fun of blatting enemies with friends again suffers from having little compelling progression to keep you coming back - it's the kind of game you'll play for a couple of hours with your friends, enjoy for a while, and then never bother trying in multiplayer again, but the mode is there, it works, and it's a solid and important part of any Mana game.The other key part of any Mana game, of course, is the presentation - and in this regard, Square Enix are pitch perfect as usual. Children of Mana is a beautiful game, for the most part; Square's talent for 2D pixel art continues to impress, even 14 years after Secret of Mana (yes, it is that long!). Characters and environments alike are colourful, imaginative and varied, while the glorious 2D animation sequences (utilising Square's favourite new trick of making smooth transitions between top and bottom screen during the cut-scenes) are a real high point of the game. The music, too, is excellent - a timely reminder that even the sound chips in a system as humble as the DS can be made to produce magic under the right tutelage.The fact that Children of Mana not only fails to develop on the formula, but also fails to scale the heights of its glorious predecessors, is disappointing - but it's important not to be too negative on those grounds alone, and it's important to point out that this review has spent more time justifying negative points than it has discussing fine aspects like the music, translation, graphics and animation, since high quality in those areas is almost a given for a Square Enix RPG. In finally judging this game, we've tried not to consider it as a stunted heir to the Mana line, but rather as a game in its own right. Unfortunately, it also falls down when considered this way; it is repetitive, uninspired, poorly suited to the handheld format and altogether too staunchly traditional for its own good. Which isn't to say that you won't have fun with the game - on the contrary, the combat system is nicely balanced, it's just that you'll probably be tired of it by the time you're a few hours in. Multiplayer definitely adds value, while the presentation, as noted, is absolutely beautiful. Mana completists and Square Enix fans will probably be glad to find room for this in their swelling DS collections; the rest of us should skip this game, keep our eyes peeled for the tactical RPG Heroes of Mana, due out in Japan this year, and hope for Secret of Mana to pop up on the Wii Virtual Console sooner rather than later."}