{"ref": "https://www.eurogamer.net/far-cry-vengeance-review", "date": "19 Jan 2007", "game_name": "Far Cry: Vengeance", "text": "If you've ever played any of the Far Cry games on other platforms - like the fantastic PC version - you'll be aware of certain key things that define the series. Number one is definitely fantastic graphics; ever since the glorious island environments of the first game, developers have built on the powerful engine to create ever more impressive visuals. Second to that, undoubtedly, is the AI of your opponents, who work as groups and intelligently utilise the cover provided by jungle environments. A third pillar, added more recently in updated versions of the game, is excellent multiplayer support.Those are the three things you expect to find, simply as a baseline, in a Far Cry game. They're not obscure expectations - they're simply what any player would see as core values after a few hours on any of the existing titles.Which leads one, rather uncharitably, to wonder how much time the developers of the first Wii title in the franchise have spent playing previous Far Cry titles. Here we have a game that features utterly dreadful graphics, consistently stupid AI and multiplayer that'll be singing in the boy's soprano choir long after puberty. It's set in a jungle, at least, so we have to grant that at least the team did look at the back-of-box screenshots and go ~ah, palm trees!~ - a key revelation which forms this game's main stylistic relationship with the rest of its franchise.That sounds overwhelmingly negative, and don't get me wrong for a single second - it is. However, there's one shining good point to be dropped into the whole affair, for which many ills are going to be forgiven over the course of this review. Far Cry: Vengeance, for all its many, many faults, is the first Wii game to get first-person shooter controls absolutely, totally right.In other words, what Red Steel and (arguably) Call of Duty 3 failed to do, Far Cry has managed. The game utilises a simple control mechanism that moves your crosshair around in the middle of the screen and then allows you to move further in any direction to tilt the viewpoint. Movement forwards and backwards, and strafing left and right, is on the control stick of the nunchuk; to jump you flick the nunchuk, to throw a grenade you hold in the trigger on the nunchuk and make a tossing movement (watch it), which Far Cry actually interprets as a throw with strength varying according to the motion you make. Pull the B-trigger to shoot. Marginally more complex - but surprisingly natural after the first few tries - is the zooming motion, which requires you to poke the Wiimote towards the screen, with a second poke pulling back. It sounds awkward, but it actually works.That's it for the basic controls - obviously there are more for weapon selection, locking the viewpoint and so on, and a slash of the Wiimote at any point tugs out a machete for a quick hacking motion - and here's the crux. They work. Whatever unkind things we may say about the developer's other efforts, the chaps designing the control system deserve a hearty pat on the back, because they've created a system that works reliably and is genuinely fun to use. The crosshair doesn't drift about because your viewpoint is moving unintentionally while you try to shoot; circle strafing and quickly moving the view are simple and easily mastered; the simple act of shooting enemy soldiers is suddenly fun again in a way that wouldn't have been possible with an analogue control stick. From the point of view of pure interaction between the player and the game, Far Cry is a joy to play, and that alone will drag you through several hours of the game.I say ~drag~, though, and I mean it. Unfortunately, aside from the well-conceived and extremely well polished control scheme, the rest of the game is a haphazard and unfinished rush-job whose shoddy nature is genuinely eyebrow-raising at some points. The high point of the presentation is some nicely designed menu systems, which make good use of the Wii controller as a pointing device. Sadly, it's all downhill from there.When you launch a new game - and occasionally at key plot moments, in so much as the game has any semblance of a plot - Far Cry decides to treat you to some rendered video sequences. These look for all the world like placeholder art; they have been created using in-game models, but bizarrely compressed into video that's lower quality than in-game graphics by a substantial margin. It's muddy, ugly and looks as though it's travelled through YouTube's hideous video system a few times - it's no exaggeration to say that we've seen better full-motion video on the Nintendo DS recently. In fact, it's positively a relief when you're dropped into proper in-game graphics - they look great by comparison to the awful video.Perhaps that's the point, because the in-game graphics don't look anything other than completely bloody awful by comparison with anything else out there. By showing you crap video first, at least your standards are lowered so that the game's visuals don't feel so much like someone has started injecting liquid faeces into your eyeballs - a shielding effect which, sadly, wears off after a few minutes. Far Cry: Vengeance, in case you haven't got the message yet, looks awful. It looks dreadful next to every other Far Cry game; it looks dreadful next to the PS2 games I've been reviewing recently; it even looks utterly dreadful side by side with some of the better GameCube titles out there, as a housemate's current adventures through Eternal Darkness reminded me. On a system significantly more powerful than the Cube (best estimates place it somewhere north of the original Xbox on the chart), it's laughable.While the draw distance is relatively long, the sole saving grace of the graphics, items and foliage pop in right in front of your face. Everything is blocky and chunky, and the shadows of buildings look so unlike shadows that at one point I stared at a net-like object on a beach before realising it was meant to be the shadow of the suspension bridge above. The water, usually a Far Cry high point, is a pixellated texture; swimming in it is so murky that it feels like playing Turok on the N64 - while wearing a pair of fogged up sunglasses. Enemies, meanwhile, are pretty much carbon copies of one another for the majority of the game; the generic and borderline racially offensive soldiers you encounter early on, who shout loudly in voices clearly recorded by someone aiming for a midway point between Charlie Chan and Rambo's hapless foes, will still be your main cannon fodder many hours later.However, at least introducing the cannon fodder to the cannons is quite enjoyable, in a fairly basic sense. The game sports a large arsenal of weapons and isn't stingy about handing you new toys to play with on a fairly regular basis; to top off the weaponry, there are also quite a few vehicles that you can drive around, including both land and sea craft. It's not quite the ~if you can see it, you can drive it~ freedom we'd like, but opportunities to wreak havoc behind the wheel (or handlebars) of a vehicle are liberally peppered around the levels, and once you work out that fixing the viewpoint is the only way to drive around without hitting every tree in the jungle, they're a fine addition to the game.These amusing asides become all the more welcome when it becomes clear just how thick the enemy AI in the game is. Much like the graphics, the AI is a throwback to a bygone era; here we have enemy soldiers that just stand around while their comrades are being shot down right next to them, who stop in the middle of firefights and stare at you for ages, begging to be shot down, and whose best response to an enemy threat is to run at it shouting tired old catchphrases with all the Rs and Ls mispronounced. Never mind more recent advances in the genre like Halo, Half-Life 2 or even Far Cry itself; this is like the original Half-Life never happened, and the last major step forward in FPS gaming was Duke Nukem 3D. Still, at least shooting them in the head is still fun; perhaps you could enhance the fun-factor by playing a mental game where you pretend that the reason they're all so stupid is because the island's soldiers are entirely recruited from the readership of the News Of The World.The other hook of the game is the Predator mode, which was introduced in earlier Far Cry games but is sadly introduced here as though everyone should already know what it is and how it works - a critical misunderstanding of the Wii's target audience, we can't help but feel. That said, it's rubbish anyway. The lovely control system breaks down utterly in Predator mode, which pulls out your field of vision so you feel like you're running around like a loony and totally out of touch with the control system. Besides which, the melee kills in Predator mode are far less fun than just shooting people in the head. Perhaps in recognition of this, the developers left in a handy use for your ~Predatorine~ (a gauge that fills up as you fight) that doesn't require using the annoying Predator mode; shake the nunchuk from side to side and you use up slots on the gauge to regain health.The final factor which we listed as missing in action is the multiplayer mode of the game, which was satisfyingly comprehensive in other iterations of Far Cry. In this case, it's not actually that it's missing in action - it's turned up for duty alright, but it's missing quite a few vital organs and limbs. In fact, multiplayer here is restricted to a rather sad two-player split-screen mode which is even more flawed than the single-player offering - not least because it adds crippling framerate issues to the already tragic roster of graphical flaws suffered by the game.The Wii has one great FPS game to its name; unfortunately, that game is spread out over three distinctly disappointing titles. Combine the look and feel (and swordplay) of Red Steel, with the atmosphere, superb presentation and wonderful level design of Call of Duty 3, and pull it all together with the perfectly honed control system of Far Cry: Vengeance, and you'd have an amazing game. Right now, though, this is a mess. It's terribly badly presented and utterly lacking in the areas which make the Far Cry franchise great - but through all of that shines a genuinely good, easy to learn and downright fun control scheme. In deciding on a final mark for Far Cry, it would be easy to weigh up all the things which the game gets wrong and decide that they balance out harshly. However, it's impossible to escape the fact that playing the game was actually quite compelling, in a sense; at no point was it an unpleasant game to play, it's merely completely retrograde in several key areas and lacking any sense of presentation or style. It's an ugly game, but one which, crucially, works as a game at its most basic level - which, to my mind, weighs heavily against the problems it has in most other areas. Be warned, though, that the just-about-average score is not even a particularly cautious recommendation - rather it is a tip of the hat to the key things that Far Cry does right, and a note of hope that better made games in future will learn from its successes rather than falling foul of its failures."}