{"ref": "https://www.eurogamer.net/bliss-island-review", "date": "18 Jan 2007", "game_name": "Bliss Island", "text": "Despite the success of Net Nanny, the Internet continues to turn everything upside down, all day long, often in front of the kids, and just as often against the odds. Instead of lining their copper pairs with gold, the ubiquity of broadband has sent phone companies into a mad panic. Instead of drowning among the proles, our maligned TV heroes have been reborn as cyberspace heroes. And instead of relegating simple games to the hyphenated subdomain of anonymity, it's proven a springboard to wider fame, whether it's Cloning Clyde on Xbox Live Arcade or, as we see here, Codemasters' attempt to wrestle money out of office time-waster Bliss Island by sticking it on the PSP.A collection of nine mini-games (or perhaps ten - but more on that later), Pom Pom's com-pom-pilation, as I like stammering it, is about pointing with the analogue nub and pressing X or circle to direct puffs of air. So directed, these precise puffs fire fluffy balls at flowers, fire fruity balls into the mouths of hungry monsters, fire fluffy balls into billiards, fire fluffy balls into brick invaders, fire fluffy balls at musical crustaceans, fire fluffy bees around a racetrack, and fire fluffy balls through platform, stone-stepping and floaty side-scrolling fluff-courses. It's somewhat fluffy, and the kitsch graphics give it the look of a sort of weird, anthropomorphic mophead-mutant Pixar film, albeit one done by one of those crap studios who can barely spell ~John Lasseter~ let alone lick his boots. But I digress.Obviously it's still not clear what it is, despite my describing everything you ever do in it, but that's actually deliberate. See, the tasks themselves are very simple, but they don't half faff around with the instruction. For example: ~Hoshi enjoys the challenge of smashing the bricks as they crash down the side of the mountain. Use Hoshi's puffs of air, to move the brick ball in the direction the arrow is pointing. Don't let the brick ball fall off the bottom! Use the brick ball to hit the brick invaders. Destroy three of the same coloured bricks in a row. Don't let the bricks reach the bottom of the screen! Don't hit the angry bricks! Otherwise it's a strike and three strikes it's game over!~I'm not even sure I understand what that says now, but I do know that, like the eight other games, it was glaringly obvious what to do within about seven seconds of loading the actual level: blocks descend, whack the smiling ones, don't whack the frowning ones, repeat.Each of the games initially has to be unlocked in Adventure mode, which lays out the rules in the above-mocked fashion before prodding you through. Typically you get three chances to not mess up for each of these, and any of said messing up involves starting the level again. Once you've unlocked all nine games, you can play them in Challenge mode, or you can keep going in Adventure mode, where the games repeat and the levels toughen. There's also a two-player wireless mode, where three of the nine are available, plus ~Fluffy Football~ (yes), which is a variation on the billiards game, which isn't really billiards at all but which shares some common ground. All of which would be more interesting to you, I suspect, if Bliss Island supported game sharing, which it doesn't. Which is useless, then, unless you live in a gated society, throughout which live lots of the descendants of, er, Whichy Which.Unfortunately the quality of the games is inconsistent. The ones based around puffing balls up an incline to whack things like flowers, or to feed them into the mouths of furry monsters, work well thanks to well-implemented physics. Elsewhere the bee racing is a bit manic, and more fun with a friend (if you can find the other person who bought this, anyway), but many of the others are either too short-lived or too harsh on the player. There's one where you have to repeat musical sequences by bashing weird jellybean crabs. Except I am not five. There's also one that involves hopping between rocks in the sky collecting stars, which is sort of like an analogue multidirectional Frogger but devoid of charm or urgency. Like the floaty side-scrolling one, which is a bit like bouncing a bubble through a meatgrinder, there's immediate appeal that immediately vanishes the first time you die and realise that you're not only going to be docked a life, but also sent back to the start, with all the things you've already collected reinstated. Dim.It's that sort of thing that negates any goodwill I might have for the quality of the controls, ported expertly from the previous mouse-based system. Equally damning is the lack of a restart option in Adventure mode. If you're obviously going to fail, or think you messed up the start, then that's what you'll want to do. If you do fail, that's what you'll actually do anyway. So why not offer it? It's there in Challenge mode.Niggles aside, there's nothing particularly wrong with Bliss Island. It looks like a low-budget PC game, but then it is. It plays like a low-budget PC game, but then it is. Puffing fairly competently onto the PSP, it's the sort of game where, if someone bought it for you, you wouldn't punch them in the face. It's inoffensive. But for all its plodding serenity, it's never going to be the first thing you reach for ahead of a long train journey, or even the fifth, and that's because ultimately there's not a lot of substance here, when you scrape away the hot air, and peer beneath the fluff."}