{"ref": "https://www.eurogamer.net/new-rally-x-review", "date": "18 Jan 2007", "game_name": "New Rally-X", "text": "There are innumerable retro classics that instantly warrant a place on Xbox Live Arcade. Now and then we sit down over a few pints and get all dewy eyed about the past and reel off a giant list of all those all-time greats that we'd love to revisit. Never once has New Rally-X appeared on that list, and yet here it is, shining proudly as the latest ancient title to be dusted off for the Xbox Live Arcade treatment.Released way back in the arcade boom years of 1981, its continual reappearance on the five billion Namco retro compilations put out over the past decade has been mystifying enough. Despite reportedly being a big hit in Japan and 'modestly' popular in the rest of the world, it certainly never featured in any of the bustling arcades I used to visit as a pre-teenager, if that tells you anything. But despite its charming simplicity, it just doesn't have the iconic, evocative charm which oozes out of the many classic arcade titles that Namco issued around that era, such as Galaga, Pac-Man, Xevious and Dig Dug. And yet here we are in 2007 and most of us old-schoolers have managed to accumulate at least three copies of the flippin' thing by osmosis, and have probably acquired a MAME Rom to boot. Just to make extra, extra sure, Namco has somehow convinced Microsoft to slap it up on its expanding download service for the princely sum of 400 points - but you'll see all you need to see on the free trial download.At times like this you really wonder what the XBLA selection criteria involves, and why Microsoft imagines that releasing (maybe) one game a week via Live Arcade is going to be enough to keep people interested. By comparison, in the past four weeks Nintendo has released around 35 games on its Virtual Console service - a hugely interesting feature of the Wii we'll be taking a regular in-depth look at very shortly.Anyway, back on topic, New Rally-X isn't a bad game. It's just not one that's going to keep you entertained for more than a few rounds before you get utterly tired of driving a little car around a top-down maze and collecting 10 flags before your fuel runs out. It's not really the game's fault - this is 1981, remember, and it ran on Pac-Man hardware - but the charming simplicity soon wears a bit thin as you duck and dive around a series of mazes trying to outmanoeuvre the red cars that try to chase you down.If getting a high score's an attractive option, then you can aim to collect the special (flashing) flag first to ensure that the value of everything you pick up from that point onwards is doubled. In itself, this presents a bit of an extra challenge as you run the risk of either running out of fuel or being cornered by your pursuers. At the start, this isn't such an issue as there aren't too many red cars making chase, but with each additional round comes another 'chaser'. In your favour you have a little mini-map to alert you to any nearby enemies, as well as the ability to fire a smoke-screen at them if they're getting too close. This sends them spinning off for a few seconds and helps gives you a bit of breathing space, and once you've cleared all ten flags the whole process starts over.With some of the most basic sprite-based visuals of any retro game, probably the most impressive element about New Rally-X at the time was the presence of a large, smooth-scrolling play field - something of a novelty at the time. It also featured a bonus stage (which was essentially much the same as a regular course except the red cars don't move until you've run out of fuel) and a little ditty that played throughout, but apart from that it was a relentlessly simple game with few frills.Of course, its arrival on XBLA means that the real hardcore fans can prove their mettle via the online worldwide leaderboards that accompany each and every XBLA effort, but you knew that anyway. As with all the Namco re-issues, there's no attempt to enhance any part of the offering, with no updated visuals or audio or co-op modes and the like. It matters little, but what you're left with is a game that you'll doubtless play a handful of times and possibly never return to.As usual, it's pointless damning a game for being old, and hardly worth grumbling about an old game being sold at a cheap price. It's not really a question of whether New Rally-X is worth buying again (it isn't), but whether Microsoft is doing itself any favours drip-feeding games that hardly qualify for legendary status. New Rally-X is fun for about ten minutes, but that's all, and for the price that's just not enough."}