{"ref": "https://www.eurogamer.net/r-warioware-gba", "date": "8 Jan 2007", "game_name": "WarioWare Inc.", "text": "Wario Ware is one of the simplest games we've ever played. The wafer-thin premise is that Wario has decided to cash in on the popularity of videogames by starting up his own developer, and - for some reason - the player has to move across town playing through a series of the townfolk's five-second long minigames using the D-pad and A button for control, culminating each time in a protracted boss fight of a minigame and eventually coming head-to-head with the master designer himself. He'll smack ya.The games are split into groups of 10, 15, 20 and so on, and the player has to successfully overcome each group without losing all four lives. And because the order in which you play the games is randomised, and each group is picked from a larger selection, you'll have to do more than just memorise button combinations at five-second intervals.What makes it interesting, though, is that you're given no warning about the control scheme for any given minigame. All you get is a one or two word instruction, like ~Shake!~ or ~Jump!~ and you have just five seconds to figure it out and complete it, or else a life will be deducted and you'll be one step closer to starting over. As the game wears on, you'll have even less time, and the breathers between each game will shorten as well, forcing you to rely on intuition. If your reactions are a bit sluggish, then this definitely isn't for you, but for everyone else it's perfect.In order to keep the overall game fresh as you soldier on through various distinctly Japanese sideshows, the developer has dressed the game up with peculiar, off-beat ~cut sequences~ that introduce you to the various characters behind the games, and their personalities are used to shape their challenges. Afro-laden Jimmy, for example, is a ~groovy disco dancer~ who focuses on sports games, whilst cab-driving duo Dribble and Spitz lean towards fantasy games, and ~old school grade schooler~ 9-Volt picks from various Nintendo classics for his inspiration. Snippets of action from his section of Wario Ware can have you popping fowl in Duck Hunt, walking Link into a cave, collecting mushroom power-ups in Mario Land and even connecting blocks in Dr. Mario.The less familiar games veer from the wonderfully imaginative (threading a needle, catching bugs with a lizard tongue, avoiding blowholes on the back of a whale) to the thoroughly derivative (BreakOut with a human paddle, hungry hippos with mad frogs, jumping over an wheeled adversary), but they're rarely less than fun, and as the game throws sped-up and remixed versions at you later on, with awkward pauses, jumping enemies and other concentration-breaking efforts, it retains a lot of its early magnetism in spite of recycling. Something Nintendo no doubt wishes a lot more of its GBA releases could do.Even the boss stages, which offer a more prolonged challenge, manage to retain the obscurity of the rest of the game, from the easier punch bag and boxing challenges to the tougher nail hammering and laser-eye block-shooting efforts. And like the rest of the minigames, you can play them all individually in ~grid~ mode, as they speed up, slow down and generally increase the difficulty to try and throw you off the ride.That's what Wario Ware really is: a gaming rollercoaster. It's dementedly random on the surface and tough to hold onto, but it's been designed specifically to keep you plugging away. It just never lets up. It has plenty of variations on most of the games, which are available to repeat players through the ~grid~ screen once they've been completed once; the ability to unlock a lot of the more addictive games as lengthier alternatives (directing a paper aeroplane, or skating left to right past an onslaught of obstacles, to give you an idea); various other alternative play modes (like trying to complete as many games as you can in succession at a slower speed, or doing the boss fights in succession over and over for as long as possible); and even multiplayer options.In fact, we spent some time yesterday toying with link cables and so on before we realised that we were complicating matters unnecessarily. The multiplayer modes in Wario Ware are played on one screen, with one player on the left shoulder button and one player on the right. This split-screen approach may not work terribly well (or even at all) with the old GBA, but on the SP you can have plenty of fun hurdling, collecting stuff quicker than your mate or playing office favourite ~Dong Dong~. This peculiarity gives you control of a horizontal bar which moves up and down your side of the screen at varying speeds, the idea being to knocking any of three blocks in the centre column out of place and onto the opposing player's avatar before they can do the same to you.If we had to fault Wario Ware, we'd probably argue that the lengthy animated sequences are a bit forcedly wacky and didn't really do anything for us, but as you can skip them on subsequent attempts it doesn't seem all that important in retrospect. Other than that it's impossible to fault the presentation. The graphics may look functional but the cardboard cutout character look is very deliberate, and the quirky humour underlying the rest of it translates surprisingly well from East to West. The soundtrack, too, is up to Nintendo's usual Mario family quality, and will have middle-aged mothers and elderfolk grimacing wearily in your direction on any public transport system you may care to mention.Unlike a lot of GBA games, Wario Ware overcomes its potential brevity with a meaty selection of bonus games, and offers so much in one package that it's always going to happily occupy that slot should you feel like slipping the GBA into your pocket as you slide out the door. It may contradict the relaxing weather we're enjoying at the moment, but we'd happily sweat our way through a T-shirt drawer if it meant the difference between sunburn and playing Wario Ware.If variety is the spice of life, then Wario Ware is the digital equivalent of Phall curry, burning the inside of your face [it'll be more than your face that's burning after a Phall! - rueful Ed] with its charm and originality, and deservedly severing a few crisp bank notes from your wallet in the process - even if it does still plunder the crevices of yesteryear for a lot of its gaming content. Buy it or we'll smack ya."}