{"ref": "https://www.eurogamer.net/monster-4x4-world-circuit-review", "date": "19 Dec 2006", "game_name": "Monster 4x4 World Circuit", "text": "Ubisoft really does have the most massive crush on the Wii. Nintendo's demure little debutante certainly has its suitors - EA, Activision and SEGA, to name some names - but they've mostly chosen to play it cool, sidling up to the virginal young console and offering it some idle chit-chat, dropping a franchise name or two. Not so the lovestruck Gallic publisher. Unreserved as ever, Ubisoft is capering and fawning around the Wii like an obsequious courtier, opening doors, pulling out chairs, producing bouquets of flowers from behind its back, and generally throwing its oversized seven-game greatcoat down in the muddy puddle of launch week.~You're short an original, mature-themed franchise, you say? Here's a little something I prepared earlier. Your own platforming icon's running a little late? Why, take mine! You need some stealth and shooting? I've got more than I can use - think nothing of it. And some racing games? Oh...~(Rummages in pockets)~Er, give me just a minute...~(Embarrassed laughter)~Now where did I put those things?~(Blushes deeply)~Will these do?~By its own admission, Ubisoft's racing stable was never of the highest pedigree. And so the best it can manage for its new sweetheart is Monster 4x4: World Circuit, a port of an Xbox arcade racer so undistinguished it was only released in the US (where nobody noticed it anyway), as well as the supposedly more serious GT Pro Series, of which more later in the week. They both come bundled with a small 'steering wheel' in black plastic which clips around the laterally-held Wii remote, giving it a bit more heft and a more solid grip. It's a surprisingly well-made add-on, but ultimately pointless, and in the long run the extra weight makes the remote more tiring to use.Monster 4x4 is a straightforward caper around a series of thunderously unsurprising jump- and hazard-laden tracks in unrealistically fast, ridiculously styled monster trucks (mini, school bus, fire engine, A-team van etc.). Nitro boosts are available either as instant pickups, by performing stunts, or from your rechargeable nitro reserves - the latter triggered amusingly, if a little haphazardly, by thrusting the remote towards the screen. Weapons come in the form of homing barrels that appear on the track and can be punted at trucks in front, whereupon they explode in a variety of different horrible colours, but always with exactly the same effect (slowing opponents down a bit).It's all thoroughly predictable; a little part of you dies every time you skid boringly across an oil slick, or smash tediously through some balsa-wood trackside furniture. The basic but cheerfully bouncy physics ease the banality a little, as does the gesture stunt system; mid-air 360s, barrel rolls, somersaults and others are performed by moving the remote in quick circular motions when you hit a ramp. The more precise your motion, the better the speed boost and the point reward; not rocket science but a neat touch nonetheless. Points aren't needed to win, but tot up towards upgrades for your trucks.The only surprising thing about Monster 4x4 is how little it does wrong. It's a game so unadventurous, so thorough in its mediocrity that it's just as hard to fault as it is to be impressed by. The graphics are crude and ugly, but consistent, colourful and fast. The gamey hard rock muzak is tinny, but the engine sounds have a meaty throb. The track design is profoundly uninspired, but completely unbroken. The motion control feels a little unresponsive, but never actually lets you down. The four-player split-screen mode could use some extra slots for AI racers but serves up a close, knockabout race all the same. The multiplayer mini-games - football, vehicle ball, a basic arena combat sort of thing - are absurdly underdeveloped, but will provide a few laughs for a few goes. It's sort of, you know, fun. A bit.If Monster 4x4 were a budget release - and if the extremely similar, inevitably superior Excite Truck wasn't around the corner - you might not even hate yourself if you'd come home with it. These are the Wii's launch days after all, the lean times, when the novelty of a new console (not even taking the controls into account) can give almost any game a temporary sheen of excitement. But beware. After a jovial couple of hours in its company the scales will fall, and what had just seemed an unpretentious, unassumingly enjoyable videogame becomes a kind of existential nightmare of averageness that it's impossible to play for a minute longer. Monster 4x4: World Circuit is the definition of the lowest common denominator.Poor Ubisoft. Such a demanding new belle, she wanted so much, and there was so little time. Better luck next time, eh?"}