{"ref": "https://www.eurogamer.net/contact-review", "date": "19 Dec 2006", "game_name": "Contact", "text": "It's easy to get jaded as a games journalist. If you think you play a lot of games, think how many games the average reviewer gets through. And think about what it's like to have to play games to deadline, worrying how you're going to come up with another devastatingly clever and unique piece of insight that will distinguish your review from all the others out there. Think about getting so many free games that if a game doesn't amaze or astonish within about ten seconds it's on to the discard pile, never to be played again (or, if you're less scrupulous, on to eBay for a quick buck). Imagine playing so many games that you can only see Gears of War as yet another underwhelmingly brown/grey gruff-voiced third-person shooter, or Shadow of the Colossus as just a boring sequence of tediously lengthy boss battles.Yep, it's easy to get jaded as a games journalist. So when a game like Contact comes along, a game fizzing with ideas and bristling with a smart postmodern attitude, it's actually pretty exciting. It starts with the manual, which is laid out as if it's a weblog - so it comes complete with a 'VirtuaDiary' (sample quote: ~It seems a device called the 'DS' was able to pick up my signal.~), a 'Fun Survey', and knowing references to memes. It continues with the opening menu, which resembles a close-up of a keyboard's function keys, and it persists throughout the game with all sorts of clever intertextual references, and continual acknowledgement of the fourth wall.Indeed it's so clever you'll probably need to look up words like 'intertextual', 'postmodern' and 'semiotics' over on Wikipedia just to understand how clever it is. Even if you don't, you'll surely get the reference to the Genji meme when you're told to hit a boss's weak point for massive damage, and surely you'll spot the sly digs at the Microsoft Windows autoupdate feature. Heck, there's even a whole island of electronic games and the nerds who play them called Habara (almost Akihabara, see?). There's not been a game this entertainingly knowing since Bangai-O, which is almost what you'd expect a game developed by the same whacked out developer as Killer 7.~Oh, but what's the game about, and is it any good?~ I hear you ask (there goes that fourth wall again). Well there's the rub. Because in many ways it's actually pretty disappointing. You play as, well, you, and your job is to help The Professor and his space dog Mochi recover some missing power cells by directing his assistant, a young boy named Terry. During the game The Professor stays on board his space ship, depicted on the top screen in a beautifully pared down isometric style. Meanwhile, Terry engages in typical action RPG behaviour down on the bottom screen, rendered in a more conventional, realistic style. And over the course of the game it becomes increasingly clear that The Professor's got a secret he's not sharing.There's a whole load of neat mechanics in the game. Terry can discover different costumes that grant him various abilities, like lockpicking, fishing, or cooking, and he can pick up various different types of weapon. His 30 different statistics level up continuously, simply through use, the same way as in the Elder Scrolls series. And there are interesting concepts, like the fact that it takes time for Terry to digest food and healing items, or the way you can play around with Mochi while the game is saving, to make him more powerful when he occasionally helps out Terry during battle. And there are other power-ups called decals, which you peel off, Panini-like, using the stylus, before sticking them on Terry or his enemies to produce various effects, from transforming enemies into cows to granting Terry a stat bonus.But the mainstay of the game is simple combat and exploration. And that's where it falls down. Combat is totally basic: you just hit a button to enter a combat stance and wait for Terry and his enemy to trade blows. Exploration is just frustrating: wander through dungeons, fight a few enemies, find a boss, discover he's too hard to handle, backtrack, grind out battles against enemies to power up stats and obtain umpteen healing items, backtrack, beat the boss, find the cell, and start the process again. Or backtrack some more. It's not totally rubbish and boring, but given the way the game sets your level of expectations so high, it does feel like it for a while. Still, if you can bear the disappointment, and push on through, you'll realise that, between the whole intertextual thing and the interesting-but-average RPG mechanics, there's still a decent game in here. It's just a shame it's not the amazingly brilliant one it could have been."}