{"ref": "https://www.eurogamer.net/r-fsrladuel-psp", "date": "15 Dec 2006", "game_name": "Ford Street Racing: LA Duel", "text": "In making the leap from joypad to handheld, the perennially unremarkable Ford Racing series finally has something to crow about - it's one of the few games to actually expand during the transition, rather than being crudely chopped down to size. That's not to say that the flaws apparent in the most recent console edition (which I also had the honour of reviewing) aren't still present and incorrect but, for what it's worth, if you were ever tempted to give the series a spin, this would probably be the best version to try.Exclusive to this version are six new Ford cars, bumping the garage roster up to a respectable 24 vehicles, while seven new tracks have also been included, making for 37 in total. Despite this generosity, the game itself is pretty much the same as the PS2 version from earlier this year, which makes it very tempting to just cut and paste huge chunks of that review. That would be devastatingly cheeky, of course, so I'm forced to say the same thing using different words.With its not bad graphics, passable track design and acceptable handling, the core problem which has blighted Ford Racing since its debut remains intact: it's not exciting. It is the most middle of the road racer around. Never so bad that you throw up your hands in despair, never so good that you feel compelled to keep playing. It's simply... there. Functional. Practical. As dull as digestive biscuits, dunked in weak tea.Guiding a car around a course is something so ingrained in our gaming DNA that, without at least a spark of adrenalin, it's very easy for your brain to just disengage leaving your thumbs to play the game on auto-pilot while your higher intellectual functions grapple with more exciting tasks, such as remembering what time Tesco shuts. The uninspired course designs here seem to actively encourage such mental laziness, their predictable corners and generic urban backdrops offering nothing for your imagination to latch onto. Even in the midst of what would normally be a nail-biting neck and neck dash for the chequered flag, you're left curiously uninvolved. With no va-va-voom to speak of, there's precious little incentive to keep plugging away around the same tracks, all in service of... unlocking more tracks.Structurally, everything is much as you expect. Arcade races let you choose the vehicle and location for a three-lap challenge, but victory earns you nothing beyond the mild flutter in your stomach you get for completing any simple test of hand-eye co-ordination. Quick Race is exactly the same, but randomly assigns you a car and track, thus saving you those agonising seconds spent selecting menu options. That'll be why it's ~Quick~, I suppose.The one glimmer of originality in the Ford Racing set-up is the Team Racing mode, introduced in the latest console edition, and it remains an intriguing idea poorly implemented. In the console version it put you in charge of a three-car team, allowing you to switch control from one to the other in order to work your way up the pack. The number of cars has reduced to a more manageable two for the PSP, but the potential is still squandered by the game's biggest Achilles' heel - some bargain basement AI that does a great job feeling artificial, but fails to convince on the intelligence front.As you'd expect, team racing relies heavily on the idea of two vehicles racing in unison, blocking and flanking other cars in order to both achieve high ranking positions. Naturally, this requires teamwork - and that requires the ability to react to a situation intelligently, something these buzzing drones singularly fail to do.Just as in the console version, the other cars are tedious slaves to the racing line. First time out it's easy to believe that the rival cars shunting and jostling you are doing so out of directed aggression and competitive purpose. Oh, the challenge! Only when you play with an AI team mate - and find they do the exact same thing - do you realise that you've simply strayed into their preferred path and, rather than reacting to your presence, the cars are simply slamming into you because you're in their way. Should you fight back, and knock them off course, they simply click back into the racing line and carry on as if nothing happened.But it's not just a question of shuttling from one car to the other. There are numerous orders that can be given to your team mate when not in direct control, but ~try not to lose~ shouldn't need to be one of them. Time after time you'll work a car into pole position, only for it to plummet down the pack the moment you switch away. Rather like having a racing duo made up of Michael Schumacher and a confused monkey, this makes it rather hard to develop any race-long strategy or employ any serious tactics. I can understand having these cars not try to automatically force their way up the pack, since there are situations where you want to keep the vehicles together, but it'd be nice if they were at least able to hold their position. As much as the idea of tactical racing appeals, it's hard to avoid the fact that the Ford Racing engine allows for as much independent thought as the average Scalextric set.While this bone-headed AI makes the Team Races an absolute chore to win, it does mean that the Solo races are an absolute walkover - with your opponents reduced to the level of mindless drones, victory is merely a matter of memorising each simple track, and then using that knowledge to shave seconds off while the other cars go through their predictable turns. The reward for your endeavours is just more of the same, so it's something of a mixed blessing, really.Compounding all of these omnipresent niggles is the drab, flavourless presentation, sucking what little drama you manage to generate out of the races. While the gameplay favours neither the carnage of Burnout nor the precision of Gran Turismo, the inclusion of Street in the title, and the woefully inaccurate LA Duel suffix, both position the game as gunning for the Need for Speed crown. It simply doesn't have the snotty Redline attitude required to pull it off and, in attempting to play with the cool kids, ends up an out of touch and misguided exercise - a game that would clearly be happier taking a Mondeo on a Sunday afternoon drive to the garden centre than tearing up the midnight tarmac in a souped-up Focus with a bevy of council estate slappers.So, another adequate yet uninspired entry for the Ford Racing brand. Weak-hearted gamers who need to avoid undue excitement may be happy to see it return but, with at least five preferable racers already on the PSP shelf, the only reason to give this a chance is the low price. Even then, it'll probably be the least interesting twenty quid you'll ever spend."}