{"ref": "https://www.eurogamer.net/r-ffiii-ds", "date": "14 Dec 2006", "game_name": "Final Fantasy III", "text": "Excuse the unpleasant analogy but Final Fantasy III DS, which has never previously been released outside Japan, is your grandmother in the aftermath of a miracle TV-makeover. She's had her face sculpted back to 18-year-old porcelain perfection, skin ironed so as to wipe away the wrinkled scrawl of merciless, advancing years. Her tweed, sensible trousers have been tailored down to rude mini-skirt; granny stockings swapped for provocative fishnets and that blue rinse bob repainted blonde, flowing and coyly curled. The transformation is terribly impressive for the cameras and, y'know, you kinda fancy her for it, but still... something is definitely Not. Quite. Right.Similarly, Final Fantasy III DS might always be pretty, but it's rarely beautiful - the potential pitfall being that, if we're honest, boys like us always have a tough time distinguishing the two at first.Initially, you'll be wondering who upgraded your DS with the ability to display PS2-quality full motion video and perform soaring (if tinny) orchestral soundtracks. The game's astonishing introduction sequence is the sweetest of eye candy and you'll gawp as it hopskotches between the DS's top and bottom screens with showboating flair. Then, as the game plonks your character, the orphaned lead, Luneth, deep in the armpit of a cavernous maze you'll marvel at how remarkably close in quality the character models, textures and environments are to Final Fantasy VII. Indeed, the graphical overhaul of this ancient RPG is consistently arresting and, while it might not rival the slick curves of the top level PSP output, it's the prettiest and most technically impressive title we've yet played on Nintendo's handheld. All of which can seduce you into thinking this is a fresher game than it really is. But play for a few hours and the make-up cracks, unable to conceal the antiquated mechanisms and functions it so thickly covers. Criticising the game for it's hackneyed storyline (four orphans, four crystals, an airship and mission to save the world) or it's clichéd mechanics (explore the world, fight monsters in random battles, find and upgrade armour and weapons and explore towns and dungeons) is obviously unfair as, when this game was first released in 1990, its storyline was fresh and its gameplay formative. But, although obviously unfair, you can't escape the fact that the plot is hackneyed and the gameplay formative. In spending all of their time updating the game's looks, Square have neglected to tweak, balance or update any of these other primitive sins.Random battles in late eighties/early nineties RPGs were far more capricious and frequent than the genre's younger fans will be used to. In fact, the game's difficulty is a big problem even for veterans. Wander even slightly off the narrative path (something easy to do as the game's progression is remarkably poorly sign-posted) and the game will punish you mercilessly with powerful enemies far beyond your team's current capacity. This is disingenuous as it forces the player to stay within small areas to level up rather than encouraging gently curved exploration.  Boss fights are generally over-tough and you will need to spend much time simply walking up and down areas fighting identikit battles to upgrade you team's core stats - something which always feels like poor or negligent pacing rather than a conscious and reasonable design decision. Internally the battles are simple affairs - this game was created before Square's trademark Active-Battle system and so is turn-based in the most orthodox sense of the phrase. The frustration of frequent, necessary but ultimately shallow battles is exacerbated by the game's technical demands: these graphical fireworks come with a heavy loading price which, when set against the lightning quick load times of the GBA's recent Final Fantasy V seem terribly clumsy. Waiting for the game to load your team's victory pose after each fight quickly becomes a bore. Bore turns to chore outside of battles where the game demonstrates no small amount of design clumsiness - especially with regard to its menus. For example, equipping your characters with new items is a convoluted procedure requiring trawling backwards and forwards and in and out menus just to buy and equip a new sword. The swift and useful 'best equipment' option in FFV is missing - something the game could absolutely have done with on a handheld where most players want brevity and elegance on their bus-journey; not wrestling with an unintuitive and vindictive GUI. Likewise game saving is handled atrociously - the game providing no save points anywhere leaving the player to work out that they have to save via the main menu when on the world map. By not including save points before key boss fights you'll frequently have battled your way through a long and meandering dungeon only to be finished off at the final hurdle. Losing 45 minutes of playtime to such a rudimentary design oversight was unforgivable in 1990, let alone in a gleaming update for a modern audience.The narrative and story is predictably thin for such an old game - even if it has been padded out from the original here. However, less forgivable is the translation of the game, sixteen years in the making and a huge disappointment. Yes it's technically and grammatically correct and there are no clumsy spelling mistakes or localisation disasters. But it's relentlessly average, displaying none of the flair or artistic license that Square's Ted Woolsey used in FFVI or Alexander O. Smith in FFXII to such great effect. It reads just like you'd expect an early nineties videogame to read - without a trace of irony - and just a few sprinkles of the flavouring seen in, say, Dragon Quest VIII or Phoenix Wright would have gone a long way to modernising these less visual building blocks.Positively, the game cradles a simple job system at its managerial heart. Although beautifully expanded upon in FFV, even in its more simple form here it works well and is generally fun to use as you assign your four team members specific roles and seek to balance their abilities in complimentary ways. On the downside you can't mix and match job abilities and when switching jobs it takes a few fights before you start to earn experience in the new one - something which discourages experimentation and causes constriction where there should have been variation. Of course, many of these flaws and weaknesses were acknowledged by their removal or evolution at Square's own behest in subsequent FF games. So you could argue that, had they changed them here, the game would have ceased to be Final Fantasy 3. It's a reasonable argument to make but does nothing to counter the point that these emergent and superseded mechanics just aren't that much fun to wrestle with these days. Not all things that flutter wide, pretty eyes and flash impressive curves are necessarily beautiful. In a sense then, this is a game for the RPG fan willing to overlook intolerable weaknesses of character just to have a desirable looking girl on their arm. If that's you, add, say, 2 to the score but know that these looks will fade and age soon enough and then you'll see what they mask for what is really is."}