{"ref": "https://www.eurogamer.net/r-hommvfate-pc", "date": "13 Dec 2006", "game_name": "Heroes of Might & Magic V: Hammers of Fate", "text": "Reviewing add-on packs is always problematic. This one's thrown up special ones all of its own.Heroes and Might of Magic V is the (PC) chart-topping turn-based exploration/strategy game. As in its prequels, it alternates between exploring a map and collecting various magical gubbins and playing out the skirmishes in a chess-like fashion (with masses of character advancement and army recruiting inbetween). Liking the genre and encouraged by my dear friend Egon Superb's 8/10 review, I was looking for an excuse to play it, so offered to ~do~ the add-on pack. This clearly involved playing the original to get a sense of the game before moving onto this new collection of Mightiness and (er)  Magiciness.We hit the problem. I don't like the original very much.[My main reservations? It just lacks any form of tension. The second you enter a battle screen, for the vast majority of conflicts, you know the result. Either you're going to win, and it's a case of just following it through, or you're going to lose and there's little you can do but go down fighting. The ability for the game to autoresolve a conflict, and then - after showing the losses on each side - give you the option to replay it manually helps, but still leads to you choosing to fight battles just because you're sure you can win them with less casualties than the computer. And while conserving troops is necessary to success, winning by losing 5 Knights instead of 10 isn't what inspires great sagas. This is all made worse by the game obfuscating the information you need to decide to engage or not. While not giving exact numbers of an enemy group in favour of descriptive words (~A Horde~ ~A pack~ ~A couple on the way back from the pub~) isn't necessarily bad, not having the vaguest clue what those numbers mean except from trial-and-error experience means you can blunder into fights and die messily. It's made worse by you being unable to actually examine statistics of enemies before you start the battle, by which point you're committed to victory or death. Yes, it's a Vampire Lord. /But what does that mean exactly/? That it gives you everything you may possibly desire to know the second you engage just seems openly perverse. And... oh, you get the idea. It's various decent aspects - the sheer amount of stuff on display, mainly - can't save it. Dull on the one hand, frustrating on the other, I'd probably give it somewhere in that 4 to 5 boundary before proceeding to barricade my door and hammer shutters over the window before the outraged HoMMunity mob arrives.]So now we've got someone who doesn't dig the game trying to recommend whether this is actually a decent purchase for someone who wants more of Heroes.But don't worry. I have a solution.It involves experimenting with a new ~thing~ I've heard about from the chattering classes of the Internet. It's called ~Objectivity~.It'll never catch on.The back of Heroes of Might and Magic V: Hammers of Fate makes the following bold claims:Let's take them one at a time:Traditionally an extra faction are the biggest draw in an add-on pack, so makes sense they're placed first. And, yes, there are certainly Dwarves and Renegade Haven in the game. It's more than a little deceptive to describe them both as factions, since only the stumpy ones are selectable in the skirmish games. The Renegade Haven turns up in the single-player campaigns, but aren't really a fully developed faction in the way the original six are.This means the pack has one faction, meaning that your faction choices are expanded by one-sixth over the original games. While one faction would be good for many games' add on, when the original has so many, it seems a little underselling.Er... drifting off objective a bit.Yes, there's Rune magic. The Dwarves are a fully developed faction, in the same way as the originals. There are certainly mountains. I couldn't guarantee they were the deepest ones though. There may be deeper ones I haven't seen. Who am I to judge?There are new spells, abilities and artefacts. Many of these have considerable - though not out of proportion to previous ones - effects in the game. Thus the ~powerful~ tag seems to be appropriate. Since this means there's more to do, ~extended game experience~ seems equally true. ~Enhanced tactics~ seems more of a reach. There's more options, certainly, but none of what's added seems to enhance the basic tactics of the game.There are three new campaigns, with fifteen missions. From the off, they're harder than the original missions, meaning that these may indeed be the most hostile regions of the Might and Magic World. Eurogamer correspondents sent out to investigate other areas of reputed greater hostility didn't return, which may be due to the aforementioned hostility or getting lost. Eurogamer correspondents are rubbish.It's worth noting that the campaigns, like those in the original game, are based on a narrative arc and cut-scenes and similar. The cut-scenes remain in-engine, with similar levels of voice-acting to the main game.Turning off objectivity for a second, this means they're still a bit rubbish.There are, indeed, ten new maps and a simultaneous turn feature. However the latter is less exciting than it sounds. Players only take turns simultaneously until there's a chance of a conflict - i.e. two people going for the same ~thingy~ - at which point it returns to the standard you-go-I-go method irreversibly. So this speeds up the beginning of the game, before returning to the status quo.Does this make it more intense and challenging? I'm sorry. That'd be a subjective judgement, thus beyond the bounds of this entirely objective review. If speeding up the beginning of the game sounds more intense than you, then put a tick in your mental scoresheet. If not, put a cross.There are, indeed, caravans. When you recruit units in the cities, you're able to order them to be shipped off to a far-off location. At which point, a caravan forms and moves to the chosen destination, being able to be predated upon by any enemy heroes. Since the sending a hero to gather up an army from a place is one of the more tedious aspects of game, automating it is an improvement in terms of functionality.However, the ~to your distant Heroes~ is slightly deceptive. You can't send Caravans after heroes in the field, but only to settlements. If your hero isn't at a settlement, then you're out of luck.There is a random map generator. However, it is relatively limited in scope, with only a handful of options to play with - size of map, strength of monsters and so on. The options have some surprising omissions. Most noticeably, when you generate a map it sets which of the games' factions are playable on it. You are unable to pre-define which races they are.Spooks.There's a website about the Might and Magic games here.Yup. This one's true too. A strong finishing streak by the add-on pack.From all this hopefully everyone will be able to decide whether the add-on pack is what you're looking for. Which leaves the mark, at which point the ceiling of this objective world we've created comes crashing in and we're back in the torrid pit of subjectivity again with the simple question of ~Would I buy it?~ Hammers of Fate adds a lot of material for HoMM5. But to warrant a better mark, it would have to actually deal with the basic weaknesses of the game. As it is, despite the Caravan's efforts to streamline one aspect, it just doesn't.In other words, would I buy it? Not on your nelly."}