{"ref": "https://www.eurogamer.net/r-pes6-psp", "date": "11 Dec 2006", "game_name": "Pro Evolution Soccer 6", "text": "I hate Christmas. Not the Christmas bit of it, you understand, but the weeks preceding it, during which I'm more than ever ~the one who knows about games~. ~Help me,~ a long lost friend quivers down the phone. ~I have to spend three days at my mum's house and I need something to dull the pain.~ Have you tried Lumines? ~Have I tried what? Valium?~ Close enough. ~Help help help,~ says another in an email. ~I'll have to talk to my step-dad while the others watch the telly. He's the dullest man alive.~ Sounds like you need Phoenix Wright! There's lots of suspicious murders in it though. ~Good. I could use a few tips.~It's not all bad. I'd have lost touch with some of these people under different circumstances. But I do panic when they call me from the shop. And not just from the shop, but usually in some advanced state of purchase. ~Hi Tom, I'm at the checkout in Dixon's, with 58 people behind me, and I'm holding two games. I'm reaching for my credit card. You have 15 seconds to decide.~ And yes, it's usually for a child, and yes, it's usually SpongeBob SquarePants' Quacking Quest versus Bayonet Frogdancers Apocalypse. I made the mistake, last year, of saying, ~Forget those - just get him a football game. Pro Evolution's my preference.~A mistake because, as it turned out, I was advising a PSP owner. And now I never hear the end of it. Boxing Day: ~Bloody hell mate, why does it take so long to get going? Have I got the cartridge in the wrong way?~ January: ~I don't understand why it's so jerky. I thought you said the PSP was really powerful.~ March: ~Hi Tom. Just wanted to say thanks again for the recommendation. It's nearly finished loading.~Fortunately, because he's not the sharpest tool in the box (I see him more as one of those plastic compartments fastened to the inside that you use to store washers), I will soon be able to enact a great lie to rescue me: ~Oh, you brought PES5 - I meant for you to buy PES6.~Yes, Konami has finally got its head round the PSP. PES6 still takes a while to load (although nowhere near as long), and it's still short of a few things, but in the majority of respects it's a solid improvement. The Master League makes a welcome appearance, most notably, and slowdown is almost negligible. Last time out, every free-kick was a complete farce - but the only farcical things in PES6 PSP have been farcically out of date on a series level for years, like throw-ins. In many other respects, this is as good as the PS2 version.Released from the burden of so much undercooked nonsense, PSP matches really fly, with all the things that made the PS2 version work as a simulation still intact: the emphasis on passing over running, the zing of the shots (much more so than the Xbox 360 version), the pressure on the ball all over the pitch, the intelligent AI movement, not to mention the range of subtle moves that allow you to wrap a leg around an advancing attacker to knock the ball away, flick the ball over your head to avoid a tackle, or execute a perfectly timed half-volley as the ball spins loose on the edge of the box. Now that it runs competently on the hardware, you're also able to enjoy some of the benefits the PSP brings, like its wider screen. The PS2 version has dodged a widescreen mode for years, and it makes a difference here, allowing you to enjoy the refined football simulation of the recent big-console releases without running into brick walls all the time. It's a godsend in midfield, where space is at a premium.Control isn't particularly difficult either, despite the loss of a pair of shoulder buttons. It does mean that certain controls are clustered together again, or accessed differently. Those of you used to tapping R1 to push the ball ahead while sprinting will need to use the nub while holding the right shoulder button, for example, as tapping now performs a step-over. But it's by no means the handicap it might have been. You can still perform one-twos, dink the ball over the goalkeeper and add a bit of shape when placing the ball from 18 yards out. Once you've scored, you can also save off the replay - with tons of slots available, as you'd expect for a system with optionally upgradeable storage capacity.You might not be able to go online, but the PSP version still allows for ad hoc wireless games with another player, and keeps a helpful record of your achievements in this respect, while you're certainly not short of other modes to play. The Master League's an important inclusion, and there are also six leagues (Serie A, Eredivisie, La Liga, Ligue 1, England League, International League) and seven cups (Reebok Cup, International Cup, European Cup, African Cup, American Cup, Asia-Oceanian Cup, Konami Cup), along with a fairly comprehensive Edit Mode, certainly making a mockery of the shameful lack of depth in the 360's equivalent. You can edit players, teams, boots, league and cup names and transfer players, although kits seem to be off-limits. The PES-Shop is back, too, offering extra players, teams, goal celebrations and ball effects, double speed matches and Master League starting point bonuses, all in exchange for the currency you build up with success on the field.That's not to say that there aren't a few things missing - with the PS2 game's random exhibition match-making not obvious, and no commentary, again, apart from a bit of shouting every time you score. I can't help feel Konami missed a trick with the PS2/PSP connectivity, too - you can exchange data, which is useful, but dreams of continuing the Master League on the go are left unfulfilled. Even so, with more in place and a much smoother experience to enjoy, it's easier to the compliment things that last time out just seemed to make fun of the game's technical shortcomings - like an option to conserve battery life by turning off some of the superfluous special effects.Mind you, the gameplay model upon which PES6 is built is by no means my favourite of the variations Konami has developed since the series' inception, but those looking for a PSP sports game to wipe away a dreary Boxing Day will be more than satisfied with its core competency, and there's still little to rival the satisfaction of scoring a well-worked goal because - whatever you may think of PES - one thing it's very good at is making you feel like you earned it. If you've been suffering with the last version in whatever form, success will be a lot sweeter for it, too."}