{"ref": "https://www.eurogamer.net/r-facesofwar-pc", "date": "11 Dec 2006", "game_name": "Faces of War", "text": "Looking at the rows of gleaming medals pinned to the chest of Company of Heroes by the world's game critics, you'd think it won WW2 (the RTS) single-handedly. It didn't. Not quite, anyway. Most of CoH's most striking features first surfaced in a Russian strategy game released over two years ago. Soldiers: Heroes of World War II was the very first real-time tactics title to combine spectacular physics, great graphics, and a good-sized dollop of WW2 realism. Only a lack of polish and presentational panache kept its gong tally low.The few that did discover the wonders of S:HoWW2 will know roughly what to expect from this often brilliant, sometimes ropey follow-up. Faces of War is an RTS in which you demolish structures rather than erect them. It's an RTS in which every soldier and vehicle has their own inventory, and every soldier and vehicle can be manoeuvred arcade-style with the aid of cursor keys (for movement) and a mouse (for targeting). This marvellous 'direct control' facility dramatically narrows that emotional distance we take for granted in strategy games. Sending a tank down a suspiciously quiet street with a single mouse click will never ever be as exciting or involving as steering it down that street personally, moving the main gun warily from left to right as you go.Of course, only the historically-minded drive their tanks down streets in FoW. I've just finished an urban mission in which, on one particular boulevard, my grunts were getting cut to ribbons by half-a-dozen loft-lurking snipers. Rather than laboriously clear the sharpshooters with grenades, or counter-snipe them, I went for the crowd-pleasing sledgehammer approach. A Sherman tank was rolled into position. With camera carefully positioned to follow the action this tank was then driven purposefully through the ground floor walls of the entire street. Rubble and roof tiles collapsed into the road, rooms gaped then crumbled. Every so often a panicking sniper could be seen tumbling to his death. In the very end house the wall fell away to reveal a goon pointing a Panzerschreck. The AT weapon was trained on the vehicle below and for a few tense moments it seemed as if the armoured slum-rhino would be stopped in its tracks. Thankfully the floor collapsed before the trigger could be pulled.Yes, I know, real WW2 tank commanders would have been too worried about damage or entombment to have used a tactic like that in real-life. Come to FoW expecting Combat Mission or Close Combat and you'll be disappointed. Despite sporting unusually persuasive graphics, surprisingly fastidious bullet ballistics, and some fairly credible AI (see on for qualifications) the game is no simulation. The most unlikely elements are probably the copious haversacks (You want me to lug around three Panzerfausts, four MG42s, and 5000 rounds of ammo?  No problem.) the rapid vehicle repairs, the omniscient mortars, and the artillery pieces that happily fire on troops a foot or two away from their muzzles. Other credibility-straining ingredients include the occasional deaf infantrymen, suicidal tank, and Wild West-style shootout. Though AI-controlled infantry can and do utilise cover extremely well (far better than in the majority of WW2 RTS) and will dive away from grenades and retreat to safe spots to use medikits, you will witness improbable behaviours from time to time.Fortunately for every bit of nonsense there's a bit of impressive authenticity to help bolster the fantasy. Assaulting an emplaced 88mm AA gun in one mission, I witnessed a great example of FoW's sophisticated gunnery model. My assaults were proving costly until I realised that one of my machinegunners - a bloke with a Bren gun - could thin out the concealed defenders by blindly pouring fire into the entrance of the concrete emplacement. The pinging ricochets eventually found flesh. Similar attention to detail can be seen in the way slugs interact with soft-skinned vehicles. Puncture a truck tire with a well-aimed round and the vehicle will slump on its suspension and slew in an appropriate direction. In a good FPS you'd take this kind of thing for granted, in an RTS its pure class. Bouncing bullets are at the thin end of the physics wedge. At the fat, eye-catching end you've got tanks bulldozing wrecked vehicles off bridges, trains barging careless armoured cars off level-crossings, and explosions flinging moving jeeps through shop fronts. Splendidly unpredictable stunts abound, and there's a good-few scripted ones thrown in too. Which brings us to the thorny issue of mission design...The best of the twenty-odd campaign episodes are fantastic - some of the finest, most memorable WW2 strategy outings you'll find anywhere. The worst are just too intense for their own good. FoW works best when there are quieter interludes within the missions - opportunities to scavenge arms and scout the lovingly detailed maps. In some of the scenarios I've played over the last few days the action has been so breathless, so noisy, and sustained I've flopped over the finishing line more relieved than exhilarated. The occasionally idiosyncratic pathfinding (units sometimes get stuck or take weird routes) doesn't help in such episodes, nor does the camera system (it's easy to lose track of units in and around buildings) and the fact that friendlies and enemies are often dressed very similarly.Best Way's mission pacing could definitely use some work. Its briefings and vocal cues on the other hand, are probably beyond salvage. ~I swear by the recent notches on my Garand that we're the hottest guys in the American army!~ is typical of the tosh that passes for period colour in the debriefings. Hearing a pinned-down GI shout ~The rascals!~ in the middle of a skirmish doesn't do a whole lot for immersion. When it comes to cut-scenes, characterisation, story-telling and audio CoH is streets ahead.Losing interest? Remember FoW can and does deliver memorable unscripted engagements, like the following, on a regular basis: Picture a Soviet sniper festooned with foliage slithering through a field of long grass. He reaches a wall, vaults it, scampers across a rutted lane, leaps a fence, then drops to the dirt again. Up ahead, loitering beside a rusty harrow, is a German halftrack. Crawling closer, the sniper lights a Molotov cocktail and tosses it expertly into the back of the APC. Moments later crew, their uniforms ablaze, are jumping from the flaming vehicle. The sniper legs it back the way he came with alerted enemies in hot pursuit. Fence, lane, wall, field - he dashes into a farmyard with bullets nipping at his heels. There's just time to duck down behind a woodpile before an armoured car and maybe a dozen infantrymen come racing round the corner. At this point the ambush kicks-off. A Panzerfaust whooshes from behind a rusty lorry chassis. Two LMGs open-up from windows in the farmhouse. Russian rifles begin to crackle. Soon the armoured car is smoking and the ground about it is littered with dead Germans.I could tell you a hundred stories like this (well, at least twenty). They are the reason I put-up with FoW's minor imperfections and they're the reason I think you might be prepared to put-up with them too. When it comes to cutting-edge WW2 strategy there are other worthy options besides the highly-decorated Company of Heroes."}