{"ref": "https://www.eurogamer.net/r-wiiplay-wii", "date": "5 Dec 2006", "game_name": "Wii Play", "text": "Launching the Wii with just one big first party title is something of a calculated gamble for Nintendo. It knows that enough hardcore early adopters will be more than content to plough through Zelda over Christmas - but at the same time it has to try and gently educate the casual audience about how to use a Wii remote without being too patronising about it.The first step, of course, is to bundle Wii Sports with the console and give everyone a suite of pick-up-and-play multiplayer games. Admittedly, for all its charms, it's not really got the depth to justify its release as a standalone product. But, even so, it's something you'll be more than happy to stick on to amuse friends and normally reluctant family members - just as everyone did with EyeToy. But the inevitable problem with any new console is the bothersome need to buy extra controllers - and the Wii is no exception to the rule. Fortunately Nintendo has sweetened the prospect of buying a second Wii remote slightly by making Wii Play available as part of a bundle pack for £34.99 - only £5 more than a controller costs on its own.Again, Wii Play is a product that you'd arguably give a wide berth to on its own, somewhat limited, merits, but for the price it's a fun, social means of being shown the ropes for a new type of control device that new Wii owners will be hungry for. So, in the process of including Wii Sports in the main package and Wii Play for an extra £5 with the Wii remotes, Nintendo has managed to come up with a way of not only seamlessly demonstrating the console's accessibility, but showing them off in a social context. Cunning stunts.The premise for each of the nine mini-games in the Wii Play package couldn't be much simpler, but almost all of them provide a few minutes of instant fun when played - as intended - in simultaneous two-player versus mode. Each of the games are designed as straightforward score-based versus games, so if you don't have any mates on hand (sob) then bear that in mind before you contemplate shelling out for it.Also advisable before you play is to take some time out to design your 'Mii' character (and your opponent's) in the Wii dash, as you'll be able to use it throughout Wii Play. It makes no difference to the gameplay (apart from storing high scores and so on), but it certainly improves the amusement factor considerably.Unlockable in sequence, the game kicks off with Shooting Range - a lightgun-style shooting test that doffs its cap firmly in the direction of Duck Hunt, one of Nintendo's oldest NES hits. The idea, needless to say, is to try and shoot targets as they appear on the screen before your opponent, with bonus points being awarded for managing to shoot consecutive targets, or special targets like ducks and disks which zoom across the screen, or targets with your opponent's face on. Each of the short levels gets progressively harder, and the player with the highest score wins the round. Simple, easy to control, and one of many of the games which literally anyone with any semblance of co-ordination could play - the sensitivity and accuracy of the Wii remote is shown off immediately.Another game to coach you in the basic art of pointing the Wii remote is the 'Find Mii' stage. Similar to the recognition tests in Brain Academy, you have to, for example, point and click on the two identical faces in a crowd of other Miis before your opponent. To begin with, the Miis are stationary and pretty easy to identify, but as you progress they start moving around and descending down escalators and so on - making the seemingly simple task rather tricky in no time. A bit of a throwaway one this, but serves its purpose in getting players used to the fine movements required in pointing at the screen.Stage 3 - Table Tennis - could have easily have found its way into Wii Sports, and is an instantly engaging but slightly limited means of showing off the fast-paced racket sport. The idea is to reach 11 points first, but getting there is as dependent on your opponent's inability to grasp the control system as your own skill. Once you've served with the A button, the only thing to worry about is moving the paddle left and right and attempting to meet the trajectory of the ball - as long as you can anticipate that, you automatically return the ball - meaning some pretty lengthy rallies ensue if you both grasp the concept well. You can put more pace on the return shot, but it's a risky business."}