{"ref": "https://www.eurogamer.net/eg-rev-lum-psp", "date": "27 Nov 2006", "game_name": "Lumines II", "text": "If Tetsuya Mizuguchi ever runs an airline, he should totally call the planes ~Lumines~. Because then he can write on the side of them, ~Lumines: How Time Flies~.(Stop groaning. It was that or some nonsense about relativity.)The way Lumines works hasn't changed since 2004 when it first came out in Japan. Blocks fall from the top of the screen, each consisting of four small squares, and your job is to make single-colour blocks while you're piling them up at the bottom. With only two colours to worry about the falling block can only turn out six different ways, although there's also a jewel square, which forms a bond with any squares of the same colour that are connected to it when it's worked into a unicolour block.The brilliance, though, is in the way the blocks vanish - instead of simply disappearing when you form the right coloured shapes, they wait for a ~timeline~ to scroll from left to right tagging them as it goes and removing them when it reaches the edge of each group. This enables the developer to vary the gameplay conditions as you progress through various levels of the puzzle.This simple idea - coupled with subtleties like squares sliding to the bottom if they hang over an edge - results in a rich and nuanced puzzle game, and one which is famous (or infamous, if you're one of its enemies) for its ability to consume time. Falling-block games traditionally become harder and harder until you can go on no longer, but Lumines' technique of varying the timeline's speed and the speed with which blocks descend, rather than simply making everything go faster the further you get, means that a single game can last for hours. Thanks to the PSP's suspend feature, you can of course break that session up and still work towards high scores.A wonderful puzzle game, then. Hard to imagine how you could improve it.Hard for Q Entertainment, too, since the only thing that's changed here is the removal of the 999,999-point high-score limit.It's easy to imagine how one might change it, of course. You could have the timeline sweep from right to left (that wouldn't hurt too much). You could add a few different block shapes (that might be a bit rubbish though - the mobile phone version tried it, and it only sort of worked). Or, you know, you could swap all the charming Japanese dance music for stuff like Gwen Stefani and Hoobastank.But then why would you do... Oh god. Careful what you wish for, eh?The reason it's an ~oh god~ of course is that Lumines' other great appeal is the way it blends music into the gameplay. Each set of conditions - timeline speed, etc. - is married to a particular tune, and each of your actions feeds a bit of musical flourish back into the composition. In the original, I had no idea what any of the songs were meant to sound like beforehand, and, with a bit of polish, the illusion that I was actually contributing to them was consistently upheld.The problem with moving a lot of the skins over to songs familiar to a Western audience, though, is that it's harder to maintain that illusion of interaction when the player already knows the song intimately. In some cases it sort of works (Beck, mainly, since his music's fairly unpredictable), but in others you're just left listening to the music or turning it down, and in both cases probably thoroughly ignoring the music video that's been carefully positioned in the background behind the play area.Not a big success on that front, then, and really there's a dearth of new content elsewhere. Versus mode is still the same, and Time Attack is Time Attack. There's a Mission mode now to complement the Puzzle offering, but I usually struggle to remember which is which because they're virtually the same. One involves doing X within Y timelines, while the other involves creating Z with blocks. As in, actual Z shapes. And crosses, pictures of animals, and so on. Both modes are good ideas, but the tasks invariably are either very easy or rock hard, with no apparent curve to the difficulty.The only other additions to Lumines II are a Sequencer tool for creating your own little custom skin musical arrangements, which is interesting albeit limited, and a Skin Edit mode that allows you to create playlists of any levels you've already unlocked in the main Challenge mode. Challenge, incidentally, now offers a trio of difficulty levels, as well as a fourth unlockable one, but since difficulty is very flexible throughout a Challenge session it's difficult to discern much difference between the modes in my experience. Then again I may just be rubbish - so for what it's worth, they're there, but they're all reliant on the same skills and strategies for the most part.All of which sees us done in record time, and left to deal with the tricky question of scoring it. I was tempted, initially, to go with a pair of marks, and were it not for Kieron sodding Gillen I might have done. But then upon reflection I decided to go with the harsher option. If you never bought Lumines, you simply must play it, and the lack of a points-cap on this one means it's vaguely more attractive; even so, I'd probably recommend buying the original instead. It'll be cheaper by now, it's got a lot more charm to it, and if you're so good at it that you need to take the cap off you can always trade it in.Otherwise, best to pass. Time still flies, but with Hoobastank on board I'd rather explode on take-off."}