{"ref": "https://www.eurogamer.net/eg-rev-son-360", "date": "24 Nov 2006", "game_name": "Sonic the Hedgehog", "text": "Growing up on the outskirts of a small rural town, hedgehogs were just part of the tapestry of nature for me as a child. Small, shy creatures, they scurried about at night munching on the garden's insects and shuffled through the undergrowth occasionally when their daytime sleep was disturbed by boisterous play. Saucers of milk could sometimes entice them into the pool of light by the back door, as long as the cats didn't get there first. Along with badgers, they were nature's treats for eagle-eyed children who kept an eye out after dark.The problem with hedgehogs, however, was that you didn't tend to see them most commonly at night, when they went about their business. No, you were more likely to see them the next morning, on the way to school. A sad-looking, pancaked hedgehog carcass was almost certain to be laid out on the busy road outside our house at least once every few weeks; its spines were no defence against the wheels of a late-night truck rushing to make it to the ferry port in time, and crossing the road - god knows why they even tried, really, or what enticed them to the other side - was highly likely to end in disaster, a pathetic little spiny corpse, and upset children the following morning.Which leads us on, somewhat morbidly, to the case of Sonic the Hedgehog.For the first next-gen outing of Sega's most famous mascot character, Sonic Team have chosen to return to the name of the first game in the whole franchise. Using the name Sonic the Hedgehog, the title of the glorious 16-bit debut of the character which came to define two generations of console battles, might initially imply that the team intends for this to be a much-needed reboot of the series; boiling it down to the absolute basics of what made it good and fun in the first place, stripping away the accumulated weight of years and finding the key elements that drove the franchise forward in the first place.You might as well forget that idea right now, because that's most certainly not what you're getting. Sonic the Hedgehog 2006 might have started off life, in some well-intentioned concept meeting deep within the bowels of Sega's headquarters, as a reboot for the franchise - a bold, stripped-down approach to a series of games which has grown fat, old, lazy and boring - but along the road from there to being on an Xbox 360 disc and sitting on the shelf at your local retailer, the game has picked up every fat, old, lazy and boring trait that the franchise has accumulated in the last ten years and added a few of its own for good measure. Then, to add insult to injury - or perhaps vice versa - the team apparently got just as bored of the game as players will be within ten minutes, and pushed the damn thing out the door in an utterly unfinished state.One common criticism of recent Sonic games is that they're not really about Sonic at all - in fact, the amount of time you'll spend playing as the speedy blue critter has been cut down more and more as a vast and largely incomprehensible cast of supporting characters has been added to the game. Far from rectifying this problem, Sonic the Hedgehog compounds it; while you do start the game off playing as Sonic, you rapidly discover that two thirds of the game are devoted to segments where Shadow and new character Silver are the main characters. Not only that, but when playing as one of the central hedgehog characters, you'll end up switching over to other members of the supporting cast for no apparent reason and will be forced to play as them for a few minutes. A good example is in the ice-themed zone, where playing as Sonic, you'll suddenly see Tails pop up and announce ~I'll take over from here!~ - which is the cue for five minutes of interminably boring flapping around with Tails' imprecise controls and braindead combat mechanisms, while all the time, Sonic runs along behind you. So why not let you play as Sonic?Now, don't get me wrong - playing as Sonic (or indeed as Shadow, or as Silver, who has the ability to pick things up and throw them - WITH HIS MIND!! - but not apparently to actually target them in any meaningful way) is no Holy Grail of fun and enjoyment, which you can't wait to get back to during all the times you're forced to mess around with one of the other characters. It's just that it's better than playing as Tails; and that's not saying much.Each of the characters' stories - we'll focus on Sonic's for now, since it's the first storyline to be open to you and obviously the one people will be most interested in - rotates around a hub area where you talk to people, take on side missions and advance the storyline of the game. This hub town is particularly appalling - it really does feel like a left-over model from a PS2 game, and astonishingly, it has dreadful pop-up (as does the rest of the game, for that matter, which is particularly unforgivable in a game where you're meant to be moving really fast). Human characters grunt like punched farm animals when you speak to them, and some of them will give you missions to complete - many of which simply involve running around the town as fast as you can finding something before the time runs out. None of the town missions are worth the pain of actually getting into them - there's a massive load delay as soon as you speak to someone who can give you a mission, followed by about ten seconds of text dialogue, then another massive load delay before the mission starts. What the hell they're loading, I don't know - but they feel the need to do it again at the end of the mission, this all despite the fact that each mission takes place in the same town you've been running around for the last ten minutes fruitlessly trying to find the next actual gameplay stage.Ah yes. The gameplay stages. Once again, rather than shedding the baggage of the past, Sonic Team has chosen to replicate the gameplay of Sonic Adventure - and once again, they have actually managed to bring it downhill. After the abysmal (but almost enjoyable, in a strangely masochistic way) Sonic Heroes, we can only assume that we've reached the bottom of the hill, and the developers are now digging an open-cast mine for the quality of their gameplay to slide into. Sonic's controls are twitchy, unforgiving and unpleasant, with a touch of the stick in the wrong direction often sending him hurtling to his doom. Attempting to adjust your trajectory when moving at high speed regularly makes him fall over or simply slow down to a staggering stop for no apparent reason; trying to gauge jumps so that you land on a platform accurately is a matter of pure trial and error, which is a real shame in a game which insists on giving you a small, limited number of lives, loads of ways to die instantly, and is willing to put you back a good 20 to 30 minutes to the last save point every time this happens.All of this is compounded by one of the worst cameras I've ever seen in a videogame. Very often, an utterly unhelpful angle which simply doesn't let you see what you should be doing next is chosen; better again, when you try to manually adjust the camera, it will snap right back to its original unhelpful angle at the slightest movement. The camera controls are locked into an inverted setting which can't be changed (and I do mean inverted - the Y-axis is inverted as well as the X-axis, which feels utterly wrong to many players), and often there will be whole segments of the play area you can't even look at because the camera gets stuck on a solid object. Genius. Combined with controls which completely automate some aspects of gameplay (such as combat - press A repeatedly to win game!) while removing any form of stickyness or automation from other key aspects, like sliding on rails, you get the strong impression that Sonic Team have learned absolutely nothing from over ten years of 3D gameplay. There are elementary mistakes being made here which would have been painful in 1996, let alone 2006.I could go on. I could talk about the painful voice acting, the singularly cringe-worthy cut-scenes, the innumerable graphics glitches, or the moments in the game where you die for no apparent reason (especially in the snowboarding level, which is a particularly low point in gameplay terms as it even manages to feature checkpoints that you can miss by a whisker and then continue playing, only to be plonked right back at the start of the level when you inevitably die by running into a pile of rocks that you couldn't see because the camera was pointed the wrong way). However, this review boils down to one simple conclusion: this game is unfinished. It was quite clearly released without being properly tested, tweaked or tuned; in my first few hours of play, I uncovered massive, massive flaws which should have seen the game bounced right back from testing immediately, but which have made it onto a final retail copy of the product. If I were to guess at the reason for this, I'd say that it was because the development team didn't really care - and I'm not sure whether that's a fair statement or not, but in ways I'd prefer to believe that Sonic Team rushed this malformed abortion of a game out the door because they didn't care, rather than actually believing that some unfortunate development team actually did their level best and still produced a game this bloody awful.What should have been a dramatic return to form for Sonic, as signalled by the hugely promising trailer videos from earlier this year and the bold decision to use the original Sonic the Hedgehog name, has turned out to be an absolute mess. Like the hedgehogs I used to see as a child on the way to school, this game has been hit by a truck - and even its spines, in this case the name of one of the most loved videogame characters of all times, couldn't provide the slightest defence against the big fat tyres of apathy which have spread it all over the road. This game has one other thing in common with those poor, flattened hedgehogs: seeing it is going to upset a whole lot of children, of all ages."}