{"ref": "https://www.eurogamer.net/eg-rev-kz-psp", "date": "21 Nov 2006", "game_name": "Killzone: Liberation", "text": "It's tempting to write a big long introduction about how decidedly average the first Killzone game was here, but that wouldn't be very fair. One article in an official magazine came out calling it a Halo-killer and suddenly everybody in the world was expecting it to be the PlayStation 2's Second Coming and no wonder it was such a  let-down when the poor fanboys actually got to play it rather than lying about how amazing it was on forums. Admittedly it was disappointing, but it wouldn't have appeared nearly as disappointing had it not been smothered in such completely unfounded hype, and now it's come to be something of a poster-game for Sony cynics . Poor Killzone. It wasn't its fault.Thankfully Liberation is in little danger of suffering the same undeserved fate, as the launch of the PlayStation 3 is diverting all attention from the PlayStation Portable at the moment. Seriously, it's a wonder that you even clicked on this instead of gawking at ridiculous eBay listings or watching a video of some American journalists opening a box and using calculatedly neutral phraseology to tell you things you already knew. It's also a very different game - this is a third-person tactical shooter that reminds me a bit of Full Spectrum Warrior (and Laser Squad Nemesis, weirdly, but I'm fairly certain that's just the isometric viewpoint). The only thing it has in common with its ill-fated predecessor is, unfortunately, the rather drab setting, but hidden beneath all the grey-brown scenery and irritating warspeak and tiresomely brash voice acting is an engaging and surprisingly cerebral little game.Played out as four chapters of five missions each, Liberation presumably fills the gap story-wise between the first game and the forthcoming PlayStation 3 version, setting the stage for a full-scale human invasion of the Helghast home planet. The plot, though, has very little to do with anything, which is just as well considering the uninspirational Killzone premise. Each level is essentially a linear, isometric, war-themed obstacle course populated with pleasingly intelligent enemies, and the emphasis is upon exploiting the environment to gain the upper hand as opposed to spattering bullets all over the place. Almost all of the missions are simple, get-from-one-place-to-another affairs, usually involving a few diversions in order to find some C4 with which to blow up an obstacle or flick a few switches. Occasionally, you're accompanied for a while by a meathead soldier called Rico, who can be painlessly commanded to take up certain strategic positions or target certain enemies using the directional buttons, but most of the time you're on your own (unless you're playing co-op, but more on that later). It's fairly simple design, but it works extremely well on the console; all too often, ambitious PSP developers shoot themselves in the foot trying to downscale their ideas as opposed to designing a handheld game from the ground up. Killzone: Liberation has been crafted with the PSP specifically and exclusively in mind, and it really does show. Basic, commonplace PSP-game frustrations like aiming and camera control are nonexistent here, thanks to a clever auto-aim and the fixed viewpoint.Cover is everything in Liberation; certainly at the beginning of the game, before any of the more exciting close-range weaponry comes into play, you'll spend a lot of your time trading bullets with the Helghast from behind trucks and crates until one of you falls over. Run out into the open with multiple enemies in the area and you will die, which can seem a touch unforgiving, but in fact it forces you to play intelligently. Seeking out routes through cover and strategic vantage points is an absolute necessity, and as the enemy will always be doing the same thing, Liberation often feels more like a battle of wits than a straight-up shooter. There is the occasional destructive rampage in a tank, and a variety of mini-game-esque challenges separate from the main campaign are on hand to provide quicker, more destructive thrills, but for the most part Liberation is about intelligent warfare.That's not to say it's not intense. Liberation's high-quality visuals, big explosions and excellent sound effects go a long way towards making things a bit more exciting, and taking risks by dashing through heavy fire or making a break for it as an enemy struggles to reload can be exhilarating. Especially when the full range of weapons and enemy types comes into play, the game becomes a lot more exciting than just hiding behind things. Aggressive shotgun-carriers and grenadiers force you to start thinking on your feet, and although you will never get away with Rambo-style running and gunning, the game does offer you more options the further you progress.Unfortunately, the downside to all this is that Killzone: Liberation is occasionally fist-eatingly frustrating. Sometimes, finding the right way through a particularly tricky section of a level turns into a matter of trial and error, and so going back to the last checkpoint every single time you die only to die again the second you arrive at the problem area gets extremely irksome, despite the reasonably generous checkpointing. The game also places quite heavy restrictions on you at the beginning - you can only carry two grenades, for instance, which becomes a severe annoyance when you accidentally press the wrong button and lob one into the sea miles away from the nearest supply box - and although completing the single-player challenges does earn you points for upgrading your little soldier's abilities, these restrictions can seem a tad too severe, even for a strategic shooter. Venturing back to a supply box every time you need a new gun can also be irritating, as you'll soon learn when you get stuck in a close-up firefight with a sniper rifle and have to flee across half the map.Playing in multiplayer, though, the single-player gripes don't really matter a damn. The co-op mode is excellent; having two different soldiers with two different guns makes things considerably easier (but no less cerebral). You have to finish the campaign on single-player before unlocking the option to play the missions co-operatively, but Killzone: Liberation is quite a short game (as befits a handheld console) and co-operatively, the missions are easily enjoyable enough to motivate you to play them again. However, the more conventional multiplayer modes are sadly not anything like as enjoyable as they should be. With anything less than four people playing, it's deeply unexciting, as the maps are designed for larger numbers. Sadly, the likelihood of ever getting to experience it with six players is extremely small, as for some inexplicable reason Liberation is not online, which really is an enormous shame - I can imagine this being superb fun played with other people.Killzone: Liberation is an intense, challenging and well-designed game, simple enough to come off extremely well on the PSP and strategically engaging enough to keep cerebral players involved. It is undeniably extremely frustrating at times, and occasionally it can appear to be wilfully obtuse in the way that it forces you to play certain sections again and again before allowing you to progress, but there is nothing else like it on the PlayStation Portable and it suits its format an awful lot better than most of its third-person-shooter competitors. It's a shame that so few PSP owners will be able to enjoy the multiplayer; six-player online strategic shooting might just have made this into an essential purchase."}