{"ref": "https://www.eurogamer.net/umk3-xbla-eg-rev", "date": "20 Nov 2006", "game_name": "Reviews", "text": "Wow. They actually did it. They actually found a way to make MK Armageddon even less necessary. While the new game might have vast rosters of characters, the simplicity of Ultimate Mortal Kombat 3 and its wealth of classic finishing moves make it the far better game and for far less cash. We don't want dodgy third-person adventure modes, half-baked creation modes or reams of unlockable artwork. We just want to beat gallons of blood out of silly-looking characters then make them explode in a shower of bones and offal. Is that such a bad thing, really? Perhaps it is, but as far as guilty pleasures go, UMK3 is right up there.As exemplified by the game's single-player modes, Mortal Kombat 3 is far from a technical fighter. The AI is absolutely all over the place, spamming special moves until the round ends one minute while refusing to fight back the next. And as you climb the ladder, things get more and more filthy until you reach the Captain Broken himself, Shao Kahn, who just repeatedly abuses high-speed, high priority dashes or fireballs to sickening effect until you fall over and don't get up. Bring in a second player, though, and the playing field is levelled to make for a far more entertaining experience. It's easy enough to laugh at Mortal Kombat but in multiplayer, it's just as easy to laugh with its kitsch charms and ridiculous violence. For a game that many are quick to complain is impossible to ever get good at, there are a surprising number of people out there that know characters well enough to do horrible things to the less educated Kombatant. Smoke seems to be a popular choice, following up a juggle with a spear throw that reels in the foe for another guaranteed combo while others choose to abuse the fact that characters can be thrown without even getting to their feet first in order to chalk up speedy victories.It's all very well beating people online but if you don't finish the match properly, you might as well not even bother. Without even a basic move list in the game, it's time to dust off the strategy guides or get online and swot up on your fatalities. After all, you don't want to be the guy that wriggles his opponent to death, do you? Looking back at them, it's hard to see how anyone ever took offence at the multitude of finishers on offer here - almost all are more comical than truly horrible and with few exceptions, you'll see more shocking scenes in Itchy and Scratchy. Even after all these years, there's still a huge sense of satisfaction and closure to be garnered from finishing your foe successfully and with everything from Babalities to Animalities on offer, there's almost no end to how this can be done. After all, Mortal Kombat isn't just about adding insult to injury - it's about adding further injury to injury as well. The Live side of the game is well implemented and while a few matches were somewhat hampered by lag issues, the vast majority played out as though the opponent was in the same room. Yes, even down to the shouting and name-calling. Ranked matches are one-shot affairs while player matches allow up to four players to challenge one another in sequence, not unlike SF2's Quarter mode or the winner-stays-on shenanigans of Dead Or Alive 4. Player ability is among the most varied we've ever seen in a Live game, offering everything from opponents who don't seem to know what the buttons do to those that don't seem to have been doing anything other than playing Mortal Kombat 3 for the last decade.All in all, UMK3 is a pretty broken game but one that is loaded with entertainment value regardless. If you're looking for a robust fighting experience on Live Arcade, stick with Street Fighter 2 but for pure amusement alone, there's a certain 'charm' (if such a bloodbath can ever really be referred to as 'charming') about the game that makes us keep going back to it every now and again. Then we realise that everyone on our friend list can see what we're doing and we switch it off. But hey, they're the ones going back to King Kong to milk it of a thousand easy gamerpoints so perhaps we're not the ones that should be feeling embarrassed after all."}