{"ref": "https://www.eurogamer.net/ir-viewtifuljoe-ps2", "date": "17 Nov 2006", "game_name": "Viewtiful Joe", "text": "Shop for games now with Simply Games.When we were compiling our recent Bluffer's Guide to GameCube Cult Classics, Viewtiful Joe was a shoo-in from the word go - a posterchild for great games that failed to capture your cash at retail. So you could say we were mildly surprised when it turned out Capcom was not only developing a sequel (wisely, this time, for both GameCube and PlayStation 2), but also had a port of the original in mind for fans of Darth's Toaster. Still, we're not complaining - if ever a game deserved another stab at the big time, it was Viewtiful Joe, and the addition of Dante from Devil May Cry as a playable character was a clever way of catching the attention of the PS2 faithful. We only hope it works.That said, there's no reason why the game as it was shouldn't do so in any case. A clever blend of old school fighting game and a unique 2D/3D toon-shaded graphical approach, VJ stole our hearts with its coolly executed formula and precise mechanics, which demanded that you make proper use of Joe's varied skill set to make any progress - and full use of it if you planned to get everything out of the game and attain all the available 'Viewtiful' ratings for each section.To recap, Joe is a movie fan thrust into the vacant role of his favourite hero Captain Blue, on a quest to rescue his girlfriend Silvia from nefarious types in Movie Land. The plot is largely superfluous to the genius of the actual game design, but it's voiced and directed in a very amusing fashion, and you'll probably get a kick out of it whether or not it appeals to your desire for mature characters and narrative stimulus. However even if you don't, what happens when Joe lands in Movie Land and starts coming to terms with his 'Viewtiful' arsenal will almost certainly strike a chord; the idea is, simply, to move from one side of the screen to the other navigating the odd puzzle that draws on Joe's powers and vanquishing a myriad of foes in as stylish a manner as possible.At its most basic level, the game wants you to duck or jump out of the way of attacks. This is the mechanic that sold it to so many onlookers when the game first took a bow at E3 - much to the detriment of various other titles lurking in the Nintendo GameCube area, we seem to recall - and involves standing next to an enemy and pressing up or down depending on where a little attack icon appears on your body. Successfully dodge the impending assault and your enemy will be dizzied, Street Fighter II style, tottering on his feet and ripe for some punishment. By holding L1 you can duck into Slow mode and pummel him in slow motion, watching with glee as robotic gizmos are sheered off by Joe's rampaging high kicks and uppercuts. Better, if you can dodge the attacks of a couple of enemies, or even more, and keep them dizzied, you can punch them into one another and perform a basic combo.Of course, it's not as simple as all that. Although you'll encounter the same basic types of enemies in each of the game's seven stages, you'll also come up against a more diverse range of foes who have different attack patterns to consider - and, by extension, integrate into your growing penchant for high-scoring combination moves. There are spinning types, flying enemies who have to be batted down (or, if you're smart, who make good targets for uppercutting the grunts), cowboys whose bullets can be dodged Matrix-style in Slow-mo, but only go into dizzied mode if you can send the lead back in their direction, cutlass-wielding colonial military bastards who pose even more of a problem, and a whole host of others.Fortunately as you make progress you also gain new powers, and these come in very handy in conquering the increasingly vast numbers of diverse enemies in a stylish manner. Mach Speed (R1) enables you to run faster than anything else, or punch and kick at lightning pace, while Zoom (circle) mode unlocks a bunch of devastatingly powerful attacks, like a downward thrusting shockwave that juggles just about anything unfortunate enough to be on the same screen when it hits. Best of all, you can combine Joe's various powers to the limits of your own imagination, and find increasingly effective ways of dispatching enemies without breaking out of combo - Slow down your enemies and Mach Speed your attacks, Slow and Zoom, etc, and it all comes together nicely.All you have to worry about is how much VFX power you've got left. The VFX meter along the top of the screen is the element that stops you from just racing around the whole time with the shoulder buttons clamped reigning merry hell upon your adversaries. It fills up gradually whenever you're not in the grips of a special move, but also runs down quite sharply while Slow or Mach is clamped, and although you can gather up VFX potions dropped whenever you clatter enemies to try and quell its march to zero, these don't make enough of a difference to keep you in a combo as long as you might need. You'll want to avoid running the meter the whole way down, too, because doing that robs Joe of his Viewtiful powers for as long as it takes to charge up again. And enjoyable though the sudden dive into a crackly film-reel visual layer is when you first run out of VFX, you'll soon come to fear it.In short, you have to think through your plan of attack in order to maximise the amount of enemies that take a hit or, for the most efficient way of scoring highly, take their final hit during your onslaught. It's a marvellous balance, and there are very few flaws in Capcom's approach to it. That you can also power-up with new moves at certain checkpoints and between levels is another boost. Adding attacks like a sliding kick to your arsenal will not only allow you to juggle a whole load of enemies at once, but also sweep under low objects for hidden power-ups, while Mach Speed upgrades and other bonuses will improve existing areas of combat. And that you will have to master combo attacks in order to gain the credits you'll need to pay for these upgrades is equally well-judged - especially as a particularly daring and gutsy performance will give you the extra currency you'll need to top up your health and VFX beyond simply shopping for upgrades.There's a whole lot more to the game beyond the admirable precision of the combat, too. The bosses, although arguably varying in quality, are definitely worth a mention - if only because they demonstrate the learning curve of the game most effectively. The helicopter boss on the first level, for example, might take you an age the first time you come up against it as you struggle to avoid the attentions of its minions on the ground, its probing machine gunnery and its slicing blades, but when you return to it with a few hours of combat experience under your belt - or, to be more accurate, when the game throws a pair of the bastards at you just a couple of levels later - you'll have no trouble at all scything them out of the sky, in our experience by Slow-ing their propellers to send them plummeting to the ground and then Mach-ing and Zoom-ing the hell out of them.Learning to apply the various skills in Joe's arsenal takes time - and persistence - but the satisfaction of doing so is hardly comparable to anything else on the GameCube or the PS2. It's been a while since games have been this pixel-perfect, and VJ doesn't waste the opportunity - even the puzzles, simple though they generally are, are perfectly integrated to take advantage of various elements of Joe's skill set. Slowing down propellers on platforms, using Mach speed to punch hard enough that you can set fire to totems, Slowing the world so that a drip from a tap grows big enough and weighty enough to splatter down and hit a time-release switch. It's all very cleverly thought out, and there are some moments - like a bus-ride that we won't spoil for you - that are just plain genius.So then. By now, with any luck, you're vaguely sold on the idea of Viewtiful Joe - assuming you've never given it a chance before - and you're also primed to be mildly wary of the words ~To recap~ in future.Okay, so Viewtiful Joe isn't for everyone; when we said you'd need to persevere, we weren't joking - VJ can be harder than titanium nails until you get the hang of it, and it doesn't get much easier when you have done - but we reckon that you'll know instinctively whether or not you can stomach this sort of difficulty. It's one of those gamer traits. If you reckon you can, you're in for a treat, and you will likely as we did discover that the sometimes-immense challenge is offset by the glory of the spectacle, both artistically and technically. And believe us when we say we've barely touched on some of the most exotic and exciting surprises Viewtiful Joe has in store.With all that out of the way then, there's the question of what's changed in the PS2 port. And the answer is not a huge amount - at least to begin with. Graphically, the game suffers some slight slowdown later on, but otherwise you'd be nitpicking rather unfairly if you were to criticise it. The screenshots more or less speak for themselves. Joe and his enemies are gorgeously animated, particularly while they're in the process of being pummelled to smithereens, and his environments are magnificent - imaginative and memorable - and unlike virtually any other game on either PS2 or Cube. Again.The biggest additions to the PS2 version, though, apart from a few other secret characters, are a new 'Sweet' difficulty mode and Dante from Devil May Cry. The former is not something we're particularly enamoured with - it basically robs the game of a lot of its challenge, and, although we can understand Capcom's decision to include it, we'd still recommend that most people enter on the 'Kids' difficulty level and then graduate to 'Adult' when they first get the end sequence out of the way.Dante's inclusion, however, is something of a masterstroke. Initially we suspected it was a bit of a gimmick, but in actual fact it's far from it - Capcom's Clover Studio chaps, who handled his introduction, have not only managed to turn him into a believable VJ-esque caricature but have also given him different abilities to the extent that he's arguably more enjoyable to play with than Joe himself. The cut-scenes and dialogue have been reworked - so now it's Dante and Trish at the cinema in the intro sequence, and most of the bad guys scoff at his hell-ish credentials before going down in flames - without losing their charm and sense of humour, and he's obviously packing some toys - his fabled sword and sidearm combination.This makes quite a difference right from the get-go. Dante has extra reach on his punches, and by hammering punch in mid-air he fires his gun rather than lashing out with his blade, which makes him a lot more effective at range - extremely useful in closing out high-scoring combinations. He's also able to pick up a few new moves from the Viewtiful Shop (like the Sparda Kick), and he's wonderfully animated. And if you were wondering what happens when he runs out of VFX and loses his trademark red and black outfit, get ready for some of the blackest briefs this side of Sparda's loins...In fact, even though we enjoyed playing through the game a second time as Joe when we tackled it on the GameCube, having the option of running out with Dante - and the subtle and not-so-subtle changes that invoked - made it all the more enjoyable. We'd even go so far as to say we enjoyed the game more with the devil's tearjerker under our thumbs than the eponymous Joe himself, although we suppose your mileage may vary. It is safe to say, however, that he definitely adds a lot more to the game than we first suspected when his name popped up on a press release, and it bodes well for the sequel, which has Joe and Silvia swapping places and even interacting, that a second character works so well within the framework of the original. Actually, we're probably going to miss Dante quite a bit when it comes round to playing VJ2. How about another round of PS2 extras, Capcom?More than your average year-late port, Viewtiful Joe remains an essential addition to any PS2 gamer's library. Artistically and mechanically it's timeless enough that the wait hasn't had any negative effect, and anybody who passed on it on the Cube is in for a real treat. It's plainly not for everyone (ask yourself: is a rock-hard scrolling Capcom fighting game something you could get on board with? Yes? Keep reading) but assuming it is the sort of thing you can handle, it's a startlingly inventive and engaging game, which dares to be different - and does it with style.Shop for games now with Simply Games.Viewtiful Joe is due out on PS2 in Europe on October 22nd. A GameCube version is already available."}