{"ref": "https://www.eurogamer.net/r-spacetripper", "date": "17 Nov 2006", "game_name": "Space Tripper", "text": "- Pom PomSystem Requirements -                          Pentium III 400 or equivalent                          64Mb RAM                          OpenGL graphics card                    Those of us old enough to remember the classic coin-ops and            computer systems of yesteryear like to see this as some sort of            golden age of gaming, when the primitive machines on offer meant            that developers couldn't dazzle us with 3D graphics and instead had            to rely on pure unadulterated gameplay.                    Of course, it's all nonsense really - there were just as many bad            games back then as there are today, and even the classics look            rather simple compared to more recent titles. But this kind of            rose-tinted nostalgia is why we all love games like Serious Sam            which take us back to the mindless joystick-wrecking action of our            childhood.                    Space Tripper goes one better than Sam by taking the top-down            shooter formula of the 1980s and simply updating it with impressive            3D accelerated graphics. There's nothing particularly subtle or            sophisticated about this game, it's all about whizzing backwards            and forwards along the length of the fourteen levels on offer,            blasting away at anything that moves. As you make your way through            the game you can get power-ups which will increase the strength of            whichever of the two weapons - standard or scatter-fire - you have            selected at the time, but that's about as complex as it gets.                    There are a couple of dozen different enemies to blow up, varying            from pop-up turrets and cannons to missile-firing tanks and            fast-moving UFO-like vessels. Each enemy has its own strengths and            weaknesses, and overall they're fairly well balanced.                    Every section of the game also ends with its own unique boss,            including giant tanks and mechanical spiders. Destroying these can            be pretty challenging, as you will have to hit a particular weak            spot to cause any damage, and in some cases this target can only be            hit at certain times (such as when the boss is firing a particular            weapon). You can also blast off their weapons one by one, which            doesn't do any damage to the boss but does at least give you less            to worry about.                    If this is starting to sound a little tricky, that's because it is.            Even on the inappropriately titled ~Easy~ setting the game is very            difficult, and I struggled to get much past level five without            cheating. It doesn't help that PomPom have stuck rigidly to the            arcade formula by giving you three lives and no save game or            staging system, just a high score table. Once you have been killed            three times that's it, game over, and the next time you play you            will have to start from the very first level all over again. While            this obviously makes the game last a lot longer than it otherwise            would, it also means that you spend most of your time playing the            same half dozen levels over and over again. For today's gamers,            spoilt by quick save keys and unlimited save game slots, it might            all be a little frustrating.                    Space Tripper is an enjoyable and great looking game, perfect for            when you just want to have a quick half hour blast on something            without having to engage your brain. It's not for everyone, and the            high difficulty level combined with the lack of any kind of save            game system is likely to upset some people. But for arcade shooter            fans looking for a blast from the past with state-of-the-art            graphics, this is about as good as they come.                    Best of all, it's shareware, which means you can download the first            three levels of the game (weighing in at just 3.6Mb) for free to            see if it's your cup of tea or not. And if you do fancy buying the            full game it only costs $12 (about £8.50 at current exchange            rates), which isn't going to break the bank. Head over to the            Pom Pom website to find out            more."}