{"ref": "https://www.eurogamer.net/crossing-souls-review-pitch-perfect-80s-nostalgia-trip", "date": "14 Feb 2018", "game_name": "Crossing Souls", "text": "Beyond simply remembering and recreating history, some games make you pine for a past that never was. Crossing Souls is just such a renegade historian, taking you back to a childhood you only glimpsed in old Steven Spielberg movies. In truth, how many people wearing hazmat suits have you actually seen in real life? And do you know a single person who's managed to evade the local law enforcement on a BMX? Reality simply isn't made up of those scintillating set-pieces. Not in the 80s, and certainly never since. And yet the nostalgia's there just the same.More than that, though, it takes you back to that impossible time and place with a style of play that reminds you of countless treasured 16-bit titles, but in reality plays like none of them. It's far more refined than any single title of the era it apes visually. Just like a great racing game handles the way you want a car to handle rather than the way it actually might, Crossing Souls is a journey to a past you wish existed. Set in California during the summer of 1986, it begins when a gang of five instantly likeable kids find a mysterious stone clasped within a dead man's hand, which lets them travel between the realm of the living and that of the dead. Naturally that discovery unfurls a tale of government conspiracy and supernatural warmongering, played out like A Link to the Past dip-dyed in cyan and magenta. This sort of hyper-nostalgia has been doing the rounds lately. Perhaps you saw it in San Junipero, the BAFTA-winning Black Mirror episode in 2017. Maybe in Stranger Things, or in the Andy Muschietti remake of Stephen King's It - all romanticising 80s America, and all remembering it with a wisp of darkness. If you were particularly unlucky, you might have witnessed Agents of Mayhem trying to get in on the act last year too, throwing in the odd 80s kid cartoon cutscene and casting furtive glances around for approval. Whatever the reason for this surge in nostalgic cooings for a very particular depiction of that bygone time (and I suspect it's as simple as 80s kids now occupying entertainment media exec positions) Crossing Souls arrives right at the peak of it. It's even gone to the trouble of interjecting now and again with - yes - vintage cartoon cutscenes, warped by a faux-VHS effect. Consequently, its opening hour is one in which you're not quite sure whether it's a retro adventure that's simply content to raise a smile by referencing Poltergeist, Stand By Me, E.T. et al , or whether it also has ideas of its own. It's a misleading opening, however, because boy, does Crossing Souls have ideas. Bags of them. So many nice little touches, well-designed gameplay transitions and bespoke sequences that you can feel the three developers of Fourattic urging you on to the next bit, because there's that particularly cool thing that happens with the Cursed Librarian in the haunted library just up ahead, or, that fight with the ghost bus driver and his gang of spook kids out in the woods. As for how those ideas are expressed - the form and shape that Crossing Souls actually takes as a game - it's impressively fluid. SNES-era Zelda is the closest touchstone that I latched onto, not least due to the frequency in which I was scything down shrubs to replenish hearts and popping bombs next to fragile-looking areas of walls. Developer Fourattic's enthusiasm for chucking in three minutes of a new genre in the name of adventure, though, is what really defines it all. So it's a Zelda game with a deep affection for platforming sequences, logic puzzles, vehicular diversions. Oh, and character-swapping, too.It's an odd approach, the latter. Though ostensibly a tale of five adolescent friends working together against a bunch of evil grown-ups, Crossing Souls only hands you the reigns to one person at a time. Initially it feels a bit lonely to wander the streets of Tajunga, CA with a single character, especially after they've each endeared themselves to you so artfully. Chris the quintessential leading guy from 80s cinema. Matt the nervous lad with rocket shoes. Charlie, an analog of It's Beverly Marsh complete with deadbeat dad. Big Joe, always on hand to give a bit of sass or shift something heavy. And Kevin, who - well look, Kevin's just Stand By Me era Corey Feldman. And I'm fine with that.What's lost by having only one plucky kid in your charge at a time is, however, gained back in the thoughtful ways you're led to swap between them on the fly. In those moments, where Matt rocket-jumps over some toxic sludge so that Chris can climb some vines up to a ruined bridge that Charlie can slingshot over to reach a dusty old block puzzle where Big Joe shoves the pieces into place, they feel like a gang again. (Kevin, younger than the others, is on hand to blow bubblegum bubbles and fart too.)It adds something to what's otherwise straightforward side-on brawler combat. You save Big Joe and his extra hearts for those tougher fights against the neighbourhood gang, fronted by a Prince wannabe. You know Charlie is quantifiably quicker and more powerful than everyone else, so you bring her and her whip attack out when the projectile-flinging ghouls show up. Would you be better off with another character in this new situation? It's a question always worth asking, and that does a great deal to stave off repetition. On top of that layer of character-swapping, there's the titular crossing between realms. The kids have found a powerful stone that allows access to the mythical Duat, after all, the ancient Egyptian realm of the dead. The less said about this the better, for narrative purposes, but like everything else in Crossing Souls, once introduced its used to its fullest potential.It should be made explicit that this isn't a subversive take on 80s adventure flicks. This is no Night in the Woods or Oxenfree. It's absolutely earnest, straight-batted stuff without a single knowing glance towards the camera, and that's actually quite refreshing. At times the dialogue reads a bit unnaturally, but it's the other end of the spectrum to the hella tryhard yoof speak of early Life is Strange episodes, simply a bit stiff and functional. Perhaps it's a low-key send up of the stiff and functional dialogue in The Goonies and its contemporaries - it's genuinely hard to tell. It never truly detracts from the experience.It should also be made explicit that this very much is one of those games pixel art nerds will be posting GIFs of on Twitter for quite some time. Chris and Kevin's bedroom, where the game begins, absolutely teems with detail, setting a high bar for the following hours that's generally maintained. And as for the animations - it's the sort of game that makes you appreciate a five-frame idle loop of an old Chinese man playing table tennis more than Nathan Drake scaling a sinking ship in a storm. It has its foibles, but the sense of adventure is constant, and irresistible. That's what Crossing Souls sets out to achieve, really. Not a 16-bit Stranger Things knock-off but an earnest, big-hearted adventure. It embodies that intention throughout, making adventure its top priority at every juncture. Where other games might linger on puzzles for longer, this one says, 'quick, on to the next cool thing we have lined up!' Where some games might decide not to skip around from Suburbia to haunted forests to the Wild West for fear it might not make much sense, Crossing Souls launches itself into unexpected changes in setting and activity. And that makes it nearly impossible not to enjoy."}