{"ref": "https://www.eurogamer.net/r-cssource-pc", "date": "17 Nov 2006", "game_name": "Counter-Strike: Source", "text": "Shop for games now with Simply Games.If asked, Valve will tell you that Counter-Strike: Source originally began life as an experiment, designed to demonstrate how easy it is to port Half-Life modifications to the Source Engine. But it's easy to see how it's since established itself as Half-Life 2's chief multiplayer component; given that the majority of people who own the original Half-Life and still go online with it choose to play Counter-Strike, why waste time and resources trying to reinvent the multiplayer wheel when you can just polish an unbroken concept and re-release it as a pre-order bonus?In the end, the idea turned out to be so good that Valve also decided to remake Day of Defeat, Team Fortress Classic, the original Half-Life single-player and more besides in its new Source Engine, not only attracting nostalgic fans back to retread fondly remembered paths, and gathering new blood to the shiny old flag, but saving the Seattle-based developer the trouble of designing an original multiplayer component to tack on the end of Half-Life 2 at the same time.Having given ATI coupon holders, Condition Zero owners and LAN cafés the chance to try out a one-map beta version last month, Valve has now finally launched its Steam pre-purchase offers for Half-Life 2, and given fans who pre-order the game full access to a 'release version' of Counter-Strike: Source, featuring nine maps. Some argue that it's familiarity that fuels the success of unambitious sequels; in Valve's case, familiarity is just the kindling, and it's ignited pre-orders direct from the developer in a manner that's sure to have rival firms - including publishers - nursing furrowed brows of jealousy.As long time veterans of the original Counter-Strike, we were some of the first in line. And having spent the past few days getting to grips with CS: Source, and reacquainting ourselves with hot headed bellowing - and, in particular, screams of ~Stop running with the effing gun!~ and ~Defuse kit? DEFUSE KIT!~ - we thought we'd let you know what you're up against; whether CS: Source is worth the trouble for fans of the original; whether it's good value as the multiplayer component of a £40 first-person shooter; and whether Valve's finally managed to give newcomers a way into the seemingly impenetrable world of Counter-Strike.If we answered each of the last three questions in sequence, we could plot the resulting graph with a backslash. Yes, Counter-Strike: Source is ~worth the trouble~ for fans of the original - it's the game you remember and love, where a few minor shortfalls are offset by a resounding improvement in visual quality and a number of smaller, sensible alterations that subtly improve the experience. Secondly, maybe it's good value as the multiplayer component of a £40 FPS, but we'll deal with that in more detail later. And lastly, no, Valve's not managed to give newcomers a clearer way in.For the completely uninitiated, CS: Source's problem is that it's too exclusive. It may be simple enough to get your head round quickly - Terrorists versus Counter-Terrorists with real-life weapons, one primary and one sidearm per player per round, bought along with grenades and suchlike before the round commences, you sit out the rest of the round when you're dead, and you can win by planting/defusing the bomb, protecting/rescuing the hostages, or killing off the other team - but it's a bitch to master.Valve had planned to include AI-controlled bots to help players practice their way into CS - an approach that almost worked with the much-maligned Condition Zero - but they're not in this build (something that's attracted particular criticism given that an illegal hacked version of the CS: Source beta has been circulating with the bots enabled). So, in the meantime, players are expected to pick up and learn the maps in hostile online environments, full of people (like this reviewer) who know how to kill them before they've worked out which gun to buy, or which way to turn to get from point A to point B, or even what they'll see when they do get to point B. Let alone the best map strategies, the right radio commands, the best way to handle each weapon, the best vantage points, and everything else that everybody else already knows.Frankly, anybody coming to CS: Source afresh, hoping to pick up the multiplayer game all their friends rave about, is going to have their work just as cut out as ever, and may prefer to wait for Valve to activate the bots so they can practice and grasp the fundamentals - how the game works, which weapons to go for and why, the map layouts, and the best team strategies - offline, before heading online to start nailing down the subtleties, like the way crouching improves firing accuracy, how you move quicker with the knife drawn than a primary weapon, and what to expect from individual chokepoints in a live game.For existing fans though, CS: Source ought to provide ideal fodder on those increasingly cold winter nights. In gameplay terms it's almost indistinguishable from its Half-Life-based predecessor. Two teams race towards chokepoints and try to achieve their objectives against the clock, taking advantage of the wide variety of weapons and tactics at their disposal, and the departed troops get to sit around and spectate as they do so, chatting about the action and sharing in the pervading mood of the encounter. It makes you laugh (particularly when it's one v. one and someone accidentally kills himself with a grenade or falling damage), and it makes you cry (particularly when people run with their bloody guns), but, given time to prove itself, it's also one of the most arresting FPS disciplines in existence.Or, to make that a bit clearer, in gameplay terms the only practical differences can be run through in a couple of paragraphs. You can smash crates, computers and plenty of other destructible items littering each level. Glass, when hit by a bullet or knife, only falls away in a small radius around the point of impact, so it now takes another bullet or somebody jumping through the frosted effect of the cracked remnants to make it through completely. You can no longer penetrate two-foot walls with bullets, and a grenade going off on the other side of a wall will no longer hurt you anywhere near as much, but you can still send bullets through boxes, cupboard doors and the like. Water now splashes visually as well as audibly, giving the defending side on maps like Aztec a bit of an advantage in locating intrepid aggressors. And hostages are now capable of following you without getting stuck every five seconds, even if they still do so every once in a while.And, of course, CS: Source adopts Half-Life 2's Havok-based physics code, meaning that barrels and limp bodies are now thrown around semi-convincingly by explosions (although they do seem to bounce a bit too much at the moment), adding to the spectacle. The gameplay benefits of this are, in practice, almost negligible (you'll be lucky to benefit from any extra cover as a result of it, in any case), but it certainly contributes to the increased believability of the whole thing.But CS: Source makes no secret of its intentions - it was not envisaged as ~Counter-Strike 2~, and as a result it doesn't attempt to overhaul the dynamic, or even augment it in more than a few subtle ways. What it does aim to do though is make the game look like a first-person shooter ought to do in this day and age, and not like the five year-old game it really is. So far Valve's revisited, overhauled and released nine of the original game's maps - Aztec, Dust, Dust 2, Chateau, Havana, Italy, Office, Piranesi, and Cobble - and it's a good mixture, from which most CS fans are bound to be able to pluck a couple of favourites.Changes in terms of layout are harder to pick out. Dust has a couple of new routes and camping spots, but they're not mission-critical, and other changes are mainly superficial. All the maps benefit from a lot more incidental - and generally destructible - detail. Italy's market stall section now features all sorts of fruit displays, which react with great fervour to a grenade impact. Office, meanwhile, is a far more believable, um, office, complete with innumerable PC set-ups, signs encouraging employees and a well-stocked (albeit blown apart) underground car park.Each of the nine maps has been given a lot of love and attention, although some plainly benefit more than others. Aztec, for example, takes best advantage of the new 3D skyboxes, which create the illusion of much more depth (temples rise into the sky, and banks of hills are lined with military supplies and vehicles), all harness bump-mapping techniques to make the most of their re-chiselled textures, and many make use of the engine's various showpieces - specular lighting effects on shiny floors, particles of sand dancing in the air, realistic splash effects and water behaviour, and increased detail in death animations. Then there's the blinding effect of the flashbang - the whole screen goes white, and the image gradually distorts back into focus as you twist and turn. It's a delightful agony, now, not being able to see.Ultimately, then, as a package for the fans it's hard to criticise. We'll always have time for Counter-Strike which, despite having played it so long that we've past death and been reborn almost in synchronicity with the game itself, we still find does something enthralling and new every once in a while. And it's still our favourite multiplayer first-person shooter of all time, marginally ahead of various flavours of Quake.And yet the game is still far from faultless. Counter-Strike has always been a modification that evolves periodically as the developer tackles pertinent issues, and as a freebie we were always prepared to endure that. But in using it as bait to encourage pre-orders of Half-Life 2 - in other words, charging for it - we're forced to ask tougher questions of it, and in some cases it doesn't have the right answers. Why, in what is presumably considered the final release version of the game (and the one that will ship on Half-Life 2 CDs and DVDs), are so many classic maps left off the roster? Why haven't the bots been enabled, or presumably even finished? Why is there only one character model per team, compared to the four options in the original? Why are we seeing widespread reports of crashes and missing sound files? We appreciate things like the Report A Bug option in the main menu - minor bugs are a given, and it's better to tackle them head on like this than not, polished retail code or no - but this version of CS: Source is not the finished article many expected.Which leaves us to return to the issue of whether it's good value as Half-Life 2's multiplayer component and, in the meantime, a pre-order incentive. And it's here that Valve's attempt to avoid piling resources into a fresh multiplayer set-up arguably slips up; despite borrowing an existing game and sprucing it up, we're still forced to conclude that Counter-Strike: Source will be brilliant once it's finished, which is what we used to end up saying about most multiplayer FPS games anyway. For now at least, it needs more. Popular maps like Assault, Nuke, Militia, Back Alley, Inferno, Prodigy and Train are absent, it lacks some of the features we'd been more or less told to expect, and it's still far too intimidating for the average PC gamer to pick up anew without enduring hours of frustration and a Herculean feat of perseverance.Still, none of that should detract from the reality that Counter-Strike: Source is, once you've gained a knack for it, the most consistently rewarding and surprising team-based shoot-'em-up available on the PC today. It's been dressed up nicely for its relaunch in 2004, but it wasn't broken, and Valve hasn't fixed it. But then the developer hasn't finished it either. And that does take some of the shine off a project fuelled more or less entirely by the desire to polish.Shop for games now with Simply Games.Counter-Strike: Source will ship with Half-Life 2 at retail, and you can play it now if you pre-order Half-Life 2 over Steam. Head here to see a vast number of screenshots."}