{"ref": "https://www.eurogamer.net/r-ridgeracer-psp", "date": "17 Nov 2006", "game_name": "Ridge Racer", "text": "Bands love doing this. They release a few good albums, do a couple of tours, hit the studio again and crank out some nonsense, then return to form with a self-titled EP. Ridge Racer's a bit like that. Indeed, if the people who made Ridge Racers 1-4 did go on tour, that probably explains why RR5 and R: Racing were so ARGH; they probably whipped their heads round so fast demonstrating the cornering routines that they spun clean off and had to be surgically re-attached. Game development is much harder when you've accidentally decapitated yourself.It's easy to lose your head talking about Ridge Racer, too. Technically, it's as amazing to see on a handheld now as it was when we first got hold of our Japanese PSPs last December. It looks like a proper racing game. Reflections slide silkily over the bright chassis of your opponents, as you slide silkily round apex turns; biplanes swoop past mountainside tunnels before you dive down a hill and snake round a grassy chicane. It's never shy when it comes to the view. You can turn a bend and see a whole valley stretching out in front of you, suspension bridges linking narrow roads on either side; or neon cityscapes bouncing across your field of vision as you boost off the top of a hill, land on another bump and then boost again.Okay, so we still don't like the music, but apparently we're in a minority on that one. Pfft. Screw you.Frankly, we wouldn't care less if it looked and sounded like an N64 game. We'd still play it; what's happening with your thumbs is compulsive stuff. Played ideally from the bumper-cam view, it negotiates the return of clichés like ~white-knuckle~ and ~high-octane~ with so much conviction that it ought to get a regular slot on Newsnight talking to politicians about where all our bloody money's gone. (Where has it gone? Oh yes, we bought an import PSP.) Last year we likened playing Ridge Racer to a rollercoaster; it's not far off, even if we had been drinking too much mulled wine that day. As you drift into a corner, releasing the accelerator and then reapplying it to cut loose the grip on the rear wheels and point the camera at the inside curb, you really could liken it to hanging on for dear life - particularly as you reach the upper echelons of the Pro and Expert difficulty levels and too many lost seconds are tantamount to a lost race. Handling that fishtail exit on corners to skirt the barrier and shimmy round other cars is like adding aftertouch in a football game.Annoyingly, the early stages are much too easy, and anybody with any experience of Ridge Racer is going to clobber them in a few hours without surrendering the top tier of the podium even once. But you'll probably realise even then that it's special - from the first corner, in fact. Keep going and the onslaught of duel races, longer tours, faster cars and more fiendish track designs will make up for the slightly dull opening.The track design, definitely, needs to be celebrated. There's a lot of recognisable track design from earlier Ridge Racers, but the actual circuits merely borrow the best elements, and it's a tactic that works well; played forward and backwards at different points, there are very few weak tracks. Some of the better ones can be ludicrously punishing; we still shudder when we hit the hilly S-bends, or have to cross the river twice in quick succession, which we've never quite done without a pang of anxiety. Likewise having to send our car into a fearsome power-slide a split-second after landing a jump in front of a right-angle turn. Fouling that up is as bad as it sounds. More or less all the tracks send you up and down hills at breakneck pace (there we go snapping people's heads off again), and they're rarely wide enough to be easy. Even when they are easy, they have the decency to be entertaining, like the hairpin split over two levels that you negotiate sideways in midair.The addition of the ~nitro~ meter, meanwhile, is well judged. Nitro's been around in racing games for yonks of course, but its inclusion here is much more than a knee-jerk reaction. You fill nitro slots by drifting, and there's something deliciously entertaining about emerging from a spectacular drift on somebody else's tail, tugging on that right shoulder button and watching them vanish into the rear-view like a stranded spectator. And you can double the entertainment value when you're playing wirelessly against a friend.That, by the way, is another thing you're going to want to do. You'll probably want to practice first - learning these tracks will be a joy anyway - and once you're ready you can get up to seven other people involved. Each of you will need a copy of the game, but of all the titles in the launch line-up, this is one we can definitely imagine your friends buying too. The graphic-whoring casual gamer with an eye for shiny new toys - and, if we're honest, plenty of our friends are - will have spotted Ridge Racer a mile away, and playing wirelessly against them is a mostly lag-free experience.There are some things worth bitching about. The computer-controlled opposition is very good on the upper-upper levels, and has an uncanny ability to block your path before you can react to it, or boost past you on the home straight. But you'll probably be sufficiently pleased with the way it feels to play that you'll treat them not as pointless obstacles on the road to fun, but evil lines of code fit for munching nitrous' equivalent of dust once you find your A-game later on. Or at least once you've unlocked some of the delightful special-class cars. We're particularly fond of the one that looks like it has a giant desk-fan strapped to the back of it.That's not to say our love of Ridge Racer is a question of novelty value, however. And don't be confused by this relatively straightforward commendation. Sometimes we do feel the need to wax nonsensical about trends and structures and clever hooks and the like, but with Ridge Racer it's pretty simple: good tracks, great sensation of speed, tremendous driving model. It could have done with an intermediate entry level, and it suffers for that, but it seems churlish to mark it down too far for making you grind for a half a day when the following hours then give way to days, weeks, and, in our case, months. As you know, we played it to death at the end of 2004. We've played it beyond death now. It's not quite heaven, if we're honest, but it's definitely a heck of a good racing game, and the best Ridge Racer in ages. Go buy it.Ridge Racer is due out on September 1st in Europe."}