{"ref": "https://www.eurogamer.net/dissidia-final-fantasy-nt-review", "date": "13 Feb 2018", "game_name": "Dissidia Final Fantasy NT", "text": "First things first: this really isn't the Dissidia you might know from the series' PSP days. Dissidia Final Fantasy NT, which sees Square Enix and Team Ninja teaming up for the return of the all-stars arena fighting series, boasts little of the verticality of the originals, and the RPG elements are toned down until they're almost non-existent. It's a three-on-three fighter now, rather than offering up the one-on-ones of the originals, and the results are fairly messy too. The story mode - and, indeed, much of the single-player content - has been pared back until it's pretty much inconsequential. If you're coming to this expecting a continuation of a series we last saw back in 2011, it's sure to be something of a disappointment. There are many other areas where Dissidia Final Fantasy NT comes up short. As a package, it's more than a little slim. The story mode, as it is, has you earning Memoria elsewhere before you spend that currency to effectively unlock cutscenes - and, on occasion, you're allowed to play the game too. The tutorial, as it is, is functional at best, giving you a dry laundry list of Dissidia Final Fantasy NT's myriad systems and leaving you to figure out how to piece them together. Put up alongside Street Fighter 5's recent arcade edition, or Dragon Ball FighterZ, it's pretty miserable stuff. Perhaps it's best, then, to put aside any expectation of this being a fulsome follow-up to the original brace of Dissidia games, and instead consider it on its own terms. Indeed, Dissidia Final Fantasy NT is built upon a quaint premise you don't come across so much anymore: the arcade port, a concept that pretty much died along with the arcade as a popular destination to while away a Saturday afternoon. And, as you might expect from an arcade original that employed what amounted to a PlayStation controller split in two on its cabinet, and from a game that was always designed with the PlayStation 4 in mind, it fits comfortably enough in its new home. And while much has changed for this new Dissidia, much has stayed the same. This is still a fighting game set in small-to-medium-sized arenas where the environment can often come into play. At its heart there remains the bravery system which sees you chipping away at your enemy's bravery meter while building your own before unleashing more substantial attacks which deal out the all-important hit point damage. For all that's changed or been removed elsewhere, it's still an interesting dynamic to hang a fighting game on. It remains an exquisite monument to all things Final Fantasy, too; a bustling toybox of lovingly crafted tributes in which you can't fault the fan service. Pick Final Fantasy 4's Cecil and you can play him as either a Paladin or a Dark Knight. Final Fantasy 5's Bartz, meanwhile, is drawn deliciously close to the original Amano artwork rather than some of the often wayward sprite work of the games, and elsewhere you can relish in techno retellings of Final Fantasy 6's battle theme or skirmishes across the Final Fantasy 8's promised meadow. Also, more pleasingly, there's the chance to smash Final Fantasy 10's Tidus in the face, repeatedly, until he's incapacitated. Fan service really doesn't come much better than that. And no matter where you stand on the relative virtues or otherwise of Final Fantasy 15 and Final Fantasy 13, you can't argue the fact that protagonists Lightning and Noctis make for great fighting game characters, full of class and poise as they dart athletically in and out of battles. They're both Assassins, one of four classes in a new system that informs team composition in Dissidia Final Fantasy NT. Vanguards can soak up the damage while dealing a fair amount themselves, Marksmen hang back while Assassins can dart in and out of combat and finally Specialists offer up their own unique attributes. There are some 28 characters at launch of Dissidia Final Fantasy NT - more are due later as part of a season pass - and they're all deliciously different.The battles are faithful to the mad spark of Final Fantasy itself - a series that, let's not forget, has always revelled in mixing things up when it comes to its combat - with their whirlwind of magic and show-stopping summons. Teams have a pool of three lives to draw upon, and when an online match comes into focus, when players know their roles and sides are evenly matched, it can be exquisite; there's a thrill to be found in good team synergy, and the more basic pleasure of seeing match-ups play out like ether-infused wire fu. It's a chaos, though, which can be hard to pick through. The UI's far from user friendly, and for the new player it's a near indecipherable noise. The move to three-on-three ramps up the volume of action until it's a swirling static of attacks, often coming from seemingly nowhere, and an erratic, hard to tame lock-on system doesn't exactly help matters. But when it comes into focus, there's a good fighting game here - at times an excellent one.It's all a lot noisier than the two prior Dissidia games, though maybe that's down in part to where this iteration was born: in the bustle and din of the arcade, where games have to shout a little louder before they eventually reveal their depths and more lasting charms. This is a Dissidia that bears the mark of other arcade mainstays such as Border Break and Gundam Versus just as much as it does its PSP predecessors - and as a result it can be more than a little impenetrable. Given its emphasis on online play - there's no local versus here, sadly - it's a shame to see matches more than occasionally crippled by lag, and to see the long wait you'll often have to endure to be paired up with other fighters. Dissidia Final Fantasy NT is a game that'll live or die by its following, so it's disheartening to see the audience doesn't seem to be there at launch. Dissidia Final Fantasy NT, if you're willing to see past some of its more glaring flaws and through its unwelcoming veneer, is a game of considerable depth and charm, and one that flies endearingly close to the spirit of the arcade. Whether it can find an audience in a surprisingly busy, exceptionally fruitful time for the fighting genre is another matter altogether. It's far from perfect and there's plenty of work to be done if this is really going to play to its strengths - this isn't the Dissidia you may well already know, but once you're over that disappointment, there is at least something worthwhile in its stead."}