{"ref": "https://www.eurogamer.net/r-eg-elmat", "date": "13 Nov 2006", "game_name": "El Matador", "text": "Boot camp. It's where every good shooter begins, the obligatory training tutorial in which a fifty-something bloke with more stars on his uniform than Cat Deeley has in her eyes barks obscenities as I run across planks of wood and through concrete pipes. Then my DEA special agent arse has to negotiate the shooting range, where cardboard villains pop up at windows, waiting to be shot. Afterwards, it's time to polish my boots, then catch the next flight to South America, home of the drug cartels. My job - to stop them carting. I am... El Matador... (Cue brief burst of Spanish guitar). Stop that sniggering.The opening mission involves storming a nightclub with a squad of AI controlled team-mates. Bullets blaze and Bacardi Breezer bottles shatter as the owner's goons entrench themselves behind overturned tables and chairs. Gunfire comes from multiple directions and I quickly acclimatise to the third-person view, strafing in and out behind pillars and doorways while letting off targeted bursts of fire. It's action-packed stuff. So action-packed that there's the obligatory bullet-time slowdown feature to help the player out. No marks for originality here, obviously, but it's still damn good fun and the blurred visual effect is smartly implemented. The ragdoll physics are spot on too, with bodies crumpling realistically in a feast of slow-motion carnage.A few minutes later, my rifle ammo spent as I reach the second floor VIP lounge, something strikes me. I'm crouched alone in a seating booth fumbling through the mousewheel-driven weapons menu for my shotgun. Everything's suddenly gone very quiet. The two thugs in the next room aren't doing anything. I edge out for a look. I see a forehead and a pair of eyes staring back at me over the bar. Nothing happens. I stare at him for what seems an eternity. In reality it's about twenty seconds. Then I shoot him in the head. Somewhere in the distance, there's the unmistakable twang of a Spanish guitar string breaking.The following levels moved on through urban sprawls, drug factories and jungles, but one thing remained constant: the mood was continually shattered by daft AI. There were many such moments where I picked enemies off as they just stood there, unperturbed by the bullets with which they were being riddled. Some of these drug goons had obviously broken the dealer's golden rule, and snorted their stash rather than sold it; overdosed on coke to such an extent that their limbs were locked in place, like an adrenochromed Hunter S Thompson, rigid on the bed of his hotel room.And even when the enemy isn't immobile, they're invariably rooted to a small area. They might run behind a pillar, then leap for cover behind a bench, but they won't move from that vicinity. You can duck back around a corner and pick your next weapon at leisure - perhaps do a quick crossword - and be sure that they won't suddenly leap into view raining leaden death on your prevaricating bottom. No... they'll stay in their small zone, in scripted AI fashion. Everything feels so static, surreally so at times, and that's completely at odds with the furious all-action fire-fights that El Matador prides itself on.The fixed shooting gallery atmosphere isn't exactly helped by the linear nature of the levels. There's one set path throughout and the missions stick to the exact same formula: a massive running shoot-out chasing some drug boss figure, whom the player fights at the end. In arcade style, the boss has a giant health bar which takes several thousand rounds or a small tactical nuke to demolish, and while that's slightly silly it's at least a little different and should make for some challenging fights. Should - but often doesn't when the pillock gets stuck on a doorway, allowing magazine after magazine to be emptied into him with impunity.Then there are clipping issues, as enemies can sometimes be sniped through solid objects. I killed the first boss firing through a wall, and he couldn't shoot back at me. Neither did he make any attempt to dodge out of the way. He just sat there. I'm no programmer, but: IF [being shot] AND [not hitting with return fire] THEN [maybe move?]Little did I know that the tutorial's cardboard cutout shooting range would be such good practice for the main game. El Matador is an unsophisticated action shooter which might have been a decently average blast - there are elements of simple fun to be had in its running and gunning - but it's all messed up by the transparently scripted and static enemies, patchy AI and poor clipping detection."}