{"ref": "https://www.eurogamer.net/rev-fg-ps2", "date": "10 Nov 2006", "game_name": "Family Guy", "text": "Is it bad form to start a review with the word ~awful~? Should I adhere to convention and at least warm you up with some foreplay first, maybe recap the place Family Guy holds in the annals of animated sitcoms? That was my intent, back when I assumed that this tie-in would simply be yet another forgettable licensed platformer.But then I played it.And the more time I spent with it the more I realised that I haven't been so furiously irritated by a game since last year's horrendous Charlie and the Chocolate Factory. The fact that Family Guy comes from the same publisher (and producer) should have set alarm bells ringing. Many of the flaws inherent in Charlie - repetitive tasks, ugly level design, fussy objectives - resurface here, compounded by all new gruesome gameplay quirks.There are three main story threads to Family Guy: The Video Game, with play cutting between them as you slog ever onwards. One is just about playable, if you have a forgiving soul. The other two are gaming torture.The first gaming strand you come across involves evil toddler genius Stewie Griffin, who is determined to stop his equally evil half-brother Bertram from dominating the world. A sort of truncated platform game, with occasional shoot-'em-up elements, this is the more bearable of the three sections, although compared to any real platformer of note it's a flimsy and basic construction. The cel-shaded graphics - a technique which once looked fresh, but now simply looks thick and ugly - give an illusory sensation of depth, so precision jumping becomes a real problem. It's the sort of game where a seemingly easy leap onto a higher platform can take several attempts while you work out exactly where the platform is in relation to your character. Often, you end up using that old trick of following the shadow, rather than the character, to see where they are. It's frustrating, but nothing you haven't suffered in other generic platformers.However, Stewie's levels also involve several ~mine cart~ sections, where the toddler slides down corridors full of human fat or blood, dodging hazards and collecting power-ups. With sluggish controls, and an impossibly wide turning circle, the decision to make Stewie ricochet off walls and obstacles like a pinball turns what should be a brief and amusing diversion into a patience-testing chore - you can spend many minutes trying to ping pong him through a tiny gap just to progress. Once more, a simple task is made teeth-grindingly irritating through careless design.Meanwhile, Stewie's boorishly obese dad, Peter Griffin, takes one blow to the head too many and becomes convinced that TV's Mr Belvedere has kidnapped his family, and that the general public are his brainwashed servants. He hits the streets, assaulting everyone he sees in what amounts to a very simplistic and repetitive beat-'em-up. Children, old people, women - none are safe from his rampage. While the very idea of pummelling the most delicate members of society raises a transgressive chuckle, once again the implementation bleeds it dry of any entertainment.For no apparent reason, each enemy type can only be taken down by a certain move. Punches will fell old ladies (try it - it works!) but have no effect on kids, who need to be kicked. Later levels introduce foes that require you to land every hit from a three-button combo before they'll fall over, a feat made elusive thanks - once again - to the faux-3D scenery and generally slippery controls. When being attacked by multiple enemy types, there's not much you can do other than hammer the buttons and hope to fend everyone off before your energy runs out.However, the worst levels of all star Brian, the family's erudite hound. He's been falsely accused of impregnating a pedigree pooch and must clear his name by collecting evidence from various locations. He does this by sneaking (and I use the term so very loosely) through some of the most heinously designed stealth gaming ever committed to disc.It's over six years since Metal Gear Solid graced the PSone, yet here we find oblivious sentries marching on pre-ordained routes around rigid mazes, with no indication of what their line of sight is. You can tiptoe, crawl and disguise yourself, but the essence of the challenge is agonising trial and error as you work out the solitary sequence of directions that will get you through each room safely. Get spotted and it's back to the start. Again. And again. And again. By the time the game randomly introduces the notion that Brian is compelled to pee on potted plants should he linger near them too long (an act with inexplicably loses any disguise) you'll be groaning in dismay every time the action switches to these miserable sections. Several times, I switched the console off rather than face yet another Brian level, only to be goaded back to the joypad by the nagging of my professional conscience. You, of course, will have no such obligation.What's most noticeable is that, even while playing the less aggravating sections, this game is rarely entertaining. Careless game design means that even the most promising concepts are rendered virtually unplayable, forcing you to repeat inane tasks for little reward. The pain is heightened by lazy controls and stupid artificial obstacles which mindlessly ramp up the difficulty, yet require nothing more than stubborn determination to defeat. At best, it's a game you'll trudge through out of habit, smirking at some of the vocal quips (at least the first thirty times you hear them - they get significantly less funny after that) but never truly engaged with the game. It's mind boggling to think that at no point during production did anybody realise that, for all the jokes and fan-pleasing nods to the series, Family Guy just isn't fun to play. At all.The one glimmer of potential present in the game comes from the baffling mini-games, which interrupt the action at pre-determined intervals. Much as the TV show plays heavily on non-sequiturs and random humour, these games often come from leftfield. At one point, Brian the dog turns to the camera and says, ~This is why I don't vote~. Cut to a short challenge in which you must dodge Abraham Lincoln as he tries to drag you into a voting booth. Evade his clutches and you return to the level in progress, with a brief spell of invisibility. Equally, success in Stewie's mini-games earns him icons that upgrade his raygun, while Peter gets bonus snackfoods, which can trigger a powerful spin attack.As part of the overall game, these interruptions become quite annoying - rarely giving you any time to work out what you need to do, and triggered in the most clumsy fashion - but they do hint at how a far less painful Family Guy game could have been created. A WarioWare style compilation of scatological micro-games would have been far more in keeping with the style of the show, and you only have to look at the cult PSone title Incredible Crisis for an example of how such digestible offbeat challenges can be worked into an entertaining and evolving narrative. As it is, we get this instead.You wouldn't think it possible, but cartoon games have an even worse track record than film adaptations. South Park, Futurama, The Simpsons - all have debased themselves thoroughly when making the leap from telly to joypad. And yet even by those low standards, Family Guy is a pretty desperate experience. It gets three points, simply because that's roughly how many hours of vague amusement a devoted Family Guy fan will probably wring from this tired cloth before they give up and watch the DVD. With some bloody-minded perseverance, that same amount of time will also allow you to see at least half the game, which should be more than enough to dissuade you from attempting to see the rest."}