{"ref": "https://www.eurogamer.net/r-nfscarbon-x360", "date": "3 Nov 2006", "game_name": "Need For Speed: Carbon", "text": "Like a lot of EA's annual cash-cow staples, Need For Speed has been through more peaks and troughs than your average cardiograph. Perhaps inevitably, after last year's palpitating return to form with Most Wanted, Carbon's solid but formulaic approach to street racing struggles to raise the pulse for much of the time. The problem? It's just too damned easy and plays down the role of the police to the detriment of the game.As well as lacking a long-lasting challenge with weak opponents and wide, easy tracks to race around, the premise is a whole lot simpler this time around too. In terms of look, feel and structure, Carbon feels more closely connected to the hugely popular Underground games despite picking up where Most Wanted left off. After an ill-fated chase sequence with bounty hunter Cross, you hook up with an old 'friend' Darius and begin the familiar process of taking over territory by winning races against rival crews across the neon-lit Palmont City.But despite offering what appears to be a vast number of challenges to overcome, the truth is that even newcomers to racing games will be able to see off the majority of the tasks at hand in the main Career mode on their first or second attempt. The basic idea is to work your way around Palmont's streets and scalp territories by winning the various race challenges dotted around on the openworld map. But as with previous NFS games, you can quickly jump to each race by simply calling up the map and selecting which one you want. Every victory wins you cash and unlocks more powerful cars and upgrades, and by applying the necessary performance enhancements and buying the appropriate cars when they appear for sale, you'll easily see off three of the game's four territories without really breaking sweat. It's more forgiving than your average priest.For the record, most of what you'll play in Carbon has been seen many times in the other recent Need For Speed titles, and feels instantly familiar. The roll call of modes includes your common or garden Circuit races against seven AI opponents, the solo Checkpoint races, point-to-point Sprint races, and a welcome reprise for Most Wanted's excellent Speedtrap races, while you might recall the old Drift races from the Underground games. If you've played a Need For Speed game in the past four years, you'll know the deal - it's incremental update territory once again, with the same basic handling and glossy, mainstream approach to street racing that sells faster than fake Burberry.Fortunately, Carbon is saved from being a complete rehash of old ideas thanks to the trio of modes formed around the challenging and snaking Canyon tracks; first up there are basic point-to-point (Sprint, in other words) Canyon races; secondly the immensely challenging Canyon drift races and, finally, the Canyon Duels. Arguably the most challenging mode in the entire game, these two-part races demand intense concentration and skilful driving to win out - not to mention a fair bit of joypad-bashing frustration towards the very end of the game.In the first part of Canyon Duels you're tasked with driving as close to your opponent as possible for the duration of the race. The closer you drive, the more points you clock up, and - better still - if you manage to overtake your opponent for 10 continuous seconds you will win the race outright. Slip up, though, and you risk losing the race outright if you drive to your doom off the edge of the track or fall too far behind for 10 seconds. Assuming you manage to get to the second leg, you then have to do the whole thing in reverse and get to the finish line before your accumulated points tally ticks down to nought. As with the first leg, if you cock up and allow your opponent in front for 10 seconds, or drive off the edge of the cliff you have to start the whole thing from scratch.Exclusive to the 360 version is Race Wars. Present in both the challenge mode and as a post-boss extra in career mode, the only real difference between this and, say, the circuit race is that you get an extra 12 AI opponents to race with - but given that they're all pretty easy, the novelty of racing against more AI is generally redundant after you've boosted past them all on roughly the second bend. Ah well, thanks for trying.The other big new addition to this year's Need For Speed are your crew members. Available for hire after certain key races in Career mode, you get the choice of racing alongside one of three 'wing men' during Sprint, Speedtrap and Circuit races. The first, and arguably most useful, is the Blocker, thanks to his ability to skid across the path of opponents ahead of or behind you, thus giving you the chance to either extend your lead or claw back a deficit. Later on you also gain the Scout, who helps you find the numerous shortcuts, while the Drafters - in theory - let you slingshot past them at great speed if you drive in their slipstream. The problem is, unless you're driving on a straight it's near to impossible to gain any extra speed, and given that you'll most likely boost on straights anyway, they're a bit redundant.As interesting as it is to have your crew helping you out in races, the feeling persists that EA's effectively added a cheating device to make it easier to win races. The truth is, for most of the game the blockers are a little too effective for their own good, and as result you'll power through the bulk of the game before you really have to learn how to get the most out of the handling. Beyond the third of the fourth major territories, they actually become completely useless and unable to keep pace for much of the time - although speccing up their rides does help."}