{"ref": "https://www.eurogamer.net/r-archlord-pc", "date": "2 Nov 2006", "game_name": "ArchLord", "text": "I'm killing cubes of jelly. Dozens and dozens of cubes of jelly. They didn't attack me; I just went for them, because someone told me to. Fortunately for cube sympathisers, new ones appear more quickly than I can murder them - I would put this down to some weird asexual amoeba reproduction, but the trouble is the deer are doing the same. And, frankly, I don't even want to think about how the floating eyeballs breed.Hitting cubes of jelly with a magic stick should be kind of hilarious, but it really isn't. I am not having fun. So far, Archlord is exactly like what people who don't play MMORPGs think MMORPGs are like. The only thing that keeps me going in any way is the knowledge that in five levels' time (which means about 900 cubes of jelly slain), I'll finally be able to get a new weapon. With this, I'll be able to kill cubes of jelly slightly faster, though still primarily by pressing '3' and waiting.  If I wanted a bit of a break from killing cubes of jelly, there's someone over there (also killing cubes of jelly) who looks almost exactly the same as me. They'll continue looking the same as me until one of us hits a certain level, at which point we'll be allowed to buy new armour. Of course, everyone else will look exactly the same again once they hit that level, even if their chosen new armour has some minor stat differences. If I so desired, I could go and hit these eerie clones, but I don't really want to. They're surely as unhappy as I am right now, so it'd be really mean to go and kill them. Oh - one other thing keeps me going. If you move the camera juuuuust so, you can see up my generic anime character's generic anime skirt. The blurred, stretched textures for her underwear are so cryingly awful that it looks very much as though she's wearing crotchless panties with unkempt pubic hair sticking out of each side. This is not, I must state, in any way erotic, but it is consistently hilarious, and the most entertaining element of Archlord's deeply uninteresting world. Such an oversight is also a sure sign that this is just a mechanical process with something crudely resembling a game slapped on top.A few more cubes of jelly die. The part of my brain that's still conscious idly notes that the red ones take slightly longer to defeat than the green ones. Then, on the horizon, a Gnoll. It's got an animation and everything. Woo! I start hitting it. Despite it being the same level as this sex shop-attired elf-thing with rabbit ears I'm playing as, it kills me almost immediately. For the first time in five hours of hitting cubes of jelly and things that are essentially cubes of jelly but look different, it's apparent that I might need to group with another player. This is a problem for four reasons.I choose an alternative option. I go and kill hundreds more cubes of jelly, deer, moths and floating eyeballs until I'm a bit stronger. Until I'm a full three levels higher than the Gnoll, in fact, with a couple of new spells in my arsenal and a magic crystal added to my magic stick that probably does some sort of fire damage, but I'm not sure because all it says is 'Fire Elemental Stone +3'. Just for good measure, I also drink a potion that temporarily turns me into a giant spider.The Gnoll kills me in under two seconds.I lose three per cent of my XP, and take ten more minutes to run back to my hairy nemesis. Initially, I'd presumed I was up against some sort of boss, but now I notice that beyond the Gnoll are dozens more Gnolls, all the same level, in the same pose, each flagged up as green (the universal MMO mob colour for mostly harmless), and, as harsh experience and a wasted giant spider potion has taught me, each and every one of them meaning near-instantaneous death. I turn to face the other way. There's a red cube of jelly waiting there. I could almost swear it winks at me. I sigh, and press '3' to attack.Time passes. Slowly.I'm many levels higher. I have a better stick to hit things with, and my clothes are now red instead of blue. I also have a pet big fire demon, instead of the previous useless water imp thing. I eventually killed that Gnoll, but only once I was four levels higher than it and had some slightly better stats, mostly thanks to a magic necklace dropped by a cube of jelly. I've been all over the map, seen far too many clusters of empty buildings, devoid of people but often with new, bigger monsters - vampires, wolves, tree demons and, best of all, blue cubes of jelly. Some are easy to kill, some are like that deadly Gnoll. Trial and fatal error is the only way to learn. In any case, all of them wait in place to be killed, then respawn, then wait again. Atrocious controls have gotten me stuck on scenery time and again, the entire game world jumping crazily as it tries to work out how to make me walk through the tree my foot is almost touching. Not even the crotchless panties make me laugh any more. A few trips to PvP battlegrounds, intended as a break from the grind, have turned up only empty arenas with the occasional mad-tough AI bat flitting about. I'm informed that, like Codemasters' other recent foray into localising Korean massively multiplayer grind 'em ups, RF Online, there is more enjoyment to be had once the PvP really kicks in at the higher levels. There are castle sieges, which sound exciting - but only the most dedicated guilds (and they do exist, clearly possessing far more spare time than sense) will ever see these, having earned the right, from near-constant play, to try and seize a stronghold from a rival group. If you're not prepared to give yourself to this game utterly, then you'll simply never see any of this. In other words, it's back to the cubes of jelly for you. There's much I haven't mentioned (for instance crafting, auction houses, mounts, kill, collect and errand quests, socketed items - all to be found in other, better MMOs, and all horribly clunky here), but none of it honestly affects the overall experience of Archlord. Regardless of it being very hard to picture how its tedious, clumsy mechanics could possibly evolve into something fluid and entertaining, any game that puts you through a good 15 or 20 hours of overwhelming despair to get to even a chance of something worthwhile - which the server-wide near-silence suggests actually isn't, and certainly won't be until if and when there are enough players to populate large-scale tussles - is a failure. If you want an online fantasy game that puts PvP before character and customisation, then there is absolutely no reason to play this over the dramatically superior Guild Wars: Nightfall, also out this month. Like this, its world design and character self-expression is short on charm, but GW does present its best element, the fast and exciting player fights, as an immediately available option, and without Archlord's insult of a subscription fee. If you want an online fantasy game that lets you repeatedly beat up animals and collect loot, there's absolutely no reason to play this over the dramatically superior World of Warcraft. It's incredibly pretty, there's loads to see and do, and plenty of scope to make a unique-feeling character. Neither Guild Wars nor World of Warcraft have an interface that's like using Windows 95 with a migraine. There are also no cubes of jelly.Somewhere, someone on this ghost world is an Archlord. Briefly blessed with increased power and size, the ability to change the economy and weather, and even a dragon to ride on, they are the most successful player on their server. It's their reward for the hundreds of hours they've put in, the tens of thousands of NPCs and players they've slain. It's a temporary trophy only the most insane grinders will ever chase, and it's supposed to be the game's unique selling point. Unless I sacrifice almost everything else in my life to play this hour in and hour out, there's more chance of my marrying a magic cube of jelly than there is my becoming Archlord. Frankly, I'd also rather marry a magic cube of jelly than have to play this game for that long."}