{"ref": "https://www.eurogamer.net/r-samnmax1-pc", "date": "2 Nov 2006", "game_name": "Sam & Max Episode 101: Culture Shock", "text": "Who needs time travel when you've got modern videogaming to take you there whenever you please? Playing Doom on Xbox Live Arcade a few weeks back was a truly odd experience. It was hard to believe that a 13 year-old game could feel so damned good after all this time. Did someone steal our brain and erase all our memories from that year onwards? We've grown so used to old games shattering our rose-tinted spectacles that you tend not to visit the past without the protection of a hazard suit, but playing Doom again was different. It was a rare reminder of how great game design transcends almost everything else, and playing the new Sam & Max fills you with that same warm 1993 glow.Amazingly, it's like it's never been away. Hardly anything's changed. You get the kitsch introductory animation sequence with our heroes driving along in their car to a slightly unhinged jazz soundtrack. You even start the game in the same damned office. It's got the dartboard and the open window. And the telephone. And the same clean, simple point-and-click interface. You're just waiting for your heart to be smashed to smithereens by the new voice actors who don't quite know what it means to be a laid back detective dog or a psychotic rabbit sidekick. You're half-expecting them to try too hard in that way that remakes and comebacks tend to.But it doesn't happen.It's actually really laid back. At first a mild titter as Max makes a typically sardonic remark, and then an audible guffaw tumbles out of your innards. And before you've even left the first location the first belly laugh. In minutes you'll have your faith utterly restored in the adventure genre's ability to utterly entertain as you shake your head at the effortlessly dry humour that punctuates every exchange. You'll marvel at how simple and intuitive it is to play, and how spot-on the visual style is, and begin to forget that it's not even the same guys doing the voices. You'll be making mental notes of the innumerable quips and wondering why anyone thought not making games like this for 13 years was a good idea. And it doesn't stop for the whole fat-free three-hour episode. Like any great point-and-click adventure, the story's one of the star attractions. Culture Shock's self-contained episode centres around a mysterious, hypnotic DVD that's being given away for free at the local store by one of three brainwashed Soda Pop child-stars from the early 1970s. At the centre of all this madness is another washed-up '70s celebrity with self-worth issues, and it's up to the freelance police to put a stop to his fiendish plans. It's pure Sam & Max nonsense, helped no end by the paranoid ranting of Bosco the 'inconvenience' store clerk, a militant rodent and Sybil, the local psychiatrist. With barely a lull in the proceedings from start to finish, the only thing on your mind is 'please don't stop'. Like any great comic entertainment, you'll want to see it several times.But a great plot and consistently witty dialogue only scores you so many points. It's the fact that the interface is so refreshingly simple and unobtrusive and the puzzles so satisfying and logical that keeps you entertained for the entire time. There's literally nothing to give you the dreaded point-and-click rage - and even the celebrated 'Hit the Road' was regularly guilty of that with its often wilfully obscure sections and back-tracking (from fuzzled memory, at least). That's not to say Culture Shock is too easy, mind you, but with a control system that simply requires you to click on what you want to do, you're only ever left floundering because of your own inability to think about the problem at hand than any unreasonable demand from the game designers. As such, the actual control interface has been refined a tad, with no need to dictate whether you want to pick up, look or use an item first. Simply clicking on an item, or dragging it out of your box inventory and giving it or using it on the person or item does the trick just fine, and clicking on a person instigates a conversation. Simple. Thankfully, the conversation system goes back to the age old method of listing four sentences, rather than just an icon or person's face - and it's here that Telltale also gets things spot-on by not getting carried away with over-long dialogue. It's never less than fun, and always leaves you wanting more, just as it should be.The Telltale team also appears to have learned several valuable lessons from the somewhat flawed Bone episodes in terms not just of how it plays, or how logical the puzzles are, but also how the game actually looks. We must admit to having grave concerns whether its rather basic 3D engine would suit the comic book style so crucial to Sam & Max, and might have advocated a return to the 2D style that served Hit the Road so well - but seeing it in action, all fears are instantly alleviated thanks to a greater degree of care and attention to everything from the locations to the standard of character modelling and animation. While some might still prefer the more sympathetic rough and ready style of the 1993 vintage, Telltale has managed to infuse just as much subtlety into every scene - so much so that Culture Shock at times feels like the high-res update that you demand and expect.Culture Shock is the loving update we dreamed of. It's the kind of game you want to be playing when your friends and family walk in the room, if only to demonstrate that there are videogames out there that aren't just about killing things and smashing cars (even if, yes, you can actually do both in this, albeit in typically slapstick fashion). Even the jazz licks of the soundtrack make you want to turn up the volume in celebration. You want the whole world to know that people still make games like this - ones that not only make you laugh, but everyone else too.It's such a relief to be able to stop banging on about how much this interminable wait for a new Sam & Max game hurts, and an even bigger relief to discover that Dan Connors and co have pulled it off and finally exorcised the ghost of their LucasArts past. Thanks guys. Culture Shock is only the beginning, though, as the pilot episode of this six-part 'season' that promises to become an essential part of the gaming landscape over the next year. Sam & Max: Episode One: Culture Shock is a wonderful piece of entertainment, and easily the best adventure game since the days of Grim Fandango. It's not only the most 'fun' game we've played all year, but also the funniest and deserves to succeed so that other developers are inspired to take the same calculated risk as Telltale and follow their own vision. It's also, without doubt, the best advert we've seen for the merits of episodic gaming (and at just $8.95 per episode, superb value), and frankly, the gaming scene is going to be brightened up no end over the next six months by a regular dose of Sam & Max if this is anything to go by. Go and party like it's 1993.Annoyingly for anyone outside the US or Canada, the new episodes of Sam & Max are demoing on GameTap for the time being. However, Telltale's releasing the games a couple of weeks later on its own website, and finally that time has come for Culture Shock. Woo!"}