{"ref": "https://www.eurogamer.net/review-mka-ps2", "date": "2 Nov 2006", "game_name": "Mortal Kombat Armageddon", "text": "Oh, how times have changed. Violence in media is now far more accepted than it was when Mortal Kombat first hit the arcades, but despite the fact that the world has moved on around it, Midway's once-celebrated fighting series has barely moved an inch in the fourteen years since its introduction. The comedy violence still raises a chuckle now and again, sure, but just as the world's attitude to violence has moved on, so have people's expectations of what a fighting game should deliver.Armageddon welcomes back every character ever to have graced the series but with a roster sixty characters strong, don't expect any kind of real balancing. While fans of the series may struggle not to drown in their own drool over this massive cast, anyone even marginally less fanatical won't recognise at least half of them. Much of this number is made up by the huge number of clone characters that were nothing more than cheap additions to the digitised versions and while there's obviously been some attempt to differentiate between them, the fact that so many characters look and play alike is still very much in your face. Some of the bigger characters and bosses have been toned down to be made playable too, so where Motaro was once a giant centaur, he's now lost a couple of feet for his bipedal and far less imposing look in Armageddon. One of the strangest choices with this final MK of the generation is to do away with traditional character-specific fatalities and replace them with the universal Kreate-A-Fatality mode. Once the trademark 'Finish Him!' booms forth, you're now able to string together any number of minor punishments into one huge string of hurt. Much of the lure of each new Mortal Kombat title is going through the characters and seeing what gruesome new ways those bloody-minded chaps at Midway have come up with for putting a full stop at the end of a fight, so to do away with this is really pretty brave. The move pays off though, and while there's only so many times you can enjoy Liu Kang setting someone on fire or Reptile getting his snack on with the loser's limp body, this freeform system is arguably one of the strongest points in the game's favour.If you'd rather try your hand at something other than one-on-one fighting, Midway has laid on a couple of extra modes for you to play for few minutes before realising that they aren't very good. Konquest mode, while far better than its sorry equivalents in the last couple of games, is basically Shaolin Monks Lite with the odd one on one match with a famous face thrown in for good measure. It's not terrible and given that many of the game's secrets can be unlocked here, it's probably worth going through if you intend to play Armageddon for any length of time. Slightly more questionable is Motor Kombat, an ill-conceived yet mildly distracting kart racing effort, which carries over much of the grizzly humour of the main game. It's nowhere near as good as Puzzle Kombat, though and the inclusion of a simplistic kart racer on a game that carries an 18 certificate seems somewhat bizarre but still, Motor Kombat is okay for a few minutes of peace between brutalising characters you don't really care about.As an exercise in brutality, Midway's latest struggles to keep up with the likes of God Of War and Dead Rising in terms of sheer nastiness. The comic edge and heritage keep it afloat but that's about it. As a fighting game, though, Mortal Kombat Armageddon is pretty damn poor. Simple dial-a-combos and basic juggles are about as far as depth goes, with the odd super-cheap special move to abuse if you get bored of just pummelling your foe. The old system of each character having three styles to learn has been trimmed to just two this time - a hand-to-hand and weapon style each - to make things more accessible, but commands for most characters follow the same simple patterns anyway, so it's pretty tough to get lost once you find the only couple of combos of any worth and commit them to memory.New features like the parrying system attempt to claw back some kind of respect from players that have been treated to the delights of Dead Or Alive, Virtua Fighter and Soul Calibur but to little avail. The core combat is still as rigid and throwaway as the Mortal Kombat series has ever been and bereft of the kitsch appeal of the earlier games, Armageddon is pretty much as forgettable as brawlers come these days."}