{"ref": "https://www.eurogamer.net/r-bullycce-ps2", "date": "25 Oct 2006", "game_name": "Canis Canem Edit", "text": "Once again, they've let me down. Honestly. I mean, I've played about eight Rockstar games now, and I'm still not a highly trained professional killer. Am I playing them wrong or something?Oh well, let's talk about what Bully, or Canis Canem Edit, actually is.Bully tells the story of a young chap called Jimmy Hopkins, whose dysfunctional family dumps him on the doorstep of the even more dysfunctional Bullworth Academy, where he's supposed to receive an education, but ultimately ends up fighting to unite all the rival groups of miscreants and carve out a relatively sane niche for himself, while the teachers get drunk, fornicate and generally worry about themselves.The whole thing largely subscribes to the Grand Theft Auto template of game design (presumably it's worked in the past - someone check). So some things are the same (the slightly cockeyed in-game mission briefings with their convoluted exchanges, the basic controls, the bicycling, mini-map, side-missions, collectibles, wardrobe-changes) and some things are wrapped up differently (wanted ratings are now a 'trouble meter', in-school 'police' are burly prefects). But there are lots of new bits too, and these have the greatest impact. Bully's very much its own game, even if it draws on GTA for its technological base.It's on a different scale, most notably. Since you're only little, there's no driving. You can pinch a bicycle or ride the skateboard you earn early on, but mostly you just run around pretty quickly by hammering the X button, and so the town of Bullworth is a bit more detailed and cluttered with interactivity than the worlds of Carl Johnson or Tommy Vercetti. Almost all of your missions are about doing things on your feet, too: collecting things, sneaking around, protecting people, causing mischief, picking locks, walking girls home, and so on. And the greater concentration of things to do works in tandem with a much greater variety of activities, keeping you occupied just as much as you were when you were messing about in Liberty City or San Fierro. You might be walking back to the dorm after gym class, for example, and spot an orange mission marker on the basketball court, and spend the next 20 minutes wagering money on a mini-game about booting a football at a cocky prep. Or you might spot the arcade machine near your save point and play some of the rubbish '80s-style driving game. Or you might just be walking along and spot a blue X on the mini-map, spin round and find another student asking you to do an errand for some extra cash - like stuffing people in lockers or egging them. There's tons to do outside hours.~Hours~ are another thing: you're a student, and there's a routine to this. You get up at 8am, and there are two class periods before you get to the end of the day, at which point you have a few more hours to mess around before you need to be in bed - and you do need to be in bed, because if you're not there by 2am you'll just fall over and wake up at home the next morning. If only real life were like that.You can skip classes, of course, but you'll need to keep an eye out for the prefects if you do. If you're causing trouble or playing truant and they're alerted to it, their little Metal Gear-style cones of exploration will fire up on the mini-map and you'll have to stalk and evade, and sometimes leg it to get away from them, either by outrunning them or sneakily hiding in a rubbish bin or locker until the trouble meter subsides. And anyway, you won't want to bunk off, because the teaching mini-games are another layer of variety and fun (word jumbles for English, a Qix knock-off for Art, rhythm-response for Chemistry) and completing individual lessons unlocks things. English helps you apologise to rampaging bullies more effectively, avoiding trouble; Art betters your chances with the girls (or, as much publicised by giggling bloggers, the boys), Photography unlocks photo albums and Shop Class (Technology for me) unlocks BMX bikes. Plus, once you're done with a lesson's five levels, you don't have to bother any more.One thing you spend a comparatively large amount of time doing is fighting, and Bully does a good job in this area, drawing upon The Warriors as much for inspiration as GTA. You target people with L1, then hammer away with punches, grapples and throws on the face buttons - a repertoire quickly augmented with more elaborate attacks like uppercuts and kicks in the knackers, earned by attending Gym, or finding radio parts and swapping them for lessons with the demented homeless guy round the back of the school. You can also do a few finishing moves, getting the victim to slap himself in the face, or worse.But, as previously mentioned, you could just apologise and get out of fighting at all, which might be an idea as too much violence not only incurs the prefects' wrath (and if they bust you enough, you'll end up doing detention mini-games, which aren't as much fun), but also affects your standing with the various cliques. These groups - the preps, the jocks, the nerds and the greasers - all play a part in the various chapters of the story, and throw up their own respective characters and objectives, so there's inevitably a bit of back and forward on the respect-o-meters. But you don't want to overdo it, or you'll end up getting jumped when you really could do without the hassle, like when you're in the middle of a mission.Where Bully perhaps falls down a bit is in the writing department. I never thought Grand Theft Auto was as funny as it clearly thought it was, but you couldn't help but laugh every now and then, and the satirical bits and in-jokes - though a bit lazier in the later games - were often pretty memorable. Bully's main narrative doesn't stray much from the zero-to-hero recipe we're all very familiar with by now, and it's also a bit obvious in places. There's a drunk English teacher, who fishes another bottle of Scotch out of the desk drawer after you've forced him to give up the one he was drinking; there's a sandpaper-throated old cook who sneezes into the stew; there's the uptight headmaster and his fawning secretary; and the gym teacher who spends his money on dodgy tapes and magazines; there's the dunderheaded bully who needs re-educating, and the podgy squeaky nerd with the milk-bottle glasses, and the power-hungry posh kid with ADHD, and so on and so on and so on. Jimmy's likable enough, the cut-scenes are watchable and some of the NPC dialogue you hear thrown around the schoolyard and town makes you titter, but it's mostly easy targets.Ultimately I didn't mind too much though, because there's an enormous variety of things to do, and they're consistently enjoyable. You can box Punch-Out-style, mess around on Halloween with eggs, marbles and flaming poo, and just gently terrorise people with mischief. It hits the early-GTA-game balance between things to do and toy around with and actual set-piece adventures to work through really well, and there are lots of collectibles too - rubber bands, radio parts, trading cards, and unlockable bonuses like pumpkin masks, new save locations (handy for staving off the pain of tracing a path back to the dorm at the end of the day, since you can sleep in these too), and special weapons. Nothing sinister, mind, with no blood at any point and no death either - even violent altercations, like the boss-fight climax to chapter one, come to a relatively benign conclusion.Indeed, that's a fair comment on most of the game - there's nothing objectionable here on any level. The frame rate stutters now and then, but never becomes a problem, and the camera's a bit awkward and disorientating if you're trying to turn Jimmy and manoeuvre it at the same time, but it's nothing you can't cope with, and the difficulty curve never spikes the way GTA often does. And upon that base of competency, Bully builds an empire of fun, and hits some really high notes - with now perhaps a good time to mention the orchestral soundtrack, which is memorable from beginning to end, whether it's the twinkling school theme, the lively twangs that complement prefect and police chases, or the bassy after-hours accompaniment.That, and many others, are lessons rival developers, keen to cash in on GTA's success, could do with absorbing. In recent years, they've declared open season on the genre Rockstar created and then propelled to infamy with GTA III, but even those of you who've become disillusioned after an endless barrage of games like The Godfather, Saints Row and True Crime will gain plenty of enjoyment from Bully. Not overly long and certainly not difficult, it nevertheless defies its ignorant detractors, and ultimately redecorates the house Rockstar built with flair and imagination.Although it's bloody rubbish if you just want some help killing people like on TV."}