{"ref": "https://www.eurogamer.net/r-gothic3-pc", "date": "19 Oct 2006", "game_name": "Gothic 3", "text": "In order to set the scene, let's go back to the first couple of hours in Piranha Byte's third-person swords and goblins adventure and take a gander at my mission list: Yep, you guessed it. Such well-worn tasks so early in the game can only indicate that we're back once more into a comfortable, traditional role-playing territory we know like the back of our hand. In essence, it's a sequel that's returned home from a stressful term at university, older and wiser, prepared to spend a week snuggled up in its Transformers duvet as the smell of its mum's home-made macaroni cheese wafts under the bedroom door.In other words, Gothic 3 isn't an exercise in pushing back against the colossus of Oblivion, that RPG that now pretty much defines the fantasy genre in Europe and the U.S. Given the latter's pedigree, that would have been foolish. Instead, Gothic 3 is an attempt to successfully improve on both the ancient fantasy template and its own personal formula. In a sense, that's its own reward: the first two in the series fell in between the pre- and post cracks of Morrowind, usurped by that game's scale. And while it did gain some popularity on the continent, we'd gather it passed a lot of you by. This time, however, by concentrating on evolving in its own niche, number three succeeds on its own terms: an interface that actually works, a modern lick of paint, and an (albeit misfiring) attempt to revise its fighting system; now's as good an opportunity as ever to step onto that carousel of orc-bashing familiarity.Devoid of reams of back-story and supplementary literature, don't worry, it's as easy for newcomers to jump in as it is for veterans - maybe a little too easy for those who invested their hard-earned time in its prequels. Here's all you need to know: you've just returned from adventure and intrigue on the island of Khorinis only to find your homeland of Myrtana conquered by orcs (and your stats inexplicably reset to zero, coincidentally). It's up to you, then, whether you work on uniting the rebels to liberate the land, or side with the mercenaries and kiss some scaly green bottom for a share of power and one of the alternate endings. All the while there's the whiff of something bigger beneath the surface, a dangerous element that threatens to rear its head the further you progress. As per bloody usual.Again, don't worry: names and places aren't important. Such a conventional RPG format (talk, get quest, do quest, repeat) and an admittedly pedestrian script make characters mere conduits for quests rather than people you actually care about. So what exactly makes the archetypal Gothic games such a respectable yet undervalued series? Perhaps, chiefly, because of its open-ended world, a vast potential of lush greenery sculpted lovingly by the designers (joined this time by obligatory desert and ice landscapes). It's a beautifully rich free-form environment, as much a pleasure to explore without resorting to combat as is World of Warcraft's or Oblivion's, even if that natural splendour does come at something of a price. The graphics engine's a bit of a system-hogger and on lesser computers can chug more than a charity worker at a frat party. If you've already upgraded your system to make the most of Oblivion or equivalent you'll be well-serviced. If you're one of the many who are committed to holding out for Vista before taking the plunge, and hence have a graphics card that runs on coal, prepare to lose quite a bit of detail.Yet, for all its go-anywhere charm, unlike 'that-game-beginning-with O' (we really can't escape these Elder Scrolls references, can we?), it's not overwhelming in its scope. Because while there's plenty of room to manoeuvre and missions to undertake, in terms of character-building, things are vastly reduced.Ostensibly, Gothic 3 plumps you with one unalterable character - a bland, bearded nobody with little in the choice of class or weapon skills. You're then given the choice to specialise as a warrior, hunter, or magician. It's nowhere near as dynamic as Dark Messiah, however and, in the world of Myrtana, circumstances tend to dictate becoming a bit of a jack-of-all-trades. For one, because the opportunity to confidently shoot off a few spells doesn't occur until a lot later on, and two, because you need all the help you can get. Those who've experienced Gothic numbers one and two should realise that they could be a bit of a tough cookie on occasions. Unwieldy melee-combat and unrelenting beasts, coupled with a slow levelling up system, meant progress was somewhat tardy. At times, it felt more like picking away at the edges of the game to find an unguarded weak spot, than to go in guns blazing. (Or swords slashing, I suppose.) Get surrounded and you're done for, so most times you resorted to picking individuals off from afar with your bow before wading in with a blade. And still dying. A lot.Gothic 3 goes some way to improve on that fighting system, but still hasn't quite got it right. On the default difficulty level (easy's a bit too easy), it's often grossly unfair: it's near impossible to successfully counter after you've been hit once, meaning the enemy can land a flurry of death-dealing blows before you even recover from the first. The ability to cope with groups by directing your swing helps, but it's not ideal. Initial weapons and armour are pretty weedy and all the promise of being able to string light and heavy attacks together amounts to nothing more than frantic button-bashing. And, bizarrely, it's far easier to kill a man than it is to kill a wolf. Something to remember in life in general as well, we feel.But if combat's just a part of the experience, Piranha Bytes have thankfully countered that persistent gripe by making overall progression far easier and slicker than before. As well as being able to outrun any beastie before it chases you halfway across the map, more than before a good deal of quests won't even require you to unsheathe your weapon. Missions are generous and experience points are given out willy-nilly, sometimes just for talking to people. For that reason, you'll fair shoot through the early levels earning enough learning points and amassing cash to buy up the various stats and skills that make you a stronger person pretty early on. It's not as much of a chore anymore, but it's also balanced enough not to completely break the challenge.The same goes for pacing. Where previously you might have spend your first few days running around the open countryside wondering if you're making any kind of dent in the plot, Gothic 3 refocuses the drama. Each town and faction has its own problems and its necessary to build up a self-contained reputation via the completion of dedicated quests before siding with the orcs or the rebels, depending on which way your moral compass is pointing. So while the main story still lingers at the back somewhat, once you've conquered that little part of the world, you genuinely feel like you're getting somewhere. It's an incentive that goes hand in hand with the exploratory nature of the title.While there's a lot of walking to be done initially, once you've found a town's teleporter stone you're free to go back there wherever you please. No horses, unfortunately, but straying off-road, there's plenty to encounter in the hills and valleys. What can't be forgiven, though, is the AI of the NPCs. Occasionally you'll have the choice of accompaniment in battle or have to escort someone to somewhere else. Forget it. They've got no sense of self-preservation and readily blunder into packs of wild animals without a care in the world. For those essential missions, the only solution is to cut a prescient swathe through their intended route before activating their quest. So much for innovation.Yet for all the negatives, it's easy to get drawn in and enjoyable to boot. Let's face it, checking off that mission list and saving up enough cash for that new suit of armour is never going to get old. Gothic 3, indeed the entire Gothic series, is one of those games you feel a bit of a soft spot for. It's one with which you're able to overlook most of its faults entirely because it'll always been the overachieving underdog. Never mind 'that-other-RPG', if you're willing to make excuses for a meagre plot, paucity of character and a relatively scaled down role-playing experience - in itself, no bad thing as it's still huge - it's as compelling as can be surmised. At times gorgeous, at other times frustrating, it's worth persevering with just to bask in its snug atmosphere."}