{"ref": "https://www.eurogamer.net/r-fm2007-pc", "date": "18 Oct 2006", "game_name": "Football Manager 2007", "text": "The back of the box asks us to ~think like a manager~. Now that's just asking for trouble. We don't want to end up the subject of a Panorama expose - not until we're close to making our first billion, anyway. By then we'll have a castle in space and find ourselves eating dates off the toned backsides of nubile princesses and will laugh in the face of financial investigations. The Wikipedia entry will read like Hunter S. Thompson's secret life as Ron Atkinson's therapist.Let's think [sharpens knives]. Dare we even speculate how a football manager really thinks in this money-obsessed age of bungs, divers and prima donna underwear models masquerading as professional sportsmen? Okay, let's get into character. This could be fun.I didn't see the incident. They're all honest lads at this club. Early doors. It was clearly offside/onside. It was a blatant penalty/handball. The referee's had a shocker. There was a divot in the penalty area. Our away strip's unlucky. Our studs were too short. He covered every blade of grass. I've never been offered a bung. How can I be a racist? My son was exaggerating. £4.8 million after tax you say? Untraceable?We could be flippant for the entire review, but the truth is that Sports Interactive know better than anyone that the relationship side of the game is practically half of what the job entails these days and it's no surprise to see much more effort going into this side of the game in this year's version. You might recall that last year's incarnation was a tentative step into the world of manager mind games, but this year's ups the ante considerably by extending the idea to players too. It's an idea that has a subtle but ultimately profound effect on your ability to gee up your squad and unsettle rivals. It's possibly one of the most brilliantly evil ideas that Sports Interactive's ever come up with, and of course we couldn't wait to put it to destructive use wherever possible.Much like the manager mind games in 2006, the actual list of things to do is kept to a sensible limit (sensible in as much as it'd be exhausting to read through all the possible permutations if the list were any longer), but it's one of those things that's enormously welcome and does genuinely make a difference to the way you play the game on a micromanagement level. It gives it more personality, and in turn gives you, the manager, more personality and has a distinct effect on how others perceive you and react to you. Being able to openly tap up a player through the media and slag them off is a superb move. It's definitely a small step in the right direction for a game that on a football-strategy level doesn't have to be a great deal better than it is already. All of these additions aren't just an excellent bonus, but (depending on how much you delve into using them) can make a real difference to the way you play and experience Football Manager. It really is becoming the ~Football RPG~ that SI appears to want it to be.In fact, the more you play Football Manager, the farther the player-interaction element taps into your inherent desire to glean more information. Going further into the realms of using your players in more varied and interesting ways, the feedback they provide is often very useful at uncovering potential troublemakers in the team, or finding out whether potential transfer targets will fit in - being able to, for example, ask them their opinions on who they think you should sign could be every bit as useful as anything a scout could tell you. Also, the effect of giving an opposition player a roasting in the media, or openly flattering them could have dire consequences when the rival manager decides to exact revenge by unsettling your team with transfer talk or, worse still, actually buying your star names.Team talks, too, are so much more than the stab in the dark that they used to be. Previously, you just made your feelings known and didn't really get any sense of whether it did the trick or not. It was one of those typically placebo-like effects that may or may not have made any damned difference, but felt good to be able to administer all the same. This time, you get to go through the whole team talk process if you so wish (none of it's mandatory, remember), be it pre-match, half-time or full-time, and then actually get feedback from your assistant manager after the game. By observing how each player reacted to your team talks, you can begin to work out what makes each player tick in any given situation, giving you a chance to administer a different one-to-one approach the next time you're in the same position.And in this spirit of greater interaction, old hands will be delighted/horrified at how certain boards can have a dramatic bearing on the fortunes of a club - just like in real-life, you might argue. Suddenly being told that an offer for your star player is ~too good to turn down~ could potentially turn your season upside down (unless you risk firing an ultimatum at them, but that's a hefty chance to take), but them's the breaks. But it works the other way around to the extent that you can thumb your nose at rival managers' ~hands-off~ warnings by splashing the cash and going over their heads with a fantastic offer, while making your admiration of them very public in the national press. It's a spiteful, evil game this year, and we love it for it. You might even find yourself on the end of a board takeover and given more money to spend. On the other hand, it could all get very West Ham and prove to be hugely unsettling. At worst, you'll be dumped on the dole and forced to find another club. Evil, evil game.If you want to really get your hands dirty in the nether regions of the game, then the 2007 edition lets you go further than ever before towards micromanaging. Stuff like the affiliations you can build with so-called 'Feeder Clubs' is one of those long-term operations that's really difficult to appreciate in the context of a review, but another excellent idea that mirrors what's going on in the real world. Being able to farm out promising youngsters to them on loan so they can get extra experience is excellent, as is knowing that you can get first option on their best players if you so desire.Yet another significant overhaul is the way the scouting system works this year, thanks to a much easier to understand 'knowledge bar', which let you gauge a scout's local knowledge and direct him accordingly. For instance, if you're in the market for the best that the Portuguese league has to offer, it's probably not a good idea to send one of your chaps who's best served in scouring the Scottish leagues. And even when you have identified a transfer target, being able to stall during the latter stages of the deals, for example, (or conversely get 'gazumped') is one of those crucial extra bits that happen in many transfer wranglings, and one of things that can have a large bearing on how your season pans out. Every time you think SI can't make something better about its game, something minor but fundamental details makes you re-assess. Later - much later - you might even peel away another layer and discover how much potential there is in paying more attention to your youth system and delight at the new ability to sign pre-contracts and suchlike. Or you might just as easily ignore entire facets of the game entirely and get along just fine. As multi-tiered games go, there are few others that hide as much depth and detail as Football Manager does. Newcomers need not fear the talk of depth, and therein lies one of the secrets to its success. In fact, we'd go as far as to say that FM 2007 is the fastest, most accessible version to date.We could go on about all the little tweaks and refinements until we're Alex Ferguson in the face (that's officially a colour, by the way). It's not especially sexy to remark on how the new icons make it easier to navigate, for example, or how the sight of your subs warming up on the touchline reminds you of their presence, or how much better the match commentary is these days, but, together, all these are the little things that contribute towards Football Manager always being one step ahead of the competition. If you wanted to be extra critical about Football Manager 2007, the main issue you might have is the amount of 'junk' email it throws at you throughout the week, often about things you really might not have an interest in. Perhaps in future versions Sports Interactive should give players the choice over how many elements of the game they want to engage with. For example, some of us are only interested in the tactical match day element - so why not give those players a 'lite' version that runs at lightning speed and cuts out all the media and player interaction. Admittedly you'll never please everyone whenever you add new features, so why not simply give people the chance to filter things out if they never intend to use them?Having honed so many elements of the strategic side to a shine, refining the interface, and improving the realism with every version, you might assume that all they had to do was rebadge the game with '2007', apply a data patch to ensure that all the clubs in all 50 of the represented countries are up to date and, bosh, new version. But actually, deciding whether to buy the latest Football Manager isn't a hard decision - especially if you've taken a break from the genre. If you want a game that lets you take a club to glorious heights or just go on a one-man sabotage mission to ruin Manchester United, then this is by far the most refined, in-depth and yet most approachable version Sports Interactive has come up with to date. The significance of player interactions, in particular, shows the Islington-based team refusing to rest on their laurels and doing more than ever to distance themselves from the chasing pack, and the many other changes merely improve things further, Far from being a lazy update to an already feature-rammed game, Football Manager 2007 is a revelation. It's no longer simply about displaying your strategic acumen and ability to wheel and deal in the transfer market, but a fascinating journey into the man-management that plays just as crucial a part in the role of the modern coach.As Sir Bobby once noted, ~Well, we got nine and you can't score more than that.~"}