{"ref": "https://www.eurogamer.net/pocket-28", "date": "17 Oct 2006", "game_name": "Tomb Raider: The Osiris Codex", "text": "The subject of countless articles, films, magazine covers andsexual fantasies, the Tomb Raider action-adventure game series andits heroine the lovely Lara Croft have attained considerablepopular fame.However, considering that amidst the gaming communitymany versions are as famous for their skittish controls as theirbuxom heroine, the prospect of piloting Miss Croft with nothing buta mobile keypad seems a daunting one. In truth we needn't haveworried - iomo has produced arguably the friendliest iteration ofLara's adventures to date and a damned good 2D platform game toboot.Before you start the game proper it wisely provides a compulsorytraining level which introduces the different controls which allowyou to climb ladders, push boulders, leap across platforms and ofcourse dispatch defenceless animals as you go treasure hunting. Fortunately it's all quite simple with the use of a contextsensitive action key ensuring that those using a joystick will onlyhave to refer to one button on the main number pad.Once you've traversed the basics, (and you can always go backlater for another intro if you forget anything) you have the optionof the full on adventure spread over multiple levels ofincreasingly fiendish tombs, an arcade mode to play through aspecific level or the panic-inducing time trial. The latter isparticularly welcome offering a great variation on the challenge bypopulating a training level with snakes and zombies and challengingyou to repeatedly run the gauntlet in order to shave a few secondsoff your personal best (ours was 2 minutes 35 seconds if you'reinterested).Whatever option you plump for though you're guaranteed anenjoyable and well-balanced challenge. The levels are genuinelyvaried and offer a good mix of head-scratching problems and panickyshoot-'em-up action packed into handy 3-5 minute chunks (perfect forcigarette-breaks, or those angry few seconds after the neighbour's dog binds you in its lead, Mrs. Jones has finished apologising profusively, and you feel like putting a few things down).Graphically the game may not offer the usual buttock-gazingstimulation but a nicely animated cartoony Croft is pleasing enough,and all in all this a worthy addition to the ever growingcannon."}