{"ref": "https://www.eurogamer.net/pocket-26", "date": "17 Oct 2006", "game_name": "Bomb Jack", "text": "Like many retro classics, the premise of Bomb Jack is absurdlysimple - with the emphasis on 'absurd'. You assume the role ofJack [oh right, phew! - Jack] whose mission is to travel the world via aserious of single platform-laden screens (the backgrounds andenemies let you know where you are) in search of bombs which needdefusing. To aid you in this quest you have the ability to jumpfrom platforms, along with a gravity defying cape whichallows you to effectively slide through the air. Stacked againstyou are a series of unlikely enemies (ranging from snails andmummies to flying saucers and flying hieroglyphics), whose meresttouch is sufficient to stop you in your tracks and forfeit aprecious life. Unless you've been lucky enough to catch a power-updisc which temporarily turns the tables.If you're struggling to grasp the premise, think of a sort of vertical Pac-Man with lessbarriers and more gravity and you'll be on the right lines. Indeed,like Pac-Man, the game is essentially a challenge of basic strategyand lightning reactions. Unlike the yellow gobbler however there'sa little more variety to the screens and enemies and a good dealmore subtlety on offer in the control system as you modify yoursuper leaps about the screen, changing direction in mid-air tododge a villain.For our money this makes it a far more enjoyablegame, and with the bursts of action divided into multiple levels it'sideal for the mobile platform. Add in some visuals that are morethan faithful to the Spectrum and C64 originals and you've got allthe ingredients for an essential mobile game.Where the whole thing falls down is with the hardware. Thecontroller on the GX-10 simply didn't offer the requiredsensitivity in the heat of the action, too often leading to anunfair demise or an accidental brush of a selection button bringingup the menu screen and although the situation was improved slightlyon other handhelds, there were still concerns.Hence the ultimatedecision will depend upon your confidence in your digitaldexterity. If your joypad is as sensitive as all those women on TV advertising toothpaste thenBomb Jack is an absolute must. The rest of you might want to save yourself thefrustration and buy a sandwich instead. Just remember to brush afterward."}