{"ref": "https://www.eurogamer.net/subnautica-review", "date": "24 Jan 2018", "game_name": "Subnautica", "text": "~Never get out of the boat,~ says Captain Marlowe in Apocalypse Now. ~Not unless you're going all the way.~ It turns out this is just as true of a submarine, and especially at night, 300 metres below the surface. I'm on my way back to base from a salvaging trip, hold packed with lithium from shale deposits on the edge of the reef. The sub - a chubby, whirring frisbee with a bubble cockpit - has taken a few knocks while rooting through the trenches, and in a moment of great wisdom, I hop out to perform some repairs. It's not an entirely idiotic decision. The sea floor ahead is thick with towering ferns that provide cover for a species of coyote-like predator, whereas right here I can see nothing save schools of fish the size of my thumb, twisting in the dark like flurries of snow. In hindsight, the absence of larger fauna really ought to have set a few alarm bells ringing, but all I can think of are the scratches on my Seamoth's lovely yellow finish. Besides, I've got two health packs left, and a fancy thermo survival knife that cooks anything you hit with it. The water holds no fear for me.I've barely aimed my repair gun at the sub when there is an almighty crunch and it vanishes. Turning, I glimpse the vessel's headlights spinning wildly through the blackness, and in the glare from those headlights, a corkscrew motion and the flash of dense, milky-white flesh. Whatever it is, it's so big that I can't see all of it. There's another horrible metallic screech and the Seamoth is released, to dangle sadly in a halo of debris and spurting gas a hundred metres off. Swimming over to it takes approximately ten seconds and thirty million years. Scrambling inside with my heart in my teeth, I hastily switch off the lights and check the sub's hull strength. Five per cent. The water around me is utterly still. All the same, I decide to head back to the shallows before attempting further repairs.Terror, wonder, and a generous whack of underwater DIY. This is Subnautica in a nutshell. Available in feature-complete form this week after three years on Steam Early Access, Unknown Worlds' impressive survival sim casts you as a lowly but very able crewman aboard the starship Aurora, sometime in the late 23rd century. As it begins the Aurora crash-lands on a remote waterworld following a mysterious explosion. Regaining consciousness, you find yourself adrift in a damaged escape pod, the Aurora's enormous, burning carcass the only thing visible on a balmy blue horizon. Beneath lies an alien ocean two kilometres across and one-and-a-half deep, writhing with undiscovered species and the materials you'll need to make a home on this planet and perhaps, solve the riddle of the Aurora's crash while you wait for rescue. The phrase ~alien ocean~ is, of course, something of a tautology - what more alien a place than the ocean? - and Subnautica's Spaceman Crusoe setup isn't really about transporting you to the seas of another world. It's about turning the ocean we know and marvel at into something manageable, a harrowing yet pliant entity, rich with carefully graded threat and opportunity. In this regard, it is both an absorbing, mesmerising survival game and a melancholy commentary on our attitudes towards the environments that have inspired it.The game's survival and construction systems are well-wrought, and on paper, a little humdrum. You gather resources from the sea to fashion into supplies, tool, structures and ultimately, vessels using a nigh-magical 3D printer, one of the few surviving instruments aboard your escape pod. To assemble these things you'll also need blueprints, collected by hand-scanning scattered pieces of wreckage from the Aurora, with more advanced blueprints and valuable resources naturally found a long way from your starting location. It gives rise to a familiar loop of scavenging in order to make yourself a better scavenger, checked by the need to eat, drink and clear out your inventory. If you're a veteran of survival simulations, all this may sound very dreary, but Subnautica's choice of environment is transformative in ways both atmospheric and functional. To be perfectly facetious, it's a question of depth. Where other survival games are merely about heading out, Subnautica is also about heading ever further down. Close to the escape pod the water is shallow and inviting, swirling with things you can eat and light on things that can do you harm. There are fat rollercoaster tubes of coral that house mineral deposits (plus the odd noisy surprise), and shimmering sandy basins where you'll find walrus-like creatures with gumball tails sporting clownishly. At night the reef becomes a fairground, lurid with glowing purple fungus and flights of unblinking neon eyes, making it possible to hunt after sunset. But as you venture beyond this idyll, whether to answer a radio call from another survivor or in search of rarer parts, the dance of smaller fish recedes, the water thickens and the silhouettes you spy undulating in the distance grow less and less friendly. There's also the problem of pressure. With your starting gear, you'll burn through your oxygen very quickly at anything beyond a hundred metres down, and each vessel you build has a maximum safe depth, increased by crafting and modifying upgrade modules. This imposes a gradually retreating barrier on exploration, a barrier that can be bent just enough to reward ingenuity and daring. Of all the temptations to overreach in recent video games, few things rival parking one of Subnautica's gleaming, fragile vessels just above the point of being crumpled up like a paper cup, and spotting, a few score feet below, a piece of starship wreckage you don't recognise. You can almost certainly swim down to that object, scan it and make it back before your air runs out, but there might be other things lurking nearby, and who knows what might happen to your trusty sub while you're out foraging. Fortunately, the game's soundscape is as nuanced as its visual design, though I could do without a lot of its electronic score. Each creature has a distinct set of calls, from noodly chipset noises to eardrum-bursting roars, and the game considerately dials up the volume when something with lots of teeth is coming right at you. I'll try not to spoil too much of what you'll actually find in the void below, but suffice to say that the map is divided into various biomes, all brilliantly distinguished by the mood and texture of the water, some extending far beneath the planet's crust. To make the most of these abyssal regions, you'll probably want to relocate from your homely escape pod to a custom habitat, nearer the rifts that provide access to the caves. Sadly, while it's a thrill to wander around your very own base - complete with such luxurious fixtures as automated water filters and bioreactors where you can turn rotten food into electricity - the game's first-person building interface can be a real headache. Buildings often refuse to clip together for reasons that aren't clear, though the ability to dismantle them without sacrificing resources takes the sting out of error, and the limited inventory means you'll do a lot of toing and froing between storage facilities and the building site. In what is possibly a technical problem, base structures are also very picky about clutter. You're free to drop items all over the seabed while outside, but everything needs to be in a locker while you're indoors, so you can't just dump bricabrac temporarily to fit something else into your inventory. The aggravation of all this is eased by the option to build a mobile base, the Cyclops - a submarine so capacious it has its own docking bay for smaller craft, and external cameras to help you navigate cave systems or work out what exactly has just clamped itself to your keel. I've turned mine into a sort of software developer's allotment, with growbeds (top tip: melons are a good balance of calories and hydration), ~keep calm~ cat posters and an inexhaustible coffee machine.In the context of a genre that is overfond of incremental upgrades, those vehicles and certain key tools like the laser cutter are refreshingly bold transition points - both revealing possibilities and altering how you think about routine activities in a manner reminiscent of Metroidvania. The Cyclops essentially allows you to decide where you want the centre of your world to be, moment to moment. The Prawn robot suit accelerates resource-gathering by letting you drill into nodes of ore, rather than smashing open scattered outcrops with your bare hands - an important prerequisite if you want to erect any truly gigantic habitats, though you might also build it simply for the exhilaration of boost-jumping over brine pits deep in the catacombs. Together with the environment's lure and those relatively arcane diving mechanics, this adds longevity to a game that might otherwise settle into a rut. Typically, I find my enthusiasm for survival sims tailing off after 15 hours or so - there are only so many trees you can punch into firewood before the mind begins to wander. With Subnautica, I broke the 30 hour mark almost without noticing.Squirrelled in amongst all this is a deftly written and well-voiced story, delivered mostly via audio diaries and database entries. It paints a picture of a universe much bigger than the game, and dwells on the theme of interspecies exploitation along the road to some Halo-ish concluding revelations. Inevitably, this theme lends the process of grinding your way up from castaway to property owner and apex hunter an air of callousness. The almost-total scarcity of lethal weapons - a conscious developer statement about gun violence, following the Sandy Hook massacre in 2012 - prevents you from dominating this world, but it is nonetheless a world that is yours to prosper from, a world laid out and marked up for consumption and navigation, however eerie it may appear. The  feel is almost of plunging your head into a massive 3D user interface, composed of symbols and patterns we might associate with phone screens or, indeed, Subnautica's own in-game computer terminals: orange circles, glowing purple hearts, pearlescent cross-shapes and darting green arrowheads.Think about that, and you might also reflect on how the real ocean is awash with languages, audible and visual: strobing octopus colour changes that are all the stranger for the knowledge that the animal is incapable of seeing them, the snicker and yelp of dolphins, the rasp of sea urchin teeth on rocks and networks of whalesong that reach from Australia to the north Atlantic. This is a play of communications we are currently overwriting, as oil and gas companies carry out undersea detonations, light pollution affects the balance of power between coastal fauna, and cargo ship engines fill vast stretches of water with disruptive low frequency sound. Subnautica's ocean takes this overwriting to a cataclysmic end by offering up an ecology in which human and nonhuman languages are one and the same, in which everything that makes a lifeform unique and miraculous also badges it conspicuously for our use, as though you were swimming through clouds of button prompts and desktop iconography.While you could argue that it's more elegant to leave these implications unspoken, I think it's a shame that the story doesn't dig into them at greater length, rather than reverting to some familiar science fiction cliches. Subnautica is daunting and enigmatic in a way few survival sims are. Its choice of setting and peculiar constraints rejuvenate a species of game that is always at risk of disappearing under a cloud of toil and mealy-minded acquisitiveness. But I wonder whether there's another version of this game, somewhere out in the lowering darkness, which is no less beautiful and complex but far weirder and sadder, and which says something truly remarkable about the ocean without and within."}