{"ref": "https://www.eurogamer.net/r-dotstream-gba", "date": "9 Oct 2006", "game_name": "dotstream", "text": "Released in July and exclusive, for now, to Japan, the 'bit Generations' Game Boy Advance games are simple game concepts offered at budget prices. Encouraged by the idea, we set out to spend all Tom's money on them. First: dotstream.Kristan says that you can't invert the Y-axis in Scarface. So that's probably challenging. It's also relevant to dotstream in two ways, neither of which I will properly explain until later in the review, thus forcing you to read more of it! Ha! Hahaha! dotstream is unexpectedly challenging, and dotstream also lets you invert the Y-axis, but in more of a graphical manner.Screenshots, the silicon tits of games, do a poor job of conveying the fact that it's a racing game. This is because, at a glance, dotstream looks like a sine-wave boy band; little sinusoid heartthrobs dancing in line to blippy '80s game music, with squares and dotted blobs pirouetting around them.The truth isn't that far off, although it's not so much their pirouetting as your dodging. A sort of mixture of Tron light-bikes and F-Zero, dotstream involves piloting a single pixel, leaving a colourful wake, by pressing up and down on the d-pad to shift around obstacles. Confused? Look at the screenshots, and realise that you control only the farthest right point of one of those pretty dancing dot streams.It's got five GPs and each has five tracks, and like F-Zero you balance the need to reach into a nitrous-style boost reserve to catch the opposition against the fact that each collision with the scenery eats into the same cache, and retirement is the only option if you use it all up. Simple beyond F-Zero, you have just two boosts, and recharging along the home straight is impractically time-consuming; in other words, the pressure's greater throughout.The choreography part comes from the colourful streams left behind each pixel. Holding a straight line next to another pixel allows you to gain some speed from it, but you can't sit in another pixel's wake. Cross one of those lines and you're brushed to the other side of it, like a metal filing riding across a negatively charged magnet. With the gaps between obstacles often only small enough for a few pixels to pass alongside one another, and the opposition always starting in front of you, graphically it's a tight knit tussle between threads, and you gain the most ground through careful route-selection and making the smallest possible adjustments with the d-pad to avoid sacrificing speed in carving around things.Each course tries to force you into over-adjusting, positioning obstacles in clusters - with arrows that force you up or down, pads that slow you completely, and hard-edged blocks all vying to hinder you. Narrow gaps make it hard to avoid other pixels, and putting things like boost pads directly in front of them increases the agitation. Pick-ups that remove or allow you to pass through the scenery, or slow down the opposition, can be put to good use, but even with them dotstream's a game where you're always scrambling to make up ground.That's not the unexpected challenge though; what's unexpected is that with retirement or last place more than likely the first time you try most tracks, dotstream is a game where GP victories won't come easy. I can't even remember the last racing game where I needed more than one go to win the first GP. It's refreshing.And to finally justify the intro (a bit), the other significant game mode besides Campaign and Spot Race (single race) is Formation, where touring a never-ending course eventually gives you control of six lines simultaneously. Initially it's impossible to direct them all through the obstacles you face, but as you complete GPs you're given more control of them, able to pull the pixels together in a straight line, turn as a group and swap positions - like flipping the Y-axis on a graph.Formation takes a while to get going and proves quite repetitive though, with the challenge of collecting little white blobs to maintain an energy meter different but slight, while dotstream as a whole could do with a ~Restart~ menu option so you have less time to wallow in failure (as it is, if you mess up and want to restart a GP, you have to switch the machine off and on, or hammer buttons waiting for the next race to start so you can select ~retire GP~). The latter point speaks of a difficulty curve that's quite abrupt about its punishments. It's refreshing, but there's only so much novelty to its cold-shower-at-6am.Nintendo's Japanese bit Generations games, of which dotstream is one, are trying to hark us back to the good bits of the bad old days, and on this front you can't really fault dotstream. If someone told you it came from 1989, but for its reactive soundtrack and multi-button controls you wouldn't have trouble believing them. The crucial bit is that you'd suddenly wonder how on earth it passed you by, because it's excellent. Let's hope the next bit-G box I tear open's as fun-packed as this one.dotstream is one of seven 'bit Generations' titles released for Game Boy Advance in Japan at a budget price. Nintendo has yet to announce any plans for the games in the West, but each is perfectly playable thanks to English menuing."}