{"ref": "https://www.eurogamer.net/r-defcon-pc", "date": "6 Oct 2006", "game_name": "Defcon", "text": "Want a long shot? Now that the media firestorm engulfing Bully is beginning to rival weekly scandals about what Dennis the Menace is up to for absurdity, how about Defcon as most controversial game of the year? It's a game that features the annihilation of every city on earth every time you play. All it takes is a dirty nuke going off somewhere (and that's bound to happen sooner or later, yeah?), a screenshot of the city disappearing beneath an ultra-white nuclear bloom and the small legend ~7.2 million dead~ and suddenly Introversion is public enemy number one.While a large corporation tends to reel away from controversy, there's a nagging suspicion that Intro-~We didn't want a publisher f***ing up our game~-version would revel in it. Hell, with their love of a well-planned publicity stunt, you half expect them to use a hastily constructed nuke to level Birmingham, if only to build up a little more hype. (Why Birmingham? Why not.)Defcon - if this string of cheerily tasteless jokes about Armageddon hasn't made it clear - is a game about nuclear war. Essentially, it's that famous scene in Wargames turned into a videogame. Except this time, there's none of that wimpy ~Shall we play a game of tic-tac-toe~ nonsense. Some nation's going home in an ambulance. Possibly literally, since everyone will be tiny radioactive dust.Defcon is simultaneously very Introversion and completely unlike anything they've done previously. It's partially inspired by the popular cinema of their childhoods (just as Uplink was by Wargames, and Darwinia Tron). It's a strategy game, but with a heavy influx of action elements - even the animation-free Uplink was a game where quick actions were essential and time was the most relentless of foes. It's got their minimalist yet professional graphics style, all cool computer graphics. It's got their equally minimalist stark audio. And it's extremely good, which probably doesn't really fit a ~style~, but is certainly something they've managed to do so far.That said, in many ways, it's the least ambitious of Introversion's games in terms of design (I dare say, wrestling with online multiplayer for the first time, technically it could be the hardest). It's also the one which you suspect may be their most commercially successful. ~Nuclear War~ is immediately understandable and an attractive subject for a game. It's their first multiplayer game, so leading the possibility of a more active community. And more than any of their other games, it's the one which is closest to the mainstream of a commercial genre: it's recognisably a real-time strategy game.Not that it's anything at all like Command & Conquer. In the basic game, you're given control of one of the six sides, one mapped to each continent (Asia is split into a north and south components). You're then given access to all the equipment you'll ever have in the game. Position each on the landmass, working out how they'll interact with one another, and then sit back and have a nice little war. There's no construction here, only destruction.The mainstay of your forces are your nuclear silos, which switch between a defence mode where they shoot down incoming missiles, and an intercontinental attack mode where they can fire off their ten. There's a considerable delay switching between the two, and they're completely undefended when they're launching. That said, they're relatively hardy and can resist a chunk of hits before disappearing and leaving a nasty hole in your defences. Which is more than can be said for the radar stations, which are totally essential for locating incoming attacks and tend to shatter easily. Airbases can switch between bombers, which fly to their destination and then launch nukes, and fighters, which can take out bombers in transit and attack ships. Navies comprise three sorts of unit - battleships, submarines and carriers. The latter alternate between launching planes, hunting submarines and (er) being shot as they've no defences. Submarines, underwater, are almost impossible to find, but have to surface before they can launch their own nukes. And battleships just exist to stomp anything else on the surface of the sea.The game, much like a nuclear war, is one of escalation. Units are placed in Defcon 5 and 4. On 3 and 2 conventional attacks can kick off, with ships attacking each other or infiltrating. And on 1 - where the majority of the game takes place - the birds can take to the air and make the human race as nothing.The heart of the game lies in the matters of placement and timing. Your decisions in the initial set-up will come back to haunt you, as you try and work out how best to manage the many facets of the situation your actions have shaped. Each of your cities has a differing population, and deciding which direction an attack will probably come from is paramount. While taking out a silo is tricky, placing radar so they're over-vulnerable can lead to holes in your coverage and nukes sliding through. In actual play though, it's timing over placement. Managing to strike when a silo is in its launch mode, and thus unable to shoot down incoming fire, is where the megadeaths start adding up. The simple horror of a submarine fleet surfacing when you've left - say - the west coast of Africa without protection is a sublime horror.Well... that's one of the game's hearts anyway. The other heart of the game is the simple joy of seeing a nation disappear under a mass of slowly expanding white orbs, or watching the long arcing trajectory of a swarm of intercontinental ballistic missiles converge to avenge the strike. It's all blisteringly atmospheric.Despite there only being one map in the game, Defcon manages considerable tactical variation depending on the game mode. In normal mode, you gain points for killing opposition populations and lose points for the death of your own. Logical enough. However, you can also play in genocide or survival modes, where you only gain for the death or others, or only for the survival of your own. In any mode where you gain points for killing others, expect a tall-poppy syndrome to kick swiftly in, as your initial success marks you out as a target for everyone else come the endgame. Conversely, survival games see people risking fewer attacks because it leaves them open to a counter.The more extreme modes especially will see the most extreme variety of play. The much-discussed office mode, where a game is played in real-world real time of six hours or so isn't quite as unusual as you'd expect, but Speed Defcon - where it's at maximum speed constantly, and the Earth burns up in fifteen minutes - is like a hyper-tactical missile command. The specific diplomacy game, which begins with every player in a single alliance sharing radar information - in other words, a game where everyone knows where best to strike right from the off - leads to some of the most intense considerations of where and when to stab. Stab too early, and you're an easy target. For everyone. Stab too late, and you're going to be the one who is stabbed.Defcon is as pure and direct a game as its inspiration, and its limitations are ones of the game's basic scope. There's a single world-map, of the real locations, which, while it offers more strategic variability than you may expect at first, is still a hard limitation. You can expect the modding community to step in here. In terms of its actual dynamics, there's a splash too much open unfairness in play - mass ganging-up on a player is enormously tricky to defend against, but could lead to some very determined politicking and manipulation on the player's behalf. For example, I'm starting to experiment with deliberately suffering some early losses to make me a less attractive target. Perhaps my main reservation, though, is that in the basic game modes the game plays at the slowest selected speed at any point, meaning that a tedious player who insists on slowing things down can grind a game to a tedious sludge. Of course, that's only on default, and you can easily change its settings.But its failings of scope are easily forgiven at the impressively well-judged price Introversion has chosen (£10 direct download, with an extra fiver if you want them to send you the box. Alternatively, purchase over Valve's Steam). It's some manner of end-of-the-world sale. In fact, this almost pushed Defcon into the nine. Some argue that price shouldn't affect marks, but those people are predominantly either the enormously rich or pirates. Marks are only a buyer's guide, so have to include whether you have to throw down. I've decided against it, but this is a solid eight, as unshakable as my four-silo defence of the Warsaw Pact nations.Nuclear War has no winners. Except Introversion. And gamers.Defcon is out now, and you can purchase it at Introversion's excellently named website. www.everybody-dies.com (let's hope so)."}