{"ref": "https://www.eurogamer.net/r-justcause-x360", "date": "25 Sep 2006", "game_name": "Just Cause", "text": "Sometimes things just promise to be awful lot better than they turn out. Take Lost, for example. It has all the ingredients to become the best TV show ever made, and certainly starts off that way. With a great premise and solid cast, it has hints of greatness throughout, yet somehow the writers keep conspiring to screw it up by endlessly padding things out, changing their minds and stringing us along into believing that something mind blowing is going to happen any time soon - just tune in next week to find out. Or not. Whether it's blind optimism or the lack of anything better to watch that keeps you going whenever the show enters its periodic phases of losing the plot, it's hard to say. But by the end of season two, you'll wonder where your life went, and how long they can keep this drip feed water torture farce going before we all find something better to watch.You go through similar peaks and troughs playing Just Cause. It starts off like it's going to be the be one of the most insanely brilliant action games ever made, as if the spirit of James Bond had been injected into an awesomely ambitious openworld adventure. But somewhere down the line developers Avalanche either ran out of time, or just ran out of inspiration to make the whole thing click the way it should have. Either way, you're subjected to some truly brilliant ideas that quickly become drowned out by some of the most pointless padding in a videogame ever seen. By the end of the 59th identical side quest, you'll question your own sanity.Nevertheless, with ambition aplenty, Just Cause grabs hold of you immediately; it's a joyous manic pop thrill videogame with the bare-faced audacity to start the game by chucking you out of a moving aircraft and leaving you to get on with it. You first act in the game is to decide whether to pull the ripcord and casually parachute to safety, or plummet amusingly to your doom. If the former is your chosen course of action, you can either sail merrily to safety, or come to the realisation that shortly before impact that you can actually 'surf' on the top of any passing vehicle, pull out the driver and commandeer it. Excellent start.And when we say 'vehicle' we mean you can actually parachute into any vehicle in the entire game, be it a car, van, motorbike, industrial digger, chopper, or passenger airline. It really doesn't discriminate, for you are Rico, casual stuntman-cum-all-round gun-toting Latino action hero - a man who rather makes every other videogame hero look a bit lame by comparison. And being the Most Ridiculous Game Character Ever, you have the wondrous ability to subsequently abandon your vehicle in a couple of different ways. The first is the typical 'leap of doom' GTA-style, while the other is rather more spectacular, and involves going into what's known as 'stunt' mode. With the press of a button, you can go from tearing along at speed to standing on the top of a moving car, or hanging on the back-end of a chopper. From there, you then have the chance to effectively leap from one nearby vehicle to another, roof to roof - again, able to then kick out the driver and carry on in one swift motion. It's great fun to begin with, just gooning about doing insane things that no other videogame has attempted before.Moving through the 21 story missions requires a fair bit of gratuitous craziness too, often involving tailing some guy, stunt-jumping into his own car, throwing him onto the road at high speed and proceeding to run him over in reverse. Repeatedly. It sounds fun, but the novelty value soon wears off by virtue of being way too easy to pull off - by the time you've done similar things a half dozen times, it just becomes the norm. A few missions in you even gain the hilarious ability to grapple any moving vehicle (including helicopters if you can aim) and then paraglide behind them. Entirely ridiculous, but good fun for a while. But to its detriment, the game peaks too soon, throwing all the high-octane fun at you in one concentrated dose then repeating the formula.Being a sandbox adventure set in a politically unstable Caribbean island environment, you can probably guess that you end up working for some corrupt souls that want to take various drug cartels down a peg or two, and eventually raise their sights to the Government itself. But being Rico, literally no job is too big, and you'll quickly take the slaughter of entire armies in your stride - and in fact the side missions effectively task you with doing just that if you can be bothered.Gunrunning is one thing you expect from the beginning, but it's also one of the game's weaknesses. Although you rather expect the early missions (like busting someone out of prison) to be a little on the unchallenging side, much of the perfunctory nature of the combat persists right to the very end - largely thanks to a ridiculously forgiving auto-target system and the general weakness of every enemy in the game, along with a recharging health system that makes dying a lot harder than you'd imagine. As a result, all you have to do to succeed in most missions is to vaguely wave your cursor near an enemy, wait for the autoaim to kick in, fire less than a handful of bullets while zigzagging around and repeat to fade. Frankly, anyone even vaguely skilled in videogaming will be laughing out loud at how completely basic the whole affair is from top to bottom. With enemies that seem completely devoid of any AI to speak of, and barely any hit points to keep them on the screen for more than a few seconds, you're just a lead-spitting killing machine who's practically invulnerable to everything - including, believe it or not, carpet bombing from passing aircraft.Admittedly, it's not always easy going in some of the latter missions. One (roughly halfway through the game) tasks you with planting devices on rooftops, but makes it almost impossible to fly there thanks to some unerring air defences. If anything ever holds you up in Just Cause, it's the simple contrary fact that once you're detected flying into enemy territory, their response is incredibly swift, and deadly to the point of instant death. Overcoming such trifling matters involves traversing long distances on foot, where almost no amount of enemy destruction will be able to stop you thanks to the ludicrous recharging health system. Even when two choppers are on your tail and firing relentlessly over several kilometres, they won't ever be able to take you down so long as you're running. Get into a vehicle of any description (including tanks), and you'll almost certainly be blown up in seconds - not to mention rammed off the road by a posse of kamikaze lunatics - but run along defenceless and you'll be fine because you are the recharging man of steel. How very odd. It's like Avalanche didn't have time to work out the game balancing, so instead of fixing the over-arching problem, just threw the inexplicable infinite health fudge and got the game out."}