{"ref": "https://www.eurogamer.net/r-gradiuscollection-psp", "date": "21 Sep 2006", "game_name": "Gradius Collection", "text": "Retro-games. Space Invaders and Ikaruga, Monkey Island and Super Monkey Ball, Donkey Kong and Super Mario 64, Game & Watch and Neo-Geo Pocket Color, 1975 and 1999, Pong and Virtua Tennis, Centipede and Final Fantasy VII.Really the term means nothing. Other than perhaps functioning as a blanket label for all those games you can't buy in Tesco right this minute. Essentially it also classifies everything older than right now as obsolete - were you to apply it to films and music, you'd be comprehensively regarded as a clueless cultureless retard.Whenever you hear a marketing man use the word 'retro' it's for one of two reasons: either he wants to lend his product an inferred modern frisson by classing everything that has gone before as superseded, or he wants to play on your maturing male sentimentality. In other words, he wants to sell you the future or the past depending on how it suits him. And so we end up with mixed messages, an unhealthy disregard for videogames past and a devaluation of good gameplay - whichever era in which it was born.But great gameplay remains great gameplay in the same way good music remains good music - even as tastes move on and technology allows music to be recorded and executed in ever more unimaginable ways. Whether you're playing Pac-Man or Halo all you are essentially doing is moving your thumbs fractions of inches to push beams of lights around a screen in the quest for entertainment. If it was genuinely good for that then, it will be genuinely good at that now.So on that score Gradius Collection is only 'retro' in that the five games collected (Gradius I - IV plus the lesser know PlayStation-only Gradius Gaiden - for five times the freelance fee right?) were birthed a while back. Indeed, with the first title being released in 1985 and the last in 1998 this collection highlights the inefficiency of the roomy 'retrogaming' pigeonhole. Still, in terms of mechanics, gameplay, innovation, form and function these are fresh games, still brilliant, still fun, still challenging, still rarely bettered and, as they're displayed in glorious PSP widescreen, still contemporarily beautiful. And as they sit in each other's company in this generous package (only Gradius V is missing from the mainstream Gradius/Nemesis chronology) it's clear that theirs is a quality that will continue to endure long after the PSP is consigned to its own inevitable retrograded status.So what sets Gradius apart and gives it a more timeless edge than the competition? This is a series of horizontal shoot-'em-up games that obviously rewards precision and quick reflex as well as pattern memorisation - after all it helped first etch the lines that all subsequent side-scrolling shooters would trace. But it's the player's responsibility for ship upgrades that makes the core difference. Until Gradius (and mostly after it), shoot-'em-up craft progression simply required the player to blow up certain enemies and harvest the resultant floating power-up for an automatic benefit. Doing so made your fire incrementally more powerful or your shield last longer or granted you an extra life or smartbomb. Conversely, in Gradius, you shoot the enemy, collect the power-up and then are handed responsibility of deciding which part of your ship (the beloved Vic Viper) to spend the upgrade on. And, again uniquely, this decision must be made not at the end of the level in a ship upgrade shop, but right there in the heat of the battle - fingers twisting to make selections while at once working to dodge enemy fire.So your ship starts slow and needs speed-ups to improve it's manoeuvrability; or you might choose to spend the upgrade on missiles to take out ground-based targets underneath you, or, by accumulating upgrades you can choose to blow them all at once on a thick laser beam or a safety bubble to make your ship impervious to three shots, or an extra life or an 'option' floating droid to double your firepower. This ingenious system lets the player adapt their craft mid-play to suit their own style - something almost unique that side of Radiant Silvergun.That Konami nailed the balance of upgrades in the first game is a small miracle and its enduring appeal and genius was confirmed when, in 2004's Gradius V, Treasure (the Japanese company widely regarded as the most innovative shoot-'em-up developer) took over development of the title and did little to change this core mechanic.And so with this solid network of ideas beating at the heart of each of these games, the gameplay system is instantly satisfying. The only contemporary concern is that modern gamers, used to the indulgence of soft-touch developers, might baulk at the idea that all your upgrades are instantly lost in one enemy hit. Still, with perseverance, most players will soon slip into the challenge thanks to the compulsive level design and just-one-more-go dynamic.In terms of the specific package here each of the five titles is recreated perfectly (at least to these eyes) from the arcade originals. The difficulty mode in each game is by default set to easy and the hit box for Vic Viper set to small. Also, it's now possible to save your progress anywhere in each level. These factors might seem unusually generous of Konami but to players used to Gradius V, this feels just right and goes someway to compensate for the PSP's unwieldy d-pad. Indeed, it's this hardware detail that fails the Gradius player most readily. The games require careful precision and the PSP pad often feels shaky, wobbly and just a little too imprecise. Analogue control is offered but, despite is superior responsiveness, will take some getting used to for Gradius veterans and besides, it's placement makes prolonged playtime uncomfortable. Inexplicably you'll need to save your settings for each game separately, including, stupidly, having to manually select whether you want to autosave on each title one by one. Indeed, the presentation of the package is fairly rudimentary and the loading times when travelling between each game are long. But once inside each section of the collection play is fast and smooth and mercifully there are no additional load times. There are various screen size options for picky players including the aforementioned and excellent PSP widescreen mode - a move that thankfully works perfectly for the Gradius play environment. However, the tiny sprites and even smaller bullets make play anywhere but a darkened room difficult. Although there was little the developer could do to offset this (without tampering with the originals), it's worth mentioning as there's little chance of successful play on public transport or out in the park. In terms of the specific titles, Gradius II is inconceivably well balanced for a 20-year-old game, Gradius III is mercilessly hard (the Vic Viper is much slower and power-ups are fewer and farther between) and Gradius Gaiden is arguably the most fun of the lot - if perhaps the least orthodox (four different ships are available including the Lord British - the red-coloured 2P ship from Salamander -the Jade Knight and the Falchion Beta, each with its own set of weapons). The original PlayStation version of Gradius Gaiden introduced a two-player option, but fans hoping for similar treatment here will be disappointed. Indeed the bonus modes and rewards are rather lightly sprinkled. A gallery mode and a music-player let you watch a few of the later games' movies and listen to the series' tunes (including the delightful Sharp X68000 music from the first two titles), but that's it.While none of the games are as polished and well-balanced as Gradius V (surely, prayerfully being held back for a single-shot PSP release) this package is nevertheless essential playing for twitch gamers. The gameplay variance is limited between each title but the nuances of difficulty and execution are just enough to make you want to play through each game in turn - something few contemporary series will be able to boast in 25 years time."}