{"ref": "https://www.eurogamer.net/pocket-945", "date": "14 Sep 2006", "game_name": "Luxor", "text": "On the face of it, the Egyptians and Incas don't have much incommon.The former were one of the greatest civilizations of the ancientworld. Dating back some 5,000 years, they gifted us countless wonders and innovations from their Middle Easternhomeland on the banks of the Nile. The Incas, meanwhile, wereprimarily a barbarian race in the Peruvian mountains, firstrecorded around 1,000 years ago, who didn't even develop their ownwritten language, preferring to conquer their more advancedneighbours - at least until they were slaughtered by theSpanish in 1532.The two peoples shared neither language nor appearance, yet tothe modern backpacker there are remarkable similarities. They bothcreated huge structures that baffle construction experts today.They both worshipped elemental idols and mummified theirleaders.But perhaps most curiously, they both inspired remarkablysimilar puzzle games for your mobile phone.Like the Inca-inspired Zuma before it, the Egyptian-themed Luxor requires you to fire coloured balls into an inexorablyprogressing chain of spheres. Connect three-of-a-kind together andthey disappear. Make bigger connections, or set off chain-reactionswhere the balls either side also connect, and you're rewarded withpoints and bonus powers, such as 'sharp-shooter' which provides avisible aiming line, 'slow' and 'reverse', which do what they sayon the tin, and the more destructive lightning, fireball and colourbombs.Like Zuma, the ultimate goal is to destroy all the balls beforethey reach the central temple. Fail and you lose a life. Succeedand you'll secure a bonus relating to the distance left to thetemple.As you progress, the number of different coloured spheresincreases and the levels become progressively more intricate, withpaths criss-crossing, disappearing under tunnels and generallymaking your life more difficult as you try to pick the rightshot.Also like Zuma, the resulting action sounds mind-numbingly simple, yetsomehow manages to demand both strategic thinking and fastreactions, offering up a maddeningly addictive experience thatliterally eats up the hours.So far, so familiar then. But before Glu's lawyers startchecking their diaries, let us assure you that there aredifferences. Where Zuma has long chains of spheres, Luxor has a succession of different smaller chains pushed byScarab beetles. It may seem a comically small point, but itactually enables various different strategies to be adopted; do youattempt to tackle one chain at a time, allow them to join up, orpick off bits from each?The level layout is also subtly distinct, with your ball-firingdevice being placed at the bottom of the screen rather than in thecentre, which offers a more global view and feels less overwhelming.There are more levels to explore too, around 30 in comparison to Zuma's 20, providing for many contented hours ofplaytime.What's more, the presentation here is immaculate. Some fabulousgraphical detail and an understated soundtrack mean that all in all Luxor feels just a little slicker and more rounded. Indeed,it's easy to see why this became the number one online PC game of2005, with over eight million downloads.Hence, we'll add on one mark for all round ~Luxor-y~. But we'llalso have to take one off for innovation, given its ~Zuma-n~nature, meaning that ultimately the Egyptians and Incas have onemore thing in common - their score.Despite their differing backgrounds, both games are equallyaccessible, maddeningly addictive and worthy of a place on yourmobile. If you only have room for one 'three-in-a-rowculturally-themed puzzle game' in your life, we'd have to suggestyou make it this one."}