{"ref": "https://www.eurogamer.net/pocket-714", "date": "14 Sep 2006", "game_name": "Full Spectrum Warrior", "text": "If you happen to be a terrorist or a drugs kingpin, keep an eyeout for the Spectrum Warriors. They're an elite group ofmen, fearless under pressure, who wouldn't even break a sweat wheneating chilli in a sauna. To meremortals, they're an enigma - shadows in the night, ghosts in the day,that cool breeze on your backside when you're leaning into the bootof your car with your grocery shopping. They remain hidden untilthey find their target, and when they do, they tend not to exchangepleasantries, just a swift cap to the head.Full Spectrum Warrior is an opportunity for you toexperience life as just such a covert soldier. You'll be put incharge of two squads, Alpha and Bravo. Following the ordersdelivered to you from upon high to clear various levels of badguys, you'll use both teams to manoeuvre your way around suspectedenemy houses, to surround gunmen, and to achieve other tacticalobjectives.It may sound complicated having to deal with so many men, but ineffect each squad acts as a single unit, so there are only twoentities to control. And thanks to a simple button layout, youwon't need to spend hours mastering the complexities of the game.It really is a very straightforward game to get your head around,placing the emphasis on tactics, putting your men in the rightplaces at the right time, and dispatching each enemy with theminimum of fuss, bother and ammo.This simplicity makes Full Spectrum Warrior a potentialpurchase for a much wider audience than you might expect. Mostgames of this style are aimed solely at pure bred, strategy gamefanatics. Whilst not excluding them, Full Spectrum Warriormanages to capture the same level of tactical involvement but in aprettier, fluffier way. It's a triumph of enjoyment over realism.More importantly, it works a treat.The missions themselves are also presented very well, with clearinstructions providing you with a good feel for the job in hand.Visually there is a decent level of variety in the landscapes,though the animation is quite comical at times. Watching a group ofgrown men in pyjamas mincing along in unison takes some gettingused to, though soon you'll be too immersed in the challenge tonotice. Admittedly the title music grates like a cat scratching ablackboard during an air raid, but otherwise the presentation ismore than adequate.A masterful example of how to condense a five-course strategiccombat game into a pint-sized portable portion, Full SpectrumWarrior is an enjoyable and competent offering. With plenty inthe way of missions and myriad ways of completing them, there isenough to keep even the fussiest of pocket gamers coming back forsecond helpings."}