{"ref": "https://www.eurogamer.net/pocket-20", "date": "14 Sep 2006", "game_name": "Sensible Soccer", "text": "There are thousands of good games, there are hundreds of greatgames, but there are only a handful of digital creations that cantruly be hailed as iconic. Megadrive owners had their Sonic, SNEShad Mario and these days the PS2 and Xboxers have their Metal Gear,Halo 2 and Gran Turismo. For Amiga owners though, especiallyfootballing ones, there was simply no challenge to the might ofSensible Soccer.We, like thousands of others, dedicated countless hours inworship of it's 22 small but perfectly formed idols (plus ref inlater stages) and barely a drunken evening could pass withoutmention of a 'quick' league. So now that we can play it on ourphone we should be overjoyed, right?Yep! Even though the sophisticated seduction ofPro Evolution occupies most of our virtual footballing thoughtsthese days, just a glimpse of the title screen and a few bars ofthe intro (~Goalscoring superstar hero!~) were sufficient toreignite the joyous nostalgia. After a few minutes play, thepassions rose higher still as we discovered what a great conversionthis actually is.The subtleties of the original control system have survivedvirtually intact. One button still suffices for all types of shotand pass (tap once to play to feet, hold down and move the joystickto add aftertouch and create a whole range of kicks from curlersbound for the top corner to a hopeful high punt upfield for yourstrikers head). Likewise the ability to produce angled headers andsliding tackles (which were added to later incarnations of the 8-bitseries) have been included, so all in all there's the potential toplay your own brand of football (Sensi Virgins will needconsiderable practice though). In truth the matches tendmore towards Nationwide Conference than the Champions League, withfrantic end-to-end action broken up by last ditch headers anddesperately late crunching challenges (injuries and cards bothfeature).Presentation-wise it's virtually a pixel-perfect conversion.Although the graphics hardly pushed the envelope in first timeround, the diddy dribblers are considerably more character-packedthan an ITV commentary team and the presence of the replay optionoffers the opportunity to enjoy them.Behind the scenes it's not quite Championship Manager, butthere's a good variety of international sides to chose from, asound tactical system and more match setup options than you'relikely to need (set up your own league or cup, play the presettournaments or try an arcade challenge for a spot onleaderboard).Granted, a few imperfections have developed - the goalkeepersare more pub football than premier league, making short passesseems far trickier than it could be and the lack of some realplayer names is a tad disappointing. Moreover newcomers especiallymight find the control system a little frustrating (and it's harderto master on phone than a Kempston joystick), but it's well worthpersevering.At the end of the day Brian, it's not only a faithful conversionof a classic, it's an incredibly fun slice of frantic footballngaction that could win the old dear an army of new fans."}