{"ref": "https://www.eurogamer.net/pocket-1268", "date": "14 Sep 2006", "game_name": "Pirates of the Caribbean: Dead Man's Chest", "text": "There are more legends, myths and characters surrounding piracy(we're referring the eye-patch wearing, peg-leg walking,parrot-owning variety rather than illegal music and movie sharers)than any other line of work we can think of. Even before JohnnyDepp added Captain Jack Sparrow to the list, there was Blackbeard,Captain Hook, Guybrush and Pugwash, to name just a few.Pirates of the Caribbean: Dead Man's Chest features anotherof these well-known souls in the form of the menacing Davy Jones,him of the eponymous locker. Without spoiling the plot of the film,Captain Jack made a deal with Jones 13 years ago in order to rescuehis ship, The Black Pearl, the price being 100 years of service inJones' crew.Captain Jack being Captain Jack, this isn't an outcome that'slikely to come to pass and the pirate does a runner, staying lowwhile he tries to figure out how to escape the small print in Jones' contract. And so it is that you step into Jack's salty boots, toswashbuckle your way around the Caribbean in an effort to clearyour debt.The game roughly follows the plot of the film but, in a nicetouch that we appreciated hugely, it only takes you up to the lastact of the movie. As a result, those of you without the patience towait you've seen the film won't have the ending spoiled for you.Which is a bonus, because, with a mix of land-based hack'n'slashaction and sea-faring shoot-outs, Dead Man's Chest is more entertaining than we'd expect amobile phone game that's based on movie sequel to be.While neither the land or sea element is strong enough to stand on its own, together they make for a reasonably convincingdouble-act.While on land, you're gently prompted to make your way throughvarious coastal towns and villages, fighting off British soldiers,or rummaging around on tropical islands and attacking other piratesfor treasure and useful trinkets.The controls are simple but intelligent, enabling you to pulloff a wide and spectacular range of attacks. Pressing '5' is nearlyall ever need do and, depending upon the situation you findyourself in, you'll have at the varlets with your sabre, fire off amusket, or swing around a lamppost like Gene Kelly in the rain witha sword for an umbrella. You can even employ that well-worn standbyof swashbuckling movies, the old 'kick the barrel at the bad guy'trick.Still, even with as wide a variety of moves as this, the levelswill start to drag, particularly when you've dispatched theeleventh or twelfth bad guy.On a brighter note, they are interspersed by the occasional bosscharacter that you'll fence with, victory coming by pressing asuccession of number keys in response to on-screen prompts. Pressthe wrong numbers, or the right ones too slowly, and you'll be hit,losing health. It's a nice break in the otherwise-mindless action,but, again, it's not enough to keep your interest for long. As shortas the levels are (each one takes around five minutes), they doseem too long.So it's a relief, then, when you take to the high seas in theBlack Pearl. The story becomes incidental at this point - wherever it is you're sailing to or from, a British galleon orghost ship will appear to challenge you, and you're taskedwith sinking the impudent ship.Offering more tactical depth than is available on land, there'sa definite degree of skill required in ensuring you can train allof your cannons on the enemy whilst simultaneously avoiding theirbroadsides, and in a cruel irony, these levels are over all toosoon.The result is a game that's very much of two halves (darn thatincessant World Cup coverage). It definitely won't blow you awayand, as it's missing the cheeky charm of the silver-screen CaptainSparrow, there is an element of disappointment in finding thatthere's no great sparkle. But it is polished and possessed of someredeeming features, largely that it offers something different tothe usual movie tie-in game."}