{"ref": "https://www.eurogamer.net/purrfect-date-review", "date": "15 Dec 2017", "game_name": "Purrfect Date", "text": "In the Ehime Prefecture of Southern Japan, around 40 minutes from Nagahama Port, sits the remote, mile-long island of Aoshima. You may not have heard of Aoshima Island, but every year masses of tourists dock at its tiny harbour to sample the isle's hospitality. Yet, there are no shops, restaurants or cars, there's barely even people. You see, what Aoshima has to offer is cats. A lot of cats. In fact cats outnumber the approximately 20 elderly residents of the island by six to one, hence how the island earned the name Nekojima, or Cat Island.However, Aoshima is not completely unique. It is one of eleven cat islands in Japan, each a curiosity for tourists and a haven for cat lovers. ~If we make enough money from this game, it's our dream to visit a cat island~, Bae Team's Ruby May Roberts told me at EGX in September, when I first dipped my paw into cat-dating simulator Purrfect Date. At the time, I thought little of her admission, perhaps blinded by the peculiarity of dating cats and churning out feline-related puns - or it may have been because Ruby, herself, was dressed as an adorable pink cat herself. Regardless, this statement did not strike me again until I sat down to play Purrfect Date in its entirety and I realised this dream had seeped its way into every fibre of the game. This is the work of people who really love catsPrimarily a visual novel, crossed with a dating-simulator, Purrfect Date takes place over six main chapters. In each chapter, players take on the role of a different, newly appointed, human research assistant, employed to research and look after cats on the mysterious Cat Island, alongside the eccentric Professor Pawpur.After selecting your first character, you quickly find yourself on a boat heading for Cat Island only to be greeted on shore by some abrasive security - a grumpy gentleman called Zane. Once your credentials have been checked, Zane shows you to the research area and introduces you to your new boss - the enthusiastic Professor Pawpur. There you're met with your first choice - what to drink with the professor? I chose whiskey, obviously. He seemed pleased. A good start.Once Professor Pawpur has explained why you are there, to help research and care for the island's cats, he hands you a phone and something called a cat-a-log - a bit like a Pokédex for cats. You then set off to meet the island's feline residents and, of course, give them a good old scan with your new cat-a-log. Nothing out of the ordinary. The professor proceeds in explaining some of the island's history, revealing that part of the peanut-shaped island is home to Elder Cats, who are less than friendly and could potentially carry disease. That area is the Danger Zone. Not even Kenny Loggins himself would venture there.After a long day, it's time for a well-needed cat nap. The fun starts tomorrow, or so you're led to believe. During the night something sneaks into your tent, stealing the cat-a-log and running off into the aforementioned Danger Zone. Rats. In the morning, you wake covered in scratches and surrounded by the feline residents you met earlier in the day - but now they can speak, more like you can understand. They inform you that you were scratched by an Elder cat and therefore have been catified, in other words you will turn into a cat. There is no antidote, but perhaps you may be able to create one, otherwise you will turn into a fully-fledged, hair-balling cat too. This is where the story truly begins.In each chapter you are given a choice of what activities you want to partake in: research, romance or recon. You can only perform three recon and three research tasks per chapter, though you can perform up to five romance tasks with the cat you have chosen to date, but only one cat can be chosen per chapter so don't be greedy. However these can take place over several days, each task takes up one unit of energy and you only have four units of energy in a day. The only mandatory tasks are research, you must complete all three research tasks to end the chapter, but the choices you choose to make throughout the chapter will affect its outcome. There are also resting/dream events, and multiple hidden and random story events.Research involves you carrying out your day-to-day tasks with Professor Pawpur, while partaking in tests to learn how to create the antidote. However some of the tasks the professor asks of you are questionable at best and will lead to difficult choices, making certain choices will upset your feline friends.Recon involves investigating what is really going on at Cat Island and whether the Professor's intentions are really what he claims they are. This often involves working alongside the main cats and learning their back stories, as well as finding out what happened to previous assistants and uncovering who is the secret texter that's been sending you warnings.Then of course there is romance. There are five main cats to date, and one secret unlockable cat. Your choices are: Floofybutt, the intellectual, Snooty Booty, very posh and resembling a shaved testicle; Trixie, your classic free-spirit; Kibbles, the manga nerd and McMurphy, the stereotypical drunken Irish charmer. You do not have sexual intercourse with any cat, at best there is some heavy petting. The dates involve getting to know your chosen mate on in a sweet and personal way, resulting in special revelations about their past and about the island itself. The real difficulty with Purrfect Date is balancing your activities and trying not to make bad choices, much like in real life. If you choose not to romance any cats, or choose not to help the cats, you find your time on Cat Island unfulfilled and short-lived. However, if you spend too much time romancing cats, like a local stray, you may be sacrificing precious time finding a cure for your illness. Depending on which choices you make, both in your activities and within the story, more activities and potentially extra options are unlocked, providing an ever-branching story with many twists and turns.Purrfect Date is wonderfully written if a little cheesy, providing a riveting and unique story with all the dark humour you would expect in a classic British comedy. The game does not take itself too seriously, it knows dating cats is a bit weird and often makes tongue-in-cheek references to the fact and, let's be honest it is a bit weird and different, but that's good. I found myself sucked in, with each replay I became more invested in the mysteries of Cat Island. After several new games, I still don't know all the island's secrets and I'm not sure if I ever will. The problem I found was that once I had 'failed' the entire game, all six chapters, I was right back at the start, reading the same stories again and again until I found new ones. It can quickly become infuriating. There are a lot of odd dating simulators on the market, often created with the purpose to shock or amuse, but Purrfect Date is the first I've played which is made with pure love and care. In every interaction, date, bizarrely painted  dream sequence and cat, you get a sense of the developers' personalities and their dream to go to a real cat island. Purrfect Date is not just for cat lovers, it's for those who love a game with mystery, personality and the heart of British comedy - something a bit bizarre."}