{"ref": "https://www.eurogamer.net/pocket-313", "date": "14 Sep 2006", "game_name": "Skipping Stone", "text": "There can be few pleasures simpler in this world than skimmingstones across an expanse of water. A relatively simple skill topick up, it manages to both satisfy and relax the thrower, and ofcourse it's free, provided you're near some water and can locate afew stones. All of which would seem to suggest that the pursuitwouldn't be an ideal subject for a mobile phone game. Why pay foran incredibly simple simulation of something that's free?If we're brutally honest, we're still struggling to fathom outthe answer to that question ourselves, and yet we've fallen in lovewith Skipping Stone.Part of the reason for this undeniably lieswith the sweet and quirky presentation. The visuals are colourfuland cartoon-like throughout and filled with wonderful littletouches from the changing expressions on your character's face tothe incidental background animations.However, the main reason isprobably that the game doesn't really make any attempt to simulatethe reality of stone-skimming at all. For starters, there's no needto worry about the angle of your throw, that flick of the wrist oreven the type of rock you select - you simply press one button whena power bar is at its highest and your on-screen character hurlsthe stone out to sea. Moreover, where most of us are limited to amere 3 or 4 skips and are lucky to get into double figures in termsof metres covered, here you can literally skip the stone for miles(our current record stands at 40.75km).You see, unlike yourstandard stone skimming, here you actually take control of thestone once it's left the throwers arm, pressing a button to make itbounce on the water. Time this button press perfectly and the stonemaintains its bouncing height and speed for the next skip, pressthe button too early or late and you'll lose a little height andspeed for the next bounce until eventually your smiling stonedisappears beneath the waves.The control system works brilliantly, mimicking the simplicityof the original practice yet offering a prolonged challenge and youget instant feedback from the power bar and the smiling ormiserable face of your stone. Just timing the button presses isharder than it sounds and requires concentration, and when you alsothrow in an eclectic range of power-ups and obstacles (from extrabounce and invisibility to helpful whales and obstructiveoctopuses) you end up with a pretty stern test of your reactions,too.Persevere and your skill is rewarded though, with ever moreobscure landscapes and backgrounds to enjoy (if you can bear to dragyour eye off the bounce-meter - look out for the crazy ducks!) notto mention the coveted title as longest skipper on the high scoretable.With its short games and repetitive nature of play (there areonly two game modes distance and number of skips) Skipping Stoneisn't the title to fill an hour-long train journey. What it is,however, is a wonderfully fun experience that you'll definitelywant to keep dipping into either alone or with friends and it'llprobably be several months before you allow it to sink off yourphone."}