{"ref": "https://www.eurogamer.net/pocket-1084", "date": "14 Sep 2006", "game_name": "Discworld: The Colour of Magic", "text": "How do you turn a cult comic novel into an accessible mobilegame? Ask Blue Sphere Games - they appear to have managed it.Let's start at the beginning. There's this giant turtle, see,called Great A'Tuin, swimming slowly through space with fourelephants on his back - well, we say 'his', but there's somedispute about gender...Hmm, maybe that's a bit too early.The Colour of Magic game, like the book, concerns theadventures of a wizard called Rincewind who's reluctantly'encouraged' to look after Ankh Morpork's first tourist, anaive yet wealthy chap called Twoflower, by the Machiavelliancity ruler Lord Vetinari - and did we mention Death and thedemonic suitcase?Okay, so it's not essential to know everything about theDiscworld universe in order to enjoy the first mobile game based onthe series, but it's Pratchett fans who'll undoubtedly get the mostout of the experience.Whilst the game's 2D visuals aren't quite up to the famouscovers of the books, they're detailed enough to capture manyfamiliar locales as well as the infamous locals of The BigWahoonie. Sights such as CMOT Dibbler peddling his dodgy waresoutside the Broken Drum or Death hovering menacingly in the Shadesare sure to raise a knowing smile among insiders.Similarly, it's fans who'll best comprehend how well the manic,slightly out-of-control gameplay perfectly captures the spirit ofour hero (of sorts) Rincewind.The central aim of The Colour of Magic is to direct Twoflower towards the moresalubrious sights (like the Unseen University or Temple of SmallGods), but it's keeping him away from the less auspicious ones (thesharp end of a dwarven axe or the bottom of a stage coach) thatmakes for the challenge.Rincewind's role as guide is taken very literally here; youphysically nudge your companion in the direction you want him to goand away from the perils of muggers, swamp dragons or Dibbler'spies.This task is made tougher by the physical confines of the city(a maze of alleyways, ruins and jutting walls), the speed ofvillainy (the crooks move faster than you) and the fact Twoflowerhas at least half a mind of his own, and it's one drawn to dangermore avidly than paparazzi to a celebrity wedding.Fortunately you've the means to strike back. There's youriconograph - Discworld's equivalent of a camera,featuring an imp who can paint really fast - whicheffectively stuns the bad guys. You've also gold coins that can bethrown to distract robbers, and the final, nuclear threat that isthe luggage (a travelling chest with lots of little legs that eatseverything in its path, but is limited to one outing for each ofTwoflower's three lives).But it's mastering the indirect control method that's theinitial challenge. This is somewhat frustrating at first, asTwoflower repeatedly wanders off or ricochets unexpectedly fromobjects. After a little practice, however, you'll get used tosetting the tourist on his way (bouncing off walls if necessary),and then patrolling around him to fend off impending danger.Indeed Pratchett fan or not, after 20 minutes or so you'll berelishing the task of herding your charge around the city (and itsperils) to seek out the picture postcard images that are yourreward for locating each of five different locales.Unfortunately, this is where it all goes slightly sapienpearwood-shaped.In a game design that could have come from the mind of BloodyStupid Johnson himself, the first proper level also turns out to bethe last. Sure it's a big level covering much of Ankh Morpork- a map is needed to navigate its many screens - butthe end nevertheless seems excessively abrupt (THAT'S WHAT THEY ALLSAY), and we can't see why there couldn't be more missions crammedinto the game.As it stands, even a master procrastinator like Sergeant Colonwould be hard pressed to drag the game on for more than an hour ortwo. Whilst it's by no means an abomination (to Nuggan), nor is ita thief of time, let's hope that the inevitable sequel is even morefantastic but rather less light."}