{"ref": "https://www.eurogamer.net/r-cossacks2bfe-pc", "date": "22 Aug 2006", "game_name": "Cossacks II: Battle for Europe", "text": "The Battle of Waterloo has been reproduced in videogame form on more than a dozen occasions and yet so far no-one has got round to modelling one of the most important factors in the French defeat - Napoleon's colossal haemorrhoids. (It's said that chronic piles limited the Little Corporal's mobility during the battle by keeping him out of the saddle). Developers GSC had the opportunity to rectumify this grievous situation with this standalone expansion for Cossacks II, but - criminally - they've parsed it up.Okay, I promise there'll be no more hanus bum puns in this review. Apart from that one. Really, from here on it's all probing questions and sober analysis.Cossacks II - as Kieron's critique deftly identified - was   a solid Napoleonic RTS with a distinctive wargame flavour, and one rather big, rather annoying flaw: musket-equipped formations would only fire if you personally gave them the order. Yes, in what has to be one of the most eccentric game design decisions since EA put Michael Owen on the cover of Medal of Honor: Rising Sun, GSC left-out unit behaviour stances altogether, forcing flustered generals to reach for the pause button every few seconds during busy battles. If C2:BFE had put this one thing right, it would have instantly validated itself. Because it doesn't - troops still need to be carefully chaperoned through combat - the sizeable haul of new campaigns, factions, units, and historical scraps isn't nearly as appealing as it might have been.Actually, even if GSC had sorted out the military micromanagement issue it would still be difficult to get really excited about much of the new content. Take the three new playable powers  - Spain, the Confederation of the Rhine, and the Great Duchy of Warsaw - for instance. As these are all European factions and the developers like their history straight and reverential, no particularly exotic or interesting units appear in the debuting armies. The extra cavalry, cannons, and light and line infantry might have different-coloured uniforms and slightly different stats, but they are still cavalry, cannons, and light and line infantry. Perhaps if the expansion had shifted focus away from the Continent to one of the many asymmetrical conflicts that raged in Asia, Africa, or America during the early years of the Nineteenth Century, then there might have been more room for novelty.  Maybe if the devs had taken inspiration from last year's other Napoleonic extravaganza, Imperial Glory, and cultivated their sea skirmishes (Naval combat was virtually non-existent in C2) then this pack would have generated a bit more enthusiasm.In place of adventurousness, GSC has opted for unimaginative generosity. Each of the trio of new powers plus France get their own linear campaign of four historically-derived missions. These lack presentational tinsel like cut-scenes and characters, but are constructed expertly enough to warrant completion. The added nations also get to participate in the Battle For Europe - a more ambitious campaign mode in which battlefield encounters are triggered by army movements on a compartmentalised Continental map (see screenshot). While this game style doesn't have quite the geographic scope or the diplomatic subtlety of its equivalent in Imperial Glory, there are many worse ways of wiling away an unseasonably dreary August afternoon. Once you've got used to the odd bug, the absence of fleets, and the fact you can only move one army around the strat map (a very silly restriction) it's dead easy to get sucked-in. Each dynamically generated battle usually has its own tempting optional sub-objectives that bring rewards of recruits or supplies; the cleverly integrated economics mean you're constantly keeping an eye on your granaries and coal stocks; the core army system encourages thoughtful use of nervous recruits and cucumber-cool veterans. It all gels rather pleasingly.On the battlefield, even with compulsory babysitting of musket units, C2 and now C2:BFE does offer something quite special. Morale, fatigue, and formation use - three elements usually associated with hardcore turn-based wargames - are all right at the heart of the combat model giving battles a distinctive credibility that's a world away from the contrived rock-paper-scissors scrimmages you see in many a modern RTS. Outside of the configurable skirmish games and a few of the linear campaign episodes, economic development takes the form of seizing neutral villages (each one is associated with a different resource type) rather than building a thriving base from scratch. For an era when armies were expected to live off the land, this device fits beautifully and means battles tend to be a lot more dispersed and unpredictable than they might otherwise be.The AI has its blind-spots especially when its tramping armies around the strat map, but does pretty well on a tactical level. CPU-controlled opponents seem to understand flanking, they usually use formations fairly sensibly and know when to close-in for an attack and when to fall back. In large historical scenarios like Waterloo, Borodino and Leipzig, failings are more noticeable, but you are still guaranteed a stiff challenge and an impressive spectacle most of the time. Shame that spectacle can't be rotated or viewed at the magnification of your choice, though. With a fixed perspective and only two zoom levels, C2:BFE's hybrid isometric-3D engine feels as dated to this modern strategy gamer as a Brown Bess musket would feel to a modern soldier.The antiquated visuals would be easier to stomach if hot Nineteenth Century prospects like Napoleonic Total War 2  (a visually stunning R:TW mod due within the next couple of weeks) and HistWar: Les Grognards (a promising hardcore 3D Napoleonic wargame with an autumn ETA) didn't exist. Although both of these titles will probably have their fair share of throbbing haemorrhoids, I predict both will turn-out to be more deserving of your time than the competent, complacent Cossacks II: Battle For Europe."}