{"ref": "https://www.eurogamer.net/r-theship-pc", "date": "14 Aug 2006", "game_name": "The Ship", "text": "Never mind the aeroplanes, Mr Blair (and judging by the prime ministerial transport budget, Mr Blair certainly doesn't mind aeroplanes), what are you going to do about all this terror on the high seas? Because judging by the contents of The Ship, the ocean's a dangerous place, with a gun in every closet and an axe in every corridor.I will admit that most of The Ship's six vessels are more floating monuments to the art deco movement than floating Flight 93s, and that there's a 1930s sense to everything, but if we're not going to let relevance and logic get in the way of our nation's homeland policing then I see no reason to allow people onto boats without first confiscating their garters.So until that's sorted, I suggest we all limit our seafaring to Outerlight's Steam debut - an inventive cross between The Sims and Cluedo. Except, you know, an FPS.The Ship's main gameplay mode, Hunt, spawns you somewhere on one of six giant boats and tells you to go off and kill somebody. He or she is identified in the bottom right of the screen, and you're also given a short line of text describing his or her whereabouts. Armed with this information - and whatever weapons you can find by rifling through drawers, desks and the like - you need to work your way to wherever they are by comparing your own position (helpfully outlined in the top-left) with theirs, and then do the deed.Equally important, if not more so, is that you need to do all this without somebody else on the ship managing to bump you off instead.Initially, your affection for The Ship will bob up and down. On paper, it sounds ingenious. With NPCs dotted around, penalties in place for unholstering your weapons in front of security cameras or guards, and an emphasis on deliberate stalking rather than frenzied mass-slaughter, tension has the potential to run high. But over the first hour or so of actual play, you may come off disappointed.Being captured by the ship's guards means being jailed for a significant chunk of the round, which can all but ruin your chances of finding your mark. More frustrating is the loss of funds collected from wallets dropped by corpses and any well-handled kills in previous rounds - cash determines your position on the leaderboard, and loss through (even accidental) kills or jail sentences can put you so far into the red that you'll feel like jumping ship. And while the fact that rarefied weapons score more points sounds sensible, it's rather off-set by the frustration you'll experience when your murderer spawns right next to you at the start of a round holding a candlestick.Another area of the game that might make you seasick is the constant need to tend to your bodily needs. Despite the slow pace of general movement (with only a limited-use rechargeable run function to pep things up), The Ship's protagonists are amongst the most metabolically frantic characters in gaming history, constantly needing to sleep, eat, drink, talk to NPCs and shower. You ignore these needs at your peril. At times it's like a laxative-fuelled paintball match for expectant mothers.But then with time your view of it perks back up again. Getting caught is frustrating - so don't get caught. Worried about being seen with a gun? A little icon in the shape of an eye alerts you to whether or not you're within sight of a guard or camera. Annoyed that your quarry lurks as close as possible to the nearest guard to scupper your chances? Bribe the guard, or shoot your prey from the balcony above. Cash needn't be frustrating - you can bank that which you find, and only your cash in hand is troubled by murder or the cost of sustenance. Your banked cash, which determines your position in the score tables, is stored separately. You can also deposit that which you steal at cash machines.Your needs, in general, are always going to lead to a bit of standing around. But this merely adds to the tension. If you need to pop to the loo, you're going to go into an inescapable animation for a few seconds, so it's a good idea not to be milling around next to that suspicious chap in the dark glasses who keeps glancing at the axe on the wall. It seems a bit odd that you don't leap to your feet to defend yourself when he strikes, but it does work neatly within the context of the game - and hey, perhaps it's a comment on human nature that we'd rather die than get up off the loo, you know, ~during~.Granted, the Hunt and Elimination (last-man-standing) variants are probably the only two modes you'll play that often (deathmatch and one-on-one don't excite the same feelings of anxiety), and the single-player botmatch mode is next to useless at the moment. And yes, there are some bugs, and bizarrely long load-times. But like most Steam projects this one is going to be supported on an ongoing basis. Outerlight is watching, and will look after us. A boxed version, out later this year, guarantees that early adopters will see some informed changes.Even in its current state, The Ship's an interesting mix of bluff and tension. Like the best multiplayer games, it creates its own stories. Like the time I needed a shower, but only managed to escape a shifty-looking black granny by throwing on a wig I found in somebody else's cabin. Or the time I walked out of the brig and found four different people lurking there, clearly waiting for their prey to emerge, trying to give the impression of nonchalance by looking up at the ceiling and typing ~whistle~ into the text-chat-box.It's hard not to enjoy when you reach that stage, and with a mostly good-humoured community eager to play it properly, it feels like it's worth recommending, particularly as most of its problems (things like short default round-lengths) are the sorts of things server admins will adjust in time, or, where that's not possible, a young developer eager to help will do so instead. Artful and warmly considered (even the menu options are caught up in it - the ~Options~ menu is the ~Engine Room~, and the ~Quit~ button reads ~Abandon Ship~), it's a well-formed idea that will almost certainly grow as it builds up a head of Steam."}