{"ref": "https://www.eurogamer.net/r-monsterhouse-ps2", "date": "10 Aug 2006", "game_name": "Monster House", "text": "There's something about spooky mansion games that tweaks our nostalgia glands. Maybe it's the enduring glow of Atic Atac and Eternal Darkness that does it, or too many survival-horror adventures down the years, but even lock-'em-ups like Grabbed by the Ghoulies, The Haunted Mansion and Luigi's Mansion get a warm welcome around these parts. It's odd, but being trapped in a room and forced to fight off a succession of spooks (or in this case, haunted furniture) has a peculiar appeal. Someone call a shrink.As with most spooky mansion games, it's all about swatting away things that want to feast upon you. In Monster House's case, we're not talking about duelling with walking skeletons or blasting tormented ghouls, but pointing squirt-guns at vicious chairs, TVs, lamps and other assorted inanimate objects. Regardless of this slightly curious fact, THQ's latest movie tie-in is much like any third-person shooter with a bit of block-shifting puzzling and melee combat thrown in for good measure. As a result, it's mildly enjoyable in a limited, mindlessly repetitive kind of way that makes it suitable kids'-fodder.The premise for this furniture-squirting fest is that three kids in the neighbourhood are curious to know why one particular house has such a bad reputation. Assuming it's because of some mean old man, it quickly becomes apparent that it's actually the house itself that's causing all the mayhem - and in true meddling kid-style, DJ, Chowder and Jenny wade in to find out once and for all what's really behind the mystery.Trapped inside, the game takes it in turns to put you in control of each of the kids, with the simple task of clearing each room and finding a specific object in order to progress. For the vast majority of the game you'll wander around firing water at haunted fixtures and fittings, reloading your squirt gun with limitless supplies (handy, eh?) and circle strafing around each room until everything's finally been put to rest.Regardless of whether you're taking on indignant stoves that lob fireballs, rampant smoke-filled ventilation tubes that swirl around the room trying to suck you into oblivion (but it's true), or just cantankerous old chairs with snappy jaws, it's never too hard to take on multiple enemies. Hitting circle cycles between targets with the generous lock-on system, and from there it's simple enough to take everything out with repeated stabs of the X button to squirt your gun (with a few quick taps of triangle to fill up when you're empty). Elsewhere, you can stab R1 repeatedly to take out the weaker enemies crowding around you with your melee attack, or take out the more distant, more powerful foes by pressing square to fire off your secondary attack. Each kid has their own unique version of this, with Jenny able to fire a sling-shot, DJ equipped with the enemy stunning camera, while Chowder fires water balloons for maximum, er, splash damage.Usually, once the room clearing stuff has been taken care of, you then have to search around for a specific key (or other requested item) by opening chests located nearby. Pushing a specific crate to another part of a location is about as complicated as the puzzle-solving gets, reminding you that this is very much a game for young kids with short attention spans.Monster House occasionally tasks players with pressing a specific button to dodge a flailing tree limb that happens to come bursting out of a solid wall, while a couple of sections even throw in boss (or mini-boss) encounters before you can move onto the next section. A couple of them might take a few attempts, but about the biggest delay you'll encounter is the need to restart from a checkpoint placed ten minutes or so back - a rather irritating design decision that needlessly requires a modicum of backtracking.But the longer you progress, the more the game just simply repeats the same perfunctory encounters over and over - and by the time you're on the latter of the seven main game chapters, you'll have no problem defeating any of the enemies, mainly because you'll have faced them so many times before and know their strategies. Monster House tries to up the ante by throwing more enemies than ever at you, but you'll die very few deaths on the way to finishing one of the shortest games we've ever played. Anyone with even a modicum of videogaming experience can expect to romp through Monster House in three to four hours. Once you're out of the mansion, the game changes completely - but only in a way that concludes the story in a satisfying way. Without spoiling the 'surprise', both sections are incredibly simple affairs that are over and done with in a matter of minutes - and give the distinct impression of being bolted on mini-games to wrap things up. The only unlockables in the entire game are some entirely worthless bits of concept art, or some more 'credits' to spend on the rubbish in-joke that is the 'Thou Art Dead' 8-bit parody game that you can play at any time from the main menu. Aping the side-scrolling graveyard antics of Ghosts 'n Goblins, it looks convincing enough to pass as your average mid-'80s platform hackfest, but is the sort of game that you'll play once and never want to go back to. Admittedly, that's kind of the point, but it's still a bit of a wasted effort.Perhaps the most surprising thing about the game is how pleasantly put together the whole thing is from a technical standpoint. With a visual style that's entirely faithful to the movie, it's far from the generic look that blights so many licensed titles, with a cute, rounded feel and atmosphere not dissimilar to the delightful cartoon manor found in Rare's unloved Grabbed by the Ghoulies. Unfortunately, the initial delight of the rich, moodily lit environments is sullied by the limited interactivity and some disgraceful repetition that sees you wander through the same environments several times - albeit as different characters. Even the voice-overs are well implemented throughout, with decent cut-scenes carrying the story along, though you can expect some dreadful sound bugs that cause speech loops to play relentlessly during the latter half of the game. The game even crashed once.As we've come to expect from titles aimed at youngsters, Monster House does everything it needs to do to provide a satisfying yet undemanding adventure suitable only for very young children. It's easy to pick up and play, has generally tip-top production values, has a moreish appeal and only a couple of bits where parents might have to help out the little ones. Sadly, grown-ups needn't feel like they're missing out, for as much as it contains most of the ingredients that should make it interesting to everyone, Monster House quickly becomes too repetitive and shallow to deliver on its early promise. The fact that it's also extremely short and has absolutely no replay value makes it less attractive than it initially appears, and once you're through with it you'll bemoan the lack of love lavished on what could have been so much more than it is."}