{"ref": "https://www.eurogamer.net/r-sf2livearcade-x360", "date": "3 Aug 2006", "game_name": "Hyper Street Fighter II", "text": "The decision not to support Street Fighter Anniversary Collection for the original Xbox through backwards compatibility can be seen in two ways. Firstly, it's an oversight of a niche game lost among demand for more popular titles. Looking down the compatability lists, this seems unlikely - other ‘lesser' games like Sniper Elite and Deathrow make the cut while the inclusion of Acclaim's turgid Vexx over Anniversary Collection just makes us cry. The second way of looking at this is a slightly more cynical one - why would Microsoft and/or Capcom let gamers play Street Fighter 2 online for free when it can be put up for sale again first? But despite our minor outrage, we invested in some Microsoft Points and hit the download button within seconds of Hyper Fighting appearing on the Live Arcade service. Damn it, we're weak. And although it's this weakness and nostalgia that is played on with many Live Arcade releases, firing up the game is like your 360 tucking you into bed and telling you everything is okay again. For anyone that enjoyed Street Fighter 2 back in the day, it's almost impossible to avoid being swept away by a tidal wave of nostalgia. Even though the 360 D-pad isn't all that user-friendly (especially for the constant motions required by a beat-'em-up), the game still plays just fine today. Even though the genre has progressed so far beyond Capcom's pivotal title, the wonderfully solid basics are what makes the game timeless - this is fighting at its most coarse and its most simple but this is precisely why it still works in 2006.If you've got mates to play with, great. Few games bring out a person's windly competitive streak like Street Fighter and the one-more-go factor is still there after so many years. If not, well let's just say that you're in for a rough time against some slightly unfair opposition, CPU Ryu is happy to sit back and throw fireballs for most of a match, Blanka never seems to stop rolling while just about every opponent beyond the first few tends to abuse jabs to interrupt almost any special move you might throw their way. The Street Fighter II AI has never really been up to much or understood the concept of fair play and there's no reason that this would change for a Live Arcade port. Yes, this is the same infuriatingly filthy string of CPU opponents that have probably made many of you throw controllers in the past. But of course the real crux of the game is its online functionality and for the most part, Capcom has done a decent job with this. Single matches work perfectly – your opponent on the other side of the internet may as well be sat next to you as you duke it out. Ranked matches too are handled well, keeping the identity and ability of your challenger masked to help avoid high-ranked players ducking other leaderboard toppers to pick on newcomers and easy targets. Ranked games are a one-shot deal too, so once the bout is over, it’s back to the menu for you. But while it should be the real highlight of online play, Quarter Mode (which allows a winner-stays-on set-up for up to four players) is not exactly how it was originally described. Spectating on matches is only possible after a defeat, meaning that if you join a full lobby, you'll be sat staring at the lobby screen until you've had a fight yourself. It's hardly a dealbreaker but while single matches tend to be lag-free, having the wrong person enter the lobby of a Quarter match can reduce the game to a crawl for the participants, making quitting out a more appealing prospect than waiting around to get a go or watching the lag-fest pan out.There's little doubt that Hyper Fighting will quickly become the most downloaded Live Arcade game to date, which is a little unfair as it's far from the best the service has to offer. Sure, it's a classic game but our fond memories paint a picture of a game far better than it actually is. But then again, perhaps that's not entirely fair. After all, Street Fighter II is the daddy of the fighting genre and with two players, it's still a good laugh today, despite showing its age. Few games from the early '90s stand up this well today and although there are obviously better fighters out there, an enhanced classic for less than the price of a cinema ticket is a bargain in anyone's book."}