{"ref": "https://www.eurogamer.net/r-disgaea2-ps2", "date": "31 Jul 2006", "game_name": "Disgaea 2", "text": "All games are essentially maths in fancy clothes.Take Grand Theft Auto for a set question. Scenario: You're sizing up to a drug baron. He's tall and broad chested which gives you a clue to his generous health allocation of 500 hit points. Each bullet you fire from your AK47 that successfully finds its target subtracts 10hp from him. Your gun fires bullets at a rate of three per second. You're pretty good at geometry laws so you estimate an average hit success rate of three in five bullets. You've already depleted his health by half. There's a bomb in the house you're fighting in that goes off in 45 seconds. Question: Have you got time finish off the drug baron and exit the house before the bomb detonates or should you make a run for it now? Show your workings in the five seconds you have to complete the sum. Speed mathematics. Rockstar drape over a gold chain and a hip-hop soundtrack so you don't actually realise you're in a mock GCSE exam and *kapow* you're addicted to all the things that made you run from school into the warm cathode embrace of videogames in the first place.Of course, while each face-off with a boss like the one above is even more intricate in reality (what about your own life-bar? what's his rate of fire, firepower and accuracy?) ultimately, Grand Theft Auto, like most videogames, only requires the player to estimate. You estimate whether you'll defeat the boss in time to get out the house in time, evaluating a complex matrix of factors you see around you to make a series of split second choices. Then, even if you make a crucial mistake, you're free to tackle the mission again - now with the benefit of experiential data with which to refine those estimations.Disgaea 2, sequel to the King of the Strategy RPG, is far more concerned with the method. Indeed, it's entirely possible to get the result you're aiming for - say completing a map or defeating a tricky boss - but to do it in a way that doesn't reap the maximum benefits for your team in terms of experience or items gained which will leave you weaker in the overarching play arc of your experience.And while you have all the time in the world to make your decisions, once taken there's no going back and no second chances - you and your characters are the sum total of your choices, good and bad, and as a result Disgaea 2 is your game like no other - the thrill not so much in the reaching of the final credits as the elegance, effectiveness and skill with which you get there, and the person you have become at the end of it all.The first Disgaea game showcased developer Nippon Ichi's unique brand of Pimp My Chess. It was a game wrapped in a quirky little comedy story with likeable, cute, wide-eyed characters and funny one-liners - all elements that drew you in, but essentially just formed the visible tip of a gameplay iceberg stretching ten thousand feet deep below the surface.Subsequent titles from the developer, Makai Kingdom and Phantom Brave tried to twist the format further, dispensing with the stock Advance Wars-style grid-based maps and adding ever more complex rules and diversions. But there's little doubt that Disgaea represented the best of the set, its delightful mixture of initial simplicity and accessibility (but ongoing complexity), loveable cast and back-breaking compulsion serving to enslave and enrich so many Strategy RPG players.So it's unsurprising that this sequel is essentially the same game with a new story and few tweaks here and there to freshen the formula. Indeed, for the first five hours or so there's very little to distinguish the two games from each other save the new cast and storyline.That story focuses on Adel, a young adopted boy out to tackle the Evil Overlord  Zenon - an unfathomable entity who is turning Adel's town into a netherworld and its inhabitant into monsters. As a result of a botched summoning, Zenon's snooty princess daughter ends up in the town and offers to help Adel find her father if he promises to return her to him. While the setting is all demons and hellfire, the presentation is the same light and perfectly pitched comedy that endeared the original so much to fans, and, ironically, it's a game stuffed with Judeo-Christian morality in its step-by-step narrative exploration of themes of loyalty and grace. These superficial surface elements personalise what could otherwise have been a dry and confusing underbelly and gently lead the player into the deeper strategic waters.Battles play out on the grid system beloved of Fire Emblems and Shining Forces, albeit with an ocean-wide freedom those more traditional titles have never offered. So while it's possible to breeze through battles - providing you have levelled enough - the real joy comes from milking each stage for as much experience and benefit as possible - and Disgaea 2 has been tweaked to maximise this joy. As your characters only complete their move once they have attacked and, as adjoining characters will often join in for tag team moves free of cost, it's possible to move your characters back and forth around the grid triggering team combo attacks (all participants of which benefit from the experience) before moving them all back again for more gains. The master/pupil dynamic is present and correct, where your characters can take new team members under their wing who will gradually learn their skills, as well as the mind-boggling reincarnation - where characters can restart from scratch in a new class carrying over skills and stat bonuses from their previous existence.Gameplay follows a very traditional path - a narrative cut-scene following each core stage. It's possible to finish the game by simply tackling each sequential stage without diversion but the real fun and good endings are only available by exploring the game's other myriad and complex corridors. These several secondary elements separate the Disgaea universe from other SRPGs. Firstly, there's the item world in which players can metaphorically 'enter' their items - everything from swords to health-restoring chewing gum. Each item has a set number of stages within it, which must be worked through and beaten one by one. Each stage that you complete within the item levels it up by a factor of one. Within items, new characters called specialists can be found and recruited. Essentially stat modifiers, these 'characters' can then be moved between items to upgrade your equipment; so a 'marksmen' found in a breastplate item, when recruited, can be moved into a gun to increase its accuracy, etc. Subpoena items - criminal charges against your team members - are also issued later in the game. These can also be entered in the item world and, nestled in one of their stages, a judge and jury can be found who will issue a sentence; a badge of honour that bestows various benefits on the accused.The other major invention of the series is the Dark Assembly - a kind of House of Commons full of senators whom you must petition to pass bills. These bills unlock secret areas, open up new character classes, strengthen enemies throughout the game, and increase the shop's quality and range of inventory. Senators must vote to pass each bill you're after and you can butter each one up with item gifts to help your chances of getting the decision you want. Sometimes senators are asleep or drunk, so their votes might not count at all, or they might vote in the opposite direction you'd expect them to. Fail to get the answer you want, and it's possible to take on the whole assembly in a fight to force your motion to be passed through brute strength.Koei's hard work at getting this title as near to the US release as possible will hopefully encourage fans to avoid importing - and the inclusion of dual English/Japanese speech in the PAL release will certainly help this by appeasing those for whom its removal in the first game proved a turn-off. However, it's not all good news on the localisation front. The first Disgaea was brought to the west by the excellent and studious translation team at Atlus USA. For the sequel Nippon Ichi's US wing has handled the localisation and as a result, while still universally funny, the text is littered with sloppy spelling mistakes and slightly awkward phrasing - although mercifully this is mostly in the menus and tutorials rather than the narrative proper.Even so, Nippon Ichi's games are good but Disgaea is undeniably the best. While some might begrudge the ostensible dumbing down with the return to grids and more tightly controlled play (there's no chucking enemies off the maps into oblivion or picking up map furniture as impromptu weaponry here) in reality this makes the game more accessible, more easily understood and ultimately more fun. There are so many ways to tackle a map, so many techniques and nuances to the gameplay that its entirely possible for one player to develop a unique style and approach not shared by another - a freedom only usually seen in beat-'em-ups.The stronger story sets the game down that solid narrative track that is missing from Phantom Brave et al so that, while technically all you're doing is pushing little humanised additions, subtractions and multiplications around a grid, it never really feels like that. In fact, the moment you notice you are simply expressing yourself through the stark beauty of statistics and the curtain lifts to reveal the matrix of little green zeroes and ones you're continually tweaking - you realise that's all you ever really do in videogames - and that, as this is one of the most flexible and brilliant systems ever invented to do this with, you don't even care.Oh. Grand Theft Auto coursework still puzzling you? Your enemy, Drug Baron, with half his health already gone, now has a life of 250 hit points. As 3 in 5 of your bullets hit him you have a respectable accuracy rate of 0.6 or 60 per cent. So, for every six bullets you fire, 3.6 of them will hit their target, which means that - as you fire at a rate of three bullets p/s - every second 1.8 bullets are hitting the amphetamine-propped scoundrel.Each bullet takes 10 hit points off the kingpin's life so, every second you're firing your machine gun his health bar reduces by 18 hit points (10 x 1.8). All of which means that it will only take you a paltry 13.8888889 seconds (250 / 18) to finish him off; leaving ample time (31.1111111 seconds) to depart the property before the bomb goes off.Oh, and Disgaea 2 is out on PS2 in PAL territories this autumn."}