{"ref": "https://www.eurogamer.net/r-capcomclassicsremixed-psp", "date": "28 Jul 2006", "game_name": "Capcom Classics Collection Remixed", "text": "With the retro compilation now an accepted tradition, and handheld gaming firmly in the mainstream, it seems strange that more publishers - or at least those with roots dating back to gaming prehistory - haven't been porting more of their arcade forebears to miniature formats. Outside of Namco and Midway's PSP offerings, and the less than successful Atari Retro Classics effort on the DS, there's a wealth of archive fun yet to be tapped for the quick-fix of handheld platforms.Here to help redress the balance is (deep breath) Capcom's PSP port of their console port of their old arcade machines. But take heed of the ~remixed~ suffix - sometimes you remix something and get the 12~ version of Blue Monday, sometimes you get ten minutes of unbearable techno arsepipes. Somewhat predictably, by monkeying around with the line-up for this outing, Capcom has delivered a mixed bag that will both please and annoy retroheads in equal measure.Digital Eclipse, the outfit that handled the conversions for the PS2 and Xbox compilations, is back on the case so you can rest assured that the same quality conversions and tweaks await you here, including fully definable control layouts and numerous gameplay options. They've ditched the updated soundtrack option, but the title does take advantage of the unique strengths of the PSP by allowing you to flip the video, so that vertical shooters can use the whole glorious oblong screen, with all movement and firing remapped to the analogue stub and d-pad. For those with enormous man-hands (like me) playing a game in this manner for any length of time is an act of wanton hatred towards your knuckles and wrist, but it's a nice feature that will appease the hardcore fans.There's also a very clever multiplayer mode which allows gamers to pop in and out of games via the WLAN network, in much the same way that someone could come and grab joystick number two in the arcade. It's simple and easy to use, but the only downside is that it doesn't utilise game sharing, so both players need their own copy - a small hiccup that renders the feature slightly less spontaneous, and therefore less useful, than it could have been.The biggest change, however, is in the line-up of games. From the 22 present in the console edition, only five have been retained - Final Fight, Forgotten Worlds, Legendary Wings, Bionic Commando and Section Z. The good news is this means there are 15 all new games in this package. The bad news is that some of the substitutions take a long hot piss in the face of good taste and common sense. While it's a pleasure to see titles like Strider and Black Tiger join the fray, it means we've had to wave goodbye to such classics as Commando, Ghosts and Goblins, Ghouls and Ghosts and all three variations on Street Fighter II.Making up the numbers we now get non-entities like The Speed Rumbler, a terrible ~Gun Smoke with cars~ effort; Avengers, which foolishly tried to pioneer the vertically scrolling top-down beat-'em-up; Last Duel, an utterly redundant driving shooter; Block Block, a predictable Breakout clone and Quiz and Dragons, a board game in which you defeat mythological beasts by answering trivia questions. Trivia questions that were designed for American kids in 1992, no less, so brush up on your baseball stats and obscure US sitcoms if you fancy spending any time with this one. To make matters worse the majesty of Street Fighter II has been replaced by the laughable clumsiness of the original Street Fighter which, with its rigid controls and cavalier collision detection, is virtually unplayable in this day and age.MegaMan is still conspicuous by his absence and while the games now provide a better spread of genres they also highlight just how often Capcom would rehash their titles in the quest for arcade dominance. Captain Commando, for example, is simply a sci-fi version of Final Fight. Ditto for the numerous vertical and horizontal shooters on offer - the value for money takes a big dip when you realise that not only are a good portion of the games on offer justifiably forgotten Z-listers, but several of them are virtually identical in both control and gameplay.There's also a curious quirk in the game settings that should have been addressed. While you can set the difficulty and number of lives for all the games, the only options available for continues are ~none~ or ~infinite~. As these games were designed with the express purpose of teasing as many coins from the pockets of children as possible, this famine or feast choice is a bizarre oversight.Playing with no continues is gaming suicide - these games deliberately make it impossible to play for any amount of time without slaughtering you. There are moments in 1941, or Varth, where the screen is literally full of enemy projectiles. As long as flaming death made you shovel another 10p in the slot, dodging was never going to be an option. If you choose to play with no coins in your virtual pocket, don't expect to see much beyond level two of whichever game you pick. On the other hand, playing with infinite continues completely removes any sense of challenge and achievement. In the arcade the compulsion was to see how far you could get before you ran out of pocket money. With that barrier removed, any of these games can be completed in less than an hour through bloody-minded perseverance rather than skill.In a somewhat related annoyance the absence of a save state option means that you must either play through each game in one sitting, or start afresh every time you play, while the unlockable bonus features also fail to impress. Tips, artwork and music are the only gifts on offer and after ploughing through wave after wave of shrieking pixellated enemies, chances are you won't even need the basic gameplay tips on offer, while the last thing on your mind is sitting back to listen to the headache-inducing arcade soundtrack all over again. Better to serve these up as additional material from the start, and give us some extra titles to play for.That's not to say there's nothing to cherish in this package - the chance to carry arcade perfect versions of Final Fight or Strider around in your pocket isn't to be sniffed at, and even the most negligible of the titles offers at least a few minutes of curious tinkering if your interests tend toward yesteryear. However, there's simply no getting away from the fact that the irritating reshuffle of titles from the console edition has left a sizeable hole in the appeal of this compilation, and the presence of a few too many relics best left buried does little to compensate. With all these eminently avoidable shortcomings in mind, and a retail price inexplicably higher than the superior PS2 version, this remix is more a frustrating missed opportunity than an outright disaster but should only be considered an essential purchase by the most dedicated retro nut."}