{"ref": "https://www.eurogamer.net/r-potcdmc-psp", "date": "27 Jul 2006", "game_name": "Pirates of the Caribbean: Dead Man's Chest", "text": "Ever tube-surfed? It's great. You plant your feet on the floor of a moving tube train as if you were a bona-fide surf/skater dude and attempt to gain a few stolen minutes of handheld gaming without falling over in an embarrassing heap.If you're really good, you sort of rock your hips about, cushioning the waves of motion in conjunction with your knees and looking nothing short of savagely obsessed as you intently pursue the goals of your current level, with nary a care about the fact that somebody's just thrown themselves under a train at Tottenham Hale.Emergency stops or unexpected bends are a bit like wipeouts, but if you've bothered to attach the dandy white strap to your PSP and worn it on your wrist like a good boy then you're okay. A quick snatch of the nearest handrail gets you out of trouble like you knew it was coming, then it's back to business with minimal loss of time or energy. Given the close proximity of fellow bored commuters, there's every chance someone will glance quizzically at the screen, either secretly giving you the 'saddo gadget freak' look, or with wistful envy that they're stuck reading a discarded Australian property supplement from last week. One such curious commuter saw me slashing away with Pirates of the Caribbean and was moved to break the code of silence that all Londoners undertake when travelling. Figuring that I was probably not a foaming lunatic, he asked, not unreasonably, ~Is that Tomb Raider? I'm thinking of getting that.~ There's too much hacking and slashing for it to be Tomb Raider, but nice guess. ~No, it's the Pirates of the Caribbean game, but it's a bit generic - don't bother,~ I admitted. ~Thanks for the review,~ he replied, blissfully unaware that he was talking to the famously anonymous Editor of Eurogamer.An hour later along the slowest, hottest five mile tube journey ever I'd romped through a third of Dead Man's Chest, mostly by hitting X followed by triangle, or the other way around. What I should have told the curious gentleman was that it's a bit like an entirely brainless Prince of Persia, without the subtlety or design genius, with a smidgen of Tomb Raider-lite platforming to give the illusion of it being some sort of swashbuckling, exploratory platform-combat adventure starring a wobbly Jack Sparrow. Truly, it's one of the most crushingly generic gaming experiences ever designed. As in, in the history of gaming. And it's in the UK Top 5.. What's wrong with people? What would make them want to part with actual Earth currency to torture themselves with flaccid attempts at capturing the comedy spirit of a blockbuster movie? Just give me the money. I can torture you with my record collection far more effectively.With literally nothing else to play apart from another couple of underwhelming-looking PSP games and a 25 year-old shooter, I soldiered on. You know, just in case the repetitive design, shoddy, one-dimensional combat, pathetically obvious puzzling, creaking, unforgivable frame rate and appalling visuals were just some sort of elaborate trick. It must get better. Surely BVG can't actually release high profile games in such a forlorn state and expect no-one to notice?But in typical 'shove-it-out-to-cash-in-on-the-movie' style, the entire single-player offering is exactly as bad as the first few sections suggest, only it feels worse because you feel your soul slowly ebbing away the longer you go on (so if nothing else it's like serving a hundred years under the mast). Sure, you earn three 'power' attacks that you can stab into life with the up, right or left on d-pad to help you get out of those perennially annoying occasions when baddies surround you. But, even with these new additions the core gameplay doesn't change a jot from the first level to the last.The environments might change a little here and there, but it makes no difference whether you're in the prison or slashing aboard a ship - it's the same bland, crate-filled murky gloom throughout (which means the game is all but unplayable outside in daylight - rendering it useless as a handheld game in many situations). As you progress from the Prison Guards, to the Pirates to the Skeletons to the Zombies, all the game's enemies broadly present the exact same challenge and display the same brainless tactics all the way through. The later levels might throw a few more waves at you and arm them with guns (as opposed to merely lumbering idiotically in your direction and taking it in turns to flail wildly), but you're also equipped with a limited stock of projectiles (wine bottles, pistols, bombs) that give you a chance to take them out from distance too. For a more precise insight into just how dreadful this game really is, a typical level goes a bit like this:Hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Pick up health. Hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Carry explosive barrel to the door-that-you-obviously-need-to-get-through, pick up handy flaming torch placed right next to said explosive barrel. Light barrel with handily placed flaming torch. Stand well back. Boom. Hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Pick up health. Pick up map piece. Pick up projectile. Hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Jump across three ropes.  Hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Perform 'piratey' move and slide down a big ol' rope. Hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Fire projectile at annoying posse of enemies surrounding you. Shimmy across a ledge. Avoid the rubbish 'traps'. Hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Drop chandelier on enemy's head. Hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash hack slash. Shoot really determined enemies. Cue cut-scene.Actually, the cut-scenes are probably the best bit about the game. The main characters bear a decent resemblance to their real life counterparts (particularly Depp's sozzled Jack Sparrow reprise), and the voice-overs are tip-top. But all-too soon you're plunged back into dark, seething despair, to a place that game design forgot. And yet, somehow, it gets worse. In what amounts to a blatant attempt to pad a shockingly short game out, you even have to eventually fight through five entirely pointless Battle Arenas in order to face off against the final boss. Each time, you'll face four 'waves' of enemies and have to hackandslash and hackandslash a bit more, because obviously that's what we enjoyed most about it. It's essentially the same as the main part of the game, but, you know, without any of the vaguely interesting bits that involve actual thinking. Joy.By the time you've reach the entirely anticlimactic boss, you'll be itching to do something better with your life. The promise of ad-hoc or infrastructure wireless ship battle multiplayer for up to four players (from only one copy of the game, handily) lends something different from piratey slashery, but it's never exciting enough to warrant a purchase on its own. Essentially you get the choice over Last Ship Standing, Deathmatch, Plunder The Flag, and a Timed mode, and can choose from five ship classes (each with their own particular weapon or ability, such as Water Mines, Burst of Speed or Hard Tack for faster turning). Dotted around the maps are special 'mystic' power ups (invisibility, repairs, ramming, etc) treasure, and there's even scope to board enemy ships and bag some loot. It's by no means a terrible multiplayer mode (and not having to own multiple copies of the game makes a whole lot of sense), but don't be surprised if your mates won't be queuing up to have a bash with you.By the end of your time with Dead Man's Chest you'll be wondering how many times you could have gone and seen the movie compared to the price of the game. You'll wonder why you saw it right through to the end, and ask yourself why the screenshots on the back of the box look absolutely nothing like the game within. Ultimately, you'll hope developers like Amaze don't go within 100 miles of a movie license ever again, and pray that BVG has the good sense to try harder next time. Consider yourself warned."}