{"ref": "https://www.eurogamer.net/r-galaga-x360", "date": "26 Jul 2006", "game_name": "Galaga", "text": "Astonishing fact of the day: Tom had never played Galaga until it popped up on Live Arcade this morning, which is the gaming equivalent of never having seen, I dunno, Blade Runner. After a while you just assume everyone must have come across certain cultural icons, but today's confession just goes to show how wrong you can be.And another thing guaranteed to have the retro community marching on Eurogamer towers with flaming pitchforks was when he admitted ~There's nothing to it... shoot things that fly into you until you die - it's Space Invaders with one other idea.~ Technically, nothing Tom said was incorrect, but since when did simple ideas constitute a bad game? It's time to put my best 'incredulous old fart' hat on and at least try and defend what it stands for, 25 years on from its release.First of all, out of all the dozens (hundreds?) of Space Invaders clones that spewed forth from the arcades in the late '70s and early '80s, Galaga was easily one the most memorable, and is probably the only one I can stand playing for concentrated periods of time even now. Sure, it's as basic as it gets, tasking you with clearing wave after wave of dive bombing, missile-spewing insectoid enemies and going for the high score. No power-ups (not counting the recapture of your fighter), no weapons upgrades, no continues, just level after level of screen-clearing chaos punctuated by score-boosting Challenge stages. Add the primal videogaming sound effects and addictive little ditties and you'll dive straight into a gaming time warp that never fails to charm the hairy ears of a retro gamer..Like all arcade games of the era, the actual level design was purely to kill you off as quickly as possible so that you'd shovel more loose change into the hungry cabinet. But such is the perfectly honed difficulty curve that even now Galaga is underpinned by a delicious one-more-go appeal, boosted immensely by the obsessive lure of global high score tables and the friends list that comes as standard with these Live Arcade offerings.But whether it's worth the 400 points to own the full version is down to how much the latter two features matter to you. By now, the continual retro compilation re-releases on every platform known to man over the past 12 years must account for practically every Galaga fan out there, with MAME mopping up those who refuse to pay for their childhood memories. If you're one of the few hardy (or young) souls who still doesn't have access to a copy of Galaga, then there's perhaps more justification for shelling out for one of the oldest games still on sale - but we'd vehemently argue that there are better things to spend your money on.For the rest of us, there's not a whole lot of point to Galaga's arrival on Live Arcade for several reasons. For starters, there's literally nothing new added to the game apart from the ability to start from the last stage you reached. To all intents and purposes, this is just a basic, no frills port of the arcade original, with no graphical enhancements, no new Live-specific modes or sympathetic re-imaginings to try and drag the concept up to date (as Namco repeatedly attempted in the 80s). Other Live Arcade releases have thrown in alternate versions to ensure that the retro faithful are kept happy, along with newcomers, but not so here. It's the 1981 vintage lovelessly shovelled out at a price that still feels steep considering its long-term appeal.For as wonderful an example of 1981 gaming as Galaga is, and as addictive as it remains, the thrill is gone after about half an hour of blasting. Even the lure of 200 Gamerscore points soon wears off once you realise how insultingly easy most of them are to attain - after that you're just playing for pride, but the game quickly gets so frantic it's more luck than judgement that sees you through the later levels (feel free to argue that point - I know you won't let us down!).You can, of course, fiddle with a few basic settings, such as how many lives you start with, or the intervals at which you gain extra lives, but if you play on anything other than the default you'll forfeit the right to upload your score to the Leaderboard. Namco-Bandai hasn't even attempted to meddle with the difficulty settings in order to eke the most out of its appeal. Instead, you're left with a very basic shooter that's immensely challenging, but repetitive by design. It's not the game's fault. Its 'best before' date was 1982, so it's a bit pointless slagging it off for re-emerging on a platform it was never designed for.Feel free, though, to question why Microsoft would so willingly dilute the Live Arcade offering so carelessly. It's a classic, iconic game, sure, but that's no excuse to throw anything up there and expect people to pay a premium for it. In a 'value pack' of old retro titles bundled together we'd be interested, but the fact that this costs as much as some truly stunning Live Arcade offerings is ultimately where it comes unstuck.You know what to do: if you want an arcade perfect, no frills port of Galaga then that's what you'll get, but you can probably get your fix by simply downloading the free trial. The lure of global leaderboards (and a succession of largely identical levels) in the full version adds something of a gloss for the retro obsessives, but that's about it. If twitch gaming is what you're after, do yourself a favour and buy Geometry Wars instead - and demonstrate to Microsoft in the best way possible what people really want."}