{"ref": "https://www.eurogamer.net/r-cloningclyde-x360", "date": "21 Jul 2006", "game_name": "Cloning Clyde", "text": "Ever since Dolly the Sheep first baaa'ed her unnatural soul to the world ten years ago, cloning's never been far from the headlines. Which is why I have. Boring! If it's not a full-grown insta-clone, or some sort of exciting cross-breed that has horns and seven legs, I'm not interested. Labra-doodles? Bull-spaniels? Sod-off. (Although, actually, someone does need to make a cocker-dog.)Cloning Clyde has the right idea. Clyde's a hick test-subject who ends up being replicated rather more than Darwin would've been happy with - not least because he doesn't know his arses from his elbows. Freed from the shackles of science, he sets off on a 2D adventure to rescue as many of his fellow Clydes as possible. But the interesting bit is what happens when he hops into a machine with a chicken. Or a monkey or a frog or a sheep. Or an explosive barrel. The result is half-Clyde, half-whatever-else. Coupled with the ability to clone himself in the occasional machine, or unleash fresh Clydes from crates by pulling switches, and then switch between his clones at will, the result of NinjaBee's platform experiment is an unpredictable success with just a few unfortunate side effects.Each of the game's 25 main levels (and 10 additional challenge stages) acts like a traditional 2D platform game. Clyde can run, jump, double-jump, attack people and use a multi-purpose action button to pull switches, lift and throw rocks (and animals, and other Clydes), and there are plenty of collectibles strewn between the start and the end-goal of each level. The manifold DNA strands build up Clyde's attack-meter so that he can dole out a special karate blitz attack, while a smaller number of Killer Kenn action figures (not dolls, oh no) are a little per-level bonus that encourage replay and build up a total that goes toward unlocking some of those moreish achievements.The only real divergence from the old-school template is the need to find and destroy a number of surveillance robots, which are guarded by large numbers of exploding killer-chickens. Combat is never that difficult, and you stand more chance of being killed and forced to retrace a handful of steps (and just a handful - the checkpointing's nice and generous) by crushers, explosives, mines and other obstacles - like drainpipes that suck you into the ground and spit you out somewhere unhelpful.The key to success, of course, is to make use of your clones - whether they're vanilla Clydes (who can be decked out in quirky costumes, unlocked as you make progress) or the mutated versions, first discovery of each of which results in a shower of gamerpoints. Each is suited to a particular task, and it's usually right in front of you - sheep-Clydes can leap vast distances, monkey-Clydes can swing from overhead bars and avoid falling onto mines or into drain-clogged water, chicken-Clydes can fly unrestricted, frog-Clydes can swim without restraint (otherwise Clyde bobs back to the surface after a while), and explosive-Clydes can explode and explode repeatedly without actually exploding. In other words, they can bomb their way through walls and take out the robots rather more easily than their karate-chopping counterparts.By pressing Y and then zooming around with the analogue stick, you can switch between any of the other clones on the level, and it's this way that the game intends you to solve puzzles. Some involve positioning multiple Clydes on multiple switches; in fact, rather a lot do. Others involve positioning them so that they can take advantage of the things that happen when you pull a switch; at one point you encounter a switch that lobs an explosive barrel at a destructible wall, and the idea is to repeat this several times for several walls, but it's only when you position a Clyde so that the last barrel can skip like a stone off his thick head that you're able to take out the last one.With a large variety of puzzles, some enjoyable quirky graphics (including a brilliant headbutt animation that looks particularly good done with a chicken) and a functional soundtrack that flourishes in the right places (greeting the dispatch of the final robot with light jazz, for example), the single-player game works rather well. The difficulty curve is hardly steep at all on Normal, and most of the challenge comes from collecting all of the Killer Kenn dolls and making sure all your Clydes are in a position to escape. But more on that a bit later.The other side of Clyde is the ability to play it with other people - either co-operatively or competitively. Both modes support four players, and handily you can either have any mixture of split-screen players and online players you want up to a total of four. Playing versus mode against a single opponent can be a bit of a faff - unlike co-op, which takes place in the main game, the versus levels are designed specifically for it, and often consist of areas that require multiple Clydes, where having to go back and get the other clones to follow the same path to a switch/door obstacle is a bit of a pain. Go two-on-two though and it makes more sense - as you both frantically coordinate so that you can be the first to reach all the other team's robots and beat them to smithereens. It's also more than a bit amusing to pick up a friend and toss him off a cliff. And in the game.Whether you play through it co-operatively or alone though, you'll probably only want to bother with the main game once - particularly if you're after all the bonuses. Admittedly, there's plenty to amuse and entertain. There are wonderful level-wide sequences of drain-pipes and corresponding exit-pipes that spit you out into another drain-pipe, and so on. There are sheep that you can ride around on, bucking manically underneath you as you try to manoeuvre them onto high ledges. There are catapults to commandeer, and ridiculously violent pipe complexes that threaten to turn you into a ragdoll tennis ball at the slightest hint of failure. And there are rockets that you ignite by setting your hair on fire and then ride around on - all of which is woven interestingly into the level fabric. But despite all this, ultimately the game struggles to get the most value out of its own premise.It's only in the very last levels, for example (albeit prior to the more exotic challenge levels), that you have to put multiple Clydes to use near-simultaneously. The game consistently shies away from this, aware that its system of switching between multiple Clydes is less than foolproof, and so when you're faced with a splicing machine and a switch that produces an explosive barrel on a timer, you fumble for a while before you realise that you're meant to position one Clyde on the machine, use another to quickly grab and toss the barrel and then quickly switch and activate the machine to perform the splice. It's a relatively simple idea, which takes a few seconds to figure out, but it crops up so late that it's initially quite bewildering.Elsewhere the game limits itself to interesting but generally straightforward applications. For the most part, you have multiple Clydes, but you're only really using one, or you're guiding one to the end of one section and then switching to another and performing his single-Clyde mini-quest. And when multiple Clydes do need to work together, the action proves a bit repetitive. Positioning a couple of Clydes on opposing switches to activate a door is a fair thing to do once or twice, but when you've got a dozen switches in sequence it erodes the goodwill the game's built up.Similarly, the system of guiding all your Clydes to the level-goal once you've dispatched the robots is overly repetitive, and, while it's not necessary to complete the level, it is necessary for completists and those after the gamerpoints. So you end up delivering one to a nearby ventilation shaft, then switching to another and doing the same, and another, and another, and in some cases as many as 20. It's fittingly silly that your last act, after the end-credits, is to try and deliver 22 of the little gits into unhelpfully distant ventilation shafts, and after a while I just gave up trying to rescue most of them from the pipe-matrix of flinging death at the top of the level because it was boring.In fairness though there are only small niggles besides that. I found a dead-end on one level, where I was down to my last Clyde and searching for the final Killer Kenn figure, only to then find myself in a position I couldn't escape from. The sections that involve precise platforming on a bucking sheep, or manoeuvring a frog-Clyde around small platforms weren't particularly enjoyable either - Cloning Clyde's at its best when it's puzzling, not when it's about inch-perfect jumping.There's a reason I left that stuff until the end, though, and it's that Cloning Clyde should be viewed as a good game with a handful of basic, but not showstopping problems. Except in that one case. Even at 800 Microsoft points (so, six-quid-eighty), it offers a lot of value compared to some of its fellow test-subjects, and while it does occasionally frustrate or bore, the urge to keep going remains. It isn't quite a platform-strategy game - stopping short of making use of multiple mutant-clones in concert, even though it feels like it ought to be - but instead opts for a sort of single-player co-op platform niche. Within that context, it's undoubtedly King Clyde, even if its reign will probably be cut short by the Galaga insurrection next Xbox Live Arcade Wednesday."}