{"ref": "https://www.eurogamer.net/r-darkstarone-pc", "date": "17 Jul 2006", "game_name": "Darkstar One", "text": "Here's a thought for you: we've been waiting for the next Elite for over twenty years now. No, not literally. We got that when Frontier appeared, and that wasn't the next Elite in the way we're currently yabbering about. What it means is a game which immediately and obviously dominates the gaming landscape and consumes the social life of pretty much everyone.Clearly, the Elite successors that have appeared have had localised effects. Reading this they'll be veterans of Frontier or Privateer or X: Beyond the Frontier who still bear the scars in their personal history, scabby months in a darkened room in an uncomfortable seat saving the universe and making enormous profits. Hell: there's the ever-growing community of Eve Online who've decided to retreat from the real-world into a universe where laser death lights the heavens (with a side-order of mining). But all of these are peripheral concerns, outside the main thrust of the culture.So maybe times have just changed? It's a game which may have worked once, but no more - but then look at (say) Civilzation, which, generation after generation, gains a new fanbase and reclaims the centre. What's different about Elite Clones? After about four hours with Darkstar One an idea struck me. What's different about Elite Clones? They're too different. They're trying too hard. Now, Darkstar One is far from a perfect game, but it immediately excited and engaged me in a way that no recent other Elite clone managed. Compare to when I started playing X3 and I was actually glad that my 3D card was coughing blood while running it so I could lob it back at Kristan with a ~Sorry, chum~ note attached. I Realllllly couldn't be bothered wrestling with it.But with Darkstar One, I'm away, in a far away galaxy shooting pirates who are quite near, actually.The point being: Elite, for all its scale, action and variety, was a simple game. And Darkstar One is likewise.(Or I may be biased, because the lead character's name is pronounced identically to mine, which is always good for a few giggles.)Darktstar One is an Elite Clone [We've got that already - Ed] positioning you as a freshly trained flight recruit who's trying to find out who offed his dear old Pa. Luckily, he left him a prototype space-ship, the Darkstar One. Between trying to gain information, you're free to explore, take on missions, trade between planets, indulge in a little harmful piracy or harmless piracy and generally get into trouble. Cash gained can be used to improve your ship's equipment, getting increasingly powerful weaponry and so on.Elite Clone!But where it could obfuscate, it chooses to simplify. For example, trade. Games like X take great pride in making enormously intricate economic systems which move constantly and realistically. Darkstar One doesn't bother. Planets have a selection of things they make, which will normally be cheaper than average. If you make sure your destination doesn't make it too, you'll normally turn a profit. Bad if it were a pure economic trading game, but it's more something you can play around with to earn a little extra coin. You don't need to sit and calculate anything complicated, so - in actual practice - you're more likely to actually dabble. Low entrance fee in terms of attention for instant rewards. And no matter how slow-paced a game may be, there's nothing wrong with instant rewards.Ship improvement keeps things focused too. Rather than swapping ships depending on your finances, Darkstar One has experimental organic technology that allows it to upgrade. When you find one of its canisters - normally inside a (labeled) asteroid - you can choose whether you want to expand your hull, engines or wings, allowing you to specialise towards weaponry or cargo-hauling or whatever. Married to this is the actual special plasma abilities, which are improved and unlocked in a skill-tree akin to Diablo or World of Warcraft.The environment itself, while leaving room to explore and take on missions by yourself, slowly unveils the galaxy as jump-gate co-ordinates are gifted to you or a more powerful engine installed. The expanding canvas is tightly integrated into the game's narrative, which is where you can see the strings pulling the puppets. Your ship's bought upgrades are limited according to what level your ship's been improved with its experimental organic technology. This means that even if you grind out a mass of money in a small area of space, until you manage to find the strictly limited organic upgrades, you can't turn it into a top of the range ship. It stops the game becoming a walkover (either way), but does lose a little of Elite's free spirit.The key element of the game, of course, is combat and here it excels. It picks up where Freelancer left off with its mouse aiming and steering, but also includes a more traditional joystick options. It also allows you to thrust to the side in a strafe-banner and apply afterburners or high-power breaks. The latter allows you to swivel on the spot (or even as you reverse). It's certainly a considerable advantage, perhaps vaguely justified by the game's fiction, that despite being in space everyone else flies like atmospheric craft while you can do this zero-G snazziness. To some it may be too much of an advantage, but when you get involved in mass firefights between the rebels and the forces of order, you'll be looking for any edge you can get.Compared to many of its peers, Darkstar One may seem slight - but what it does, it does expertly. There's a few problem areas which prevent it climbing to real greatness. Primarily, while the visual side of things is perfectly acceptable, the audio is a complete state. It's been lumbered with the sort of wooden voice-acting that make Orlando Bloom sound like Orson Welles, sounding openly comical when discussing matters of serious import. It may as well be going ~Dad's dead,~ ~Oh dear,~ ~Yeah,~ for all the drama. Secondly, for the dream Elite game, it's leaning too much to the simple side. It's fine having tight reigns on exploration, but when the actual space you're stuck inside has so little to do... well, if you include an asteroid you can fly inside, you better be sure to stick something of interest in most of them. This is one for the Luke Skywalkers rather than the James T Kirks of the space-sim world.Which leaves us with a lighter-than-gravity Elite Clone that's positively welcoming to all and sundry. There's nothing cold in this part of outer space. Embrace it."}