{"ref": "https://www.eurogamer.net/r-il2complete-pc", "date": "14 Jul 2006", "game_name": "IL-2 Sturmovik Series: Complete Edition", "text": "The summer of 1999 was an exciting time to be a WW2 flight simulation fan. Dynamix, the makers of the iconic Red Baron, were beavering away on Desert Fighters. At Looking Glass Studios, the talented Flight Unlimited team were busy with Flight Combat: Thunder Over Europe. Microsoft were in the midst of a Pacific theatre Combat Flight Simulator sequel. Oh yes, there was also a small Russian outfit with no sim track-record whatsoever, working on a game about an obscure Soviet ground-attack aircraft.As it turned-out, the fates of these four sims couldn't have been more different or less predictable. DF perished before ever leaving the ground; FC:TOE arrived years late, a buggy and dated mess; CFS2 sold like hot cakes but left no significant legacy; IL-2 Sturmovik, the dark horse from Moscow, turned-out to be the greatest combat flight sim ever made.Alright, perhaps that last statement is a tad misleading. On its release in 2001 IL-2 Sturmovik was a superb, ground-breaking sim; it would, however, take five more years of add-ons, patches, semi-sequels, and community love to turn it into the incomparable genre-dominating colossus you'll find on this Complete Edition DVD.Probably the most striking difference between this version and the original is girth. Over the years IL-2 has got fabulously fat. Conceived as a one plane sim, the game now boasts a stupendous selection of 200+ flyable aircraft. Even if you discount the numerous variants (there are 5 different Stukas for instance, and dozens of Spitfires and Me-109) the choice of machines is still huge. In addition to an exotic core of Eastern Front aircraft including monsters like the TB-3 (an antiquated Russian behemoth with an open cockpit and fixed undercarriage) and tiddlers like the I-16 (a Russian fighter so compact, it was sometimes carried into battle under the wing of the TB-3) you've got a generous range of Japanese and Allied Pacific theatre rides, plus a smattering of planes that fought exclusively in the skies above Western Europe. Though the majority of the flyables are single-engined and prop powered, aviators with a taste for jets and big bombers have their toys too. They get lumbering beauties like the B-25 and the He-111, and winged bullets like the Me-262 and Me-163 Komet.Of course any developer can cram a virtual hangar with hordes of pretty aircraft, the trick is ensuring those aircraft are modelled accurately enough to be distinctive and convincing. Does IL-2 succeed in this respect? Most definitely. You might find the odd plane done better in an FS2004 or CFS3 add-on but for most aircraft these are the sim genre's benchmarks. The impressive realism extends to wonderfully atmospheric 3D cockpits, and highly-detailed damage models that... that...  Nope, this just isn't working. Trying to communicate the wonder of IL-2 one feature at a time is a bit like trying to emulsion a wall with an eyeliner brush. Maybe I should just tell you what happened during my first IL2:CE sortie...~As it had been a while since I last played IL-2, I thought I'd pick one of the more forgiving aircraft - the Hawker Hurricane - and one of the briefer single missions - a VVS attack on a Finnish anti-aircraft battery near Leningrad. The mission opened with me sitting in a silent 3D cockpit staring at a lot of dead dials. After speculatively prodding a few keys I found 'I' (ignition) and was rewarded with the gratifying sight of thick grey exhaust plumes spewing from each side of the nose, and the stirring sound of a mighty aero-engine waking from deep sleep. Cautiously advancing the throttle, and gingerly applying a little rudder (a joystick of some description is pretty much essential) the hurricane was soon bumping down the middle of the grass strip, passing parked aircraft and trundling trucks. At around 100mph the ground relinquished its grip and plane and pilot began a gentle, slightly untidy climb into a pretty, cloud-dotted Spring sky. Ah, bliss!Undercarriage up. Check. Switch to external camera to admire aircraft and watch the rest of my squadron taking-off behind me. Check. Open the map to study route. Check. At this point I could have activated autopilot and time compression, but as the target was relatively close I thought I'd ingress 'au naturale'. After a few minutes peering down at pretty forests and glinting rivers, the frontline was crossed and the target area - a large field hemmed by woodland - appeared in the distance. It was time to open the 'comms' menu and order all planes - except my wingman, who was going to cover my six - to commence the hunt.Barely had the orders been sent when a bright muzzle flash flickered in the field ahead and a fan of deceptively attractive blue tracer arced up towards me. Right, time to concentrate! The first pass I botched (too shallow, too indecisive) On the second run my chosen prey turned to fire on me as I closed. For a few scary split-seconds his shells zipped around my canopy like Stygian Neon Tetras while mine peppered his position ineffectively. The duel could have gone either way, but luckily I found the bulls-eye before he did, and went racing away across the treetops with a triumphant twinkle in my eye. That one was for you Anechka!Soon the majority of the guns were burning and I was hauling my Hurricane away from the smoke columns and the moaning sirens toward a dogfight that was developing to the SE. Nosey Finnish P-36 fighters had come a-snooping; time to remember those furball tactics. Gain height. Gain more height. Find a straggler (#You#, my friend) Stick on his tail until he fills the sight then LET HIM HAVE IT. Cannon shells jag across a dark wing, then rip it clean-off. A broken bandit flutters down like an autumn leaf. I'm still grinning when the crimson tracer fire from another P-36 overtakes me and starts ripping chunks out of my tail. Damn! Where did he come from?Ten minutes later a chewed-up Hurricane, sans elevator controls, nervously nears home. I'm sitting inside a thin suit of sweat by the time the undercarriage reaches down and grabs fistfuls of lovely turf. Shoulders slumped with relief, I veer off the runway and park-up next to some trucks to watch the rest of the squadron come in. There's Red 2; good, he survived after all. Red 3 looks in a bad way; hmmm, he's down but he doesn't seem to be able to keep his machine straight. Cripes, he's coming straight at me! The careering Hurricane glances off mine, spinning it round. For a moment I think I might have just got away with it, then a flailing wingtip digs into a fuel truck and the world explodes.~That was a genuine account of my first IL2:CE experience. Sorties aren't always that eventful but many are. Whether you are flying online or off (few sims offer more enticing MP opportunities) dogfighting or dropping ordnance (Dive bombing, level bombing, skip bombing, and torpedo bombing all feature) sitting in the front seat or the back (several planes have man-able MG positions) drama and unpredictability are usually guaranteed.The original IL-2 came in for a bit of stick because it used scripted missions for its campaigns. In Forgotten Battles and Pacific Fighters (subsequent instalments/sequels both included in this edition) career sorties were randomly generated making for much more engaging tours. Simmers with experience of titles like Falcon 4.0 and Rowan's Battle of Britain may still be disappointed by the lack of targets of opportunity and strategic freedom (you can't alter historical outcomes in the stock campaigns) Luckily, thanks to a free utility created by community boffin Paul Lowengrin (http://www.lowengrin.com/news.php), there's a relatively simple way to add this kind of texture to the game.Talking of 'the community', buying into an established and popular game like this one means gaining access to a world of excellent free content and assistance. Though new planes can't be added by users (not a big problem considering the size of the existing fleet) there's an excellent range of gratis campaigns, single missions and skins available. Novices looking for flight and combat tips can browse big guide libraries like the one at Airwarfare.com (http://www.airwarfare.com/guides.htm) It's well worth stressing that just because you've never flown a flight-sim before, there's no reason to be wary of IL-2. Once you've realised a few important keys are unassigned by default (potentially confusing) and that almost everything about the flight and combat models can be softened via the options menu, then you should have few problems finding your feet.It's against my religion to write an entirely positive review so here are a few small gripes to justify the missing '1' on that score down there. Firstly, the 'Complete Edition' name is a tad inaccurate as this pack doesn't include the most recent official add-on - the Pe-2 Peshka pack (http://www.rrgstudios.com/EN_02_05_Pe2Peshka.shtml) You can download this separately for a tenner from the Ubi.com shop but the installation process is bit of a palaver so it would have been nice to see it integrated. Also IL-2 does have its share of trifling quirks and deficiencies. AI aircraft, while generally extremely believable, do enjoy certain advantages like G-suits (enemies don't black-out or red-out during extreme manoeuvres) x-ray specs (bandits can see through clouds) dive-resistant airframes and improbably talented turret gunners. None of these issues are reasons to avoid this sublime sim, but we'll be disappointed if they crop-up in the upcoming series sequel - Storm of War: Battle of Britain."}