{"ref": "https://www.eurogamer.net/r-biblegame-ps2", "date": "10 Jul 2006", "game_name": "The Bible Game", "text": "So, this is how it works: Get the token Christian to review the Bible-based game. Snigger. But it's not as dumb an idea as it might sound. In my experience none are more furious or offended by the wretched extreme-right Christian 'games' that are put out more as propaganda than entertainment, than the god-botherers. Firmly establishing the 'mental' in 'fundamental', these releases are so often pathetic attempts to mimic the secular world but with grossly out-of-context Biblical notions of purity. Good times, eh? Happily, The Bible Game is a rare exception not falling into this category, and while overtly aimed at Christians, it's somehow a light-hearted and reasonably well-constructed PS2 party game.It's not a good one however. It's very average, light in content with an extremely short hold on your interest. But bearing in mind the horror of the usual religion-'em-ups, such as the awful first-person shooters where you must save souls and zap demons in decade old technology (Eternal War, Catechumen), it's somewhat of a relief that The Bible Game doesn't make you want to claw your own face off and then dip the remains of your head in a bucket of vinegar. The format is very much Buzz, with four players and an extremely enthusiastic host, riffing off standard quiz show formats. Unlike Buzz, the host isn't quite as infuriating, his nature much more congenial and genuine, and also unlike Buzz, a lot of the rounds are peculiar mini-games of a distinctly non-quiz show nature. Oh, and one third unlike: it's not nearly as much fun.The loss of fun is in a large part due to the subject matter. While it can be an entertaining challenge to try to remember which 80s singer was responsible for a dreadful song, it's perhaps not quite the party-at-my-place entertainment spectacular to race to select the name of Jacob's second child. Or maybe that's just me?The quiz show that makes up 90 per cent of the game is called Do Unto Others, which sets a slightly sinister precedent for the five hundred year old vocabulary that presides throughout. While the questions are contemporary, the Bible verses are all mindlessly from the King James version, jarringly out of context for no good reason, and bring with them all the semiotic baggage of fundamentalism and ridiculous people who think there's something special or 'religious' about saying ~thy~ instead of ~your~. Perhaps this is more of a personal gripe, but it's still rather peculiar to use archaic language in a game clearly aimed at a modern audience.However, the quiz itself is quite sweet. Rounds consist of each player taking it in turns to randomly select a sector on a grid which contains a concealed form of game event. It might be a 'Testament Trivia' question (a la Buzz); a one-player 'Blessing Game', where you might be hammering at X to help Sampson hold up the pillars of the Temple, or solving a tile-based puzzle in a time limit; a 'Challenge Game' which we'll get to next; or perhaps the dreaded 'Wrath of God'. Erk. A strange notion, but the means of ending a round, each grid has a hidden Wrath of God (that the manual rather disturbingly abbreviates to ~WOG~, but we shan't do the same) which causes you to lose all points accumulated that round, and the rest of the players' scores to be tallied. After at least one selection from the board you can take your chances and select another sector, or pass the play to your left. Tactics abound here, perhaps taking the 1 in 4 chance so your opponent will be left with the far more dangerous 1 in 3. And so on. It's a nice quiz device and the AI opponents have a good grasp of it and are pleasingly devious.The Challenge Games are peculiar in the extreme, but surprisingly well put together. David & Goliath is about stopping rapid crosshairs over wooden Philistine targets and lobbing stones at them, with extra points for nailing the Goliath cutout racing back and forth on tracks. Jacob's Ladder is a DDR-style response mini-game. Jonah's Whale is about surfing on the spout of a whale and going through hoops. And Walls of Jericho has you riding on horses, dodging crumbling blocks of the wall while racing around the sturdy 3D track.All utterly bonkers, and entirely disingenuous to the Bible verses that accompany the games' instructions, but briefly entertaining. Made even more ridiculous by each beginning with the dramatic declaration ~LET... THERE... BE... LIGHT!~ It's certainly competitive, which is what's most important in such a group-based game, many games letting your thwart your opponents' attempts at winning as well as making your own. But while there are twelve of them, and while they're all very different from one another, none really support multiple plays, and as they start to repeat themselves the appeal rapidly drops away. This makes the game's other mode, simply competing at the Challenge Games minus the quiz around them, entirely redundant.The biblical trivia questions, of which there are 1500, are all read aloud by the well-voiced host. They remain reasonably tough on the lowest difficulty setting, but for some reason, as with the rest of the game, only focus on the Old Testament (Kieron points out that this does leave room for a sequel). But occasionally they seem primitive or poorly researched, many based on common misconceptions. (Such as Moses' parting the ~Red Sea~. It's now entirely accepted to be a mistranslation, and should rather be the much more local (and shallow) ~Sea of Reeds~). And it's even more frustrating that the questions should be set to incorrect consensus belief, rather than accurate Biblical information (a cursory glance at Genesis 7:2 reveals that Noah took seven pairs of most animals onto the ark, not just two of each), which otherwise might have made for a far more interesting quiz.There are a couple of other twists. An attempt at some notion of Christian philanthropy appears in the form of the Do Unto Others Square, where you might give up your turn to someone else, or even play a game to earn points for them, and the Commandment Square where points are arbitrarily taken from other players, the leader, or apparently Heaven, and given to another player. They keep the scoring balanced, which is then all rendered gibberish by the final Grace of God round where random chance can push last place to first, and presumably create some very unchristian fighting. A bit of a shame, but since the finale is so unspectacular (sadly there's none of the excellent prizes awarded by Buzz) you could simply switch off beforehand and graciously accept victory (remembering to thank God, obviously).So it's well presented, and contemporary in design, unlike most of the ghastly Christian offerings. But it's still very shallow, and even if you were able to find four people who'd want to play it, there's little chance of their wanting to play it twice. The AI puts up a tough fight, but again, there's nothing to sustain a second or third play. Clearly aimed at a specific niche, it's hard to say if it will find a home anywhere - those awful sorts of people who only play puritanical rubbish might not like its irreverence and general happiness, and anyone who wants a decent quiz game isn't likely to be satisfied by the Who Wants To Be A Sunday School Teacher? tone. Although, and here's the best use I can think for it, it could work as a nice Trojan horse to any kids wanting to convince religious parents to get them a console:"}