{"ref": "https://www.eurogamer.net/atlantis2", "date": "4 Jul 2006", "game_name": "Atlantis 2", "text": "- CryoSystem Requirements -                           Pentium 200 MMX or equivalent                           32Mb RAM                           2Mb graphics card                           8x CD-ROM drive         Long ago a power came from                 space, helping the civilization of ancient Atlantis to                 develop. This power was split into two halves - one light, the                 other dark.                    Flash forward a few centuries and an Atlantean by the name of Creon            dug up the metal head which contained the dark half of the power            and so released it, bringing about the fall of Atlantis. Eventually            the darkness was stopped though, as a hero called Seth took the            power of the light and vanquished the darkness.                    This is where the sequel, Atlantis 2, picks up the story. Seth's            descendants, known as the light bearers, have spent many centuries            wandering the world. But now, in the early middle ages, a distant            supernova has awakened the two halves of the power again.                    It is your job to take on the power of the light and finish the job            that your ancestor Seth started. As the light power within Ten, you            must defeat the darkness, finally absorbing it to make the power            whole again. If you fail, the darkness will instead absorb the            light and become the dominant part of the power. Which probably            isn't a good idea...         This being an adventure game though, nothing is quite                 that straightforward. Before you can take on the dark side of                 the force .. sorry .. power, you must open the path. This in                 turn involves finding six triangular stones, and then                 transforming a crystal to complete the pathway.                    Along with the crystal, you are given three of these stones at the            start of the game, each of which gives you access to a different            part of the world where you will find one of the three missing            stones. One takes you to Ireland, another to China, and the third            to Mexico, and in each location the light power will take over the            body of a local man.                    In each of the three areas you must solve a series of puzzles, at            the end of which you will be given a stone and sent back home. If            you get stuck though you can bail out and try one of the other            areas, coming back to finish the job later.                    Each chapter of the game is made up of a series of gorgeously            pre-rendered locations (known as nodes). The graphics are mostly            excellent, though the barren snow-bound wastes of your homeland are            a bit .. well, barren. From the towering Mayan temples to an Irish            monastry, and from a Chinese outpost to the bizarre and colourful            jungle of the Mayan after-life, the locations are beautifully            designed and rendered.                    And, thanks to the Omni3D graphics engine used by the game,            although the locations are all pre-rendered and you are always            stuck to the spot in each of them, you can look all around you with            a full 360 degree panorama in every direction. Hardly            groundbreaking, but it works well and scrolls very smoothly.                    Talking to a character brings up a series of graphical icons            representing subjects you can question them about. The            conversations themselves are all in-engine, complete with            lip-synching. Sadly though the characters only ever move their            faces, the rest of their bodies standing totally motionless and            rigid the whole time, which rather ruins the effect.                    There are also short animations linking most of the nodes, so            instead of just teleporting from one location to another you get a            nice smooth pre-rendered transition, which helps make the game            world a little more believable, and shows you a bit more of the            beautiful worlds that the developers have created.                    The only downside is that the nodes have been placed rather            haphazardly. Some areas include several nodes that have no obvious            purpose except to confuse you, and getting from A to B often            involves going via P, T and Y for some reason.                    Somebody has apparently been reading too many ~Don't Walk On The            Grass~ notices, as in one particularly bad case in Ireland you have            to walk along a winding path involving about half a dozen nodes            just to get down a hillside to the beach, when the obvious thing to            do would be to take a shortcut across the grass. I know you're            occupying the body of a monk at the time, but still...         Of course, the most important part of any adventure game are            the puzzles. And first impressions for Atlantis 2 on this front            were good.                    The puzzles are mostly logical but still challenging, and highly            varied. You have to collect and reassemble the fragments of a            broken skull, recover a silver hand and sword for an ancient Celtic            king, talk to a man who thinks he is a blackbird, travel to the            Mayan land of the dead, and complete a Chinese riddle. I even found            a use for my knowledge of the Mayan's counting system at last -            don't ask...                    Unfortunately the puzzles aren't all this good, and several times I            had to resort to reading a walkthrough of the game to solve a            puzzle.                    Building the rainbow bridge in the Mayan after-life involves            shuffling pieces around until a little man can run round the track            they form and pick up all the coloured pieces in the right order.            As there are eight pieces you can move, and you can rotate each of            them as well, there are literally thousands of possible            combinations. It's a straightforward puzzle, but it takes a lot of            effort to find the right solution and can be very frustrating.                    Worse still are the puzzles which simply make no sense. A few of            the Chinese puzzles left me scratching my head in bewilderment,            including one which involved re-arranging five wooden markers into            a particular order. The clues as to which order they should go in            were cryptic at best, and there was no way to hear them a second            time if you missed any.                    And the Chinese hell is indeed hellish, a bizarre maze filled with            animal-headed bureaucrats. You must collect the right animal-shaped            stamps on your form in the right order to get the item you need,            but as this order is different every time you play and the stamps            don't correspond to the creatures which are giving you them, it is            a lot harder than it sounds.                    The only way to solve it is to find the girl who will tell you            which order to get them in, then go round all the animals            collecting stamps until you know which animal has which stamp. As            you can only put three stamps on a form, this involves going            backwards and forwards through a maze (which allows you to walk on            both the floor and ceiling!) several times, which is both time            consuming and annoying...         The ending is also something of a                 disappointment. Having travelled around the world, visited                 both Chinese and Mayan after-lives, and even entered the pages                 of a book, you might be expecting something suitably climatic.                    Instead you find yourself jumping at random between locations you            have already visited, picking up a huge collection of objects which            you have already found, and getting cryptic advice from people you            have already met. It's a little surreal, and totally pointless.                    You have a long and boring conversation with a scantily-clad woman,            which dumps the game's entire plot on you at one sitting. You have            to click on a series of curtains in the right order, which is            different depending on which order you used the six triangular            stones in - you had better hope that you can still remember this by            the end of the game!                    And finally you travel to Atlantis itself, now in ruins beneath the            oceans, for the great battle between good and evil. Or not, as the            case may be. Instead you find yourself clicking frantically on an            octopus' tentacles with a crystal. Hardly the great action finale I            was hoping for...         Atlantis 2 is a                 beautiful looking game, with gorgeous pre-rendered locations                 and cut-scenes, excellent music (though it may be a little                 ~new age~ for some), competent voice acting, and lots of                 interesting and often challenging puzzles.                    Sadly the game's ending is a massive anti-climax, and a few of the            puzzles you face along the way are either tedious or illogical, and            occasionally both. After the game's initial promise it's all a            little disappointing... There's also rather a lot of disk swapping            at times, so get hold of the soon-to-be-released DVD version of the            game if you can.                    Atlantis 2 is certainly not the best adventure game out there (try            Cryo's Faust instead if you haven't already), but it is still a            stylish and well presented game which can be entertaining despite            its flaws.                    Worth a look for hardcore adventure gamers in need of something            new, but if you're new to the genre you could find better.                        -                            Faust review                    Faust review                    Pompeii preview                    Pompeii preview                    Time Machine preview                    Time Machine previewGabriel                    Knight 3 reviewGabriel                    Knight 3 review"}