{"ref": "https://www.eurogamer.net/digitalfoundry-2017-amd-radeon-rx-vega-64-review-1", "date": "5 Dec 2017", "game_name": "Reviews", "text": "We've already taken a look at the excellent Radeon RX Vega 56, the cut-down version of the full-fat graphics card reviewed here today - and it's a winner. A couple of outliers aside, it's as fast as Nvidia's GTX 1070 or significantly faster and it easily overclocks to push further ahead. It's AMD at its best - competitive, disruptive and adding value - but the same can't quite be said for the RX Vega 64. It's a good product overall and it's competitive enough with Nvidia, but it offers no knockout blow - in the here and now, at least.But what's perhaps more concerning about the card is the fact that AMD has created an immensely powerful piece of kit with a raft of new features that - by and large - seem to be underutilised. The Radeon Technology Team have handed in the most fully featured DX12 GPU available on the market, etched onto a slice of silicon that's marginally larger than the GP102 processor within the latest Nvidia Titan, pairing it with the most expensive, state-of-the-art memory system money can buy. On paper at least, the architectural advances and sheer area consumed by Vega should be delivering a considerable generational leap, but real world performance doesn't seem to match the promise.In terms of basic spec, Vega 64 is very closely matched to the outgoing R9 Fury X, based on the Fiji processor. There are the same 4096 stream processors spread across 64 compute units (or 'new' CUs in the later model). There's a similar complement of 256 texture units and 64 ROPs. However, Vega ups its transistor count by around 40 per cent, while increasing clocks by a factor of around 40 to 50 per cent (max boost clock is a variable, compared to Fury X's rock-solid 1050MHz). Curiously though, there is a spec downgrade: Fury X's 4096-bit memory bus handed in 512GB/s of memory bandwidth from its HBM memory. Vega 64 uses much faster HBM2, but cuts the bus in half, so there's drop of around 5.5 per cent in bandwidth. It shouldn't impact performance too much and it has the benefit of reducing the footprint of the memory controllers within the processor.Aside from the move from liquid cooling to air (though a Vega water-cooled limited edition is available), Vega 64 has other similarities with Fury X too - specifically the 2x eight-pin power input requirement, plus a very familiar backplate: we're looking at three DisplayPorts here, along with an HDMI output. However, while the arrangement is physically very similar, all of the ports have more bandwidth and crucially, HDMI moves to the 2.0 standard, capable of a 60Hz ultra HD output. The board power requirement moves up though - Vega 64 consumes significantly more power than the Fury X, despite the move from older 28nm fabrication technology to the 14nm FinFET node.On the face of it then, Vega 64 should be a monster: more transistors, higher clocks and a raft of major architectural revisions and enhancements. However, Fury X was a decent competitor to GTX 980 Ti - Nvidia's last-gen 'big chip' GPU. With Vega 64, this situation has changed: AMD has instead been forced to position the new product against the green team's second tier offering: GTX 1080. No claims are being made for Vega 64's performance level against Nvidia's current-gen big chip products: GTX 1080 Ti and the two Pascal-based Titan X releases. And certainly in the here and now, there is the issue of cost. Attending AMD's Tech Day a while back, Vega 64 was introduced to us as the new GPU king at $500, with a £450 UK price. Based on our performance numbers, this is a claim that can be challenged easily enough as is, but within hours of Vega 64 going on sale, the price ratcheted up significantly. One UK retailer suggested that AMD had offered internal rebates only on the first batch of cards, but whatever the politics are, lack of availability right now along with the continuing Ethereum mining boom sees Vega pricing often sitting at the midway point between GTX 1080 and GTX 1080 Ti.The question is whether the gaming performance is there to justify that price-point. Like RX Vega 56, the capabilities of this card allow for excellent performance at 1440p resolution, whether you're talking standard 16:9 or the more 'cinematic' ultrawide 21:9 variant. And that's where we're going to start with our benchmarks. We've expanded our range of titles since the Vega 56 review: principally, to include further games that challenge Nvidia or AMD hardware, so Battlefield 1 operating under DX12 is added to the mix, plus there's a return for Rockstar's Grand Theft Auto 5.In our Vega 56 review, we noted a handful of titles where AMD's hardware could exceed GTX 1070 performance and move closer to the more powerful GTX 1080. Ashes of the Singularity and Hitman - games that historically favour AMD - fit the bill here, so it's not surprising to see the Vega 64 do well here, taking the lead over the 1080. However, the margin of the win isn't exactly huge. Call of Duty Infinite Warfare continues to do the business for AMD, but the real standout here is Battlefield 1 running under DirectX 12. With the DICE title, Vega 64 works almost as a midway point between GTX 1080 and the more powerful Ti, with a solid 11 point lead over its nearest Nvidia rival. There are also significant gains with id software's Doom too - a title specifically tuned to the strengths of AMD hardware in particular - but we can't put hard numbers on it without an extended run of like-for-like gameplay to measure (Doom is highly dynamic).Elsewhere, Crysis 3 and Assassin's Creed Unity - which bafflingly underperformed in our Vega 56 testing - continue to be a bit let-down, while GTA5 also hands in lacklustre results. We suspect that the latter is impacted by driver inefficiencies - paring back the extended detail slider brings AMD hardware closer into line with Nvidia. With fewer objects to process and fewer draw calls to pass through the driver, performance between AMD and Nvidia moves closer. Elsewhere, Vega 64 offers very similar performance to GTX 1080 overall, within margin of error on a couple of titles - Far Cry Primal and The Division. Meanwhile, other games including Rise of the Tomb Raider and The Witcher 3 see GTX 1080 push ahead by around three to five per cent. The immediate takeaway from these results is that while AMD is in the ballpark, we aren't looking at a re-run of Vega 56 here. By and large, the data suggests that GTX 1070 and GTX 1080 define the top and bottom of the range, with both Vega products sitting within their delta.Both Vega 56 and Vega 64 can deliver a decent 4K gaming experience though the numbers above may suggest otherwise. We've benchmarked at ultra settings or equivalent here, but realistically you're looking at mixing up your settings between medium, high and ultra in order to maximise frame-rates at this extreme resolution. In that scenario, the Vega products are both ideally placed to work well with 4K FreeSync monitors, and typically, keeping gameplay in 40-60fps territory is the aim here. The standout result here for Vega 64 is once again with Battlefield 1, which breaks the 60fps average at ultra HD resolution on ultra settings - an accomplished achievement. Elsewhere, it's curious to note that other titles which typically favour AMD hardware see the GTX 1080 draw level. Crysis 3 and AC Unity continue to bother the new AMD card, but the gap closes somewhat in GTA5 - presumably as the move to 4K shifts the balance from CPU as the limiting factor, the bottleneck shifting to GPU. With the outliers removed, GTX 1080 and RX Vega 64 typically provide a very similar experience, but the AMD card's boost over its Fury X predecessor isn't especially impressive - when we factor out the more puzzling results (or Ghost Recon, where Fury X simply doesn't have enough VRAM), we're generally looking at a 25 per cent to 35 per cent uplift. Bearing in mind the expansive nature of the upgrades from Fiji to Vega, we expected more.There's one more obvious takeaway. If you're looking for a single GPU for running 4K gameplay with the minimum of settings compromises, Nvidia's GP102-based graphics cards - GTX 1080 Ti, Titan X Pascal and Titan Xp - remain the only real choices here. After the more interesting last-gen battle between GTX 980 Ti and Fury X, we were really hoping that AMD could match or exceed Nvidia's improvements in raw performance.Finally, we bench at 1080p resolution, and it's safe to say that all of the cards tested here are often underutilised, with the CPU frequently bottlenecking performance. That's an impressive achievement bearing in mind that we use an Intel Core i7 6700K overclocked to 4.6GHz for our benchmarking runs. Regardless, there is still some scalability and it is good to see that the Vega line are capable of keeping up with - and sometimes exceeding - their Nvidia counterparts, even if Crysis, AC Unity and the CPU-bound Grand Theft Auto 5 continue to cause issues.Battlefield 1 continues to deliver the goods for Vega here, with a remarkable result that sees the hardware power ahead of GTX 1080 Ti, the only result in all of our tests that shows the AMD offering eclipse the Nvidia flagship. We've frequently pointed out the limits of AMD's DX11 driver, but there are very rarely issues with its DX12 counterpart. By contrast, Nvidia's DX12 performance is occasionally slower than DX11 - a baffling state of affairs we've noticed in titles including BF1 and The Division.The overall outlook here shows Vega 64 looking a touch slower than GTX 1080, but really, for 1080p display users we would recommend super-sampling down from 1440p (using either an in-game resolution scale at 1.33 or else using VSR or DSR to set game resolution to 1440p) or simply opting to save money with a GPU better suited to full HD displays. The GTX 1060 6GB is a good choice, but AMD is highly competitive with both RX 570 and RX 580, assuming you can actually find any of these cards in the midst of the ongoing mining boom.We finished up our usual tests by measuring power consumption from the wall. To do this, we use the scene below from Crysis 3, where the combination of intense geometry and alpha effects sends power draw close to its real-life gaming limits. Hovering around this scene is also good for stress-testing overclocks. It's at this point where Vega 64 reveals its core weakness against Nvidia's GeForce line. It's power-hungry, even compared to its Vega 56 stablemate. And there's the sense that with this cooling solution at least, little overclocking headroom remains.The figures here speak for themselves - it's difficult to avoid the sense that AMD has been required to push the Vega processor hard in order to match GTX 1080 and the end result is a spike in power consumption which does not look impressive compared to the competition, nor indeed compared to Vega 56. By extension, we found overclocking very difficult on the Vega 64. The HBM2 memory consistently failed above its rated speeds, while the core clock could only be pushed by an additional five per cent before the system crashed in the Crysis stress scene. There's also the sense that the reference thermal solution - which coped fine with Vega 56 at stock clocks - struggles to manage the heat pumped out by the fully enabled processor and we'll be interested to see how third party cards with bespoke coolers will improve matters here. These should hit the market in the next couple of months, and if you're considering a Vega purchase, we would suggest holding off until then.While we didn't have much success getting good results from overclocking Vega 64, we were curious about what would happened if we underclocked it - specifically matching the 1050MHz clocks of the Fury X. As a generational leap, there's the sense that the new AMD flagship is underutilised, bearing in mind its impressive feature set, so matching clocks with the last-gen Fiji processor would allow us to see the extent to which the core architecture has been improved.By and large, we noted an improvement in results in the three to seven per cent region, which is disappointing overall, while the troublesome Crysis 3 actually logged a regression in performance. The Fury X does have a memory bandwidth advantage we could not nullify that skews results a touch in its favour, but regardless, our takeaway is that the Vega architectural improvements are not being readily accessed by existing games. There's a good likelihood this will improve in future, but for those looking to upgrade their graphics hardware, improved performance in the titles they own is possibly more important than potentially larger boosts in future games.The numbers don't lie. There's an RX Vega out there that offers great performance for the money and brings the fight to the competition, but it's not the flagship product. Vega 56 is the real winner here, offering a compelling alternative not just to the GTX 1070 but to the Vega 64 and  quite possibly the GTX 1080 too. Of course, the more expensive Radeon is faster than its 56 sibling, but the uplift is only in the region of 12 to 13 per cent. That already slim advantage is pared back still further by overclocking the 56's HBM2 memory to match 64 speeds - in our tests, this simple adjustment knocks off around four to five per cent from the flagship's lead.All of which places Vega 64 in a challenging position. The fact is that whether you want to buy an AMD or Nvidia card, better alternatives are available. In the here and now, GTX 1080 is just as fast in most scenarios (if not slightly faster) and it's cheaper and more power-efficient. And if suggested prices hold, Vega 56 is cheaper still and offers the lion's share of the 64's power. It's so good that there's actually a pretty decent argument that this pared back Vega is actually the most compelling product out there if you're looking for a card that excels at 1440p gaming.That said, while the focus has been on the Vega line's performance in relation to existing Nvidia products, it's actually the Fury X comparisons that are the most eye-opening. Stack up a 980 Ti against a 1080 Ti on a library title with no architecture-specific optimisations and there's a solid 60 per cent improvement to performance - or better. Whether we're talking about the standard Vega 64 or its even harder-to-find, more expensive liquid-cooled variant, it seems that AMD has been unable to achieve the same generational leap. In the short term, that leaves the GTX 1080 Ti at the top of the heap with no effective competition, but in the longer term our concern is that continued lack of competition at the top-end could see the rate of progress begin to slow. We saw what happened in the CPU market with one company left to dominate, and the arrival of Ryzen spectacularly demonstrated that the market needs an AMD that's at the top of its game.But there is another argument - the notion that Vega's full potential has yet to be unlocked. The list of architectural improvements AMD has made to Vega is clearly substantial, yet the clock-for-clock comparisons with Fury X suggest that these new features are yet to be utilised by developers, or leveraged by AMD in the current driver revision. With that in mind, perhaps the Vega products will evolve over time and offer more - and we'll certainly be tracking their progress. But remember that even if those features are fully utilised, Vega 56 is based on the exact same architecture, and we suspect that whether it's now or in the future, the cheaper Vega will remain the preferred buy."}