{"ref": "https://www.eurogamer.net/antietam", "date": "4 Jul 2006", "game_name": "Sid Meier's Antietam!", "text": "Antietam is                 a real time wargame set during the American Civil War,                 recreating the bloodiest day in American military history, in                 which around four thousand men were killed and another                 seventeen thousand wounded.                    A single battle might not sound like much, but the battlefield is            enormous and the game features a whole range of scenarios, from            short skirmishes involving a handful of units in a little corner of            the map to replaying the entire battle, something which takes up to            twelve hours to accomplish.                    There are also a number of variations on the historical battle,            allowing you to play ~what if~ scenarios where one or both generals            act more aggressively, giving you scope for even greater bloodshed.                    The battlefield over which you will be fighting has been recreated            in great detail, with every wood, field, fence and farm placed            according to maps of the time. The units you will be commanding all            arrive according to their historical orders as well, though this            can be infuriating as it means you have no control over when your            reinforcements will arrive.         According to the blurb on the back of the box, ~In 1997, Sid            Meier's Gettysburg! revolutionized war gaming~.                    Whether or not that is true, it is now Y2K and the gaming industry            has moved on somewhat. Unfortunately Antietam has not, as it            essentially uses the same creaking old graphics engine that powered            Gettysburg, with a few AI and interface tweaks, and some new            terrain features to keep it wheezing along.                    The game is locked at 800x600 with pitiful 256 colour graphics, and            bizarrely it seems to achieve this by actually changing your            Windows desktop settings every time the game is loaded. So if you            are hoping to duck back to Windows during a game for any reason,            you can forget it...                    The units actually look surprisingly good given the archaic            graphics engine powering the game, especially viewed close up.            Animations are slow and clunky though, and the terrain is truly            horrible, speckled with black dots for some reason. The game also            starts to look rather messy when you zoom out far enough to get a            good view of the battle.                    The sound is competent enough though, with cannons roaring and            officers shouting to you when new units arrive on the battlefield,            and units letting rip their battle cry as they charge into close            combat. But there is no music apart from an annoyingly repetitive            drum that plays while you are using the main menu, and in the end I            resorted to playing the soundtrack from my favourite American Civil            War movie, ~Glory~, to keep me in the mood.         Of course, wargames have                 never been well known for their stunning graphics, and fans of                 the genre will no doubt argue that it is the gameplay that                 counts.                    Sadly Antietam doesn't exactly shine here either. The game is            overwhelmingly complex at the best of times, with a huge            battlefield to watch over and dozens of seperate units to control            in the full battle scenarios.                    The basic infantry unit in Antietam is a regiment, with four or            five regiments forming a brigade. As there is no unit grouping            facility you will soon discover that the only way to play the game            is by giving out orders to the brigade commanders, and then            adjusting the positioning of individual regiments where necessary.                    Unfortunately your officers show little or no initiative, and            unless an enemy unit strays within firing range they will just            stand there. This means that you have to constantly move your            regiments around to make the most of them, and it's not unusual to            see many of your units inactive while a battle rages just outside            of their effective range.                    And all of this must be achieved in real time, without many of the            interface advances that the real time strategy genre has            accomplished over the last decade. Luckily you can give orders and            move around the battlefield while the game is paused, but this            really defeats the purpose of making the game real time in the            first place...         It's not all bad news                 though. Antietam does feature some fairly useful in-game                 tutorials that will teach you the basics of the game, which                 makes things just that little bit less confusing. I would                 certainly recommend playing through all of the tutorials and a                 few of the smaller scenarios before attempting a full battle.                    The sheer variety of scenarios on offer should keep even the most            avid wargamer happy as well, assuming that the game's poor            graphics, mind-numbing detail, and finicky controls don't put you            off first. There is even a random scenario generator which can            create new scenarios for you, ranging from a ~small skirmish~ or            ~minor altercation~ to a full scale battle which can rival the real            thing.                    There is also a history of the battle written by one of the            officers who took part in it included with the game, which should            please American Civil War fanatics like myself, although            unfortunately it is only provided in-game rather than in printed            form.                    The game also features art by the ubiquitous Don Troiani for the            menu screens. If you know who he is you will know what to expect,            if you don't the chances are you won't care. It's just a pity that            the menu puts the rest of the game's graphics to shame...         Antietam                 is a wargame that only hardcore wargamers could love.                 Historically accurate to a fault, vast in scale, unnecessarily                 complex and poorly presented, it isn't going to win any new                 fans for the genre.                    Which is a shame, because lurking under the excessive detail and            dated graphics is an enjoyable game trying to break out. If you can            forgive Antietam its flaws you may come to love it, but for me it            was just too much work for too little reward in the end."}