{"ref": "https://www.eurogamer.net/odium", "date": "4 Jul 2006", "game_name": "Odium", "text": "Scientists. You                 just can't trust them.                    When they're not destroying the world with black holes (Outcast),            sucking hostile aliens into our world from another dimension            (Half-Life), or creating paradoxes that threaten to unravel the            entire fabric of space and time (The Time Machine), they're            obviously just enjoying a quiet cup of tea while planning what            mayhem to unleash on the unsuspecting planet next...                    The white coats have been at it again in Odium, meddling with            Forces Beyond Their Comprehension, resulting in an entire sewage            plant's worth of the brown stuff hitting an industrial size fan.                    And you, of course, have been sent in to clear up the mess.                    Arriving in a small Polish town, all you know is that the last team            sent to the town has disappeared, and that the Russians have            recently bombed their secret city Gorky 17 into the ground for            reasons unknown. Whatever happened in Gorky 17 could be happening            again...         The game itself is a mix of real time adventuring and turn            based combat, with some basic RPG style character development            thrown in for good measure.                    The adventure section of the game is fairly straightforward, with            you guiding your team of hardened special ops types (and anyone            else you find along the way) around the Polish town as you try to            find what's left of the last team to be sent there, and to discover            exactly what is going on.                    The game is mostly played from an isometric view, looking down on            your characters and their surroundings from above the rooftops,            although some of the smaller interior areas are done with more            interesting camera angles, looking like something out of Resident            Evil or Nocturne.                    And like those games, Odium has a mixture of pre-rendered            backgrounds and real time models, giving you the best of both            worlds. The town is modelled in far more detail than would have            been possible if the whole game had been real time 3D, and the            models can be more detailed as well because only a handful of them            are moving on screen at once. In fact, the level of detail shown in            the models for the characters and monsters puts most first person            shooter and 3D real time strategy games to shame...                    Moving around this environment is easy - left clicking on any spot            moves your team there, with the screen staying centered on your            characters as they move around. Interesting items usually flash to            make them stand out, and right clicking on one brings up a little            dialog box to let you use it or pick it up.                    The whole thing is rather simple and linear, but although it won't            impress a hardened adventure game player it does keep the game            moving at a fair old pace, and you rarely find yourself getting            lost or not knowing what to do next.         It's the turn based combat that is the real meat and                 bones of the game though, with fights sparking off every few                 minutes as you wander around the town. One minute you are                 walking along, minding your own business, the next the screen                 has zoomed in to a more detailed view and you are surrounded                 by hostile mutants.                    Each of your team members can move and fire in any given turn            (unless they are stunned, frozen, or otherwise incapacitated of            course). Select a character and the squares they can move to are            highlighted in green. Select a weapon or right click and the            squares they can fire into are highlighted in red.                    Although the basics are very straightforward, mastering the combat            can take some practice. Working out what weapons to use in which            situations, finding out how best to position your characters to            avoid them all being taken out by an area attack, and discovering            which enemies are immune to certain weapons are all important parts            of combat.                    And because ammunition is very limited, particularly at the start            of the game, if an enemy is badly wounded or stunned it may be best            to move in and finish them off with a close combat weapon to avoid            wasting any of your precious ammo.                    The array of weaponry is fearsome, ranging from axes, baseball bats            and bayonets for close combat to shotguns, rifles and pistols for            ranged attacks. Rocket launchers, napalm throwers and grenades are            available for those special occaisions, and there is even a            devestating ion rifle that can rip through multiple targets .. if            you can persuade your enemies to stand in a nice orderly line of            course.                    The flamethrower is my personal favourite though, producing an            impressive looking stream of fire that leaves your target burning            for a few turns, taking more damage all the time. There is also a            liquid nitrogen weapon that freezes your enemies, leaving them            unable to move or fire for a few turns.                    Most weapons use ammunition, but some (including the flamethrower)            don't, instead needing to be left to recharge for a few turns            between uses. Knowing when and where to use these special weapons,            and against which enemies, is something you will need to learn...         Given how frequently fights occur, it's a testament to the            game's designers that combat rarely gets boring.                    One of the main reasons for this is that the game features a whole            range of different enemies to unleash your arsenal on. Almost every            other fight you get into includes at least one type of creature            you've never seen before, and they get bigger, more deadly, and            more gruesome as the game progresses.                    Each new monster is introduced by a short pre-rendered cutscene            before the fight begins, and these are top notch. As in any good            horror movie, the monsters are always lurking in the shadows in the            cutscenes, seen only in brief glimpses and extreme close-ups,            leaving you still unsure exactly what you are facing until the            fight loads.                    In fact, waiting to see what bizarre creation is going to lunge out            of the shadows at you next is one of the main reasons you will keep            coming back to the game. The monsters are all exquisitely detailed            and gruesomely conceived, and each has its own weapons and            characteristics, and (in some cases) weapon immunities.                    There are literally dozens of different creatures to kill during            the game, and with the wide range of weaponry available to you by            the end of the game there is always something new to try out.                    Killing monsters will earn you experience points which you can then            spend on increasing your maximum hit points, hit accuracy, luck,            and other statistics. Also, using weapons successfully in combat            increases your proficiency in them, allowing characters to cause            more damage with weapons they are experienced with.                    Odium is no role-playing game, but the experience system does add a            basic character development element to the game, and it all helps            suck you in as you decide how to specialise your different            characters.         At its heart, Odium                 is a turn-based combat game, following in the footsteps of the                 old X-Com games. The difference is that Odium looks beautiful                 and is easily accessible, but still has the depth to keep you                 interested.                    The adventure keeps the plot moving along, but at the end of the            day it isn't going to challenge most players, and it is the combat            and the endless succession of bigger guns and new monsters to kill            them with that keeps you hooked.                    The only real let down is the ending, which is something of an            anti-climax, and leaves you wondering what the hell happened - I            think maybe I managed to skip a scene somewhere along the line...                    The final battle was easier than several of the earlier fights, and            when it is over you are left with a lengthy in-game cutscene as            your commander ties up all the loose ends, and a whole new            explanation for the events you have witnessed is shoe-horned in at            this point, which feels a little unsatisfying. And then, to cap it            all, the game ends with a little cinematic showing you flying off            into the sunset carrying a big dossier marked ~top secret~,            obviously leaving the developers open for a sequel.                    But given how much fun the rest of the game was, I'm perfectly            happy to sit back and wait for the sequel now...                        Try before you buy -            download the            demo! (81Mb)"}