{"ref": "https://www.eurogamer.net/digitalfoundry-2017-intel-pentium-g4560-budget-cpu-king-review-1", "date": "5 Dec 2017", "game_name": "Reviews", "text": "So here's a thought. Buy a Core i5 or Core i7 processor for gaming and the bottom line is this: on the majority of titles out there, its resources are highly underutilised. The GPU is the primary bottleneck during gaming, sometimes leaving your CPU with a significant amount of untapped overhead. So the question is this: can you spend less on your CPU and still get a great experience? And more to the point, what processor can keep your graphics card fed with data while offering exceptional value? We put our money where our mouth is and spent £63 on a Pentium G4560 - and it's something special. It truly is the new budget CPU king. Indeed, since we bought it, we've even seen it on pre-order for as low as £57.The remarkable reality is that the real excitement in Intel's new Kaby Lake processor line-up isn't actually at the high-end, it's in the budget sector. Up until now, Pentium processors have been hamstrung by only offering two threads in a world where games require at least four. The Pentium G4560 is essentially a junior i3 - clock-speeds are lower, but crucially, hyper-threading is retained. As we saw in our recent Core i3 7350K review, the end result is that the Pentium is offering 75 to 80 per cent of the i3's performance at just 36 per cent of the price. An i7 7700K is twice as fast in many cases, but it's over five times more expensive.So just how well does it perform? First of all, we'll take a look at some basic benchmarks. Of course, there is something of a disconnect between synthetic benches and real-life gaming performance, but for the record, here's how the Pentium G4650 stacks up against a range of Core processors we've recently tested. Its 3.5GHz clock speed puts it at a disadvantage compared to the pricier chips, but there are other cutbacks too. AVX2 instructions are disabled, meaning that the benchmarks here show a considerable disparity between the Pentium and last year's Core i3 6100 - which on paper, offers just 200MHz of additional frequency. We tested the Pentium G4560 on an MSI B250M Mortar, a product that sits at the premium end of the chipset's spectrum. The idea behind the board is pretty simple - what if you want a good-looking, functionally rich board but aren't too fussed about overclocking? It's based on the micro-ATX form factor, allowing for integration into a very small case. On the board itself, the full limitations of the B250 chipset are in place, so despite the BIOS featuring an overclocking area, you're effectively limited to adjusting DDR4 latencies and little else of consequence - there's a hard and fast limit of 2400MHz here when using a Kaby Lake processor.M.2 SSDs and even Intel Optane are fully supported on the B250M Mortar, and there's no shortage of fast SATA-3 ports for hooking up and getting the most out of standard solid state storage. Intel supplies the LAN technology (which features power surge protection support) and sound is taken care of with MSI's Audio Boost. USB 3.1 is fully supported, and there's a reversible Type-C socket on the rear. Multi-GPU is also supported via AMD's CrossFire, but Nvidia SLI is off the table.We paired this board with four sticks of Corsair Vengeance LPX rated for 3000MHz (but limited to 2400MHz on this board), with 15-17-17-35 latency and ran everything from an OCZ Trion 100 SSD. Corsair's RM1000i supplied power, while cooling the Pentium required nothing more than the supplied Intel heatsink and fan - which is surprisingly very quiet bearing in mind how slight it is.This is particularly evident when we look at HEVC encoding under Handbrake, which is effectively crippled on the Pentium and where the i3 6100 offers up a 40 per cent performance boost. But the good news is that the cutbacks in the G4560 do not seem to impact gaming performance whatsoever, and improvements elsewhere within the Kaby Lake platform can actually draw you level with i3 6100 frame-rates. And this is significant. Last year, we paid £93 for the i3 6100 and called it the best budget CPU on the market. This year, even factoring in the massive bump to PC component prices in the wake of the Brexit vote, we have the same performance for £30 less. In speccing out a budget build, this is a big deal.To test the Pentium G4560, we put together a budget-orientated PC gaming set-up. The Z270 boards we've previously used for reviewing the unlocked Core 'K' chips are replaced with a more modest MSI B250 Mortar board. The B250 chipset has no CPU overclocking facilities whatsoever, making motherboards based on this set-up better suited for a budget build. However, the B250 chipset has a secret weapon - support for 2400MHz DDR4 memory, compared to the 2133MHz limit on RAM imposed on all Skylake processors. We've yet to confirm it, but even cheaper H110 boards may support 2400MHz RAM too - but it will require an updated BIOS.But the point is that this support for additional memory bandwidth is significant. Prior Digital Foundry processor reviews have found a distinct relationship between CPU performance in gaming and faster memory. This is especially significant for lower-end chips like the Core i3 line and the Pentium G4560 - because you are far more likely to be CPU-bound using one of these chips, so anything that can push up lowest recorded frame-rates is obviously a good thing. And this is borne out in the benchmarks where the move from 2133MHz DDR4 to the new 2400MHz standard effectively allows the Pentium to overcome its clock-speed disadvantage against the Core i3 6100. In six out of the seven games we tested, the G4560 with 2400MHz DDR4 matches the performance of an i3 6100 paired with slower memory.To put these benchmarks into perspective, let's explain our methodology. As the GPU is the primary limiting factor in gaming, many processor benchmarks do not highlight CPU performance at all. Average frame-rates don't work as a comparison measure when only split-second excerpts of any given benchmark may be CPU-bound. We overcome this by running our titles at 1080p on ultra settings or equivalent using an overclocked Titan X Pascal. This pushes processor power and memory bandwidth to the forefront and allows us to measure relative performance in processing game logic and preparing draw calls for the graphics hardware - the primary tasks for your CPU.Our initial table here shows performance of the Pentium paired with both 2133MHz and 2400MHz DDR4, and stacks it up against a selection of processors you may be considering for a budget build - including the aforementioned Core i3 6100, plus a quad-core i5 6500 for those willing to invest a little more. Joining the Intel trio in the line-up is a brace of AMD chips - the Athlon X4 860 and the FX 6300. Both are significant in that they can be overclocked, and the Athlon can be matched with very fast DDR3 - we used 2400MHz modules here, while our AM3 board limited the FX 6300 to 1600MHz modules. Regardless, the end results are fascinating.Check out the shot above (click on the thumbnail for the full resolution image). Call of Duty: Infinite Warfare runs faster on AMD's RX 480, compared to its Nvidia rival, the GTX 1060. It's an advantage that plays out consistently, as you can see in our Infinite Warfare PC performance analysis. But here's the thing: running these GPUs with an i7 - as we did above - essentially offers something akin to a bottomless pit of CPU power, and the balance of power between the green and red teams changes rapidly when you pair each GPU with a less capable processor, like the Pentium G4560 we're reviewing here.And you can see that in the shot below, taken mere seconds later. As soon as the action intensifies, the RX 480 suddenly loses a lot of performance. Minimum frame-rate actually hits 45fps in our tests - 20fps lower than the GTX 1060. And that's important when choosing a graphics card to pair with a less capable CPU. AMD's DirectX 11 driver lacks multi-threading capabilities and is significantly less optimal than Nvidia's, meaning that when the CPU is taxed, certain titles lost a lot of performance (and we stress, not all games exhibit the issue, but you have no guarantee which titles will be affected and which are fine).And that's a shame, because in looking at the most powerful CPU you can comfortably pair with the Pentium G4650, AMD's RX 470 actually looks like a winner. On sale, it's often just a little more expensive than Nvidia's far less capable GTX 1050 Ti. In fact, get the right RX 470 and overclocked, it can beat a reference 4GB RX 480. But when so much performance is lost owing to driver overhead, it's not a good idea. It's even more frustrating because AMD's Vulkan and DX12 drivers are excellent - the RX 470 worked beautifully with Doom 2016 in our tests, running locked at 1080p60 with ultra settings.And at the same time, the GTX 1050 Ti is perhaps a little underpowered for the Pentium, while the GTX 1060 is enormously expensive. For these reasons, we reckon that a used GTX 970 may be the best GPU partner for the Pentium. It's much faster than the GTX 1050 Ti, and second-hand, it only costs a little more.For gamers really on a budget, looking for a new GPU - there are two decent choices: the GTX 1050 and the RX 460. Both are under-powered to the degree that driver overhead shouldn't be an issue on the AMD side, and with realistic tweaks to visual presets, you can still get a console-beating experience on many titles.In the UK, the Pentium is priced relatively closer to the Athlon and it's cheaper than the FX 6300. In both cases, it is faster - indeed, up against the Athlon, there's no contest - Intel's budget offering is on another level. However, the era of the many-core game engine is finally paying dividends for AMD's now-ancient FX line. Titles like Rise of the Tomb Raider and The Witcher 3 hold up remarkably well on the six-core FX 6300, though games like Far Cry Primal - which rely heavily upon single-threaded performance - drop off significantly. Also notable is Ashes of the Singularity's CPU benchmark: the Pentium and the i3 are slow compared to an i5 or (especially) an i7, but the FX 6300 stutters noticeably, while the Athlon has multi-second pauses. While we don't have full benchmarks to hand, we can also confirm that the Pentium G3258's stuttering issues are even more pronounced than the Athlon's. Regarded as a budget winner by some, the fact is that the lack of hyper-threading combined with hobbled memory bandwidth reduces the G3258's gaming capabilities considerably. Put simply, the new G4560 wipes the floor with it - a combination of hyper-threading and wider memory bandwidth effectively making it an i3 in all but name. It's also interesting to note that the lack of AVX2 instruction support does not appear to be holding back the new Pentium in the slightest - and this is interesting because this functionality is supported in the PS4 and Xbox One Jaguar CPU cores, so we should expect them to be utilised in modern titles. And finally, we put together a comparison table showing the expandability of a budget PC based on the B250 chipset. Just how much more performance do you gain by moving on up to a more expensive chip that can replace the G4560? We've compared the Pentium against the stock performance of the Core i3 7350K, Core i5 7600K and Core i7 7700K running with the same 2400MHz DDR4 modules we used with the G4560. In short, it's a straight CPU swap-out - and it shows some dramatic gains as we move through Intel's stack. For our money, the i5 remains the sweet spot for running modern games at high frame-rates, but what's clear is that there is a marked level of diminishing returns with regards to performance the more money you sink into your set-up. In terms of a straight value comparison between CPU cost and resultant in-game frame-rates, the Pentium is a clear winner.Of course, benchmarks are one thing but the actual gameplay experience is quite another. Finding the right GPU to pair with the G4560 took some doing. However, we enjoyed good results using the GTX 1060. On the face of it, pairing a £230 GPU with a £63 CPU seems ludicrous, but we could happily run Doom 2016 on ultra settings under Vulkan at a locked 60fps. Similarly, Infinite Warfare ran beautifully with everything bar shadows maxed. Star Wars Battlefront? Even in huge multiplayer games, 1080p60 at ultra was no problem. However, a 64-player Battlefield 1 game shows the Pentium consistently maxed across all four threads, and while performance was mostly locked at 1080p60 on the required ultra settings, drops beneath the threshold were evident in heavier scenes.As a rule of thumb, console titles running at 60fps run great on the Pentium, even with a powerful GPU. However, 30fps console titles require some work - The Witcher 3 needed to be dropped down to high settings and even then it could frame-out in the busier city areas. Crysis 3? It's a disaster on the Pentium, leaving the GTX 1060 highly under-utilised. The best advice here is to lock to 30fps using the Nvidia control panel's half-rate adaptive v-sync, and scale up resolution. We could run the game on high settings with medium shading and shadows and hit 4K, 30fps with the 1060 (!). Alternatively, 1440p30 on very high is equally attainable.Here at Digital Foundry, we love to test the latest and greatest gaming technology and with Skylake/Kaby Lake, Intel is the (current) undisputed king of CPU technology. The i7 6700K and 7700K are capable of phenomenal performance while the i5 6600K/7600K offer excellent results for 60fps gaming. But it's the budget components that we love to test: the challenge of tweaking games and customising the experience to work on less capable kit offers a level of fun you don't often get with more expensive hardware, which essentially does all the work for you. Mainstream PC hardware has reached the point where 1080p60 gameplay is possible simply by whacking all settings to high or ultra. That's brilliant of course, but there's much fun to be had diving into the settings and manually tweaking the experience to your liking, to push a budget set-up to its limits.And when it comes to more value-orientated kit, it's all about price vs performance and the G4560 is simply untouchable. Taking the GPU out of the equation as the primary limiting factor during gaming, the Pentium offers around half the performance of a stock i7 7700K for 20 per cent of the cost. And of course, the actual real-life differential between the two processors will adjust based on the GPU you pair with it. So in prepping your new budget PC build, some degree of care is needed in choosing a graphics card, but the choice of CPU is a no-brainer - shop around for 2400MHz DDR4, ensure you get a motherboard capable of running the RAM at its required speed and buy one of the hyper-threading enabled Pentiums. Yes, the G4560 isn't the only Pentium capable of running four threads - the G4600 and G4620 offer frequency bumps to 3.6GHz and 3.7GHz respectively, but you do pay extra for the privilege. Based on our tests here with the G4560, all of them should be great performers for budget gamers. But as things stand, the G4560 is the cheapest hyper-threaded Intel processor available and the value on offer here is simply phenomenal. However, as good as it is for its ridiculously low cost, it's also important to recognise its limitations in real world gaming: many of us prefer the PC experience because it allows us to break free of the 30fps limits found in console titles - and 1080p60 gaming remains a highly desirable experience. Results here with the Pentium G4560 are variable and as good as it is as a budget processor, we still recommend a fast i5 for 60fps gaming on demanding modern titles."}