{"ref": "https://www.eurogamer.net/rt2gold", "date": "4 Jul 2006", "game_name": "Railroad Tycoon 2", "text": "I                 must admit, upon reading ~This game is about trains for people                 who love trains~ on the                 official Railroad                 Tycoon 2 website, I was a tad worried that I was about to                 witness digital trainspotting!                    Visions of grown men in Anoraks sprung to mind, their notepads            flapping in the wind, pens poised, huddled together in delirium as            another train whooshes past Bethnal Green station. Yes, dear            readers, I did start to worry!                    I needn't have fretted. Though RT2 could be deemed as directed at            train enthusiasts, it is just as easy to get into for any strategy            fan. RT2 is a build and manage type of game. Think of Sim City, you            get the idea; build from nothing into a thriving empire.                    In RT2 you are put in charge of a railroad empire in the 1800's.            You can choose to be any one of the famous industry tycoons from            around that time. Typically you begin each map with just one            station, a little bit of track, and some spare money. You are given            a briefing before each scenario, which can be joining two towns            together, or maybe supplying a certain amount of food to a place in            a given time frame.                    One of the games frustrating aspects is getting part of a task            done, having taken ages to do it, only for the time limit to            expire! Certainly in the early levels where one is green to it all,            a little room for forgiveness would have been nice.                    How you complete these maps is further varied by bronze, silver and            gold medals. To get a bronze medal you simply have to carry out the            basic requirements of the mission. To get the silver you would have            to do all that, plus make a certain amount of money, for example.            The Gold medal might take all this, and reduce the time you have to            do it all in.         With limited                 resources, you have to be frugal with your money. The                 temptation to simply slap segments of rail-track down any old                 how is hard to resist. It pays to make sure you read the                 mission briefing thoroughly beforehand, so you know exactly                 when and where you have got to lay track to.                    As you place each segment, the game will inform you how much it            will cost to lay, and the track's gradient. If the gradient is            above five then your train is going to have a steep hill climb to            negotiate! In early maps the terrain isn't too varied, and it is            easy to lay a zero gradient track, but on later levels things get a            lot more difficult. Flat is good, steep isn't. You may even need to            bulldoze certain areas to clear yourself a path.                    I found the track placement to be a very frustrating experience, as            it is extremely picky as to where you have your mouse cursor. The            direction you wanted your track to go can be changed irritatingly            by the slightest of mouse movements. If I had hair, it would have            been torn out by now!                    The key to financial success is to ensure you are catering for each            station's needs. Clicking on any of your stations will bring up its            own lists of supply and demand. If the station needs passengers,            then check to see if the next station along is supplying.            Similarly, if one has a plethora of mail to offload somewhere, find            a station that is demanding it.                    For every new station you build, you need to provide certain            services also. The main pre-requisites I found were to build a            water tower and a sanding tower at the same time as the station, as            steam engines need lots of sand and water to operate. Also            advisable is to have a Roundhouse situated at every other station,            so that trains can be maintained and repaired.                    As your station draws in more passengers and/or more goods intake,            you will also be able to add additional buildings. These can            include small or large restaurants, warehouses, saloon bars, and a            whole host of other buildings. Be careful of overkill, as using too            much money on buildings may well put your finances in the red, and            either leave you bankrupt or without any money for improvements.            Much like real life there!                         The graphics are really quite nice in RT2. The game can be                 viewed from a N.S.E.W. perspective, and is displayed in an                 isometric fashion. The maps can be zoomed in and out, and are                 extremely well presented, looking like proper geographical                 prints.                    The actual trains and surroundings are also very neatly done. It's            frightening how impressed one can be as you set your first train            running! It's like watching a little Hornby world in action -            little plumes of smoke bilge from the train's funnel, seaside port            cranes swivel, loggers can be seen carrying their timber from one            building to the next, and lots of other subtle animations besides.                    One word of warning though - you may find that the lack of            variation in landscape from one scenario to the next is a tad            laborious.                    The video clips range from the really good to the completely bad.            Unfortunately this is where the graphics side of things is let            down. I firmly believe if you are going to provide video footage,            it should at least be displayed to you in the best resolution your            PC can muster.                    The initial introductory video is perhaps the worst. Watching an            already ropy piece of black and white footage in 640x480 is not            exactly good viewing. The pre-scenario videos are generally of            excellent quality though.                    Where the game really has personality is in the sound department.            Each scenario is preceded by the voice of an old man with an            American Southern dust bowl accent, who informs you of the task            ahead. If you fail to begin the mission, he will pipe up with a            sarcastic comment or two to gee you up! His knack for insulting you            after a failed scenario is hilarious at times too.                    The in-game sounds are quite sparse, but used to good effect. The            bleating of lambs can be heard in farm fields, the sawing in the            woodsheds, and of course the chug of the steam engines themselves.                    The game comes with an appropriate CD audio track of slide guitar            style bluegrass. Personally I love this type of music, but I think            a lot of people don't! You will be glad to hear it can be disabled.         Not                 only do you get the full RT2 with the Gold Edition, but you                 also get the expansion pack, ~The Second Century~, which takes                 you into the 20th century .. and beyond.                    The scenarios included with the pack cover 1939 to 1950 (including            war orientated missions), 1950 to 2005 (resolve modern day            transporting headaches), and 2005 to 2030, where the majority of            land is flooded from the melting ice caps, and it is your task as            an expert railroad tycoon to devise a workable rail network!                    The difficulty increase in the pack is evident right from the first            mission, where you are tasked with linking a choice of three sets            of two cities together. The only problem with this is that you have            a huge great mountain range to negotiate! If this is your first            outing into RT2, then I suggest you complete the tutorial provided            before attempting even the easiest of levels. This pack is aimed at            the expert Tycoon, and is not a good starting point for beginners I            assure you!                    There are new buildings to cater for more modern times, like            distilleries and army barracks, and of course there are new trains            too, including the Eurostar! In all there are over twenty new            scenarios, which should keep even the most ardent of RT2 fans at            their PC for a few hours.         I've not been this relaxed                 playing a game in ages! It's funny how sitting with beer in                 hand, watching my little trains going about their business,                 can be so relaxing and rewarding. Managing to escape certain                 bankruptcy and then pulling in stupid amounts of money is                 extremely satisfying.                    I did find the picky nature of the track placement to be            infuriating at times, often threatening to upset my calm. The            unforgiving nature of some of the scenarios is also annoying,            especially if you have just spent the last hour getting to first            base only for your time limit to expire on you. The inconsistency            in video quality, and the repetition of in-game graphics from            scenario to scenario may disappoint some as well.                    On the whole though, ~Railroad Tycoon 2 Gold Edition~ is a fun            gaming experience which will appeal to most strategy fans, not just            train fanatics. With the existing maps you have a challenge on your            hands, but the extra maps in the expansion pack will ensure the            game doesn't gather dust on the shelf just yet.                    Notepads at the ready! See you at Bethnal Green station. :)            Release Date - available now                    Try before you buy! Check out the Railroad Tycoon II                        demo (45Mb)."}