{"ref": "https://www.eurogamer.net/q3a2", "date": "4 Jul 2006", "game_name": "Quake III Arena", "text": "It's a bit of a daunting task to sit down and                 review an id game. No other games have quite the fanatical                 following nor the sharp polarisation of views. id themselves,                 despite being quite a normal software developer internally,                 are so revered to this day that they remain the last of the                 famous rock star developers.                        EuroGamer's editor, Gestalt, last week took an            initial            look at Quake III Arena with the wider viewpoint of how the            game fits into the global scheme of things. I'd like to try sum up            Quake III Arena in the same way, but also take a look at how the            game shapes up for those folks, like me, that treat FPS games as a            way of life rather than 'just another game'.                        Traditionally I kick off reviews with a bit of background, but I'm            sure that everyone is familiar with id's past legendary works, so            far so I'll cut to the chase - Quake III Arena is a strange hybrid            of supremely polished first-person shooter evolution and a burning            desire to have it appeal to the broader gamer. It's a bit odd, but            I mean that in a good way...         Of course, it is more than fair to compare Quake                 3 to Unreal Tournament, yet the games differ massively. Unreal                 Tournament is an evolution of a game with some wacky inventive                 weaponry, modified so it all works right.                    Add into that a whole load of gameplay modes and some absolutely            superb bots, and whether you are an online player or a solitary            gamer, it's not hard to see why Gestalt dished out EuroGamer's            first 10/10 score in our            review            of the game.                        I'll have to just come out and say it - out of the box Quake III            Arena doesn't stack up very well to Unreal Tournament. In what            ways? Features, content length, but ultimately how much game is in            the box.                    Quake 3 delivers a large number of deathmatch maps but that's it,            just deathmatch. Some might argue that is getting a bit tired these            days. Of course, aimed at the mainstream it makes sense -            deathmatch was where we all learned the delights of the FPS, so            what best to introduce others to the joys of fragging?                        The only non-deathmatch addition is Capture the Flag, and at first            glance it is a cut down poor man's CTF if ever there was one. ~No            techs, no grapple and only 4 maps!~ they cried.                    However upon further playing (from midnight to 3AM last night to be            precise) - it turns out that the game is extremely well balanced            and plays very well indeed. That's a relief.         The mainstay of Quake 3 is deathmatch, and                 that's what you get. The single player progression - fighting                 the bots through all the levels with an occasional duel                 injected into the stream - works fairly well, and it's fun.                    The bots are generally not as impressive at Unreal Tournament's,            and although id say you should notice a different style about each,            I didn't. They are pretty good all the same though.                    At the end of the day the single player doesn't last very long. So            id's grand plan is to shoehorn new players quickly into playing            Quake 3 online, and that ultimately all the new fancy gameplay            modes will be provided by the third party 'mod' community.                        It will work too, of course. Having spent some time following the            development of the game, it is painstakingly clear that the engine            is absolutely state of the art when it comes to modifying it. We            are going to see some amazing things done with Quake 3, and largely            that is a direct result of how much work has been done on the            engine at the expense of adding gameplay modes out of the box.                        Interestingly id added considerably more models than Epic did, no            wonder really since Paul Steed didn't have to model up bad guys for            a single player game - he might as well do player models!                    They are without question exceptional, and while I have disliked            some of Steed's style in the past (huge collars and boxy legs in            Quake 2's models) there is no question that models like Crash and            Orbb are fresh and animated beautifully.         It's all a bit odd playing in Quake 3 with these                 radically different looking characters. It is not a 100% level                 playing field as other games have sought to be. Some models                 are smaller, harder to see, and make a heck of a lot less                 noise as they jump and hurt.                    There's also been a big shift away from elements that allowed the            best players to utterly dominate, and I welcome this. A more            approachable and newbie-friendly FPS is exactly what the scene            needs, and id have delivered exactly that.                        The most tooled up player is still fairly easy to take down with            the powerful weapons by outplaying them in a 3 second battle of            reactions and wits. The decision to supply a default machine gun            weapon has been argued about often, but at least a newly spawning            player can feel they have inflicted some damage before being            summarily despatched by a rocket launcher.                    It also means that a team group is formidable, even if they don't            hold the weapons. All of this levels the playing field a bit, but            there's no question the better player will always win .. just not            by 56 to -1.                        One pet peeve I have is that id seem to have designed their            graphical effects to evangelise 32-bit. Unlikely any game that has            come before, many of Quake 3's multipass translucent effects look            quite poor in 16-bit, with cheesecloth effects in evidence.                    If it was necessary then so be it, however I don't believe it is.            In fact I still consider the weapon effects to be inferior to many            far older games. Ditching of the Quake 2 particle system lead to            the railgun rendered with some - you guessed it - translucent            effects. It has none of the hard-edged frightening glory of the            Quake 2 spiral effect. It's all a bit... pretty.         In the move towards rationalising Quake 3 as an                 arcade game, powerups, ammo boxes and weapons have become more                 abstract, and a further excuse to use some spectacular                 reflective effects. The weapon models are all very stylised                 and effective, with the exception of the BFG, which looks like                 some kind of stunted lizard unbefitting its awesome power.                    This all lends to the stunning visual style, and the only criticism            I can level here is that it takes quite some time to learn the act            of picking players from background with this amount of eye candy in            evidence. It is, to my mind, too difficult when you're talking            about tiny models like the skeleton. I bet all the hardcore players            will soon be using it for an advantage.                        Weaponry wise Quake 3 offers absolutely no surprises, with a mix of            weapons from the previous Quake games, and even a bit of Doom.            There are no fancy alternate fire modes, however in the quick paced            frag-fest this simplicity lends a more straightforward strategy to            deathmatch tactics.                    There is much less feeling of being killed unfairly by some random            spread of rockets or grenades such as in Unreal Tournament and this            is good. However, there are annoying elements like the beep-on-hit            feature, which sounds good in theory but which is utterly            unnecessary and totally out of keeping with the theme at close            quarters.                        There is also a rather tragic effect of a gun going 'click' several            times when empty, before changing to one that has ammo. It is often            the cause of death, and leads the player to thinking themselves            unfairly killed, rightly or not.         There are some other strange decisions like                 player models not showing until the scoreboard is brought up.                 When done, this generally results in a terrible lag spike or                 even a phone jack! The scoreboard itself barely fits a handful                 of players on the screen, and is extremely poor compared to                 Unreal Tournament's superb alternate score screens.                        Sadly there are also straight code quality problems, the biggest            one being the mouse wheel problem which was found in Q3DemoTest but            still, for some reason, not fixed. There are workarounds, but given            this is one of the most popular ways to select weapons it is very            odd it wasn't found in testing.                    Also, id have finally acknowledged, at least partially, the            advances in sound technology as well as graphics. Quake 3 supports            Aureal's A3D 1.0 API, which provides basic 3D positional audio and            some simple filtering (such as when under water). Unfortunately it            is fairly broken and results in noticeable slowdown and an eventual            crash, despite using the latest Aureal drivers.                    We assume these problems will be fixed in a patch, and a 'point            release' is scheduled soon. But as this is a boxed shipping game,            it is fair to mention them up front.         There are also some game balance issues that                 need to be resolved. After Clan 9's Hakeem went over to the                 USA and bested them in the Quake 3 demo, he was seen to                 comment ~Q3 sucks, all I do is shaft shaft shaft~ - referring                 to the dominating lightning gun.                    As a result id toned it down. So down that it is useless, and they            didn't notice? Ho hum, another thing to fix in a mod .. along with            a proper teamplay hud, weapons dropping, and getting rid of those            damn beeps.                    Oddly Carmack was persuaded by force of argument to leave strafe            jumping in, despite saying that ~strafe jumping is an exploitable            bug. Just because people have practiced hard to allow themselves to            take advantage of it does not justify it's existance.~ Until enough            of them complain about it being removed, that is...                        It is also worth noting that while Quake 3 seems quite efficient in            terms of memory usage and loading speed, it does have graphics            hardware requirements that are generally in excess of Unreal            Tournament.                    Mostly this has to do with id's continual evangelism of OpenGL.            Having tried the game on a range of cards, I have concluded that it            works best on nVidia's family from the TNT up to the GeForce 256.            The latter absolutely excels at Quake 3, with its hardware            accelerated transformation helping no end.                        It works 'OK' with a Voodoo 3, although the game experiences            unbearable slowdown when the giblets start flying. We're talking            single digit frames per second now. Metabyte's WickedGL helps a lot            here, so you will be wanting that.                    Matrox's G400 cards render the game beautifully, but for some            reason the TurboGL bombs out randomly (which it didn't with the            demo), so it is nowhere near as fast as it could be.                    Anything else and you are pretty much out of luck if you expect to            see the game running at a good solid frame rate. Not very            mainstream friendly in that regard is it? Still, id probably views            that as preferable to eating humble pie and supporting Direct3D.                    No doubt the Quake 3 engine licensees will have to add Direct3D            support, as they have in the past. However, it is safe to say you            will never see it for Quake 3 itself, so card manufacturers will            have to rewrite their OpenGL drivers specifically for it. Again.         At the end of the day, id have created a                 polished, if basic, first person shooter. It is going to get                 all the best mods, and it is going to be huge. It's not                 without problems and game balance issues, but nonetheless it                 is a stunning game and a hell of a lot of fun to play .. while                 it lasts.                        id pretty much invented the notion of giving away extra content and            endless patches. There is certainly no reason to believe            differently this time, and I find myself inclined to say that Quake            3 must be regarded as a better game than it is out of the box.                    The game is desperately in need of extra content (and patches) from            both id and third parties, and that content shall be forthcoming.            In fact, barely a day after the development tools were released, a            good quality custom map appeared for download - the trickle before            the deluge, no doubt.                        Zoid's recently released triple pack of new CTF maps goes some way            towards revitalising Quake 3's out-of-the-box Capture the Flag,            upping the total CTF map count to 6. Should this have been included            in the box? Certainly few doubt the release was hurried to keep in            the race with Unreal Tournament. However Quake 3 CTF undeniably has            that addictive pull of superb gameplay, this author sleeping in far            too often due to 4AM Q3A CTF sessions.         FPS heads are going to have to buy Quake 3, if                 not now then at some point down the line for the uber-mods                 (Rocket Arena 3, PainKeep 2025 etc).                    Players looking to get a first time taste in the single player            deathmatch would be better off looking to Unreal Tournament.                    id's latest is deathmatch refined, with the best customisable 3D            engine the world has ever seen. At the end of the day, it is the            latter that makes Q3A an essential buy."}