{"ref": "https://www.eurogamer.net/cm9900", "date": "4 Jul 2006", "game_name": "Championship Manager: 99/00", "text": "Picture the scene - a crowd                 of lads in the pub, beers in hand, loudly discussing                 Saturday's full-time football scores.                    One of them bemoans the recent misfortunes of his lifelong            supported team. During his scathing analysis he mentions how it's            really not any of the player's fault, but it's all down to the            manager. He should be asking the board for more money for players.            He should be playing such and such on the wing, not in the centre.            He should be sacked.                    Chances are that the next week, the team wins, and all of a sudden            said manager is absolutely terrific, the best the team has ever            had! Sound familiar?                    It's always easy to shout from afar, but would you do a better job?            Unless you are tied into the game from an early age, the odds of            you finding out for real are pretty minimal.                    Or are they? I present to you Championship Manager 99/00 edition.            This is your chance to see just how good your managerial skills            would be in the real world.         After a painless                 installation, the first thing you need to do is give your                 manager a name, and choose the team you are either going to                 make, or break!                    This is your first taste of just how massive the database is in            CM99/00. You can choose any team from Arsenal in the English            premier league, through to Yeovil in the Conference.                    It doesn't stop there either. You can also choose to be in            virtually any league you can think of. Fancy taking control of the            mighty Juventus of Italy? No problem. How about taking control of            Tampa Bay in the American MLS? Of course for the latter, you'd need            to explain that it's football, not soccer. Grin!                    Once this is done, the program will then set up the new season            ahead. Depending on your processor power, this may take a fair            while to process. Those of you thinking that any sort of delay is            quite unacceptable, think again. CM99/00 runs 16 concurrent            leagues, with about 40,000 players encompassed within.                    Not only this, but there is each player's own attributes, team            histories, top scorer tables, league tables, cup competitions, the            transfer market, international tournaments, and for each club there            is a reserve team complete with all its own relevant attributes.                    That is an obscene amount of data! So you can forgive it for taking            a couple of minutes to set itself up each season now, can't you?                    Once you have selected your team, it's time to check out what            low-lifes you have just taken charge of. The squad select screen            shows you every member of your team and their preferred position to            play in. It will also show you whether the player is injured,            unhappy, on loan, out of contract and other attributes.                    Get used to this screen and how it works, you'll be seeing it a            whole lot during your reign.         If you are                 expecting lavish graphics and FIFA 2000 graphical style game                 coverage, you are going to be very disappointed. Similarly, if                 you are expecting a ripping soundtrack and groovy in-game                 effects, you will not find them here.                    Graphics wise, everything is text and menu driven. The menus            themselves are extremely easy to get to grips with and navigate.            For each different page, you also get a good quality background            photograph of various footballing heroes.                    With CM3 99/00 edition you can play either in a window or full            screen. This is an absolute necessity, as there are times where you            want to let the program deal with its data crunching, and go do            something else in the meantime!                    So how does a simple text driven game work over something more            appealing to the eye? Simple. It is down to the quality of            simulation. Sure thing, it would be an excellent idea to have a            game where you can play each match in FIFA2000 style, and also do            the management bit.                    Where this idea would fall foul though is in exploitable gameplay            flaws, not to mention someone just becoming too good for even the            most adept of computer controlled teams. The way CM99/00 works is            perfect. It means you simply cannot guarantee your success, it has            to be earned.         The way I see                 it, you will be one of two breeds of manager. Either A) you                 will dip straight into the transfer market and bleed the board                 dry, or like me B) go with the players you have got and see                 how it goes.                    This is where the game takes control of you, and will not let go.            You see a player, he's not a happy chappy, the temptation is to            just simply ignore this. Sometimes this works, and said player will            begin to warm to your leadership, but other times he will just            stick in a request for a transfer.                    This is where you have to start making tough decisions. Do you            increase his wages if indeed that is his problem, or do you just            shove him on the transfer list, and let him rot in the reserves.            It's all down to you.                    Okay, you have selected your starting 11, with 5 substitutes, and            you are ready for your first game in charge. Unless you scrutinise            each player's statistics before hand, you won't really know what            type of display they are going to show.                    My advice is to select the team based entirely on each player being            in their preferred position. You can worry about fine-tuning for            the next match.                    You will usually find that the first match weeds out the whiners            straight away, with maybe one player who is used to first team            action not even on the subs bench. It is the chance you have got to            take. You have the flip side to this - maybe you select someone who            wasn't even given a chance by the previous manager, and for you he            shines like a new penny.         Kick off! The current game is shown to you via a simple                 possession bar, score, scorers and time left. You can 'view'                 the game in real-time, or you can choose an accelerated mode.                    Even on the fastest option, each game takes around 2 minutes to            complete. Commentary comes to you in text form, and is surprisingly            entertaining to keep track of. Crowd noise also runs alongside the            commentary, cheering gleefully if a team scores, and a big            collective gasp of disbelief at a near miss.                    This works well too, but it soon gets annoying, and you'll be            switching to the accelerated match option before long.                    Prior to kick off, during the match, and at half-time you can            change what formation the team is playing in, and whether this            formation is to be attacking or defensive style. You can also make            substitutions at any time.                    Players are assessed on their performance from 1 to 10. If all your            players are performing above 5 then you don't really need to make            any changes. Below 5 and it might be worth chucking on a fresh pair            of legs.                    If any players get yellow carded, and you can see they are still            getting involved in scrapes, you are best advised to sub them too.            If a player gets injured, you are automatically taken to the game            squad list to name a replacement.                    Depending on your team, and more than likely your luck, you will            find injuries and suspensions to be common place. If your team is            particularly prone to this, you are going to need a much bigger            squad to accommodate such absentees.                    So did you lose your first match 6:0? Maybe you won it 1:0, but            possession was always in the opposing team's favour. Either way,            you have got to look at the problem areas in the side, and act upon            them. If you won it 4:0, don't think this guarantees you success            either, you just probably played a team with more problems than            your own!         CM99/00 sports some brand new features over the original CM3            release. One of the most interesting, and certainly the most evil,            is the ability to fine players. That player who has had umpteen            wage rises is still not happy? Hell, fine him!                    You have far more interaction with the board of directors too,            rather than them telling you how dissatisfied they are all the            time. You can insist they increase the wage structure of the club            to avoid player discontent, or recommend ground improvements to            accommodate more crowd volumes.                    One of the really neat new features though is the ability to assign            scouts to individual players, or to an entire team. These scouts            will give you regular feedback as to who's hot and who's not. They            can also be used to search the youth circuits for young talent.         Let's get this straight. This is a true football                 simulation for true football fans. If you are expecting to                 take hold of Kidderminster and within 5 seasons reach the top                 flight, with no opposition on the way, then you are in for a                 surprise. You have got to work for success.                    It sounds totally stupid, but you need to build a kind of            relationship with your players. By this I mean, you have to know            them inside out. Who's temperamental? Who's reliable? You also have            to have a keen eye for the transfer market, picking out bargains,            or maybe getting that extra £20,000 out of a sale of one of            your players.                    The sheer complexity and accuracy of the database is very            impressive, and you will be hard pushed to find many holes in it.            Believe me, I've tried. The game can be a little on the slow side            in-between games while it crunches the data from other games, but            this is only a minor niggle.                    I have the game windowed at the moment. Stevenage Boro have just            notched up their first away win of the season! Hurrah! Please            excuse me now, I need to talk to the board about ground            improvements.                    Ah yes, jumpers for goal posts. Isn't it?"}