{"ref": "https://www.eurogamer.net/edgar", "date": "4 Jul 2006", "game_name": "Edgar Torronteras Extreme Biker", "text": "Before you ask, that's Edgar                 Torronteras, the ~famous~ Spanish motorbike superstar. What do                 you mean you've never heard of him?                    Jokes aside, underneath the meaningless ~celebrity~ tie-in Extreme            Biker is an action-packed motorbike game in the same vein as            Micrsoft's hugely successful MotorCross Madness. In fact, rumour            has it that Extreme Biker was re-worked after Executive Producer            Daniel Bobroff saw MotorCross Madness at E3 last year.                    But London-based developers Deibus Studios have worked hard to            differentiate Extreme Biker from MotorCross Madness, and to bring            something new to the genre. Let's see if they succeed...         There are three different                 game types set across 23 tracks as diverse as the desert,                 arctic wastelands, hell and Paris.                    The obvious distinction is between MotoCross and SuperCross races -            the former are set outside in the fresh air, with sprawling hills            and vast canyons, and the latter take place inside huge stadia,            with a suitable rent-a-crowd on hand to cheer you on.                    You can play single races or in Tournament mode, and most races see            more first corner incidents than your average Formula 1 weekend.                    The tracks are about as varied as you could expect for a sport            which involves riding around a circuit getting ludicrous air. Some            are tight and twisty, and others have long straights with tight            hairpin bends. There are usually cross-over points, and the mid-air            collisions are quite spectacular.                    From what I know of the real thing, it all seems fairly authentic.            You must maintain a constant rhythm of up and down the jumps - miss            one landing and you can easily drop from first to last place while            you recover.                    That might sound daunting, but with inbuilt Artificial Stupidity,            the computer controlled players often overshoot corners or misjudge            landings as well, so you can usually catch up lost places if you            keep everything vertical. The podium places are often decided by            who has the cleanest final lap, which is again fairly true to real            events.                    There are three levels of difficulty, each with customisable aids            such as correcting the position of the bike before you land. You            can choose your bike class from 125cc, 250cc, and 500cc engine            sizes, as well as being able to use a fully custom bike for all you            tweak fanatics, changing all manner of suspension and engine            variables.         The                 third mode of play is the Freestyle section, where you attempt                 to pull off a sequence of outrageous stunts in exchange for                 points. Again, various aids are available, and you can only do                 the most difficult stunts on the higher difficulty settings.                    Unfortunately, although it is potentially the most exciting part,            FreeStyle is also the most flawed and difficult. Whilst the videos            and screenshots make this free-for-all stunt affair look totally            mad, after ten minutes it's you who are totally mad.                    Depending on the difficulty level you have chosen you have an array            of up to 14 tricks you can perform. The most basic involve the            simplest of key presses, but for all the really cool stuff you have            to press numerous buttons in quick succession in various            combinations.                    That would be OK if the rider would actually do it, but more often            than not he either refuses to do anything, or begins the trick far            too late and crashes horribly.                    And if you can activate the trick, you then have to control a            ~puck~ and hold it in the middle of the screen - this represents            the rider's balance. If you stray outside the zone, he loses            control and crashes.                    This is a novel approach, and it works in theory. In practise, I            found myself limited by the number of keys I could press            simultaneously on my keyboard. I imagine that using a joypad,            especially a Microsoft Sidewinder Tilt, would make the control a            little less of a nightmare.         Developers have often said that                 developing a software version of a game can hold back certain                 3D implementations because they are too slow. By starting with                 the premise of a 3D-card only engine, they can afford to be a                 lot more extravagant in the visual department.                    This is the approach Deibus have taken with Extreme Biker. The            render depth is simply enormous - easily as far, if not further            than MotoCross Madness. The scenery is all highly detailed, with            smooth humps and curved ramps.                    Add to this the inclusion of lots of extra objects such as palm            trees, rocks and even traffic, as well as the ability to go            anywhere, and you can tell that a lot of effort has been put in to            raise the stakes above and beyond the high standards set by            Microsoft last year.                    Don't be fooled by that minimum spec though - all this eye-candy            requires some serious grunt to get moving. Even on my PII-450 with            a Voodoo3 3000 the game would jerk every now and then on some of            the larger tracks, and that's only at 800x600.                    This may be due to 3dfx's D3D drivers (which are not the best in            the world) but still serves as a warning to those with lesser            machines.         The animation is                 excellent - riders shift their weight when they take corners,                 and even the far-fetched stunts are believable .. more so when                 you see the FMV of our man Edgar actually doing it!                    The only black mark is the crash scenes. Deibus have used real-time            physics algorithms to animate those unfortunate moments when your            rider comes unstuck. The idea is to reduce the use of            pre-calculated crash animations, which usually seem totally            unrelated to the incident in question.                    Unfortunately in the bid for realism they have overstepped the mark            - while the rider clearly has skeletal underpinnings, they turn to            jelly after a nasty fall and limbs start flailing around into            positions that would make a contortionist wince.                    It's funny the first few times, but then just becomes laughable.                    The sound effects are good without being outstanding - the bikes            sound like bikes, and apart from some bone-crunching grunts there            isn't much else to comment on.                    The soundtrack is suitably extreme with various rock / dance            tracks - they complement the atmosphere without getting on your            nerves .. like the constant FMV of Mr Torrontoras at the end of            each level. The stunts are impressive the first time, but after            that you appreciate the ability to skip them with a quick tap of            the ESC key.         It is difficult to summarise Extreme Biker - the                 graphics are good all round, and the gameplay varied, but                 ultimately I wonder who will actually go out and buy it?                    Hardcore biker fans will either love it for its fresh ideas            compared to the ageing MotoCross Madness, or hate it and simply            count the days until MM2 is released (first half of next year).                    I know many racing-game fans shun bike games as ~four wheels are            better than two~ which excludes them, and the control system,            although about as customisable as you could hope for, is just the            other side of tricky for beginners.                    Which is a pity, because they would all miss out on what is a good            all-round game in a genre where so few manage to get things right.                    And big air IS cool.                        Try before you buy! Check out the                        demo (76Mb)."}