{"ref": "https://www.eurogamer.net/digitalfoundry-2017-seagate-firecuda-2tb-review-1", "date": "5 Dec 2017", "game_name": "Reviews", "text": "The Seagate Firecuda is a 2.5-inch 'laptop-size' drive - a 2TB hybrid costing around £115/$130. What makes it stick out? Well for PlayStation users, it ticks a few crucial boxes if you're itching to upgrade the standard hard drive. Until this model came along, we've had 1TB as the maximum size for 2.5-inch hybrid drives. Even with on-board NAND memory to increase speeds, 1TB might still not be quite enough to make an upgrade worthwhile - after all, PS4 Pro ships with the same level of storage out of the box. But the big question is, can this upgrade deliver both a capacity upgrade and a notable performance bump over the stock drive?The Firecuda 2TB is a classic example of cutting-edge tech opening up new options, potentially to be pushed further with time. Simply put, a 2TB laptop-size hybrid is possible thanks to a new technology, called shingled magnetic recording, or SMR for. This new method lets Seagate layer multiple tracks onto the mechanical platter for a more energy and space-efficient design. It moves away from the perpendicular magnetic recording, PMR, where decreasing the size of a bit on the platter makes drives thicker, heavier, and hotter. Past a certain point, this creates problems for installing larger hybrid drives on PS4.In the end, SMR means this new 2TB Firecuda not only has capacity to its merit, but at 7mm in depth, is actually smaller than most drives we've put into the console. Indeed it's overkill, and makes you wonder if the technology could eventually make 4TB drives possible in the more conventional 2.5-inch/9.5mm form factor supported by PlayStation hardware. Time will tell on this front, but for now we have 2TB in the bag.On the surface, the mechanical drive specs for the Firecuda don't impress - we're looking at 2TB of storage, but only a 5400rpm rotational speed. However, this is crucially backed by 8GB of fast on-board NAND. The end result? Initial access for data offers little or no reduction to loading times compared to regular mechanical drives, but with constant use, data throughput speeds up massively, potentially even matching SSD speeds. Seagate uses this 8GB NAND intelligently, as expected of a hybrid, with a multi-tier caching system storing the most frequently-used packets of data for quick access later on. For a sense of perspective, we tested both this Firecuda 2TB drive, and also a regular mechanical 2TB HDD from Samsung (the ST2000LM003 to be precise). To be blunt, results on this Samsung drive are in line with expectation. At 9.5mm in depth, it nears the physical limit of the PS4 HDD caddy but delivers a hefty 2TB upgrade for £120. However, loading times are more often than not worse than the console's stock drive - one egregious case being the 114 second wait to load Battlefield 1's first mission, compared to the stock's 109 seconds.To pick another, loading a save in Skyrim - to Helgen village - takes 31 seconds on Samsung's 2TB drive rather than 27 seconds on PS4's stock. In other words, it has space but not necessarily the speed we're after. Even factoring in a margin of error, where repeat tests can show a variance, the value of Samsung's 2TB HDD solution isn't a wholly satisfying one. Roll in the Firecuda 2TB at a similar price-point, and things start to get interesting.We used Battlefield 1 as a case study for the Firecuda's properties, kicking off with a launch PlayStation 4 model. It's a game with some notoriously long load times on PS4's stock drive, where the first campaign mission can take almost two minutes to get going. Impressively, an SSD brings that down to a mere 47.7 seconds, though on its first load, the Firecuda offers no loading time gains even close to that mark. At 112.8 seconds it's actually a backwards step - but the twist? The more we repeat the loading procedure (always restarting the application from scratch), the faster the Firecuda becomes.Five tests, five increasingly improved results. That initial load time of 112.8 seconds reduces to 79.5 seconds on the second attempt, dropping to 76.3 seconds on the third try. By the time the data is accessed for the fifth time, we're down to just 50 seconds - within striking distance of the SSD and the fastest result the drive is capable of. This is the hybrid drive's NAND in action, logically caching the data it sees in frequent use. And even after starting a game of Skyrim in-between tests to mix things up, we returned to Battlefield 1 and it was still loading that level after 50 seconds. Meanwhile, the Samsung ST2000LM003 2TB mechanical drive (the standard upgrade drive - until now) is locked to around 114 seconds regardless of how many times we reload the level in the same fashion.The pattern repeats when testing Battlefield 1's Cape Helles map, where the Firecuda initially posts a 67.8 second load - beating the stock PS4 drive and the standard Samsung 2TB upgrade. But once again, rebooting the game several times, the following five tests load it in progressively faster. In order, that gets you 59.7 seconds, then 45.2, 34.3, and finally it settles at 33.3 seconds from there on out. In other words, with a fourth or fifth attempt loading Battlefield One's large levels, the Firecuda beds enough information in to almost match the SSD. In this case, our OCZ drive comes in only a little earlier at 31.5 seconds here.Clearly, the Firecuda's technology works well on the standard PS4, though it will rely upon the drive 'learning' the new games you install, with progressively speedier loading the more you play. The best case scenario loads may degrade too, as new data jostles for position within the cache. For players hot-swapping between more capacious, 30GB+ games this will in theory lead to more varied results, but the benefits are clear for those restarting and retrying in a single game. It's also worth noting that games with shorter load times - as our Skyrim results show - tend to reap fewer rewards. In that case a 27 second load on stock gets a less remarkable gain, down to 22 on the hybrid drive.So far so good - but how about combining PS4 Pro with the Firecuda? Are there any extra benefits to using the drive there? Overall, there are a lot of unknowns here, variables in how the hybrid caches data that we can't control. But comparing our fifth, and fastest attempts on the Firecuda, a Pro machine expectedly gets a similar upturn to 51 seconds in the first Battlefield 1 level. A regular PS4 does post marginally better results here (again calling into question the effectiveness of the Pro's SATA-3 interface), but on the other hand Skyrim reverses those fortunes.The gains on PS4 Pro aren't as clear as we'd hoped, especially given data for the Samsung 2TB and OCZ SSD show an inherent (if not wild) boost in speed once paired with that machine. In those cases, test conditions are more easily repeatable, whereas the Firecuda stats are at the mercy of caching behind the scenes - a factor out of our hands, where the variance in numbers can eclipse the advantage PS4 Pro may have. Even so, loading times scale in a similar fashion on either PS4 model, and at the very least you can expect a similar level of upgrade.Overall, as an option for upgrading either PS4 or PS4 Pro, the Firecuda makes a lot of sense. Even though it possesses a significant price premium over the standard 2TB Seagate upgrade, hybrid technology ties into the way we play games to achieve an effective speed boost over time. Doubling or quadrupling space gives a decent amount of breathing room in the age of the 50GB game install, but with patience, but the shortened load screens are a big bonus. Once cached to the NAND partition, the results put this hybrid into a similar league to SSDs, where equivalent-sized 2TB solid state drives cost a small fortune. The first time using the Firecuda, it's fair to say you will be underwhelmed at the speeds. Initially, these times are essentially no better than PS4's stock offering in many cases, but keep using it to load your favourite games and you should see palpable speed increases the more you play. If your budget rules out a £500+ SSD of the same size, and you have an aversion to SATA cables dangling out of the rear of your PS4 to a more spacious 3.5~ desktop drive, this option strikes the right balance. Between convenience, price, size and speed, right now this is the one to get"}