{"ref": "https://www.eurogamer.net/flanker2", "date": "4 Jul 2006", "game_name": "Flanker 2.0", "text": "With every new generation of games they become both more advanced            and more realisitic. We have seen first person games increase in            realism almost infinitely in comparison to their original            precursors, but nothing has matched the level of detail and realism            that the flight sim genre has achieved.                    Thanks to massive increases in 3D acceleration and raw CPU            processing power, it is now possible to develop a flight combat            simulator that is as accurately modeled on the real world as it is            possible to be. Flanker 2.0 represents the latest developments in            visual detail and realism.                    The Su27 Flanker is one of the most advanced Russian aircraft in            service today, and more than a match for most western aircraft.                    So you might assume that in order to successfully fly it in the            game, you would need to know a bit about aerial combat, counter            measures and all that malarkey, but fear not as the game comes with            an extensive 200+ page manual that explains everything you will            need to know. It even has the Russian alphabet listed in the back!                    The manual is a real armchair pilots delight as it contains an            interesting history of the development of the Flanker, as well as            detailed information on the weapons that you are likely to            encounter in the game. This can prove useful when you have enemy            S-300PMU long range SAM batteries preparing to fire at you.                    Can't be bothered to read the manual? Don't worry, the game            contains an extensive set of training missions which teach you            everything you need to know about being the worlds best armchair            pilot.                    The training covers all aspects of the game from carrier landings            to dog fighting and ground attacks. Thankfully the system is            blissfully simple and shouldn't bore the average player by being            too technical.                    The system operates with the instructor talking you through a            maneuver as he does it. After you've had it explained to you, it is            your turn to give it a try. The instructor will then give you            constructive criticism on how to improve your technique.                    Once you have completed basic training you are ready to fly one of            the worlds most advanced fighter jets on a proper mission...         The game's missions are laid out in a standard                 campaign style, but unlike most games of this type, the                 campaign changes and branches depending on the level of your                 success.                    In true tradition you must at least accomplish some of the goals            set out for you in a mission, but should you fail to successfully            bomb an enemy munitions plant, for example, you can expect to come            under more anti aircraft fire in subsequent missions, which in turn            makes the game harder.                    Luckily it is possible to rectify the situation, as you may get a            second chance to take it out, which would once again cause the game            to branch.                    Thanks to this the game offers a fair degree of non-linearity, but            as they say ~all roads lead to Rome~. You are fighting for the same            outcome whatever you do along the way.                    During the game you will pilot both variants of the Flanker, naval            and airforce, which means that sometimes you will have take on a            more multi-role style of mission, eliminating strategic ground            targets and defending the skies from hostile incursions.                    Oh, and then land back on the carrier at the end of it all.         Thanks to some brilliant modeling and texture design, all of            the aircraft, buildings and vehicles are wonderfully realistic and            certainly help immerse you in the virtual world created in Flanker            2.0.                    It is possible to fly past tanks and SAM sites and identify the            exact vehicle that is about to fire a deadly missile at you, which            while is not all that terribly useful is a testament to the level            of detail put into this game.                    The landscape is also extremely well done, but this time the credit            can't all go to the development team. Using recently de-classified            Russian stereographic satellite photographs, the team has used            these to accurately model the Russian landscape complete with            rolling hills, dipping valleys and soaring mountains.         Buildings are                 also realistically placed in the virtual world, once again                 based on their actual geographic location and design. With                 detail like that it's a good thing for the Russians that the                 Cold War is over...                    The cockpit is accurately modeled on the real Flanker aircraft, and            comes complete with instruments that are all displayed in Russian.            Sensibly there is an option to have the cockpit HUD display in            english, but strangely not all of the instruments follow this            setting...                    The final facet of the simulator is the sound, which hasn't been            neglected either. Now whether or not the development team actually            sampled the in-cockpit sound of a Flanker aircraft is up for            debate, but it certainly sounds suitably noisy. If you close your            eyes you can almost imagine sitting on a jet engine as it powers            up. Almost...                    3D positional audio has also been put to good use in to further            enhance the experience, and certainly when you tear past an IL-96            (a large slow cargo plane) at Mach 1.2 it sounds impressive enough.                    Flanker 2.0 is certainly an evolution on the previous game, sequels            generally are, but it also helps improve the quality of the genre.                    Novalogic and DID have always seemed to lead the field with titles            like F22 Lightning 3 and EF2000, but Flanker 2.0 deservedly sits up            there with its more well known brethren.                    That said it isn't the perfect game, and the anal attention to            detail may reduce the appeal it has to the general game playing            populous.                    For those that care about flight sims it is definitely one to check            out. For those who couldn't care less, it is probably one to leave            on the shop shelf."}