{"ref": "https://www.eurogamer.net/r-pathwaytogloryikusa-ng", "date": "3 Jul 2006", "game_name": "Pathway to Glory Ikusa Islands", "text": "So, what is this wrongly shaped device I've got here? It's a Nokia N-Gage QD, and it's, yes, a rather oddly styled machine. In fact, it makes me wonder what exactly Nokia was thinking when it envisioned the N-Gage.I also find it surprising that anybody is still creating games for the N-Gage; at least until I discover that actually, no, nobody really is, and this is just a sequel to a first-party, apparently highly-regarded turn-based strategy game. Of course, I say 'highly regarded', but I personally know nobody who has played it. But there you are.But then I think, why I am thinking these things at all? My task is to review Pathway to Glory: Ikusa Islands, not to review the N-Gage itself; the flaws of the N-Gage are already well known. But then, I think, a game console's limitations are a critical part of whether one will enjoy playing a game. And indeed, the flimsy control buttons, the tiny screen, the unit's unwieldy form factor, and its tendency to repeatedly shout ~Out of Memory: Close all applications to continue playing~ all conspire to detract fun from the game.But then I think that, okay, so the N-Gage is an embarrassment, a failed experiment in gaming, but nevertheless I should review the game on its own merits. But then I think that, as a first-party title, this is primarily an exercise in proving that the N-Gage isn't dead, which it manifestly is.  So then I think... Clearly, I think too much. Just focus on the game. Whatever needs to be said about why the N-Gage failed has already been said.When Nokia released the original Pathway to Glory in 2004, it did so to a great deal of hype, since it was a make-or-break game for the N-Gage. It flopped, and few people bought N-Gages. Nevertheless, it is considered to have been a decent turn-based strategy game, and so now we have the inevitable sequel.But as a war-oriented turn-based strategy game, Ikusa Islands has some pretty stiff competition on handheld systems; you only have to glance at the DS and GBA to realise that. Even so, the one Big Thing that Ikusa Islands has to offer that games like Advance Wars don't is its N-Gage Arena online play.  However, as it soon transpires, you have to find somebody to play with first. And that's a challenge in itself.Set during World War II, Ikusa Islands 'does an EA' and decides to turn the focus on the battle is for the Pacific Islands rather than boring old mainland Europe. Divided into an increasingly difficult set of objectives; your aim is to move your soldiers, one at a time, deploy and use your weapons, and achieve your objectives before your enemy achieves theirs. Pretty standard strategy stuff.Most of the missions follow a similar pattern, starting with your men grouped together close to the finish, but with a lot of Japan and even more enemies between you and your goal. Each of your men is given a fixed number of action points available per turn, and these are used up doing pretty much anything except turning on the spot.  Running for cover, ducking, sprinting, crawling - all take up points, but to varying degrees. Crawling takes up more points than running, but you're far less likely to be seen. So which is it to be?The controls are - the clacky nature of the N-Gage notwithstanding - easy to use. 8 and 0 are assigned to moving a soldier's body position, and everything else is controlled by moving the cursor around with the d-pad. The cursor provides you with substantial amounts of information as it scans the play area, including how many action points will be expended by moving the currently selected soldier to the cursor's position. It also helps aim, and will inform you whether or not you have clear line of sight at an enemy, and how accurate your soldier is likely to be if he fires. You then cycle through your weapons with the 4 button, point at a target, and fire, or you will be offered the chance to expend some extra action points to manoeuvre into a better position and increase the chances of a hit. Move - Fire - Move - Fire. Man, I sound like Alan Partridge. That really is it. It's a simple yet hallowed gameplay mechanism, and one which has served the Advance Wars games beautifully for years. But for such a simple mechanic to work, the enemies have to be up to scratch. If they fail, the game just feels empty and repetitive. And that, ultimately, is where Ikusa Islands falls short. Because of the difficulty of finding a human partner, you will have to play the AI, and the AI is uninspired to say the least.I know that all AI opponents are nothing more than numbers, nothing more than algorithms, but at the very least, I expect the game to make some attempt to hide that fact, and make me feel as if I'm squaring off against a real opponent. Unfortunately, you can feel the N-Gage calculating away, the barely-hidden rules tangibly directing every action of your opponents in a predictable way.And once you get to that stage, where you feel that you always know exactly what your 'opponent' is going to do, and are nearly always correct, the game's charm begins to slide away. Of course, all of this wouldn't necessarily be a problem if you were playing against a human being, who one would hope would have more hard-to-decipher algorithms. Which is the reason why the N-Gage has its wonderful (in theory) Arena.The online multiplayer should be the jewel in the crown of Ikusa Islands. I'm reliably informed Arena games can support six players on a battlefield, and each player can have eight soldiers. It should be fast and furious fun, but I wouldn't know, as I was never able to find an opponent long enough to offer me something approaching a complete game, which is a pity. Had I been able to get a decent multi-way Arena game going, it's possible this could be a great multiplayer experience.  Unfortunately, I couldn't possibly comment - and this for a game that's been out for weeks.In terms of how it looks, it's not bad at all. Given the tiny N-Gage screen, the game looks rather cute. The sprites of the soldiers are well-designed and realised, and the backgrounds that make up the play areas look rather pretty, and offer an appropriately engaging facsimile of a war-torn Japanese island. Even the audio's not bad either, with a series of well-acted voiceovers that describe and offer you a rationale for your various missions, and these are backed up by a series of beautifully-orchestrated set-piece themes that add a great deal of depth and spirit to a game that feels otherwise empty of anything but style. But its beauty is, sadly, only skin deep.Ikusa Island - despite Nokia's best of intentions - can't help but be hamstrung thanks to the N-Gage's form factor and decided lack of owners. The gameplay mechanics are extremely simple, but that in itself might be no bad thing if you had good opponents. Unfortunately, the AI opponents feel like what they are: highly predictable scripts whose strategies you will see through in short shrift. And, unfortunately, attempts to acquire to human opponents to offer more of challenge will frequently if always turn up nobody at all.Sadly, this difficulty in finding a challenging opponent, real or otherwise, coupled with the well-document flaws of the N-Gage, leave this game a wholly unsatisfying turn-based experience."}