{"ref": "https://www.eurogamer.net/r-pesm-ps2", "date": "3 Jul 2006", "game_name": "Pro Evolution Soccer Management", "text": "Given that excellent early Championship Manager games are available for thruppence and capable of running on a Casio wristwatch, let alone a modern PC, the compromises of console-based equivalents - which to this day remain hamstrung by a lack of important PC components to churn the data and crap, low resolution displays - are off-putting. Like accepting a lift to the station from your gran when walking would get you there quicker and without having to talk about your diet/job/when you're getting married/the dangers of baiting mallards.That said, the developers of the current crop of console sheepskin sims like LMA Manager are increasingly wise to this, and having grumped enough about not being able to run 48 different leagues concurrently, have responded with things like fancy match engines that aim to offer greater visual excitement than statistically heavy PC efforts. Pro Evolution Soccer Management, Konami's first attempt to give players control of the clipboard rather than the ball itself, takes things even further. The clue is in the title - you're not managing a game of football, you're managing a game of Pro Evolution Soccer, and the differences run deep.For a start, each match only lasts ten minutes, and this can't be changed. Players play in the manner of mid-level, PS2-controlled opposition in PES5 - sensibly, cautiously, and often rather boringly and predictably. Licenses are fairly thin on the ground, so while the likes of Chelsea and Arsenal line up properly, they're often up against the likes of Merseyside Red and Man Blue - and player data is much less than up to date, with Roy Keane still at Old Trafford, for example, so you'll have to mess around in the PES-like Edit Mode if you want things to appear as they should. Fortunately you can import data from a PES5 save-file if you have one.But while the lack of attention to detail is a bit annoying (and at times utterly bizarre - how on earth did they miss the frequent references to the defensive ~Office Trap~?), your lack of influence over players and proceedings is likely to cause more offence.The illusion of management starts off okay. Pre-match, your coaching colleagues can provide ~Opponent Research~, usually identifying obvious trends like Lampard's range of passing and vision in midfield or Arsenal's penchant for overlapping play, and offer suggestions on how to combat things. You can set a flat back line, change your level of aggression, alter formations, arrange group tactics (for example, advising players around your playmaker to move forward when he receives the ball), adjust individual players' behaviour (telling midfielder to use through balls, center-forwards to hold things up, flair players to dribble more, players in midfield to join the attack, and so on), and do most of the things you'd expect. On the training ground, you can select which areas you want the team to work on in the run-up to a game, gradually boosting their proficiency. It's not the sports science chemistry set of Football Manager, but it is a plausible facsimile. Unfortunately it's been grafted onto PES with Pritt Stick.There are obvious things you can do - like PES, players who spend most of the game sprinting will be half-dead by 70 minutes and need to be replaced - but a lot of the time you just want to grab the controls and actually make them play the way they do when you're playing PES5. When you make for the tactics screen mid-game, you're often told that your new thinking won't have much effect because you haven't practised it in training. It might not be entirely realistic to rip up your notebook mid-game and demand something utterly different (unless you're Jose Mourinho, or his far more palatable predecessor) but if you can plainly see where the problem lies then you ought to be empowered to do something about it.Instead you can spend a whole season in charge without feeling as though you're making much difference from the sidelines. There are certainly ways to adapt to this, but the way the game's set up is so beholden to the way PES works - and to the way the computer plays - that you feel more like you're fuming in the stands than guiding your team's movements, and with only ten minutes in which to do anything you're often cut short anyway.Which all sounds a bit crap, but really isn't the biggest problem. The critical failing here appears to be a misunderstanding of what football management games are. Surely the best way to simulate football management is to actually simulate football management? PESM is about managing simulated football, and it doesn't work. Its biggest trick is that you can watch the games play out in the Pro Evolution Soccer match engine, but this is not where the game needs to be good. Where things matter - on the training ground, in the boardroom, in front of the blackboard - it's a tiring, repetitive and disappointingly shallow ritual designed to justify a bit of the game that you'd rather control than watch. Rather than testing your managerial mettle, it just says ~get these results~ and expects you to flip switches, watch PES and be happy.Behind the scenes, the signing of players and the management of their prices and salaries is undermined - your scouts, picked at the beginning of a season, vary in their speed and effectiveness, but keep you abreast of who's available and allow you to negotiate where you feel like it, while crap players can be easily transfer-listed and often move with gratifying haste. Which is all well and good, except often just waiting for the end of the January transfer window to come around is the best tactic, as a wealth of ridiculous talent suddenly becomes available on a free transfer in time for the next season.It feels a bit pointless, like the TV interviews and highlights shows peppered throughout the game where generic presenters with dialogue written by five-year-olds exchange meaningless comments about how a certain player is ~good~ and a certain team ~has a great chance~. Having been ~interviewed~ on the pitch and allowed to choose one out of a handful of players to eulogise, a TV presenter will later concur with a colleague by saying that they met with you and you identified ~just that player~ as somebody to watch. You can see the cogs turning into one another, which is more than can be said for the way your management is interpreted on the pitch.Turning PES into a football management game sounds like a good idea - it's often praised for its authenticity, after all. But PES Management's answer seems to be turning the things that mattered on the pitch into menu toggles, and it's not a particularly convincing or stimulating solution. It's like that episode of Mr Bean where he has to transport an armchair home from a furniture shop and decides that the best way to do this is to tie it on top and use a broom handle to push the accelerator and a piece of string to turn the steering wheel. PES5's Master League is a far better football management game without actually being one."}