{"ref": "https://www.eurogamer.net/ss-riseandfall-pc", "date": "20 Jun 2006", "game_name": "Rise & Fall: Civilizations At War", "text": "While Playing Rise and Fall I find myself thinking about the poetry of Shelley, and not just because I'm an irremediable ponce. You see, this is Empire-Earth creators Stainless Steel Games swansong, having closed down before its release. Well before. Several months before its release, meaning it's only a swansong because someone's holding the bird's neck up, moving its jaw up and down and doing a little ventriloquism. Whatever state the game was in when Stainless Steel went down, it was passed over to Midway itself who finished it off.This makes the whole thing bring to mind Shelley's famous Ozymandius, with the image of the last fragment of a statue of an emperor in the shifting, endless sands. Stainless Steel may have thought it was making its lasting testament, but what's left...  yeah, you can tell the review isn't going to end well. For its fair array of positive traits, it has such fundamental flaws which will mean it'll only appeal to the smallest demographic. Possibly including ex-members of Stainless Steel interested in seeing how the game actually turned out.At its core it's a basic ancients-style RTS, a la Age of Empires. Resources are gathered and transformed into troops in your settlements and so on. There's a few tweaks to the dynamic, such as a combat boost being related to the size of the unit and the resource ~Glory~ gained by doing assorted glorious things (e.g. Getting Stuck in, Building big statues saying how ace you are), but there's nothing core which will throw a devotee. Except one thing. The game's Very Special Feature. And it's not a bad Very Special Feature when it just remains a Very Special Feature, but we'll get to that.As you progress, your hero gains a resource called stamina. You can then, at a button press, move into a direct control mode and run around like in Spartan: Total Warrior or Dynasty Warriors, in a mass killing spree. Your attacks will use up the stamina (normal slash a little, special powers a lot), as well as ticking down when you're hammered by your foes. Limited army controls are available here, such as getting everyone to follow you, and you also have ranged attacks, but it's not particularly sophisticated. It doesn't really need to be - it adds something of a climax to a level as your massively powerful avatar leads your forces to victory, and a careful consideration when to apply it adding to multiplayer (i.e. Do you use your stamina now or save it? When will your opponent use theirs?).The problems really occur in the campaign game. Now, the campaign game isn't really going that well anyway. It's got some pretty terrible writing, unlikeable characters (Please, don't get me started on crop-topped Cleopatra) and some really iffy design which doesn't show the mechanics off particularly well. There's a mixture of there being an obvious solution which you then just follow at some times and giving you insufficient guidance at others. But it goes entirely to whack when they go into the Action Missions, when the Special Feature gets ideas above its station, rises up and claims total dominance above all. This really simple action mechanic attempts to become the game.It's just not good enough to support its delusions of grandeur.Let's take one of the levels, where you're thrown into an arena to fight several waves of massed opponents, while under fire from arrow-troopers in towers. You progress from attacking soldiers, to elephants and end up facing a particularly vicious Minotaur. While in the main game you go in, hack and slay until your stamina bar runs out, when you're booted back to the main RTS game, here  - where there is no other RTS mode - the bar running dry means just death. But since there's no block or any way to really dodge anyone who wants to hit you, you perpetually lose stamina in a floaty, aimless, completely unsatisfactory manner. A designer seems to have realised this, so they drop magical amphora which top up the bar. Later, they appear pretty much randomly around the arena, so when you're fighting your only real task is to spin the camera around constantly while trying to locate the next one, and run to it before your stamina runs out. By the time you get to the Minotaur, he's able to run slightly faster than you and when HIS energy is low you get to fight him in close-combat. You hack him. He hacks you. You have no way to stop him hurting you, so it's a competition to see whose energy runs out. To actually win it, you have to keep the camera spinning to see where the next energy-top up appears, and then back up to it while still fighting (as you can't block or outrun him, remember). And since they appear randomly, it could be on the other side of the arena, meaning you'll never make it and so die and have to try again.~What a soul-destroying retrograde brain-hemorrhaging gut-clenching lunatic design decision.That's the particular nadir, but the action levels never reaches any heights. At best, it's a novelty. More generally, it's just a tedious fourth-rate action you'd never want to play in any normal situations. The idea that anyone who makes their way through a handful of RTS-with-splash-of-the-new levels now wants to have several levels of this is utterly bizarre. You see, it's not even just a single level to clear the point and click palette. It's a string of ‘em. Their inclusion essentially renders the campaign modes a complete waste for everyone. Anyone who comes for the RTS will find themselves confused. Anyone who wants action won't get that far into the game, due to the thick strategy-hymen they have to penetrate. And the rare, beautiful multi-genre loving folk won't want to play an eighth-rate Dynasty Warriors clone anyway.But an RTS isn't just the campaign mode and Rise and Fall isn't all bad. After Act of War: Direct Action not bothering to program AI for its ships and the hilarious sight of the mega-budget Battle for Middle Earth 2's vessels twitching spasmodically as they tried to work out how to get onto the beach while the troops stand on the sands, placidly queuing while being slaughtered by anyone who cares to fire an arrow in their direction, Rise and Fall manages oceanic battles better than anyone else. They take a robust approach to the presumably difficult land/sea interface issue by having a specific place where the ship can beach, effectively like placing a building. In this firm position, the troops pile on, and then you can retract onto the waters. It's as easy as this operation should be.But its basic utilitarianism isn't enough - it's actually got a lot of style too. Have sailors on board, and they can throw grappling hooks and pull opposing vessels adjacent to yours. Then the gangplanks lower and your troops pile on, with the winners taking possession of both ships. Get a drummer and it's time to build up to ramming speed and take them apart. In fact, generally speaking, Rise and Fall does the large engines of Ancient-destruction well. For example, walls often have cranes mounted on them which are used to grab hold of incoming siege-implements and crash them against the wall, something which hasn't shown up in games nearly as much as it should. They even use the physics, by having enormous boulders which are propelled down hills to break up formations.In fact, when you start dwelling on the many good bits you start feeling a little reticent of slating Rise and Fall. It doesn't have the sheer polish or design coherence of something like this month's other Rise-TS, Rise of Legends, but there's lots to like. Until you remember the campaign mode again at which point you just find yourself wishing the developers to go bust, until you remember they have and you start feeling bad again. As a skirmish and multiplayer game, I'd give this a six. As a single-player campaign game, it'd score about three. Which means overall, this hastily reanimated remains of an RTS manages to fall somewhere between. It's a possibly interesting curio for someone in the future who'll be wandering the future desert of the budget shelves, only to find a strange package emblazoned with a curious epitaph."}