{"ref": "https://www.eurogamer.net/r-burnout2-ps2", "date": "14 Jun 2006", "game_name": "Burnout 2: Point Of Impact", "text": "Forget everything you            know. Whether you liked Burnout or not, it matters not. The simple            fact of the matter is that its sequel will change your perceptions            of the driving game genre, and the capabilities of the PlayStation            2.                    From the minute you first boot up Burnout 2 it has you smiling. As            you progress through the 'anti GT' Offensive Driving 101 tutorial            (where you learn how best to drive badly…) the smile extends            to a full-on cheesy grin as you realise just how stupendously fast            the game engine is, and by the time you're charging into streams of            head on traffic you're screaming like a cheerleader having her            first orgasm.                    But let's calm down for a minute and actually work out what's            working us up into such an excitable lather. Well, first of all,            every single one of the game's modes is superb. Starting with the            tutorial mode, you're taught step by step how to get to grips with            the beautifully intuitive control system: simply tap X to            accelerate, square to brake or drift, and R1 to boost. Powering up            your Burnout boost bar also couldn't be easier: either drive head            on into oncoming traffic, drift around corners, survive near misses            or grab some phat air. Once you've mastered these fundamentals it's            onto the real deal.        Championship            mode is, inevitably, where you'll head if you want to unlock new            modes, tracks and cars, but right from the off the game makes            initial progression a formality. The early Grand Prixs feel rather            like an extension of the tutorial mode, and coming first against            the three crash prone CPU cars is pretty much a given, but you're            probably having far too much fun admiring the incredible visuals,            nippy frame rate, and sickeningly realistic crashes to care too            much about the lack of challenge at this point.                    The early impressions are clear: Burnout 2 is simply the fastest,            best looking racing game on the PlayStation 2 bar none; this fact            just screams out at you almost immediately. Whereas its predecessor            had a rather bland, flat look about it, Mk.2 shines in every area,            and it's almost unbelievable how far the Renderware engine has come            in such a short space of time. The sheer pace of the game is almost            wince-inducingly fast, and, as a result, when you crash you find            yourself physically ducking out of the way of the terrifying            impact. What results out of these tear ups can end up being truly            incredible, with not only vehicle parts flying off in all            directions in a trail of smoke and sparks, but the resulting chaos            delivered onto nearby vehicles - particularly lorries and buses -            being the most enjoyable example of videogame destruction by a huge            margin.                    Fortunately, you're not punished for crashing like last year's            effort. Not only do you return to the track almost immediately, but            your Burnout meter only takes a small hit, meaning that restoring            it to a powered up state is a relatively manageable task. This            immediately makes the process of catching up much more            straightforward, and therefore you're caning it around the track,            taking insane risks at every turn. It's this motivation to drive            stupidly fast that makes Burnout 2 so irresistible to play - no            game has ever taken the concept of driving fast to such extremes,            and pulled off such a compelling game into the bargain.        Inevitably,            Criterion's pursuit of all out fun and adrenaline has resulted in            some curious compromises of reality. For a start, the handling            ostensibly belongs in the arcade camp. Whichever car you choose            you'll find the car sticks to the road like glue, and powering            around corners borrows liberally from the Ridge Racer school - no            bad thing in our book. It's by no means remotely realistic, but as            a method of making the game for fun and immersive it works a treat.            Similarly, when you charge full pelt into some of the guide arrows,            you mostly end up being guided gently in the right direction,            rather than just wipe out. In addition, if you crash into CPU            crashes, you get to start again just fractionally ahead of the            transgressor - and likewise when you cause similar chaos to your            opponents. Unrealistic, sure, but ultimately it seems that every            attempt has been made to keep the game from ever being annoying.            Some may balk that this lessens the challenge, but that would be            missing the point. After all, there are plenty of opportunities to            crash at every turn - gamers really don't need pedantic discipline            imposed upon them when they're charging along at speeds of 160mph.            Fortunately races are also a mite shorter than the original            Burnout, which was an area many felt Criterion got wrong. The            design just feels as tight as a drum, with every effort made to            keep your attention.                    As with any great racing game, there's an absolute stack of cars,            modes and tracks to unlock, and, again, Criterion has structured it            such that there's always an incentive to keep plugging away. It's            the Championship mode that you'll inevitably head straight for to            unlock the numerous goodies, and faced with a series of Grand            Prixs, Pursuits and Face Offs there are always ways to keep the            interest levels high.                    In the GPs you race against three other AI cars, usually contested            across between two and five laps, depending on the length of the            track. Win the GP on points, and you unlock the next GP series. Win            Golds in every race, and even more is unlocked, including Pursuit            races and Face Offs. Pursuit involves haring after a wanted felon,            ala Need For Speed: Hot Pursuit, with a certain number of hits            required before the time limit runs out. This is a welcome            addition, in that it allows the player to unlock the criminal's            vehicle, while Face Off gives a similar incentive, albeit in a            straightforward one-off race.        The unlocking theme            extends throughout the game, and once your Championship mode is            fully unlocked, a further Custom mode allows you to race in much            more challenging GP races, with rather odd, but welcome additions            becoming available to your car roster.                    But possibly best of all is the stupendous Crash mode. The premise            is simple: drive your car as fast as possible towards moving            traffic - often a crossroads or traffic jam - with the intention of            causing as big a pile up as you can. Time your impact correctly,            and you can set up a spectacular chain reaction of twisted metal as            one vehicle after another smashes into the carnage you've caused.                    Send 18 wheelers flying onto their sides, jack-knifing across the            carriageways and all hell is let loose, and it's all displayed in            superb action-enhancing slow motion, with the helicopter piloted            cameras panning and zooming in to show off the glory that is going            on all around. By the end, your damage is multiplied by the number            of vehicles involved in your crash, and once again your performance            is rewarded by Gold, Silver or Bronze medals - allowing you to            unlock a multitude of progressively insane crash levels.                    But one minor fly in the ointment is the multiplayer mode. While            the game does at least allow four player split screen on a PS2, the            impact on the frame rate and graphical splendour is all too            apparent. Once you're used to charging around in single player            mode, multiplayer feels somewhat muted compared to the anarchy            you've been used to. We're not writing off the mode completely,            because it is enjoyable taken in isolation, but it clearly doesn't            quite live up to the uniform excellence elsewhere. Racing against            mates is obviously superb fun, and provides a much more satisfying            race experience, but when you're playing at what feels like 30 FPS,            rather than 60, it just feels sluggish. Maybe this is an area the            forthcoming Xbox version will address in style.                    So, to sum up, without any hint of an exaggeration, Burnout 2 is            the most compelling arcade driving experience we have ever had the            pleasure of undertaking. It's a visual master class, supremely            playable, addictive, has huge replayability and has a superb            learning curve that will ensure it has a broad appeal to anyone            with even a vague interest in videogames. There really is no excuse            not to buy this - it will restore your faith in the ability of            videogames to generate excitement. Burnout 2 is pure adrenaline.            You owe it to yourself to play this game."}