{"ref": "https://www.eurogamer.net/r-riseoflegends-pc", "date": "14 Jun 2006", "game_name": "Rise of Nations: Rise of Legends", "text": "Thinking about Rise of Legends makes me think that maybe we're just doomed.It precipitates while I'm sitting and trying to work a way into the review, when a friend IMs me, asking if I've played it yet. He's just spent the evening playing it and isn't quite convinced. He thinks that its fiction gets in the way of the mechanics too much. ~Yeah,~ he notes, ~I'm really glad they tried, but I wouldn't recommend this to many people.~ And suddenly I'm really sad.Of course, Big Huge Games' Brian Reynolds has made this mistake before when he lead the design efforts of Sid Meier's Alpha Centauri. Regularly argued as one of the greatest turn-based games of all time, it got dismissed by people unwilling to wrestle with these enormous science-fiction tech-trees. Civ-in-Space it may have been, but it was immediately a less accessible thing just because... well, if you choose to develop the Wheel, you'll have a rough idea what it does. Choosing to research the Proton-proton proton-blob (Proton) IV? Not a chance in hell. Out of here!Similarly in Rise of Legends, where rather than the usual Tolkein Assortment we have three sides each with an array of creatures whose purpose may not be immediately recognisable. Which of the Alim's dragons does what precisely then? It's a hurdle before you can start to tear apart the mechanisms, which drives you away with the game and...Oh, what on earth are we saying? Every bloody review of Rise of Legends has said this. And every review is right. But why on earth are we all so stupid? The three sides in Rise of Legends are the Vinci, the Alim and the Cuotl. The Vinci are a steam-punk retro-technological race, roughly inspired by the doodles of Leonardo Da Vinci. The Alim are a middle-eastern-flavoured magical desert race, riffing tightly off the Arabian Nights. The Cuotl are the Incan-Gods-were-actually-aliens of '70s early pop-conspiracy book Chariot of the Gods. Or, in more modern terms, the bad guys from Stargate, but Incans instead of Egyptians.Oh, come on. These are not complicated ideas. But even ideas which step away from the expectations this little are somehow a little outré for mainstream videogames.So we're doomed. Orcs and WW2 GIs, forever then.Not that Rise of Legends helps its position by its choice of mechanics for each race. Rather than Rise of Nations with its basically similar mass of nations, each of Rise of Legends' races has radically different propositions, performing similar tasks in different ways. For example, take research points. The Vinci gain theirs through building individual buildings, separate from their central cities, each of which can be upgraded into a unique structure (such as a long-distance spyglass). The Alim can expand their cities with Magus districts, which provides points - but it's a choice between a Magus district or other options (Merchant or Military). The Cuotl get research points from similar expanding of their cities, but get research points from any of the districts they stick on. Completely different mechanisms to get your head around, and, perhaps obviously, the technological trees you climb with these points are completely different from race to race. Spin that out across all the parts of the three races, and there's a hell of a lot to learn.So stop being a wimp. Rise of Legends is a maximalist real-time strategy game, offering you a lot to wrestle with. It's worth noting that they don't make it easy for you, while simultaneously making it as easy for you as possible. In other words, they do try their very hardest to teach you all this. Its use of pop-up controls is utterly exemplary, with anything you care to point your mouse at folding out to a description. A button press can expand it further, going into the absolute gritty parts of the simulation for those hardcore with calculators for minds. In fact, generally speaking, its mechanics and design are as solid as you can ask in an RTS. In terms of all the classical RTS which I've reviewed since starting to write for Eurogamer, this is the one which feels the most solid, the most right.The Campaign mode is arguably the heart of the single-player experience. It's a continuing attempt to mix the freeform board-game style of play of something like the Total War games with the traditional story-heavy narrative mission. To this end, each of the three campaigns (Two Alims and a Vinci. You'd have thought they'd have done one for each of the three races, wouldn't you? Yes, you would, and so they did. Just trying to create a little tension) takes place on a simple strategy map, with clearly marked objectives. For example, on the first you're trying to defeat the Doge. His fortress is on the far side of the map, but a couple of regions at either corner would be useful to take out first. Each region between is a level, with multiple pathways possible with each region giving different bonuses and different sorts of missions. Do you go for the easy mission or the harder one with a better reward? These also lead to reward points which can be used to upgrade individual regions' defences (as opposing generals wander the map looking to reclaim what you've conquered) or economic abilities. It's stripped down, but pleasant enough to structure the individual missions. It even provides more of a sense of an interconnected world where the game's events are happening, so the marriage of narrative and interaction is at least partially successful.The problem being is that it's only partially successful. Despite allowing multiple routes, especially on the opening missions you'll realise you're being herded into completing multiple easy regions to build up your forces before approaching the harder regions. It's more of a device to let you choose which of the game's levels to play next than a proper strategy game in and of itself. On the narrative side its flawed by i) the narrative not being particularly compelling anyway and ii) the narrative events contradicting the freeform elements. For example, in the opening campaign I finally make the way to the Doge's fortress, where I get the cut-scene of the man preparing for the assault and us all worrying about his cheerful ultra-cannon. Great! Except that I can see on the strategy map that the Doge's army is actually two regions south besieging one of my settlements. It's aspects like this which keep Rise of Legends away from the nine it occasionally flirted - it's so generally professional the bits where it goes awry are terribly obvious.The skirmish and multiplayer (via Gamespy, which is having some teething issues, as-per-bloody-usual) are perhaps a more convincing proof of the game's strength. Rise of Legends is nothing if not a game about its design, and the basic competition between two minds (or the simulation thereof) shows the game at its best. It leans towards the faster end of the RTS, with turtling an impossibility and attacks often from the very opening of the game (unless early attacks has been turned off). To grow in power it's essential to go out there and start converting the non-player settlements to your charge and so on. With an unparalleled possible use of shortcuts, to be genuinely competitive online Rise of Legends will probably lean towards the piano-player abilities - but it's interesting virtuoso piano-playing rather than just being about the basic ability to build an identical settlement as quickly as possible so you can churn out the units. It's about mastering any tool you can to win this bloody war. It's about having too much at any time to do, and choosing what needs your attention most. Rise of Nations, but more so - perhaps too much more so for some people.Christ. I'm aware that I'm not selling this as well as I could, and everything I say seems to be undercutting Rise of Legends appeal. I need to stress that even when it abstractly fails - like the campaign mode - it falls comfortably above the vast majority of its peers. When it excels it excels in the same way as an aged whiskey or a finely made leather sofa does: it exudes quality and craftsmanship. Rise of Legends is an extremely-good-to-great game. Give it time and you'll love it.Or put it this way. Contrary to my online friend, I'd recommend this to people."}