{"ref": "https://www.eurogamer.net/r-finalfantasyiv-gba", "date": "9 Jun 2006", "game_name": "Final Fantasy IV", "text": "Every good fairytale starts with heartless cruelty - a small child orphaned, a princess sent into the woods to be killed - and the Final Fantasy games follow much the same formula. But in the case of Final Fantasy IV Advance, the twist of the knife is even more brutal.Starting out as the Dark Knight Cecil, you're sent by your King to forcibly take a magical water crystal from a nearby town. When, on your return, you question his increasingly violent tactics, you're stripped of the command of your prized Red Wing airship squadron and ordered on a mundane mission to deliver a ring to the village of Mist.But you've been double-crossed. It's actually a bomb, and the resulting inferno kills all but one of the town's inhabitants. Turning over a new leaf in Mist, you hook up with that sole survivor, a young summoner called Rydia, and set out on your adventure. At rock bottom, your quest for redemption has begun.Be warned, it's going take plenty of time and skill to get there. Final Fantasy IV Advance only offers up its charms over many hours of play, and you'll be doing well to complete it within 30.You'll encounter many more companions though as you travel through this long, thoroughly engrossing tale, which packs plenty of twists and turns. From friends-turned-enemies to brave bards and precocious, mischievous novice wizard twins, they all have an important role to play. As well as being important for the story progression, each character also brings special attributes to the battles you'll face. For, as you travel through underground tunnels, mountain passes, deserts and forests, you'll constantly trigger random battles.Every region has its own selection of monsters and foes that Cecil, together with the companions in his group at the time, must overcome. With a battle started, each character takes it in turns to make their moves, with the order sorted by an individual's attack speed. The specific choice of the attack - some characters are best at physical assault, while others in your team will be most effective either with offensive spells or defensive magic - is down to you.The battle continues like this until one side is defeated. Victory increases your experience points and accumulated money, with the cash (called gils) being accepted in any towns you enter in return for better armour, weapons and other items.And it's this combination of the freedom and skill you'll need in choosing battle tactics (do you scan the enemy first, for instance, to find out their weaknesses, even if it means not attacking them for a turn?), combined with the slowly unfolding plot, which will keep you wanting and playing more.Of course, if you prefer fast moving action games, Final Fantasy IV Advance, with its simple-yet-cute graphics, often annoyingly random encounters and sometimes confusing geographical hints - you can easily get lost trying to figure out where to go next - probably isn't for you.But for everybody else, even those who may have played it before on the SNES or PlayStation (this version has upgraded graphics, better translation and some new unlockable features), there's a depth of enjoyment to Final Fantasy IV Advance - even pathos - that few other games can match. Get it and it will stay in your GBA or DS for weeks, if not months."}