{"ref": "https://www.eurogamer.net/r-2006worldcupquiz", "date": "8 Jun 2006", "game_name": "Reviews", "text": "The festival of ultimate shame and disappointment that is the FIFA World Cup gets underway this week, sending even the most sober football fan on a delirious month-long booze-fuelled crusade to support a bunch of overpaid and overrated multi-millionaires in the vain hope that some of them might, one day, live up to their star billing. And that's just the Ivory Coast fans. They've got Drogba to sweat over, for gawd's sake.The English? Let's not even go there. Oh alright, then. Doubting our chances of ending 40 years of ~hurt~ isn't some pathological pessimism, nor are we bitter or anything. The English aren't happy unless they've got something to moan about; the Aussies don't call us whingeing Poms for nothing, and boy, can we grumble. The real sport of the World Cup is inventing previously unheard derision to throw at the team/ref/Sven/the commentary team, and it's one the English win hands down. Imagine the national mourning if England won the bloody thing? There'd be nothing to bitch about for a whole day! An entire society in ruins.Moaning sods that we are, that makes us the ideal candidates to look at Circle Studio's latest attempt to inject some life into the curious world of interactive DVDs, those anomalies that most right-thinking gamers wouldn't be seen dead buying. Seeing as they're not classed as games as such (and are therefore rubbish), we tend to ignore such things but the installed base of DVD is beyond vast. Work out how many people can play DVDs and you can see why Circle is keener to tap into this market than pour millions into making games like Without Warning that have no guaranteed return. Post-videogaming cop-out or canny business decision? We've no idea, but lovely people that they are, they sent us a copy of its newly released World Cup quiz and wanted to know what we thought, so here goes.Billed as ~a true test for true fans~, and ~the ultimate FIFA World Cup trivia challenge~ (neither true) the package is nevertheless slick, easy to use and has just about enough questions (~over 1000~) to last for a good few hours of quizzical action for anyone with a DVD player. Playable solo or with a pal, there are ten teams (including England, France, Italy, Mexico, etc) and three modes to choose from: Tournament, Finals and Penalty Shoot-out. Tournament is effectively just an extended version of the Finals mode and takes place on a virtual pitch, where a simple isometric view of the proceedings gives you a semblance of control over the 'match'.With a toss of a coin deciding who goes first, you have several players who you can 'pass' to, with the relative length of the pass dictating whether you're asked an easy, medium or hard question. Pass to a player just one 'zone' away and you get an easy one, pass long to a man three zones away then it'll be a distinctly tougher proposition.The game then switches to the questions screen, showing either a static image or running a short clip of action and asking a multiple choice question, with three choices available. Following the classic Question of Sport-style formula, you get tested on things like 'what happened next?' - was the shot a goal, a miss or saved? Was the tackle a red card, yellow card or no card? Did the team break away and score, get fouled or perform naked gymnastics. That sort of thing.Sometimes you get asked all sorts of random observational stuff, like 'what was the colour of the goal scoring team's socks?' and what year did this match take place in, and things that you're not necessarily watching out for. Needless to say, there aren't all that many video clips, so you quite quickly find the same action shots being repeated, but perhaps with different questions. If we see that Emmanuel Petit sliding tackle once more we'll scream. Strangely, the source clips aren't especially good quality, either - with even relatively recent World Cup clips from USA '94 looking like they've been captured from VHS. It's not a massive big deal, but it does make you wonder what state FIFA's broadcast archives are in if this is officially licensed.Elsewhere, the reliance on static images doesn't stop the repetition, with the same 'spot the ball' and 'guess the player' photos appearing alarmingly quickly - even during the same game, which says a lot. Playing with a pal is likely to result in both parties quickly learning the answers by this process, which completely defeats the object of testing people's trivia knowledge.This is a shame, because the actual structure of the quiz is pretty good. The idea is to basically pass your way up the pitch by giving the correct answer - fail and possession goes to your opponent. After a string of successful passes, you'll eventually be in a position to take a shot on goal. Initially, when you take possession you may not be in range, so will have to either try the tricky long ball approach and go for some tough questions, or take a more patient short passing approach and answer more - but easier - questions in order to carve out an opportunity. And just like the passing, taking shots on goal from further out is also harder - and easier for your opponent to 'save'. If you really want to stop an opponent taking a shot, each player has one red card they can use as a sort of professional foul to claim possession back. Meanwhile, up to two yellow cards can be used to scrub out one of the incorrect answers during the quiz phase, while up to three 'substitutions' can be used to swap out questions you don't know the answer to.Every successful shot you take (against a human opponent) results in an opportunity for them to save it by answering a question themselves. If they succeed, the shot's 'saved', or else it's a goal and possession switches over. After a set number of questions, there's a brief half-time break and so it goes on until you've finished the game. In 'Finals' mode you'll play just one game, while Tournament kicks off at quarter final stage and tasks you with battling through a further two games to claim the trophy.Elsewhere, the quickfire Penalty Kick mode is essentially a stripped down quickfire round where two players get to take it in turns to answer questions, with sudden death kicking in if both 'teams' are level after the mandatory five attempts. Simple, effective, fun but ultimately very limited in long-term appeal.With the Most Annoying Man in the World Ever Jonathan Pearce doing the voiceover (hey, at least it's not David ~Run is timing out!~ Pleat), there's only so long you can put up with hearing the same stock phrases before you want to stuff a Mars bar down his excitable gob. But you'd probably put up with that if Circle could pack in more questions and truly capitalise on the subject matter.As things stand, this is a decent example of how to present an interactive DVD. As a quiz it's well put together from a presentation angle, and is intuitive and well thought out. Just like the box says, you 'just pick up and play'. No arguments there, but the constant repetition quickly gets on your nerves when you see the same question appear for the third time in the space of 20 minutes. Next time, Circle, please make something that'll last longer than a four-pack of beer - just because it's for the mass market doesn't mean it has to be short on content."}