{"ref": "https://www.eurogamer.net/ir-atelieriris2-ps2", "date": "7 Jun 2006", "game_name": "Atelier Iris 2: The Azoth of Destiny", "text": "It's rare for a videogame sequel to really screw up. We're used to secondary-suffixed movies being dull, trite or rubbish having lost narrative momentum, integrity, directorial vision or a big-name star somewhere in-between the first's poignant ending credits and the second's dollar-hungry whored conception. But videogames are usually a little different in that, to be a success (providing the first was), gameplay need only be gently tweaked and streamlined and a few simple new features introduced to meet with player expectations. Unlike film, it's not even necessary for the videogame sequel's narrative to synchronise in any way with the first title's - Final fantasy's cyclical and ever-successful reinvention of the characterisation wheel proving that players perhaps find primary comfort from familiar videogame mechanisms more than familiar videogame faces. So when a game like Atelier Iris awkwardly trips and breaks its nose at the second hurdle (at least, second in the West) you have to wonder how exactly things went so wrong.For those that missed it, the first Atelier Iris delighted with eccentric humour, brilliantly coloured characters, gotta cook 'em all recipe gathering and gameplay that occasionally poked its head over the parapet of RPG cliché. The internal market economy (you contributed new concoctions to your favourite restaurants and shops to boost their sales and popularity) turned the traditional smash and grab approach to RPG item consumerism on its head, giving us opportunity to put back into a virtual world that which we are so attuned to just taking. And despite the Japanophile's dream presentation and execution - the kind of universe all pale-faced, anime-guzzling, black and white kanji emblazoned headband-wearing teenage karate students dream in - the appeal ran deep and wide to the marriage of Nippon Ichi's usual sparkling localisation work and Gust's original, solid, universally-appealing storytelling.And, to some degree, all of these same good and true features characterise Atelier Iris 2 as well. Set years prior to the first game, the player is presented this time with two orphan children to guide through the twisting story. Felt and Viese are two apprentice alchemists (the word Japanese unwaveringly continue to describe chemists - there is no pursuit of test-tube precious metals for these children) living in Eden, a land torn apart by an Earthquake at the start of the game. This disaster promptly sends Felt off into a parallel dimension, Belkhyde, wherein apparently lies the key to Eden's survival and redemption. Viese, in unfashionable gender pigeonholing remains at home in Eden in order to put her 'alchemy' skills to use in the kitchen making items for Felt to use on his journey. Control switches between both characters and their respective dimensions as items are swapped via a share ring, usefully allowing both of the heroes access to the inventory.Ever since Chrono Cross we've been wary of games that try the dual dimension thing. In Square-Enix's delicious and seminal Chrono Trigger, the player had to time travel a la Back to the Future and, in doing so, found that actions, feuds and reconciliations made in history directly affected what happened in the future. The delight came from playing an RPG in multiple time periods and experiencing direct chronological change as a result of their experimental play.  For that game's far less successful sequel, Chrono Cross, the core idea moved from time travel to a dual dimension mechanic where things played out in one dimension kind of affected things in the other dimension in an awkward and not entirely coherent manner. Atelier Iris 2 uses this exact same idea and it's no less shakily realised here than it was then. Problematically, by basing any game on this mechanic developers seemingly cannot help but turn vast swathes of their game into complex but ultimately tiresome and dull fetch-quests: find one item over there and bring it over here then vice versa ad nauseam. Atelier Iris 2 is, disastrously, no exception.Principally you control Felt and his growing band of adventurers until you encounter an obstacle that requires a key item to overcome. At this point you'll need to switch to Viese, seek out the recipe for the key item and, more often than not, engage her in a quest to gather all the ingredients needed to complete said recipe. This usually simply requires finding the appropriate shops that supply what you need - hardly the most driving quest mechanic. If the shops are out of stock you'll have to seek out the appropriately furnished villager in whichever town who'll usually send you off on his own personal errand to fetch something he needs before giving up the item you need to make the item you need. And so the onion layers of inventory management build up to a tedious whole. The slower pace of story doesn't help here as each quest usually reaps meagre rewards inching the narrative on from one hunting gathering cycle to the next. Congratulations: you've become an errand boy for a videogame.All of which is a great shame as, elsewhere, the game continues its predecessor's successes with imagination. The characters are ever likeable and the US voice acting so over the top that it goes full circle and becomes passably enjoyable. Likewise, the dialogue and storytelling is unusually natural and fun and, while some folk seem to think the graphics are dull and unimaginative, the sprites, character portraits and environments are all beautifully detailed and full of character. Philistines.The battle system has also been tweaked from the first game - a gauge on the left side of the screen cycles from blue to red now to monitor the chance of an enemy encounter. After a set number of fights are won in an area the player can then explore freely without danger of random battling (although this can be reset by leaving and re-entering the dungeon for level grinders). Internally, battles function similarly to the first game, with the Active Cost Time system attempting to cloak in terminology what is still essentially just a turn-based core. Break attacks will interrupt your enemies charging and knock them back down the play order. This feature in particular is peculiarly weighted in the player's favour and causes fights to be easier than in the average JRPG but, thanks to the long health bars, sadly no less drawn out.Some curious dumbing down and omitting of secondary gameplay features from the first game round off the update. In particular, item synthesis is now a lot more base in execution and the raising of your companion Mana helpers removed wholesale: strange decisions seemingly with the intention of taking the game closer to mainstream RPG mechanics. But in doing so Gust has missed the point of what made the first game so much fun for those that approached with an open mind. It was the smaller cogs and wheels of gameplay in the first game that made the whole experience so easy to enjoy. In The Azoth of Destiny, these smaller cogs have been removed in favour of a more cumbersome larger gimmick and, as a result, grinding the sequel through its revolutions is tiresome and often unrewarding work."}