{"ref": "https://www.eurogamer.net/r-hl2ep1-pc", "date": "5 Jun 2006", "game_name": "Half-Life 2: Episode 1", "text": "When is a sequel not a sequel? When it's Half-Life 2: Episode One, the confusingly titled first new episode in a trilogy of releases that picks up the story where HL2 left off. So it's part two of Half-Life 2, but episode one of three of the second half of the story? Something like that. Even Valve boss Gabe Newell seems exasperated with trying to justify it. ~We should have just called it Half-Life 3: Episode One, but it's a bit late now,~ he chuckles. Actually, Aftermath worked pretty well...Daft naming conventions aside, Episode One very much belongs to the original Half-Life 2 in every sense. Just as the box says, this is ~the first new episode for Half-Life 2,~ and the game's millions of fans will be more than happy with the opportunity to wield the gravity gun again, duff up the Combine forces and hang out with Alyx. Who wouldn't?But once you play through Episode One it's hardly surprising Valve tied itself up in knots when deciding on a title. The fact that it's the first part of a coherent story-driven trilogy elevates it above expansion pack cash-in fodder, but at the same time it's perhaps too closely associated with its 'parent' game to be thought of as a bona fide sequel. In a sense we're very much in GTA III/Vice City/San Andreas territory: you know exactly what to expect, but love it precisely because it's more of the same.Actually, as cosily familiar as you'll be with most of what Episode One has to offer, new additions and a shift in emphasis make it a refined, fat free Half-Life adventure that's rarely less than brilliant.In terms of what's new, Valve has rejected the notion of going for obvious, traditional 'expansion' elements like new weapons, enemies and locations. Like a game that's been on pause for 18 months, you shouldn't expect to return and be surprised to find the arsenal has changed, or that suddenly all the enemies have been replaced and you're in a new place. You're not. This is the ruined metallic starkness of the Citadel, the shattered remains of City 17 and the grandiose, unloved architecture within it. However bleak it looked before, the desire to get as far away from this stifling austerity as possible is palpable throughout - and for the most part you'll be duking it out with the same enemies you faced last time.The tweaks and changes might not be headline-grabbing 'back of the box' material, but nevertheless play a significant part in making Episode One an important evolution in the series. Most obviously, Alyx plays a far greater role this time around, accompanying Gordon for approximately three-quarters of the game and behaving intelligently throughout. Rather than merely use her as a narrative device and leave the player to go it alone, in Valve's words, Episode One explores ~single-player co-op~ by ensuring Alyx always dynamically responds to Gordon's situation. In simple terms, if you need combat support, she'll move to a decent position and take accurate aim at oncoming aggressors, and may even take the lead when you're struggling.Without light, though, Alyx is hugely vulnerable so she relies entirely on you shining your flashlight on the targets to be able to take out enemies and warn you of imminent danger. During the excellent Lowlife chapter, Alyx is reduced to a panicking wreck when the light starts flickering and your batteries run out, leaving Gordon as her only defence against the marauding hordes. One good turn deserves another, though, as not only is she a damned good shot, but she's constantly alerting you to unexpected enemy arrivals whenever they appear.As dynamic as Episode One is for much of the time, now and then her scripted actions take precedent and she'll unilaterally scale obstacles allegedly beyond your capabilities and take up a sniper/emplacement position, or hang back while you go crawling through a vent. For the most part, though, it's a system that works far better than it ever used to, and bodes well for future episodes.Given that Episode One will only clock in at around five hours on most people's first run-through (and - it's fair to assume - even less on any repeat play) you might assume that there's not much to it - but you'd be wrong. Set across five contrasting chapters it's a wonderfully balanced affair that rarely dwells on one element too long. The focus on action and combat is sensibly weighted, there are no vehicle sections at all, no time-wasting exploration required and a more satisfyingly logical approach to puzzles. All round, the gameplay feels tighter and more refined. It's evident Valve has listened carefully to the feedback from last time around and really worked hard on polishing Episode One as much as possible."}