{"ref": "https://www.eurogamer.net/r-socom3-ps2", "date": "5 Jun 2006", "game_name": "SOCOM 3: U.S. Navy SEALs", "text": "Your orders are in from command. ~Use the TCA to have BRAVO mount the SOC-R near NAV point KILO.~Righto. Last time I mounted a SOC-R I had to hide it under the bed so me Mam didn't see the stains. And is NAV point KILO down the jitty and past the off licence?Ho, ho, ho. Isn't war a laugh? I don't know what those bleeding hearts fret about. War's great for the economy and it has a marvellous entertainment value. Who doesn't love watching those military videos of schoolyards being levelled to the ground? They shouldn't hide WMOs under the climbing frames if they don't want them blowing up.All of which gung-ho bollocks brings us to the black and white world of war that is SOCOM 3: U.S. Navy SEALs. A world where upper and lower case letters jostle to appear IMPORTANT, anything that kills is abbreviated and you can tell who the bad guys are because they speak funny. Let's not touch on politics in videogames though, it's too uncomfortable. This is only entertainment. The cutscene with the coalition envoy being executed in front of a jeering crowd is for your pleasure. It's realism see, these guys are really bad.With patience, you can persuade the PS2 to 'do' online games almost as well as the Xbox. There's not as many of them, granted, but it can do them all the same. However, the ability of a console to provide good online play isn't an achievement anymore - it's just a standard feature of the game. So, where does that leave SOCOM? It's a series that has always pushed PS2 online, and it's now finally got to a stage where it can hold its head up high and be proud of 32 players online, a host of vehicles, biggish maps, super-duper weapons (or as one American gamer described them to me, ~kick-ass guns, yo~) and a fairly varied set of modes. Well done SOCOM, well done Sony, well done Zipper Interactive. But don't big up your chest too much, you'll become a target for those Ghost Recon, Rainbow Six and Battlefield geezers. Thirty two players online is the big addition to SOCOM 3. That's twice as many people to kill. Throw in a big fat wad of vehicles - Humvees, jeeps, boats, basically anything on wheels with the space to strap on some big-assed weapons - and the online game becomes a terrorist versus military showdown. Brutal fire fights, trash-talking macho boasts, clumsy vehicular death and strategic tactics mingle quite happily until one side is sprawled across the battlefield with smoking chest wounds. Online modes are fairly standard, with Demolition and Suppression proving as popular as ever, but if you can find gamers trying out the new Convoy mode where one team must transport goods across the map without getting ambushed, it's well worth convincing others to give it a go. You really need to be online with people you know or trust to get the best from SOCOM 3, because - as with so many online games - there's are a shocking amount of trashtalking knob-heads playing this game. And while I don't mind Randy from Wisconsin expressing his opinions regarding my sexuality, he really doesn't need to tell me the same thing every time I teach him a lesson with one of the 30 cutting edge weapons on offer. One more time Randy, and I'll find the airfare to come and take your scalp.War is fun, but it's also rough, which may go some way to explain how SOCOM 3 looks so rough around the edges (Hah-hah!). She ain't pretty, no sir. Character models are ugly, with jagged features and chunky limbs. Environmental textures are flat, with buildings looking similar and plain. Icons, on-screen commands, maps and the overall presentation is functional, but not exactly visually appealing. There's a certain amount of missing animation too, particularly when you command your boys to mount or dismount vehicles. Bam, they just appear on foot, as do you. It's obviously a sacrifice to keep the action rolling - no one's gagging to watch a fat bloke in fatigues get his leg over a steel door after all - but it highlights a lack of finesse on the developers' part. The maps in SOCOM 3, for both single and multiplayer, have been expanded, as you'd expect with the inclusion of vehicles. But during single player in particular this is just a poor illusion. Drive too far away from your next goal and you'll be issued a warning that leaving the area will result in mission failure. Call me old fashioned, but I thought soldiers were encouraged to outflank enemies. You're not completely hedged in, and there are opportunities to use side-alleys, roof tops, craters and cover to your advantage, but it's not as wide-open as you're led to believe. Maybe it's a hangover from playing Battlefield 2: Modern Combat, but it feels like there's a choice of different paths, not the entire radius of a map, with which to approach the enemy.The single player campaign has been beefed up from previous SOCOM titles to make it more of an actual game rather than a series of objectives strung together. Enemy and team-mate AI isn't as alert as it should be, with some enemies not taking the hint that when you unleash a couple of shots in their direction it's in their interest to return fire or take cover. Your boys can occasionally get confused too, but it's not like they're wearing earmuffs and you're talking with a lisp. On the whole, the single player campaign is as accomplished as a Conflict: Desert Storm title, which may be all you need to know if you're not online but considering buying the game.There a collection of well-thought out touches that crop up during play, proving Zipper hasn't just been working on improving the technical aspects of the game for the past two years. The ability to swap seats in a vehicle means you can switch between gunner, driver and even bigger gunner instantaneously, helping to keep the action at the forefront. Flash-bang grenades encourage insurgents to surrender, as does out-numbering them, so if you're feeling particularly lenient, you can cuff 'em and feel less of a sanctioned murderer. Swimming also plays a part in the gameplay with players using able to slink through water to approach enemies quietly, submerging themselves and popping up in their vicinity for a silent takedown. Stealth is an option, but unless you're charged with capturing an enemy alive, you're best off making the most of the awesome firepower on offer. And hollering your victory across the map. SOCOM seems to be all about big boys making big noises. SOCOM 3 is a decent enough game but it's nothing special, much like previous entries in the series. There are better online and single player squad games on the market, which makes SOCOM an alternative, but never essential. The addition of vehicles and more players manages to give the gameplay a much needed boot up the keishter, and if you like your games just the right side of average, go ahead and justify your purchase. So the PS2 can hold its own with online games? Big deal. If SOCOM is to remain Sony's flagship online war title, it needs a complete overhaul in time for its PS3 outing."}