{"ref": "https://www.eurogamer.net/r-takecommand-pc", "date": "28 May 2006", "game_name": "Take Command: 2nd Manassas", "text": "Going on the evidence of recent RTS hits like Age of Empires III and Battle for Middle-Earth II, to get a job as an AI general in a modern strategy game, all you need to do is demonstrate that you know how to recruit a few different types of troops from your barracks, have them wait around until a decent-sized mob forms, then send them off in the general direction of the enemy. Subtle tactics like flanking, feints, and encirclements? Forget it - developers seem far more interested in balancing their forces for multiplay or crafting lavish stories for their campaigns than they do in creating cunning artificial opponents.Awash, as we are, with these bland, obvious AIs, Take Command: 2nd Manassas really stands-out. A real-time wargame based around three American Civil War battles that took place in the late summer of 1862 in North Virginia, it comes with some of the smartest and most believable computer-controlled adversaries ever to grace a digital battlefield. Not only are the included commanders well-versed in historical tactics like flanking and skirmishing, they also come with the temperaments and skill-sets of their real-life inspirations. On an average TC2M battlefield you'll encounter hotheads that will hurl their troops at you at the slightest provocation, cautious souls that will sit tight or withdraw if they don't like the odds, beloved figureheads that inspire improbable courage amongst their men, West Point drop-outs that might as well have stayed at home... basically every type of leader you could imagine.This mix of command styles makes for unpredictable foes. Interestingly, it also makes for unpredictable friends. The units you control in a TC2M battle are unusual in that they have minds and agendas of their own. Let's say you are playing as a Major General with half a dozen infantry brigades at your beck-and-call. You might send one of these brigades onto a nearby hilltop to rout an enemy cannon battery, and turn round later to find it hopelessly cut-off miles behind enemy lines, the reckless Colonel in command having taken-it upon himself to push-on in spite of orders. At first, disobedience like this can be very annoying and it's tempting to micromanage everything with the help of the 'Take Command' button (a feature that ensures units don't freelance) Eventually - if you are anything like this reviewer - you learn to accept the character-linked wilfulness of subordinates, realising that period figures like Lee and Sherman had to cope with exactly these kind of issues.TC2M is so eager to put you in the boots of the great Civil War commanders that it's prepared to make things hard for the player in other ways too. Select one of your subordinate officers and give them an order, and that officer wont just drop everything and start implementing his new instructions. No, the order must first travel from you (your avatar) to him via a galloping courier. Usually the message arrives within a few minutes, but a lot can happen in those minutes. The courier might get ambushed en-route forcing you to send another rider, the combat situation that prompted the order might alter. Again Mad Minute Games' fresh approach to battle simulation forces you to confront issues that real war leaders routinely faced. Perhaps the most disconcerting piece of realism in the game is the way the camera is tethered to your avatar in some scenarios. Instead of being able to hover above any spot on the battlefield and observe any fight, sometimes you have to gallop your personal unit closer to an engagement before you can watch the action properly. After years of complete camera freedom, this restriction is strange and thought-provoking. The logical extension - a first-person wargame - actually starts to seem like quite an exciting concept.  Unfortunately, for every intentional annoyance in the game there's one that's a side-effect of the less-than-brilliant interface. Fans of traditional RTS titles are going to find the lack of minimap and 'hero' tabs frustrating. Switching to a separate map screen to get a battle overview, and using cursor keys to locate individual officers, is hardly elegant. The same could be said of the movement system, a convoluted button-reliant process that makes things like changing unit facing far more complicated than it need be.Another minor grievance stems from the different control states units can find themselves in. Particular units can be removed from the AI loop with use of the 'Take Command' function mentioned earlier. They can also be 'detached' - a milder form of TC. If you're not careful, by the end of a battle, you can wind-up with an army partially under direct control (TC), partially detached, and partially in its natural semi-independent state. When things get like this, it would be immensely helpful to have some form of toggleable visual cues to help manage the mess.Top of the list of other shortcomings Mad Minute Games will hopefully address in future patches or games, has to be the omission of multiplayer. Thanks to a well-equipped random skirmish generator, a plump scenario selection, and that unpredictable AI, the deficiency isn't as significant as it might be, but still it's disappointing not to be able trade canister shells and musket balls with live foes.Those oblivious to the parallel universe that is computer wargaming might also be taken aback by TC2M's relatively primitive visuals. MMG's artists have done wonders with the simple tools available to them, but arriving direct from games like Rome: Total War and AoE3, you do notice the absence of polygons, fancy lighting and particle effects. The only truly 3D objects on these battlefields are houses and bridges, the only shadows crude non-dynamic ones.Fortunately, unlike many contemporary strategy games, TC2M doesn't rely on its looks to compensate for shallow formulaic gameplay. This is a fresh-feeling game, full of drama, atmosphere and surprises. If you like your tactics titles realistic and don't mind having your Manassas whipped by a bayonet-sharp AI now and again, it's likely to be the best £20 you spend this year."}