{"ref": "https://www.eurogamer.net/r-hoi2doomsday-pc", "date": "27 May 2006", "game_name": "Hearts of Iron II Doomsday", "text": "Can I ask a favour? Before we get started could everyone that's reading this sort themselves into one of three groups? Over there by the bust of Winston Churchill, I'd like those of you that are already familiar with this games predecessor, Hearts of Iron II. Beside that bust of Mussolini, I'd like the people that have never played a Paradox game before but have dabbled with middleweight strategy greats like Civilization 4 and Rome: Total War. Lastly, next to the bust of George W. Bush I'd like to see the novices - those gamers whose strategy experience is limited to base-building RTS like Warcraft 3 or Age of Empires 3.Right, everyone in the Bush group leave now. Go. Seriously, there is nothing for you here but hurt, hurt, and more hurt. HoI2: Doomsday is complicated in the same way that a jumbo-jet's wiring or Norway's coastline is complicated. Unless you're unusually studious and incredibly patient, you'd be far better-off losing your World War 2 grand-strategy cherry to a title like the recently updated Gary Grigsby's World at War or the old-but-gold Strategic Command.Even some of you Mussolinis are going to find Doomsday's awesome scope and boggling detail hard to bear. The game doesn't just put you in the sweaty footwear of men like Herr Hitler and Comrade Stalin, it also jams you into the moist brogues and boots of their ministers and generals. Warfare, economics, diplomacy, research, politics, trade... developers Paradox pack everything in except the turn structure that might have helped dazed newcomers get acclimatised (the years pass in 'adjustable continuous time'). Included scenarios are a mix of economy-free 'battles' inspired by different WW2 operations like the Ardennes Offensive, and giant global scenarios that often take days to complete. This mission selection looks quite slim until you realise that each of the global scenarios can be played from the perspective of any one of the World's nations. Conquering Forties Europe as the mighty Russian bear is a completely different ball game to conquering it as the moth-eaten Ethiopian lion or the feeble Venezuelan... umm... armadillo?A big part of the game's unique charm comes from the way it permits improbable invasions like these, yet also maintains - most of the time at least - a veneer of historicism. Thanks to an intricate system of triggered historical events, cleverly authored starting conditions, and fair-under-the-circumstances AI, you do get a flavour of what it was like to be, say, at the helm of beleaguered Britain at the start of 1940, or leading the startled Soviet Union in the summer of '41. GGWaW sticks to the history a little more rigidly but it doesn't offer half the play freedoms.OK, now I'm going to be talking to the Churchill group for a few paragraphs so Mussolinis please chat quietly amongst yourselves or take advantage of the tea and coffee-making facilities located over there by the life-size matchstick model of the Enola Gay. You veterans obviously don't have to be told how unique or absorbing HoI2 is, but you might be interested to hear one man's take on the improvements in this standalone expansion. Compared to the progress between HoI2 and HoI, the changes between Doomsday and HoI2 are pretty insignificant. Besides some added espionage features and a new grand campaign that extends the timeline into the dark era of the Berlin Wall and Cliff Richard, there really is very little novelty here except patch-like nips and tucks. My pick of these tweaks would have to be the revamped AI (less fidgety, more adept especially when entrusted with Axis powers) and the improved automation options (less need for constant slider tampering). The least likeable alteration? That would be either the new experience system or expeditionary force code.The dev has taken a machete to HoI2's commander experience approach instead of the scalpel that was needed. In Doomsday only the biggest cheese in a combat stack earns experience meaning it's much harder to nurture your own crop of Pattons and Rommels. Similar hamfistedness shows in the way allies now fling their forces at you like born-again pacifists. Managing these unsolicited and often unwanted military gifts is almost as irritating as keeping track of the new intelligence networks. Paradox's implementation of one of the Cold Wars most distinctive activities - spying - turns out to be about as unimaginative and fiddly as it could possibly be. To create and operate a spy ring in a foreign land you must first purchase individual agents then trigger individual actions like blueprint thefts, industrial sabotage and minister hits. Trying to do all this in multiple countries is a spectacular pain in the backside - the last thing you need in a game that is already so labour-intensive. For the scant rewards on offer, it's tempting to forget about covert ops completely.Because Doomsday adds little of genuine substance, you'd think the developer would have had ample time to polish what content there was to a dazzling unpainted-Mustang shine. In fact there's an all-too-familiar array of bugs in residence. At the time of writing, the game has already received one patch, and still has issues with AI airforces that don't know when to quit, an auto-convoy system that sometimes lets far-flung outposts starve to death, and a faulty 'Bitter Peace' trigger. Going on Paradox's past record, all of these problems will get sorted-out eventually. Until this happens you can at least reduce the frustrations with some relatively simple text file edits.Verdict for Churchills? If you already own HoI2 then think long and hard before coughing-up for Doomsday's jumble of minor enhancements and questionable alterations. Mussolinis can purchase with more confidence. Viewed simply as a dirt-cheap re-issue of an incomparably rich grand-strategy classic, this is quite an attractive package. Bushes? How many times do I have to tell you? Clear off before I release the Alsatians; consider returning in a year's time when you're done wallowing in the wonders of Civ4 and R:TW."}