{"ref": "https://www.eurogamer.net/r-echonight-ps2", "date": "2 May 2006", "game_name": "Echo Night Beyond", "text": "Most Haunted surprised us all a couple of years back by being one of those rare breakouts from cable television's dirge of bored housewife programming. At its zenith it took a slouching nation on a couch-driven gawk-thru of Britain's spookiest spots with a presentational style bordering the right side of rampant hysteria. Watching Yvette Fielding and Derek Acorah scream in terror if so much as a floorboard creaked or a badger snuffled was a testament to non-event TV everywhere.Sadly, that kind of staged frenzy can only power the ever-failing promise of actual spiritual emanations for so long. Derek's camp interaction with Ethiopian spirit guide Sam aside, the lack of actual ghosts wasn't going to convince more than the brain dead that the show was anything but a big pile of rubbish all along.Now, if they'd only gotten Richard Osmond in, respect would be due. This man probably bathes in ectoplasm, such is his susceptibility to a good haunting or two. He's plagued by ghosts and he's got the Most Haunted overreaction style down pat: spending more than thirty seconds in the company of a see-through dead person is enough to give the poor fellow nothing less than a fatal heart attack. He stars, appropriately enough, in the futuristic follow up to the long-forgotten PSone adventure game series Echo Night, of which the latest, Beyond, is that rarest of breeds: a Japanese first-person shooter. Except, seeing as you don't actually possess a weapon - not even a camera - and given Richard's propensity to Revolution himself at the slightest eerie noise, it's probably best to replace the 'oo' of 'shooter' with an 'it' for a more accurate description. That's more like it. Who says we can't be sophisticated?Anyway, what you do have in way of defending yourself is advance planning and the necessity of activating our old friend the ventilation system. You've woken up on a crashed space shuttle, you see, your girlfriend's gone missing, and there's a mysterious spectre-brimming space station shrouded in fog just waiting to be explored. This fog's affecting the ghosts, turning them hostile, and sucking out that malevolent mist is the only way to pacify them and make progress.The main job, then, is something along the lines of entering an area off the central hub, ducking into the nearby safe haven of a monitor room and checking the security cameras for the safest route to the ventilation controls. Alongside that, some of the cameras allow you to focus in on glowing psychic imprints which, when examined, flicker into short cut-scenes explaining the story and giving clues to the handful of simple puzzles that bar your way. One nice touch here, in keeping with the eerie atmosphere of solitude, is that nothing is ever in frame, the images often centring on a hand or a foot, never a face, never letting you identify with the living.Having said that, the quality of acting doesn't signify much of a living presence, either, with achingly long pauses between each line, misaligned emotions, and that most incongruous but de rigueur of videogaming elements: children who speak like posh Victorian orphans. In space.Once you've calmed the ghosts down, your other job (naturally) is to chat to them until they send you off on a seek-and-find task. ~I can't go to my eternal rest until I have my drinks flask/amulet/hedge trimmer. Off you go, then. I'll just sit here and wail for a bit.~ Having completed one section of the station, you'll eventually get the keycard to the next, and then it's off for another round of monitor, ventilate, fetch.Graphically, it's rather chunky and texturally uniform in the way that a low-budget PS2 FPS sci-fi title usually is, with your view partially obscured by the wearing of a massive space helmet. It's pretty effective as a way of ramping up the feeling of claustrophobia, though it also asserts the suspicion that Richard really is just a big irrational scaredy-cat as all evidence seems to point to a working air supply. Still, thanks to his fear, exploring with torch on, the only accompaniment the sound of your own footsteps, any encounter with an evil ghost results in enforced blind panic in which your vision darkens dramatically, the music crashes in, and the pad rumbles rapidly in sync with your ever increasing heartbeat. Though few, these are the moments of sublime terror, necessitating stumbling in alarm to where you thought the exit once was (and most probably resulting in an all too quick 'Game Over' the first couple of times). It's both a frustrating and exhilarating highlight.The spacesuit isn't just an extension of your visual experience, though; it affects movement as well. Richard has rather a plodding walk and a slow turning circle, necessitating the constant depressing of the run button. For some reason the game's default setup is to assign the strafe and vertical controls to the individual shoulder buttons, translating as a clunky system for those of us raised on more progressive FPS fare. And while you can change to a more traditional style in the menu, switching the y-axis isn't an option. Unforgivable.Worse are the few moments when you take a trip outside. In terms of gaming realism it may be atmospheric (actually, can you say that about a game set in space?) for your movement to be slowed right down and the run option switched to an uncontrollable low-gravity long jump, but it's also slightly tedious. What's more, the surface plays host to a 'what were they thinking?' ill-advised platform-jumping section which, while only cropping up the once, is one time too many.Obviously, it's not meant to be a fast-paced game and the ponderous movement is supposed to add to the terror, but once you've spent a short time in Richard's shoes it becomes a little irritating.And that's Echo Night: Beyond's problem: it loses its lustre way too soon. Once you've gotten over the thrill of initial exploration and encountered the meagre jump moments and a handful of malicious ghosts (a giggling girl chasing you down a corridor, and a frantic wait for an elevator as a dead priest breathes down your neck being the most memorable), things just don't seem that scary any more. Instead of upping the ante with bigger shocks or harder monsters, the game insists on deflating by sticking to the same old formula. As more sections open up, backtracking through long corridors to find the next item eventually becomes a chore right up until the nonsensical anti-climatic ending. Even worse, missing a beat leaves you wandering around bored until you trigger the next sequence; such is the game's mostly linear nature. There's the added strategy of making sure your torch doesn't run out, but batteries are in such abundance that it's never a problem. Thankfully, it's not all doom and gloom: loading times between areas are mere seconds long.Echo Night: Beyond is not quite Project Zero in space, that's for sure. It does begin as an initially promising ghost train ride, but given its short nature - about twelve generous hours or so if you get hopelessly stuck like me because you didn't talk to that damn woman - it's a shame it lapses into average fetch-quest territory all too quickly. With its emphasis on non-violent solutions in an FPS framework, it's an off-path Japanese curio, but a little too hard to recommend to all but the most ardent and accepting of horror adventure fans."}