{"ref": "https://www.eurogamer.net/r-evolutiongt-pc", "date": "2 May 2006", "game_name": "Evolution GT", "text": "It must be tough to be a racing game. Of course I've never been burdened with being a racing game myself, but I do rather suspect that there would be two things I'd be concerned with were I to be so magically transformed. Firstly there's the matter of my portrayal of speed. Racing games need to get that adrenal gland pumping, and they're not going to do it if they feel like you're hitching a ride on Grandma's shopping trolley. Evolution GT only just manages to fulfil this basic requirement. It feels solid, but stolid - dependably automotive. You've seen this a dozen times before - realistic to the degree that some sense of fun is lost, but with no sense of accurate simulation acquired. The sensation of zipping along at life-curdling speeds is what makes racing enjoyable, and to ignore it is to misunderstand why videogames have been made into these kinds of experiences the first place. Secondly, were I a racing game, I'd need to be challenging. But where would one find new challenges for you jaded gamers? Normally it needs to come from your own skills, pitted against those of your gaming opponents. If I were being honest to the world of racing then I'd be concentrating on this singular problem, rather than on any peculiar gimmicks that it might be possible to invent. Racing is about being the best, being the fastest, and not, for example, being able to rewind time...But that's not how Evolution GT sees things. It desperately wants to be an individual amongst the gaggle of racing sims. And, instead of getting a tattoo and smoking spliffs in the park, it decided to try and reinvent the racing genre by stealing tricks from other games. As a result it's a bit of a mess - a mish-mash of ideas lamely tacked over the familiar physiognomy of the contemporary multi-formula racer. It could have been a contender, but instead it has thrown the race with its desperate desire to be different. It's a bloated beast, only dimly aware of what its existence could have been.Things don't even begin well. GT's contrived format is taught to us via an unbelievably ill-advised introductory tutorial, presented by an over-dubbed champion race driver Gabriele Tarquini. ~You must drive headfirst,~ his dislocated non-voice informs us.Tarquini introduces the special features which define Evolution GT's numerous failings. The first of these is 'intimidation', which is implemented via a small slider bar attached to the cars of your opponents. Put the pressure on them by keeping close and their nerve will eventually fail, allowing you to overtake with ease. And hey, as I type I realise that this sounds okay in theory, but the implementation in the game itself is impossibly naïve. The bar goes down, the bloke in front's steering goes wobbly and you overtake. It makes no real sense, and makes a mockery of the racing skills you'd want to exhibit in a game like this. It's not a simulation, but an aberration. Worse, far worse, are the same effects of intimidation on you. If other racers keep close behind you then your vision starts to blur. Yes - YOU GO BLIND! Insane as it might sound, otherwise fairly sturdy Italian developer Milestone has created a racing game which portrays the pressure of furious bumper-to-bumper driving by making you lose the ability to see. It's ridiculous.Then there's 'the cunning overtake'. I have almost no idea what this is supposed to represent, except that you are occasionally able to go faster for no reason that I can fathom. Tarquini seems happy about it though, so we'll leave it at that.The last ability is what Tarquini claims racing drivers call 'The Tiger Effect'. Attempting to simulate the uncanny ability of drivers to predict what will happen moments before it happens, the developers have seen fit to include a 'rewind' function where you can, at any moment, rewind what just happened and get that corner just right, or avoid slamming into the scenery for the sixty-fifth time. Actually, to give due credit, this is a feature that actually works okay. It's quite useful and it goes a long way to alleviating the problems that arise from not having learnt a course all that well and making a mess of it on the first few runs through. But it does seem like the equivalent of the quick-save in the FPS: you might as well hit rewind and start that braking sequence again and again. A built-in cheat.Anyway, all these special abilities reflect a certain element of stat-crunching that goes on as you progress through the game's career mode. Each of these elements, as well as obvious things such as handling, have driver-dependent statistics associated with them. Gaining experience from racing allows you to spend points pumping up your abilities. In the first few races you'll go regularly blind as other cars approach from behind, but if you don't want to drive by sound alone you'll be able to combat this effect by spending points on concentration.And you can see why a racing game would want to go this way. It has looked enviously upon those clever platform games and their time-rewind functions, and it has seen the RPGs with their fancy statistics and attribute-fiddling. But Evolution GT's efforts to innovate have resulted in it becoming rather boring. It's trying too hard and forgetting what makes racing loveable in the first place. And that, I'm afraid, is unforgivable."}