{"ref": "https://www.eurogamer.net/r-winback2pp-ps2", "date": "29 Apr 2006", "game_name": "Winback 2: Project Poseidon", "text": "As we all know, Nintendo is hoping to revolutionise gaming later this year with a new form of control input. It may be just what we need really. Because game developers are never, ever going to give us fully configurable controls.Think about how the camera's controlled in an average PS2 title. In an FPS, for example, the stick is our aiming and rotation device; moving it left moves or aims left, right moves or aims right. In a third-person title, the view is controlled as if it were a physical camera, so we rotate the stick right to view left, and left to view right, while moving in 360 degrees with the opposite stick. Unless, of course, this is a third-person title that controls like a first-person title, in which case you control it like the former. Confused yet?And then you get anomalies like WinBack 2: Project Poseidon, a third-person title that uses the left stick for 360 degrees of movement, but uses the right stick like a first-person camera - except it's divorced from the movement controls. You move the stick left to view left, but if you then run right, the camera will be facing the wrong way.If you're conditioned to traditional third-person controls, expect to be doing this a lot. Your crack anti-terrorist operative will spend most of his (or her) time running into walls or directly into gunfire, and, to segue nicely back into my argument, this is only a problem because of the lack of configurable controls. It's an entirely needless extra challenge.A bit like one facing Nintendo's marketing department, actually.It's particularly challenging because WinBack 2: Project Poseidon is ROCK HARD. Just playing on the normal difficulty level it can be a wildly frustrating trip through absurdly dangerous locations, frustrated by occasional instant-death situations. Though the levels are intentionally small and linear, the lack of save points is still infuriating when you get to the end of a horribly tough level and die, instantly, by backing into a trip mine you couldn't see because of the camera.But wait! Let's say you're a gamer willing to learn how to use the camera 'properly', and you can also live with playing games on 'easy' (the shame!). How does WinBack 2 stack up then?Well, it's a strange kind of stealth-action title. It might bring to mind Metal Gear Solid initially, but it actually has far more in common with Time Crisis, thanks to a strict time limit and a battle system that requires you use the maximum amount of cover to succeed. Able to aim your weapon before exposing yourself to take a shot, each room you enter becomes a frantic scrabble for cover before a tense, Hollywood-style shoot-out. Here the enemies perform admirably, staying locked onto your position and attempting to flush you out with grenades. Timing becomes everything if you wish to perform successful, clean takedowns; you gain more points for disabling an enemy than killing them. The enemies can be terminally moronic and inconsistent, though, often using unrealistic hyper senses to spot you the moment you walk in a room, only to get bored and ignore you. So easily distracted are the majority of enemies that you can take down whole rooms of them by staying out of sight and popping out to use hand to hand combat.Interestingly, each mission is played twice - once from the viewpoint of each member of the team sent in. So, while as tortured hero Craig Contrell you might be unlocking doors and finding items, as plucky rookie Mia Cabrera you'll rely on Craig to have performed these support tasks. Depressingly there is no simultaneous play option, but it's rare that you could miss a critical action in route A that could render route B unplayable. It's an interesting '24'-esque twist; you might even argue that it's a very enjoyable 'sequential multiplayer' title, providing you're happy to use terms I've just made up.Playing each mission twice is never repetitive, but the level design does wear thin. While there are 30 missions, the architecture quickly repeats itself with yet another lab, construction site, or subway, and it's not as though the plot framing the action is particularly memorable. Despite the watery title (there's no boat action, 70s disaster flick fans) it's mostly a world tour of terror, as you face off against evil Arabs, Mexicans, Russians, and so on, with the faint smell of what you think a Japanese company expects a good, patriotic American to want. There are odd moments of excitement (a hostage situation at an airport late in the game, for example) but the boss battles are uniformly terrible compared to the otherwise enjoyable stealth action in the rest of the title. Apart from the camera, WinBack 2: Project Poseidon is consistently entertaining, with the combat mechanics and movement smooth and satisfying, but in general it's also rather lacklustre, full of flaws that are too glaring to ignore when considering a recommendation. Some aspects are incredibly polished and fun, but others are terrifically broken, and while there's a real sense that it could have earned a lot more than a five, overall it doesn't."}