{"ref": "https://www.eurogamer.net/r-roguetrooper-x", "date": "27 Apr 2006", "game_name": "Rogue Trooper", "text": "After the unfortunate Dredd Vs Death debacle back in 2003, the world hasn't exactly been waiting with bated breath for the next 2000 AD spin-off to roll off the Rebellion production line. But, with some harsh lessons learned, the one-time starlet of the UK development scene (back in the Alien Vs Predator era) has turned things around, with several decent games under its belt (notably the award-winning - yet generally under-rated - WW2-based Sniper Elite). Following on from the gradual return to form, the swaggering arrival of the slick action-adventure that is Rogue Trooper underlines the growing confidence within the Oxford-based developer-cum-comic-publisher.Based on the famed graphic novel series, Rogue Trooper is a simple, unpretentious third-person shooter where you follow the adventures of Genetic Infantryman, the Rogue Trooper, as he seeks to track down the traitor general who sent his ~brothers in arms~ to their death. It's generally undemanding, short and sweet, slick, polished and boomtastic from start to finish. It's not going to change anyone's world, but Rebellion deserves credit for coming up with a technically admirable product that's true to the comic spirit and full of great moments.But before we get underway with the nitty gritty, just why is the Mohicaned Rogue Trooper so pissed off anyway? Ok, so the general of the other biologically engineered clone troops has been a traitorous swine and was responsible for the betrayal and subsequent massacre of his entire regiment. But let's take an unreality check here: they're clone troops with encoded bio-chips that house their digitised personalities. Why not clone some more (surely the idea), plug in the chips and get after this rubber-lipped goon?Instead, we're supposed to feel his righteous indignation and tackle the brutal Nort war machine (on Nu Earth, you understand) on the way to kicking the butt of the nefarious Jagger mutation behind all this skullduggery. It's vengeance a go-go, which in short means another opportunity to upset your neighbours with endless gunfire and huge explosions.Right at the heart of all this clone trooper warfare is the ability to plug personality chips directly into the bodies of any clone. You might imagine that plugging in multiple chips into a single trooper would confuse the bejesus out of it, and be the source of much unintentional split personality comedy. But, instead, Rebellion has used it as a cunning upgrade system, meaning that as you discover more of your fallen clone buddies, you can swipe the chips from their stricken torsos, plug it in somewhere else on your body and - presto - new specialist abilities.Being a typical third-person run-and-gun extravaganza there's plenty of security to override, so it's no great shock when you gain Helm's hacking abilities (in your helmet, naturally). Also, seeing as you're expected to be a bit of a one-man army for most of the game, you also get a helping hand (or arm) of sorts, with the ability to set up Gunnar (imaginatively) as an intelligent sentry gun while you scurry off and do something else. But it works in other areas too. Bagman, for example, is a salvage expert, and his personality chip makes it possible to gather up all the best bits of the assorted junk that's left over from all the scrap metal you create in combat, giving you a currency with which to buy ammo and the various upgrades with later on.A few levels in, you're even blessed with a handy Holo Decoy, last seen 10 years ago in Duke Nukem 3D, and every bit as useful as you place a distraction somewhere to draw the fire of the numerous sniping gits stationed way up high. It's all pretty intuitive, too; a quick tap of the B button brings up a four-way menu, enabling you to quickly select whichever aid you require with the d-pad.In fact, the controls are one of the strong points of Rogue Trooper. Underpinned by the regular two-stick system for camera/movement, a context-sensitive system (similar in flexibility to Ghost Recon Advanced Warfighter) allows you to pull off many otherwise fiddly commands with ease. Combat commands, in particular, benefit from the decision to be able to quickly and easily wall-hug any appropriate cover points and either 'blind fire' over the top, or go for a slightly riskier aimed shot that still gives you a fair chance of dispensing a volley of lead on target.It's not all good, though, with Xbox owners forced to use the dreaded black and white buttons to fire grenades and mines (why oh why). Meanwhile, changing weapons is handled badly, with the player forced to manually select their weapon by cycling up or down a text menu with the d-pad and hitting confirm before they can swap over. Not only does this cause unnecessary confusion in the heat of battle, it's a completely inelegant system that could have been avoided entirely if the weapons simply changed over automatically when you hit the up direction. The added need to confirm is the last thing you need when half a dozen Norts are busy raining death down up you."}