{"ref": "https://www.eurogamer.net/r-firedept3-pc", "date": "24 Apr 2006", "game_name": "Fire Department 3", "text": "Fire! Fire! Fire the developers responsible for taking such a promising premise (firefighting RTS) and turning it into such a mediocre game. Perhaps sacking is a bit harsh; Fire Department 3 does have its moments, but the problem is you are usually far too busy to enjoy them.Here's how a typical mission works. Your units are dumped down beside a blaze and within seconds the objectives window starts screaming instructions. Extinguish that flaming electricity transformer! Recover those five injured scientists! Contain the fires by the fuel silo! Click. Click. Click. Click. A frantic minute passes and you get a couple of things done only for them to be instantly replaced by a couple more. Turn on those extractor fans! Bulldoze that gate! Rescue that kitten! More panicky clicking, more time-sensitive objectives. By the time the victory screen pops up you are as frazzled as the hero-narrator's Gallic eyebrows.Firefighting games obviously can't be too leisurely, but there's no good reason why they can't be more freeform than this. The devs have gone to the trouble of creating a very impressive fire and smoke propagation model that factors-in things like oxygen supply, wind direction and ignition thresholds, yet you are so busy dashing round trying to complete the contrived tasks set by the control-freak mission designers, you barely notice it. By the end of the thirteen-episode campaign I was praying for a mission in which I arrived at a scene and was told, simply ~Put the fire out and save as many lives as possible~.There just aren't enough meaningful choices in FD3. Areas where players might have had power are selfishly monopolised by the game makers. Take units for instance. There's a good selection, but do we get to pick or purchase our own squads before a job? Not on your nelly. Apart from some token reinforcement decisions, you get what you are given and that's that. Being as the campaign follows the adventures of a single globetrotting fire-team, you'd think the devs might have thought to include some sort of persistent experience or skills system. Picking new upgrades for individual firefighters, choosing to rest weary or injured crewmen during certain missions... With a few inspired touches the game could have been so much better.Predictably, the lack of choices extends to the campaign structure. Like a strict parent, FD3 forces you to finish one course before moving on to the next, but even on the lowest difficulty level progress can be third-degree-burns painful, and the puzzle-like nature of the missions and numerous time limits ensure a lot of reloading. Those that do stick around until the end get rewarded with the blindingly obvious conclusion to the game's thin storyline. Amazingly, it turns-out that the roving French fire-crew at the centre of the plot aren't just hilariously unlucky. The fact they were in Kiev when a nuclear research lab was bombed, in Paris when a virus lab went-up, on a Channel Tunnel train that caught fire, etcetera etcetera, wasn't just a coincidence! (My head is still spinning, my jaw is still slack.)Ironically, the best of the scenarios are the ones with the most workaday settings. At one point during the French segment you are sent off to a city suburb to manage the aftermath of a huge gas explosion. Buried casualties have to be sniffed-out with dog teams then extricated by strapping axe-wielders, people trapped on upper floors need to be located by agile climbers then rescued with the aid of long-ladder fire engines, blazes need to be extinguished. As usual you are trying to do all of these things at once which is horribly stressful, but it's fun too. A game that generated incidents like these semi-randomly, then let you tackle them using your own tactics and team selection, now that would be a firefighting game I could get really enthusiastic about.Part of the reason the concurrent mission objectives and the time-limits are such hard work is that a lot of the activities in the game require micro-management. Though personnel and pumps will happily attack nearby fires without specific instructions, operations like rescues and indoor fire-fighting must be carefully choreographed. Firemen won't open doors without your say-so, which is wise considering the risk of backdrafts and flashovers, but equally they won't carry victims to safety unless instructed. Another area that can get quite fiddly is the switching of extinguishing agents. The game models four types of fire - 'classic', electrical, chemical and metal - and four types of substances for fighting them. Because maps often feature several flavours of flame, you sometimes need to re-equip firemen at appropriate vehicles or hydrants. It's tactical texture, but it's also another thing to think about during the manic missions.One answer to FD3's scary workloads is to bring a friend to the inferno. All of the campaign missions can be played co-operatively with up to four players sharing the same force. Just in case the squabbles over the fireboat and the rescue chopper get out of hand, there are also some large bespoke missions in which every player gets their own firehouse full of equipment and men. Not tempted? No, me neither.One day someone is going to make an excellent strategy game about firefighting (this isn't it, by the way, just in case you haven't been paying attention). If you'll excuse the inexcusable combustion-related puns, Monte Cristo has a good enough engine but it doesn't seem to have the necessary flare for level design or pacing. So unless you've got a burning desire to run around like a blue-arsonist fly I'd give this fraught fire-escape a miss [Fired! - Ed]."}