{"ref": "https://www.eurogamer.net/r-talesofphantasia-gba", "date": "20 Apr 2006", "game_name": "Tales of Phantasia", "text": "That Tales of Phantasia should peek its head around the curtain of GBA gaming so late in the system's life with scarcely a ripple of applause seems immensely unfair. Had this game been released three or fours years ago, the ovation would have lasted for weeks, the far-reaching repercussions from its release sending shivers down so many Super Nintendo developers' now crooked backs. This game is one of the SNES era's Japanese RPG greats; a marvel of Mode 7 twizzling 2D/3D exuberance, a world bristling with super-deformed charm, stretching and reaching long narrative fingers over hours of delightful adventuring. Released late in the Super Nintendo's life, this, the first Tales game, never got to travel further than its birthplace of Japan, forcing swathes of hungry importers to dust off Kanji dictionaries before nursing Aspirin-soaked translation headaches. As with other high-profile missing-in-translation Super Nintendo RPGs such as Secret of Mana 3, the game has since only been playable via emulation and a fan translation, left cobwebbed and untouched in a dark broom cupboard off videogaming's bright halls of fame. So think about what this means: One of the last great games of the RPG super-era now on a GBA in full, perfectly ported portable magnificence. Maybe we're the only ones that care anymore. Maybe, with the Tales-branded games seemingly everywhere now and PSone conversions (and homebrew SNES emulators) showboating across PSP screens the world over, there's little triumph in such technological marvel. Perhaps this has just come too late in the day, robbing such a move of any implication that we might see more of the greatest sprite-based RPGs ever created receive similar honour. Imagine: Final Fantasy VI, Chrono Trigger, Bahamut Lagoon, Star Ocean or so many of those other games that make contemporary RPG storytelling sound like a primary school English class project on a GBA. To think that might not happen makes us want to cry a bit under our ever-so-slightly rose-tinted glasses. Still, marvellously you could be completely oblivious to all this history, significance and nostalgia and still have a good time with Tales of Phantasia. Let's start with the positive as it always makes us chirpy when Namco and Nintendo go out on a date. The battle system we're all so enjoying in the PSP's Tales of Eternia at the moment was birthed here. You take direct control of protagonist Cress, directing his various strikes using the attack button in combination with the d-pad. His skill set obviously balloons as the game progresses until there is a pleasing level of freedom in choosing your approach to battles. It's then possible to chain special moves off of regular strikes to create your own combos while your companion CPU-controlled characters support you with magic and cuteness. The animations, predictably for a 1995 SNES game, are beautiful and will make you feel young and a bit innocent again. However, long term, while the action-orientated twitch fighting should go some way to dull the inevitable irritation of the magnanimous battling - on which the game relies just a little too heavily to flesh out the hours of play - it doesn't. Almost unavoidably over a game twenty hours in length, you eventually settle in to hammering through the battles, dispensing with thinking strategy in favour of simply getting through each encounter as quickly as possible, turning what was initially a sweet invention into sour grind. Likewise, there are problems with the system, such as pauses before your comrades perform spells, stuttering slow and responsive controls and over-long victory poses that soon serve to frustrate as much as they ever inspired.The plot is short and sweet and, in its intelligible brevity, beats its grandchild Eternia's overblown complexities hands down. It's also pleasingly open, allowing numerous sub-quests to be undertaken at once and exploration of pretty much anywhere you feel the inclination to visit. Perhaps it's because we're used to developer hand-holding these days but the lack of any quick menu reference of current quest objectives can leave you overwhelmed and lost - unsure of quite where you're meant to be headed, what you're meant to be collecting or to whom you need to be speaking at any point. You could always pay close attention during conversations and jot down any key place names on a scrap of paper to stay on top of things as, arguably, true freedom like this comes with some responsibility. But really, we're making excuses here for a design omission.Indeed, under the surface there are many such oversights that show this game's true age. Many of the problems surround interface issues - elements of the series that have been subsequently ironed out by Namco, but which are recreated here in their full original messiness. Key information, such as how much money you currently have, is buried under confusingly inaccessible menus. Likewise, the translation, considering it took so long to get here, is rough around the edges lacking much of the sparkle and flair that the unofficial fan efforts display. Predictably it panders to a younger audience losing much of the salacious cheekiness of the original Japanese although such cuts in original content are balanced by new additions (new quests and the sizeable cooking section). In transposition from SNES to GBA the audio of the game suffers too with tinny dialogue, quiet effects and badly reproduced music. In the cool spring sunlight of 2006, eleven years after it eluded westerners the first time, this is not the best handheld RPG money can buy today. It's not even the Super Nintendo RPG we would have wished to be ported with eyes clenched tight and fingers white from crossing. For fans of the series (and it is the third best-selling RPG series in Japan right now after Dragon Quest and Final Fantasy) this is a chance to see its point of origin and fill in an annoying blank in their collection. For everyone else, this is mostly good fun, mostly good value for money, mostly a decent challenge, mostly more than just a fossilised stage in the evolution of RPG gaming. But, almost totally, this is a game that makes our GBA a Super Nintendo: and one with a decent d-pad, battery life and scratch-free screen that doesn't need us to fiddle with firmware and dally with grey-hued legality to enjoy."}