{"ref": "https://www.eurogamer.net/r-bfnmc-x360", "date": "18 Apr 2006", "game_name": "Battlefield 2: Modern Combat", "text": "Modern Combat nails the tension and thrill of war like a sniper nails a headshot. It's smooth and it happens so quickly it can leave you shocked - if you're not paying close attention you'll end up with your limbs spread across the war zone. If the on-screen action makes your palms clammy and your heart beat a little faster, the game must be doing the right thing. Whether man-to-man with automatics blazing, frantically darting for an inch of cover and hoping a combination of skills and blind luck will save your arse, or tank-to-tank, the pause between shell loading causing your buttocks to tighten as you take aim a shot you hope will rip your enemies apart. Modern Combat is a tense and dangerous war game from the very start.The single-player campaign has the unique Hot Swapping feature, allowing the player to assume control of different soldiers with the simple tap of a button. It's surreal to begin with but highly effective, as you Hot Swap between soldier classes and vehicles, whether to push forward, change tactics, gain the upper hand or simply survive. If it's a novelty, it doesn't get old quickly, partly due to the sheer amount of variety on offer. The player bypasses the frustration of being the wrong man in the wrong place by potentially being all the soldiers, with all the equipment and vehicles at your disposal. Drop the rooftop enemies with a sniper, Hot Swap into a tank to destroy a barricade and then jump to a grunt for the final bloody push. Hot Swapping does take some getting used to and demands an element of discipline in how you play. If your troops are spread out you can become disorientated after the initial jump, which can then lead to the loss a crucial second adjusting your position or simply avoiding getting your face shot off. If it does get too confusing and you fail a mission the scripted events make the learning-by-rote gameplay easier. You'll know from where and when your enemies are coming the next time around, so the spontaneity is left to you and your Hot Swapping, which seems like a fair trade. You're encouraged to play the single-player campaign over as efficiently as possible in order to unlock better equipment and medals, and with the variety of soldier classes and their weapons, as well as the vehicles in use, there's scope for varied tactics and experimentation.This constant body-swapping is also necessary because your AI team-mates don't always play cautiously. They can be a gung-ho bunch so it becomes essential to jump between soldiers for defensive as well as offensive reasons. It sometimes feels like the game is running along at its own rapid pace and control goes out of your hands as you struggle to keep up with it. As there's no opportunity to give orders, you can't survive playing lone wolf with one character. You'll need to be thinking on your feet and Hot Swapping across the whole map when necessary. It can become exhausting as much as it's exhilarating.Also tacked on for the lone gamer are the Player Challenges which sway from the uneventful to the gruelling. Hot Swapping as quickly as possible across a map isn't fun. It might hone your reactions for the wider game, but it never enters the realms of excitement. And the game wasn't really built for timed races in a Humvee either. Success unlocks different weapons as a reward, but curiously, as soon as you register your copy of the game with EA (i.e. as soon as you play online) you're sent a cheat to unlock all weapons anyway - something you're going to be tempted to use when you've had your arse handed to you in a helmet numerous times.The game plays out completely differently online; with (obviously) no Hot Swapping ability and good old human beings instead of AI goons it becomes a more traditional war game. Technically it's an impressive experience, with only a few niggles such as tanks getting stuck behind farm gates breaking the illusion. There's plenty of variety in the 16 maps, from sun-drenched desert towns complete with heat haze, to midnight showdowns with a vision-hampering blizzard. Where the single-player campaign doesn't allow for much exploration due to the hectic nature of the missions, the multiplayer challenges you to seek out buildings and trenches, alleyways, rooftops and other advantage points. Not every building is open to exploration, but there's more than enough terrain to take advantage of. The maps themselves aren't huge, or should we say not as huge compared to the PC Battlefield titles (there, we mentioned them), but they seem a perfectly acceptable size for the 24 online players.For once, cold, hard figures amount to something in Modern Combat - 50 weapons and 30 vehicles go a long way to keeping the game fresh. If tanks aren't your thing, boats, snowmobiles, Humvee's and more are at your disposal. Some vehicles do feel awkward when you first take control, but if you're not comfortable with it, try something else. It's worth persevering with the tricky ones as the first time the controls for helicopters click into place it opens up a new dawn for relentless, down-right nasty deaths - there's nothing like trapping foot soldiers in a shower of bullets. You'll soon find the means for destruction that you're looking for and this is where the game really rewards the player. There's as much fun to be had planning devastating hits with a bazooka as piloting a chopper and dropping your team-mates onto an occupied oil rig while you support them from above.Your experience of online play is clearly affected by the company you keep. It's a game where the more time you spend investing in it, the more fun you'll have. It's certainly not a game you can drop straight into with a large degree of success, but those first kills soon mount up, and with practice you'll be scoring deaths on the side of your tank with pride. It's not a strictly hardcore experience partly due to the arcade leanings of the combat, but it's not newbie friendly either. Our advice is to get in with a clan that you can learn from, because it would be shame to be put off by any elitism, overwhelming brutality or that type of person who can only be described as the Online Tosser.Arriving on Xbox 360 just six months after its current-gen incarnation, there will be an initial sense of disappointment for anyone that already owns the Xbox or PS2 version of Modern Combat. Apart from a handful of additions and some tightening up of the online experience, it's the same game bar the slightly nicer visuals (and they are pleasing to the eye, too, I have no shame in being that shallow). With only two modes - Capture the Flag and Conquest - there's the sense that the extra development time might have been better spent injecting more life into online play, particularly given the community feel the 360 is constantly striving for. Those that have already exhausted the game's potential would be rightly hesitant to splash out on another copy unless they really feel the bizarre need to unlock Achievements and grow that Gamerscore. If you've had enough self-control to wait for this shinier version you're in the best position here and Battlefield 2 comes highly recommended. Its single-player campaign is elevated from mediocrity with the inventive Hot Swapping feature, while twenty-four players, armed to the teeth and unforgiving in their violence, is what Xbox Live was made for."}