{"ref": "https://www.eurogamer.net/r-singstarrocks-ps2", "date": "11 Apr 2006", "game_name": "SingStar Rocks!", "text": "Karaoke is simultaneously the greatest thing ever invented and the most traumatic, torturous experience imaginable, but you can't ever win. Ever.If you happen to fall into the category of being a self-effacing bad singer, you're afforded the respect of being able to get up there and take the flak, knowing full well that everyone's having a jolly good laugh at your expense. But it's fine. Most people are pretty terrible singers - at least you had the guts to go up there. But you're still a bad singer. You still suck at singing. You don't win. Okay, you win at being a good sport, but is that really a consolation? Not if you've got a shred of self respect, no.Of course, the psychology of the loser's sport that is karaoke is that it's inclusive. The fact that several of the world's worst singers have jovially gone up there means that you have to, jerk. It's like being hauled up to dance at a wedding, only worse. Worse because it's all eyes on you, buddy. And then you go up there and blow everyone off stage with your fabulous rendition of the song you love. Do you win? No, you lose out of a combination of the fact that i) they hated your song (~too depressing~, ~too poppy~, ~never 'eard of it~) and ii) you dared to break the rules of karaoke and actually sang it properly. Loser. That's not in the rules.But sod that. Once you get over the fact that it doesn't have to be a cringeworthy kitschfest, karaoke starts being more fun. Especially once social lubricants are involved.Singstar's long been the master of home-based karaoke fun. Measuring your ability to hold a tune has turned this peculiar hobby into a score-based challenge, and one that you can spin out into a full-on party game (for up to eight players, though no more than two at a time) if you've got some willing volunteers.But the first wave of Singstar titles always hinted at the possibilities of greatness, rather than delivered the definitive home-based karaoke experience. The problem was - and still is to a lesser extent - that your enjoyment hinges on your personal appreciation of the tracklisting. With Sony initially going for a scattershot approach of old and new hits, younger players tended to be alienated by the older songs, while the old farts suffered by not knowing the new stuff very well. And even when you did find songs you knew and loved, they weren't always easy for mere mortals to sing.Sony has since tinkered with the formula to limit the songs to a 'classic' era (Singstar '80s), but even then there seems to be a few questionable selections and startling omissions. But with only 30 tracks to choose from, that's an inevitable limitation, and one that Singstar Rocks suffers from just as badly as the others in the series.With literally no new features in terms of the modes, this is as simple an 'update' as possible, but one that lives or dies on the strength of its tracklisting.Again, though, by adopting a scattershot approach that spans several decades, Singstar Rocks returns to the choppy waters of including some ill fitting recent tracks from artists that appear completely out of place with some of the all-time greats they line-up against.It's a matter of taste, of course, but including the likes of Bowling For Soup, Gwen Stefani and KT Tunstall alongside giants like Nirvana (Come As You Are), Queen (Don't Stop Me Now), The Rolling Stones (Paint It Black), Thin Lizzy (The Boys Are Back In Town) and Deep Purple (Smoke On The Water) is faintly bizarre. Sony's track selection for the old rock classics is uniformly excellent (big hand for the inclusion of The Undertones' Teenage Kicks, for example), but outside of that the tracklisting consists almost entirely of modern hits - some of which are good, but by no means the 'big hitters' that most people associate with each band. For example, we love Kings Of Leon, but why 'The Bucket'? Even hardened Coldplay fans would have trouble defending 'Speed Of Sound' ahead of their other hits, Queens of the Stone Age fans would have been hoping for better than 'Go With The Flow' and Bloc Party's virtually unsingable 'Banquet' is outclassed by several other better-known tracks of theirs. Some of the track considerations appear to have been chosen with all the care of iTunes on shuffle.Also, why, on a compilation where the criteria is, quite clearly, 'Rock' do we get limp ballardeering by Keane and The Scorpions? Likewise, we know that Snow Patrol can rock out with the best of them, but Run is possibly their most downtempo single in years!But it's not all bad. Stuff like Blur's 'Song 2' and The Hives 'Hate To Say I Told You So' are what Singstar Rocks should be about: the sort of tracks that would have a moshpit knocking beers flying - not lighters aloft stuff that you'd put on before bed.Even some of the more recent stuff is pretty good, too, with Franz Ferdinand's stomper 'Do You Want To', Kasabian's 'Club Foot', The Killers 'Somebody Told Me', Razorlight's 'Somewhere Else' and Maximo Park's 'Apply Some Pressure' all worthy entrants to the 'more recent' pile. It's just a shame that some of the filler offerings from the likes of Hole, Hard-Fi, Jet, The Bravery and The Sterophonics couldn't have made way for more dead-cert classics that people from all ages could have belted out, rather than mumble through uncertainly.If you can track down Singstar Rocks on the cheap, though, you're pretty much guaranteed a few memorable drunken nights in. It's still as compelling and fatally flawed as it has ever been, where the ratio of good to bad songs is as frustrating as we've come to expect, and the technical limitations of the package (no proper duets, no harmonies, playback slightly off, etc.) are still lingering, unfixed, as ever. With that in mind, Rocks is hardly an essential release (especially now that Rock fans have Guitar Hero), but if you've somehow been holding out up to now, then this is as good an introduction as you could hope for."}