{"ref": "https://www.eurogamer.net/r-spellforce2-pc", "date": "10 Apr 2006", "game_name": "Spellforce 2: Shadow Wars", "text": "It's not the best name ever, SpellForce. It sounds like some sort of educational spelling challenge, given a trendy edge to appeal to the kids. And indeed, when the original SpellForce was released, the name plus the concept - an RTS and RPG combination - left you with a sense of impending dread. But, as it turned out, this was misplaced. Surprisingly, the RPG element wasn't just tacked on as a gimmick, and the game was packed with sub-quests, proper character development and Diablo-style loot-hauling. It did have its problems, sure, but what's really impressive is that the developer seems to have listened to reviewers' and players' moans alike, and fixed most of these issues for the sequel. It sounds like a fairytale, doesn't it?SpellForce 2 doesn't change too much - neither should it - but there are distinct differences. On an overall design level, there's been a slight shift in emphasis towards the RPG side. There are more maps which involve small skirmishes, or adventures into abandoned mines and the like with only your party members for company. Furthermore, the game's positively dripping with sub-quests, some of the more standard 'kill this' or 'get that' variety, and some which are pleasantly more involved, with riddles and puzzles to solve, or choices to be made.Obviously it's not all questing - there are still large-scale RTS battles complete with base-building. However, these epic bun-of-demon-slaying-+3-fights have been streamlined considerably, meaning that you don't actually need a masters in engineering to be able to manage your settlements anymore. The seven resources of the original have been pared down to three, and gone are the complex base-construction trees, replaced by a much neater and compact system of core buildings. This means you can concentrate on the combat itself, rather than base micro-management.The interface has also undergone an overhaul. Various one-click buttons have been added which cover a variety of tasks, such as selecting important buildings (to queue unit construction orders while away in battle). Patrol, follow and other standard RTS orders have made a welcome appearance. Builders can be automatically assigned to specific resource collection duties upon creation, items in the inventory will highlight characters qualified to use them when you move the cursor over them; the list of useful little tweaks is massive.Those of you who hated wandering around SpellForce's maps searching for quest objects and NPCs will also appreciate the fact that the game now highlights many of these locations on the mini-map. The upshot of this is there's no more back-tracking through previously cleared levels hunting around, but on the other hand, it does feel uncomfortably close to spoon-feeding at times.And speaking of things to hate about the original, there was the voice acting, which was just magnificently rubbish - with arch-mages who talked like the camp German officer out of 'Allo 'Allo. SpellForce was home to some of the worst voice work ever, and there's a lot of competition for that accolade in the computer gaming world. It's better here, although much of the dialogue's still hammier than a gammon steak. Fortunately, that doesn't stop the storyline from being compelling and providing some intriguing twists. Neither does it dampen the overall atmosphere, which is enhanced by touches of visual detail like people sat supping ale in the beer gardens outside of taverns, or piles of dead bodies littering the reddened grass of a battlefield.Not only is the single-player campaign commendably huge in scope, when you're finally done with that there's plenty more on the multiplayer front, with standard skirmish battles provided along with a stand-alone co-operative campaign. The latter involves obtaining quests from a central hub world, then teaming up with other players to tackle a series of maps, with the same levelling and loot grabbing mechanics as the single-player. Excellent stuff.The main downside of the single-player experience is its linearity, but it's that absorbing with so many quests to get side-tracked in, this simply isn't much of an issue. It's also true that the game doesn't provide a vast suite of tactical options. There are no formation orders, for example, and your units tend to run along in strung out lines when you direct them over long distances (the pathfinding can be haphazard too). But there are tactical considerations - on a map facing demons, you'll do well to build archers as the devil-spawn tend to go heavy on the flying units. And there's plenty of skill involved in micro-managing combat and using your hero's abilities to their full effect, even if it's of the fast-clicking dextrous variety.All told, the RTS battles in SpellForce 2 are challenging and enjoyable, all the more so now that the base building elements have been streamlined. And tackling the huge amount of diverse RPG quests, picking up and evaluating items, advancing your character's skills to match your tactics is a thoroughly engrossing mix. SpellForce 2 is that rare beast - a thoroughly well executed hybrid game."}