{"ref": "https://www.eurogamer.net/r-bonecowrace-pc", "date": "10 Apr 2006", "game_name": "Bone: The Great Cow Race", "text": "We can't get enough of games constructed around surreal conversations and slightly silly puzzles. There's something so charmingly timeless about the formula, that when a developer comes up with the right blend of sharp writing and wry characters, we're putty in their hands. It's probably the main reason that something like Psychonauts was our Game of the Year, and why we still trade pirate insults when drunk. I am rubber, you are glue.It's also why we excitedly downloaded Telltale's second 'act' episode of Bone, despite the fact that the debut offering wasn't all that brilliant. There's always a sense of helpless optimism whenever former LucasArts stalwarts bring out something new, in the same way you pray that the solo offerings of your favourite band members can recapture the magic of their glory days. You know full well they probably won't, but there's always that chance.In the case of The Great Cow Race, the game picks up the thread from where Out From Boneville left off, with the three Bone cousins still on the run in a 'mysterious valley' full of the kind of oddballs characters we'd like soft toys of (if only to make voodoo dolls out of the more irritating ones). This time around - for curious reasons that it's probably best to not question too deeply - the overall goal is to enter this bizarre cow race, while trying to convince the locals to bet on the Mystery Cow to win.As before, the game features three playable characters from the Bone family: the surly, swindling Phoney Bone; the charming, sincere Fone Bone; and the slightly clueless Smiley Bone. You have to work together in various distinct portions of the game to achieve the same ends. Previously, the game merely carved up the events into identifiable chapters, complete with silly (and irritating) mini-games, but these appear to have been completely ditched (thank goodness) to focus almost entirely on the puzzling and conversation side of thing. With only about eight locations in the entire game, Telltale has been able to create a much more focused adventure, where the majority of it tasks you with switching between the main characters on the fly in order to help each other out.So, for example, Smiley Bone has to work out how to finish off the cow costume that he needs to enter the race with, but doing so involves a fair bit of manipulation to get the items he needs. While he works out in the Tavern's kitchen, Foney's out front, trying his best to resolve the local squabbles and make sure the betting goes the way he wants it to. And while all this is going on, Fone Bone is wandering around the village fair, working out how best to write a poem to win back the heart of his lost love.Last time around, you might recall that we weren't entirely thrilled with how simple the puzzles were, but things have definitely improved a notch in The Great Cow Race thanks to an overlapping character system that has shades of The Day of the Tentacle about it. Much like that old classic, sometimes you'll have to rely on one character doing something first before you can get going with your set of tasks, and the main chunk of Act 2 of Bone follows the same principle.However, any brick walls that you might hit are overcome by a generally spot-on system of hints that gently points you in the right direction if you're coming unstuck, and eventually reveals the whole solution if you're still unable to work it out. Although this can potentially spoil a certain amount of the fun, it stops the game from turning into a frustrating slog for those of us lacking the necessary time, energy or desire to 'click on everything'.The actual standard of the puzzles is pretty reasonable, with nothing truly illogical thrown in to spoil the fun. The only times it gets a bit annoying is when you find out that you've been wasting your time with a particular character, and that progress was only possible if you switched to a specific member of the Bone clan. With no prompts or clear indication that this is the case, there is the realisation that there's no way you could have known this, and it does feel a tad unfair to assume that the player will understand that. We realise that Telltale wanted to make the game feel less linear by giving you the choice of switching between all three characters, but by doing so, it has added a layer of unnecessary confusion to the gameplay which detracts from an otherwise enjoyable romp.Once again, The Great Cow Race is another Bone episode that will make you smile without delivering too much in the way of killer lines that'll have you rushing off to send instant messages to your buddies. Telltale's noble desire to make it a game that will appeal to players of all ages (which, let it be said, it does very well) seems to have blunted the humorous edge to a degree, making it feel more like a gentle harmless introduction to the genre than a game that old hands will be able to slip straight back into. The main characters seem solid enough, and capable of being as witty and sarcastic at times, but often the cast you're dealing with are a little one-dimensional, and don't give you enough opportunity to get some really memorable banter going - often cutting the conversations dead just when things seem to get going. If there's one area Bone could improve on, it's the killer lines - and, selfishly, it needs to stop pandering to the kids so much.You could also argue that the game engine doesn't really do Bone any favours, either We'd rather play a game with hand drawn 2D characters within a real cartoon flavour than see Jeff Smith's comics recreated in a flat-textured 3D world. It's a pleasant enough looking game, but there's something cheap, sterile and 'late '90s' about the characters and the world they inhabit. With the right art direction, the game could really come alive, and given its audience, we're really not convinced that it's remotely important to pander to 3D graphics. It's not as though Telltale has to worry about publisher concerns.Ultimately, as with Out From Boneville, The Great Cow Race is an entertaining enough diversion, but one that doesn't provide much in the way of lasting thrills. Clocking in at just four hours (or less if you just use the in-game hint system) it's all over in a couple of evening sessions, but at least Telltale has been savvy enough to reduce the price this time. For just $12.99, it's well worth the asking price, and a good demonstration of the convenience of episodic gaming - with the knowledge that all your cash is going straight to the game creators for a change.Despite some moments of confusion, The Great Cow Race is definitely a marked improvement to Out From Boneville. With a much more solid, old fashioned return to the adventuring principles that we know and love, it's definitely worth a look for those of us still clinging onto the beloved notion that point and click adventures are here to stay. For the price, it'd be rude not to."}