{"ref": "https://www.eurogamer.net/r-guitarherorev-ps2", "date": "7 Apr 2006", "game_name": "Guitar Hero", "text": "It seems to be the law that if you review Guitar Hero, you have to begin by talking about your own connection to the world of music. This is unfortunate.See, my ~rock history~ begins, aged 10, with me standing in an auditorium with my Mum and my sister. On the stage in front of us, a walking mole. Singing ~I Am The One And Only~.Yes, I have seen Chesney Hawkes live in concert. This pretty much set the tone.Guitar Hero, then, is a bit of a salvation. Whether you're playing it alone or passing around the peripheral - a 2/3 size Gibson SG guitar that plugs into your PS2 - you can't help but tap your foot, wave the guitar around and, in some cases, slide violently along your laminate floor into a stack of DVDs. Like Harmonix's previous games FreQuency and Amplitude, it's about pressing buttons to match beats, but instead of using the joypad you're holding down one of five coloured fret buttons and strumming an up/down guitar string, occasionally reaching for the whammy bar or throwing the neck skyward to launch into ~Star Power~ mode for more points.~Gimmick~ is the wrong word for it, though it's obviously being thrown about. ~Isn't it just a beatmatching game with a fancy peripheral?~ someone asked the other day. Yes and no. It's a beatmatching game, but it's not just ~with~ a fancy peripheral, it's dependent upon it.If you tried to play the game Harmonix has designed here any other way, it wouldn't be anywhere near as fun. As beats flow past, you don't just hit a button; you hold the right fret and then strum. You can do it on a Dual Shock using a mixture of face buttons and d-pad, but it's not the same. When you do it on something that asks for the same hand shapes and actions you'd associate with a guitar, psychologically you feel like that's what you're playing.And everyone wants to play guitar.To return to my own story, my experience with Chesney Hawkes was probably defining - I immediately ran hundreds of miles in the opposite direction, developing a taste for men with guitars, beards and Marlboro voice boxes. I certainly want to play guitar.As I grew up, my tastes hardened in certain areas, and one day I found myself in a London venue called 93 Feet East with a couple of friends. There I witnessed Swedish rockers The Soundtrack of Our Lives crash and bang their way through two and a half fantastic songs. They were amazing, phenomenal. The sort of band I'd love to be in. So obviously I immediately fainted, was carried out, and missed the rest of the show.Guitar Hero is unlikely to make you faint (and, to be fair, my diet had more to do with the abovementioned episode than Instant Repeater '99), but you might find your hand going a bit claw-like after hours spent gripping the neck to try and flick between those tricky chord sequences.Y'see, Harmonix is very good at these beatmatching games, which is another reason Guitar Hero is more than a mere gimmick: the underlying game is actually brilliant, and not just because it makes you feel like you're playing a guitar blah blah etc., but because it's got a brilliant difficulty curve and a rewarding structure.Career mode is split into four difficulty levels, and each gives you banks of licensed (cover) songs to play through in groups of five - usually asking you to complete four of each set to unlock the next lot. On Easy, most are just that - you're only asked to use three frets, chords are rare and the button sequences are quite memorable and repetitive. Even so, as you move toward some of the latter songs - Queens of the Stone Age's ‘No One Knows’ in particular - you find yourself struggling to keep up.But, with practice, it really comes. You find your fingers reacting much more naturally, you settle into a particular style of strumming (some people just go down, some just up, the pros alternate up and down), and you start to really enjoy some of the sequences.Up the ante to Medium difficulty, and things toughen with a fourth fret brought into play, and a further five songs at the end of the Medium Career - including the ferocious Bark At The Moon, which is really quite testing. Sequences complicate; were you to choose Medium as a starting point, you'd probably fail completely. But having been through the Tutorial and Easy mode, you're already familiar with some of the songs, so you have a lingering understanding of the structure of each, and soon adapt to that complication.The game's trick, of course, is that you're not actually playing all the notes. Only on Expert does the game approach a note for note ratio, and even then you've only got the five frets - strings, effectively. Even so, it's never less than satisfying, and you start to take real pride in your unbroken chains of notes (scores and other stats are offered at the end of each track), and get a real buzz out of feeling your fingers throwing themselves around the fret board instinctively. I always said my favourite thing about Amplitude was the way your fingers overtook your brain - it's the same here, only better. It's a guitar, after all.I saw another guitar during phase three of my own rock history (isn't this fun!), which took me to a ramshackle little pit of pubescent mania in the middle of Oxford in the middle of last summer. I tell friends I was dragged there, but in truth I went willingly.Anyway, following a bit too much cheap Heineken and a bit too much leaping around trying to smash things with my forehead, I was very nearly ejected. My friend and I even drew a truly violent look from a woman with a terrifying face, who mouthed ~Stop that!~ as we attempted to invade the stage, which felt like a result. And I got a nosebleed from all the headbutting. Finally, rock credentials!Or at least, they would have been if it wasn't a Mark Owen gig.That's certainly a bone you might pick with Guitar Hero - the line-up of artists.You won't mind the recordings - reputedly all done by one chap (a Brit based out in California, apparently), they're extremely close to the originals, but with the guitar track brought to the fore so that Infected by Bad Religion, for example, sounds quite different. In a good way.You might ask questions like ~Why no Led Zepp?~ To be fair to Harmonix though, you can't please everyone, and what is here is far more hit than miss. From David Bowie and Deep Purple right up to Audioslave and Sum 41, there's a huge variety, and you might even find a few you didn't know you liked. Boston's More Than A Feeling isn't something I'd put on my playlist at home, but it's one of the first things I reach for when I have friends round for Guitar Hero.Plus, any game that can convince me to actually listen to Incubus on purpose has to be worth some good marks. You'll probably find yourself in the same situation with one song or other.Obviously there are some legitimate criticisms. For the multiplayer mode to be at all competitive, for example, it really needs a pair of players of equivalent or near-equivalent skill, preferably trying to make their way through a song just beyond their usual skill-reach - it could have done with some sort of co-operative element, certainly.However, if you tire of Guitar Hero, it'll probably be for lack of new songs rather than lack of enthusiasm - Harmonix has included a number of unlockable songs, but they're mostly US indie dirge that most people won't have heard of, and certainly don't incentivise you to pay much attention to your career totals and whatnot. As far as XP/shop structures go, this is no Meteos or OutRun 2006.I'm running out of ~rock stories~ by the way.Er, I haven't had my hair cut for eight months - does that count? [No, but it makes you look like a shepherd. - Ed] And I once spent a night in a Paris hotel lounge convincing the mood pianist to play Nick Cave and Metallica, which I think he did because he thought I was going to sleep with him.Anyway, look, Guitar Hero is more than just the drunken pageantry of SingStar or the crowd-pleasing novelty of EyeToy, and it's certainly nothing like the boy's toy novelty of Steel Battalion. You won't buy it now and then find yourself hauling to the post office in six months to send to some eBay mark you've spent weeks digging up, particularly since its success means there are follow-ups on the way. It's a king among peripheral games, using most people's underlying fascination with the hidden art of axe-wielding as a foil for delivering one of the best beatmatching games I've seen. As a party game, it's something that everyone will demand to get their hands on, or, at their most reserved, simply watch with great enthusiasm; as a beatmatching game it's a natural successor to Amplitude; even as a high-score game it hits some pretty high notes.And if there's one thing you ought to get out the biographical bits of this review, it's that you really, really don't need to have any guitar skill or ~rock pedigree~ to become a Guitar Hero. So you're fine, even if your life's as embarrassing as mine. Rock!"}