{"ref": "https://www.eurogamer.net/r-riddick-pc", "date": "6 Apr 2006", "game_name": "The Chronicles of Riddick: Escape from Butcher Bay - Developer's Cut", "text": "Order yours now from Simply Games.After a product receives almost blanket praise, you'd think consumers would get the message. ~Buy this game - it's great~. It's not a hard equation to understand, yet we scribe with withered hands almost ready to stand outside Game on Oxford Street with a megaphone barking at scores of unprepared consumers to justify their purchase. It could be fun, it could be stressful. It could result in a criminal record, as we're  dragged off to the nick by humourless drones. Someone should film it. It could be gaming's equivalent of Trigger Happy, only with a point. The point being that here we are writing about the abject failure of The Chronicles Of Riddick to sell for a second time, and it hurts. It hurts our faces, our minds and our fingers to note that Starbreeze's efforts haven't even warranted a Top 20 placing in the PC chart. People are rubbish. Ban them.To anyone who has played The Chronicles Of Riddick: Escape From Butcher Bay it seems like stating the bleedin' obvious to conclude that it's one of the best five games of the year. A bit short compared to some of the epic games we've played lately, but the ten hours of entertainment packed in are probably as concentrated as we've ever seen. Never a dull moment; rich, constantly varied and surprising, technically excellent, well crafted and feeling somehow more imaginative and forward looking than probably any game sporting a film licence ever. And yet thanks to the film's late summer tanking, nobody cares. Sometimes licences work against games, and here's an example if ever we've seen one.What's possibly even more annoying is that even if the Vin Diesel movie were the biggest sci-fi turkey of all time and you can't bear the arrogant growl of the man himself, the game's quality should be capable of consigning such irrational prejudices within minutes. Besides, the game actually has very little to do with the movie itself, being a prequel to the events of the Riddick 'universe', acting as the back-story to Pitch Black and shedding more light on how Richard B. Riddick acquired his ability to see in the dark, as well as providing endless insight into the depth of his chilling, remorseless contempt for just about everything and anyone. Nothing gets respect from Riddick; we reckon he probably beats himself up in his quieter moments just to prove his utter disgust for life itself. This is a man with issues.The game itself, as the title suggests, is all about Riddick's escape from Butcher Bay, the highest security prison in the galaxy. Delivered to this dark and ugly hellhole at the start of the game by a slimy and objectionable bounty hunter, it's up to you to work out how to get out, and it's not going to be pretty. Spliced together from bits of our favourite genres, one minute you're creeping around in the dark snapping guards' necks, the next engaging in dialogue with fellow cons to work your way up the prison pecking order, and probably smashing their faces in shortly afterwards to show them who's boss.For a game that at first glance looks like yet another dark and moody sci-fi shooter, you'll probably spend a decent portion of it wondering when you'll get to wield a gun for more than a few minutes, with most guns DNA-encoded to their owners and the source of a nasty electric shock should you try and use them. Hence, the game treats first-person shooting as a luxury, using it sparingly and making you use your wit and cunning to survive the rigours of Butcher Bay.It's a jarring approach initially, but as a result spectacularly atmospheric. Every guard, every con has a face, a personality, and rather than populate the game with a faceless succession of drones, much of your journey within Butcher Bay take place within believable confines against foes who you may well get the jump on eventually. Although the prison yard isn't the most intoxicating of environments, the sense of desperation is palpable, the graffiti tells you all you need to know, and the route to the next task is never far away. Although The Chronicles Of Riddick isn't much of a challenge on the default settings, it's rarely dull or frustrating, keeps tasks clear yet involving, and is one of those games that doesn't waste your time. For a time-poor gamer who wants to see all there is to see and be entertained for ten hours and move on, this is almost perfectly designed around those constraints.Others that wish to indulge in epics that have you sweating on tiny portions of the game just to move on might find it all a bit simplistic, but you can't please everyone. Having indulged in both recently, we can say both have their plusses and minuses; in a sense you can't really ever have both, but if you're hankering after bite-sized entertainment that's consistently rich throughout then there's few games that have ever been designed as tightly as Riddick.For a game that was designed exclusively to make the most of the Xbox, it's a major surprise just how smooth its transition to the PC really is. Graphically it remains the best use of Xbox tech we've seen, and what Starbreeze has essentially done is to smooth out the rough edges, beef up the textures, and generally deliver one of the most visually accomplished titles out there. Sure, it's scope and ambition wasn't to push the PC in the way that Doom III or Half-Life 2 have, but even taking that into account, it's hard not to be impressed by the spectacle. For those that have already bought the Xbox version it's a bit like seeing it in its best light. PC newcomers spoiled by the aforementioned titles won't be quite so impressed, but there's still plenty to admire, with superbly designed character models (Vin Diesel in particular is about as lifelike as anyone could expect) that - were they not so intent on standing in the same position in the prison yard - display a great deal of human properties.In terms of extras, the PC version does make a few intriguing changes that fans of the Xbox version will feel slightly put out about. The first of which, the 'director's commentary', is genuinely well realised, allowing gamers to walk through the game as if there was a member of Starbreeze on hand to let you know the reasoning for every minute design decision. This is no idle back-slapping documentary, but an entirely new way to play the game, with commentary tracks popping up in the game as objects which you can click on and listen to, giving much insight into why the game ended up the way it did, and an idea we can imagine a fair few other developers ripping off from now on.Elsewhere, a couple of new sections have been inserted which, although disappointingly brief, bring mech combat into play much earlier in the game, as opposed to leaving it until the very end. Fast and furious, it makes for an exceptionally entertaining interlude, and we have to say it only made us wish Starbreeze didn't tantalise us so. But, begrudgingly, the Swedish team's game works for the very reason that it doesn't dwell on one thing. It delivers bite-sized chunks that always leave us wanting more, and that's something we can barely credit any of our favourite games with.Aside from that it's a case of spot the difference between the PC and Xbox; and we're talking a small section with a player controlled Riot Guard, inmates with body armour ~and other defensive equipment~, a few new melee weapons and that's yer lot. There are justifiable calls for multiplayer, perhaps, but it's only perhaps because the market is used to FPS-related games always sporting such features as standard. Judged on its own merits it's a game that stands tall among any of its contemporaries and in many ways beats them at their own game. The PC version, admittedly, could have done with a few more extras than it has, but that's only because the Xbox version left us wanting more - this version will do just the same, but has the extra benefit of being the definitive way to experience one of the games of the year.Order yours now from Simply Games."}