{"ref": "https://www.eurogamer.net/r-ragdollkungfu-pc", "date": "5 Apr 2006", "game_name": "Rag Doll Kung Fu", "text": "Remember when you were a kid, and you had those crazy bendy-flap pin clip things? I've got a feeling they have a proper name, but I'm also fairly sure that they slip out of existence once you're past the age of 12, unless you become a primary school teacher when you're allowed to see them again, so it doesn't really matter. You'd push them through a hole in two bits of card, and then bend the two flaps of metal back against the flat surface, so the two were attached, but could rotate around. And of course you'd be doing this to make a little person with pose-able limbs. And then you could colour it in. Then it would be time for break, and you'd graze your knee. Which you never do any more. Not even primary school teachers still graze their knee. But what were primary schools doing covering their playgrounds with loose, sharp gravel? My theory: playgrounds were paid for by sticking plaster companies - an investment to ensure business stayed good. I'm on to you Elastoplast - your reign of tyranny against the patellae of the under-12s will soon come to an end.Rag Doll Kung Fu is a lot like that. Except without the colouring in. Or pretty much everything else. I'm only redeemed by the peculiar similarity of its characters' movement, with those-there cardboard figures.The project of Lionhead employee, Mark Healey, RDKF (which looks like it should be an internet abbreviation for something horribly insulting) is distributed via Valve's Steam, but it's important to stress has nothing other to do with Valve, or the Source engine. It's a completely independent work, sold using Valve's proposed publisher-frustrating distribution method, much the same as the extremely fine, and 4th most bestest game of 2005, Darwinia.There's no neat way to describe it. If I were Kieron, I'd probably say it's a ~post-Havok trope~ and then compare it to dancing... Wait a second! That's a point. RDKF is exactly like Kieron's dancing. It's the mad flinging of four limbs and a head, in a destructive, time-bending and strangely beautiful display.Using only the mouse, you click on a limb (or the head or bottom) with either the left or right mouse button, left to drag and move, right to direct an attack. Movement is, well: imagine a marionette, pivoted at all its joints, horribly, horribly drunk (also high from sniffing wood glue) crossed in a freakish genetic experiment (shush) with a crab. That's precisely how it moves. Apart from that it can also sort of fly.The notion is to beat up whatever else is on screen via this lunatic interaction, in a pastiche of a thousand terrible 1970's ninja films. With added Chi. Chi is necessary for both big jumps and any attacking, maintained by swirling the mouse in circles in any spare moments. Also, pots can be smashed to release bonus items, such as nunchakus, blades or throwing stars, which can then be swung madly at opponents. Mushrooms can be picked up from the ground and eaten (drag the hand to the mushroom to pick, drag the hand to the mouth to eat) in order to gain the temporary ability to fly. Butterflies can be captured in order to fire yellow electricity from your fingers. The usual stuff.The game begins with a sensible couple of tutorial levels, and then leaves any further education entirely optional via flashing signposts in the background. (Oh, if you could only have thought of this before Black & White 2, Mr Healey). But it's by no means easy. Control is entirely alien, or perhaps: new. But pleasingly, and in a rewarding way that I haven't experienced in a long while, you really do get better as you play. Obviously we all improve at games with practise, and earlier levels are far easier on replaying, but not quite so dramatically as the getting-to-grips-with process here. And pleasingly, this isn't because the game has drip-fed you new abilities as you go along - go back to the first levels, and you can perform everything you've learned since, and feel a bit more masterful.However, that doesn't mean it ever becomes instinctive, or even all that satisfying. Which is surprising. The erratic nature of your character's flinging across the screen never seems to feel quite right, and mushroom flying - with its warped time - doesn't give you the pleasure of knowing you're in control. While it becomes easier to conduct fights (at the start it seems impossible that you'll ever be able move into the right place, click on the correct limb, and execute the attack, while dodging explosions and maintaining chi), it never quite works properly, with attacks failing a good 30 per cent of the time for unfathomable reasons.So while it's nice when you manage to turn in mid-air, execute a flying kick, and then rebound away in time to avoid the flash of lightning, you're aware that it wasn't because of your elite skills, but more that it didn't go wrong that time.It looks splendid. It's not in 2D, but it's not in 3D either, and the way you can zoom in and out of the action, having the camera delving through long grass, or past the ridiculously detailed and lifelike leaves of a tree, onto the gurning cartoon face of your avatar, means you can't settle for something smug like 2.5D. So instead I'm going to call it QD, and we'll all just have to accept that.Special effects glow beautifully, and things sparkle, twinkle or explode splendidly. If it looks like anything, I'd suggest a hybrid between nature photography and Paper Mario 2. While clearly the physics and the non-scripted animation are meant to be the focus, the real achievements appear in the graphics. They are like nothing else.Betwixt the levels are snippets of a spoof Ninja film, made by Mark Healey and his chums. It's authentic looking, and extremely silly, with deliberately abysmal special effects. And I swear it was filmed at Sheapleas - a wooded area near Guildford that was excellent for childhood games of Frisbee. This is all extra-fun, right up until the script.Despite the soundtrack featuring what might well be Japanese, or maybe just mad Oriental shouting, the subtitling looks as if it were written by a group of 14-year-old boys. Yes, it's funny to have the dead-serious looking ninja say, ~my arse hurts~ once. But every single line uses the same notion that juxtaposition will always be funny. Here's the thing: it's not juxtaposition when it's the entirety of the script. ~Let's do some ninja shit!~ might have been nice as a surprise line. Ten seconds after ~Wise master say, 'do not dance like a tit'~ and a dozen other lines the same, it's woeful.And no, this doesn't matter much, and yes, it can be immediately skipped, but it does imply the amateur vibe that appears throughout. The menus are extremely tacky, the OSD is tatty, and there's a large lack of polish throughout. Of course, as a weekend project, banged together by Healey and his mates in their spare time, it's all fine. The problem occurs the moment they start charging money for it. It's only $14.95 (about £8), so an almost throwaway amount. But still, it's harder to forgive the scrappy nature as soon as you've parted with cash.The main game itself doesn't last much longer than three hours on a first run through. But that's somewhat deceptive. The imperative of receiving bonuses for completing levels in a certain time can soon be ignored, and instead time can be taken searching for bonuses. These unlock mini-games, such as a bizarre football game, each of which use the nature of the engine in a different environment. There are about ten of these to find, each with their own set of levels to play through, swelling the game up to about ten times the size. And then of course you can take the whole thing online, and play against the people who live in the internet. Oddly, this is the least satisfying mode of play, possibly because every human you oppose is struggling with the madness of the controls as much as you. It's all very ungainly.Back and forth I've gone, this is good, but this is bad, this works well, but this does not. What a to-do. It's deliberately an amateur product, but it's annoying to pay for that. It's inspired and wholly original, but it's over-complicated and frustrating. It's fun to play, but it becomes quickly irritating.My mark has fluctuated all over the place. At one point I wanted to give it 5, but then it's so interesting, and so daft, and so inspired, and it was far too low. I was tempted by 6, because, well it compromised. And then I tried to give it Q/10, but Tom wouldn't let me. So then it ended up on 7, because hell, it's fun. But for a really short time. Oh, so maybe it should be 6. But no, that still feels wrong. It's still 7outof10 good. Look, here's the deal: It's 7/10, ok, and we'll settle on that. But those lost 3/10 are really big numbers, drawn with a thick, black pen, and then underlined twice."}