{"ref": "https://www.eurogamer.net/r-katamaridamacy-ps2", "date": "30 Mar 2006", "game_name": "Katamari Damacy", "text": "'No' is actually a longer word than 'Yes'. You know, my biggest fear whenever I'm ploughing my Euro-dollar into new toys from Japan is that my frankly negligible grasp of the local dialect - very much summed up in that first sentence - will leave me floundering somewhere not so far beyond the title screen. In the case of Katamari Damacy however, I had no trouble getting my head round things - mostly because the game's only real concern is getting other people's heads wrapped around me.It also helps that deciphering the plot and understanding the motivations of the characters is probably something that eludes even the Japanese, let alone gawping gaijin such as myself. As far as I can make out - aided somewhat by clever-clogs types elsewhere on the Net who've clearly cheated and done some actual research - the King of Space has gone out and got thoroughly rat-arsed and lost all the stars in the sky, and it's up to you, his son and heir, to build new stars to replace them - by rolling a ball around little 3D environments on earth gathering up the local flora and fauna.You start off by controlling a tiny little ball just a few centimetres across, and as you roll it around the top of a dining table clobbering things, small objects like pins, buttons and the like will cling onto it. As they do, the ball gradually increases in size - the current diameter indicated in the top-left of the screen - and as it reaches certain untold thresholds it becomes capable of gathering larger and larger objects, like rubbers, pencils, cutlery, and even plates. Each 'level' generally tasks you with reaching a certain size within a certain time limit (apart from a few sub-levels which focus on crabs and things), and by the end of the game you've moved out of the dining room and tower above the streets themselves, tugging hot-air balloons out of the sky and yanking football stadiums clear of their foundations.Controlling the ball takes a little getting used to, but the game's seemingly bizarre decision to use both analogue sticks in a sort of tank-tracks configuration - rather than using the left stick exclusively to direct things - ultimately adds to its charm rather than throwing up an unnecessary obstacle. There are a couple of other moves that go some way to explaining this - jumping to the other side of the ball, and dashing a short way at high speed - but in general it just feels right for the sort of carefully thought out, physical world that Katamari Damacy holds dear.However, after much thought, what stands out as most impressive is the sense of logic behind the game. As you tumble around, you'll discover that it pays attention to weight as well as size - a T-shirt hanging out to dry might be easier to grab than a weighty flowerpot resting in a porch, for example, despite the T-shirt proving larger than the flowerpot. And when the heavily starched garment sticks to your ball, its peculiar shape changes its physical behaviour, much like a pencil would if it were thrust through the centre of a tennis ball. The sense of physicality and growing inertia is very finely judged.That said, there's so much more about Katamari Damacy that intoxicates and enthrals that we could very well be here all day hoping to make sense of it. For a start it's relentlessly happy, it uses ingenious scaling graphical technology, there's a wonderful difficulty curve that really throws up a challenge instead of just relying on the increasing novelty to keep momentum, the soundtrack is genuinely outstanding, and it's universally appealing - so much so that I had to move house just to spend some time alone with it...It really is a constant joy. Every time you increase in size, the game world remains the same around you and you're simply able to pick up more and more objects. To give you an example - you start off tottering around the dining table picking up odds and sods, but before long you've grown to such an extent that you're picking up the table itself, the chair, a nearby clothes rack, and busting through sliding doors into the garden where you pluck plants and trowels from the ground, golf balls from the end of a man's club, and even get to chase the cat.However you have to be careful around creatures like the cat, and the bloke playing golf, because if your ball takes a significant whack from something that much bigger then you'll find it sheds some of its outer layer. Never mind though, because once you've grown the ball by gathering items in another area of the level - perhaps collecting apples from bushes and the heftier condiments from the dining room - you can come back and take revenge, whacking the cat once to daze it, and then racing towards it and watching it flail as it creeps over the summit of the rolling ball mewing helplessly. The same process applies to other animals, humans, cars... and lots of other increasingly exciting objects. Cleverly though, when you're that much bigger than them you no longer have to daze them any more - and new and larger prey requires the two-hit approach instead.And yes, that does mean that your ball grows way beyond the boundaries of the dining room and back garden of a Japanese home. In fact, the world you're rolling around is ingeniously designed so that you can move into different areas and find different ways to increase size quickly, and then with a certain amount of forethought return to older areas and collect larger objects. At a certain size you can, for example, escape out of the garden and roll down a hill into town, where you can terrorise farmers, tradesmen in the town centre and even people and vehicles, but once you reach a certain point you're much too large to get back into the garden and pick up the larger objects you missed. Later you might move out of a park and then find you can't fit back in through the gates until you're big enough to actually incorporate them into your ball. It's a fine balance, and despite splitting the game into stages, the developer has somehow managed to maintain the sense of constant growth - and an attachment between locations.Key to this, to a great extent, is the fascinating graphical engine at the heart of the game, which scales in such a manner that suddenly being able to pick up the building you were previously rolling around in is never less than seamless, and never forces the PlayStation 2 to shudder under the strain. Graphically you could call the game basic - its square-edged objects and pastel/primary shades never really elicit the sort of stunned gasps that so-called next-generation games generally do - but at the same it fosters a quiet admiration and a large degree of affection in the player.In fact, you could simply call it ~typically wacky Japanese fare~ or something of the sort, but that would be a copout. It maintains a high level of detail in a low-poly world by building up engaging environments out of base elements that never exceed the engine's capabilities - and uses a nice depth-of-field effect to efficiently mask any dip in polycount. And the fact that it does all this whilst retaining a sort of unique stylistic charm is commendable - as a result, each environment is comfortingly consistent and instead of gasping with disbelief at graphical showboating you'll be chirping with delight as your eyes fix on something like a flower clock with individual hands and numbers that can be picked up, or a schoolyard full of children waiting to be assimilated into your latest star.If you were to ask me what made the game most appealing though, it wouldn't be the visual style, the scaling or the giggly sound effects, nor the way that you're running away from policemen with guns one minute and they're running away from you the next. No - what sums Katamari Damacy's appeal up for me is the sense of unbridled joy bursting from every pore. It's the happiest game I've ever played, and the happiness is infectious. Everything taken on its own is exciting enough - the soundtrack, for example, is so engaging and memorable that it more than warrants your money separately. But when it's united with everything else here, it's a shot of pure oxygen to the jaded brain - a harmony of pleasures that left me welling up inside - and one of the most universally appealing games I've ever come into contact with.Not since the long-gone days of my youth can I remember a game attracting such interest and admiration from chance observers without relying on some new technical wizardry or superstar franchise to do so. ~Roll over the car!~ ~Get the elephant!~ ~What about the boat!?~ ~Quick! Time's running out! Get the plants! GET THE PLANTS!~ First sight of each new object, however ordinary, becomes cause for ecstatic levels of excitement, and each new attachment leaves a crowded room shuddering under the weight of uproarious laughter and blinding smiles. Imagine how excited they were when I mentioned the two-player mode...For that reason alone it ought to be worthy of your money, but for so many more it ought to transcend its ~cult classic~ status and become one of the most fondly remembered games of this generation. We only hope Namco takes notice of the critical reaction and the excitement it caused at E3 this year and rolls Katamari Damacy around the globe to sate us all."}