{"ref": "https://www.eurogamer.net/ir-silenthill4-ps2", "date": "29 Mar 2006", "game_name": "Silent Hill 4: The Room", "text": "It's not a difficult concept to get your head around. There's a place called Silent Hill. It's a foggy old place with a lake, and no-one lives there anymore. A whole lot of weird nonsense going on. People keep returning there for various deluded reasons and end up encountering similarly deluded, confused and depressed people along the way. To put it mildly the events are inexplicable, yet the stories are intelligently constructed, the puzzles are logical and satisfying, and the combat's scary enough without providing too much of an unnecessary irritation. To date, all the Silent Hill games have been the benchmark for an adventure scene that has long since given way to action at the expense of a more cerebral narrative and puzzle-led experience.The quick-fire arrival of the fourth, however, is only tenuously linked to the events of the trilogy that preceded it, and in many significant respects a big departure for the series. Originally conceived as a spin-off (and arguably should have stayed that way), it's actually not based in Silent Hill at all, but a similarly warped neighbouring town called South Ashfield - a bustling urban environment complete with tower blocks, underground metro and tiny apartments where the kitchen shares your living room space.Lead character Henry Townshend lives in such an apartment. Room 302, in fact. And for the five days leading up to the start of the game he's been locked in, unable to get out or get help. This time you're not wandering around looking for a lost love or trying to work out why a strange old man keeps appearing, but trying to solve something of a murder mystery - alongside your general quest to get the hell out.At first, the game appears keen to break away from the past, displaying the proceedings from a first-person view, but once a man-sized hole appears in your bathroom the game switches to the more familiar third-person viewpoint and familiar habits return to remind you what you're dealing with; strange mutated creatures with something against you, exploration, occasional puzzles and our old friends the locked door, scarce ammo and limited inventory capacity.Very soon, though, you're back in your flat, and it soon become apparent that your shoebox abode is little more than the game's central hub. You can save your game here (in fact it's the only place), deposit objects into a chest, as well as recharge your health and receive dozens of notes pushed under the door to move the story on to being an ongoing investigation into a troubled orphan named Walter Sullivan and why Room 302 is so important to him.Silent Hill has never been afraid to tackle unusual subjects, and The Room delights in its obsession with another harrowing subject, never shying away from the pain, misery, confusion and eventually the madness of being abandoned at birth. Suffice to say that Walter doesn't want to forgive and forget - he finds his own answers and his actions have pretty extreme consequences, just as you'd hope from a Silent Hill game.In comparison to other games, it's a fairly surreal template for the developer, and much of the time the team goes to town with its desire to create an oppressive, menacing environment, that's every bit as putrid, dark, dank and ramshackle as it can be. By necessity the game follows a rigidly linear progression through six reasonably large environments, some of which fans of the series will instantly feel familiar with; the forest, the hospital, the apartments, and so on. For the most part, it's a case of finding your way out of each, avoiding or killing every aggressor you meet, gathering all the random tat you can, putting objects in their requisite home and making a few trips back to the flat along the way.For the first half of a game we spent ten hours completing (that's game time, not taking into account failed attempts and other time wasting activity) you'll have a fine time unravelling the story and exploring a set of oppressive, disgusting environments, killing everything from long-tongued zombie dogs to two-headed hand-walking mutants and an annoying array of deadly floating spirit madmen.One of the more disappointing elements of the game is combat. By the end of the game we'd battered some 444 of this army of evil minions to death, and frankly wished it wasn't such as necessary component. Although this time you can charge up attacks and quickly evade, it still feels clumsy, bolted on, and provides no more than filler material in truth. From the first zombie dog to the last encounter, it never feels more than a minor obstacle, providing only a cursory challenge, with almost all your foes defeatable with a baseball bat. The occasional golf club might provide a bit more reach and power, but are broken so quickly as to be practically useless for more than a couple of encounters.In terms of firearms, you have the pistol, or the more powerful Revolver. Ammo for the former is easy enough to stockpile, and incredibly scarce in the latter case, but given that we defeated even the final boss with a mere baseball bat (on Normal difficulty) tells you something about what kind of challenge Konami has set for you. Accessible it may be, but it's feels repetitive very quickly and upping the combat quotient feels unnecessary when the limited array of enemies and their predictable fight styles offer little more than a means of wasting more of your time.What also feels apparent is that Konami has ripped out most of the puzzle solving from the guts of The Room - one of the main triumphs of the series to date as far as this reviewer is concerned. In the whole game, we were stuck for no more than a few minutes at a time, forced to go on nothing more than object hunts, with objectives so obvious that solving them offered little more than the pleasant satisfaction of being able to move on. Everything, even the cell rotation puzzle in the Water Prison, is so explicitly spelled out for you that the only thing that can trip you up is the occasional tendency for the game to place necessary objects in obscure places. This lack of cerebral involvement isn't enough to completely undermine what the game is trying to do, but in no way does it improve matters.You might not realise it when you're playing it, but having completed it, it becomes apparent that the game really asks little more than to defeat its fairly hapless or annoying enemies, find objects and return them to where it's obvious they should go. Is it dumbed down? In terms of the storyline, no. The writing, voice acting and cut-scenes are still well up to the standard that they ever were, with the talent for creating a compelling yarn with enigmatic characters as much of a draw as ever. But, outside of the desire to find out more of the story, it's by far the least testing of all the Silent Hill games, and one that does everything it can to make sure it is.Perhaps the most alarming decision, and something of a cheap gameplay extending mechanic, is to recycle four out of the six first half locations without changing them in any way. A fifth is also re-used, but at least they bother to radically alter key aspects of it. Part of the fun of survival horror games is the exploration aspect, and to take that away from the player is to reduce the feeling of momentum, lessen the motivation to carry on and make the game feel padded out for no obvious reason. You could argue that survival horror games often throw in added extras to make people play through them again anyway. Perhaps actually including that replay as an integral element of the game is a smart move, but however hard we tried to let Konami off the hook, we just felt let down - thirsting for all new environments to immerse ourselves deeper into the story, not one which we'd already seen.To compound the disappointment of unnecessary and uninspired combat and the repeat prescription of locations, we were also beaten around the head by a flawed inventory system. With just eight slots at your disposal, once you've armed yourself and picked up a few clips and health items you're more than likely unable to pick up anything else, meaning an often lengthy trawl back to the Room to drop off whatever you can. It wouldn't be such an issue, but any game of this nature that deems two identical ammo clips or health packs should take up more than one slot is asking for the wrath of its fans. Worse still, you can't even drop objects at all (except in the aforementioned chest in your room), while if you've got a full inventory the game won't let you know what it is that you can't pick up, merely protesting that 'you can't carry any more'. Seriously, such pig headed, bloody-minded gaming mechanics were crap in the 8-bit era. They physically hurt now. Less irritating, but still a minor annoyance, is only being able to save in the main hub area. You probably waste at least 20 per cent of your playing time just to-ing and fro-ing because of someone's bizarre design decision.But survival horror fans normally have a thick skin and endless reserves of patience, so it's unlikely many of these criticisms will detract too seriously from the experience. On a positive note, the audio-visual side of The Room is once again a fabulous testament to the talent at Konami, combining ethereal industrial groans of death with whatever sinister tortured animal whines it can come up with to upset our constitution. Actual music (apart from the deranged attract music) is sparse and minimalist, but the subtle changes in mood between areas works well to charge the atmosphere, and there's no game quite like it for generating that pit of your stomach dread as you march through yet another doom-laden environment.Visually, it's trademark Silent Hill, pulling off the same grainy filter effects that marked out the previous two as being truly unique. Every location is packed with detail and although most of them don't have a lot going on in them in real terms save for the odd one-line description (or some that just pure pointless padding), there's still an overall sense of a job well done. Had it chosen some more imaginative locations, and not just repeated the usual hospital/underground station/apartment formula we'd be a little more liberal with our praise.As it stands though, apart from the initial spirit of adventure, a fine storyline and the usual disturbing atmosphere, there's the inescapable conclusion that the series has somehow gone backwards in several ways. Removing puzzles as a key component is frankly an astonishing decision after the triumphs of the past; why on earth not just offer puzzle difficulty like before, giving those who prefer action over adventuring the choice to dumb it down if they want? It seems that upping the combat quotient has been Konami's answer, as if more predictable drones stumbling towards you is in some way compensation for having to think, but the final insult to any Silent Hill fan's commitment to the cause is to rehash the game's locations. Not only does the game go downhill as a result, but it's a cynical, lazy means of extending the lifespan. So how is it, then, that The Room is still a nigh-on-essential purchase for fans of the series? There's no doubt that it's not as good as previous versions, but this simple acknowledgment shouldn't make it automatic write off. For a start it's still a fine yarn, and one you'll want to stick with. What other series covers personal pain and torment without making it feel like clichéd B-movie ham? The ongoing state of unease that Silent Hill continues to purvey still makes it a worthwhile exercise, even if it appears that some of the people responsible for the gameplay design have taken their eye off the ball, possibly in some misguided attempt to make it appeal to a wider audience.Purists will be dismayed at some of the questionable decisions Konami has made in what ought to be one of the best games of the year, but it remains enjoyable enough in its own right to warrant keeping the faith for now. The inescapable truth for Konami is that it has not just failed to better itself, but has gone backwards to the extent that it's no longer our favourite horror series (Project Zero 2 claims that throne for now). Fortunately for the fans though, there's still nothing quite like it, and The Room warrants investigation for that reason alone.As a final footnote, it's worth considering that the Japanese version of Silent Hill: The Room is playable entirely in English. The PAL version is available at some point in September, with Xbox and PC versions arriving alongside the PS2 version."}