{"ref": "https://www.eurogamer.net/r-silenthill4-x", "date": "29 Mar 2006", "game_name": "Silent Hill 4: The Room", "text": "Order yours now from Simply Games.Tinkering with a well loved formula is a tricky business. Ever tucked into a 'New and Improved!!' chocolate bar and longed for the familiar taste that you've loved for years? You might still like it, and you might even still buy it, but you can't for the life of you work out why the manufacturer would break something that didn't need fixing in the first place. That's essentially the problem with Silent Hill: The Room; Konami felt that what we really needed was a more action oriented, less puzzle driven survival horror adventure. The trouble with that approach is that upping the combat while taking away the puzzling turns it into a completely different game that - while on the surface - still looks like a Silent Hill game radically shifts the emphasis in the largely undesirable direction of awkward hackandslash.The premise is very promising, though. Foppish twentysomething Henry Townshend has lived quite happily in Room 302 (the original title of the game) for the last few years in the grey suburban town of South Ashfield (we never find out what he does for a living). Suddenly, Henry starts having vivid nightmares and finds himself trapped inside with seemingly no way out, the door chained up from the inside, the windows sealed, the TV signal on the blink and only some chocolate milk and a bottle of wine to keep him going. At this point the game kicks in, and for the first few minutes you wander around your tiny abode in a slightly claustrophobic first person mode. The phone rings (even though it's not plugged in), we hear scary analogue modem-style noises on the other end, there's a mark on your living room wall that looks like a face and before long you discover a massive hole in the bathroom. With no choice but to crawl into the long tunnel you commence a series of other worldly excursions to places that seem real, but appear to be no more than an extension of Henry's vivid dreams.But as Henry explores the outside 'other' world (seen from the third person) he ventures through a subway, forest, prison, bar, hospital and apartment building itself, slowly unravelling the truth of Room 302 along the way - in particular the troubled life of former 302 occupant Walter Sullivan, who has a peculiar 'attachment' to the place for reasons we won't spoil for the potential player (but are as disturbing and surreal as we've come to expect from the series). As a yarn, it's typically bonkers Silent Hill fayre, and without question the game's saving grace. Told via the a mixture of well-voiced cut-scenes and red notes pushed under your front door, it's an excellent narrative device to keep dragging you through what might otherwise strike you as quite frustrating hackandslash slog against some pretty bizarre creatures of the damned.It's never made entirely clear who these vile creatures are, or what relationship to Walter Sullivan they have, but along the way you encounter some warped creations. Two-headed hand-walking baby-faced goons, long-tongued lizard-skinned dogs, floating unkillable spirits, sharp-taloned wall-snatchers that swipe you as you go past, giant purple-blooded insects, oozing slugs, long thin vertical tendrils and even a shotgun wielding Walter towards the end. It's probably best not to think too deeply about who they are or why they're there, but if we accept that it's a series tradition to have randomly silly enemies whose sole existence is to scare the bejesus out of us then we'll tolerate their presence and move on.The presence of enemies in previous Silent Hills was usually a scare device; put there to up the tension and add the necessary ingredient of survival and horror. The Room, though, goes much further, upping the enemy count quite significantly as a means of delivering a more action focused experience. The combat system, as a result, has been given a minor overhaul in allowing the player to charge up attacks by holding down the button first before releasing it, giving you extra swing at the risk of leaving yourself open to attack. Most enemies in the game can be whacked down with sticks or the many golf clubs lying around - or, better still, shot - along with the traditional stomp on the head to make sure they're properly dead. For all the tweaks, it's still not the most graceful system, with many of your attacks missing arbitrarily, and some of the enemies attack patterns not exactly predictable. The most frustrating element though is the appearance of spirit enemies that can't die and simply get on your case while you're trying hard to simply look for clues and objects. Get embroiled in a tussle for too long and you'll find a Game Over screen will soon result, but the regular appearance of portals back to the 'hub' of your apartment allow you to recharge your health for free - at least for the majority of the game.On balance, what was once a sideshow of Silent Hill becomes almost the main event, with much of your playtime devoted to seeing off an endless posse of determined foes. The ones you can kill you don't mind so much about, but later in the game when the ante is well and truly upped, the last thing you want to have to do is constantly backtrack because some git has killed you with one hit. But alas, that's the way the game designers wanted it to be - a more action focused affair. But at what cost? We wouldn't mind so much if the game still delivered elsewhere, but it's apparent that the main sacrifice has been the puzzles, which are now well down the pecking order in terms of priorities. For much, if not most of The Room, you're simply tasked with going on a series of mini treasure hunts in order to unlock a door.On a few memorable occasions (such as the prison puzzle) you're actually forced to engage your brain into reading clues and acting on them, but far too much of the rest of the game leads you into a simple map trawling exercise, picking up a set number of items and returning them to their destination alive, having fought your way through. It's satisfying to be fed the next snatch of narrative, but nowhere near as satisfying as it used to be. And if you thought the puzzles would also be harder on the Hard difficulty setting, they're not. They're exactly the same. Quite why Konami decided to ditch the absolutely genius idea of being able to set your combat and puzzle difficulty independently is anyone's guess. Lack of time? Who knows? The net result is that the game as a whole is far worse off without it and Konami would be well advised to try and broaden the game's appeal by keeping brilliant features in, not dropping them.The visual appeal of the game, while still charming in its own way, is definitely starting to date. When Silent Hill 2 - the finest in the series - made its debut three years back it was in a class of its on with its stylish, gritty look. The Xbox version is without doubt a little cleaner than the PS2 (particularly if you're lucky enough to have a prog scan enabled US version), but in all other respects it's functionally identical. At this point in the series, though, things haven't really moved on in any particularly discernable way. In a sense it's stuck in a little bit of a rut; as can happen to games using the same engine midway through a machine's life cycle. The use of a first-person view is the one area where there has been some experimentation, but even then it feels a little odd next to a true first-person game; it's sluggish, confined and seems to serve little purpose other than storage, save game and health recharge hub. As a result the constant need to revisit your apartment (even when you don't really want to) grates after a while, especially when it's purely down to the irritating fact that there's only eight inventory slots and you've used all yours up collecting another health drink.It's a shame to reflect on The Room as a disappointment, but the second run through merely serves to highlight that it's the weakest of the series by a long way, and an ill-judged attempt to drag a narrative driven adventure game into the realms of sub hackandslash by removing much of the actual thinking and forcing the player to engage in less than challenging puzzles while foisting repetitive and unengaging combat upon them. The issue is, The Room's combat is too clumsy to be of interest to more action-oriented gamers, and too much of a chore for those already ensconced in the series. The Room was never even meant to be a Silent Hill game - that's plain enough given that it's not even set in Silent Hill - but to learn that the project formerly known as Room 302 was shoehorned into the series later says a lot about its suitability to be associated with the other games. As a spin-off, standalone game it's not a bad one, but to judge it alongside the other Silent Hill games it pales by comparison. Fans of the series won't be devastated by The Room, but they'll definitely wonder what went wrong.Order yours now from Simply Games."}