{"ref": "https://www.eurogamer.net/r-secondsight-pc", "date": "29 Mar 2006", "game_name": "Second Sight", "text": "Shop for games now with Simply Games.Second Sight on consoles was very nearly love at first sight. Waking up in a military installation and gradually discovering and making use of your latent psychic powers is a good idea anyway, but being able to dive back into your own memories - playing them out as little vignettes, gradually unravelling the back-story and altering events in the present - is destined to be engrossing and thought-provoking stuff if handled correctly. Which, on PS2, Xbox and GameCube, it generally was. Were it not for Midway's marginally superior Psi-Ops, released at more or less the same time, and Half-Life 2 quickly raising the bar in terms of, well, raising bars and throwing them at people, it would have been even more fondly remembered.But unfortunate scheduling coincidences cannot be blamed for the failings of the recently released PC version, which decides to combat the threat of Psi-Ops (also out on the PC now), the physics tricks that Valve put over it two months after its console release, and its PC-specific competition like Max Payne, by doing a totally cack-handed job of translating the controls to keyboard and mouse and instructing the camera to continually bob around, look the wrong way and refuse to budge when it's most important to see what's going on. Typically forcing you to make yourself visible to patrolling guards in order to work out where they are at all.The controls are an immediate stumbling block, and we never quite regained our balance. During the early sections we should have been engrossed by the mystery of John Vattic, who wakes up in a facility heavily bandaged, plugged full of needles and seemingly capable of moving objects with his mind alone. Instead we were constantly quitting out of the game trying to get the mouse sensitivity right and then restarting. At maximum sensitivity it's far from optimal, and even with a combination of WSAD and mouse you can never rely on the camera to behave itself autonomously. The lock-on suffers too, scooting between targets as you thrash the mouse around the mouse pad in frustration; a problem compounded by the need for the game to let you lock onto inanimate objects just as frequently as enemies.Worse, our attempts to switch to a joypad for control soon proved impossible. Even remapping keyboard letters to joypad buttons to make up for the lack of direct in-game support and then painstakingly arranging inputs in-game to match couldn't help us figure out analogue control - an absolute must for the camera at least - and eventually saw us return to the keyboard and mouse with tail between legs. And went in and out and in and out until we got those right again.Not letting you access control options without quitting out of the game and back into the main menus is ridiculous enough, but it did at least help to highlight some rather arbitrary design decisions. Were it not for our flailing between menu and game early on, for example, we wouldn't be able to criticise the way that it's possible to make it to the elevator at the end of the first section and then discover it won't activate until you've used your melee attacks to take down two patrolling guards. We didn't think we had to; they scampered off and hid when they saw us lifting barrels with our minds, so why should we have to go and put the boot in just to trigger the level transition?Things do pick up after that. Wrestle yourself into a state of truce with the awkward control scheme and the following sections that mix in stealth - making use of Vattic's unique arsenal of psychic powers, which include the ability to become temporarily invisible, to kill enemies with a psychic blast, to heal himself and more - as well as sniping, puzzling and what the yanks might term ~balls-out action~ unfold in a relatively satisfying manner. But there's always that worry about the controls, and we often found ourselves playing in a deliberately peaceable manner despite our own latent urge to kick people's heads in.Not that we were always inconvenienced by the control system's failings, because there were several times when the stupidity of the AI enemies came to our rescue. Trying to get to the car park to pinch an escape vehicle early on, for example, we had to negotiate a series of upward ramps, dodging stationary guards waiting to take pot shots at us. Careful use of the invisibility skill soon saw to that, but we also owe the guards' lack of common sense. As a rule of thumb, guardy-types, when your mate round the corner is yelling and firing at roughly where you're standing, it means there's a barely cloaked escaped prisoner in the vicinity. In this case, right behind your back waiting for the invisibility to recharge. Don't look round or anything though; the threat is clearly coming from the downward ramp in front of you...Fortunately for those of us struggling along with the PC version's failings, the plot develops in an interesting way as Vattic tries to trace his past through his memories, reliving the circumstances that brought him - a scientist sceptical of psychic powers - into the midst of a complicated conspiracy, and the way it develops is particularly interesting. We liked the idea of remembering someone, finding out they were dead, saving them in the past with some carefully managed dramatic irony and then racing off to try and find them again in the present and join the dots. Just as we liked some of the level design, which draws on troubling themes and proves to be rich with extra bits and pieces for those willing to explore - like a shotgun hidden in a toolshed that you'll only find if you can use your telekinesis to summon a distant key from a rooftop. It's not storytelling to trouble the average RPG maker, but it's as good as most of the films you'll happily watch on a Friday night with some beer and pizza in tow.But when it's such a chore to control, and those controls and that camera regularly conspire to chuck you back to the last of the level's checkpoints, Second Sight can feel like it's all for nought - and there's no question that there are plenty of equally mysterious third-person action games already available on the PC, and a great many more serious narrative-driven titles across a multitude of genres. Most of which can be had for less than a tenner, in fact, and probably look and feel just as accomplished as Free Radical's neatly stylised but creaky PC conversion.Second Sight is undoubtedly a good game with a wealth of good ideas. From the premise and storytelling (complete with satisfying conclusion), through clever mechanics like a sniper zoom that takes over a corner of the screen rather than the whole thing, and an array of psychic abilities that allow for some unique puzzling, there are plenty of moments that demonstrate the developer's skill and inventiveness. But, sadly, neither of those are traits borne out by the rusty PC mechanics. If you like the sound of Second Sight, make sure you play it on a console. It is possible, we suppose, that you might get on with the PC version, but in truth we just can't see it.Shop for games now with Simply Games."}