{"ref": "https://www.eurogamer.net/r-secondsight-x", "date": "29 Mar 2006", "game_name": "Second Sight", "text": "Order yours now from Simply Games.Mind games. John Lennon once sung winsomely about them. Women are past masters at the them. Now suddenly it's the game du jour, with every sod under the sun is making videogames about scary men with telekinetic powers. What's that all about? Did Midway and Free Radical get mullered one night at GDC two years ago and have a pissing contest about who could make the best one? How else do you explain the almost simultaneous arrival of two games that are almost identical in concept? Co-incidence? They don't get much bigger than this - or perhaps a psychic designer simply scanned the minds of rival teams until finally discovering the best-sounding idea. Perhaps it was theft? Goodness knows, but it's bizarre, anyway, that this reviewer suddenly finds himself chief TK gamer. [No it isn't. In both cases you hid the code so only you could write about it. -Ed]But as much as we'd like to secretly believe that we're storing up some latent psychic ability that we'll unleash upon the ne'er-do-wells in later life, the truth is, we're just another bunch of ten-percenters that remain clueless, therefore defaulting to scepticism. Until we're proven hopelessly wrong, as usual, at which point we cough and mutter about psynaptic congestion. It's just easier to rubbish things you haven't experienced and just get on with talking smack instead, finishing each other's sentences, whistle the songs currently playing in someone else's head, or pass over the very item the person next to you was about to ask for.Bespectacled Gordon Freeman-alike John Vattic didn't ask for any of this. Second Sight's lead character wakes up from coma with absolutely no clue as to who his is, why he's in a medical facility, or why everyone there seems to fear him. Much like Psi-Ops' Nick Scryer, Vattic's amnesia gives Free Radical the chance to tell the story in flashback as you find out just how he ended up in such a muddle. Predictably, your first task is simply to get the hell out of captivity and try and work out who's behind this injustice, and just why everyone you encounter shoots on sight. How could you be considered so dangerous?Benefiting from a far more cohesive plot, and more believable cast of characters than Psi-Ops', Second Sight switches between past and present over the course of 17 missions, but it quickly transpires that your  'present' is merely a potential future - the consequence of failing your 'past' - and the real deal is to make sure that the things that could go wrong during a covert investigation into the activities of Russian scientist Grienko don't go wrong.Accompanying the WinterICE team to Siberia, Vattic plays the reluctant hero as it transpires that Grienko and co. are experimenting in the harnessing of Psychic Powers. Naturally, Vattic doesn't believe such bunkum, that is, until he himself realises that he's blessed with all manner of Psychokinetic powers. In traditional fashion, your powers arrive via various awakenings. Telekinesis comes as standard in the 'present', which to begin with merely allows you to pick up and hurl objects, or remotely push switches and pull levers, while Heal grants you the phenomenally useful skill of being able to administer first aid, so long as you have psychic energy to draw upon.At this point Second Sight begins to rapidly differentiate itself away from Psi-Ops' traditional health pack system, while Psi energy rapidly recharges by default, with no need to draw it from others. Another key difference emerges when it's apparent that Second Sight plays much more to the rules of a traditional stealth game, complete with a homage to MGS including hiding in cupboards with peep holes, and the initially annoying respawning guards. Until you realise that you can't play Second Sight like a pure action game, you'll constantly face ludicrous battles against a sea of relentless drones. Rather than the confront and defeat tactics used in Psi-Ops, SS refuses to budge an inch once you've set off an alarm, and until you can find a suitable hiding place you're effectively under siege.While this can seem both bizarre, unfair, unrealistic and an utterly old school gameplay mechanic that's effectively cheating, once you're blessed with a decent variety of abilities and weaponry and grudgingly accept the way the game wants you to play, the means of stealth and attack are engaging, with Free Radical's trademark grasp of superb control system making the process eventually as thrilling as you'd hope and expect from such a prestigious developer.But for a while, the Vattic of the past has to go through basic stealth training, which is as tedious as you might fear. Even with firearms, the initial missions, including the tedious training displays of a curious lack of ambition. When you're faced with just the basic pistol/shotgun/assault rifle/machine gun/sniper rifle line-up (no grenades here, sir), and generic stealth mechanics, things don't look good. After the initially useless (and eventually devastating) Psi Attack get added to your skills, Second Sight feels utterly devoid of charm. When your next skill is, in fact, Charm, things slowly start to perk up - allowing Vattic to creep past patrols unseen, thus making it easier to avoid the attack of the clones that results from alerting enemies to your presence.Around about the fourth mission, things improve at a pace, with Vattic able to get to grips with the stupendously excellent Sniper Rifle, which keeps you in third-person, but overlays an automatically zooming reticule in the lower right portion of the screen. Simply holding the left trigger roughly in the direction you need to aim in brings up the nearest target in full zoom from whatever distance they are away, with your job merely to make fine adjustments with the right stick before executing a succession of headshots with the right trigger. It's what Silent Scope should be about, and has to be one of the finest control innovations in a third-person action game for ages - although admittedly it does take a fair bit of the skill away from targeting them yourself, and has no toggle to turn it off. Indeed, every gun has an auto-aim, and merely hitting left trigger while armed guarantees that Vattic will instantly home in on the nearest aggressor without your say so. Armed combat, at least, quickly becomes no more taxing than rattling off combos of left and right trigger and keeping an eye on the health bar.But, with so many enemies descending from all angles, Second Sight soon comes to your aid with some immensely useful skills. Projection soon becomes your stealthy double agent, allowing you to not only wander a ghost version of yourself around undetected (yet able to press switches and deactivate CCTV and force fields and the like), but also 'possess' other characters and, for example, use hand scans when yours clearly won't do the job. The upgrade to your Psi Blast, meanwhile, becomes the key tool in your arsenal, being a ranged attack capable of taking out an entire group of sentries, which, given their relentlessly respawning ways, is a godsend. Finally, the stupidly belated upgrade to your Telekinesis powers allows you to pick up humans, as opposed to just grabbing inanimate objects.As glad as you are to have enhanced TK powers, they don't, it has to be said, feel as anywhere near as enjoyable or useful as Psi-Ops. Being able to juggle your foes and generally mess around with your entire environment just wasn't something Free Radical implemented as well, with less convincing physics that lack solidity, and a sometimes flaky targeting system that in the heat of a battle would rather lock on to a plethora of boxes and canisters than the Storm Solider busy raking you with his SMG on the gantry above you. It's not a deal breaker, but stood side by side, it's hard not to be more impressed with the overall feel and intuitiveness of Midway's effort. On an almost related note, Vattic's interaction with the environment, while generally authentic and believable while running, climbing and sneaking around walls, totally goes to pot the instant he walks down a flight of stairs. Like a demented Riverdance reject injected with pure Tartrazine, you jig your way in a blur of limbs, with tippy tappy sound effects to match machine-gunning their merry way down. It's hard to fathom how that slipped through, and it will have onlookers sniggering the moment they see it. It doesn't detract from the gameplay one iota, but try explaining that to casual observer who's already prejudging the quality.But, if you can find it in your heart to forgive this technical anomaly, the rest of the visuals have that trademark Free Radical look and feel that allows Second Sight to stand out from the crowd in an instant. The characters all have that exaggerated, rounded cartoon look, and the masterful animation that made the TimeSplitters games such a pleasure to witness. Each character also comes with the kind of quality voice acting that allows the story to develop in an interesting and measured way, never resorting to the kind of fingernails-down-blackboards cringe that most games (including Psi-Ops) always seem to default to. Indeed, audio-wise, layering on the aforementioned quality voiceovers, the incidental music is as unobtrusive as you'd hope, being neither particularly memorable nor at any stage annoying. It's what most of us want, to be fair.Over the course of the ten or so hours, Second Sight's narrative poise stands head and shoulders above most games of this ilk, and helps create the sense of purpose and atmosphere that Midway's effort arguably lacked. All the way through you actually care what's going on. It starts to make sense, and the characters you're busy chasing down or rescuing mean something. It's incredibly rare that you can reflect on a game and say that with any conviction whatsoever, but, in Second Sight's case, it's without doubt one of its strong points.However, its TimeSplitters-based, PS2-based technical origins are beginning to make certain elements of the engine look a little dated, with very little texturing evident, little effort made in the way of lighting, and alarming slowdown in sections that have no right to judder in this stage of the current generation of consoles. Three years into its lifespan, the Xbox really shouldn't have issues displaying smoke and snow particles, but yet at times you'll see the game slowing to a crawl. Even so, this happens very rarely, and combat sequences emerge Scott-free - so count this as a surprised complaint rather than any kind of gameplay hindrance, because it's not.What does come as a surprise, though, is the exceptionally basic front-end and in game menu system that lacks the polish we'd expect, with blocky text, indistinct icons and the inability to do the most basic control remappings. For example, where the hell is the invert camera option? The game does give the choice of user controlled or the largely useless survival horror style dynamic camera, but those hardwired to invert their up and down view will have to go without. Sorry.It's worth noting that Second Sight isn't a long game. To some this might be a good thing, to others a bad thing. There's little in the way of replay value, with the 'Challenging' difficultly setting merely serving to make combat more deadly than usual from our experiences. A run through the entire 17 level game on Normal unlocks no more than the respective cut-scene that you're up to, and although you can admire your handiwork through Free Radical's extensive array of in-game stats, there's nowhere nears the incentive to go back and beat the game in less time. In TimeSplitters there were characters to unlock and entire game modes. Second Sight feels comparatively hollow in terms of extra content; even Psi-Ops had its array of bonuses.But, in truth, Second Sight rises above many of the quibbles that you could justifiably level at it. A key ingredient in its success is its engaging concept, which comes layered with a satisfying narrative structure and credible characters. Factor in Free Radical's trademark attention to detail and instantly gratifying controls and it's a game you can't help but be drawn to. Although in pure in gameplay terms it doesn't reach match Psi-Ops' thrilling ambition, favouring old school stealth principles over riotous action, it almost makes up for it by being a far more stylish affair - although the occasional lack of signposting can be irritating on one or two notable occasions. The bottom line is both games fall short of being everything they could have been, and which one you choose will very much come down to personal taste. We admired both in very different ways. If story matters to you, go for Second Sight. If you can stand the cheese, opt for Psi-Ops. It's a tough call, but you don't have to be a psychic to make it.Order yours now from Simply Games."}