{"ref": "https://www.eurogamer.net/r-projectzero2-x", "date": "29 Mar 2006", "game_name": "Project Zero 2: Crimson Butterfly", "text": "Order yours now from Simply Games.If you're in the business of making horror games, there are two fundamental ways of scaring your audience that you can use. You can go down the tried and tested route of simply throwing unexpected, gory enemies at the player in a shock-scare manner, which is what we'd have called the ~Resident Evil approach~ until our encounter with the altogether more intelligent Resident Evil 4 last weekend. Alternatively, you can place players in a creepy, discomforting setting, assault them with imagery calculated to distress, play curious whispers under a soundscape of discordant noise, and gradually unfold a story whose horrific nature lingers in the mind long after the console is turned off and the images themselves fade from the pixels of your screen. We'll call that the ~Silent Hill approach~, for the sake of brevity.Of course, this is far from a complete list. For a start, we've missed out the most recent development in horror gaming, a tactic calculated to strike pure terror into the heart of any true gamer - selling your movie rights to Uwe Boll. However, classifying ~Resident Evil approach~ games and ~Silent Hill approach~ games does give us a fairly good basis to work from in considering Tecmo's latest foray into the world of horror.Resident Evil style games are simple to classify. In general, your central character is a bit of a badass - someone who's got a good chance at the whole ~survival~ element of the horror genre from the word go. You shoot guns, you lay the smack down, and you progress through an ultimately paper-thin and rather unimportant plot - VIRUS RELEASED ZOMBIES ROAM AAARGH BRAINS. It's a pizza, beers, mates kind of game, just like the zombie B-movies which inspired it.Project Zero II: Crimson Butterfly is very distinctly a Silent Hill game. Trapped in a deserted Japanese village, your character, Mio, is quite distinctly not a badass. In fact, you play as a teenage girl who would probably fall over backwards if she attempted to fire a gun. If you were to put her into an average classroom, she'd be voted as the person least likely to survive a Battle Royale - with the possible exception of her lame (and I mean that in both senses of the word) twin sister Maya, who also becomes trapped in the village. There's a minimum of smack-laying-down happening here, but instead every encounter with an enemy is relevant and ties in with the detailed and vital plot that the game spins around you. It's a lights-off, sound up, and no mates in sight kind of game. You wouldn't want them to see your hands shaking.The fundamentals of the game will be familiar to veterans of the first Project Zero - although it's worth pointing out that you can dive into the second game with no knowledge of the first without being at any disadvantage. You walk around an environment, this time expanded from a single large house into an entire village full of large houses, solving puzzles which allow you to progress further, picking up clues and hints about the events which took place here, and dispatching malicious ghosts using the rather peculiar combat mechanism of taking pictures of them, in first-person mode, with a mysterious old camera.Perhaps responding to criticism of the original Project Zero, this game focuses a bit more on the storytelling and puzzle solving elements, rather than on combat. In fact, you'll often spend several minutes wandering around without encountering any form of enemy, while the combat itself has been made a lot easier - with the addition of several power-ups for the camera which unbalance things in your favour considerably. At around the halfway point, far more unpleasant enemies start showing up and you'll have to break out the more potent film (this game's version of ammunition), which is in short supply, but at no point does the game reach the levels of genuine frustration occasionally achieved by its predecessor.Gamers who crave a slightly more challenging experience are catered for in the Xbox version by the addition of an FPS mode, which swaps the traditional third-person view for a first-person viewpoint, making the whole thing a bit tougher by effectively robbing you of your peripheral vision, and a survival mode - unlocked after you finish the game once - which throws wave after wave of enemies at you, who can kill you with a single touch (a thankfully rare occurrence in the normal game mode, with only two enemies in the whole game able to accomplish this tooth-grind inducing feat - and even then, only because you're meant to be running away as fast as your admittedly-not-very-fast little legs can carry you, rather than hanging around to take holiday snaps).The decreased emphasis on combat brings with it a tighter focus on the storytelling of the game, which gradually reveals the history of the deserted village through dialogue, flashbacks, diary entries and audio recordings. Helpfully, the game also summarises your knowledge in a series of memos, ostensibly written by Mio herself, so although you should be able to piece together far more information yourself, the basics of what you've uncovered can be easily revised in the menu system - handy especially when people start throwing around phrases like ~Kusabi~ and ~Remaining~, or Japanese family names, and you can't recall why they're relevant.As to the story itself... Well. Without giving too much away, suffice it to say that deeply unpleasant things happened in this village, and early in the game it becomes apparent that visitors to the place have never exactly lauded it as a recommended tourist experience. Each house in the village has its own tragic story, linked to the central story of the doomed village, and many of the ghosts which you encounter (not all of which are hostile) are linked directly to those stories. Some of these are particularly horrific - the crawling, broken body of a woman who threw herself down a stairwell isn't likely to leave my nightmares any time soon, while there's something terribly sad and eerie about fighting the sobbing spirit of a small girl who blames you for the loss of her brother; hardly your average videogames boss, is it?For a game with remarkably few interactive characters - with the occasional exception of your sister Mayu, the only character in the game you can actually talk to is a white-haired boy called Itsuki, who is trapped in a shed at the edge of the village, and has his own strange connection to the events which took place there. It does a great job of building up a comprehensive and emotive picture of the village as it neared its doom, and reveals the thoughts and motivations of long-dead characters to the player in an intelligent, understated and atmospheric way. Tecmo's storytelling is excellent, and its understanding of how to scare people through subtle tweaks to the atmosphere of the game - ranging from delicate changes to the audio, through the suggestive interplay of light and shadow in ruined houses, to more palpable shocks such as the appearance of hostile ghosts or the apparition of other spirits who provide insights into the past or regard you with curious eyes from dark corners - is first class.The puzzles in the game are also worthy of mention, as they represent another area which Tecmo has tidied up significantly from the original Project Zero - which was often criticised for forcing you to run around the world for sport, picking items up all over the sprawling house as you ran through corridors of respawning enemies. Project Zero II dumps that particularly poor element of design, and instead creates a far more enjoyable design which is multi-layered in its approach - at any point in time you'll have an overriding objective in mind, and a number of lesser objectives you need to accomplish in order to achieve that objective. For instance, your objective might be to open a cell door; you know that the key you need is in a certain house, so you go to that house and then become embroiled in a set of sub-puzzles there which all take place within the confines of the house. Walking around to collect objects is kept to a minimum, and it all ties in nicely with the plot structure since each house also has its own tragic subplot for you to uncover.Graphically, Project Zero 2 demonstrates some of the talent which Tecmo has at its disposal, especially in terms of the characters, which are very detailed and beautifully animated - be they living or dead. The environments are less impressive - they're quite drab and dark - but that's to be expected given the setting of the game, and it's used to good artistic effect, with the dank, musty corridors and abandoned rooms only serving to emphasise the occasional splash of blood, or the pure white kimono and alabaster skin of the vengeful spirit which pursues you through one of the houses, pleading with you not to leave her alone... The Xbox version actually doesn't look that much more impressive than the PS2 version, although it's certainly clearer and smoother, but that's more a testament to the impressive feat achieved by Tecmo's PS2 coders than any criticism of the Xbox edition.In terms of bonus material in this edition - which is subtitled as the ~Director's Cut~ - there's not really enough here to warrant playing through again if you've already completed the game on the PS2, but the additions are certainly nice for newcomers to the title. The FPS and survival modes are fun if you crave the combat of the series, while a number of new missions have been added which test your photography skills, and there are some Xbox-specific costumes for the girls - including a bikini, of course. This is Tecmo we're talking about. Perhaps more interestingly, there's a new ending in the game; big fans of the PS2 version might want to check that element of it out.Even with Resident Evil 4 sitting in my Cube, Project Zero II still got played the whole way to the end before I returned to being decapitated by bonkers Spaniards. That's high praise, and so is this; Project Zero II is the single best example ever of the ~Silent Hill approach~ to horror gaming, deftly stealing the crown from the Silent Hill series itself (which has, frankly, been in a bit of a slump lately). Intelligent, macabre, scary, superbly directed and perfectly pitched for casual players and more hardcore gamers alike, this game does for survival horror what the influx of Japanese and Korean movies has done for horror cinema in recent years. You'll never look at butterflies the same way again - and you may want to sleep with the lights on for a few nights.Order yours now from Simply Games."}