{"ref": "https://www.eurogamer.net/r-projectzero-x", "date": "29 Mar 2006", "game_name": "Project Zero", "text": "It's not often that we're moved to review PS2 ports, but when they're as overlooked as this game is we'll happily make an exception. Since Project Zero's initial release back in September last year, we've had to listen to Rob banging on about how good it is, and the rest of us here at Eurogamer towers had a nagging feeling that his 9/10 score may have been a little generous. But the problem was that we and the rest of the UK gaming public simply couldn't find the game in high street stores, with original publisher Wanadoo seemingly lacking the marketing muscle to make people sit up and take notice – a quick scan of the UK chart data revealed it sold a whopping… 12,000 copies. But with Microsoft belatedly picking up the rights to publish the Xbox version (it's been out in the States for six months), we finally got the chance to find out what all the fuss was about.For the benefit of those who are blissfully unaware of Tecmo's stab at the horror adventure, the basic premise is at once woefully clichéd and wholly original. On the former subject, we get the tired ~oh no, my brother has gone missing in a secluded darkened mansion, I'd better go and investigate armed only with a torch~ type scenario, but it' rescued by a superb combat mechanic, which sees lead character Miku Hinasaki snapping away at the undead with her mother's old camera. It really is Silent Hill meets Pokemon Snap, and works exceptionally well.Anyone who's even vaguely a fan of the Resident Evil or Silent Hill series will immediately warm to Project Zero, being genuinely one of the most sinister and atmospheric games to have ever crawled out of a twisted mind. It features the usual plot driving mechanism of endless scraps of paper, discarded objects that help you break down the various locked doors, handily placed health and 'ammo' (in this case rolls of film), and a tenuous save system.With all these well-worn features, Project Zero could quite easily be dismissed as generic horror adventure fodder, with all its inspirations blatantly apparent, but Tecmo deserves enormous credit for building on what's gone before in some style. Firstly, unlike most of the Resident Evil games, its camera system almost always gives the player the best possible view of the proceedings, while still maintaining incredible atmosphere. Talking of which, the haunted mansion, replete with an absence of electricity instantly generates a pant-crapping backdrop for which to base your adventures. In common with other Tecmo releases, the visual style is absolutely top drawer, and although you'll be noting the torch waving, deliberately grainy look bears more than a passing resemblance a certain Konami game, it's carried off with typical panache to render such comparisons relatively unimportant.Undoubtedly, the key innovation is Project Zero's dual use of the camera; first as a weapon, and secondly as a clue-finding device. Early on, the miniskirt-wearing Miku (we're surprised she didn't turn up in a bikini!) finds the camera that her brother has discarded, and it soon becomes apparent that this will be an essential tool for the duration of the game, thanks to its ability to see capture images that the naked eye cannot. Hitting B switches Miku from the standard third person viewpoint to a first person mode, with the left stick allowing you to position the capture circle and take your shot, with either right trigger or the A button completing the snap.As you wander around the eerie Himuro mansion, strange ghostly apparitions will suddenly appear – and if you can take a good enough picture before they disappear, the game rewards you with points which you can spend on upgrading the camera's function, such as its range, speed and the maximum value of Spirit Power that you can charge. Meanwhile, the pad will rumble into life if you come within range of some unseen image. Switching into first person mode will allow you to scan the environment, and once the capture circle turns light blue, you know that the picture you take will reveal a potentially important clue, or at the very least will result in more points for you to spend as you see fit.But this is the friendly stuff. The real meat of the game involves some frankly terrifying encounters with spooks intent on causing you as much grief as possible. The way to combat them, curiously, is to wield your camera in their direction and try to position your capture circle on them and snap away. If you can centre on them long enough before you take the picture, you'll deal more damage, but run the risk of incurring your own ghostly freakout pain should they come into direct contact with you, at which point a chilling negative effect kicks in, accompanied by terrifying screams. Keep your distance and your survival is ensured, but fail to keep out of their way and it's Game Over before you can say ~cheese~.The effect of being chased by shape shifting ghoulies around darkened locations, complete with truly vile sound effects (now in full Dolby 5.1) is very impressive indeed. With the lights off, and the surround sound in full effect, we can barely think of a more disturbing gaming experience – until Silent Hill 3 turns up, that is.As Rob mentioned in his original review, the game makes far more sense than most horror adventures, and as such you won't be hung up on the puzzles for too long. This does call into question the longevity, but for the 10 or so hours you'll be questing through Project Zero, you'll rarely be frustrated by some obscure lateral puzzle that the developer threw in there just to trip you up. As long as you pay attention to the numerous notes you pick up, listen to the cassettes, take pictures when required and make a note of obvious clues (like numbers highlighted in red) you'll won't be stuck for long. The plot's twists and turns and the connections of the various former occupants of the mansion help draw you in. It's an adventure you'll want to see through, make no mistake.And if you should make it to the finishing line, Xbox owners are treated to the ~proper~ ending that Tecmo allegedly planned in the first place. If you can attain a good enough ranking, then expect to face even more powerful ghosts in a ridiculously tough new mode. Hardly exciting for those who own it already, but there you go.If we were to try to knock Project Zero in any way, it's the occasional tendency for Miku to get stuck on scenery as you run around, while sometimes the ghosts employ some underhand tactics, which expose the limitations of the fixed camera angle system. Often you'll find yourself running into danger through no fault of your own, as the enemy teleports itself right in front of you. Also, why does Miku take so bloody long to climb stairs/ladders and open doors when there's a sodding ghost after her? They're possibly the only frustrating incidents in the game, but when Game Over can result because of it, the teethgnashing can be quite severe.All told, Project Zero is one of the most compelling horror adventure games ever, and must rank as one of the best games on the Xbox. The only fly in the ointment is Microsoft's decision to price it at £40 – over a tenner more than the PS2 version retailed for nine months ago. Don't expect Project Zero to represent a revolution in gaming, but when a game's as exceptionally engrossing as this it's impossible not to recommend it. Go on. Scare yourself shitless."}