{"ref": "https://www.eurogamer.net/ss-popsands-gba", "date": "29 Mar 2006", "game_name": "Prince of Persia: The Sands of Time", "text": "~Hup! Careful... careful... no... NO! Phew. Hrng. Hup... careful... argh! Again.~ - Me, playing Prince of Persia on the Amiga in 1994.~Hup! Wargh! Woo! Aieee! Oh no! Argh! Whee! Whoa! NO! [Crash]~ - Me, playing Prince of Persia on the Game Boy Advance yesterday.Ubisoft's effort to bring the classic Prince of Persia into the new millennium paid off extremely well, as you'll doubtlessly be aware by now. There have been numerous attempts in the past to drag revered classics out of their cosy, cobweb-laced 2D cocoons, and they've often resulted in abject failure - thanks in part to lazy design and in part an apparent misunderstanding of what made the original games so great in the first place. Prince of Persia has become the exception.It was so refreshing to pick up the PS2 version of Prince of Persia earlier this month and finally discover a developer had taken the essence of the original - the carefully planned, nail-biting progress through levels; the sublimely animated acrobatic Prince; the sprawling, seemingly endless environments - and built something fresh yet recognisable out of it. And that's also why it's so disappointing to find that barely any of that understanding was injected into the Game Boy Advance version.The game starts off in a similar fashion to the console version, and weaves the tale of the young Persian prince who - upon discovering a magic dagger - unwittingly opens a giant hourglass containing the mysterious Sands of Time. The sands release an evil force that contaminates his father's kingdom, and the Prince sets out to rectify the damage and restore peace to the palace. Unfortunately, this is where the similarity with the console version ends, and where my initial enthusiasm wanes.To begin with, the Prince's repertoire of acrobatics ranges from jumping to... jumping. Lots of jumping. He runs and leaps from this platform and that, jumping to pillars and clinging on for dear life before leaping off again, and swinging off poles like an Olympic gymnast. If you happen to accidentally misjudge the length of a jump while jogging along, the Prince will more often than not cling onto the opposite ledge and save you the effort of taking another crack at it.The Prince picks up new skills by collecting the odd scroll scattered about the palace. These allow him to roll or perform a double-height jump in mid-air and so forth, but the more interesting skills he gains pertain to the use of the power within the Sands of Time, stored inside the Prince's dagger. By knocking enemies down with this sword and then drawing the sand out by stabbing them with the dagger, the Prince fills up his sand meter and makes use of it to manipulate time itself.Rewinding, slowing and even stopping time are all talents you'll have to make use of in order to overcome the increasingly threatening traps that crop up throughout the palace. And although the Prince has only one life, it's possible to rewind fatal errors by a few seconds should you be quick enough to spot an accident in progress.The manipulation of time to slow down fast-moving traps or rectify mistakes is as interesting as The Sands of Time gets though; the rest is a traps-and-puzzles platformer that doesn't ever really manage to feel much like a Prince of Persia title at all. In fact, I'd go so far as to say it has more in common with Disney's 16-bit Aladdin game, both in look and feel, than Broderbund's 80s original. The Prince himself even bears an uncanny resemblance to Aladdin, with jumping, swinging and combat animations right down to his baggy little trousers all making me feel very nostalgic - but for the wrong game!The introduction of Farah about a third of the way into The Sands of Time serves as a slight gasp of fresh air, emphasising the game's puzzle element by forcing you to switch between her and the Prince to conquer specific parts of each room. Compared to the Prince's eventual wide range of talents, Farah would be practically useless if it weren't for her bow and arrow, which allow her to fire at pendulum switches and destroy some traps and enemies from afar. Also, many of the game's doors are only unlocked if more than one switch is depressed at a time, so you will find yourself scrambling around different routes in a level with both Farah and the Prince attempting to find switches to stand on.The ability to switch between characters is actually quite novel at first, but Farah's ineptness often becomes quite frustrating when you have to make use of her for extended periods (quiet at the back). It's a genuine relief when you switch control back to the Prince and his fast-paced acrobatics. You can tell the game's hinting at a kind of tension between the characters, with Farah initially despising the Prince for all the damage he's caused, but because of the still text-based cut-scenes any actual emotional involvement doesn't come across at all well.The presentation of The Sands of Time is extremely good throughout, with the rich colourful backdrops that portray the game's Persian setting proving quite beautifully effective (apart from the odd confusing occasion when a climbable drape blends into the background). There's also some very cunning level design. When it's at its best, you'll find yourself performing huge, challenging treks from room to room to perform the simplest of tasks. It's incredibly satisfying when little mini-plans come together between Farah and the Prince, and the way the intricate system of rooms has been woven together in order for them to interact is impressive if occasionally disorienting.It's a shame that Ubi couldn't keep the odd flashes of inspiration running throughout the whole game. Though, to be honest, they didn't even need to innovate much here - a modern version of the original Prince of Persia's game model with GBA-powered visuals and PS2 Sands of Time-inspired levels would've suited us fine. The game's fast pace and constant platforming really detract from the whole idea of what makes Prince of Persia special in the first place - even the combat has been reduced to a simple button bashing affair when compared to the fanciful swordplay of the original.Setting my disappointment over its distance from the original Prince of Persia design aside, The Sands of Time on the Game Boy Advance is a rather accomplished and quite extensive platform-puzzler, with some fabulous level design and genuinely considered presentation. However, when placed in the context of the licence it becomes clear that the elements of Ubisoft responsible for the GBA port have lost sight of what made the original 2D version so great in the first place, when surely all they had to do to find out was pop next door and ogle the Montreal studio's brand new 3D version.Considered, thoughtful and elegant gameplay needed to be employed alongside some of the fabulous level design on show here. A lack of subtlety and reliance on brain dead action significantly dampens what could have been the definitive handheld Prince of Persia experience."}