{"ref": "https://www.eurogamer.net/sonic-forces-review", "date": "10 Nov 2017", "game_name": "Reviews", "text": "It's taken years of gruesome experimentation but Sonic Team's designers have finally pulled it off. They've created the Ur-Sidekick, the Sidekick of Sidekicks, a total embodiment of a wayward franchise that can be invested with the traits of every other noxious bit-part this universe has produced. The task at hand may be to run down Dr Eggman's latest henchman, Infinite, a preening, masked spectre who can mess with dimensions and resurrect old nemeses to fight you, but if you really want to stare into the abyss of time, to witness reality cracking and splintering under the eternal return of the same, look no further than the hyper-accessorised, player-crafted abomination at your side. Shadow's scalp! Amy's boots! Silver's gloves! A T-shirt with Knuckles on it! Those goggles whatshisname wears! Every completed stage or mission brings with it an avalanche of on-brand tees, caps, suits, boots and full-body paintjobs, such that the story becomes less about thwarting Eggman than feeding up Sonic's latest accomplice, shovelling the viscera of Sonic also-rans and forgotten properties like Super Monkey Ball into its furnace maw. You keep waiting for somebody - poor abused Classic Sonic, who would surely be screaming inconsolably if he were able to speak, or Eggman, who has been cloning the hedgehog for decades - to notice, to raise a trembling finger toward the ravenous void at the game's heart. Horror has a face, they say. Wrong! Horror has a face you can customise.This summer's fan-made 2D throwback Sonic Mania had me feeling like a child again. Forces makes me a feel like I'm a million years old, like Saturn in his dotage, munching on the corpses of his offspring. It isn't an utterly abysmal game by any means, a reasonably slick continuation of the entwined 3D race-course and retro 2D platforming stage design that reached its apex in Sonic Generations. But it is a profoundly empty experience, a rearranging of pieces that have long since (blue) blurred into one, and the addition of a custom player avatar you can deck with the pelts of other characters only hammers that point home.Forces is a tale of three games, spread across around 40 stages (including around 10 or so optional and prequel stages). There are the Classic Sonic levels, quaint 3D hop-n-bop affairs with throwback audio effects and old props like power-up TVs. These are quite restful, with Sonic's moveset boiled back to a spin-attack and his momentum-building spin-dash, and often rather jolly, particularly when the developer revives a cherished memory such as Robotnik Eggman's first boss appearance only to gleefully transform it. As with Sonic's 2.5D outings at large, however, the physics seem off, with jump height and your precise mobility in the air a little hard to gauge, and in any case, there's nothing on offer here that Generations didn't do better. Then there are the modern Sonic stages, which see you blasting through enormous, baroque piles of terrain at impossible velocities, calling on an arsenal of boosts, homing slams, ground pounds, slides, wall-kicks and double-jumps to bridge the fleeting pauses between slides and launch pads. Built for the score-attacker, these stages draw upon everything Sega at large has learned about effects-heavy, sporadically on-rails arcade action games, and are occasionally inspired. Resist each layout's relentless pull and you can unearth parallel routes or secrets that can only be reached by, for example, using out-of-the-way flying robots as a springboard.They are just as often frustrating, however, with a camera that pivots jarringly from over-the-shoulder to side-on, a fickle automated lock-on system and sections that strip you of full control without warning. Memorise these stages in your quest for a higher score and such blemishes and switch-ups are less bothersome, but that doesn't make them any more graceful. The environment art at least is lustrous throughout, even on the under-muscled Switch - eerie temple casinos engulfed by neon jungle, orange asteroid fields strung together by grind rails and a pearlescent sci-fi metropolis that might have been loaned from WipEout. The audio is predictably gorgeous, too. Hold down boost and the game's wailing J-rock score bursts into full clarity, a flourish that is more gratifying than any quantity of dreary virtual merchandise.Last and most definitely least are the stages where you control your avatar, a Rookie enlisted to fight Eggman after Sonic takes a beating during the prologue. The chance to wade into battle as a gold bearded parrot with monkey ears and an opera mask aside, the Rookie offers a grappling hook that generally serves as a homing jump, and can equip various wrist gizmos that are powered up by gathering Wisps, a collectible from Sonic Colors. Each gizmo confers a short-range attack such as a lightning whip or drill punch, and a special move like warping along a line of rings or sucking collectibles into your path. Replaying stages with different gadgets adds a couple of hours to a game you can polish off in a day, but the Rookie otherwise feels like mutant connective tissue - like something that has swelled up in the cavity between Classic and Modern Sonics, merging a little of their essence with a tepid reworking of the rockstar consumerism that was once a major selling point in the fight against Mario. None of the Rookie's abilities really change your approach to each layout, and once their novelty has faded, it's hard not to wish those resources had been spent on more straight Sonic levels. Least convincing of all are the handful of climatic scenarios where Sonic and the Rookie are controlled as one, running side by side and alternating attacks in a cut-down homage to Sonic Heroes. If the aim is to make the veteran Sega fan feel like part of the story, their veneration made flesh alongside the lead, the impression is of the bloated Sonicverse itself chasing after the hedgehog and butting him out of the way. As Martin suggested in his preview, it's hard to know what to do with Sonic under Sonic Team at this point. Were this a Sonic title from a few years ago I'd end by renewing the call for a proper 2D game, but Mania has already scratched that itch, and for all the sore spots, there is something about modern Sonic's combination of ridiculous speed and cinematic impact that seems worthy of further investigation.What the series certainly doesn't need is an actual, in-game personification of all the rubbish Sonic has gathered into his orbit since kicking the MegaDrive to the curb. Forces is a decent pick for youngsters in search of something bright and throwaway, and diehard Sega nutters will doubtless find a space for it, but if you're still riding the high after Mania's release this is one hedgehog you can probably leave in the road."}