{"ref": "https://www.eurogamer.net/r-mohfrontline-x", "date": "29 Mar 2006", "game_name": "Medal of Honor: Frontline", "text": "Frontline is an excellent first person shooter, easily aspiring to            the calibre of its forebear on the PC and perhaps even surpassing            it. Unfortunately, many sections of the press seem to have let this            fact pass them by since the game appeared on Xbox and Cube,            lambasting the port it for its gritty but ostensibly PS2-level            visuals and ignoring its alluring new multiplayer mode. Rest            assured, we continue to enjoy Frontline and won't be swayed by the            prospect of 'cheating on Halo' unless the experience has soured            significantly since June. In other words, we've gotten our rifles            out, but we've yet to fix bayonets.        Admittedly, it's hard not to look at the opening D-Day landing            sequence and wonder why EA didn't shove some more polygons in            there. At no point throughout Frontline does the game slow more            than a fraction, and the Xbox is capable of a lot more than this.                    However, once a German plane strafes a nearby landing craft and            we're hurled into the ocean and dragged ashore, any question of            whether our captain's jaw line could do with a few more triangles            is promptly dismissed. And unlike Allied Assault, this is no            barrage of scripted shells and quick save juggling. You'll need to            complete each level in one go lest you be returned to the start,            but unless you go straight for the highest difficulty level the            game is more challenging and engaging than frustrating.                    Your path through the war begins on D-Day, but this is little more            than a prologue, which sees you scramble up the sand before marking            beachhead machine gun nests for your ships to pick off. Beyond            that, you have to stow aboard a submarine before taking it over by            force in a very claustrophobic, carefully scripted and memorable            level - complete with knife-chucking chef and sailors galore -            before fighting for the bridge at Nijmegen and running the gauntlet            of Operation Market Garden.        It's the strength of Frontline's combat which keeps you coming            back. Objectives vary from reconnaissance, sabotage and information            gathering to infiltration and all out destruction, but if fighting            the onslaught of Axis forces wasn't fun, we wouldn't have lasted            much longer than D-Day +1.                    The game's core strengths are definitely the L1 zoom/aim feature            (similar to TimeSplitters') and the ingenious use of crouching - on            both sides. Once you've opened fire on the enemy and they're aware            of you, some will crouch behind cover, leaning round or over to            fire shots, or just holding their rifles up and spraying in your            direction. But you can do this too! Once crouched the left analogue            stick allows you to poke your head up and around, and although it            does take a bit of effort to keep a precise position, the ability            to quickly duck back down by lifting your thumb is greatly            appreciated.                    Couple this with a wide variety of arms to bear, including            authentic pistols, rifles, machine guns and our favourite, the            Springfield 03 sniper rifle, and it's a dish we'll happily chew            over once again despite having polished off the identical PS2            version barely six months ago.                    All in all, Frontline's single player is a much more cohesive whole            than Allied Assault ever was, with less padding. It's a little more            linear than we remember, clearly shepherding you between objectives            and rarely leaving you high and dry, but even if you miss that            crucial ladder on the wall in the sub pen and spend five minutes            wandering around, a quick tap on the Back button brings up tips            from HQ - these range from general game advice to pointed            'intelligence' on what you need to do. In this case, 'use your            bloody eyes soldier' was about the gist of it.        Any            complaints? Sure. We're not overly taken with the consistency of            the opposition and locations (despite a diverse range of missions,            many do have a tendency to strike up a bit of déjà vu),            the amount of locked doors is a bit disheartening and we're            slightly aggrieved by the banality of our main character, but our            criticisms are largely second-time-through observations. Playing            Frontline for the first time, it's hard to pay attention to            anything other than the barrage of scripted events, the artistry of            the level design (particularly derelict French villages with            crumpled and war-torn landscapes) and the sound of shells whistling            past your ear.                    Graphically, yes, it's a step back for veterans of Halo, but models            are still relatively high-poly and a great deal of effort has gone            into the animation and build-up of detail. Troops lean round cover,            watchtower sentries keel over the railings and plummet to ground,            tank turrets spin round to track you (definitely frightening when            you're low on health!) and Axis troops have 101 different ways to            meet their maker. On your own side, allies will make hand gestures,            visibly speak the words that you hear and even provide covering            fire as you dash across open ground. And the environments are            filled with ornate detail, be it balconies on buildings, half blown            up tanks in the streets, docked submarines with working machine gun            nests, water towers and other roof furniture, and the prevalence of            (heavily) destructible scenery.        And then there are            the throwaway moments. Like overhearing a Gestapo interrogation in            the next room - an American soldier refusing to give anything other            than his name, rank and serial number - as you try to find a way            in, and two sailors muttering angrily about having to haul your            crate aboard the sub, moments before you burst free and put them            out of their misery. Very rarely does Frontline offer up an empty            room, a boring location or a tedious scenario - the gameplay is            largely repetitive, yes, and very linear, but that doesn't make the            sights and sounds any less vivid and diverse, and it doesn't make            it any less fun. The ability to go back and play any stage of any            campaign, and unlock bonuses by winning medals for courage,            accuracy and speed, is another boon.                    Xbox owning FPS fans (and given Halo's success, we imagine that's            quite a lot of you) should be fighting their way to the checkout            right about now, but just in case the lure of an engrossing single            player adventure isn't enough, we should let you know that the            addition of multiplayer to Frontline is unoriginal and uninspired,            but also unexpectedly enjoyable. Levels are built out of familiar            single player locations and up to four players can choose to duke            it out. Various weapon schemes are available to toy with (opting            for just bazookas, rocket launchers and grenades is always fun) and            although it's no Halo and no TimeSplitters 2, at least it gives you            something else to do once you've brought down the Third Reich.                    In the digital entertainment stakes, EA really has made World War            II its own, and Frontline is its standard bearer. It's a long,            spirited adventure with little to be said against it. Ok so the AI            isn't perfect, some of the missions are a touch contrived and given            the proper attention it could have looked twice as good on Xbox,            but instead of letting that cloud our judgement we enjoyed            Frontline throughout. If you're open-minded enough to kill low-poly            Axis troops and don't mind being led by the nose, then don't let a            clutch of angry graphics whores dissuade you: this is top fun."}