{"ref": "https://www.eurogamer.net/r-mohfront-ps2", "date": "29 Mar 2006", "game_name": "Medal of Honor: Frontline", "text": "When Medal Of Honor : Allied Assault was launched with a party at            the Imperial War Museum in London back in February, most of the            attendant journalists were slouched over a PC running the game, or            camping the bar. I was too busy playing the single level demo of            Frontline which was running on a debug PS2 hidden around the back            of a V2 rocket to bother with such petty distractions.                        Four months later Frontline has finally reached the shelves, and            once again it has had me glued to a joypad. From the moment the            game starts up it's obvious that this is the game Allied Assault            should have been, sporting a more consistent single player            campaign and an extra coat of polish. An introductory cinematic            sets the scene perfectly, with an actor reading out Eisenhower's            famous letter to the troops on the eve of D-Day against a backdrop            of historical war footage.                        And then it's straight in at the deep end. Literally, as Frontline            does away with all that nonsense in North Africa and opens up with            an all-out assault on the beaches of Normandy. Before you have a            chance to fully appreciate the beautiful graphics, the shells            detonating around you and the German fighters strafing the landing            craft, an explosion sinks your boat and hurls you and your squad            into the water, leaving the survivors to swim ashore. When you            reach dry land the beach looks virtually identical to the            equivalent level in Allied Assault, but this is far more than a            simple port. The mission objectives and gameplay have been revamped            to better suit the console and its audience, and to give the game a            more human touch. For example, your charge up the beach is mostly            spent giving covering fire for your scattered squad mates, helping            everyone to reach the safety of the dunes before blasting a hole in            the wall and scrambling through.                    The whole experience is also far less frustrating than it was on            the PC, where a single wrong step could place you in the path of a            pre-scripted mortar shell, leading to instant death. In Frontline            your soldier is made of sterner stuff, and you're far less likely            to die before reaching the dunes, even though you're running around            between shell holes and iron posts trying to save your allies.                        Normally this would make the game more of a run-and-gun shooter,            but this being a console title there is no quick save button.            Indeed, the only time you can save is at the end of a mission, and            as most of them can take upwards of half an hour to complete,            you're encouraged to be cautious. While this might upset some            people, the sheer tension it creates is so intense that your hands            would be shaking by the end of a level even if it wasn't for the            fact that the controller vibrates eerily when your character is            near death. Before long you're creeping through the streets,            ducking behind cover at every sound and peeking out from around            corners to check for guards.                        This is made possible by Frontline's ~aim~ function. With most            weapons, holding down the L1 trigger zooms in your view of the            action ever-so-slightly, as if you were squinting down the barrel            of the gun to get a better look at your target. While the trigger            is held, the left stick of your Dual Shock allows you to bob your            head around without shifting your feet. Move the stick left and you            lean left. Move it down and you crouch. Move it up and to the right            and your character pops up and leans out to the right. With a            little practice you can control your movement with almost            pixel-perfect accuracy to make the most of any cover you've managed            to find.                    It's not just your own character who makes use of cover in this way            either. Open fire and any enemy soldiers in the area will scatter            and dash for cover, hiding around corners or crouching behind any            convenient crates, cars, ruined walls or concrete road blocks they            can find. Soon both sides are ducking out to pop off a few shots            and then pulling themselves back out of the way as the enemy            returns fire.                        The animators have done a great job as well, with the wide range of            movements available to your enemies as they desperately try to            avoid being shot a beauty to behold. Soldiers peek out from around            corners, lie prone on the ground, and hold their weapons above            their heads to spray random gunfire across a street without            presenting an easy target. Get too close for comfort and they'll            try to batter you with the butt of their rifle. The result is            surprisingly life-like, and helps to make combat feel far more            immersive.                        This is backed up by a variety of gore-free pain and death            animations. Roof-top snipers clutch their chests before tumbling            over the edge and falling into the street, while if you shoot a            soldier in the foot he hops around in agony for a few seconds            before recovering his composure. Even the environment reacts to            your shots. In one mission you find yourself sneaking aboard a            U-boat, which is modelled in painstakingly claustrophobic detail.            During a firefight in the submarine's kitchen, I was delighted to            see that stray shots were causing the pans hanging above the table            I was sheltering behind to swing backwards and forwards.                    While Allied Assault had a rather hit-and-miss selection of            missions which dragged on longer than they needed to, Frontline is            a far more finely honed beast. Having started with a bang in            Normandy, the game soon has you sabotaging U-boats, fighting your            way across the bridge at Nijmegen and battling it out in the            streets of Arnhem at the height of Operation Market Garden. Level            design is a little linear, but utterly involving and a treat for            the eyes. From the ruined buildings and rubble-strewn streets of            Arnhem to the U-boat pens of France and haystack-dotted Dutch            fields, the game maintains a high standard throughout, and there's            little evidence of the unnecessary padding which blighted Allied            Assault.                        Balancing is near perfect as well, and although the levels are            often challenging, if you're careful you can get through most of            them on the first attempt, even if your health meter is in the red            by the time you reach the exit. A couple perhaps landed just on the            wrong side of the dividing line between challenge and frustration,            and some kind of checkpoint system might have been helpful on the            longer missions to save you the pain of dying at the last hurdle            and having to go right back to the start, but overall the game's a            lot of fun and the lack of a proper save mechanism usually adds to            the atmosphere rather than driving you away. And if you're having            difficulty finding one of the mission objectives, the inclusion of            an in-game help system is a god send. Press the Select button and            you get a helpful suggestion from HQ, which can vary from a vague            hint to the exact location of the item you missed.                        Even if you do make it to the end of a level first time, you might            want to go back and try again. Medals are awarded based on what            percentage of the Germans you managed to kill and how much health            you had left at the end, and as you earn more medals extra features            are unlocked. These bonuses are available from the main menu, and            include behind-the-scenes footage varying from wireframe views of            the level you've just completed to video clips of the recording            session for the game's soundtrack. Which, by the way, is excellent.                    Frontline is without doubt the best first person shooter I've            played on any platform in the last few years, and arguably the best            console shooter of recent times. A mixture of addictive gameplay, a            tense atmosphere, the ever-popular World War II setting, gorgeous            graphics and solid Dolby Surround audio adds up to a compelling            experience. If you loved Saving Private Ryan, A Bridge Too Far or            Band Of Brothers and fancy liberating Europe for yourself, this is            the game you've been waiting for. Genius."}