{"ref": "https://www.eurogamer.net/r-maxpayne2-ps2", "date": "29 Mar 2006", "game_name": "Max Payne 2: The Fall Of Max Payne", "text": "It's usually pretty pointless looking at the same game across multiple formats; most of the time it's a uniform experience no matter which platform you're reviewing the game on - but not so with the PS2 version of Max Payne 2. If games came with cigarette-style health warnings on them, Rockstar's latest would state boldly: SLOW LOADING TIMES IMPAIR YOUR ENJOYMENT.Not since Stuntman creaked out onto the PS2 last summer have we encountered a game that the PS2's creaking DVD drive struggles so hard to cope with. You can always hear it grunting in pain as yet another elaborately rendered area is spooled off the disk and into its tiny memory banks. Initially, the only real irritation is waiting for the next area to load, and if you just keep seamlessly moving from one area to the next without dying you'll be aware that the game has to stop to load a lot, but not so much that it's particularly annoying. The most notable occasions when things get a bit jarring are when the many cinematic sequence fires up - there'll always be a jarring pause before the animation gets underway, but other than that the game stays as faithful to the PC original as anyone could have reasonably expected.But what will get on your nerves in the end is the way reloading is handled after a death. For example, on the fourth chapter of part one, Max has to duck gunfire by going from one window to the next via narrow ledges. For some reason it's a far more precarious experience than it ever was on the PC and easy to plunge to your doom. We're grateful for the ability to save anywhere to get around issues such as this, but on the PS2 version you're looking at a 45 second wait every time you reload - and on fiddly sections like this you're maybe looking at a cumulative delay of several minutes if you keep screwing up. Also, the game never automatically saves your progress even when you've completed a level, so if you're feeling a bit cocky - or just absent minded - and find yourself having to replay the last three levels, you'll not be feeling too chuffed. Not only that, such frustration inevitably leads to more mistakes, more reloads, and the longing for the quicksave function of the PC and Xbox.Inevitably the visuals have taken a significant hit on the PS2 as well. On a smaller TV this degradation might not be so noticeable, but anyone with a big screen monster will be quite astonished at how much better it looks on the Xbox. Not only is the resolution appreciably lower on the PS2, but the intricate texturing that brought the whole thing to life has been toned down, while the moody palette of the original is a murky mess by comparison.That's not to say the PS2 version looks a disgrace by any means: it'd still be an impressive spectacle if you'd never seen any other version, with impressive character models and Havok 2 physics helping to ensure superbly realistic rag doll animation and a level of interactivity with scenery items not seen before in a PS2 title.  I suppose the upshot is that the other versions are just that much better looking, with very swift loading times. It would have been commercial madness not to port this game to the PS2 with its 60 odd million installed base, but Remedy must be wincing at the compromises Rockstar Vienna made in squeezing it onto Sony's console. Presumably wincing at the same time as counting a large pile of cash!Completely ignoring the technical issues, the gameplay experience remains intact. The controls map perfectly to the PS2 pad, and pulling off the required bullet time ballet becomes second nature almost immediately. Apart from the aforementioned inability to jump out of a window onto a narrow ledge successfully, the gameplay felt smooth, satisfying and as good an action game as you'll play all year, complemented by a typically over-serious Film Noir tale. But the numerous self-mocking TV interludes featuring Dick Justice, Lords & Ladies and Captain Baseball Bat Boy make it fairly clear that Remedy made the game with its tongue firmly in its cheek.Like anyone who has spent numerous hours slugging it out with the PC or Xbox version it's obvious we've been spoiled, but the point is that Max Payne 2 is an action title that relies on keeping the player immersed and focused on the game as much as possible. But if you're asked to spend literally 20 per cent of your playing time staring at a loading screen, then that sense of excitement and immersion quickly ebbs away. If it were not for this crippling issue, then we'd probably overlook the scratchy visual compromises as it still looks good enough and plays well - even if it has been made much easier than the PC original (as with the Xbox version). But the bottom line is, if you have the choice go for the Xbox or PC version over this."}