{"ref": "https://www.eurogamer.net/r-maxpayne2-pc", "date": "29 Mar 2006", "game_name": "Max Payne 2: The Fall Of Max Payne", "text": "Some people insist that you make your own luck in this life. If that's the case then poor Max Payne is a supreme architect of ill fortune; a man so down that you wonder why he even bothers getting up in the morning. Welcome back, Mr grim, we've missed your constipated grimace.A couple of years back the original was a massive commercial success on the back of an extremely polished graphics engine and its pioneering use of the now ubiquitous Bullet Time system of enabling the gamer to slow down time and continue shooting at a real time rate. The effect elevated an otherwise standard third person action game into something genuinely new and thrilling, with the novelty of diving sideways, backwards or headlong all guns blazing at posses of enemies never wearing thin.What did grate on some, however, were its deliberately hammy film noir attempts, over the top voice acting and regular use of graphic novel frames to illustrate the action. In the context of videogaming, though, I personally applauded this refreshing approach, and found its trash depiction of New York, and Max's increasingly desperate attempts to clear his name one of the most memorable and exciting told in 25 years of the medium.Many of you obviously liked it too, despite a few highbrow critical bashings, and the game went on to become a huge hit on the PC and Xbox, and an even bigger one on the PS2 - despite being a vastly less satisfying game to control on a joypad. With well over half a million of you in the UK alone buying the game, it's fair to say expectation from the surprisingly swift sequel is very high, after some spectacular recent promo footage.Having only been announced a few months back, it's refreshing to see that Finnish developer Remedy has not fallen prey to the slippage demons that seem to have engulfed the majority of top developers lately. In fact, after the fairly torturous wait for the original, we had to double take when we first saw the October release date. But here it is, in our hands, and we're all the happier for it. Max is back, and he's finally been to the toilet.In a game with so much twisting and overlapping narrative, it would be more than little ungracious to give away more than the bare bones. Suffice to say, Max has left the DEA, joined the NYPD, and a fairly routine investigation turns his world upside down with Max falling for a Femme Fatale and inevitably going beyond the call of duty to bring down those responsible for his torment.Once again the game punctuates the action with frame after frame of graphic novel-style narrative, and first play through you'll probably be slightly confused unless you play it in one sitting and make a few notes to remind yourself of what the jiggins is going on. Unlike the original's stylised photographs (featuring members of the development team, the cheapskates!), the sequel uses a far more pleasing hand drawn approach, although the same script writer and voiceovers are present throughout - so we get the same slightly over the top dramatisation of events, but when you're involved in the most over-the-top action game ever, it all seems to make perfect sense.In a game that took us just seven hours to complete (including watching all the narrative and some tricky later sections), it's fair to say that not a lot has changed - it's just this time we were a bit handier at stabbing the quick-save key and were already familiar with the controls. Outside of the obviously gorgeous graphics engine you'll be playing a game of spot the difference, which amounts to no more than a few tweaks rather than any major additions.The first change you'll notice is the addition of Havok physics, and although it has been used in other games, MP2 is the perfect title to show it off in. From the word go you'll notice that even seemingly insignificant objects can be moved around and knocked over, with fairly comedic implications at times. Use the drinks machine and a can drops out, which Max can kick around to kill some time. At times though it's rather odd and inconsistent, with certain objects feeling like they have no weight, with limp sound effects and the inability to destroy them compounding this.But once the novelty value wears off of being a bull in a china shop, the effect during the numerous firefights lends the game an often astounding level of dynamic cinematic detail that varies every time depending on where the bullets hit. Of course, you'll have seen rag doll physics before, but you can't fail to be impressed when a goon gets blasted off the side of a building, crashing into scaffolding and creating a huge chain reaction of flying objects, shattered glass, broken step ladders and flailing limbs in slow motion. For graphics whores wanting to show off their top spec PC, then this is it, although it's worth mentioning that our now relatively humble P4 2.2GHz/512MB/GF4 Ti4600 never once stuttered even with everything turned up to full detail.Adding colour to all this action-packed mania are some of the finest backdrops and scenery ever to grace a videogame, with a consistently breathtaking array of nigh on photo realistic texture detail across numerous varied and well-designed environments. MP2 also plays host to some excellent use of lighting, particle effects and a far better collection of character models than were featured in the original, although Remedy still has a way to go before it finally gets its character models up to the standard of the rest of the game. Outside of the game's half dozen main characters, the endless cannon fodder that pads out the game seems a little too generic much of the time, but they're still superb in comparison to most games out there; it's just that Remedy has set such high standards elsewhere, the lesser elements stand out that much more.A few tweaks have been made to the marvellous Bullet Time system. Notably the colour scheme switches to a sepia tone while you're 'in the zone', and the effect of killing while you're in Bullet Time now slows down time even more, changing the egg timer to yellow, while the sound audibly lowers in tone, Max's heart beat slows and your killing spree can get even more intense. It doubtlessly makes things a little easier, but the enjoyment of diving into a room to pick off everyone in it has been enhanced considerably.Another smart addition is the ability to stay on the ground after a dive - so long as there's ammo left in your gun - allowing you to evade enemy fire that fraction longer. You'll also find Max is generally easier to control during bullet time, allowing the player to pull off any combination of shoot dodges, as well as simply run around in the slow motion. We found diving around still the best way to deal with crowds of enemies; especially given the 360-degree fluidity that mouse control offers you - something we fear for when the console versions are released come December.The weapons system has come in for a pleasing minor tweak, allowing Max a secondary fire which enables him to arm himself a Molotov cocktail at the same time as firing, which makes for a useful addition while you're frantically diving around. Alternatively you're given a rather useless close quarters melee ability, enabling Max to rifle butt an enemy in the face. Useless, because you rarely, if ever, need to get that close, and ammo is hardly in short supply. In terms of the weapons line up, it's almost exactly the same as before, with only the MP5 SMG, an AK47 and a Dragunov sniper rifle new additions - not that you'd really even notice this unless you're particularly familiar with the previous game.The health system is also exactly the same, with numerous pain killers dotted all over the place, and even falling out of downed enemies. Supposedly there's a self adjusting skill level, with more pain killers becoming available if you're struggling, and if you're taking your time over a task, Max will pipe up with explicit hints to hurry you through. It's as if Remedy never wants the player to be frustrated at any stage - but those seeking a challenge will have to complete the game at least once to be given one, as the harder skill levels remain strangely unavailable until you do.As a final new addition, Remedy has also injected some rudimentary co-op elements, where Max is occasionally backed up by allies, although it's fair to say this buddy mechanic hasn't been exploited as fully as it might have. If these expendables get killed it makes no difference, apart from the fact that it's often a little harder to fight off the masses without their help. You might miss out on a few snippets of speech appear if you don't keep certain people alive, but the whole package is completely linear in all other respects. Despite this, it won't spoil your enjoyment; you'll be too busy messing around with the physics to care one way or the other.Finishing the main game also unlock the old mainstay of Max Payne, New York Minute, which basically tasks you with finishing any of the game's levels as quickly as possible, recording your time once you do. Elsewhere, the excellent Dead Man Walking mode also unlocks, which places Max in a choice of five enclosed environments from the game and tasks you with surviving for as long as possible against endlessly respawning enemies. But as far as multiplayer goes, there's once again no means of duking it out with some pals, although the mod community will presumably be kept busy, extending the life of what is an often insanely entertaining single player game.In almost every sense, Max Payne 2 feels like a complete action game, a Die Hard gaming equivalent, keeping the pace intense throughout, supplementing it with some excellent over-the-top melodrama, and never taking itself too seriously - what other game blatantly rips the piss out of itself the way Max Payne 2 does with its Dick Justice and Lord And Ladies TV interludes? It's likely to be deemed too similar to the original to attract too many converts, but it's short, it's sweet, and it's been put together with so much style it frankly embarrasses the ham-fisted efforts of most other developers."}