{"ref": "https://www.eurogamer.net/r-mafia-x", "date": "29 Mar 2006", "game_name": "Mafia", "text": "If ever there were ever a reason to ban porting PC games to consoles, Mafia is the textbook example. Having already suffered the indignity of a less than impressive PS2 port, we held out one final hope that Illusion Softworks would use the extra power and similar architecture of the Xbox to produce the definitive version of this oft-misunderstood game. Instead what we've ended up with is a six month-late conversion that to all intents and purposes is functionally and technically identical to the scarily compromised PS2 version that disappointed us so mercilessly earlier this year.To rewind a little, the PC version divided people back in Summer 2002 over whether it was some sort of cinematic masterpiece that sympathetically translated the raw passion of 1930s mob factions and all the double crossing and ruthless second guessing that goes with it, or whether it was just an ill-conceived Grand Theft Also with finickity AI and ropey driving.To a greater or lesser extent, all of these elements still hold true even now, with some exquisite story telling, superb voiceovers and delicately detailed cut-scenes often ruined by overly twitchy, almost psychic enemy AI, constant to-ing and froing across town in cars almost ruthlessly modelled on reality and some of the most appalling graphical crimes committed in any major game release in years.But before we let rip with our thoughts on some of the less appealing elements of Mafia, it's worth bearing in mind that at time the game can deliver some of the most enjoyable and memorable action segments around. Out of the game's 20 odd missions, at least half of them feature stand-out brilliant moments in terms of marrying the energy and intrigue of the story with some often genuinely harrowing incidents. The moment you burst in on a funeral service is both an unexpected treat and an example of how Illusion is gifted at creating convincing gameplay environments that deliver filmic moments of intensity that work brilliantly both within the context of the story and as standalone gaming set pieces.Broken down into its constituent parts, though, Mafia is all too often an ill-conceived mess of half-finished ideas and gameplay elements that plainly are not fun or well realised on any level - no matter how much you admire the storyline and atmosphere.Take the driving elements, for example. Faced with an ideal template of producing a living breathing town of Liberty City fun and intrigue, what the developer came up with instead is filled with idiotic drivers, over-zealous police, single file pedestrians and cardboard cut out buildings with little character that mostly pop up into view in a manner that would shame a PSone.If you're not having your time thoroughly wasted by a mission design that seems to delight in forcing you to go from one side of the map to the other in a vehicle with all the acceleration of a horse and cart, it's placing you in environments where enemies know your whereabouts the millisecond you step out from behind cover and cap you with a pistol from frankly ludicrous ranges. It's only iron will and determination that can get you through these kind of mishaps, and sometimes it's worth it, but others you're left cursing one too many times to make it anything more than an exercise in proving your abilities in the face of rotten game design.As with the PS2 version, some of the PC version's more ridiculous quirks have been smoothed out, so you can tackle the racing day level on Very Easy, for example, rather than spend hours trying to wrestle with insane handling and unerring AI. Likewise, the final mission no longer features grenade-lobbing cretins, but it's still one of the hardest end missions we've ever played, either way.The game's also all the better for having a 60mph limit around town than a frankly stupid 40mph one, but the addition of races as a bonus adds precisely nothing to the game, mainly because driving is the last thing you want to do in Mafia. Literally, if they had made it a mission-only game with no driving it would have improved it immediately. Replaying it for the third time only served to remind us how painfully pointless the first couple of missions really are. Why, Illusion Softworks? Why?As for the simple matter of the quality of the conversion, well, it's bordering on a disgrace. The FMV is a low grade sample of the delightful PC original (which seamlessly integrated in game), the town looks like the PC version on the lowest possible detail settings, the cars fare just as badly and the whole thing appears to move with about as much grace as if it were running on PIII 500 with a Rage Pro under the hood. As for the character models, don't even get us started. The only areas that just about stand up are the interiors, which, while nowhere near the quality of the original, still seem striking enough to warrant a little praise.We're sorry to heap such bile on a game that we actually like at times, but it's a bit like hearing a bad cover version of a song that you've grown to like that some people still maintain is rubbish. Our advice? Buy the PC version of Mafia - it's about one eighth of the price of this curious caricature and any half decent graphics card will render it in all the glorious detail the developer intended."}