{"ref": "https://www.eurogamer.net/r-conflictds-pc", "date": "29 Mar 2006", "game_name": "Conflict: Desert Storm", "text": "It's tricky to pinpoint exactly what makes a good tactical action            shooter. Is it the tension as you guide your troops into hostile            environments, completely outnumbered with the odds against them? Is            it the ability to command like a professional and think on your            feet instead of watching the action from afar? Or is it the sheer            excitement of sweeping through the most closely guarded enemy            installations without making a sound? In an ideal world, a good            title has an excellent command of all of these and then some - how            about Conflict: Desert Storm?                    It's fair to say that I was immediately put off by Desert Storm's            looks. I know, I know, book/cover and all that, but it really does            look particularly third-rate. The textures are fuzzy, the low-poly            character models have almost featureless faces, and the vast            environments are so angular that they'd look more at home in a            theme park. However, we gave it a chance, and behind its bargain            bin looks is a surprisingly engaging and atmospheric game.                           Obviously taking place during the Gulf War in 1991, the game            centralises on four characters that build up your squad of            troopers, but starts with some obligatory training from a            particularly loud-mouthed American instructor. The training is            essential for learning the nuances of the command interface in            particular, and is an indispensable feature. It's just a shame the            proceedings couldn't have been made more palatable by not having            the instructor monotonously yell every single instruction at you            for the fifteen minutes your training takes.                    Getting into the action proper, the game first offers you the            pleasing choice of joining either the British SAS or the American            Delta Force. Naturally we selected the former and headed off into            the fray. Starting off with a single soldier, the first mission            involves the search and rescue of a comrade held captive in an            Iraqi bunker. Once retrieved, you set him to work aiding you in the            destruction of a crucial supply bridge. You really are thrown into            the thick of things from the word go, but the learning curve is            barely noticeable and you pick up the controls in no time.                           Once you find a fellow soldier at some point during a mission, he            then joins your squad for the next. For example, the prisoner you            rescued on the first mission then aids you in escorting the Kuwaiti            Emir to safety, and it's during this outing that you meet up with a            fellow who eventually becomes your heavy weapons specialist. As you            pick up a team member, you're able to switch between them easily            with number keys and control them directly, along with their            associated arsenal.                           If you prefer a certain character's traits, then you can choose to            be him and command the rest of the squad with the HUD interface.            Commands range from simplistic Rainbow Six-ish group and individual            hold, advance and follow orders, to a variety of more detailed            options. Particularly handy is the ability to command a soldier to            advance to a specific area and face in a certain direction. While            the functionality is there though, the system is primarily keyboard            shortcut based, and it can be tricky to remember the commands for a            good few missions - we would have preferred some kind of graphical            command interface to go with it. One other disadvantage the system            has is the inability to queue up commands in order to execute any            kind of flowing plan of attack, and this is due in part to the lack            of an in-game tactical map which is frankly a baffling oversight.                    The intelligence of your team members when you're not in control of            them is in equal parts impressive and frustrating. If you have them            all following you then they won't trail behind in single file and            once you stop to engage enemies, they have the initiative to take            matters into their own hands and crouch, avoiding your line of            sight. They'll even cover their backs when retreating from enemy            fire instead of simply running in the opposite direction because            you have. Good. Elsewhere though, they can be teeth-grindingly            stupid. If you were face to face with six or so advancing enemy            soldiers and a couple of tanks, you'd take cover wouldn't you?            Instead my soldiers deemed it necessary to shoot at the soldiers at            all costs despite the large flaming shells whistling past, and in            some cases landing on, their heads. Only when you tell them to do            so will they move their sorry behinds into a safer position. Bad.                           Thankfully the game's easier setting enables you to revive            casualties with a simple application of a med pack. Each soldier            has about six med packs with which to bolster his own energy or            that of a team-mate, and revive fallen comrades. This can render            missions a little too easy on occasions though, unless your entire            team manages to get wiped out in one fell swoop before someone can            be revived, which is a rare occurrence. However, the difficulty            level can be bumped up and the luxury of resurrecting team-mates            removed for those of you battle-hardy enough.                    Despite its very obvious shortcomings in the visuals department,            Desert Storm still manages to draw you into the combat wonderfully.            The urban environments, while low on detail, are still well            designed and the desert missions are... well, think of a dusty            Project IGI on a budget and you're somewhere near the mark. The            animation too is fairly good for the most part, although there's a            disappointing lack of variety as each enemy crumples to the ground            in the exact same way each time.                           More impressive is Pivotal's effort in the audio department, with            excellent ambient and spot effects building the atmosphere - we            were particularly fond of the goat bells clanging away in the            distance. And yes, you can shoot the lovingly crafted goats if you            feel so inclined, you weirdo. Furthermore, a context-sensitive            soundtrack complements the gameplay well, even if it does become a            little over-dramatic at times.                    Conflict: Desert Storm is an impressive effort from Pivotal. If the            engine had more spit and polish to raise the realism bar higher,            then we'd be close to a title that could become a firm favourite            with the tactical action clique. It doesn't look too hot up against            the graphical might of the Ghost Recon engine, yet we can still            imagine Red Storm becoming a little nervous at the presence of this            one. If you can forgive the whimsical visuals, then give it a spin            - at least it's a rare opportunity for those of you stuck with            low-spec systems to play something of true quality."}