{"ref": "https://www.eurogamer.net/r-onimusha4-ps2", "date": "29 Mar 2006", "game_name": "Onimusha: Dawn of Dreams", "text": "Four games in the same series within five years is likely to prove a test for even the most ardent fan's enthusiasm, but it's not much of one for Capcom, which has been testing the laws of diminishing returns for as long as we can remember, and does so again here with an extensive but no-frills update to its hackandslash series.Nearly two years ago, Capcom tried to sprinkle a little more of a Western flavour into the mix with the third in the series, and did so with a fair amount of success. Throwing Jean Reno into the lead role made for an entertaining time travelling adventure that (gasp) even made concessions for guns - a radical shake-up given the game's 16th century feudal Japanese-era roots. Sure, it was essentially more of the same at the core, but the balance between compelling combat and puzzling was almost spot-on - plus Capcom sorted the niggles that many of us had with the controls and camera.But the fourth episode, Dawn of Dreams, is one of those incarnations that has a gentle whiff of ~shall we pretend the last one didn't exist?~ about it, and slinks back to focusing on the familiar 16th century formula that its native audience presumably prefers. As ever, the story's the usual demon-slaying bobbins that's either been translated to make Westerners care as little about it as possible, or just really is that unengaging. Whatever the truth - for the record - this one's set 15 years after you managed to defeat 'evil overlord' Oda Nobunaga, with Japan 'waking up to a blood red dawn'. It turns out that Emperor Hideoyoshi is uprooting the cherry trees (Sorry? What?!), and has somehow managed to command the (endlessly respawning) Genma demons to return to frontline action, along with a plethora of beefy henchmen. Cue lone hero to the rescue.The premise may be a bit rubbish and contrived, but then again when isn't it? In this case, you get to control a young blonde-haired, blue-eyed warrior in the shape of Soki. As generic as he is (complete with a Dante-esque penchant for wearing his swords on his back), it doesn't detract from what is another fast, furious sword-waving, magic-casting, demon-slaying, puzzle-solving epic that's easy to get straight into and provides 15-20 hours of good hacking, slashing fun. And much like the last game, there's even a plethora of additional playable characters to add to the variety (skinny fast girl, beefy bloke, arrogant warrior) who you get to meet at various stages of your adventures. In short, it's not going to change your world, but there's little wrong with it and for fans of the series you can't go far wrong. Think of it as an expansion pack.In keeping with the rest of the series, the gameplay pretty much follows the exact same template as before, with most of the action focused squarely on intense bursts of combat, punctuated with odd bit of object-hunting and puzzle-solving. As ever, this essentially involves studious use of the attack, block and magic buttons to scythe your way through an almost endless procession of foes. Although the combat's far simpler than, say, Devil May Cry (or even God of War), careful timing helps you clock up combos and critical strikes, not to mention allows you to evade even the most deadly assaults.Predictably, the death of every enemy allows you to suck up their souls and pick up their gold, which in turn allows you to level up and enhance your skills and weaponry - a very refined experience system that works as well here as it ever has. Within a few hours you'll be able to power up your various capabilities, which in turn opens up new combos, making the combat gradually more complex and involving as you go along. From being an utterly simplistic button-masher at the start, it's not long before the game starts to become a lot more involving, requiring plenty of strategy and skill once the game gets going.One major new addition in Dawn of Dreams is the new command system, allowing you to deliver basic orders to your cohorts via the d-pad, such as all-out attack, attack and follow, wait, as well as a character-specific skill. As useful as it sounds, it merely shows up the limitations of the buddy AI, with characters either far too gung-ho for their own good or not effective enough. To get around these limitations, downed buddies never actually 'die' no matter what, meaning that they'll wake up and rejoin the battle after while. Not only that, ordering them to wait recharges their health halfway (which is a bit of a cheating fudge) or you can go the whole hog and take full control of them and take advantage of whatever special abilities they might have (while cheating and allowing your other character to recharge their flagging health). For example, certain characters can squeeze into small gaps or can communicate with the dead, while others have explosive abilities or can use a grapple. As such, this teamwork ethic is a reprise of the kind of environmental puzzles seen in Capcom's Resident Evil Zero, and often forces you to traverse seemingly simple locations methodically pulling levers, operating lifts and picking up otherwise inaccessible objects. All the while, the Genma hordes keep on coming, always giving you a chance to flex your combat muscles in the process.On top of that, the game also offers up optional puzzles in the form of simple (yet fiendish) challenges that task you with lining up three rows of coloured blobs within a set number of rotations. With special (often more powerful) weapons and defence/attack boosting trinkets up for grabs, the ends are mostly worth the means.But on the whole, the game is an incredibly formulaic grind that settles into an immediately identifiable pattern right from the beginning - just like the previous games in the series. The carrot of all those upgrades, new skills, new characters and the end-of-level boss encounters always seems within reach, and thanks to the bite-sized level design you're always motivated to continue until the next section... and then find yourself poking around the one after too. The one major issue we had was more to do with general gameplay balancing, with certain bosses seemingly only there to hold you up. After something as revolutionary as Shadow of the Colossus, this dead-eyed return to boss-by-numbers feels positively cute. They're all of the three-attack-patterns-on-rotation variety, and finishing them is more of a war of attrition than a test of skill. Old school fun, but nothing you haven't seen 50 times over.Unlike the previous sprawling adventures, Dawn of Dreams is divided very specifically into 17 stages (which you can revisit between levels with the newly unlocked characters), spread over 2 DVDs, making it (by some distance) the biggest in the series to date. More doesn't always equate to better, as you know, but at least it should keep those folks quiet who complained about previous Onimushas being too lightweight. On the other hand, it also goes some way to making you even more aware of the slog. Whereas previous games in the series left you wanting more, halfway through disc one of Dawn of Dreams you're already wondering whether you can take another 10 hours of repetitive demon slaying. It's not as if the unravelling story offers any great incentive, and with so much to read, and so many incidental conversations to wade through between levels, it's often quite a drag. The fact that there's an unlockable hard mode and a two-player arena battle mode when you finish the game isn't much of a draw.An unfortunate side issue is the game's lack of technical merit. Although it's solid and pretty enough (certainly no worse than previous efforts), things have once again moved on from where this engine was a few years ago. Stood next to any comparable title in the genre, Dawn of Dreams is looking sub-par. Lacking the progressive scan and widescreen options of other recent Capcom releases, the game suffers. Next to, say, God of War, Resident Evil 4, or even Devil May Cry 3, it's looking quite dated. The backdrops, character design and animation's fine up to a point, but the problem is we've seen so much better - and things like the blurry cut scenes seem rushed and point to a general lack of attention to detail. As with Onimusha 3, the game offers two-stick movement/camera controls for much of the game, only to revert to the frustrating old static camera angles of the past, complete with disorientating viewpoint changes. It's not a deal-breaker (especially as the lock-on button is a useful aid) but we really wish they'd make their minds up. The RPG-elements are a bit broken too. As gratifying as it is to level up all your characters abilities and weapons, the fact that you can keep switching between characters to get around your failing health is a ruinous mechanic that you can't resist using. As a consequence, nothing's ever that much of a challenge, and getting through the game feels less satisfying than it used to. Evidently they either didn't think this through, or they're making concessions to the masses, as usual. Either way, it's not a smart move, especially when the game checkpoints before every screen regardless.Rather in the same way that Capcom milked the Resident Evil series to death before it reinvented itself, Onimusha is one of those really enjoyable games that's now been left behind and seems content to be stuck in a rut. In isolation - and compared to the other games in the series - it's a game you can get really engrossed with, but also one you can get quite tired of. The combat's fluid, relatively deep and involving once it gets going, but it's also a wholly repetitive game that's been surpassed in so many meaningful ways that you can't simply be content with 'more of the same' anymore. By all means rent it; die-hard genre fans won't complain, but if you're looking for the next big hack and slash epic that does something new, there are more exciting options around than Dawn of Dreams right now."}