{"ref": "https://www.eurogamer.net/r-commandosstrikeforce-pc", "date": "27 Mar 2006", "game_name": "Commandos Strike Force", "text": "The sneaky, stabby, thinky Commandos series has delivered some of the most tactically interesting PC games of the past decade. Using the abilities of a small group of men to overcome all kinds of complex World War II scenarios has been a consistent delight, even if many of the isometric challenges have been 'a bit tricky' to master. However, that mild trickiness is as nothing when compared to the task of converting this real-time strategic opus into an FPS. Such an ambitious idea was never going to be easy to realise, and it's a little disappointing to report that it only just works in Strike Force.This 3D incarnation of the squad-based strategy presents us with three character archetypes that are recognisable from the original series. There's the sniper, the spy and the Green Beret. Each of these chaps can now be controlled in FPS style and each has a forte all his own. Needless to say, their personal abilities must be used appropriately by you to overcome the various obstacles which Strike Force delivers.The spy is the stealthy one (even though all the commandos are given to a bit of sneaking). He is also the most fun to play, since his challenges are the most esoteric. Of course he ends up gunning down some Nazis now and then, but his key weapon is disguise. The spy can nab a Nazi uniform and use it to infiltrate the enemy bases. The higher rank uniform you manage to obtain, the safer your disguise is likely to be. Getting past a bad guy of equal or lower rank than your uniform is fairly easy, but the higher-ranking officers will detect your subterfuge in an instant. This creates some unique situations and also manages to deliver a high degree of tension when you're desperately trying to pilfer the uniform that will see you safe, while all the time watching for that nightmarish Gestapo officer. Actually obtaining the uniform is best done by stealth kills, for which the spy has a garrotte. If you stay quiet you can garrotte and kill a soldier in complete silence - even nearby soldiers won't notice. Checking rooms by looking through a keyhole means you can wait until your quarry's back is turned before striking. Elsewhere you can even distract people by lobbing a coin. While they puzzle over the noise you get to sneak in and administer some ugly strangulation.Meanwhile the cheery cockney sniper also relies on stealth to a greater degree, and he is equipped with throwing knives for the purposes of the silent kill. Of course this partly means that he can get around in safety while he's finding somewhere good to snipe from, although much of the script means that you don't have to do this manually, and simply find yourself sniping for your life at a high vantage point. The sniper can hold his breath for a slow-mo accuracy shot, and can regularly line up and take out two Nazis with a single bullet. It's top quality sniping, with the singular niggle that the scope doesn't zoom in exactly where you have the crosshair pointed, leaving you scanning for the correct target with irritating regularity. The sniper is regularly underused, and you find yourself leaping back to him with the sense that he should be doing something else... but what?Meanwhile the Green Beret is on the ground and killing like the American hero. He's the toughest cookie of the three, and will regularly deploy multiple side-arms, happily using two weapons at once to square his kill-rate. There are numerous moments in Strike Force where you simply need to put a lot of bodies on the floor, and the Green Beret will see to that. He'll also heal allies and himself, as well as being best placed to lob grenades into the midst of hapless infantry. His is the most familiar FPS challenge, and the occasional bursts of firefight are genuinely engaging. This latest Commandos game doesn't shirk on the gun action simply because it has a history of stealth and sniping elements. Sure, it lacks the raw intensity of the recent Call of Duty games, but it doesn't miss the mark by much. The screams of fallen allies can be really pretty harrowing, even if they're far from the yelled extremities of Brothers In Arms.Anyway, Strike Force's real trick is integrating these three characters in a single level. While you're initially faced with solo escapades, you can soon flip between the three, sorting out problems on the fly. Their abilities don't necessarily complement each other, and solutions aren't always obvious: you just have to find the best way of putting them together so that objectives are defeated. Clearly the sniper can provide cover for the other two, but it's not always so clear-cut with the 'stealth or action' decisions. As a result of this the quality of the missions is variable, with some chuckle-inducing situations offset by those that make you want to chew through your knuckles with frustration. Strike Force's finest moments are where things go slightly wrong, but you manage to bodge it anyway.One problem with all this is that the stealth is fairly wobbly. Enemies need only a few pixels of concealed commando to be exposed before they go off like a teutonic klaxon and start with the shooting. A row of boxes is no use as cover if there's a narrow gap between a couple of them, since Gerry will spot you right away. Likewise the 'alert' timers are completely arbitrary. Soldiers can see their friend die in front of them and still go back to their 'normal' unresponsive mode after 20 seconds have elapsed.There's also some inconsistency in the polish of the various challenges you'll face. For example, the opening level is slow-paced, pleasingly explanatory and filled with some satisfying action, but it's then immediately followed by a confusing, frustrating and overly complex battle that doesn't make much sense and is extremely awkward to overcome. In this case the problem is the reliance on AI friends, who fail the mission if too many of them get killed - this isn't something you feel like you have much control over, so it's fairly irritating when the level restarts thanks to something that really never feels like your fault. This isn't the last time you'll encounter such annoyances in Strike Force, and they're not all down to strop-inducing AI. The fact that annoyances arrives so early is disappointing. Despite my grumbling I am glad I stayed the course: Commandos does entertain, especially as it becomes more ambitious, and more recognisable as a Commandos game. Each of the three commandos has his moments of heart-stopping heroism and extreme tension (although the spy is the most entertaining). There have been several crucial moments that made me laugh out loud, and others that made me feel a sense of cerebral accomplishment - feelings that are all-too rare when playing an FPS. I suppose it'd be fair to say that the Commandos series has been successfully updated, but not without the sense that it is lacking something of the detail and complexity of its RTS cousins. With so many other, stronger games around right now I somehow suspect that Strike Force will earn few medals by the end of its tour of duty."}