{"ref": "https://www.eurogamer.net/r-sfa3m-psp", "date": "16 Mar 2006", "game_name": "Street Fighter Alpha 3 Max", "text": "Street Fighter II was the game that shifted most fighters from arcades to home consoles. Since those days though, we've seen some truly abysmal offerings. Who can forget the nightmare that was Capcom vs. SNK EO's appearance on the GameCube? Or the abominable Capcom Fighting Jam?Street Fighter Alpha 3 MAX falls into line with the majority of Street Fighter games after II. Silly name? Check. Hordes of characters from aborted fighters? Check. Mismatched quality artwork from character sprites to backgrounds? Check. But what's it like? That's the question. Is it like Danny LaRusso returning to Mister Miyagi years afterwards and ambling up to his paper house to the sound of chopsticks snapping expertly around mosquitoes? Or is it more like LaRusso wading through the undergrowth towards a bitter old drunkard lying in a pool of his own vomit?It's nice to be able to open with the fact that we don't see too much in the way of load times throughout. There's a chunky initial load, but beyond that they shouldn't be long enough to bother most of us.What MAX holds above and beyond its predecessors are additional modes of play and Ingrid (formerly of Capcom Fighting Jam infamy). While many (myself included) are quick to shun Ingrid, her style of both design and play is so far removed from the standard Street Fighter fare that she's a welcome addition for anyone bored with the current line-up.On the subject of play modes, Survival and Final offer some play for those of us uninterested in playing through the unbearable drudgery of Story Mode. While World Tour is still more of an exercise in masochism than the RPG-styled play it could have been, the ability to manage multiple characters in a single stage hasn't diminished at all and is one of MAX's greatest strengths.We've seen so many attempts at multiple characters being invoked at once that the fact that simplicity works best doesn't come as a surprise anymore. This is an important point for anyone irked by the SNK 'Striker' system [SNK's attempt to include extra characters. Players chose a primary character and a 'striker'. During the game they could tag the striker in for a free attack but it never really worked - Ed], or Guilty Gear Isuka's bizarre, 'press R1 to change direction' method. In Street Fighter the characters autoface attackers; it's a simple method that works.There's nothing at all wrong with porting Street Fighter Alpha 3 from the multitude of consoles it has already appeared on to the PSP, and Max is closer to the console versions than the arcade experience. The transition is silky smooth, slipping into the slinky black number effortlessly. The condensed screen size means that those characters that had looked just a little ungainly don't flag themselves quite as much, but playing a little will reveal those characters that have seen least change since long before Street Fighter Alpha 3. As Miyagi-sensei often said, ~Paint the fence.~ Capcom's fence has been painted by the smaller screen, which in turn provides its own issues. The real beef here is the widescreen support, which seems to stretch the game rather than show more of the scene. It's a small complaint but considering the genre being worked with there really is no excuse. The real achievement of SFA3 is the integration of those few and proud characters surviving less... successful games. Guy and Rolento have not only managed their transition from Final Fight well, but remain darker than Street Fighter's usual host of colourful misfits. It's an achievement that carries them well and won't disappoint character-specific fans. While many have had strong words for the PSP's d-pad, that's not where serious players will take issue with MAX. While the comparable Alpha 3 port to the PS1 enjoyed the use of all four shoulder buttons, MAX has no such luxury. Previously we saw heavy punch and kick spun to the right shoulders, now one must see use on the L button. It's a question of logistics; while some of us can balance the PSP without the first finger of each hand, it's damned near undoable during some of the more infamously difficult special attacks. It's difficult to get a bead on what these control issues mean without looking at character specifics. Rolento, Gen and Adon are all heavily impeded by the lack of a control configuration that puts all six of the available buttons within easy reach. Thanks to the length judging on Rolento's more mobile attacks (the Makon Delta Air Raid and the Patriot Circle, not to mention the knife throwing ranges), not having access to three strengths of attack limits character playability and hurts game balance. Gen's variable stance attacks suffer in much the same way while Adon issues are more fundamental; it's downright awkward to play as Adon while effectively missing an attack button.Japanese pre-orders of MAX shipped with a magnificent d-pad attachment, designed to ease the thumb-stress of dragging out dragon punches and fireballs at a rate of ten a second. While we might not be graced with the same gift, the original Alpha 3 anywhere but on an arcade stick was murderous to control; players without calluses became players without victories. Rather than keep this setup, MAX has the option to switch to ~easy~ mode, which ups the recognition of special attacks and prevents blood being spilled.MAX sees no change to the various '-isms' many will remember from previous incarnations of Alpha 3 [and if you don't remember, 'isms' are styles of play, essentially varying methods of controlling a character's 'super combos' - Ed]. They vary from '-ism' to '-ism', one allowing full strength super-attacks only, another allowing users to use their charged bar in parts and a third for a hail of custom attacks. Thanks to some clever balancing, different '-ism' choices make characters faster, stronger or in some way compensate for what other choices would supply.That said, this is where the MAX itself falls down. While most Capcom fighters have moved on well overall, going on to include some of the most accepted innovations in the genre, MAX is a port of a game predating some of the most worthwhile additions.Special attacks can sometimes dominate stages in MAX to such an extent that spamming fireballs will reliably force an opponent to jump, leading to the inevitable dragon punch knockdown. It's not always possible, but it can happen. Thanks to its age, we don't see any more recent equalisers like the parrying that still makes SF 3rd Strike such a sought after game. Neither will players see the P-Groove, which rewards parrying with extra super-fuel or the K-Groove, which rewarded clever blocking with extra juice. Alpha 3's age shows in its play and, as much as we enjoy simplicity, we've been spoiled by more recent titles.MAX might well be endearing, but most of its playability comes from the fact that it is a port of one of the best games in a long-lived series. So many iterations of Street Fighter have appeared over the years that it's easy to believe that the less playable elements have boiled out on the way. Sadly, the ~process of elimination~ approach it took to get to MAX means that most of us have had our fill of old street fighting, and instead yearn for something new.Street Fighter Alpha 3 MAX's appeal is best summed up by the man himself, ~Wax on, wax off.~ The sheen that Alpha 3 gains by being thrown onto a handheld is just a fresh coat and it didn't take long for us to remember why we put down the hadokens after its original 1998 release.That said, for beat-'em-up fans looking for something handheld to play with a gang, MAX is more than a fine choice. If not, the inclusion of Guilty Gear XX with Judgement will probably already have convinced many players to hold on."}