{"ref": "https://www.eurogamer.net/bubsy-the-woolies-strike-back-review", "date": "3 Nov 2017", "game_name": "Bubsy: The Woolies Strike Back", "text": "Bubsy and his platforming ilk remind me in a strange, tangled way of high-frequency trading. This is the dodgy Wall Street manoeuvre, as detailed in Michael Lewis' Flash Boys, in which money men exploit their speedy internet connections and clever algorithms to spot your buy order leaving your computer, get in front of it, grab the stock you want and then sell it to you for a tiny profit - a tiny profit that becomes an enormous profit when you scale it up to the point where you're pulling this off a gajillion times a day. Stick with me here: high-frequency traders only lurk in the financial markets because you do. Bubsy only lurks in the market for platformers because of other, better platformers, combined with the Bubsy designers' sly hope that all that retro-platforming desire washing around means that there is a bit of money left over for them. So if high-frequency traders exist because you want to buy something; Bubsy exists because you want to buy something else. The big difference, I reckon, is that Michael Lewis is never going to write a book about Bubsy.Regardless, after many years away, the series has returned to us in the form of Bubsy: The Woolies Strike Back.Bubsy is a bobcat. He collects yarn for fun and possibly profit, and now someone has come along and stolen his yarn. So off goes Bubsy, across a handful of side-scrolling worlds, to get his yarn back and give his enemies a good shoeing.Bubsy has three moves. He can jump on an enemy's head, he can do a pounce attack, which sees him leaping from the ground in an arc that can take out distant enemies or knock through collapsable walls, and he can glide out of a jump and settle gently to the earth. There are a small selection of enemies to tackle, and traps like spikes, water pools, lava pools (when you die on impact with water, lava is basically a palette swap) and flaming boulders. Some platforms start to rise when you step on them. Some start to drop away. Some stay in place and get a little older. Three boss fights in total, all against the same guys, and really, that's about it for Bubsy. I have two hours on my Steam clock at the point of completion, but I spent at least forty-five minutes doing other things while Bubsy was running in the background. If, unlike me, you are fairly good at games, I reckon you could clear this in half an hour. If you want to collect all the stuff scattered around levels - the jerseys, the five keys that open a vault in each stage - and if you want to do it all without dying, I imagine you could stretch Bubsy out to the three or four hour mark. There are leaderboards and an on-screen timer for speedrunning, and I imagine there probably is a Bubsy speedrunning scene because this is the internet and a friend of mine has a Tumblr where he records all the amusingly deformed crisps he's found over the years. (He has a Square with a perfect circle in it! Quite the thing, conceptually.) But still, Bubsy is slim pickings even for a fan.I don't mind short games at all. Bubsy's real problem is that it isn't that interesting. Its platforming stages are interchangeable save for the odd new gimmick that is introduced over time - certain walls you can climb, fans that will blow you into the air, jump-pads that might just be your undoing. No matter what the designers come up with - and, frankly, they don't come up with as much as you'd hope - the end result remains curiously shapeless, with no sense of learning a trick and then having it subverted, no sense of escalation as different ideas converge. Bubsy travels through three different environments, but there are no sights worth seeing. The music in the background sounds like the kind of Casio noodling you'd hear if you were on hold during a call to the Book of the Month Club in 1987, and Bubsy himself chatters inane catchphrases every few seconds - until a bug suddenly silenced him when I was playing.Does Bubsy have fans? Certainly. I can imagine people with fond memories of Bubsy from the old days, but I suspect they're going to be the most disappointed by his latest adventure. Bubsy moves over the ground weightlessly here. The collision detection is iffy. The whole thing feels like the kind of free platformer you might download on your smartphone only to discover that it's a front for malware that syphons your bank accounts or runs up Uber bills in Sheboygan. And look at that, we're back to financial matters again. Unless you really, really love Bubsy, it's probably best to keep your money this time."}