{"ref": "https://www.eurogamer.net/dishonored-2-review", "date": "27 Oct 2017", "game_name": "Dishonored 2", "text": "I wanted to save everybody in Dishonored 2. Not just from death - though during my first 25 hour playthrough I did, indeed, try to leave as many people upright as possible - but from themselves. If the strongmen, aristocrats, crooks and paupers of balmy Karnaca have anything in common, besides leathery complexions and comically oversized hands, it's that none of them are beyond redemption. Each villain in the game harbours a few, fitful sparks of virtue, a glimmer of promise you may detect while eavesdropping from a windowbox or rifling through diaries for hints about routes and hazards. All of them deserve a second chance, and in a handful of cases, you're able to give them that chance. Providing, that is, you are patient and attentive, and providing you resist the siren song of the game's more spectacular and corrosive abilities.Gleaning hope amid squalor is, for me, as much the point of Dishonored 2 as wresting back control of the Empire of the Isles, from whose seat of government in Dunwall you are rudely toppled during the prologue level. Whether you choose to play as Emily Kaldwin, deposed empress, or her grizzled father Corvo Attano, among the first things you'll see when you get off the boat to Karnaca is a river of blood, blazing a path along the dockfront to the body of a slaughtered whale. It's a ghastly sight, but step closer and you'll discover something precious, a minor victory plucked quite literally from the jaws of defeat. Similarly, at a glance you may despise the xenophobic Overseers who hold court in a later chapter, but sneak into their fortress - perhaps using the area's periodic dust storms as cover - and you may be surprised by how much you warm to them. A band of thuggish zealots or an army of lost souls, clinging to the reassuring iron of an oppressive creed? The key prop here is once again the Heart of Dunwall, an artefact from the original Dishonored that whispers melancholy insights about those around you (including your allies, all of whom have demons of their own to wrestle with). It's just as compelling, and nauseating, a means of delivering backstory as ever, though its power is diluted by a plot that too directly answers the question of the Heart's origin.Moral ambiguity is, of course, a familiar touchstone for games that pride themselves on the sophistication of their storytelling. But what sets Dishonored 2's universe apart, the subtlety of its incidental writing and location design aside, is how all this shapes and colours the tools at your disposal. The game's two leads aren't just infiltrators and assassins in the Sam Fisher vein, sidling out from under a table to hurl a flask of chloroform or litter a patrol route with traps. Each is designed to be an agent of corruption or salvation, a viral entity eating its way to the centre of an area and either plunging it further into chaos or quietly setting it on the road to recovery. Many of the game's supernatural powers are as much social or political metaphors as they are instruments of play. Emily's Domino spell links the fates of up to four characters within a certain range to create opportunities for savage poetic justice - you can arrange for a guard to indirectly kill himself, for instance, by taking a careless swing at you while you're using his friend as a human shield. The chance to bag four scalps for the price of one aside, I love this ability for how it sidesteps the question of rank or station, insisting that all lives are interchangeable however fine your clothing or expansive your retinue. You might eliminate a well-protected bigwig, for instance, by tethering his destiny to that of a cook, labouring over a stove in the next room along. If there's no convenient bystander available, Emily can also summon a doppelgänger, Domino-chain it to the target and assassinate her clone for the same payoff. Or just conjure a hypnotic phantasm from the ether and drop spring-razor traps in all the doorways while her victims are enthralled.If Emily is something of a stage manager, bamboozling people and pitting them against one another, Corvo is more of a free-roaming infection, transmitted from one NPC to another. As in Dishonored, he can possess humans and animals (nowadays including insects, and even corpses) to escape detection, summon rat swarms to distract or overwhelm, and stop time itself in order to fine-tune the odds in a brawl. The recycling of abilities is off-putting at first - you'll definitely want to try out Emily's side of the story first - but powers are much more malleable in Dishonored 2, so even a familiar ability can be bent out of shape over time. You can upgrade Corvo's famous Blink teleport to pass through glass without breaking it, for example, or spend runes on Devouring Swarm in order to walk around with two rodent hosts at your back, like a Todd McFarlane reboot of the Pied Piper. Emily's spellbook is just as customisable. Her Blink equivalent, Farreach, can be upgraded into a classier version of Scorpion's harpoon line, whether to snatch an item from a desk without leaving the shadows, or to yank sentries onto the point of your sword before they can raise the alarm. The bone charm system of the original has also been overhauled. You can now craft your own bone charms, combining chunks of whalebone with passive traits that are learned by dismantling the charms you obtain in the world. Level up this ability, and it's possible to assemble some delightfully overpowered supporting trinkets - a charm that, say, turns you invisible when you choke somebody out, restores your mana when you kill from above and lessens falling damage for good measure. It's a generous incentive to replay, on top of the attractions of a different ability set, alternative character dialogue and story outcomes, though the real appeal of the collectibles is simply that they're a reason to look around.Not that you'll need much encouragement in this regard. I was a little deflated to discover that the pick of Dishonored 2's nine, multiple-area missions are the two that have been spoiled somewhat by featuring heavily in previews and walkthroughs - the Clockwork Mansion of Kirin Jindosh, with its transforming layouts and exquisitely-built, four-armed robot guards, and the quantum fallout zone that is Aramis Stilton's estate, where you'll use a mystic timepiece to shift between past and present. But these remain triumphs of level design even on the third or fourth visit. The genius of the Clockwork Mansion is Jindosh himself, a toffee-nosed inventor whose home is his own mind writ large - a decadent, restless mechanism of surveillance and containment, its bathrooms folding away into workshops, its central grand piano revolving to unveil a deadly Tesla coil. Part of the mission's enjoyment is hearing your antagonist's demeanour crack as you get behind the walls of his creation, worming your way through gearhouses and maintenance shafts to the lab at the mansion's summit. Stilton's level, meanwhile, is effectively two in one. The past incarnation of the estate is a stately, spacious pile where guards are numerous and the furnishings are largely intact, while the present-day version is a pestilent, near-deserted ruin in the image of Thief 3's Shalebridge Cradle, haunted by the leaden tick of a metronome. Some of the game's best puzzles are to be found here, as certain decisions have consequences that carry over between eras, and the decision to strip away your other paranormal abilities for the mission's duration is a well-judged clearing of the decks - it forces you to rediscover the basic art of evasion, after 15 or so hours of goofing around as a magic ninja.The other chapters aren't quite as distinctive or focused, but all have their signature elements - a quarantine zone that is contested by two NPC factions, each prepared to help you out with a tricky door puzzle if you side with them against the other, and a taxidermy museum overrun by louche, acid-tongued witches whose paranormal capabilities rival your own. The layouts aren't gigantic by, say, Hitman 2016's standards, nor are they as busy with AI characters or throwaway dramatic skits, but they're much larger than those of the original game and packed with hidden routes, traps and treasures.They're also home to some of the most arresting small room designs you'll find in a game - interiors on par with Gone Home's map in terms of how much they suggest about the universe beyond the level's parameters. There are garrets that have been recently abandoned, hasty letters to relatives scattered across bedclothes, valuables forgotten under cushions. There is a tattoo artist's studio, strewn with florid prints. There are abodes that have fallen to bloodfly infestations (exactly how many of these you'll encounter depends on how much gore you spill) - hives glowing in corners like crashed meteorites, defended by unfortunates who have succumbed to the mind-altering effects of bloodfly venom. There isn't always much of a reward for probing these spaces - a few coins and a tin of jellied eels, perhaps - but you'll always come away with a story to tell.Dishonored 2 stumbles in places. The overarching plot is a relatively pedestrian tale of revenge and self-discovery, though the script is frequently inspired - the line ~we'll drink an ocean of good wine and stay tight as a boiled owl~ really needs to be uttered more often. The appeal of sorcery is soured a little by the return of a finite mana bar - there's a grace period after you cast each spell during which the bar will recharge, but you'll need to keep replenishing your stock of Addermire Solution if you want to put together longer combos. That's for the sake of balance, of course, but given the cleverness on display elsewhere, I'm sure Arkane could have hashed out a compromise that avoids the frustration of continually finding yourself low on juice. These are quibbles, though, dismissed the second you catch sight of something ornate or horrid through a shutter, overhear witches squabbling about table manners, or peer into the memories of a tyrant and find there a child who, once upon a time, had the makings of a musician. I went into the game expecting a universe of glorious ugliness, deliciously underhand abilities, maps that are lousy with infiltration vectors, and a multitude of ways to survive any scenario. I found all of that and more, but I wasn't expecting to care quite so much about the people I met along the way."}