{"ref": "https://www.eurogamer.net/r-ddo-pc", "date": "3 Mar 2006", "game_name": "Dungeons & Dragons Online: Stormreach", "text": "What is it that makes perfectly normal human beings threaten life and limb (with thromboids) and sit watching a brightly-coloured figure automatically hit thousands of things? As a psychologist (amateur - I read my horoscopes once a week), it’s my professional opinion that computer screens put out some form of pink radiation that hypnotises, sedates and stultifies the recipient. I can’t find any other reason why people indulge in said overly repetitious avatar-based interaction, except perhaps the outlandish concept that they may derive pleasure from it. And Lineage 2, RF Online, Neocron 2, Shadowbane, The Sims Online and the execrably revamped Star Wars: Galaxies are all strong counter-examples to that.If anything could break this chain, Dungeons & Dragons, with its Live Action Roleplay Heritage, is surely our solution. Recent games based on it, with the sole exception of Dragonshard (that shares the passable background world of Eberron with D&DO), have been excellent. Even if you’ve never played D&D, you’ll recognise the game system from this hall of fame: Baldur’s Gate II, Planescape Torment, Neverwinter Nights. Well, D&DO feels, looks and plays just like them.First off you get to do the most fun part of any MMO so far; create your character, in that timeless D&D manner that’s been ripped off by everyone since, choosing your race and class, from dwarves, elves, hobbits and humans. There’s also an unexpected robot race, the Warforged, who are basically big terminators, tough as rock but bastard-hard to repair. Then you get to do the EA-patented facial moulding, haircuts and so on. (It’s not up with City of Heroes in the costume department, but then nothing could be.) At this point you have the welcome choice of going with the auto-generated character or tweaking and customising all your character’s stats, giving them new feats (like two-weapon fighting or diplomacy) and generally making them your own. Having chosen your profession, you venture out into the big bad world and fall flat on your face. This pratfall’s because D&DO makes no pretence at being a single-player game. You can do about, ooh, two missions after your training (which is wholesome, helpful and nicely plotted) before you’ll start getting beaten up by everything. It’s not like it’s small rats either, it’s giant spiders, roving skeletons and robot dogs. You get beaten up because every quest is designed for an average of four people; a level one quest expects you to have four level one people with you. (The starting area also points up a big problem with D&DO, which many MMOs have suffered from; mid range PCs have dreadful performance when there’s lots of people around. Of course, this wouldn’t be a problem, except that the game includes taverns where you go to heal up, meet parties, and so forth which are therefore packed.)The closest game is Guild Wars, NCSoft’s plot-driven semi-MMO. Like that wonderful work, D&DO is entirely driven through instanced missions, most of which are dungeons. This means whether you're hunting down an errant baker, or recovering a lost book from a buried library, you're never waiting for the thing to respawn, you're not stymied by high-end PVPers standing in your way and you're able to enjoy the carefully-plotted missions. (If you particularly like one, you can replay it on harder difficulty levels, increasing your rewards.) More importantly, instancing everything means that a mission can involve things like secret doors, traps, mazes, and friendly NPCs, and can contain proper plots that develop throughout its length. As some dungeons also lock you in and there's no health or mana regeneration, it also means no-one can afford to rush headlong into the fray; each mission is about balancing your resources and working out whether you can afford to spend them in a certain way at a certain point.This means that, more than any other MMO, D&DO is about playing a role. Not roleplaying, though there’s a cabal of foppery and forced Cornish accents around; ~playing a role~; doing the thing that your class does best. Indeed, with the aforementioned freedom of customisation, the thing your homemade character does best. Rogues scout ahead, assassinate dangerous characters, find traps and secret doors, and deal with them, Rangers snipe and talk to the animals, Bards wail enchanting dirges like Thom Yorke before they’re bound and gagged, and Barbarians charge headlong at the most dangerous enemies screaming Scandinavian epithets.And everyone fights. Fighting isn’t simply ‘hit the auto-attack button and occasionally buff your character’. Depending on your character’s abilities, you can roll, sidestep, jump and block, all of which affect how hard you are to hit and how much damage you do. This counts for both you and the AI enemies, as does ganging-up and the type of weapon in use - it pays to carry a variety of blades, cudgels, enchanted implements, and stabby-stabby things to slice, bludgeon, and pierce differently resistant bads. Moreover, the auto-attack function is slower than your own clicks, so it pays you to take part and take care in combat. Where WOW is like Connect 4, a solved game, D&D is not always predictable and relies on you swinging, dodging and blocking at the right times. That's right, like the long-mourned Planetside, it's about skill!As you get no experience from fighting enemies, only from completing quests, the game also becomes more tactical; you don't absolutely, positively have to kill every mofo in the dungeon. It’s about different paths to success. For one mission I teamed up with just another rogue, and we got through it without having to kill anything (aside from backstabbing sleeping kobolds for target practice, which doesn’t count). Even more pacifist parties could simply sleep and charm every enemy, except the mission-critical ones.It’s when you get to your first level, which takes an age, that you realise how true to D&D this is beneath the surface. All those skills and feats from Neverwinter Nights are still in there. Moreover, each level is divided into three ranks, each of which’ll take a good few quests to get through. It takes time, yes, but you feel much more rewarded than you do from MMOs that throw your first twenty levels at you, then expect you to spend six months getting the next twenty. (Not that we’re criticising World of Warcraft; it’s an excellent methadone substitute.) When you do level up, you don’t have to stick with the class you’ve taken, you can multi-class. Whether you want to redress some imbalances in your character or because you have some cunning combination in mind, this gives you the chance to continue developing your character, without having to plough back through the training levels again.We weren't sure about D&D at first; we've always soloed in MMOs and for the first three hours we just died alone, over and over. But this is the ultimate group game, and in a group the plot elements, wonderfully varied missions, and teamplay really pay off. As long as the team keep rolling out the promised content updates, we'll keep playing it. Sure, there are flaws and the lack of any soloing capability, the occasional difficulty in finding groups, as well as the apparent slowness of levelling get irritating, but they're nothing in the face of what it does properly. The hypnotic light from the screen helps pass the time as well..."}