{"ref": "https://www.eurogamer.net/r-bloodrayne2-xbox", "date": "21 Feb 2006", "game_name": "BloodRayne 2", "text": "You know there's no place for subtlety in a game when the training level instructs the player to 'harpoon enemy and throw onto rhino horn'. Later, a chap is strangled with his own intestines. Our vampiric heroine surfs down banisters in six-inch heels while firing a gun powered by human blood. Limbless stumps spurt crimson across the floor accompanied by a sound effect like a racehorse pissing on wet grass. BloodRayne 2 is as subtle as a kick to the nads.So BloodRayne returns, in a comeback that no one remembers asking for. When we last met it was the 1930s and our titular half-human, half-vampire had stopped evil Germans from creating a vampire army. She's since spent the last six decades killing off her siblings and other members of a fang-based cult, and she's still going. And now, in the time we like to call 'modern day', she's once again dividing the undead into bite-sized pieces. It's like Roy Castle once sang, dedication's what you need.We join Rayne as she storms a mansion party, and we're instantly in the thick of it, chopping, slicing and filleting punks, vampires and Goths like it's a Hollywood B-movie. You'll half expect Stephen Dorf to turn up in long leather coat, looking cool while smoking a tab, wearing shades indoors and listening to Marilyn Manson. It's a fancy dress party and someone's invited every fetish cliché in the book. Leather and lace, Mohicans and gimp masks, thigh-high boots and androgynous villains. They leap and attack, offering a flash of knickers or a garter, spouting semi-kinky dialogue and getting off on the pleasure and pain. Oooh that hurts, do it again.Don't get me wrong, I love a good pair of knockers as much as the next man. But the campness, the brick-like subtlety, the oafish animation and cheesy character design make all these ingredients about as sexy as a eunuch in a V-neck jumper. ~I've got to make a withdrawal from the blood bank,~ says Rayne with all the passion and wit of a Carry On film. When she drinks from a victim she laps it up and 'Mmmms' like it's the horniest thing in the world. She may just as well be making a circle with the thumb and forefinger on her right hand while jabbing her left hand index finger in an out of it and making slurping noises.The combat system is effective and Rayne seems almost over-armed with an array of skills, weapons and attacks. It's as though she needs only to flick someone's ear and their head will burst. With custom-made blades attached to her arms she slices and impales with a few taps of the controller, sending arms, heads and torsos flying around the screen. Bodies are sliced right down the middle and innards slop onto the floor. One finishing move sees Rayne kick a man's head clean off; that's how powerful she is. It's like the end of Bugsy Malone but instead of a pie fight everyone's throwing stomach lining and internal organs.The whole game is far too easy, which actually makes it fun. If the game was complicated or enemies put up a decent fight you couldn't be arsed to carry on playing. Part of the problem is that Rayne can feed off enemies to heal at any point, as well as charge her own pistols (because her guns drink blood, remember). This, in effect, makes every enemy a medi-pack and a source of ammo. With extra abilities such as a rage that doubles damage, she's an unstoppable killing machine. A special mention has to go to the harpoon attack which disregards physics in order to let the player have fun swinging impaled enemies onto statues, boars tusks, a roaring fire, a spiked knob or whatever else the giddy designer thought would look 'pretty cool'.But there's no finesse or style to this gore and violence. Where Doom 3 or Resident Evil 4 shows bodies jerk as hunks of flesh are blown off, or heads annihilated in a cloud of crimson, BloodRayne's combat has all the finesse of a drunken butcher going to work and waving his off-cuts in your face. ~See that - it's an arm,~ he slurs, just to hammer the message home. ~Do you want a pound of kidney with it?~Visually it's nice and sharp, but you wouldn't want to take it home unless you'd had a few. With such stiff character animation, it's like watching action figures with limited points of articulation hacking at each other with oversized weapons. There are bugs too, with characters getting stuck behind little flower pots, but nothing that will make you scream in annoyance. You'll be too busy laughing at the absurd violence, the clumsy innuendo or the unintentionally hilarious dialogue (~You rat-sucking Nazi asshole!~). It's like goth-rock combo Evanescence sat down to write the script, plot and most of the ideas - bullet-time is renamed 'Dilated Perception' for goodness sake - and the whole show is so preposterously overblown it's surprisingly entertaining. Even the orchestral score has a guitar solo in it.If you were an angry fellow you could say that BloodRayne as a character helps to reinforce the old stereotype that videogames are for bedroom-bound teenage nerds. Buxom, leather-clad wench kills dominate this clichéd male fantasy. She's so hard she calls men 'bitch', just in case you forget who's in charge, you maggot scum. But she's such a macho dominatrix she may as well have a hairy back and a little surprise down her pants. We're not angry though, and we'd much rather just pat her ten year-old ideas on the head and say, ~aah, bless~.Its heart is in the right place - impaled on an inverted cross, quite probably - and you can't knock it for throwing everything in that the leather-clad designers deemed cool when they sat around the boardroom altar. It's a fun game in places, and you'll spend some time enjoying the silliness of it all, especially if you're fan of Rocky Horror, shirts with flamboyant cuffs and black candles. Anyone over a certain age is likely to be highly embarrassed if they get caught playing it though, and for flip's sake, don't actually buy the thing unless you wipe with ten pound notes. But if a naïve younger relative brings it home in a brown paper bag, it's worth checking out so you can chuckle away. Wear some eyeliner to really get in the mood."}