{"ref": "https://www.eurogamer.net/r-genetroopers-ps2", "date": "20 Feb 2006", "game_name": "Gene Troopers", "text": "Cauldron, let's go. Come on. Let's take it outside. I challenge you, the developers of Gene Troopers, to a fight. Name the time and place, I'll be there. That's the only way we're going to settle this.The majority of my time playing this game was spent face down on the sofa, having crawled there from my beanbag in aimless rage, thumping the carpet and furniture along my way. At one point, I bit my arm. I BIT MY ARM.You know when you're in a service station, and they have that left turn, then right turn before you enter the toilets so no one can see in? And you know how sometimes when someone else is coming the other way, as they walk around the corner you drop down dead? NO. No you don't. BECAUSE WALKING AROUND A CORNER IS NOT A LETHAL ACT. Welcome to Gene Troopers, everybody.The premise of this storm from the bumgut of Satan: you're someone who has been half-turned into some sort of warrior, and are apparently looking for a daughter you didn't realise was missing. Which means, during the brief pauses between load screens, you must first-personally shoot at some scenery-coloured aliens.Ooh, but it's got RPG elements in it! In much the same sense that asking if you'd like me to wee in a bucket of pig manure or not before throwing it at you would be an RPG element. Dead enemies drop pink blobs, which give you DNA points and allow you to augment your abilities. In other words, rather than just occasionally giving you new weapons or tools, you choose them from a list. It's a new world, my children.The first new ability allows you to see in the dark. It's possible to get right after the game's killed you about sixty-seven times by having creatures shoot at you from the dark. It gets lighter right about then. Such brains. Which goes some way to explaining the AI. Artificial? Tick! Intelligence? It would look stupid in a classroom of planks.First of all, the game offers you occasional companions. Even Half-Life 2 managed to make a complete arse of this; in a project with feet already embedded in blocks of concrete disaster, it can only be another punch to an already bruised groin. Determined to either stand exactly three feet from you, or charge off to clear out the enemies from the next three rooms before you get there, they are either extremely brave or extremely stupid. Ha, I'm joking of course. They're only extremely stupid. After I crawled under an electric barrier, my elongated brown buddy stood stock still within its arcing stretches until dead. He collapsed to the ground, lifeless. And then got back up again. Which seemed odd. And he stood in the electricity, and promptly died once more. And got back up again...Meanwhile, the enemies live upon that oft-recognised, but hard to find line between idiocy and genius. With pinpoint accuracy they can pepper your body with bullets from hundreds of feet away. Then throw a charge at a wall they're facing, and patiently wait for it to blow them up. Some stare at the ground while you kill them. Dropships merrily bomb their dropped troops the second they hit the ground. Others, as I might have mentioned, KILL YOU BY MERELY GOING NEAR YOU. Often, no matter how many times you shoot them. To the point where you start to accidentally self-harm and violate the couch.Each corridor or linear outdoor route is a pitiful series of instant deaths and agonising load times. Impressively, deaths don't even require even the presence of enemies. Inexplicable mortalities occur extremely often. After one load into an empty room, I dropped down dead instantly. That caused much laughing. Wait, not laughing. Something else. Crying. That was it.Accompanied by regularly crashing one of the more stable gaming platforms in existence, this is about as disastrous a game as I've ever seen. And I played Lula 3D.As if it matters with all the above, it looks weary, the sound is atrocious, and the voice acting a poor struggle against an utterly nonsensical script. Even the weapons fail to offer satisfaction. Either there's no visual confirmation other than the enemy falling over, or it feels like a nailgun unloading into your thigh.This PS2 incarnation of the cross-platform offence is entirely without worth. It's agony in 1s and 0s. Don't even touch your bargepole with a bargepole."}