{"ref": "https://www.eurogamer.net/r-ridgeracer6-x360", "date": "10 Jan 2006", "game_name": "Ridge Racer 6", "text": "You know when you get to the end of a fairly negative preview and it says, ~there's every chance that the developers might manage to turn it around,~ and really what you're being told is that there's sod all chance of that happening? It's depressing. It's depressing to have to write. So then, imagine how refreshing it feels when you discover that they have.This isn't one of those occasions, but for anybody who read about my first few hours with Ridge Racer 6, the next couple of pages will probably seem that way - and getting to the point of being able to write them bore all the hallmarks. In short, Ridge 6 was dreadfully boring. Ridge Racer is about going really, really fast and taking very sharp corners at impossible speeds; the game allows you to swing round them like you've just roped a rock on the inside of the bend, and the real skill is in making sure you can control the aftermath of these manoeuvres. It got the cornering right, but it was still slow and unchallenging.But after a few hours I realised there was still an arctic reserve's worth of petrol waiting to be spent on the other side of that wall of lameness I'd been sledgehammering away at. Unlocking the other 70 per cent of Ridge Racer 6 was like getting Christmas over and done with and then discovering a special secret Christmas the following week that nobody had told me about. It wasn't even like one of those bad rom-coms about the shy, bespectacled girl with good grades who gets a makeover and turns out to be Salma Hayek. I had no bloody idea Ridge Racer 6 was about to turn into Salma Hayek. Hurrah for Salma Hayek.Anyway, there'll be time for Salma Hayek later.As I sat there playing through the opening hours of Ridge Racer 6, I felt a lump at the back of my head. It was the review. It throbbed with complaints. The giganto-Blockbusters-board approach to structure that means you have to pick through a sequence of races playing tens of variations on the same courses untroubled by the L-plated AI that vanishes into your rearview by the end of the first lap. Each race is another hexagon coloured in on a big grid, another rubbish question answered. Moreover, it takes way too long to start going at a sort of speed that adds a thrilling edge. It's like writing lines for teacher - every new race a yawnsome, wrist-breaking sequence of familiar lines and loops punctuated less and less carefully by nitrous apostrophes.But then it hits. Special routes. Expert routes. Master routes. Duel series. Cars that jostle for room in your rearview right up to the finish line, races that demand use of nitrous and force you behind the wheel of the dynamic-drift cars that accumulate it with greater ease. An organic shift to the tactic of daisy-chaining nitrous together between corners that you'd barely bothered with earlier, and speeds that tighten your grip on the control pad. Race-leadership changing hands more often than you can count. Opponents who don't allow you to position them in the rearview so that they race into your backside - boosting your speed slightly - but instead actually dodge you. I've even started liking the music. I mean, I still think the graphics are a bit ropey, but I can forgive that when I'm preoccupied.The issue of course is one of balance. Racing game developers often talk about spending the last few months of development on nothing but balance, trying to make sure that progression through the game is steady but never overly easy or punishingly hard. Recent favourites manage this by teaching you things in an entertaining or compulsive manner, whatever their mistakes. Gran Turismo 4's license tests forced me through hours of basic lessons that were in effect an assault on everyone's intelligence (RIGHT, LET'S SHOW YOU WHAT THE BRAKE BUTTON DOES NOW), but were set up in such a way that I obsessed over completing them as efficiently as possible, and even returned to them when I'd broken through into the world of real racing just to secure more medals. In Project Gotham Racing 3 I was utterly beholden to the medals half a second or 500 Kudos points beyond my reach on the first go. They gave it extra life. By the time both games got into their stride, the thirst for success was more than an OCD thing. In Gotham's case, for instance, I needed those Gold medals, and I knew I'd come back to the Platinums. Click-click-clickclickclickclickclick-ing the corners together was too satisfying not to.Ridge Racer 6 doesn't really do medals, and it doesn't do license tests. Instead, it assumes that everyone is utterly deficient to begin with, and puts up very little fight for several long, boring hours.But, worse than that, it also encourages you to prolong the experience without even hinting that you might just want to get things over and done with. My mistake had been to do as the game encouraged and try and annex whole areas of the ~Basic Route~ map. This is a sprawl of numbered hexagons with dotted lines between them that represent the borders of the areas you're trying to nab. So in trying to win them over you tend to play a lot of tracks pitched at the same difficulty level, and since all the various bits of track design are commingled from the same stock environments (similar to the way Gotham slices up cities), there's a lot of repetition. On top of which, none of the stuff in Basic Route is going to prevent most of you losing sight of the pursuing pack by the end of virtually every race. Even going straight toward one of the opposite ends of the Basic Route's twisty tether without dillydallying as I did, you're going to have to race upwards of 25 times.Fortunately, the only reward for annexing those areas seems to be cars, and since all the cars at that end of the game are pretty rubbish, you can get away with not caring; just holding your breath for 25-plus races until the fun really starts to kick in, giving you time to adjust to the way the car handles and nitrous boosts thread together.Nitrous boost was introduced in Ridge Racer PSP. At least in the sense that it was new to the series - trying to get away with tagging boost bars as a new invention would be like filing a patent application for soap. Their performance here differs slightly. Here you have three nitrous capsules on the right of the screen, and you fill them up one by one as you drift through turns. Hence cars with dynamic drift, which are far more prone to losing traction, are best for it - but I'm getting ahead of myself. Once a bar is full, you can push either Y or B to activate it, and this speeds you up. The faster you're going to start with, the farther beyond your car's technical maximum speed you're likely to find yourself going. On top of that, you can wait for two or even all three to fill up, and then by pressing Y and B together you can activate them at once, which lasts longer and is even more ludicrously fast.Adding a bit of depth to this system is the manner in which nitrous can be accumulated. As well as simply gathering it as you drift without striking walls, you find that you gather it faster at higher speeds - but you can't do so while actually using nitrous. So, as the game becomes more difficult (or rather, when it actually becomes difficult), it's advantageous to try and end a nitrous burn by going into a corner. Thus, as the car slows slightly from its beyond-max-speed, you'll gain a precious extra burst of nitrous by going into a corner and, if you do particularly well, you'll be able to use it again more or less straight away.Anyway, the good thing, I suppose, about the opening salvo of races is that you'll experiment with this stuff long enough to gain a good grasp of it. Then the cars will start to get faster and the races harder. By the time you've beaten the Basic Routes on moved onto the Specials/Experts/Masters, you'll know exactly what you're doing, and the repetitive approach bores the track design into you in every sense of the word. When the game wakes up, you recognise the corners, you know how to handle them, and every variation becomes an interesting challenging. Special routes with cars that aren't dynamic-drift are their own special challenges. What's more, you're really having to fight your way to the front of the pack, blocking off overtaking manoeuvres, carefully managing your nitrous and probably having to redo races several times.You find yourself wanting to annex every little area of the map to gain every car, and you really enjoy what's happening on the track. It becomes one of the best Ridge Racer games. The only real barrier, then, is whether or not you like Ridge Racer's ludicrous approach to cornering; whether the subtle skill of spinning sideways into corners and then managing the fishtail fallout is something you care to master. That's not really something I can decide for you; you either like it or you don't.The idea of trying to stop yourself spinning to death in a tornado of impossible forward-momentum is something I've always liked, and is done well here, although you really can tell when it's carrying you round those corners. When those corner-slides run into one another, you'll find that the game will reward you for remaining in a slight drift by hauling you through tricky sections by the nose - even moving you across the track to avoid a right-shimmy in the road layout without your input. It's hard to know whether to say nice things about that or not - it benefits you more often than it causes you pain, but it's a bit silly too. Then again, we're talking about ~a bit silly~ in a game where you can do 270-degree spins the wrong way round corners at 300km/h. On reflection, I think I'll side with its defence - it's inconsistent, even for Ridge Racer, but it is a skill.Ridge 6 also has two other excellent modes: the global time trials, with Xbox Live rankings and downloadable ghost cars to race against for all the leaders, and 14-player online racing. Obviously this is where the game is more directly comparable to something like PGR3, which allows for similar things. In a sense, it loses out to that game's Online Career mode, which adds a sense of structure even to online racing, but then the style of racing is so distinctive that it arguably complements it too. Hrm.It's a difficult game to mark. Newcomers probably won't find the initial game so boring, but then I'm not a newcomer so I can't comment. Me, I can't really forgive it completely. There's more excellent-game here than there is tedious-game, but even when you get past the opening stages it still takes a little while to settle down. Some races are incredibly tricky, and take time to beat, but then the next in the series might tumble on the first go. There's also the sense that the nitrous is a license for the AI to cheat; I'd love to be able to monitor whether they're actually having to earn their boosts the same way I am, but even though it's debatable my gut says they're not, which doesn't take the shine off victory but certainly does piss you off when it's the main cause of defeat.So anyway, it's having an 8, but it's scraped it by the finest of margins. Gotham's a better game, but this turns out to be a worthy alternative. Eventually."}