{"ref": "https://www.eurogamer.net/r-weirdworlds-pc", "date": "24 Dec 2005", "game_name": "Weird Worlds", "text": "This review is proving awkward to write.Please - step behind the curtain and I'll explain a little of the method. Reviews have to do lots of things but the highest objective - and the one that can transcend any other faults - is to have reading it make the reader feel a little like how the game does. Not just explain it, though that's clearly desirable too - but to actually transport the gamer into the fantasy of the game. Make the reader feel like the game made you feel.So to make sure things are coming at you live, I have a quick burst at the game, then turn to Word with the serotonin still buzzing around my skull. Fresh from an imaginary world, to you.Now, I've tried this with Weird Worlds, and... well, the review hasn't been written for the last three days. The problem is its structure. In this space-strategy exploration game, the sequel to Strange Adventures in Infinite Space, you're placed as commander of an interplanetary vessel with a ten to thirty year mission to explore the nearby galaxy. Heading off, you move from system to system, seeing what's out there and being terribly Captain Kirk. Half an hour later, at most, the clock has ticked down and you either return to your home planet or you've perished in one of the systems of deep space. In other words, it's a short-form game. Is there a save? I honestly don't know. I've never checked, and it's beside the point. It's like expecting there to be a quick-save in Defender: even if there was, why would you use it?Now, you may think that the quick-game would make it easier to tear of a mouthful of gaming flesh then turn to the keyboard bloody-lipped, but it's not so. See, when I finish a game - either successfully or via one of my hilarious mishaps, such as accidentally piloting into a black hole without the appropriate high-level shields - I don't turn away high from the experience.I just want to another go. And because it takes so little time to do so... You see, abstractly, this is a game which is meant to be approached like you would desktop Solitaire. A classier, upmarket Solitaire, of course, but one nevertheless. Hell - the 10-year mission could be played in the time your nicotine-addicted mates take to wander out the building, inhale a ciggie and wander back.So - hell! Why not have another game?Three days gone.The problem here is that it isn't a game which, after playing, provokes the desire to rhapsodize in text. It's a game which, after playing, provokes the desire to have another game.It's most akin to a card game. You view the space map from above. At the start of the game, the universe's layout is randomised with the systems rearranged into a fresh order. You're left with no clue to what's out there, until you pick a target and travel there. With light years between them, days stream by (explaining why the 10-years can be buzzed through in ten minutes) and then you're there, revealing what's present. It's this aspect which is akin to a game of cards (I recall fantasy board-game Talisman, if that rings any bells out there), with each visit to a new system delivering a new card from the deck. Some are just equipment or items you can add to your ship or keep in your hold, to be traded or to secure points upon your return. Others are inhabited by various alien races, who can be enormously friendly (the trader aliens who'll do ludicrously generous deals with you. They'll swap any old junk for whatever they've got, essentially) to enormously unfriendly (No matter how harmless they look, to begin with stay away from Vent Mothers. Just trust me. Really). And these, you'll either run from or battle, which is in a sub-game which we'll get to when the time is right. In - oooh - a paragraph's time, I'd say.There's extra splashes on the intergalactic traversing too. Black Holes dot the space, and travelling too near to them will have inevitable consequences for your continuing existence as a three-dimensional non-flattened individual. Most strategically, nebulae act as ~terrain~, and passing through these slows your progress enormously with normal engines. This leads you to plan your journeys to avoid it, at least until you've managed to find a specialist drive, a teleporter or similar. The simple exploring aspect married to the variability of the playing area is the key of the game. While you'll swiftly pick up on motifs of play, there's plentiful hidden uses to items which you thought were just colour. There's even a larger plot to save the universe it's possible to discover and get involved in...If things turn violent, we move from the sedentary stroll around space to something more real-time, with the assorted space-ships of each side facing off against each other in a top-down view. Your vessel - plus allies you pick up along the way, in a Battle Beyond The Stars way - facing against whoever got out of the wrong side of the space-bed today. It's this aspect which will prove initially most demanding, and even when you get a handle on it, proves the most continually challenging. Targets and destinations are assigned with the click, with the right equipment making the real difference between victory and failure. Not that strategy doesn't come into it. Mounting your best weapon on a starboard-facing ship but approaching the enemy with it pointing the wrong way is an error you'll be sure to make once. Cloaks, ramming-capable ships, countermeasures and a phenomenal variety of weapons all add variety without overwhelming the rest of the game in terms of the focus of your attention.The game also offers three different approaches - science ship, pirate or military - which alter your starting equipment and mission aims. For example, a science ship gets more points for exploring the universe, while someone helming a military vessel will be better rewarded for dealing with first contact situations, one way or another. The real difference is in your starting equipment and the number of slots available for you to equip and carry your discoveries. The military task seems immediately attractive, with it being able to equip three weapons compared to the science vessel's measly one - and that one's position leaves the starboard flank undefended. And, yes, it's useful, but the as-standard science scanner allows you to immediately know what nearby planets are inhabited, so allowing you to head around the galaxy, building strength until you know for sure you actually want to tangle with any possibly hostile xenoforms. That your storage deck's twice as large as the military option is another bonus you'll appreciate after a few games when you're forced to leave some enormously valuable bauble on a deserted planetoid.In other words, the game offers variety, excitement, thought and pace all in tiny bundle you can wolf down in a sandwich break. In fact, that's what this actually reminds me of - the gaming equivalent of a snackette. Conceptually designed to be accessible and consumable, but capable of great variation. Also, some aliens look a bit like salad.Its main flaws are in terms of balance. Some of the items you can gather are overpowered, and immediately make the rest of the equipment absolutely obsolete. While almost forgivable in some of the top-end weapons, the hyperdrive immediately breaks any tension or thought in exploring. Rather than tracking paths through nebulae, the relative merits of different drives or worrying about getting back to your home base in time, you can skip between any two systems in the universe in sixty game days. Since that's less than the time it takes to travel between even two close systems, even with a decent conventional drive, the time limit - and any strategy related to it - disappears. If you discover it early in the game, it saps much of the joy from the steady exploration. Its other problems are smaller - for example, in battles, it'd have been nice to have a little more direct control over your ships rather than just giving destinations and leaving them to find their own way there - or purely a result of its strengths - for example, the similarity in structure of most games becoming harder to ignore after a long play session.Available both for ordering and in downloadable options, I'd argue that the demo is an absolute must-play for anyone with any interest in the strategic side of space or burning up the winter months in half-hour segments at a time. And if you're not one of those? Well, pah and fie to you. Get the hell out of my review.Oh - a final testimonial to Weird Worlds strengths: as of 1am on December 22nd, I haven't done any Christmas shopping yet. When my aggrieved girlfriend, family and friends come at me with the communal axe, I'm blaming this.And, y'know, being fundamentally irresponsible."}