{"ref": "https://www.eurogamer.net/r-stubbszombie-x", "date": "23 Dec 2005", "game_name": "Stubbs The Zombie in Rebel Without A Pulse", "text": "Vacillating, a decision wavering somewhere between a four and a five, I wonder: would I feel differently about Stubbs the Zombie if I were to know nothing about the people behind it?Possibly, I think.But then: no. Below par is below par, period.For me, this is one of those instances where the anticipation of a thing is better than the thing itself. Stubbs the Zombie is the first title from developers Wideload, the studio established by Bungie co-founder Alex Seropian after his post-Halo departure from Redmond. It uses a modified version of the Halo engine, has a solid premise - ~be~ the zombie, creating chaos as you sire undead hordes by feeding on the living - and, given the pedigree of being designed by a team that includes several erstwhile Bungie staffers, has been a game that I've been looking forward to all year. I hoped for something inventive, offbeat, polished and, given its backplot, cleverly macabre. Having completed it twice, though, the adjective that leaps most readily to mind is ~crude~ - and in pretty much every sense of the word.Rebel Without a Pulse takes place in Punchbowl, a fictional planned city based in late 1950s America. There are period stylings and authentic touches (much like Destroy All Humans, then), but this retro-futuristic municipality also features anachronistic technology such as robots, hovercars and laser weaponry. It's clear that Wideload wanted to play around with the distinctive clichés of the chosen era (particularly the stupidity/naivety of civilians; this takes a certain sting out of the blood-splattered carnage), but without being constrained in terms of design. Given that you play the role of a brain-eating zombie, this isn't too jarring: it's just something that you accept. After a brief introduction to this wholesome utopia, an opening tutorial shows you how to control titular antihero Stubbs, and introduces you to his basic abilities. Alarm bells ring as you realise that his primary form of attack is a one-button, context-sensitive melee attack. The number of blows required to fell an assailant or civilian varies. It can be as little as one for a non-combatant, but three for a policeman; later, you might need to strike an opponent several times before they fall. When Stubbs kills a human, they rise again - after a short delay - as an undead ally who will subsequently attack (and, if successful, convert) any other people that they can find. Creating zombies helps on two levels. It reduces your combat workload because you have minions to wreak havoc on your behalf, but also means that Stubbs is no longer the sole target for whichever enemies you may face. You also get a limited amount of control over your putrefying posse: you can whistle for them to gather around you, or push them out of the way if you encounter problems with undead traffic jams in confined spaces.During the first half of the game, Stubbs acquires four additional abilities: Possession, Gut Grenade, Unholy Flatulence and Sputum Head. The use of each is carefully limited. To replenish the onscreen meters for these, you need to eat a varying number of brains. This is achieved by pressing an action button after making a penultimate melee strike on the person you're currently fighting. Count each blow carefully, initiate the assault, and Stubbs grabs his quarry and, in a fairly gruesome rain of blood, snacks on their skulls.Problematically, only two of Stubbs' special attacks are of any meaningful utility. Unholy Flatulence is a localised smart bomb that temporarily incapacitates any humans within close vicinity. It's handy to have, but you have to eat quite a few brains to access it and - as with all attacks of this genus in videogames - you tend to save it for eventualities and emergencies that rarely arise. With Sputum Head - the last special ability you acquire - Stubbs removes his head and bowls it in the direction he faces. You then guide it as it moves, knocking over policemen and soldiers, and can detonate it with a second button press. Again, though, the number of skulls you need to crack open to use it means that it's rarely at the forefront of your mind during a fight. The two most interesting (and most used) abilities are Gut Grenade and Possession. The former is not dissimilar to the Covenant Plasma Grenade in Halo, but differs in that detonation is performed manually. You can have up to three of these available at any time, and only need to feed from a few heads to gain one. Only a single brain is required to activate Possession, though - which is fortunate, as it's this feature that adds essential variety, depth and a limited strategic aspect to Stubbs the Zombie. When you use it, you take control of Stubbs' severed arm, which can scuttle along floors, walls and ceilings. When you are sufficiently close to a human, you can press a button to leap for their heads and gain control of their bodies - and also, in a neat twist, their firearms. These range from simple pistols during earlier sections, to rifles, shotguns, machineguns and rocket launchers, and finally laser weaponry during later stages.At the point that you gain the Possession ability, there's an abrupt change of pace. Suddenly, there's more to Stubbs the Zombie than near-mindless button mashing. At first, it's disturbing that you seemingly need to shoot each assailant several times to dispatch them, but you soon realise that headshots are the key to winning gun battles. While Stubbs has an energy gauge that refills after a period of safety, possessed humans have a limited capacity to withstand damage; when they die (or you manually relinquish control), control returns immediately to Stubbs. This means that you often have to use both cover and caution, moving behind whatever screen furniture you can find and picking your shots carefully. This is an essential tactic, because weapon use is restricted by the need to reload or, with lasers, wait for them to cool down. It's by no means the most refined shoot-'em-up ever conceived - it feels rather stilted and awkward at times - but the regular visits you make to this 'game within a game' can be reasonably entertaining. One side effect of using the Possession skill is that humans slain with firearms do not rise again as undead helpers. As the difficulty level increases, this means that you need to invest a little thought into how you intend to get past a specific group of enemies. Sometimes, it's better to use a Gut Grenade, eat a few brains, then hide Stubbs and quickly use Possession to gain control of a soldier or policeman as the zombies you created distract his associates. Although very linear, there's actually a laudable flexibility to Stubbs the Zombie: you're given the (albeit limited) tools to achieve a goal (usually, to get from A to B without dying), but how you go about doing so is generally your own choice.Unfortunately, novel set pieces or notable encounters in Stubbs the Zombie are few and far between. New foes are introduced at certain points, there are a few brief vehicular sequences, and there are a few situations that could be described as ~boss~ battles, but it's so, so samey. Let's recap: to fill the four meters and gain access to Stubbs' abilities, you need to engage in repetitive, one-button melee combat, then press another button to initiate one of a handful of stock brain-eating animations that can take up to four seconds to complete. This becomes very tedious, very quickly: less thirty seconds of fun over and over, more thirty seconds of boredom. You find that use of the Possession skill becomes less tactical choice, more desperate need for respite from that central mechanic. It doesn't help that Stubbs the Zombie looks so dated. What the Halo engine did brilliantly was to convey a sense of genuine scale. I really don't think it's designed for the kind of detailed interiors or exteriors we'd expect from a videogame with a (however loosely) contemporary setting. In Halo, the highly artificial (and occasionally very austere) environments were fine: you were, after all, exploring an alien world. The retro-futuristic architecture of Stubbs the Zombie can be pleasant enough to behold in a low-fi way, and its character models aren't too bad. In some areas, though - the Knobb Cheese Farm [ew - Ed] section being a pertinent example - it's just downright sparse and ugly.The most saddening thing of all, in many ways, is that it's not even particularly funny. There's very little plot until its climatic battle, and so its cut-scenes are either far from side-splitting sketches, or devices used to (roughly) explain a transition from one locale to another. In one animated aside, Stubbs stands before an American flag and delivers a 'speech' to gathered zombies that consists of repeated, emotive use of the word ~brains~. This is about as sophisticated as it gets. It feels like a generic, low-rent children's cartoon adulterated with gore, bodily functions and rudimentary slapstick. I've got nothing against crude or puerile humour, but Stubbs the Zombie feels like it's designed to titillate young teenage boys - the very audience that, with irony, its Mature rating (sure to be replicated in kind on UK release) should technically preclude from playing.After my first playthrough of Stubbs the Zombie - which, incidentally, took less than eight hours - I sat and reflected that there were only a handful of moments that I recalled with any degree of clarity. Playing again, with the difficulty level increased, I realised why: it's just an eminently forgettable game. Average execution, terribly repetitive combat, lots of reasonable ideas that don't quite work, a general lack of cohesion: it's not diabolical, but it's far from great. It has some lovely touches - particularly its soundtrack - but it's really, contrary to my expectations, nothing special. Shame."}