{"ref": "https://www.eurogamer.net/r-kirbycc-ds", "date": "22 Dec 2005", "game_name": "Kirby: Canvas Curse", "text": "Pick up your DS. Hold it above your head. Walk outside. Go somewhere busy. Now shout: “I LOVE THIS LITTLE GUY!” Then go back home.Kirby, I don’t know what the hell you are, but I love you. If you weren’t a pink ball with no discernable lips, I’d kiss you. As it stands, instead, I’ll endeavour to do all I can to keep you alive, against all costs, so long as my battery shall last.Kirby: Canvas Curse works. Works. It’s… it’s so damn close to perfect it squeaks when you walk past it. Here’s the game for you: you have a pink ball, and you draw lines for it to roll along. There’s your game. Thank you please.Where does it come from? Nowhere. Kirby has featured in a string of meh games, some quirky, some playable, some dire, never really carving out a niche for himself. Even the tedious Yoshi has some background, Mario’s phone number, and street recognition. But Kirby - he could walk into your local Tesco and no one would notice. That’s mostly because they’d think a Smartie had fallen on the floor, but the point remains. And yet here, with no warning or fanfare, he’s gone and appeared in the best platform game the DS has seen.Much like Pac ‘n Roll, a vast amount of the enjoyment comes from utterly perfect control. In Pac, you pushed the ball in the direction you wanted it to roll, and it rolled in that direction. Simple, and perfect. Kirby does something better - it’s complicated and perfect. Not difficult, or fiddly, but more involved. Draw a line with your limited supply of ink, and Kirby will roll along it in the direction you drew. It’s kind of like a travelator, but you paint it. Tap Kirb, and he’ll get a burst of speed. Want him to stop? Draw a vertical line in front of him. Want him to fly into the air? Draw a ramp. Want him to turn 180, curling back on himself to collect all the stars arranged in a circle? Draw that path. And on and on, the only limit being the amount of ink available (rapidly refilling, and restricted to absolute perfection), and the talent with which you play.Enemies are many and varied, about a third of them offering you their own powers when squished. Tapping a baddie with your stylus will knock them temporarily unconscious, not destroyed until Kirby runs into them. Take out one with a special ability, and it will become your own, until you dump it for another. These are fairly traditional fare: fireball, super-fast wheel, heavy weight, that sort of thing. They’re never necessary for completing a level, but wise application of them will allow you to get at secret areas, bonus rooms, or more commonly, approach the level in a more inventive and imaginative way.The tapping of enemies indicates an important aspect of Cursed Canvas. You aren’t playing as Kirby. You’re facilitating Kirby’s journey. While he can take out a baddie if he’s speed-bursting or in one of his augmented forms, that’s only because you crafted the situation such that he was able. You’re Kirby’s friend, omnipotent and kindly. You are his caring God, and you will paint his pathway to freedom.Much as with bonuses, levels offer no real surprises. There are those with ice, those with fire, there are dark levels only temporarily lit, completely inevitable underwater sequences, all the familiar, perhaps even obligatory, environments a platform game will work its way through. But what makes each new design so entertaining and all-engrossing is a combination of two hugely important things; things that make Kirby: Cursed Canvas the DS game you must buy next:1) Gravity. Sure, it’s not unusual to have decent gravity in a platformer now, but rarely does it feel so completely and utterly right as it does here. Because you’re controlling Kirby with the painted lines, jumping, climbing and falling are all dependent upon the ramps, paths and nets you place for him, and the positions that you paint them. Kirby’s a ball, so he’ll roll well enough, but when it’s all about going from the bottom to the top of the screen, his physics become crucial. And they never feel wrong. Loop him into the air, catch him, swoosh him to the left, propel him upward through the no-paint barrier and just catch him with enough momentum to reach the narrow platform. Hold him there, wait for the scrolling platform, and paint his journey onward. It’s everything gaming should be: it feels like being an awesomely powerful wizard, casting your painted spells with your stylus wand.2) The speed. Surprisingly, the most enthralling aspect of Cursed Canvas is how slowly the game moves. At times, it’s absolutely sedate. Imagine playing a platform game that always remains challenging and interesting, but calms you as you play. It’s therapy. Cursed Canvas is about skill, rather than reflexes. It’s about crafting a journey through a gentle world, not hurtling from crumbling block to speeding cloud.Those two in place, the rest is decoration on an already delicious cake. Levels aren’t completed by manic collection, but by reaching the other end. Haven’t found all the coins? Missed a bonus room? They’re for next time. This time you went this way, and that’s ok. And as you progress, bonus features are unlocked. There’s the Rainbow Run, which lets you play time trial and minimum ink-use interpretations of levels, as well as mini-games made available by completion of the inventive and daft boss levels. Then there’s a whole pile of silly but pleasant cosmetic additions, bought by the exchange of the coins you’ve discovered. These range from the pointless - extra tunes - to the aesthetic - different coloured paint - to the superb - extra mini-games.Where Pac ‘n Roll went wrong in its design was to have hidden the best modes of play in the unlockable extras. Kirby is no such fool. The primary levels themselves are the reason to switch on, and keep switched on, and recharge and switch on some more. The bonuses are exactly that - snacks between meals.It’s difficult to over-stress how wonderful it is to have a complicated and intricate platform game that’s so remarkably relaxing to play. It’s a rare treat, and very appreciated. Kirby: Cursed Canvas comes from nowhere, but deserves to go everywhere. It’s another absolute proof of the validity of the DS as a unique gaming platform, and sets a new challenge bar for relaxing platform gaming."}