{"ref": "https://www.eurogamer.net/r-kaochallengers-psp", "date": "20 Dec 2005", "game_name": "Kao Challengers", "text": "The PSP is a delightful machine. A bit fat round the hips and sporting an ungainly bottom, perhaps, but nevertheless you wouldn't kick it out of bed. However, as a games console, one would be hard-pushed to say the PSP has been given a chance to really shine; recent games have been underwhelming, to say the least.Kao the Kangaroo (released in 2001 on PC and Dreamcast) on the other hand, was not delightful. It was a clichéd, hard-to-control me-too platformer that was eminently forgettable and indeed forgotten. The sequel - released to zero fanfare last April - fared little better. Introducing such a poor platformer with the PSP's desperately underperforming Winterval line-up, is a match made in ~Meh~.So, how is Kao Challengers, as compared to its generically bad prequel? Well, it's a generically awful sequel lacking in intelligent design. The PSP needs a great platformer about now, but this is in no way it.Kao is a platformer that oozes the precise opposite of originality from its every tedious pore, beginning with the story. The game starts with a stupid-voiced parrot releasing you, Kao, from your implausibly fragile cage onboard a pirate ship. You're then told by this mentally subnormal parrot that some Bad Men have put some animals in cages. And, this being a platformer, you immediately get off the boat, then set about ignoring the caged suffering and start running around collecting coins for no reason whatsoever.One of the most common design flaws of ill-thought-out platform games is that they have lots and lots of collecting stuff. Admittedly some of the best platform games also have you collecting stuff, but this is where bad platformers fall down. Collecting is fine if it is an end in itself; when it is a means to an end, because That's What Platformers Do, it's lazy, and very, very dull.To make matters worse, you're not even given any special reason why you're collecting these items. Even the end is not explained, making the means seem even more of a fatuous waste of my time. I don't like it, and I can't imagine that anybody who isn't in the thrall of some advanced hoarder's OCD would.So anyway, nominally you're on a quest to some free animals who have been put in cages for no good reason other than the men are Bad. However, as you progress through the game, it becomes clear that most of the animals see you as less of a hero, and more some kind of indentured servant. Less Kangaroo, more gopher.For example, one of your friends instructs you that some badgers have been doing damage in his mushroom garden, and that it is your task to get the badgers from his garden. Never mind that that this has nothing to do with rescuing cute animals. You're just being an odd job man.I don't want to do your gardening! I am not a gardener. Your little chore is a waste of Kao's time and a waste of mine. I think I won't do what you ask, if it's all the same to you. What's that you say? These pointless little tasks are all compulsory or else I cannot progress? Thanks, but no thanks. PSP goes into standby.And that's basically the entire game. You, acting as a slave for an array of rude, badly voiced, lazy mammalian gits, get sent off on tedious errands because they won't get off their furry buttocks themselves.This is not some grand, heroic platform adventure. This is a Jungle Helpdesk simulator. ~Mr Kao, my waterwheel is broken.~ ~Mr Kao, I've lost my friend. Can you find him for me?~ ~Mr Kao, could you throw some nuts into that target? I'd do it myself, only I can't be bothered.~There's no incentive to complete these tasks either. As soon as you complete one, some other demanding little slave-driver will order you to do some other menial task, and you quickly begin to wonder when you're getting paid, and if you should have kept your CV up-to-date.In addition to the tedious 'challenges', this game throws an endless series of platform clichés at you. In fact, if one were being unkind, one might suspect the designers started with the clichés and worked backwards.So, without further ado, the top ten Kao Platformer Clichés, ladies and gentlemen:The clichés, they just keep on a-coming, and it saps your will to live after a while. True, gamers accept all kinds of clichés all the time, as many of these have been developed as useful ways of making game universes more fun. But when cliché is all you've got, it feels an awful lot like I'm being patronised by a game developer who thinks I won't notice how dreadful, lazy and derivative they've been - or hopes I'm five years old and haven't seen it all before.There have been so many of these cute-furry-animal-led 3d platformers, many of which do everything Kao does but in far better ways, that it's hard to articulate a single reason why you'd want to play this. Kao is as same-again a 3d platformer as you're going to get.The controls are also a special pain. There is no easy way to control the camera's orientation in the game, and also the developer has not decided to grace the game with carefully chosen camera angles. Whenever Kao moves, the camera slides too. The general upshot is, when you want to jump Kao in a particular direction, as you execute the motion, the camera will shift, and Kao's angle will also shift and Kao will jump 90 degrees away from where you expected, as opposed to where you told him to jump.So you fall to your death, and invariably get put back much too far, because of the game's ill-spaced checkpointing. The camera engine makes elementary platform-to-platform jumping a hit-and-miss affair, but that depends mostly on whether the camera feels like sabotaging you. It also similarly makes it hard to hit enemies, which is especially frustrating during the inevitable boss battles. Half of all your attacks go awry, because of the game's psychotic cameraman. It's a sorry state of affairs for a platformer.Graphically, Kao is cute but uninspired; with simple textures and low polygon counts. The world of Kao is colourful, but it's nothing you haven't seen before in [insert 3d platformer here]. It's as expected; generic platformer fare, clichéd down to the last ice-wall texture.Even the audio is disappointing. There's very little music, but the voice acting for the animals is grating, childish and oftentimes downright upsetting. You won't be missing anything special by turning the sound off, but you will avoid being blatted in the head by your irritated passers-by.This truly is a game wallowing in the mire of generic, insipid, uninspiring platformers, and unable to see any easy way out. Whenever there is an opportunity for it to do something interesting or different, it disappoints by not doing it and returning to predictable form. You'll spend most of your time collecting stuff and performing endless errands for no readily deducible reason, and it's a solid guarantee that boredom will set in desperately quickly as a result.Platform fans of the world unite in not playing this game."}