{"ref": "https://www.eurogamer.net/r-poprevelations-psp", "date": "19 Dec 2005", "game_name": "Prince of Persia Revelations", "text": "This came dangerously close to being a concept review. I'd just mistimed an attack directed at that stupid woman in the one-piece leather outfit for about the tenth time in a row, and as the game goaded me once again with the ~Retry?~ prompt I found that the red mist descended (this happens in the game too) and the PSP almost left my hand as I swung it at the wall in an attempt to channel all my anger and frustration into one furious gesture.You get the feeling something similar happened when The Sands of Time didn't sell as well as Ubisoft had hoped. The developers were probably sitting there when they first saw what had happened - that a game considered by most critics to be the best thing released that year had failed to make the required impact on the usual festive dross spiting the face of the charts - and in crashing their fists down on their keyboards and mice they somehow managed to direct all that anger and frustration into the next iteration of the Prince.Well, obviously that's not what happened, but I've still yet to hear a decent explanation as to why Ubisoft replaced the warm and friendly fireside glow of the Sands of Time with the cold, uninviting gothic angst of Warrior Within, and gave the Prince the air of a child refusing to tidy his bedroom when nobody ever asked him to in the first place.So what was the concept review going to be? An invoice for a new PSP after I threw it at the wall screaming ~YOU BITCH!~Fortunately, I kept on playing. Well, fortunately for those of you who want to know what Prince of Persia Revelations is like, anyway.Porting Warrior Within to the PSP was a bizarre decision. Almost universally regarded as the worst since the series' revival, its attempts to darken the character of the Prince only worked in the sense that it left him a shadow of his former self, bereft of the charm that won so many of us over in the Sands of Time. Why not port Sands itself? Sands knew it was a game, shielding the brilliant platform puzzles from the often-tedious combat in a contrived manner that we appreciated nonetheless, and was full of clever ideas (like the foreshadowing of events when you hit a save point, tempting you to continue) and excellent level design (the menagerie, the library, the final ascent of the tower). WW did away with the boundary between platform adventure and laborious combat, failing to expand on the former or fix the latter in the process, and instead of a vibrant palace gave us a dishevelled husk of a setting - a fitting reflection of the way the atmosphere had been sucked out of it. The Prince was almost unrecognisable, Farah was gone, and instead of likable panto villains we had tediously sultry replacements.Fittingly enough, time hasn't been kind to Warrior Within, nor has the process of porting it to PSP. With the advent of games like God of War and Spartan: Total Warrior, the ~freeform fighting system~ (or ~FFS~ as I call it) has been made to look even sillier than it did in the aftermath of Ninja Gaiden - success in combat boils down to repetitive patterns of hacking and slashing so much more laborious than the already poor combat of Sands of Time, and its integration into the general gameplay feels like an assault on what was good about it in the first place - as though shifting the whole thing into nu-metal overdrive wasn't sufficient in upsetting us. The PSP exacerbates things - using d-pad-left to centre the camera, and the rest of the d-pad for far-out views and first-person is actually quite a reasonable substitute for direct control through a second analog stick, and something other PSP platform games should take on board, but there are definite technical issues with sound in particular choppy, dialogue broken, constant load pauses and worse, the occasional stupid glitch - in fact, the game actually froze up on me on several occasions. The addition of new sections adds to the game's length, but certainly not its breadth, and while they fit comfortably into the framework of what we had in the first place, it's still a game that you won't be enjoying particularly when they crop up.Even ignoring technical issues, the main issue is that WW never hits the first game's peaks, and doesn't really build on it in any positive ways. Enemies taunting you about your fighting prowess is irritating enough, but even worse because you find yourself agreeing with them as they mock you. ~You call yourself a master swordsman?~ No! I call myself a master platformer! Or I did. Once. There are still traces of that, thankfully. You still find yourself running along a wall and leaping from ledge to beam to rope to trapeze to platform and having to figure out how to get to where you're going. In this sense it's not without its moments - some platform sections come close to recapturing the fluidity and intelligence of Sands' design, while the chases involving the Dahaka (a shadowy creature trying to kill you because you messed around with the timeline) are quite fast and furious. Playing with time - rewinding it, or having to slow it down to complete puzzles, remains one of the best devices added to a platform game since the double jump. But even this is distorted by dead ends and arbitrary fighting sections.It's just such a downer after Sands. Sands had you feel like you were lost in a colossal castle that you'd never escape, but the truth was that it was a place you understood and wanted to be in, with a real identity and so many lures to keep you exploring. WW is somewhere you don't want to be.And I really can't be nasty enough about the combat. The idea was to do away with the tedious repetition and bouncing-off-the-wall frustration of Sands' combat, right? Well, it hasn't worked. The boss fight that almost ruined this review in the first place involves using one attack repeatedly, improvising during the period that it stops working (using the time-rewind whenever the game arbitrarily decides to kick you off a ledge into the abyss or unleash an unblockable attack in response), and then using that one attack again to finish things off. And what is that one attack? Jumping over your enemy's head and slashing her twice on the way down. In other words, you do what you usually did in Sands of Time, then when it stops working like it did in Sands of Time you flail about like you did in Sands of Time until it works again like it did in [I think they get it - Ed].This isn't an awful game by any stretch of the imagination - mechanically at least, platforming has rarely been done as well in three dimensions as it's done in the Prince of Persia series. And please don't mistake these constant comparisons between Sands and Warrior Within for prejudice or simple bitterness - the quality that came beforehand certainly makes it harder to bear this one's faults, but it would fall down with or without the context. Somewhere along the line there was a wholesale misunderstanding of what made Sands of Time good, and the result of the change in approach is a game that manages to be less likable in just about every single way. I have no idea why it's been re-released on PSP instead of Sands, or even The Two Thrones, which sounds like it's a lot better, but inexplicable decisions seem to have flocked to this one, so perhaps there's some warped logic in it after all."}