{"ref": "https://www.eurogamer.net/r-50cent-ps2", "date": "12 Dec 2005", "game_name": "50 Cent: Bulletproof", "text": "One of the peculiar predicaments of the habitual gamer is that we become connoisseurs of simulated violence. Of course the same could be said of cinema-lovers, but videogames aren't eulogised purely on the basis of how the violence looks. Instead we are concerned with a process, the feedback of violent images to controlling hands and thinking minds. It is, in part, our own imaginations that need to be exercised when engaged in digital combat. If it is possible to kill inventively and stylishly, and for us to feel that we are responsible for that moment of visceral thrill, then the experience is vastly more interesting, and can be recommended with the connoisseur's expert nod.It's on this basis that we have to discuss games like 50 Cent: Bulletproof, a game that is yet another cousin in that family of games where violence is everything. It's heavy with cut-scene gloss, but the muscle beneath the elegantly tattooed exterior is a third-person, gun-heavy action sequence. 50 only occasionally gets distracted by puzzle-solving, with some buttons to press here and there, elevators to activate, power switches to throw, and so on. Bulletproof's 50 Cent is an action hero of the Vin Diesel school, with ultra-violence acting as an aperitif for the main course of cartoon gun-toting.Following in the Fila-falls of a large swathe of contemporary games, Bulletproof is about fantasy fulfilment for the hip-hop generation. These new fantasies aren't concerned with cowboys or space opera, but with the idea of an alternate reality where the gangsta rap icons actually inhabit the fictions of rap lyrics. It's a world in which their street style puts them closer to gritty action hero than mere drug dealer with a hint of pistol. These new game avatars are anti-heroes whose raison d'etre is American-brand cool, perhaps cast against a backdrop of sweet revenge. This is exactly how Bulletproof plays out. Initially 50 Cent is out to help his homies, but the real reason for wanting revenge is that he himself gets shot in the back by persons unknown. And that does not look cool. So, in shades of Rambo, it's personal; despite the apparently impersonal nature of all 50 Cent's challenges. As the player you are given few clues as to what is going on, and neither does 50 seem to care what he's getting into; his need is purely to make someone pay for his discomfort. But he goes along with it all anyway, because there are faceless bad dudes to kill, and because there's clearly something going on that anyone vaguely motivated would clearly want to get to the bottom of. Dudes with guns shoot at you; you shoot back. People tell you what to do; you do it.All of which linearity means that Bulletproof is closely related to Max Payne and vastly distant to San Andreas. It also has some parallels with the gun and melee combat of Activision's True Crime, but shares none of its larger open structure. Bulletproof is a corridor of a shooter with a hub section in which 50 Cent's housekeeping tasks can be performed. This hub is a section of street (complete with mannequins, whores and invisible walls blocking your progress in either direction along the street) where 50 can sell things he has stolen, where he can buy pills (to ease the pain) from the bent doctor, and where he can learn new death-skills from a walking dictionary of cliché that lives in a broken down theatre.The hub fails to offer any true choices, basically consisting of a series of shopping menus which, thanks to the amount of cash which 50 picks up during his gunfights, are essentially a linear delivery system for new sets of power-ups. If Sid Meier is right, and games are ~a series of interesting choices~, then there is very little game here at all.Outside the hub 50 follows up leads, looking into what has happened to various friends and contacts, while trying to pick up clues about the commandos who are making life interesting by allowing 50 to slaughter them. The method of investigation is, naturally enough, one of fighting. And 50's does not fight alone, thanks to a team of homeboyz appearing to back him up with 'Glocks (if only that stood for glockenspiel), cussing, and safe-opening talents. These extras are essentially invincible, and constitute little more personality than the mobile scenery that they really are. Sometimes they must be called upon to tinker with locks or blast things open, but they're otherwise superfluous to what Bulletproof is all about: a stream of simulated violence.Here's why Bulletproof gets 4/10: the linear combat sequences, which dominate the play, are abysmally clumsy. This is due purely to the inadequacy of the control system. 50 is controlled using both thumb-sticks, and he takes aim via a genuine free-look method. This method of aiming is devoid of even the most subtle of auto-aim help, which means that Mr Cent is, for the most part, wildly inaccurate in his shooting. Nor can you do much to leap and dive from the path of bullets. You're forced to take something of a tanking role, running from one Kevlar vest to the next. And I mean running, since so many of the areas which 50 moves through are simply a scramble for the exit. Enemies keep on respawning, transforming the initial battles into farce as you attempt to defeat an endless tide of baddies, before finally, awkwardly, realising that you have to flee.Far simpler than shooting your enemies is despatching them with one of 50's close combat moves, which he can perform whenever he has enough 'stamina'. These involve running towards the foe and hitting a button, which delivers a surprisingly violent cut-scene, in response to which most people are forced to laugh, thanks to the incongruity of softly spoken 50 suddenly jamming a sabre through someone's throat, or pushing a pistol into their mouth and blowing their brains out. It's cartoon violence, but a cartoon that probably got banned for a while. What this means, of course, is that control and responsibility for the acts of violence are once again lifted from your palms. You've simply set off another five-second animation, and neither your skill, nor your imagination, added anything to the process.And so the connoisseurs will be disappointed. The more easily distracted members of the gaming audience will be pleased with Bulletproof's eminent status as a refined and marketed 50 Cent product. It does, after all, look rather beautiful. 50 himself is an exquisite model of a man (and in the game), while the cut-scenes are stylishly edited, with lashings of popular contemporary camera tricks and some pretty good acting from 50 and chums. Bulletproof reads revelations from the Bible of production but knows almost no game. It's superficially slick, with its bling'd up 50 Cent avatar and glitzy rap, but really it's a third-person shooter that stumbles well under the benchmarks set for the PS2. A host of better, brighter and more original releases in the past few years have already defeated any joy here. Sure, you can unlock a load of 50's new tunes and listen to his soundtrack in-game should you so wish, but I found it easier to flick over to MTV and think about how long it would be before I would end up in da pub."}