{"ref": "https://www.eurogamer.net/r-touchgolf-ds", "date": "8 Dec 2005", "game_name": "Touch Golf", "text": "Okey dokey. Right. On the green. Good. Seems to be sloping a bit. Okay. Left a little. A touch more. A little to the right. Okay, looks good. Fooooooooo. Okay. Draw back the club... and push. Gently does it. Geeeently. Geeeeeently. Almost there... Go on... Aaaaaaaaand...There's a giant cock. Thanks Rob.Nintendo Touch Golf Birdie Challenge has Pictochat built in. During wireless games, you can draw pictures using your stylus and dispatch them to appear on your opponent's top screen, which is otherwise used to offer a 3d picture of the game in progress. A well-timed penis can arrive just in time to obscure your opponent's view of the ball rolling into or indeed, as was the case here, past the hole.This is worth noting for two reasons. 1) It demonstrates just how easily the thing can be integrated into multiplayer games, something we've wondered about ever since the Nintendo DS came out. And 2) we happen to be writing about it just days after bemoaning the lack of inter-player communication in Mario Kart DS. Touch Golf, alas, doesn't go online. You can still have lots of fun with Pictochat offline of course, but some of the above certainly does grate.Novel though Pictochat's inclusion may seem, however, it's still worth getting out of the way at the top end of the review because it's probably the only startlingly exciting thing about Touch Golf. Note the emphasis, ponder the score, and then consider: Touch Golf has virtually no 'wow factor', but it's still the best golf game in ages.Unlike Tiger Woods, for example, Touch Golf won't let you get away with complacency and autopilot golfing - much less reward them. Where in Tiger you can expect to collect at least a handful of birdies per round, and probably even a few eagles if you play the odd risky shot, Touch Golf demands that you really put some thought into planning shots and then precision into executing them - and even then you'll struggle to stay within par.Initially, you'll take in the course overview via flyby on the 3d top-screen and bird's-eye on the touch-screen, use your stylus to reposition the marker somewhere in the center of the fairway, hit the ~Swing~ button at the very bottom of the screen, drag the stylus back and then thrust it forward to propel the ball toward your objective. The smoother, speedier and straighter the stylus stroke, the better and more accurate the shot. Then you'll use the free-cam to take in all the moving arrows painted across the face of the green to mark the lay of the land, and try to deposit the ball somewhere near the hole using the same stylus-swing mechanic.It works reasonably well. But you probably won't hole out within par - you'll end up in the rough quite a bit due to unkind bounces on the fairway, your putting will be off-centre or come up short, and you'll probably feel that it's quite exacting.Then you start to look more closely. At what affects the outcome of a drive, for example. You'll click the magnifying glass icon to zoom in or out and take in the obstacles in your flightpath. You'll also discover that you can examine where the ball will bounce, not just where it'll end up if it rolled in a straight line. You'll factor in wind conditions, the quality of your lie, and, as you approach the green, what sort of impact the ball will make once it lands - whether the slope will work in your favour or not, and whether it's worth compensating by switching up or down a club. You'll work out how to fade or draw the ball to escape tricky or obscured positions.These little touches make a real difference. Course design is such that if you play a tee-shot well, you stand a much better chance of reaching the green with a spare stroke to try and wrangle a birdie. Even so, it'll be all you can do to achieve impressive scores, even with plenty of practice. Golf isn't that easy, and Touch Golf understands this, and does a much better job of articulating it than Tiger Woods with its birdie-streak trophy balls and one-absent-minded-mechanic-fits-all approach to each situation. The difficulty curve is set up to reflect your burgeoning prowess - courses and the demands placed on you in single-player become more challenging as you start to understand the subtleties of the controls, and you become a more accomplished player. You're working from guiding lines that show you roughly where the ball will end up, but you still need to concentrate. In Tiger Woods it's simply a question of applying a bit of maths to club choice and terrain effects. Here it's about applying common sense and planning ahead. It's no arcade delight, there are no absurd chip spots spun into holes with aftertouch, it's just solid golf.It's a bit unassuming to look at - simple polygon visuals on the top-screen, including a dodgy level-of-detail effect and some questionable texturing - and on the whole won't seem hugely exciting to begin with. Indeed, it's not a game you'll ever get hugely worked up about. But it quietly gets its claws into you as you develop, and you do find yourself dipping in and really getting into each round of the Championship. I felt like I was in competition with my AI counterparts, even though I only ever saw them on leaderboards.Facing off against a real opponent (or three) - either using one game card for nine holes of stroke play, or multiple cards for the full range of options - is handled well, and the contest between decent players is never going to be as simple or fluky as it can be in Tiger Woods. It's a shame there's no option to set a handicap for people you're playing against who haven't tried it before, and it'd be nice if the Pictochat didn't obscure the actual play, but hey, Pictochat in multiplayer! You can doodle while the other player lines up his shot.There's an initial complexity and some occasional quirkiness that restrict its potential. The cursor's a bit fidgety, often switching clubs when you first grab it with the stylus tip even though you don't intend it to. And while the interface isn't necessarily too cluttered, it does demand quite a lot of you, and certain icons behave differently depending on the circumstance, which is hardly intuitive. There's also something rather anti-game about vast putts that you can't actually hole no matter how good you are at measuring them up.But that's what golf is like. Most games of this sort that demonstrate subtlety have some distinctly arresting factor, or you take great joy in the way they work. This doesn't really work that way. It's not big or boisterous, the characters don't squeak at you in comedy accents and you don't get to unlock Bowser or anything (at least I should hope not), and that's what high-end golf is often like: quietly dignified, a sport of concentration. The occasional lucky chip-in is satisfying, but the real pleasure comes from getting it right because you thought about it. Complacency is the biggest threat you face. Don't buy it if you just want to smash a ball around, hole distant putts and collect obscure rewards for impossible feats; buy it if you want to play golf on your handheld. Because right now, it's the best way to spoil a good sit."}