{"ref": "https://www.eurogamer.net/r-callofduty2-pc", "date": "6 Dec 2005", "game_name": "Call of Duty 2", "text": "Playing PC ports on a console is usually a fairly wretched experience that requires huge reserves of forgiveness and goodwill, but not in this case. At least, not when the huge-value system you're playing it on kicks your beige box into next year.If there's one thing the Xbox 360 is brilliant at doing right now, it's delivering perfect conversions of the most technically demanding first person shooters: the kind of games that demand a graphics card upgrade that (in some cases) cost even more than the Xbox 360. Case in point: Infinity Ward's 'proper' Call of Duty sequel (We say 'proper', as Activision, of course, has another entirely separate line of CoD games out for PS2, Xbox and Cube).Having enjoyed another bombastic romp through various theatres of war a month ago, its arrival on the 360 is actually far more exciting than we anticipated, and - joy - doesn't require a lengthy install, patches and driver updates.The gameplay content, look and feel is 100 per cent identical to the PC original in every way that matters, and even the controls feel perfectly converted despite lacking the assured precision of the keyboard and mouse. You still fight through 27 missions over three campaigns, taking in the war from the perspective of the Russians, Brits and then eventually the US Army. Along the way you get to fight in a typically diverse set of locales (snowy Russia, the dusty deserts of North Africa, French villages, you know the drill), but all the while sticking it to the Nazis all over again.As with all the games of this extremely popular sub-genre, every mission follows roughly the same entertaining Nazi-bashing formula. Thrust into the firing line alongside your squad mates, it's a simple case of using cover wisely, patiently taking out waves of enemies, destroying whatever important equipment they happen to have stationed and high-fiving your success. Either that or you'll choke on the blood of bitter defeat and start again from your last checkpoint. It's a hugely cinematic war-time thrill ride that, for the most part, is linear, tightly focused, choreographed to the max and does a great job of delivering the manic intensity of war. But while the concept is extremely familiar these days (some would argue over familiar), and the gameplay remains as resolutely linear as it ever was, it's difficult to not be impressed with some of the refinements. Going much further than simply cranking up the visual fidelity, IW has taken care to make the game convincing in all manner of subtle ways, such as the squad behaviour, the level of context sensitive buddy chatter, their intelligent path-finding and excellent animation. These all help generate even greater immersion and help keep you in the heat of the battle rather than cringing at technical flaws. And on top of that, little additions like the ability to lob smoke grenades as a shield between you and the enemy add a new layer of tactical choice and depth to the game, while smarter level design now gives players the ability to tackle tasks in the order of their choosing - as opposed to the traditional on-rails approach that we've grown tired of over the years.The health and save game systems, meanwhile, have both been completely overhauled from the previous CoD. For a start you can't quicksave your progress, but must rely on regular checkpoints instead - a welcome decision that completely negates the need to constantly worry about diving back to the menu to record your progress every time you've killed an enemy. Tied into this more progress-friendly system is the removal of any kind of health status bar - or health packs for that matter. Somewhat controversially, what you have instead is a sort of visual indictator of 'injury tolerance'. Essentially, when you cop some bullets, you'll know about it instantly, via the beating of your heart, the shallowing of your breath, and the bloody smear around the edges of the screen. At that point, you know that any more damage will cause you to keel over, so your only choice is to crawl off and find the nearest cover point and wait for the pain to subside. You'll know that once your hearing and vision is back to normal that you're good to go again, and as a result the game's a lot easier to make constant progress through. In fact, all 27 levels will be done and dusted in a matter of eight hours or so.As with the PC original, the same bugbears persist in the 360 port. Enemy AI is still a little on the forgiving side, always giving you way too much opportunity to cap them, even on higher difficulty settings. And despite the big advances in squad AI in CoD's rivals like Brothers In Arms, there's literally no opportunity to order anyone around in any way. With plenty of scope to introduce suppress and flank tactics into the mix, there's never any hint of being able to do anything more than simply run and gun, which feels like a missed opportunity to us. Still, tactical action's not everyone's cuppa.As with all the other 360 games, there are a number of Game Achievements for the taking (13 in this case), which help towards boosting your GamerScore. In CoD2 you'll get awarded points for anything from completing the training to finishing the game on various difficulty levels. It also encourages players to try the ultimate Veteran difficulty level by awarding points for finishing missions at that level. The odd thing, though, is Veteran isn't actually as hard as you might imagine. Sure, enemies are a little more unforgiving and, yes, you die more easily, but you can still rely on the regular checkpoints and are still able to constantly recharge your health. Do yourself a favour: play it on Veteran from the start if you really want to get the most out of CoD2. It's a far tenser, more engaging experience in all sorts of ways and will mean the game lasts longer, and you'll unlock a shedload of Game Achievements into the bargain.The multiplayer, though, is a little underwhelming. Unlike, say, Perfect Dark Zero, you gain literally no achievements for playing the various multiplayer modes - an odd decision when you consider the emphasis Microsoft places on Live. Although it has exactly the same modes as the PC version, the number of players is bizarrely capped for Live play at just eight players (PD Zero, for example, supports up to 32 players, has bots and will eventually support 50 player matches). There's 16 player support for System Link (and four player split screen), but the logistics of getting that many Xboxen in one room is barely worth thinking about.Nevertheless, there are the usual crowd-pleasers, all of which can be played ranked or unranked. So, step forward out old pals Deathmatch, Team Deathmatch, and Capture the Flag modes. On top of these staples there's the team-based defend or attack Search and Destroy mode, and the sole new mode Headquarters, where the idea is to set up and control your HQ in one of two randomly designated areas on a map. The idea is to score more than your opponent by trying to over-run their HQ, with a new HQ spawning randomly once the round's over. Definitely a lot of funAs ever, a plethora of customisation options lets you tailor the game just so and even despite being limited to eight players (including spectator mode, if that floats your boat) it's still a lot of fun, but you'll be spitting mad that IW didn’t go the whole hog and do the job properly. It's not as if the 360 can't handle it.While controversy will doubtlessly rage over the neutered online mode (and accounts for the lower score than the PC version), the single player campaign's easily strong enough on its own to carry the game. As an instantly enjoyable shooter it's right up there with the very best; the cinematic intensity makes for a wonderfully immersive experience that makes you forget just how much depth it lacks elsewhere. Of the shooters available on the 360 at launch, Call of Duty 2 is easily the most accessible and consistently entertaining single player offering, but if online is your thing you're better off considering what Rare has to offer."}