{"ref": "https://www.eurogamer.net/r-kinetic-ps2", "date": "6 Dec 2005", "game_name": "EyeToy: Kinetic", "text": "Every so often, there falls into the lap of a games reviewer something which makes you pause, double take with a slightly feeble 'huh?' before wondering whether what you have in front of you can be reviewed. In the case of EyeToy: Kinetic, the reason for the doubt is because this thing is not a game. In this case, I don't mean that it's not a game in the sense that a Flight Simulator fans claim their chosen pastime is a 'simulation not a game', because being a realistic simulation doesn't make a game any less of a game. No, EyeToy: Kinetic is manifestly not a game. EyeToy kinetic has certain elements that look gamey. But it's a facade. What Kinetic offers you is nothing less than a personal fitness, posture, mind and body coach, all staring at you through one single, menacing wide-angled lens, delivering their sage advice through the medium of your TV. It's a novel and ambitious attempt that provides you with the full range of personal trainer advice, exercise and encouragement that gym-bunnies expect - and for a fraction of the cost of signing up for a gym. There is also an irony here that although this isn't a game, it looks somewhat like one, and it has fallen to games reviewers such as myself to tackle it. Yet, as I spend much of my life sat on my expansive buttocks, I'm probably significantly less fit than both the target audience and people as a whole. For reasons of hilarity, it is instructive to imagine my ample paunch oscillating extensively throughout my EyeToy-owning career; my time with Kinetic has been no different. Blubber blubber, wobble wobble.In EyeToy: Kinetic, the camera becomes your guide through 12-week fitness, posture and mental/physical balance programmes. The programmes were designed, tested and blessed by the fit folks over at Nike Motionworks too, so there's a reasonable guarantee the programme will be doing you some good. EyeToy: Kinetic provides a robust and balanced exercise experience, provided one has the necessary conviction or will to stick to it. When stuck at, it should increase your overall fitness. Kinetic's exploitation of the EyeToy is both novel and yet surprisingly robust. In true EyeToy fashion, Kinetic is 'played' by reacting to and interacting with a number of different screen entities by punching, kicking, dodging and ducking, and diving. The degree to which you have performed the exercise is used to chart your overall progress through one of the pre-ordained 12-week programmes.As mentioned earlier, the Kinetic camera come supplied with an additional ~full vision lens,~ that must be placed on the camera lens to increase its field of vision. Whereas most EyeToy games deal exclusively with the upper third of the player's body, Kinetic leverages the entire glorious wobbling form of the human body. This is obviously necessary to provide a full workout, but it also presents a real problem. In expanding the EyeToy's field of vision, the camera gets less concentrated light because the full vision lens, acting as a filter, has dispersed it. This contributes directly to Kinetic's great flaw. That lens likes light; certainly rather more light than my living room is capable of providing during these long winter nights. Due to its high light demands, Kinetic renders itself nearly unusable in even normal artificial lighting conditions. You can flap madly, but it doesn't respond. All EyeToy games demand something of you in terms of setup and lighting, but Kinetic's demands are simply too strict.Another unfortunate oddity is the question of fun. With any of the other EyeToy outings, although you've bee working up quite a sweat and doing a workout, it hasn't felt like it- it has felt like fun. Not with Kinetic. The workouts here never stop feeling like anything but work. And for me that's a problem - if it's not fun, it's highly unlikely I'll stick to it. If you want a workout that's fun because it's also a game, then grab a copy of EyeToy: Groove. It'll get you out of breath and has cheesy music too.Assuming, however, that you want a vanilla, no-more-fun-than-is-necessary workout, or if you want in some way to legitimize your use of an EyeToy as an exercise device, by working in a way one that handles general fitness and toning as well as cardio-vascular, then EyeToy: Kinetic is an interesting alternative. Once you've got the space and lighting issues resolved, you're ready to work out. There are two workout modes - one useful, one not so. The first, less useful mode is Routine Builder. This lets you perform any exercise in Kinetic. You select a number of the exercises of any type, then you choose whether to do warm-ups and stretches. Once you've then selected some music and a personal trainer, you work out. This mode won't stretch you at all - it's not very demanding, and if you really want to get fit, you'll need the other mode.This is the full-on 12-week programme mode. Based on your responses to questions about your general fitness, Kinetic will generate a customized 12-week programme consisting of a three-times-a-week session. The proffered exercises fall into four categories: cardio, combat, toning, and mind and body.The cardio offers aerobic exercises as expected. In the combat zone, exercises and postures from disciplines such Taekwondo and Karate appear. Toning lets you work out specific muscle group. Mind and Body offers a range of relaxing, low-impact activities from the worlds of Yoga, Tai Chi and Pilates. Each series offers you a compulsory warm-up and cool-down routine, where you basically copy your on-screen trainer.If you're prepared to give Kinetic the time, the guidance of the on-screen trainers potentially offer a great workout experience, free from the stresses and costs of a gym visit. Offering encouragement and useful tips, as well as warnings about common exercise mistakes and pitfalls, the on-screen trainers are a fantastic resource. Despite the camera flaws, EyeToy: Kinetic is a well-designed virtual personal trainer. Obviously, the PS2 cannot respond as well as a real personal trainer could, but you may well find that these digital avatars are good enough not to pay fifty quid a month. The exercises are entertaining, but you will never forget that you're working out, not gaming. There are more fun alternatives to play on the EyeToy that will give you a less balanced workout. But if, like me, you are looking for a way to rein in that distended gut, Kinetic is an interesting and polished gym experience."}