{"ref": "https://www.eurogamer.net/r-kingkong-x360", "date": "5 Dec 2005", "game_name": "Peter Jackson's King Kong", "text": "Welcome to Skull Island. Well, one of you was already here.King Kong is a game that by design ought to suffer from a lack of identity. Most of the time you're playing through the eyes of Jack Driscoll, a gallant sort of chap desperate to extricate a damsel from enormously hairy distress, while some of the time you're working from over the shoulder of the very architect of her plight, the aforementioned enormously hairy Kong.Yet in spite of this you'll find that you actually empathise with several characters. Most notably Driscoll, largely undefined beyond the rolled-up sleeves groping for spears in front of you and his plaintive cries, whose mantle's easily assumed as your own; but thanks to largely excellent third-person camerawork you'll also come to understand both Ann and Kong.The key is the game's biggest personality - that of Skull Island, an enormous prehistoric jungle setting home to enormous reptiles, savages natives and countless rickety perils. It even has its own food chain, which you'll use to your advantage, using grubs to bait bigger enemies out of the way, or distracting carnivores by shooting giant bats out of the sky. At times the island twists its body to reveal herds of stampeding Brontosaurs or a burning sky creeping over a mountain range; at others it throws shadows across rocks to hint at what lies beyond; and when it's most revelling in its pageantry it opens the cage and throws its worst horrors at you, never quite taking the fatal bite but always nipping at your heels with teeth each the size of your arm.It's the character you'll be most interested in, most obviously because its principle illusion - that you're just a tiny frail creature caught in a world of monsters, rarely in possession of anything that can actually overcome them for longer than a few seconds - is so well kept up. So much so that when one of Driscoll's companions, Hayes, instructed me to get Ann back from Kong and regroup with him later, I really wondered how I was going to do it, even though everything I'd done to that point argued that it would be simple, eloquent and largely transparent.Driscoll's first-person combat is split between throwing spears and bones, and fighting with poorly stocked supplies of weapons dropped in crates by Englehorn, the captain of the ship that brought you to Skull Island, who circles in his seaplane. The guns rarely last long enough to nullify every threat in a given situation, and the remainder of your success is a product of frantically groping for the spears and bones with the right trigger, then aiming with the left and loosing with the right again. By clicking the right thumb-stick you can hold your finger up as a kind of crosshair, but often you won't have time. Occasionally you'll be so helpless that you'll need to rely on your surprisingly able companions - often in danger, but never stupid about it or impossible to protect - to rescue you from the jaws of whatever hunts you.So then, you might imagine that the sensation of being hunted is juxtaposed by Kong the hunter, but actually Kong's more of a pursuer. While his enormity and brutish strength swat away the creatures that flood Driscoll's view with red and set his heart pounding, and put the player on an even, suitably vicious footing with the giant predators Driscoll can only hope to distract and evade, the real game of Kong is chasing things down; leaping from branch to pillar to wall, breaking through giant wooden gates and preventing the horrors of Skull Island keeping Ann from his padded grasp.And yet for all the surprise, the wonder, and the simple majesty with which the game's all sewn together, as I drew closer to what I knew must be the end of the journey I found myself quitting out after saving to count how many chapters were left - instead of yearning for it to continue, I was checking my watch.It's important to note that King Kong is bristling with moments that will capture your attention and live for a while in the memory. There's your struggle to transfer fire from one end of a valley to the other - by scurrying between the legs of onrushing Brontosaurs, and having at intervals to stow the flame in stony basins just in time to loose your precious flaming spear into an attacking scavenger, before lighting another stick and continuing the journey. There are the Rex pursuits - continuous evasion among pillars and other hiding spots, the object being to keep their attention on you without getting too close, all the while your companions work to open the gates ahead, and the number of safe spots diminishes as your typically giant adversary breaks everything down in search of you. And there are moments when Skull Island meets the nascence of the kind of puzzle design that made Michel Ancel's last work, Beyond Good & Evil, feel so neat - like the fitful battle against giant millipedes and crabs in caves that frame the puzzle of how to carry fire past waterfalls.But curiously, while errant film-maker Carl Denham contrives to paint a story within a forgotten world, ultimately fails when it overwhelms him, and has to make do with capturing a piece of it to play show-and-tell with back in the real world, the developers start off playing show-and-tell, then leave you underwhelmed through repetition and send you on your way forgettably. It does the scale very well, and you certainly feel imperilled, but all too soon you start to spot the patterns - spearing small enemies and evading larger ones, finding fire to burn your way to the next door, and finding levers to open them.In Kong's case it's even more basic - just blatting things, holding the stick forward and pressing X when it's appropriate to jump. While visually impressive, these sections lack structured challenge. Swinging from branch to creeper-clad wall to pillar to wall to branch again may be satisfying in its fluency, but the fluency is the only thing you can fail to achieve - by not hitting X as you swing forward from a branch, you'll turn and swing the other way, then turn again for another chance to hit X. You can occasionally tumble to the depths below, but you'll seldom fail like this, and respawn points - as in the rest of the game - are very generous. What's more, Kong's fighting, while visceral in every sense, merely rewards mashing rather than clever positioning or technique.As a whole, the game's entertaining but seldom overwhelmingly so. Sometimes it manages to perform its best tricks in concert, but there are virtually no Half-Life 2-style moments of sheer awe - either through inspiring sight or intricacy of design.That said, Ubisoft's work on the Xbox 360 elevates the game slightly. The jungle is more battered and gloomy than lush and verdant, but while it can't quite do humidity and doesn't feel particularly organic or broad, it's still mightily atmospheric, and it can certainly do 'wet'. The rocky terrain often glistens convincingly with moisture - without beaming like polished marble the way so much wet architecture does elsewhere. It's probably the most 'next-generation' thing I've seen on this kit yet. Kong himself is equally well realised and in particular animated, swinging magnificently between branches. But special mention must go to the character modelling of Ann, who is far more believable and affectionate a character than any of the others (on the system, even), with gentle features and an appreciable softness of expression that colours the tacit bond between herself and Kong far more steadily than dialogue could ever have done.Indeed, the manner in which Ubisoft 'apes' the film - or at least what we anticipate the film being - is probably what kept me going most. Kong may be huge, but he's over 70 years old now and hardly an unexpected sight. Realistically it's Peter Jackson's Skull Island that we're more interested in exploring, and the game gets this right. But for a couple of weak or overly pointless sections, we're well serviced more or less throughout - the levity and obsessiveness of Denham's imprudently manic commentary was certainly reflected in my own eagerness to see past every ridge and uncover the next area. It doesn't feel like a whole world, but it feels like another world, certainly, and continually pokes at your curiosity and imagination, so much so that you may even find Driscoll's view slightly restrictive - you'll want to see it through as wide an angle as possible. By means of an example, I'm absolutely bursting to mention a particular skull in Kong's lair and all the things it might represent.Overall there's a great deal to admire, including the use of screen-colouring, pad rumbling and the deadening of sound to indicate pain instead of clumsy on-screen instrumentation; and the screeching of strings to motivate you to hurry when one of your colleagues is in increasingly drastic danger. It feels very clean. But then it is tied to an inescapable path, which we all know ends on top of the Empire State Building - in circumstances whose inevitability is saddening once you see how the game works, and whose ultimate realisation is, in a sense, fittingly empty. The reluctant adventurers' passage across Skull Island and back will initially capture your imagination and the only thing likely to shake you from Kong's pursuit is grasping its transparency before time. In fact, I should go even further to emphasise that: this is a game you almost certainly enjoy playing to the end.But while laudable in many senses, ultimately King Kong is as Carl Denham - fascinatingly single-minded and full of wonder, but ultimately shallow, and too caught up in its initial achievement to really think the rest of it through."}