{"ref": "https://www.eurogamer.net/r-gun-x360", "date": "2 Dec 2005", "game_name": "GUN", "text": "Activision really is challenging EA as the king of the conversion at the moment. But while it's one thing to publish ports of high-end PC games (namely Quake 4 and Call of Duty 2) for the 360, it's another thing entirely to release a pretty loveless, no-frills conversion of a current gen game and then expect people to pay full whack for it. Colour us bemused.But before we get into the relative merits of next gen shovelware, if you haven't played Gun already, then here's the deal. Cribbing from our own review, it's ~set in the harsh, unforgiving, lawless American West in 1890, a place where you trust no-one. A place where the preacher's a murderer, the lawmen are more corrupt than the criminals and even the women have the capacity to grow really unnerving facial hair on demand. Against that rather unsavoury backdrop, you play Colton White, on a mission for truth and revenge; that is, the truth of who your 'father' really is, and vengeance for his untimely death.~Eventually, it becomes a lot more involved than that, and apart from a few typical stereotypes and a bit that screams ~plot twist here~, the story's one of the main reasons you'll be happy to see the game through to the end. Gameplay wise, it's third person gun-slinging all the way, literally riding shotgun as you tear up the rocky plains on horseback capping a seemingly unending procession of evil do-ers, driven by greed. You'll be glad to shoot them. They deserve it. All of them.We were hoping that the 360 version would be the version to own, and it is - by the slenderest of margins - the definitive version, providing money's no object. It's not really better in any way that means a damn to anyone who doesn't already own an HDTV, but by virtue of the fact that it's in 720 progressive scan (something Neversoft said during its September presentations that the original Xbox version was going to support anyway but ended up being suspiciously stripped of) and has a few other neat little features that enhance the package.First off, in 720p the visuals don't really look identifiably better than they did already. Sharper, yes, but it's a game that's been designed from the ground-up to push older machines. Upping the resolution, if anything, just makes it easier to identify where the corners have been cut. For example, the texturing looks ropey throughout; it simply wasn't designed to be observed at high resolution and doesn’t work as well here, and items actually pop-into view in unexpected places where they didn't before. These aren’t deal breakers by any means, and are incredibly nit-picky observations in the scheme of things, but we were expecting a little more than a sharper resolution.Once you're done picking holes in the fact that it doesn't look very 'next gen' (whatever that means), the game's actually a lot of fun, being one of the better Wild West shooters out there. The main reason it works is also, strangely, connected to the same reason it falls down: the slo-mo combat. The ability to hit Y and enter Quickdraw mode slows the action right down for a few precious seconds, zooms in on your nearest target, and lets you riddle an entire gang with lead in the process. As it always tends to be, slo-mo gunplay is enormous fun, especially when you're riding a horse at high speed through the rocky canyons and screaming ~Yee-haw!~ at the top of your voice.Quite quickly, though, you realise that Gun's not really designed to be remotely challenging. It makes thing way to easy for you, allowing you to auto aim to successive targets one after the other by just tapping the left stick in the direction the big red arrow indicators tell you to. Armed with such an unfair advantage, you'll basically be able to blitz through the entire game in, ooooh... eight hours, or a couple of nights. Put it this way, it's a game you'll be able to get full value out of renting, but a purchase seems unnecessary.Having already finished the game on Xbox last month, we stuck it straight on the hardest difficulty setting to see how we'd fare under the sternest conditions. But even then, all you're faced with is a trickier health situation to manage; not smarter enemies or more of them - just a weaker body. You're still blessed with superhuman reflexes that can auto-aim even when the enemy's behind you and the game still checkpoints around practically every corner. Second time around, the game's worrying lack of challenge is even more apparent.As we mentioned last time out, the free-roaming nature of the game is hugely underplayed, too. For starters, there's only two extremely small towns to visit among the seemingly vast wilderness, and apart from the odd outpost here and there, there's not much else to explore. And to compound the feeling of an under-developed world, the numerous side missions are so incalculably easy that you'll often wonder why they even bothered with them. Most of the time, all you're doing is going from point A to B, taking down a small group of enemies and completing the mission in less than two minutes.In fact, the only reason you'll be motivated to play these fillers is to increase your stats and earn money. The stats almost invisibly improve (such are the tiny increments), but the money makes a big difference, allowing you to buy all manner of new weapons, enhancements and upgrades that eventually make it a lot easier to tackle some of the bosses you'll face off against during your adventures.If anything, the best addition to the 360 version is the most underplayed: the Gamerscore feature. As will all 360 games, this rewards you with recognition for your achievements (in the form of points for your overall Gamerscore) whenever you finish a level or, for example, if you complete the game or gain all the upgrades. It's a small, almost pointless feature, but somehow it feels good to be given some sort of acknowledgement for your efforts that other people can instantly view when they look at your Gamer Profile. Big thumbs up for that idea, Microsoft.So, play it on the hardest setting, get your money's worth, and reflect on a typically forgiving mass market slice of third person action that's not going to change anyone's world, and ought to have been a whole lot more ambitious than it ended up. Neversoft had the opportunity to really command the Wild West sub-genre with a GTA scale of free roaming ambition but blew it. The setting lends itself perfectly to the premise, yet ultimately the overly forgiving combat system makes the game too damned easy. Compounded by an overly linear approach and some dire sub-missions, Gun never quite lives up to its promise. Its arrival on 360 does literally nothing to change that - and although it wins out in terms of having the sharpest visuals and Gamerscore features, neither of these additions can remotely justify the inflated price tag."}