{"ref": "https://www.eurogamer.net/the-invisible-hours-review", "date": "13 Oct 2017", "game_name": "Reviews", "text": "Imagine watching a murder mystery on TV - and the recent BBC adaptation of Agatha Christie's And Then There Were None is a perfect example because it has a very similar set-up: big house on a remote island with an odd assortment of guests - but instead of seeing only what the director wanted you to see, you could walk out of the frame and see for yourself what was going on elsewhere at the same time. Which secret conversations would you see, which personal revelations - which murders?This is the premise of immersive theatre, where the whole imaginary world of a story unfolds around you, yours to explore - and in turn this is the premise of The Invisible Hours, a virtual reality experience made by Deadlight and Rime developer Tequila Works. In The Invisible Hours you cannot affect the world beyond examining objects, and there is no game to win. Instead, you observe. You are a kind of ghost, free to wander. Where you go and what you see is up to you.The thrill is in stumbling upon a secret, catching a character with their guard down and with their emotions or motives laid bare. Maybe it's a sudden outpouring of grief in a secret part of the house, or perhaps it's the real face and vulnerable truth of a character alone in their bedchamber (you can teleport through doors). It sparks a kind of excited guilt inside, a feeling of witnessing something you shouldn't, a private moment, an intimate secret. It's eerie and powerful.The set-pieces are clumsy by comparison but need to be there in order to anchor the story: you are at Nikola Tesla's remote island mansion - oh didn't I mention that? - and he has been murdered. But by who? Everyone seems to have a motive and they need them too - they need to be interesting enough for you to follow through all four chapters of the game. This makes things messy, because unlike a TV show where a writer focuses the action, here everything is in play, and the whodunnit inevitably loses a little of its potency as characters veer off to pursue their own ends.But it's not a failure by any stretch. Even those deviating threads provide their own surreptitious moments of dramatic punch, be they from two characters dancing around each other in order to obscure knives concealed behind backs - which you can naturally see - or from following one character into an underground vault where a technological secret lies. The performances aren't going to win Tonys but I warmed to them after something of a wooden start, a few grating accents and an annoying shouty drunk aside.A bigger barrier was the technology, because how can you hope to convey theatrical nuance when your audience can't - because of the resolution of the virtual reality headset - clearly see a character's face? I had to stand almost on top of characters to make their features out, like some spatially unaware Casper the Leering Ghost. It wasn't as though I was robbed of a lifelike virtual world but what modest beauty there was, PlayStation VR - with a 1080x960 resolution - garbled. I presume Vive and Rift headsets, with resolutions of 1080x1200, fare better.Movement was a headache too. The camera teleports from spot to spot and turns in 90-degree increments, which results in constant flicking from viewpoint to viewpoint (you can automatically follow characters using prescribed vantage points, which is slightly less choppy). However, this is the de facto way of getting around motion sickness in VR, graceless as it is, and means you can play sitting down.Pause, rewind and fastforward controls help buy you more time (and look wonderful outside in the rain), and you can jump back through chapters to follow other characters to their conclusions, using a theatre auditorium as a kind of control centre hub. All in all, there's a couple of hours' entertainment here.Technology and production values as they are, The Invisible Hours is a long way from the subtlety of live immersive theatre. But on the flipside it offers a glimpse at a potential live theatre can never reach: a world of Nikola Tesla mansions and Tesla Coils - worlds of fantasy. But to realise them will take refinement and advancement which comes from investment, which comes from VR games like The Invisible Hours selling. And I can't recommend you buy it. Like Nikola Tesla's inventions, The Invisible Hours is a brave experiment suggesting intoxicating possibilities for the future, but a $30/£30 asking price is too much by half."}