{"ref": "https://www.eurogamer.net/r-sims2christmas-pc", "date": "28 Nov 2005", "game_name": "The Sims 2 Christmas Party Pack", "text": "It's a joy of living. If you wait long enough, the world will prove any of your arguments for you.I've a knee-jerk distaste for the argument that says the Sims add-on packs are just the milking of a cash cow or a rip-off of the devoted fanbase. Because they're not. They add new gameplay elements - and when it's the only game in an entire genre, that's absolutely required. Imagine there was only one decent first-person shooter in existence. God knows we'd crave whatever add-on packs its publishers could produce. So just dismissing Sims add-ons because they're not to your taste... well, it's just wrong. The joy of the Sims 2 Christmas Party pack is that it illustrates perfectly why even the others, even the worst of them, aren't simple rips-offs by showing exactly what a Sims 2 rip-off looks like.Its good points are simple. It only costs ten pounds. For that, you get forty season-themed decorations (including some for Easter and Halloween) to spruce up your little computer people's homes, and other seasonal bits and pieces. There's certainly nothing which actually counts as a gameplay element here. You can easily work out a holiday-styled mini-game, where in a hectic 24-hour period a player has to try and keep everyone's spirits high and satisfy their Christmas wishes and so on. None of that is here. The piles of Christmas presents you can put down aren't for opening, but just for mute staring at. I ended up getting a little sad having Mortimer Goth stare longingly at presents whose contents would never be identified.And that's it.With it being one of the most successful games of all time, with an enormous fan community of busy modders, I figured a quick nose around would result in something equivalent that the fans have made which you - the online reader - could download, burn on a disk and give as a personalised (and cheaper) gift to your chums. And save the ten quid for give to Tiny Tim or similar.Except, as even a cursory glance at Google, I could do better than that. If you fancy the beautiful Christmas garlands or a customisable snowman or a Christmas tree... well, why not just head over to the Sims 2 site and download them. They've been up there for a year, after all.No, I'm not joking.  Go see.So, a proportion of the ~40 new items~ are available for free a couple of clicks away to you. In fact, glancing at them, the majority of the best items are available already. Once you remove the enormous inflatable cat with the turn-on-offable eyes from the package, you're not left with much. Can't find the mechanical mini-snowman who plays a pop remix of Jingle Bells when you turn him on, so that's at least one interesting thing for your crisp tenner.What was a fairly obvious cash-in's true colours are revealed: as a genuinely impressive cash-in which I can't recommend to anyone. Perhaps the most depressing thing is that the free objects were original bonuses for fans in an online give-away. Clearly, such seasonal altruism was noticed by someone who couldn't bear to live without turning the expenditure of creating them into a nice black figure in some grand corporate tallybook.But, yeah, it's only ten pounds. And if you can't think of a better use for it than this, send the beautiful note to me, care of Eurogamer, as God knows I can."}