{"ref": "https://www.eurogamer.net/r-pes5-psp", "date": "25 Nov 2005", "game_name": "Pro Evolution Soccer 5", "text": "It's all just ~now on~ in PSP land these days, isn't it? ~The most blah blah of blah, now on PSP.~ Virtua Tennis, Grand Theft Auto, Burnout, etc. - now on PSP. Hurrah. Brilliant news for those of us with enough disposable income to waste on portable versions of games we already own. Except, more often than not, it's actually ~mostly now on~. The PSP's very powerful, but it's not at the point where top PS2 games are just copied and pasted onto those little plastic magi-disks.Pro Evolution Soccer 5 illustrates this with the precision of an architect's pencil. Glance at it, stare it, even pick it up and have a poke, and you'll be left with the impression you're playing the PES5 you've already got at home. And indeed it's a remarkably complete facsimile of the PS2 game on the pitch - the only obvious change is that in the absence of L2 and R2 buttons on the shoulders of the PSP, you have to double-tap a shoulder or direction for a few key functions and relearn some of the subtler stuff.But if you explore things a bit more, you start to notice more and more concessions and things that put you off. There's no Master League mode, for example - just straightforward national and international leagues - while the vaunted USB link-up option with PS2 simply lets you download Edit Mode changes made on the PS2 to your new PSP version. If you've moved players about, you can tweak things on the handheld to match, then, but you can't download and take your Master League games with you, which is what people wanted.Then there are the load times. These are bad even by PSP standards. Getting to the game's front-end from the point at which you press the button on the PSP's load menu takes 80 seconds, and that's with an option file already created and skipping the intro movie as soon as you see it. Once you've picked your players and set up your formation for an exhibition match, it takes a full minute to reach the pitch itself. Once there, you can't pick a wide camera angle (or angle it toward either end as you can on PS2), and the action slows down enormously at free kicks or corners - basically whenever a large number of players are bunched on the screen.Which, as anybody who's familiar with the way the AI defends in PES well knows, is pretty much every time you linger in the opponent's final third for longer than it takes commentators to mention Peter Crouch's good-touch-for-a-big-lad when they spot his name on the team-sheet.That said, PES itself remains an excellent football game - far more fluid, tactical, intelligent and rewarding than the relative codswallop EA churned out in FIFA 06. Compared to last year's version, the most noticeable change is that while it still offers the option to press players in possession by holding X and square, you'll find that you give away a lot of fouls unless you make an effort to secure the ball manually.In fact, the game's been refined for so long that it's cleverly geared to encourage you to learn more about how it works. Sprinting may be the obvious thing to do, but it quickly becomes equally obvious that you get further by thinking and passing, putting one-twos together, learning how to cross effectively, and generally paying attention to the minutiae. It's harder on a system where so many controls are crowded onto fewer buttons than were even intended, but even if this is your first experience of PES you're going to find yourself in awe of the way the football's structured before too long.Players are not born equal and their relative skill levels are hugely significant. You can become a far more effective player simply by learning how the various attributes and stars rankings affect the performances of the players in question and those around them, how fatigue affects players over the course of a game (and what contributes to fatigue), and how best to use players with certain leanings.All of this remains true of the PSP version, despite its obvious limitations in certain areas, and there's still a PES-Shop with an unlockable expert difficulty level and the full range of teams, the game has an Edit option of its own, as well as Training, and if you meet someone else playing it you can link up with them and go head to head wirelessly. Unlike a lot of early PSP wireless multiplayer, this works very effectively - with little evidence of lag.Ultimately though PES5 on PSP can't escape that same feeling that pervades so many of its format stable-mates: that it's slightly over-ambitious. Konami even includes an option that allows you to turn off crowd chants and some other extraneous effects to boost battery life, perhaps aware of this, and the commentary's been cut out completely. Admittedly, the absence of my arch-nemesis Trevor Brooking (~He should have done better from there,~ ~What a miss,~ ~His sexual organs must be desperately inadequate,~) isn't something that I'm that bothered about, but it is symptomatic of the wider shoehorning cuts.PES5 obviously took a great deal of effort to get here, and Konami's coders have done a truly admirable job (and even shaved a few seconds from the load pauses in the Japanese version to this reviewer's eyes), but for all the fun you can have sat on a train scoring wonder-goals and feeling like you really earned them, its technical shortcomings are a recurring irritant, and the lack of a serious single-player mode leaves you with an exhibition-style game. That it's built on the best mechanics in the genre guarantees that it'll rarely leave a football fan's PSP, but it's easy to see where it could have gone further."}