{"ref": "https://www.eurogamer.net/middle-earth-shadow-of-war-review", "date": "9 Oct 2017", "game_name": "Middle-earth: Shadow of War", "text": "In the music industry, people often refer to Second Album Syndrome - a phenomenon whereby a popular artist sets about making their sophomore record, only this time the stakes are considerably higher due to increased exposure and fan expectation. This sometimes leads to artists trying to reinvent themselves, or go bigger in order to keep up with demand. Middle-earth: Shadow of War is kind of like a difficult second album, only the band has hired a 90 piece orchestra and asked Matt Bellamy from Muse to do the lyrics. And he's turned up with 20 new effect pedals. That's not to say Shadow of War is bad, mind you - it isn't. It's more that everything about this game is a statement - where Shadow of Mordor was something of a sleeper hit, Monolith Studios went into production on the followup knowing for sure they had something big on their hands. Considerable expectations were there to be met and so everything about Shadow of War is bigger, which is good in some respects but decidedly bad in others. The good news is that the nemesis system returns for the sequel in fine shape. The core experience of tracking down a named orc and learning every last detail about their strengths and weaknesses before destroying them - or getting destroyed - is very much intact, but it now boasts both considerable depth and greater purpose. Enemy types and traits have been greatly diversified, leading to a cast of enemies who are varied, if not exactly nuanced. The particular weaknesses or invulnerabilities of each of these captains, warchiefs or overlords have a palpable impact on how each fight is approached, building on Shadow of Mordor to deliver a combat system that's as much about preparation and poise as it is doing someone in with a sword. Exploiting the various machinations of the nemesis system - including a number of new nemesis mission types - now feels genuinely productive where before it largely felt petty. This is largely down to the introduction of forts, the headline improvement for the nemesis system in Shadow of War. The game world is split into five distinct regions, four of which you need to capture by conquering a fort. You accomplish this by working your way up the nemesis system hierarchy for that region - starting with the captains and moving onto the warchiefs before tackling the all-important overlord. As you chew your way through these strata, you can choose to either murder your targets or assimilate them to your ranks - the whole point of Shadow of War, of course, being to build an army big enough to take on Sauron himself. Plotting against an overlord is an absolute treat. Turning all of a warchief's bodyguards against him before setting up a deadly ambush is a very rewarding experience, but so too is deciding that, actually, your army is probably strong enough to take the fort without worrying about stripping away every last one of its defences in advance. You become an entire court's worth of conspirators, in other words, acting as both mastermind and assassin as you pick away at each region's nemesis tree. The fortress assaults themselves are also very satisfying, staging the grandest battles seen in the Shadow series. Mechanically they offer up a series of capture points leading to a boss battle, but the sense of driving an enemy army back to its keep is both palpable and exciting. The only real drawback is that the final encounters with the overlords themselves are diminished somewhat in impact, owing to the fact you never encounter these particular orcs before the fortress assault actually begins. While the other characters in the nemesis system are free to roam the world and cross swords with you, these big bosses are strangers by comparison, stripping the final confrontation of the same sense of import. The nemesis system isn't the only thing to receive a bit of an overhaul, however - twin protagonists Talion and Celebrimbor have also been tweaked considerably for Shadow of War. The skill tree has been expanded to feature all sorts of new skills including a double jump, ally summons, and a spectral glaive that dishes out heavy attacks. Each of these abilities can also be customised, allowing you to tweak the skill tree to suit your playstyle - giving you greater survivability and a few frost-based attacks, for instance. With a host of powerful new abilities, Talion is extremely capable - almost, in fact, to a fault. While Shadow of Mordor took nearly the entire game to equip you with a full set of abilities, Shadow of War throws skill points and XP at you almost constantly, opening up the skill tree and its numerous customisation options very swiftly. It makes for a very powerful feeling character, but one of the side effects is that it's very easy to steamroll most of the captains and warchiefs you encounter. While the advanced classes and additional traits in the nemesis system are great additions, they struggle to have quite as much impact as they perhaps should simply because you have so many different ways to do damage to your opponents. Having an enemy be immune to ranged attacks and executions, for example, no longer feels like the roadblock it did in the previous game. As a result, I never really felt like I developed a proper nemesis in the same way I did playing Shadow of Mordor: aside from story characters, there was no one orc put in my path that really gave me enough trouble to be memorable, which is a bit of a shame. Part of that, however, is likely down to the sheer number of orcs you encounter in Shadow of War. With four different nemesis trees to contend with, you meet a lot of potential nemeses and it's in your best interests to assimilate them as swiftly as possible. It's difficult to develop a true rival in Shadow of War partly because you're so powerful, but partly because you're romping across Mordor too fast to form that relationship with any one orc. While there's not much to be done about the scale of the nemesis system, it's fortunate that difficulty settings have been introduced for Shadow of War, allowing players to increase the challenge should they feel they're simply walking into (and all over) Mordor. Speaking of difficulty levels, it would be impossible to review Shadow of War without addressing the inclusion of loot boxes and microtransactions that caused such a stir just a couple of months ago. In essence, loot chests can be bought from the game's market using Mirian, an abundant (and free) in-game currency, or gold - which is given out in much smaller measures and can, crucially, be bought with real money. These chests give out gear, XP boosts, new followers and training orders (essentially follower upgrades) for you to put to use, improving your fortunes as you go about the game world. Given how freely the game gives you skill points, gear and orcs to turn into loyal soldiers, however, these chests are wholly unnecessary. If you need them in order to get by in Shadow of War, in fact, you are almost certainly playing on the wrong difficulty setting. The fact these chests aren't necessary, however, does little to diminish the awareness that they're very much a part of the game, especially when you're reminded of the market's existence by way of an announcement carousel every time you pause the game. With the market itself lacking the same polish as the rest of the game - the market keeper is an unvoiced orc who quite literally rubs his hands with glee when you make a purchase, by the way - it feels like something that was tacked on late into development at the behest of the publisher. Would it have been easier to ignore if the backlash to the announcement hadn't been so great? Possibly, but it still leaves a sour taste in the mouth.On balance, then, the core gameplay experience of Shadow of War is a lot of fun and greatly improved over the first, if not without its foibles. The bad news, however, is that it's a system that struggles to shine in quite the same way as it did before, even in spite of its expansions and refinements, thanks to the sheer volume and hyperbole of the story. To be blunt, the story in Shadow of War is bombastic nonsense. A slow, exposition-laden first act sets the stage for some quite enjoyable substance about the struggles of building an army and saving as many Gondorians as possible, before jumping the shark so enthusiastically that it could probably clear Mount Doom. The sheer exaggeration of the story is matched only by the sincerity with which it is told, creating an effect that's both off putting and, frankly, a little embarrassing. An overblown story is nothing new in a triple-A game, of course, but it's hard to point at any story facet in the second half of Shadow of War and say why it's been included if not for the sake of doing things bigger for the sequel. I'm veering dangerously close to being that guy here but, without giving too much away, you discover the identity of two of Sauron's nine Ringwraiths over the course of Shadow of War. One, canonically, was born 400 years after the wraiths were first seen in Middle-earth - the other, nearly 1000. Their inclusion, presumably, was to add a sense of increased grandeur or weight to these characters, but all it left me with was a feeling the lore had been thrown out the window for the sake of a couple of schlocky and unnecessary reveals. This isn't exactly news, of course - fans watching the story trailers were certainly perturbed by the casual forging of a new ring of power, or by turning monstrous spider Shelob into a woman in a flowing dress - but there's a thin line between riffing on a beloved work of fiction and disrespecting that fiction. Shadow of War, I fear, steers closer to the latter than the former. And so Shadow of War ends up the very epitome of the difficult second album. A lot has been added in order to scale it up for a full blown sequel and much of it has been implemented with style and aplomb. As fun as the core is, however, it is often overshadowed by an onerous and self-indulgent story. What should be the game's crowning feature is instead reduced to an undeserved supporting role, like an exquisitely carved plinth groaning under the weight of a gaudy bronze bust of an elven wraith who's looking very, very serious indeed."}