{"ref": "https://www.eurogamer.net/r-mariobaseball-gc", "date": "21 Nov 2005", "game_name": "Mario Superstar Baseball", "text": "It's nice to see that enemies can put aside their differences in the name of sport. Just as the hyper-violent females of Dead Or Alive are placated by a bit of sunshine and beach volleyball, so the head-bonking and surreal rampages of the Mario cast are put on hold for a few rounds of baseball.A 50-strong cast from the recent games populates Mario Superstar Baseball, including walk-on parts from such unsung talents as the freaky bloke in the mask, Shy Guy, with whom I feel a strange affinity. There are also visitations from the goombas who (if you get a chance to play the game) you'll notice have an amusingly rude way of holding the bat... Thanks to this line-up of ghosts, mushrooms, and pseudo-dinosaurs, the baseball antics are occasionally mesmerising, routinely mad, but ultimately rather unfulfilling.As with other Mario sporting remixes, Superstar Baseball features numerous bat-and-ball-related challenges, usually either requiring pitching or batting talents. Both actions are simplified, making a curveball easy to pitch with a simple left or right of the thumb-stick, while an error is almost impossible to deliver. Batting meanwhile allows you to bunt and steal bases, but it's all too easy to smack that fly ball and get caught out by a ghost in the field. These two skill sets pretty much deliver the rest of the game to you, with all Mario's esoteric challenges being based on the application of throwing a ball and/or belting it off into the stadium. It's representative of Nintendo's entire game philosophy, with just a couple of buttons giving you the whole game, with a little more subtly hidden away in the use of the controller once you have command of things.There are five mini-games that allow you to practice all your basic baseball skills, even including a base-running game, where players must practice legging it back and forth without getting blatted by that barking-ball-on-a-chain. It's worth playing the batting practice mini-game for a while just so that you get the hang of the timing required to bat; it's not at all obvious, and you'll regularly get struck out for the first couple of dozen balls.Then there's Toy Field, a four-player mode where the baseball pitch is re-imagined as a kind of giant pinball machine. The batter can light up segments of the field by landing a ball there and the three fielders must run about collecting coins as he does so. This mode is fairly mystifying, and although it has trademark Mario cute-cum-surreal presentation, it really begins to falter straight away. There's no satisfaction to be earned from it and almost no development of your skills occurs in play. The crudeness of this barely registers it as mode of its own. We began to wonder why it wasn't tied down into the mini-games section. We sat uncomfortably in our gaming beanbags, oddly dissatisfied, but nevertheless we can shrug and move on... Surely there's something more?And there is, but it's not much more. The core of the single-player game, the challenge mode, is next in line for scrutiny. This sees Mario wandering the land to take on baseball-related challenges. These challenges allow you to put together a customised team so that you can take on Bowser at baseball in a match to end all matches. Once an array of 'scouting' mini-games are completed you'll sign up the various major characters until you compile that all-star team. Items can be purchased in the shop, each set to imbue your batting and pitching with different (and regularly annoying) effects. Eventually you'll complete all the scout sequences and take Bowser on at a neat game of American Rounders.Brief and shallow in what it delivers, the challenge game doesn't ameliorate our now-wobbly expectations, and it certainly doesn't live up to its name. It's a meagre offering when we expected some sporting meat to pummel with our bat and ball. The mini-games are too superficial to inspire love, and much of what Mario and chums gets up to feels like a default rendition of favourite animations. Yes, they're still as exquisitely realised and precisely turned out as ever, but they're simply not playing their best roles. If this baseball adventure was all there was to the game then we'd be marking extremely low. What might just save Superstar Baseball is the main multiplayer exhibition mode, which allows you to play two-player matches in five different stadiums.Each of the stadiums has their own quirks. Donkey Kong's stadium has barrels plunging across the field, making things randomly hazardous for fielders, while Wario keeps some barking chain where the hotdog stand should be, again making life in the outfield a little more hazardous. The core baseball game remains the same in each environment, with a fairly genuine game of baseball taking place each time. You can nudge running batters back and forth to make the most of good balls, and the pitcher can do a great deal to defeat aspiring batsmen. Each character has a different level of ability, so you'll know who to expect a home run from when they step up to the plate. Additionally there are 'star' moves, of which each team has five per inning. These allow, for example, Princess Peach to obscure her ball with a blizzard of hearts, while Koopa transforms the ball into a bouncing egg and Mario turns his into a superfast fireball. The batters can return the favour with over-powered balls that fly out into the field, making it tougher for the fielders to catch them. A tiny circle of stars indicates where a ball is going to land, and it is possible to make some diving catches to take out the ball. Returning a ball to base is a real muddle, as each direction of the thumb stick represents a different base. Since it's counter-intuitive to aim away from where you want it to go you'll regularly deliver the ball to the midst of embarrassing nowhere.Despite this minor awkwardness, the exhibition mode is the most entertaining facet of Superstar Baseball. The squeaky eccentricity of proceedings leaves you charmed, if a little frustrated with the lack of a truly solid baseball game. It's never a great sports rendition, and nor is it a great arcade-tickling Mario game. The superficiality of the challenges and the clunkiness of general play mean it's a dissatisfying performance for Japan's most popular sport and its most popular plumber. It's a sad conclusion, but Mario really only ever gets to second base."}