{"ref": "https://www.eurogamer.net/r-syproshadow-ds", "date": "13 Nov 2005", "game_name": "Spyro Shadow Legacy", "text": "Perhaps it's a job for trade descriptions. The box says ~Spyro: Shadow Legacy~, and nothing else. Platform game then, right? Stick it in the DS, switch it on, wait for the interminably long splash screens to finish their agonizing, glacial display, and then... it's an RPG?Which could be a delightful surprise - don't get me wrong. But still, when you've got a kajillion kids buying your game because they want to leap the purple dragon around fast-moving worlds, collecting crap, and probably at some point going through an underwater section and then a bit on some clouds, you'd think you'd call this one: Spyro: Shadow Legacy - AN RPG ADVENTURE (that isn't a platform game). And then all those tartrazine-addled ADD-ites will be well-warned to stay away.Of course, if we're going in for this whole honesty on the box mentality, it should probably go on to say, ~(that isn't a platform game, nor indeed a particularly good RPG, or much of anything really, and it's pretty poorly made)~, so that everyone wanting to buy it gets fair warning.The premise is thus: Spyro, despite having already been the hero of ninety-three other games, is still the lowliest dragon of the Dragon Realm, and is in the last few days of his holiday before he has to go back to Dragon School. All his friends are off on exciting adventures, and poor Spyro must stay at home and work. But then, oh dear me no! Some shadow thing happens, or something. And then Spyro must, um, be somewhere else on the map, and get attacked by some things, but then die, and then when respawning for no given reason be told that he should run away, and then leave the Shadow Realm and then be somewhere else.Powerful stuff.Eventually, it transpires that the evil Red dragon has unleashed the evil powers of the evil Shadows onto the not evil Dragon Realm, causing everyone who wasn't evil to become trapped by those that are evil in another dimension. All the dragons are weak to these dangerous powers, except for that little kid Spyro. He's purple you see, and therefore special. So it's Spyro's job to flip back and forth between two versions of reality, freeing dragons, bears, and anyone else he happens to stumble across, all the while gaining XP, levelling, and learning new skills.It's sort of halfway between platform and RPG, in much the same way that being sick is halfway between eating and a pleasant poo. It's a very silly way to make a game, giving you flavours of each genre, but not enough of either to feel like you're really achieving anything.I'm fed up of being congratulated as if I saved a barnful of burning children every time I successfully press B. Here's the thing: it becomes an insult. It's like if I were to ask you if you could pass the margarine, and upon your completion of this quest, I were to reply, ~Oh my god! Thank you so much! I cannot believe that you were able to pass the margarine, with no training, and at such a young age! The rumours about you ARE true - you truly are special. Unique among your kind. The power within you is like nothing I have ever seen before! Now young prodigy, could you pass the jam?~ It's ludicrous, and it's lazy writing. Tell me I'm amazing when I achieve something amazing. Not when I parrot back the button the wise dragon just told me to press.Calm, calm. Spyro isn't horrendous to play. It's merely that sort of gnawingly unsatisfying ordinary that makes you want to hit puppies against walls. As you enter each new area of the expanding territory, the previous tasks recycle themselves, and you begin the process of freeing the trapped once again, like someone on a factory processing line. The conveyor belt rolls past, you pick up the doll's head, screw it to the body, clip on the arms and legs, and then pick up the next. Variety is so thinly disguised that it's as appreciable as the endless hollow compliments. (~No way! You looked to your left! Can it really be?! No. No. I have read legends of those that can look to their left. Certainly I've heard stories of such things. But no, surely none can exist that can truly look to the left?! I must be dreaming. You are certainly the greatest living creature of all time since the existence of anything ever!~)Where perhaps more reasonable ire can be directed is at the programming. The isometric-o-viewed backdrops are very pretty, and the characters aren't too shabby, but something goes horribly wrong when the two try to work together. Every now and then it remembers its platform origins, and asks you to jump from place to place. But it's impossible to judge where that second place might be relative to the first. There's no logic to depth perception, and no means of appropriating accuracy. More galling, and score-destroyingly appalling, is how even when you have fluked it correctly, Spyro will tumble through the solid ground and fall to his death. All the damn time.Bugs don't end there. One task asks that you open some guy's bedroom door (tense stuff), which involves finding the key and suchforth. Except, try and open the locked door and it, er, opens, leaving only an invisible version of itself blocking your path. There or not, you can still fight the baddie on the other side, the game unable to recognise obstacles. Unless of course you're standing on millimetre higher or lower than them, and then no contact at all. Sigh.Returning to those that gave you tasks, upon their successful completion, raises another peculiarity. ~Thank you so much for rescuing my teddybear!~ (no, really), ~You truly are the greatest dragon ever to have been spawned... [snip - déjà vu Ed] please, have this incredibly special and unique item as a reward.~ And then get nothing. Or nothing you can find, at least. On the poor lower screen.The action takes place on the top screen, the lower used for so many different tasks that you wish they could have just picked one and worked hard on that. There's an inventory that makes little sense, a stats screen that serves to show you how much XP is required to level up (an event rewarded with learning two new abilities - a stronger aspect of design, which allows you access to the previously unreachable), a map screen that nominally shows active quests but in no way acts as a map, and finally, oh yes, the gesture drawing area.The game's pretty much played using the buttons. It's only when casting magic that the stylus comes into play, which leaves you requiring one of those third arms coming out of your stomach. While the stomach-arm is available for human grafting in Japan, the European version is yet to be released, so for the while we have to find the damn stick every time we need to teleport or move a rock. Or as I discovered, a finger nail. Which is all very well at the start, but once they've all been gnawed away in frustration at the clipping problems, illogical quests and tiresome repetition, you're stuffed.Gah. See? As much as I want to write reasonably about the issues, it's all so annoying I get all cross. That's the problem with mediocrity - it's far more frustrating than general crapness. Spyro would score a 5 were it to work properly - smack bang in the middle of middlyness, doing nothing well, and utterly without imagination (for goodness sakes, travelling back and forth between two versions of reality - where did they get that idea from?!). But throw in the bugs and scrabbly programming, and it thankfully falls to 4, and justifies all the angry frustration and horrible analogies about killing baby dogs.Congratulations for reading the review! You truly are the greatest reader of reviews of all time! I had no idea that any still lived who could read a review - you are the child of genius! You will go on to rule this world one day! I love you, you amazingest person of all time!"}