{"ref": "https://www.eurogamer.net/r-deadtorights2-ps2", "date": "8 Nov 2005", "game_name": "Dead to Rights II", "text": "Sit.Dogs. They are a bouncy, fluffy joy. They are fiercely loyal, loving, and would follow a human through fire to their own certain destruction, tails wagging as the flames engulfed them, a big doggy smile in their heart knowing that they'd drift off to canine Hades with the man they love. That's dogs. Faithful, friendly, thick. And l'animaux juste in games these days, if sales of femme-friendly pastel dual-screen devices is anything to go by. Man's best friend.But, a Nintendog has his gaming flaws. Yes, he's got gargantuan fawnlike eyes that melt your very heart, but will he attack the testicles on demand of a John in the nearby boudoir? Alas no. I give you that he performs darling little tricks that captivate and astound with their childlike exuberance. But will he fetch you weapons on nearby corpses? Again no.Well, your dog in Dead To Rights II will. He's a slavering, spitting, bedentured killing machine; a terrifying indestructible automaton, full of loathing and anger, and foaming with eagerness to please daddy by ripping out some bad guys' throats. Now that's a dog. And he's yours to control. Crime's worst enemy. Now, there's nothing especially novel in GameLand about having a familiar, a helper-drone that accompanies your character and does housekeeping jobs for you, and even parries a few minor assaults. In fact, it's quite common fare. Yet, in this case, your lovably murderous Alsatian friend feels a bit good. Perhaps it's the nature of the special bond between Mutt and Man, perhaps it's the fact that he's just ruthless, violent, deadly but still mine; whichever, it's great to have him doing battle alongside.And it's like this for much of the game; limited but well-integrated dynamics, borrowed from all over, which manage by an unexpected twist of fate to be significantly enjoyable for a few hours. There isn't, to be fair, much of a game at all. The opening tutorials take about five minutes to watch, and that's all one will ever need to play the game, and then it's faster, scary dog, kill, kill.There are fragments of stuff from better games nicked from all over. In addition to the furry satanic agent of drool, there are the bullet time sequences from Max Payne, some rather familiar and quite funky slow-mo death dives, weapon-stealing and sneaky-uppy-grabby Metal Gear plays, cowardly-but-effective human shield tactics and all the usual paraphernalia one expects to intrude into one's thoughtspace during a third-person deadfest.And yet, and yet, and yet. Although there isn't much of a game, and although what's there is forms a crib-sheet of ~stuff we liked and nicked from better third-person shooters~, the way these dynamics are bundled, packaged and pushed out offers a brief, but registerable period of fun.The story, as is sadly and expectedly the norm, is pretty car-crash, washing wretchedly but thankfully briefly over you. After what is a pretty solid and exciting opening movie, a chum and gainful seamstress of the nethers calls you, and tells you that some bust is going down at some brothel or somesuch and some people are selling some stuff to some other people and I have to do something to someone or something. I don't remember the specifics, but then, you don't really care and neither do I.The voice acting is terrible during these scenes, but the brevity of the exchanges allows one to filter them out without undue long-term damage to the more fragile corridors of the brain.In keeping with the game's minimalist development, there isn't really much more story than that, just as the gameplay is what-you-see-is-all-you-get. So, if you're expecting a deep philosophical study into the relationship between society and those who live outside it, then, well, stop it. You'll only be upset. What you've got is (a) turn up at a scene, (b) kill to death with guns and bombs and dog, and (c) sod off. Which, given the well-integrated controls, is great for a few hours, but absolutely no more than that.The sound is a major weakness. We have here an example of where the game designers have been so lazy with the music, I wonder whether they believe all of their players to be either aurally-comatose monkeys or so focused on their in-depth, next-generation conceptual objet-de-joue, that we won't notice that the music all sound like 6-second loops of bad midi files. Well, I noticed. And my lobes were twitching, and not in a good way.The visual flair of this outing is noticeably parochial too. Boxy, smeary and eminently forgettable. It's all a bit ugly, and nobody's taken the time to put some thought into design. We've all seen ~grotty neon whores in alley with graffitied drug toilet~ many times before; this game has no intention of having a look of its own. Quite possibly the designers would think I'm getting ideas above my station for even expecting a studio to want to make their game look even a little bit different or memorable. It is, after all, mainly a game about biting testicles.Disappointing as they are, though, the poor acting, story, graphics and sound don't condemn this game to low-digit wretchedness, as you might reasonably expect. And that's because, for the tiniest of moments, it manages to snatch victory from the jaws of defeat.Dead To Rights II is a classic example of a game that isn't any good yet manages to be enjoyably passable for long enough that you might come away with the mildly mistaken impression that it's actually good. If not that, at least you might get the genuine impression that you really did enjoy it, right up until you realise that that's all you're getting and boredom sets in.The elements that contribute to the general feeling of fun emerge solely from the solid way that the different control elements have been moulded into a gestalt, a gestalt that has adopted a pet dog, taught it to kill, and unleashed it in an enclosed space close to the meat. It's certainly not the graphics, music, story or voice acting.Whether this fun is ultimately enough rather depends on how you stumble across it; It's in no way worth full price for the two to three hours of frantic fun that will ensue before ennui takes hold. But for a way to waste an afternoon, perhaps with a chum, this game could do a lot worse than end up nestling mid way down your rental queue.Good boy."}