{"ref": "https://www.eurogamer.net/r-cod2-pc", "date": "3 Nov 2005", "game_name": "Call of Duty 2", "text": "There are only a couple of things you ever need to know about the arrival of another World War II shooter: is it an improvement on what's gone before, and is there anything remotely original about it? Well, in this case the answer is - slightly predictably - yes and no. Without the merest flicker of a doubt, Infinity Ward knows how to make cinematic wartime shooters better than anyone else. Just like the 'original' (and we use that term in the loosest sense of the word), it's epic, bombastic, thrilling, exceptionally polished, well-realised and by the end of the 27 missions (over three campaigns, again) it's every bit as entertaining as you'd hope. Not-at-all-shockingly, it's also just as much of a retread as you might fear; maybe that's exactly what you wanted it to be? This is, after all, one of the best-selling styles of game in the world, and tinkering with successful formulas isn't something that billion-dollar publishers are renowned for.So, what does it improve upon? Lots of things in lots of incremental ways; that is to say the visuals, the audio and a few tweaks to your mission goals, but nothing that changes the gameplay to any great extent. During E3, Infinity Ward went to great lengths to explain how it had improved the AI and the degree of freedom offered to players, adding how much more convincing and immersive the whole experience was. But perhaps the most significant changes have been the little things; for example, the controversial decision to remove health-packs and the quick-save function - regular staples of almost every FPS since id drew up The Rules in 1992.Slightly bizarrely, CoD2 has no health status bar, and at no stage will you ever encounter one of those 'oh-so-handily-placed' medipacks to patch up your shredded torso. In a Halo-meets-The Getaway system of recharging health, if you cop some flak, or take a bullet between your eyes, it's not a problem. You can simply wipe the blood from your eyes, breathe deeply for a few seconds and all is well again. It's ludicrous, incredibly unrealistic, and almost farcical when you consider how much lead you'll withstand during the course of just a few minutes on the battlefield, but in the context of it being an entertaining videogame, it keeps things flowing like almost no other FPS.As a result of this cheating approach to health, you're the Terminator of the fight against the Nazis, and can often last entire levels without dying by simply running off for a quiet breather between being shot. Copped a face full of grenade shards? Been caught in the nads by a stray bullet? Had your hand shot off? No problem, just hide in a quiet corner and it'll all be okay.But, mocking aside, it's actually quite a good idea in practice, because - for once - you're not forced to rely on hitting the wretched quick-save key to bail you out of those tight spots (or to negotiate a woefully-judged difficulty spike, more like). It's actually far more enjoyable - and therefore more immersive - to play the game as part of a flowing set of actions than constantly saving, re-loading and replaying small sections while you work out which set of pixels the sniper's bullets are emanating from. It's a much fairer game because of it, and actually checkpoints your progress at very regular intervals anyway. Even if you do get a bit gung-ho, the autosaves are exceptionally well judged, and frustration is kept to a minimum throughout.As for the much-vaunted other 'improvements', it's highly contentious whether most of them make a significant difference, to be frank. Chief of these is the alleged freedom players are given within each mission to approach them however they see fit. We say 'alleged' because there's no doubt that Call of Duty 2 still funnels the player towards a predetermined resolution just as it - and Medal of Honor - always did, always have done, and probably always will do. On a few (and we're talking about three) notable occasions in the entire game you're given the freedom to tackle objectives in the order of your choosing, but these are generally limited to deciding which building to clear out first. It's not exactly revolutionary in that respect, so don't get too excited.For the vast majority of the time you'll be doing those old, familiar tasks: clearing bunkers, running in and out of half-demolished houses, taking out emplacements, flanking, planting explosives on moving tanks, crawling through trenches, and killing a whole infantry of Nazis. Now and then, Call of Duty 2 mixes things up a little, throwing in the odd on-rails section here, and a time-limited sniping foray there. Alongside these familiar interludes is a tank-driving section (short-lived, but fun), as well as a frantic scenario where you must use your binoculars to pinpoint advancing artillery. Nothing radically new or innovative, but certainly welcome in terms of breaking up the run and gun slog.While all of this incendiary chaos is going on, the incredible illusion of an immense battle rages around you - one area Infinity Ward deserves massive credit for, and arguably of one the chief reasons you will want to immerse yourself in The Same Old Battle all over again.Using a vastly improved engine, literally everything's been overhauled to the extent that - at times - it looks as stunning as anything we've seen on the PC. On a decent set-up, with the detail levels whacked up, and (better still) played out on a big widescreen monitor, there are few games that come close to looking as majestic.At least once every level, something breathtakingly spectacular happens, like tanks rolling literally over your head, or crawling through a giant metal pipe and being shot at from below, or setting explosive charges on a building and seeing it reduced to rubble, or climbing up a cliff-face while being shot at from above. Cut together (as the intro movie does very nicely), such moments really help elevate the whole cinematic experience to another level. It's these moments that keep dragging your through the game.Even under the closest scrutiny, everything in Call of Duty 2 simply looks more realistic than it ever used to, and it has genuinely almost got to the stage where your degree of immersion and sense of disbelief isn't shattered by technical foibles and borked AI. Whichever angle you look at it, from a visual perspective, it just works. At times it's simply spectacular.But it's not just the bombastic one-off moments that we liked. One small thing Infinity Ward has used to impressive effect is the use of smoke, which now plays a key part in the heat of battles - just as it should. The team was always good at explosions in previous efforts, but this time has gone one step further by providing players with smoke grenades - meaning you can now set up your own tactical shields to work your way through otherwise impassable blockades. And not only does it make for a thrilling and useful new addition, but it looks fantastic too - expect to see this becoming a standard addition in shooters from now on.Meanwhile, your squad mates don't just look detailed and realistic, but move with fluidity and with a degree of purpose and intelligence that gives the whole experience a much more convincing feel. For example, you never see soldiers doing dumb things like running repeatedly into walls with their legs still moving anymore. Faced with a low wall, they'll vault it. Faced with an open window, they'll climb through it; the general path-finding is excellent. But it goes further than these little cosmetic animations - your buddies actually respond to your initiative. Should you decide to brave an enemy-packed house or bunker, they'll wait tentatively outside, each taking the best position they can manage. As soon as enemies start pouring out, they'll instantly react, and prove to be an effective accompaniment, joining you inside and taking the stragglers out for you.All the while, they'll bark instructions and updates regarding enemy positions, but never the same stock phrases like most games. A lot of the time you won't even be able to hear them over the din of gunfire, grenades and mortar shells, but that's undoubtedly what these men faced in these immensely challenging conditions. It's an assault on your senses.Meanwhile, enemies won't just stand there and get shot either, but take evasive action of their own when things are going against them. They'll use the environment to their advantage, finding cover when needed, and also take every opportunity to try and flush you from your cover points out with aggressive tactics of their own. It's one thing being able to outflank enemies and lob cooked grenades at their feet, but when it happens to you on a regular basis, it makes for some thrilling and unique encounters.It's not always so thrilling, though - especially on the Regular difficulty. Much like Quake 4, you're far better off ignoring the first two insultingly easy skill levels, or else you'll romp through the entire single-player game in less than a day. For the record, there's nothing really that satisfying about wiping out an enemy if all they do is rush towards you. The latter difficulty settings don't really solve that issue, though (as ever, it's more of a health-related challenge than anything that intrinsically alters the game), but you'll spend a lot more time peeking out and taking your chances than you will in the easier settings. Be warned: if you want to get the most out of Call of Duty 2, do yourself a favour and make it challenging.Another slight minus point about Call of Duty 2 is the complete lack of attachment you'll feel to any of your squad buddies. They're replaceable cannon fodder, and although they work with you, there's always an invisible regeneration going on behind the scenes to make sure that your buddy AI contingent are replenished once they're required. You won't really care when they die, either, and it never counts against you.Unlike the more progressive Brothers In Arms, it's just you against the Nazi war machine. There's literally no squad management whatsoever, not even a sniff of it, and everyone just goes about their convincing-looking business without you. As enjoyable as it is, as immersive as some of the sections are, it's unquestionably a sub-genre that's so done to death that we need a little bit more than a bunch of sub-objectives and a wonderful engine to really get us excited. We know the start, the middle and the ending, and it's a genre so stale that even the mould has got bored with it. But maybe that's a problem unique to the likes of us that have stuck with the genre ever since it emerged. If you're new to this style of game, we'll say this: lucky you.So, once you've romped through the freezing Russian campaign, licked the Brit battles against the Afrika Corps, and fought them on the French beaches as the Yanks, what's left? It's certainly not the longest of games, that's for sure, clocking in at around 10 hours (or more, difficulty dependent). Multiplayer mayhem is assured, though, if you're fond of being shot on the online battlefield.The old standards make their perennial appearance, so yes, that means Deathmatch, Team Deathmatch, Capture the Flag modes, in addition to the defend or attack premise of Search and Destroy, and the new Headquarters mode - each with a whole array of settings to customise at your leisure. The latter team-based mode doubtlessly needs a little more explanation; the idea here is to set up and control your HQ in one of two randomly designated areas on a map, with the general idea being to score more points than the opposition. To do so means trying to over-run the opposition to stop them racking up points, and once you've succeeded (or not), the HQ points spawn elsewhere and the whole thing starts over. Definitely worth investigating out of all the modes for its unpredictability - which can't really be said for all the other well-worn staples.So, here we are. It's that time of year again, it's that bloody war again, and yet somehow we're not cursing with utter boredom. Despite the crushing familiarity of the subject matter, and the game-by-numbers formulaic approach, Call of Duty 2 succeeds in just about enough areas, and moves things forward enough of an increment to make it appeal to even those of us that are completely exasperated with the ongoing WW2 obsession.Justified cynicism aside, Infinity Ward's latest effort unquestionably refines the cinematic World War II shooter genre to new giddy heights of bombastic brilliance. Taken in isolation, it's a thrilling demonstration of how far the genre has come in delivering compelling combat and wrapping that in the most cinematic and immersive fashion we've seen. If only Infinity Ward wasn't so content to trip on the bootlaces of its own lack of gameplay ambition we'd be more excited."}