{"ref": "https://www.eurogamer.net/r-sotc-ps2", "date": "27 Oct 2005", "game_name": "Shadow of the Colossus", "text": "It's hard to know exactly where to start when you've just spent the last two days playing your favourite game of the entire year. The cursor blinks irritatedly at you with the rhythm of impatient drumming fingers, but you lose focus. Cutting to the chase really isn't that easy when you're staring wide-eyed into the middle distance; lost in the memory of what just played out on the big screen TV you bought to enjoy games like Shadow of the Colossus in all their utterly magisterial glory.Snap out of it.*Pop!*Stuck in a whimsical state of mind like this, it seems entirely worth the pain of slogging through 14 identical corridor-based FPSs, seven stealth-me-do's, and 11 pimp-my-ride-a-go-go's. Anything to be able to play something this good.And yet, Shadow of the Colossus is easily one of the most straightforward videogames imaginable; so refined is its vision. So uncomplicated its premise. You could distil the entire game into a sentence. Scratch that - two words will do: giant killing. Sometimes it's breathtaking at just how simple the game really is, yet it's also singularly one of the most pure and captivating gaming experiences we've ever had.It's an entirely unique game, too. A game that makes desperate isolation seems like a faintly attractive prospect. A game set in a spectacularly beautiful world where exploration is half the fun. An uncluttered experience where your sole purpose is to take down 16 of the most fearsome creatures you could possibly imagine imagining. Beasts so vast and so impressive that they bring new meaning to the tired notion of a 'boss monster'. It's a game all about and only about killing the boss monsters as a means to an end. A next generation game: here. Now.Paradoxically, Shadow of the Colossus takes a few steps back in an attempt to bring us something new. Its boldly retrograde stance strips away many of the conventions of videogames that we've come to take for granted over the decades. It has almost no story, a bare minimum of dialogue, and hence no characters. You don’t even meet anyone (apart from the colossi, of course) on your extensive travels. It's just you, your horse, a bow and arrow, a sword, a jump button, a grab button and the occasional unseen voice from the ether. So who's 'you' exactly? Well, much like SCEJ's previous game (the beloved ICO), you play a boy with horns (unrelated, we assume. It matters not). As the young Wanderer, all you're concerned with is bringing the dead love of your life back into the mortal realm. You've brought her on horseback to a shrine in a mythical land at the end of the world on the understanding that there's a way of bringing her soul back to life. And indeed there is. It just involves the small matter of slaying the 16 colossi that roam the lands in the surrounding area. You saddle up on Agro, your trusty steed, and gallop off in search of these lumbering beasts. But first you need to know exactly where to look. Holding up your sword in the air and rotating yourself around with the left stick focuses light in the direction you need to head, and eventually you'll stumble across where you need to be. A word of warning, though; discovering where the colossi hang out is never as straightforward as you imagine it will be. Often, you'll charge off confidently, wind in your hair, stunning vistas to admire, feeling as free as a bird, and then you realise there's a 1000 foot drop into the canyon beyond blocking your path and one hell of a detour to figure out.From there, it's often a case of extended trial and error, where you end up caught down the wrong path, or just simply in completely the wrong place. They could really use some tour guides down in Colossiland. While this can get a tiny bit irritating when you're playing Shadow of the Colossus on a time budget, the wide-eyed child in you will never get bored of exploring. Even getting lost can be fun when it ends up with death by misadventure after you've fallen down a vast waterfall.All the way through the game you'll never lose the enchanting thrill of exploring the game's environment. Sure, on the surface you’re wasting a whole lot of time merely running around on horseback, taking in the view and wishing you could ride into that terrifying abyss (which it won't let you do, incidentally). But whether you're basking in the desolate freedom at full pelt in the sunshine, or riding headlong into an erupting geyser, few games come close to offering such a consistently immersive atmosphere. And very little shatters that suspension of disbelief; you're there for the duration.One of the main reasons for all of this isn't so much to do with the tech, but more the quality of the art crammed within Shadow of the Colossus. It's consistently magnificent. All manner of interesting graphical tricks have allowed the team to exploit the hidden innards of the underestimated PS2 with aplomb, and those lucky people equipped with a progressive scan-enabled widescreen TV will be in for a rare treat. Whether it's the deliciously-overexposed bloom effects, the exceptional use of colour, the beautiful architecture, or the abundance of (often incredible) particle effects, you're never in any doubt that some of the most talented individuals in the business were allowed to really express their vision in a way that few have been afforded.Rather like the game itself, this review has taken the scenic route to get around to addressing the colossi - but it's worth every minute. Little can prepare you for the scale of some of these behemoths, reducing the player to little more than a scurrying ant on a number of occasions. More incredible, though, is just how immensely impressive they look up close and personal. Rather than blur into a mass of polygonal disappointment, you see every strand of wiry hair, every crease in their leathery skin, every undulation in their scaly armour. Each and every one only look more impressive the closer you get, which is just as well, as there's little opportunity to take these beasts out by flitting around like a frightened mouse.When you've picked your flapping jaw up off the floor and popped your eyeballs back into your disbelieving sockets, eventually you've got to work out how to take these giants down a peg or two, and that's where the fun really starts and the point where the one of the finest game soundtracks ever soars into dramatic life. To begin with, it's relatively straightforward to identify the colossus' weak spots. Merely raising your sword shines a beam of light down onto wherever it is you need to stab, indicated by a glowing blue smudge. But working out how to scale these mighty mammalian mountains is another thing altogether.At its heart, Shadow of the Colossus is more of a platform puzzler than anything, where the earlier 'levels' are mostly represented by each colossus, and are constantly on the move and often exceptionally well-defended. Cracking each 'puzzle' is no mean feat, with each one woven so intricately into the fabric of the game - with a demand for lateral thought that would shame the average adventure title. It's a given that you'll spend a long time on each 'boss' merely trying to figure out how to do them any damage whatsoever. Some come fully armoured, some fly, some swim, some are fast and deadly, some all of the above. And just when you feel like you're getting the better of them, the game will pull another crafty trick out of the bag to keep you on your toes... again.To begin with, it's just about getting onto the colossus in question, scaling them, clinging on for dear life, charging up your sword attack and plunging your blade deep into their weak spots. But as satisfying as this is at the start, it would have made for a pretty boring game if the whole thing had have carried on in this vein.Before long, you're forced to pay attention to what's around you and use the environment to your advantage. Although the colossi are your sole focus in the initial levels, the game begins to carve out increasingly sophisticated locations that even demand a fair bit of leaping and scaling before you work out what to do. Often the solution will completely elude you at first, yet seems so strikingly logical once it becomes apparent. If you find yourself completely stumped, the game takes the hint and starts dropping some; although none so obvious that they'll spoil it for you. Even when you know full well what to do, actually carrying out the task at hand can be a real trial, but of the kind that inspires pure satisfaction when you've cracked it. With your targets aware of your presence on their body, they'll thrash around like demented eels and make life exceptionally difficult. By the end of the game your index finger will be extra powerful from all the time you spend clamping down R1 to cling onto their elusive torsos. Inevitably, though, you'll work out their attack and defence patterns, learn when to recharge your 'grip' energy, and even the most fearsome enemies eventually drop to the ground, slain at your merciless hand.And when you've been through the long process of exploration, bewilderment, defeat, and eventually victory, the immense feeling of satisfaction at the end of each fight is beyond compare. You feel utterly triumphant, and ready for another epic encounter. Yet, as a formula, it's almost ridiculously simple. Hunt monster, find a means to jump onto his body, stab him in the head a few times. Repeat until the credits roll. Isn't this Galleon without the platforming?~Is that it?~ What do you mean 'is that it?' Arguments will doubtlessly rage forever that 'Shadow of the Colossus would have been better if...', and people will make the point that the world is empty, that it needs more life. People will also rightly point out that it can be a right faff to locate each colossus, or that the game needs more weapons, more variety, or moan about the occasional camera freak out. Of course, there are a few niggles. At times, you get the sense that the PS2 is being pushed a little too hard. It definitely could do with a little more, um, horsepower to make things smoother, but it hardly detracts from the overall enjoyment even a tiny bit.Shadow of the Colossus' succeeds not through the layers of complexity, hand-jamming combos or by show-off pyrotechnics and unfathomable, forgettable plot-lines. It’s a masterfully understated, beautifully simple, engrossing ride that's as palpitatingly thrilling as it is serenely calming. It's also one of the most consistently compelling and memorable games we've ever played (or witnessed, for that matter). Once you've finished it, you'll sit back and flick through the stand-out memories lodged forever in your mind's eye. You might even feel motivated to play it on the unlockable hard mode, or time attack and try and earn the 16 secret items tucked away for the determined slayer of colossi. Or you might just sit and talk about it with your friends, and express your infectious joy over how you've just played one of the videogames of your life.It's a big big love."}