{"ref": "https://www.eurogamer.net/r-kufheroes-xbox", "date": "27 Oct 2005", "game_name": "Kingdom Under Fire: Heroes", "text": "Kingdom Under Fire: Heroes is part of that series of games, cousin to Dynasty Warriors, in which you command units of troops in something akin to a close-camera RTS, before diving into fantasy melee and finding yourself cast as the lead pugilist in a 100-man beat ‘em up. Needless to say, such a game concept is hugely entertaining: hence the ongoing series. But before you get to the brutality, you must parse the names. The Kingdom of Arenia, the east Bersian continent of Vellond; the annexation of Hexter by Valdemar the Half Vampire; the elves in the Hironeidian territory; the Encalblossa War, ogre tribes in the marches...All this on the loading screen alone.I’ve been told off by editors before for fantasy bashing on a number of occasions. But in all honesty I have no prejudice; I simply want to convey the awfulness that many games, films or books wish to pass off as some kind of story-like substance. More often than not, the cocaine of a good yarn is cut with 90 per cent powdered gibberish, and that’s going to get up anyone’s nose. (In a bad, Daniella Westbrook-type way.)But I can’t help myself: I have perverse love for the sheer audacity of the epic-fantasy insanity that games like this attempt to deliver. The dialogue is a voluminous exercise in disjointed absurdity. I baulk at imagining what the voice actors made of the script, and I’m always end thinking of what it must have been like just getting this garbage over with in their $5-per-hour studios. Perhaps they’ll give some false-gusto, clutching a cup of lukewarm Starbucks bean-mud as they recite the nonsense. This acting career was meant to be Hollywood and Shakespeare, wasn’t it? Wasn’t it?Will they later buy the game and proudly demonstrate their performance to their agents and/or mother? (The lonely voice actor steps out into the rain for a good cry...) There’s even a guy who occasionally says ~...~ apropos of nothing at all. And then there are the implied events in the dialogue which, because they are taking place off-camera (while you stare a pixelly 3D world map screen), are unseen and completely obscure.What the hell is going on?Fortunately, I swallowed the blue pill, and instead of seeing the truth of this fantasy lard-slab, I have plunged into the fantastical battles beyond. Scene-skipping is your friend: make up your own story, put your fingers in your ears and go ~la-la-la!~ when the cut-scenes occur. Just think about the slaying, and give yourself over to the moment. Those giant scorpions must pay: they’re on the wrong team.Still with me, eh? Okay, so the truth of it is that no one is going to care about the rubbish story, because there’s something delicious under the wrinkly skin of a long-dead Tolkien. It’s this: incredible fighting.When I say 'incredible', I don’t mean as in 'leaving you incredulous', or as in some kind of fighting activity you won’t be familiar with. I mean spectacular, showy, and high-fivingly entertaining. Dragons strafe the field of battle, hordes of snarling orcs come barrelling in, axes in hand; heroes spin, kick and scythe their way through a soup of enemies, blades whirling. It’s thrilling stuff. I found myself punching the air after the defeat of one particularly hairy band of orcs; much to the bemusement of my girlfriend, who was sat behind me on the sofa, practicing her frowning.Anyway, the tactical sections of Kingdom Under Fire: Heroes actually constitute a relatively sophisticated RTS. You take to the field with a certain set of objectives, which must be accomplished by not getting slaughtered. When the action kicks off you’ll need to position ranged troops correctly and deploy units in the manner in which they’ll be most effective. Bowmen will suffer if they’re firing into the sun, or if they’re firing up hill. Likewise infantry will move faster if they’re spread out, but will be more vulnerable to attack; bunch them up into that tight phalanx and you’ll hit harder as you plunge into enemy ranks. Occasionally (annoyingly) it’s possible to break the sequence of events. I failed to retreat from one fight, for example, killing everyone even though they pleaded mercy, and so failed to open up the latter part of the mission where I’d save their Elf princess. A restart was necessary. Likewise, there a few missions where - without any obvious waypoints - you’ll end up wandering about aimlessly. While the over-laid map is useful for moving units and for positioning yourself with regards to enemies, it is entirely featureless and devoid of navigational use. Don’t expect clues about where to go (although it’s generally linear enough not to matter).Although each of your units have all have defined roles, each one can be upgraded and re-classed in substantial action-interlude map-screen menu sections. As they level up their role can change, with infantry becoming cavalry, or heavy infantry, depending on your tactical whims. War begets experience and gold, and that must be spent on new swords and shinier shields for both men and leaders. While you won’t necessarily notice the effect of this in-game, you’ll need to keep on top of their upgrade curve so that units won’t get a bloody nose in later melees.When that close-range combat occurs, your lead unit switches from indirect RTS controls to the melee itself. This is where the titular heroes get to flex their powers, in a beat-‘em-up style fight against potentially hundreds of enemies. Charging headlong into a churning wall of orcs is hugely satisfying, especially when your suitably supercharged weapons send them flying in a shower of blood and sparks. As with other fighting games, the right sequence of button bashing lets you pull off a sequence of moves, including the odd power-up hyperblast that you’ll impress yourself with in times of need. A smattering of special characters join you on the field, too, and the tough fights can be turned with deft use of their special moves. Discovering new ways to lay the smack down brings a smile to even the stiffest upper lip. It’s stupid pixel-opera of this kind that games excel at, and the sheer simplicity of stabbing the dark legion do-badders in the face gives way to constant delight.The melee combat is too easy and too chaotic to really be regarded as any kind of skill-based challenge, though, but it's nevertheless just relentlessly amusing, and help augment the fiddly strategic sections with gratuitous, open carnage (Whack! Stab-biff!). Nevertheless, as the game progresses it becomes tougher for you to win these skirmishes single-handedly, although the hero characters always define the course of any fight. And there’s a lot of this incredible fighting to get through, too. There are multiple story-campaigns to enjoy, as well as a skirmish mode. You have a choice of characters to begin with, although only the default one actually leads you into the story properly. Further heroes are unlocked as you complete the early campaigns, each one representing another tier of trickiness. The war can also be played from the point of view of the evil-folk, who really do excel in the silly voice department. Needless to say, there’s Live support too, so you can set up some grand epic-scale custom games to play online, pushing the game to its over-wrought limits. The truly top-end battles that can be produced in this way really do impress even the terminally cynical.That said, it seems that Heroes could be a whole lot prettier. There’s a hell of a lot of washed-out colour and bad camera wobbles in there. But when it gets it right, when the field of battle is writhing with combatants, when the archers are setting enemies on fire with flaming arrows, when meteors plunge to Earth and when dragons dive from the sky to strafe the melee with jets of green fire, then you really begin to believe. Imperfections be damned. There’s enough energy here to make up for a hundred made-up elf names.Actually, the finest thing about the Kingdom games (and I know I’m not the first person to point this out) is the music. Rather than default to the 'Oooo-laaa' of contemporary fantasy soundtracks, KUFH employs dense speed-metal loops for the melee, framed by incidental post-rock in the movement and map screen phases. It’s glorious, and slightly incongruous.The orcs and the elves: they listen to Motorhead."}