{"ref": "https://www.eurogamer.net/review-bonfire-peaks-well-burn-it-down-together", "date": "30 Sep 2021", "game_name": "Reviews", "text": "He burns his belongings.It's hard to imagine what has happened for a man to think there are no options left other than to take a box of his stuff - a box of cherished memories, I think, although we're never formally told - and shove it into a bonfire. It's harder still to imagine how it must feel to keep doing it, over and over and over again. Does it get easier, do you think? After the second time - the tenth time, the fiftieth time, the hundredth time - does it stop hurting? Do you stop feeling it? Or does every box stuffed into the flames make your heart ache just that little bit more?You've no idea the number of times I've zoomed in, peered a little closer, trying to decipher what it is he's burning. It feels important to me, somehow; the key to unravelling this mystery. I think there's a poster or photograph in there? A man in a white hat. Plus a shoebox, perhaps, and what may or may not be a cuddly toy. I don't suppose it matters, really. One man's trash is another's treasure and all that.We're never properly introduced, but this nameless, expressionless, yet grimly determined man intrigues me. I've always had a thing for the mute protagonist - I do so love the stoic, silent type - and he goes a step further: not only never speaking, but never emoting, either, given he doesn't even have eyes. That didn't stop him from getting here, though. It didn't hold him back from jumping into one of those swan pedalo things and just keep on peddlin' - alone, and in the dark - until he pulled up beside a moss-strewn dock at the foot of this mountain. He settled himself down beside every cold, dark campfire and watched as it sparked into life, opening a portal between this place and a puzzling otherworld. Without a word - without a flicker of emotion - he steps through them. He just wants to burn his belongings.Initially, though? Initially, Bonfire Peaks just irritated me. Sure, it's beautiful - well, if voxel art's your thing, I guess (I'll admit that I wasn't keen, but this highly stylised visual signature absolutely works here) - and yes, there's a soothing soundtrack to keep you zen as you stand, perplexed, trying to work out what to do next. I hated the way he moved, though. I hated the fact he had to ascend steps backwards when carrying crates because the grid system he walked upon didn't accommodate diagonals. I hated that stupid box. I hated the elusive bonfire. The plinky-plonky music even started to grate because it intimated an inner peace that sat at odds with how I was actually feeling. You see, the premise of every level is simple enough: burn the box. But it's oh-so-much easier said than done. Sometimes, you'll need to navigate up crumbling stone steps to reach the crackling bonfire up high; other times, you might have to construct a crude set of steps with the numerous crates that litter the place. There are arrow-firing totems and tall poles that block your progress and, occasionally, you'll need to slip the box into a racing current to courier it from one side of the map to the other. Very rarely is the solution obvious, even if - at first glance - it looks obvious. And no, there's no hint system. I'm still a tad conflicted about that. If YouTube had been flooded with walkthroughs at the time of this review, I have no doubt I would've crumbled and looked up the solution, because some of those puzzles still have me stumped. But it's to the developer's credit that it stands firm here, refusing to hold your hand or whisper a clue. I reckon half of the puzzles I solved were flukes, and the other half happy accidents. I solved most of the tough ones by having a tantrum, rage-quitting, and coming back afresh the following day. Even the overworld - the world that ties all the puzzles together - is a puzzle in and of itself, both literally and metaphorically. It's a strange place, littered with... well, him, I think. There's a discarded toy T-Rex here and a grand piano - complete with stool - there and a hospital bed hanging over a ravine. Plus there's a corner sofa and a jumble of Sesame Street figures and - at the top of a mountain, next to a tiki torch - a full standing desk complete with dual screens and power sockets. With every completed puzzle, you'll magic a box out of thin air for use in the overworld, and you use those crates and boxes to navigate the island, ascending the cliffs by scaffolding crude steps and walkways where none existed before. You don't have to complete all puzzles to progress through the overworld, either - I reckon you can get through by completing maybe half of them - and there's no time limits or faux sense of urgency whatsoever. It teaches you not through prompts or pop-ups, but by careful design and experimentation. Plus Bonfire Peaks is wonderfully forgiving. I don't think I've ever abused an Undo button quite as vigorously as I have here because, perhaps more wonderfully still, it doesn't hold your mistakes against you. There is no rudimentary limit to how many times you can hammer ~undo~, either in the puzzle world or the overworld. Bonfire Peaks understands that we all learn from our mistakes - even the big, messy, dangerous ones. I suspect that Bonfire Peaks' style and delivery won't be to everyone's taste, and some may find its simplistic style belies its devilish puzzles. But the more time I spent with it, the more I appreciated it's gentle storytelling and challenging puzzles, and the more I wanted to know this guy and the bizarre island he's found himself on, even when - especially when - the puzzles enraged me.It's funny how there can be no words - not even a single facial expression - and yet you can still feel someone's pain. The music may be soft and soothing, but it can't mask the melancholy that hangs so heavily across this land. So if this mysterious man on this mysterious island wants me to help him keep burning his belongings, then burn his belongings I shall. We'll burn it down together."}