{"ref": "https://www.eurogamer.net/r-warriors-xbox", "date": "25 Oct 2005", "game_name": "The Warriors", "text": "Drug dealers and gang leaders. Corrupt cops and haughty hookers. Senseless beatings, mindless murders and more random acts of violence than you can shake a shiv at; yes, it's time for another Rockstar game. But don't go thinking that this is a plain old GTA clone just because it features all of those familiar hallmarks. There's so much more to The Warriors - it's got a unique, original style all of its own, and it offers a fresh new spin on a classic genre. Most importantly, it's great fun to play and hard to put down. We've got a fresh new blister on our left thumb to prove it. The Warriors is also a prime example of how movie tie-ins can work brilliantly if done properly. It's based on the cult 1979 film of the same name, which follows the struggle for survival of a New York gang wrongly accused of murder. They have to make it through the big city and all the way back to Coney Island without getting done over by rival gangs intent on revenge.It's clear that the game is going to remain faithful to the movie right from the start - right from the start screen, in fact, which depicts the Coney Island Wonder Wheel as seen in the film's opening shot. But the storyline begins three months prior to the events of the film, and the first level explains how baby-faced graffiti artist Rembrandt joined the gang. Playing as Rembrandt, your first task is to prove yourself to the Warriors by beating up a load of tramps. And to learn how the combat system works, basically: X for a light attack, A for a heavy attack, both together for a strong attack, and B for a grab.It's perfectly possible, should you so desire, to make your way through the game using only these button presses, perhaps picking up the odd weapon for a bit of extra power. But like all good brawlers, The Warriors features loads more moves and combos for those who prefer to perfect their fighting down to a fine art. There are throws and tackles, wall smashes and charge attacks, and even tandem moves you can pull off with your fellow gang members. The more combos and ~style~ moves (throwing enemies through windows, off rooftops, into tables and the like) you pull off, the quicker your Rage Meter will fill up. Once it's flashing you can pull both triggers to enter Rage Mode, signified by everything going all blurry and brown, and then perform more powerful attacks and some impressive finishing moves. The controls are responsive, the moves are slick and the combos work satisfyingly well. This is just as well, since a great deal of your time will be spent punching the lights out of rowdy gang members, truncheon-wielding cops and even the odd disgruntled neighbour who's just caught you nicking his car stereo and intends to get it back off you with the help of his machete. And since you don't get access to guns at any point, it's even more important to hone your combat skills. That's not to say there are no weapons in the game, however. Wherever you go you'll find loads of stuff that you can make violent use of, from bricks, breeze blocks and planks of wood to dustbins, hockey sticks, baseball bats, even stereos and guitars. Our personal favourite is the beer bottle; smash it over your opponent's head, and you can then use the broken end to slash his abdomen open. So simple, and yet so effective. Some gang members carry knives, too, and picking one up gives you a definite advantage over your foes. You might occasionally wonder why someone's left all these bricks lying around everywhere, and why that crate never seems to empty no matter how many beer bottles you pluck out of it, but that would be because you're a quibbling pedant. The point is that it's great to have such a wide array of weapons at your disposal that work in such varied ways - we don't miss boring old guns a bit. There's also a good variety of enemies to face off with, since The Warriors game features all the gangs from the film - all replete with their own individual styles. The Baseball Furies, for example, like to don New York Mets outfits and paint their faces ghoulish colours, like rejects from Kiss. The AC Turnbulls take a less flamboyant approach with their denim uniforms and shaven heads, while the Harlem Boppers look sharp in purple shirts and trademark trilbies [I can imagine - Ed]. Then there's all-girl gang the Lizzies, creepy mimes the Hi-Hats, and kung fu fighters the Grammercy Riffs - the biggest and most powerful group in New York City. Rather disappointingly, although all the gangs look different, they seem to fight in pretty much the same way. We found that the same sets of moves and combos worked just as well for each gang, and no matter which Warrior you're playing as. Their fighting styles do at least look different, though. Cleon goes for high kicking martial arts moves, for example, while Rembrandt specialises in rather wimpy-looking pushes, but it doesn't feel like any of the characters are particularly suited to a certain set of moves. However, there's enough variation in other areas of the game to prevent this from becoming too much of a problem. Each mission features special objectives to achieve, and The Warriors doesn't fall back on the old ~Kill Everyone~ ticket too often. Instead, you might find yourself defending shopowners who are part of your protection racket from marauding gangs, or racing to pick a lock before the Furies catch up with you, or starting a riot to distract the police so you can go and uncuff some unfortunate fellow Warriors. During these missions you'll inevitably come up against loads of enemies, but you don't always have to fight your way through. If you're running low on health, you can usually simply leg it and find a shadowy place or high rooftop to hide. You might find that a pursuer lurks around in the hope that you'll show yourself, but you can throw a bottle or brick in the opposite direction to create a distraction and lure them away. In some levels, this stealthy approach is the only way to make it past the vast number of enemies; attempting to fight your way through (especially if you've got no health power-ups to hand) is not always possible. It's great to have such a healthy amount of variety in terms of the missions you're tasked with completing, but not so great to have a similar amount of variation in the difficulty levels. We pretty much sailed through the first three or four missions only to be confronted with an absolute bastard, where you enter a graffiti contest and have to spray your tag before the rival artists manage to complete theirs. Things are complicated by the fact that you have to go and find more paint after each layer of the tag, and the fact that within a minute or so the whole event descends into chaos as various gang members start on each other. A few of your fellow Warriors are there, supposedly to help you out, but they're not much use. They don't do a brilliant job of defending you from aggressive rivals and why they can't go and find the bloody paint while you're busy painting, we're not quite sure. Fortunately, the AI is excellent in other parts of the game. You get a selection of War Chief commands which you can use to tell your chums to follow you, watch your back, or run and hide on so on, and they will generally obey these commands quickly and efficiently. They're good fighters, too, and don't often get in your way.But back to the graffiti competition. It seems that in order to win you have to do each layer of the tag perfectly (by using the left stick to trace precisely over an on-screen squiggle) and then get to each can of paint before your competitors every single time. There is no room for error and as a result it took us at least 20 attempts to finish the level - it stopped being fun after about five. Similarly, some missions are far too sparing with the checkpoints, like the one where you're tasked with stealing five car radios and looting 50 items of booty. Oh, and avoiding billions of cops and gang members along the way. We spent a full 25 minutes raiding shops and obtaining all the radios, and with just 12 items left to collect we found ourselves under arrest and looking at a Game Over screen. This was extremely frustrating, especially since other levels will give you a checkpoint each time you complete a fairly simple objective. As for the boss levels... don't get us started. They're frequently almost impossibly hard and require you to start over again from scratch if you make a simple error, but that's just like it always was in old school brawlers, you could argue, and yes, there is a huge sense of satisfaction when you FINALLY take that hard-as-nails gang leader down. Mercifully, no matter how hard a boss was to defeat or how difficult a level was to complete, we never got so frustrated that we wanted to give up altogether, since there are huge incentives to keep on playing. For starters, there are loads of bonus missions and extra content to unlock - such as the vast array of multiplayer Rumble Mode levels. To begin with you only get two basic options: 1 on 1, a simple versus mode, or War Party, where two gangs take each other on. You can battle a CPU opponent, fight a friend or play co-operatively, and choose to play as members of other gangs if you're bored of being a Warrior. There's even the option to build and customise your very own crew if you feel like it.The more of Story Mode you complete, the more Rumble options become available. There are Last Man Standing modes, graffiti battles, and a great mini-game called Have Mercy (as it's described in the game, ~Like Capture the Flag with a chick.~). We also like Wheels of Steel, where you race an opponent in a wheelchair.And that's not all. Once you've completed the five flashback modes that make up the latter part of the game, you unlock an arcade machine called Armies of the Night. Without wishing to spoil the surprise, let's just say it offers a real treat for fans of old school brawlers. The flashback modes are also a treat for fans of the film. Like the game's first dozen 'pre-movie' missions (covering the three months leading up to the night where the Warriors become New York's most wanted), they divulge all sorts of new information. You get to find out how each key member of the Warriors came to join up, and even how the gang got started in the first place.It's all brilliantly done, and there's no sense of anything being tacked on or invented simply because it suits the gameplay mechanic. The characters are true to their big screen counterparts at all times, and even sound exactly like them thanks to almost all of the original cast members doing voice overs for the game. Rockstar has also licensed the original soundtrack and makes superb use of it. The fantastic 'In the City' end credits tune is in here, along with the wonderfully menacing Warriors theme, 'Nowhere to Run' and a whole host of other seventies classics that are perfectly placed. There's something about beating up a Baseball Fury to the tune of Amii Stewart's 'Knock on Wood' that's just sublime. What with the authentic soundtrack, ace voice acting, utter faithfulness to the source material and varied, well-designed gameplay, The Warriors is simply a great movie tie-in.But this isn't just a game for fans of the movie. It's a game for anyone who enjoyed the classic brawlers of old, or who's too young to know what they missed out on. The combat system is excellent, the choice of weapons is well-considered, the missions offer a healthy variety of challenges and despite the huge amount of fighting required of you, a well-designed control system means it never gets too repetitive. Admittedly, the graphics are far from stunning. In typical Rockstar style, many textures look blurry close up, the character models - though authentic - aren't particularly detailed, and the lighting is a bit dodgy in places. And while the camera works well for the most part, it will occasionally go a bit mental and get stuck behind a lampost, a wall or even a Warrior's arse. It's also sometimes difficult to see what's going on during fights, but when there's seven or eight individually animated characters all going at it that's to be expected. Plus you can always rely on the right trigger to stay on target and avoid blatting your fellow Warriors even when you're in the thick of it. It's true to say that visually, The Warriors does not impress. But as a film tie-in, as a classic brawler, as a game that offers excellent multiplayer modes, quality bonus content and a unique style all of its own, it excels. I'd even go as far to say that I prefer it to the Grand Theft Auto games, in fact, though that may be because I do, indeed, love the movie. Even if you don't, The Warriors is well worth checking out."}