{"ref": "https://www.eurogamer.net/r-sly3-ps2", "date": "16 Oct 2005", "game_name": "Sly 3: Honor Among Thieves", "text": "We've never quite been able to get our heads round why Europe spurns the lovable Sly Raccoon games. They're among the finest platformers to grace any platform (never mind the PS2), more than holding their own against the esteemed Jak and Ratchet titles. Full of wry wit, charm, slick playability, wonderful visuals and top class production values, they should be routinely grazing the top end of the charts.Which couldn't be further from the truth.To put it into some kind of Sony-related context, even the alarmingly low-selling ICO (around 25,000 units shifted in the UK) massively out-sold the original 2002 Sly title - by an estimated nine to one. Estimated, because the Sucker Punch-developed platformer didn't even scrape the Top 200 PS2 best sellers of 2002 (that's less than 3,500 copies). And to add insult to injury, last year's superb sequel sold just over 7,000. How is it that an acclaimed series from the platform holders themselves can flop so dismally in a territory that loves its platforming titles? It's a mystery that Agatha Christie herself would have been proud of.Normally, by the time the third game in a series arrives (on the same platform, in less than four years), we're slightly bored of running over the same ground. Not so with Sly and the gang. There's something heart-meltingly endearing about each of their adventures; it's the gaming equivalent of Scooby Doo or Danger Mouse. You know roughly how it's all going to play out, and the formula is so well worn that it's hardly going to inspire yelps of surprise from the household pets. But when a game manages to deliver 15, 20 or more hours of satisfying entertainment, we're strangely happy to get more of the same.As ever, the story is one of the main attractions, and Honor Among Thieves picks up where the last one left off. Poor old brainy turtle, Bentley, has suffered a crippling injury that's confined him to a wheelchair, and Murray - the hapless, lumbering pink Hippo - blames himself for the incident. Wracked with guilt, Murray troops off to the Australian outback to find inner peace. Hooking up with an Aboriginal guru, he rejects his life of violence for a life of spiritual meditation.But when his old gang find themselves in a bit of a jam, they talk him into using his brawn for 'peaceful' means, and coax him back into the fold in time to do battle with their latest set of adversaries. In this instance, the nefarious Dr M is attempting to crack the Cooper family vault, and has gone as far as building a fortress around it - so in order to put a stop to these evil plans, Sly must put together an Ocean's Eleven-style gang of specialists to infiltrate the vault and claim back his family's legacy.As with the superb second game, each 'episode' takes place in a hub-style environment where nine or so 'jobs' must be undertaken in order to progress. In terms of the feel and the formula, the gameplay hasn't really changed. In fact, the opening Venice-based level is almost a carbon copy of one of the latter stages of Sly 2, which tends to suggest the game's quick turnaround involved a fair amount of corner-cutting.Once again, each episode opens with a brief overview from nerd-central Bentley, giving you a whistle-stop tour of the plan at hand with a quick rundown of what each character's supposed to do. Not everything goes to plan, of course, but on the whole you'll play for the majority of the time as Sly, while the remaining missions are split evenly between Murray and Bentley (later, you even play as a variety of other characters, without wishing to spoil it).Exactly like last time, each character has their own unique characteristics and abilities, and all are upgradeable. These are bought with the cash you harvest from broken objects and downed aggressors, but by far the most effective means of building up a stack of loot is to sneak up behind your target and pluck their coinage from the little pouches that dangle from their behinds. Some upgrades are obligatory, so it's always worth picking pockets and smashing up anything that looks fragile.So, as you might have gathered, the core of the game remains steadfastly the same. Sly can still land on a sixpence, you'll still be able to pull off the same improbable jump manoeuvres as before (yep, the old 'double jump and circle' to land on anything that sparkles), and the combat combos are as basic-yet-satisfying as ever. Murray's still full of hilarious bravado and biff-bang-pow missions, and Bentley's as nerdishly loveable as ever - even more so now he's in a wheelchair and capable of hopping from side-to-side while in it. And, yes, the game's still pleasant to pick your way through, being just the right side of challenging when it needs to be.From a technical standpoint, it's just as lavish as it ever was, with that living-breathing cel-shaded comic book feel that no-one else has carried off with such aplomb. Every character has a bunch of cute distinctive touches that add to the experience; not just in terms of the little animations at which Sucker Punch excels, but the little audio flourishes that underpin everything the game does. From the first episode onward there are little interchanges that you feel like you're eavesdropping on, from characters singing away to themselves or snatches of conversation. Such things add so much colour to a game, and it's an area so few titles bother with.Although we did stumble through one notable area of slowdown in a tiny segment of billowing smoke, the rest of the game comes across as a masterclass of how to make a videogame look fantastic. The way the platforms yield to your weight when you leap on them, even the way things break apart. Layer all of the animation, and the incidental touches we've mentioned with a fantastic script and sympathetically pitched soundtrack, and it's a game you can't help feeling good about while you're playing. Even the controls and camera feel spot on. There's barely an area that doesn't feel just 'right' - and that includes dumb sentry AI. Yes, even that seems to work perfectly within the context of the game. You know the rules, you know what you can and can't do, and the whole game works from that point onwards.Given that almost everything about Sly 3 seems practically unchanged since the last time out to begin with, it's a pleasant surprise to find that there's actually much more to it than initially meets the eye. It's absolutely rammed with mini-games, for a start, with all manner of driving, shooting, sniping, chasing, and flying interludes breaking up any remote chance of the game settling into a monotonous groove. In the main they're top-drawer examples of how to turn a bog-standard platformer into a bewildering pot pourri of game styles. Some might find the 'here-comes-the-mini-game' parade a little wearisome, and wish Sucker Punch could just focus on platforming, but we enjoyed almost every one of these interludes. They're consistently well-paced, never outstay their welcome and add much needed variety.Another new addition is the optional Master Thief challenges. Each episode contains around nine of them (to go with the nine or so mandatory jobs), and generally link up with tasks you've already pulled off but ask you to do them, say, within a time limit, or without taking significant damage. Interestingly, the game doesn't actually inform you that they're available, but should you go back to the game menu, there they are awaiting your attention - should you feel the need to go for 100 per cent completion. To be honest, most of the Master Thief challenges are just throwaway extras, but it's nice of Sucker Punch to go to the trouble of putting them there for the real diehard fans. Think of it as a 'hard' mode, which is probably as good a way as any of tackling the accusations that the game's too easy.The presence of four individual Two Player challenges is another throwaway-but-welcome new addition. First up, you get a Cops and Robbers split-screen mode where one player controls Sly and the other takes charge of Carmelita Fox, with Sly trying to nick stuff in a Capture The Flag manner while Carmelita has to stop him. Nothing much to see here. After that, there's a co-op Hackathon game, where both of you control little spaceships while wave upon wave of attackers swarm you. Very Robotron, very retro, very throwaway. Next! Biplane Duel and Galleon Duel are, again, hardly essential unlockables, offering little in the way of long-term excitement. Are they nice to have anyway? Hmm, we could live without them.One new addition we haven't mentioned yet that's pretty much entirely pointless is the '3D' mode, which lets players don 1950's 3D specs and get a headache while items of scenery pop out in front of their eyes. Given the fact that it's not compulsory, we probably shouldn't complain too much, but the effect isn't that great (it never has been, has it?), and it arguably only serves to put you off what you're doing. After a couple of sessions with it, you'll most likely just get on with playing the game the way your eyes can actually deal with. You'll save yourself a headache, at the very least.Given that most people around these parts never bought either of the first two Sly games, pointing out that the third one is kind of more of the same will be a bit lost on you. More useful, perhaps, is to simply point out that it's up there with the best platformers ever made.Sly 3's rammed to the gills with heart-warming interludes, a lock-tight script that keeps you wanting more, and features some of the most loveable characters to have entered the pantheon of videogaming history. If they made Sly Racoon soft toys, we'd probably buy the set - and yours truly doesn't even own soft toys, if that tells you anything. That the game itself is still tugging at our heartstrings on its third incarnation is also a good sign. Sure, it's not especially new or revolutionary, but what it does is serve up a consistently varied and entertaining package of short, sharp tasks that rarely frustrate, and nearly always make you smile. Any game that manages to deliver gift-wrapped fun the way Sly does has to be worth a look. Just don't ignore it this time, eh?"}