{"ref": "https://www.eurogamer.net/r-phoenixwright-ds", "date": "10 Oct 2005", "game_name": "Phoenix Wright: Ace Attorney", "text": "Japanese translations walk a fine line. It's one of those mysteries you don't ever want to solve, like how come all the jokes in Asterix are based on English puns, if the comics were written in French? Anyone who played the truly wondrous Mario & Luigi: Superstar Saga on the GBA will understand. Fawful, the character who spoke in badly translated Japanese (~I HAVE FURY!~) - how did that joke possibly work in the original Japanese version? And if it didn't, then...It's a mighty testament to Phoenix Wright: Ace Attorney that I'm wondering the same thing as I play.It screams wrongness. A DS lawyer-'em-up, a long-running Japanese series receiving its first English translation, post-90s point and click adventuring, almost static graphics throughout... A peculiarity, a novelty at best. But surely not the most fun adventure game in absolutely ages?It even manages to hide this surprise from you for the first half hour or so. As a means to welcoming in a new Western audience, the story told is of how your character, Wright, saw his career begin. For the most part, it's a straight remake of the original Japanese GBA game, imaginatively reinvented for the DS. Fresh out of law school and facing his first court cases, a nervous Wright doesn't appear very impressive in the court. This causes the judge to need to reassure himself by asking you a series of questions, to check you're up to lawyery standards. Legal fundamentals such as, “What is the victim's name?” Erm. Having been told it about fourteen seconds earlier, you pick it from a list of three. The next question is just as easy, but Wright can't remember! You have to go through your 'Court Record' (casenotes) to find the answer! (Thus learning how to use your Court Record, see?) And are henceforth qualified to continue as a lawyer. Bonkers.The response to this is to laugh out loud. It's an entirely daft premise that rubbishes any sense of court-based realism, and makes the entire thing seem completely farcical. What you realise in about half an hour's time is: It is completely farcical. And that's a joyous thing.I've not put my DS down in days. I've taken it to the pub, to a café for lunch, on the train for only a ten-minute journey. I took it to the Chinese takeaway this evening, and found myself playing during the walk on the way back. Look, I've taken my DS into the toilet with me for every visit. And this isn't for some dumbly addictive puzzle game, but for a point and click adventure. Phoenix Wright: Ace Attorney, is compellingly entertaining, ludicrously morish, and absolutely and utterly bonkers. It's important to stress, this is a response that will only be understood by those who know. Here is a fantastically upbeat review, celebrating a game that brings bucket after bucket of daft joy, but if you never found yourself unable to leave the house because you'd opened a new location to explore in Day of the Tentacle, then you aren't going to understand. But that's ok - if you didn't feel that way, you're a dreadful person and not of any concern. And no, Phoenix Wright isn't nearly as awesome as DOTT, but it does generate that, ~A whole new area to click on!~ delight. We understand, don't we?Perhaps the level we're working at can be best explained thusly: After the first of the five chapters, you are assisted by a 17 year-old girl called Maya. Maya is the younger sister of your former boss, the late Mia, whom you take under your wing following Mia's death. She is endlessly and infectiously enthusiastic about everything, countering Wright's bemused and comparably fuddy-duddy responses, and delights in teasing the 24 year-old Wright for his complete lack of street cred. Oh, and when cases get tough, she channels the spirit of her dead sister. (You can tell when she's channelling Mia - she increases in height, her hairdo changes, and her breasts suddenly double in size revealing a huge cleavage). Is it taking itself seriously? Well, weirdly, kind of. Mia's wonderful, and having her around is a real blessing - Wright cares for her a great deal, and she provides the safety of supportive education and confidence. She's replaced Nell in my heart for Nintendo-based cartoon character true love. A Big Deal. It really sucks that she's dead. The game's deep enough to sustain that. But that doesn't stop it from throwing dozens of excellently scripted lunatic characters at you with every chapter.Using Manga-esque cartoons, barely animated characters express emotions in that chemically imbalanced way, suddenly bearing vicious fangs of anger, before smiling broadly, then crying rivers. The script is vast, each character given huge amounts of dialogue, most of it complete nonsense and really, really funny. The last time I laughed out loud at a game this frequently was Soldner, and that was for very different reasons. The time before, Mario & Luigi - it really is that funny. And the same volume of text, crucially, is given to location descriptions. Entering a new area means there's a feast of things to click on and learn about, brilliantly producing different descriptions depending upon who is in the area with you at the time.Yes indeed - finally someone has noticed how ideal the DS is for pointing and clicking. After Another Code used the option so disappointingly, Phoenix Wright gets it right. In fact, this is the first DS game I've been able to play extremely comfortably with my fingers, rather than the fiddly stylus. Want to look at the painting on the wall? Press on it with your finger, and press the ~examine~ button. It's delightfully tactile and pleasingly precise. The same applies for the Court Record, which behaves as a form of inventory, containing key evidence you may have discovered while sneaking about crime scenes or rifling through the drawers of the deceased. It's swiftly navigable with swishes of your fingertips, kind of how you wish all computery things would be.And now, the best bit. The court cases. Oddly, the game spends a lot of time exploring the relative moral predicaments of defence and prosecution lawyers. This is reflected in the stories (details of which are very deliberately being avoided as best as possible in this review - they are as mad as everything else, but their joy is in the surprise), focusing around a small group of characters linked together by these two job titles.Phoenix is a defence lawyer, and as such, in the most peculiar parody of a court imaginable, must cross-examine witnesses looking for contradictions in their statements. This is performed by either using 'Press' (~HOLD IT!~), to enquire more deeply and put on the pressure after a sentence, or ~OBJECTION!~, whereby an item from your Court Record is thrown into the fray to prove a falsehood. It's a shame that you don't get to shout ~OBJECTION!~ into the mic for yourself, although rumour has it this will appear in the next version. But it remains endlessly entertaining to see the massive red letters fill the entire screen, and hear the digital voice shout it out in manic excitement.Phoenix Wright: Ace Attorney is to the legal world what Mario Golf: Advance Tour is to the PGA. It is not an attempt to simulate court proceedings, and any hope of applying logic to situations is instantly abandoned. What makes it wonderful, however, is that the game's own internally consistent illogic becomes quickly familiar and engrossing. Defendants don't plead guilty or not guilty before trials begin, the defence can choose none of their own witnesses, the judge appears to be allowed to render verdicts when it pleases him, and silliest of all, you're allowed to make four mistakes per trial, the fifth automatically causing the judge to convict no matter how unproven the crime. But you simply won't care.You won't care because you're laughing so hard at the crazy old security lady calling the scary prosecution lawyer a ~whippersnapper!~, or chuckling at the judge's not knowing what a ~DJ~ is, or feeling a warm fondness for Maya when she lets loose a sudden outburst of excitement at seeing a character from a TV show, or feeling genuine sympathy for someone when you realise the pain they've been living with for the last fifteen years...You might care, however, about two big flaws. One: Conversation trees are really only trunks, and dialogue decisions are often false, with whichever choice you make leading to the exact same pathway. Troublingly frequently this is achieved by having Wright say, ~Heh heh, only joking...~ and then choosing the other option anyway. Doing this so brazenly damages the illusion, which brings us to...Two: There's literally only one possible route throughout, without even an attempt to disguise this from you. Each section is filled with a certain list of things that need to be done before it will move on, and not because you learn of where you should go next, but rather that it's waiting for you to find the missing item before another location will update with a new character, or howsoever it may manifest. The best story-driven games are linear, but the very best make good efforts to hide this from you. Phoenix Wright shows his workings, and it's to his detriment.But never mind! Sheer size and depth, and such a wonderfully peculiar script, are so massively in its favour that the perennial issues above can for once be almost forgotten. How can you care when there's dialogue exchange such as:Or character names like Detective Dick Gumshoe?Or confetti thrown in court when NOT GUILTY verdicts are made?Or any number of mentally unstable examples of lunacy that makes this the most fun I've had with an adventure in such a very long time. And for a very long time. Unlike Another Code, this is a hefty game. There are at least ten hours of play up until the end credits, and even then there's a little (read: very big) extra bonus. Well, ok, a vast, epic bonus. Another entire story has been written for the DS version, lasting about as long as the rest put together. Astonishing. The bumper extra even implements new features, such as a 3D inventory and DS gimmicks like blowing on the mic to dust for prints. It's like being cuddled by fun.Unavailable in this useless, stinking country, it can be imported from the States. And if you've a spark of joy at the gleefully daft within you, you'll do so. Now I only have to learn Japanese so I can play the others in the series."}