{"ref": "https://www.eurogamer.net/r-fifa06-x", "date": "30 Sep 2005", "game_name": "FIFA 06", "text": "September and we're already reviewing FIFA? What's that all about? Some things are carved in granite, and FIFA's annual late October outing among the falling leaves and the bracing weather has been as predictable and comforting as a steaming cuppa in the morning. But not anymore.The reason? Competition. In this game it's all about being first out of the blocks. For the past four years, Konami's Pro Evolution Soccer series has chipped away at EA's gargantuan ownership of the genre for a couple of reasons. For one thing it's simply the better, deeper game, but Konami has profited greatly by stealing a march on Electronic Arts' license-rich effort by coming out a few weeks earlier. In fact, in the past few years, each version of PES has sold a couple of hundred thousand units before EA has had a chance to catch up, and last year's decision to go multi-format boosted sales even further.But despite the perception that it's neck and neck, it's not. EA's infinite resources brought FIFA to an astonishing seven formats last year (and will probably have increased that this year); so it was hardly surprising to note EA was still ahead of PES by over 320,000 units by the final reckoning at the end of last year. The decision to drag the release date forward another couple of weeks will probably make it even harder for Konami to bridge the sales gap. But does it really matter?Yes and no. Of course, you always want the better game to sell better, but a point many of the FIFA detractors have missed of late is that EA's behemoth franchise is genuinely an entertaining game in its own right. It's not better than PES, and maybe won't ever be. That said, it's an increasingly worthy contender, and literally chock full of its own unique license-based selling points that Konami continues to ignore.FIFA 06, again, misses the mark for a variety of reasons that we'll elaborate on in a moment, but not by enough of a margin to warrant some of the mindless derision that the brand routinely attracts. In many respects it's the complete football game, nailing many of the things people rightly demand from a sports title. This isn't going to turn into 'In Defence of FIFA', but it's worth giving credit where it's due, and EA's Canadian studio deserves plenty.In what is now (give or take) its 15th incarnation (unbelievably), EA has still managed to heap a bunch of new features into the equation. As ever, some are completely throwaway gimmicks that add little to the overall experience, while others are the kind that aren't instantly endearing but have the potential to add more depth to what has evolved into a remarkably complex title.In terms of out-and-out throwaway, the new Manager Mode offers little in the way of real involvement beyond having the option to play up to 15 league seasons with a team of your choice. On paper it's a nice way of adding a Player Manager feel, with the ability to either play the game (as if it were a normal player versus CPU match), watch a quickfire text commentary, or skip straight to the result. Usefully, if things are going a bit pear-shaped you can choose to jump in and take over playing the game, although - annoyingly - you can't leave the CPU to simulate the game if you've had enough. Strangely, you can't simply act as a spectator; it's either control the match directly or not.Sure, you can dabble in an exceptionally stripped down transfer market, make multiple-choice decisions that affect morale (~do you tell the youngster with the stupid haircut to shave it off, or turn it into a charity event?~) spend cash on upgrading your staff abilities and so on. But the level of micromanagement is so lightweight as to render it a bit undemanding and pointless; after a couple of hours of it, the chances are you'll simply want to play unfettered footy. If you want a game to test the tactician in you, play Football Manager. Even so, it's hard to quibble with an extra mode; it's there if you feel like playing hundreds of single-player games of FIFA with a team of your choice. Just don't be surprised if by the end of it you feel it's been a bit of waste of effort.Another slightly half-baked addition is Team Chemistry, which comes into play in Manager Mode as well as general friendlies. Instead of the skill and cohesion of your team being based on their 'on-paper' stats, there's now a whole other issue to bear in mind - that of morale and understanding. The trouble is, as with real life, the chemistry of your team is something that practically impossible to quantify. ~I'd say my team had 74% chemistry today,~ is not something you'll be overhearing down the pub after a match, yet EA seems to think it can apply some sort of mathematical formula to how well your team will perform out there on the pitch. And even if your team is appearing to be a little groggy in any given match, how much of that is down to your abject uselessness or the game's wonky AI? It's little more than placebo effect. ~Oh yes, we definitely played 10 per cent better now that our Chemistry's up to 87 per cent~. Daft.And we're not done yet. Every year sees another new control addition just to frazzle our ageing brains just a little bit more, and this year's no exception. Not content with First Touch, and Off the Ball skills, and all that hand-breaking combo-stuff, we've now got a further layer of Tactics and Mentality to deal with. By essentially forcing the player to choose analogue or digital controls (as opposed to both), EA has freed up either the d-pad or left stick to allow you to issue attacking of defensive tactical commands at any time in a match. By default, pressing up on the d-pad will tell your team to counter attack, right urges them to use Wing Play, left requests a third man into whatever move you're attempting, while down requests a 'Box Overload' of players when you're moving into the penalty area. Defensively, meanwhile, holding down the left trigger and using the d-pad directions gives you the chance to influence the team to press, perform the offside trap, use a flat defence, or zone defence. [I recall European Champions Liverpool using that one. - Tom]All of it sounds pretty good on paper, but honestly, it's enough trying to remember to pull off all the other controls available to you without heaping another layer of commands on top of you. In practice, you'll try, try and try again to put these enticing-sounding commands into play, but inevitably have the ball whipped off your toe in the process of shifting your attention for a split second. The reality is, most players won't have the presence of mind or the luxury of time available to them to consider whether it's time for some Box Overload action when there's a pesky full-back jostling for possession while you're trying to deliver a cross. As much as you want to, it's tough enough retaining possession and making sure your passes meet your man without considering fine tactical adjustments. File under 'Nice Try, EA'.So did EA manage to include anything this year that's worthy of excitement? Hrm. Well, the Retro stuff tapped into our nostalgia glands for a few minutes, showing us a montage of the past 12 years of FIFA, but sadly they didn’t 'do a Madden' and chuck one of the old versions in for fun (or if they did, we didn't see it/unlock it). One genuinely solid new addition, though, is the myriad of single-player challenges, which take a leaf out of LMA Manager's book and apply the formula to FIFA, by which we mean 'score X goals in 5 minutes against Pro opposition' or 'come from 3-0 down' and so on. In terms of offering new long-term challenges in single player mode, it's excellent, and one that could keep the game alive for far longer than usual.The real meat of the game, meanwhile, feels suspiciously similar to last year's effort, which is to say solid, engaging, harder than you'd expect to pick up and play, but eventually rewarding and satisfying. And much like last year, until you learn how to pull off the more advanced controls, you'll be embarrassingly rubbish at the game. Unlike the 'traditional' FIFA ethos of allowing players to run up the pitch with the ball stuck to their foot and score goal after goal, it's stupendously easy to lose possession these days. Try and turn your man, and nine times out of ten they'll emerge with the ball. Try and run up the middle of the pitch, and even the best players in the world will end up off balance and unable to break down even the most ordinary defence. It's a game where - to begin with - goals will be at a premium.It's also a game, perversely, where you'll find it pretty hard to get possession back off your opponent. Sliding tackles have to be timed with supreme perfection to result in anything but a yellow card, while the 'soft' tackle is just that. You really have to try and simply run into the path of the oncoming player, or try and get level and muscle them off - but it's by no means a straightforward task. Chances are that your early encounters will be depressingly low on possession and even lower on shots.Eventually, though, the penny starts to drop that the key to success is pulling off little one-twos (left trigger plus double tap A), and learning the right context in which to pull off first-touch moves, dummies, fakes, and chipped through-passes. The more ways you build up to actually keep hold of the ball, the more opportunities there are to score, and the more you learn how to trick the keeper.In a sense, FIFA 06 has just as many exploits as any previous version, and although it seems harder to score than before, once you've sussed out the trickery the goals will start to flow, but with more skill and realism than ever before. The only problem with this approach is, like PES, the more practised players appear to be able to almost score with every attack. And anyone who's been on the wrong end of a humbling knows how much fun that can be.If anything, our major problem with FIFA as a whole is that it's weighted way too heavily in favour of being able to attack. Being an effective defender in FIFA amounts to little more than stabbing a single button and hoping that the opposition will run into your player. The slide tackle alternative is something of a last resort lottery, and for that reason the gameplay feels a noticeably lop-sided affair. Maybe it would make for a dour struggle if it was too easy to defend in FIFA, but the problem it faces currently is that by loading attacking options at the expense of defence, there comes a point where goal fests start occurring again - and we're back to square one.Strangely, this year's FIFA also confused the hell out of us by managing to be a worse spectacle than last year's version. Sporting some horrendous (and regular) slowdown, the free-flowing nature of the gameplay takes a dive whenever the ball gets booted back into the midfield from the penalty box. Meanwhile, some vile depth of field effects adds a haze to the visuals, making the players look like they’re coated in mist. Whenever the game switches to a close-up view, or during corners, the effect is even worse. Whatever happened to the sharp and crisp FIFA visuals of old? Worse still, there are some horrendous lighting decisions that allow various pitches to be almost cloaked in darkness at one end to try and emulate the effect of a shadow being cast during bright conditions. Elsewhere, there's even one pitch cloaked in what looks like blue light. What the hell's that about? How did EA manage to mess up something it's normally so brilliant at?Putting the occasional graphical problem to one side for a moment, the standard of the player models is generally exceptional, and EA once again leads the way in terms of player likenesses. There are some howlers, though, and we'd rather that certain lesser players were just generic models than hideously deformed. That said, the animation is uniformly outstanding, with a real sense of ball contact - especially during the fantastic action replays where the goalies really do respond to your shots in an uncannily realistic fashion (including one instance where a wayward shot cannoned off the keeper's arse, amusingly).Despite a general sense of progress, though, there's still a feeling that the ball physics aren't quite what they could be. Whereas PES is all about the ball (and often annoyingly 'pingy' because of it), there's still a limited replication of the ball being a separate entity. Aside from the odd wicked deflection, it still feels a tad one dimensional.One thing we still can't quite understand, though, is why height and weight are still so stubbornly overlooked in footy games. Surely, apart from skill, some of the most important characteristics of a footballer are how much bulk they carry around, and their aerial prowess. Yet, time and again - likenesses aside - it still feels like you're controlling 10 almost identical outfield players. Some may be faster or better in the tackle, but that's about it. Progress still seems to be a long way off. Maybe in the next gen, eh?Back in the here and now we managed to squeeze in a dozen or so online games when the servers were switched on this morning, and can report that the Live experience was as exceptionally slick. Apart from the bothersome need to accept the EA Terms and Conditions every time you log in, a myriad of options let you set up all manner of ranked or unranked matches against whichever skill level you fancy. Unlike last time out, if a player quits out before the match is completed, it no longer results in a 3-0 result. Strangely, you now have to carry on playing the match against the CPU, with the match result counting against you if you quit out yourself. However, if the two parties agree, DNF matches can be stuck off the record, so it's not the end of the world. With the ability to set up a variety of quick tournaments as well as normal, variable length Vs matches, it really is leading the way in this respect. Konami definitely needs to pay attention here and start offering the same degree of service in the online portion of PES 5.As much as we gleaned a lot of enjoyment out of FIFA 06, and would heartily recommend it as a companion to PES, this year's version offers precious little advance on last year's - save for some relatively minor additions that do little to address our ongoing concerns. Quite honestly, if you already own last year's edition, there's little incentive to shell out all over again for the ability to issue tactical commands - although being able to use PES' button mapping is a godsend: at last! Needless to say, FIFA is still uniquely entertaining by virtue of its fantastic licensing and very solid gameplay. But - and we say this every year - no amount of official team and player rosters can disguise that underneath there's a game that's desperately trying to be as good as its elusive competitor, but failing. In a way, we'd rather EA went down a completely different road and made FIFA the pick-up-and-play arcade action alternative than the PES-inspired facsimile that it has morphed into. As it stands, FIFA once again offers a huge amount of entertainment - but you'll be left covering your face after you've witnessed EA miss a hatful of chances to go top of the table."}