{"ref": "https://www.eurogamer.net/r-dowwinterassault-pc", "date": "27 Sep 2005", "game_name": "Warhammer 40,000: Dawn of War - Winter Assault", "text": "How do you like your science fiction? I've always liked it to be completely over the top, and a little bit messy.  The ultra-brutalist battle-goths of Warhammer 40,000 amply satisfy such tastes, especially when they remember to fall on the right side of violent and nasty. Yet somehow the combative characters of Winter Assault are, for my tastes at least, slightly too cartoonish to sit correctly in relation to the nastiness threshold. Games Workshop seems to have a bit of a split personality in that regard: sometimes the Warhammer universe is profoundly grim, and other times those death monks really don't seem so bad. Hey, maybe they're even a bit funny. Ah well, we can't have it all, and in most other respects Dawn of War (as well as Winter Assault) manages to be both nightmarishly vicious and sense-bludgeoning good fun. Warhammer's far-future universe is one of pure war, and the countless billions of folk who have nothing better to do are worshiping evil, piloting death-machines or getting high on psychic energies. In a universe without shopping, there is Only War.As RTS games go Winter Assault and its parent game are more concerned with being spectacular than they are about being sophisticated, but we appreciate how that works - some games are more about the light and noise than about the cerebral juices. And in Warhammer 40k, above all sci-fi worlds, there is a blinding light, and a drunken orchestra of noise. Hyper-baroque pseudo-religion and cog 'n' piston mecha-war meld into a startling caricature of a future where genocide is exquisitely animated. When you get past the lavish design and density of gadgets, Dawn of War and Winter Assault are both fairly shallow, but perfectly balanced and utterly compelling.Of course some folk would disagree. But they'd not be able to disagree that Dawn of War is just made for expansion packs. The toy kits from Games Workshop already come in half a dozen flavours of ready-made space-army, and the most obvious of those for the videogame variant to provide are the Imperial Guard, the everyday squaddies of 38,000 years in the future. The Guard have many toys, including giant ogre men, brave sergeants, brutal discipline and clunking attack walkers. So, attack walkers aside, the Imperial Guard are rather like the soldiers of today: squishy, easily killed, and reliant on officers and tanks for protection. While the milling guardsmen might be thrown by a few pieces of enemy armour, they're usually able to rely on some large pieces of machinery of their own to deliver the killing blow. Happily there are some excellent leaders and war machines on hand, including the ultimate Baneblade, a supertank that dwarfs all other battlefield ordnance with its titanium enormity. Simply, the Imperial Guard provide a lot more things to play with, and being a little closer to our 21st Century home, they're generally even more amusing than the faceless war-drones of the Space Marines or the wimpy Eldar. They're exactly right for Dawn of War's overall tone, which is about the massed scrapping of multiple units, all making with the future fireworks until you can barely make out what is going on. With new tanks, stompy walkers, plenty of laser weaponry and freakish tele-war psykers, the Imperial Guard are as entertaining to watch in action as they are easy to send to their tiny deaths.Winter Assault itself isn't about to live or die on the basis of its tactical depth, but that doesn't stop there being quite a few new elements to play with, including something that ties into the back-story: the tunnels. Being an old Imperial world, the Guard are supposedly reclaiming old infrastructure. This being so, it makes sense that bunker points, such as those that can be built on the strategic resource nodes which must be captured across the map, are all 'linked' via tunnels. This means you can rapidly move units across the map without them being harmed, or simply install them in bunkers, ready to be deployed. This capacity to reinforce different areas of the map quite quickly, or simply to get a techpriest to fix up units and build structures, gives both single and multiplayer games a tactical nuance that advantages the Imperial Guard. The Guardsmen also suffer from slightly wobbly morale, and may retreat if the odds are too great. The commissar, Soviet style morale-enforcement officer, can be deployed to shoot retreating troops and encourage them to 'bravery'.Ah yes, it's no fun to be foot soldier. But as commander you're in tricky waters too. The objectives of the Imperial Guard aren't always possible for them to overcome, so as God-Colonel-In-The-Sky you take up the mantle of the Eldar for numerous short campaign missions. The star-ponces interweave pleasingly with the plot at vital junctures, and the Imperial commander voices his worry about their meddling in a series of slightly embarrassing in-game cut-scenes. The Eldar play quite differently, as DoW veterans will know, and act as a fast, efficient and ethereal strike unit. The maps are littered with cloaked warp gates, allowing them to nip from one place to another almost instantaneously. All, it seems, is good. The objectives pile up relentlessly, but in all honesty you seldom feel in danger of failing.While there's just the one new army, there are two new campaigns. You also get to fight the war for the side of evil too, with lots of familiar ork and chaos units arriving from the original game, plus a stack of new ones to keep you amused. There's a fair amount of replayability in there too, but it's really just a linear sequence of explosions (of the very best kind) and it doesn't last all that long.Of course it's the multiplayer mode that lies at the heart of Dawn Of War's appeal, and I fully expected to go online with an Imperial Guard army and get totally twatted by whomever I played. And, having navigated the astonishing array of idiots in the seemingly unmoderated chatrooms, I did. Not because the Imperial Guard aren't a solid and useful addition to the army line-up, but just because I'm rubbish at RTS multiplayer. No, I didn't win any games at all. I'll have to play Kieron or something, just to give my ego a break.Or perhaps I'll just plunge into the ample skirmish mode and lay down fiery vengeance on heretic and mutants. The choices are almost too many."}