{"ref": "https://www.eurogamer.net/r-worldatwar-pc", "date": "22 Sep 2005", "game_name": "Gary Grigbsy's World At War", "text": "Three phrases guaranteed to chill the marrow of the journeyman games reviewer: 'It's a lot like Falcon 4.0 apparently', 'It's Derek Smart's latest space simulation' and 'Gary Grigsby had a hand in this'. GG's past output - hardcore wargames like War In Russia and Uncommon Valour - are some of the most complicated, labour-intensive PC strategy games ever inflicted on the gaming public. With that in mind, World at War is rather a pleasant surprise.Rather than overwhelming aspiring Churchills and Stalins with mountains of unit counters, screens of stats and reams of obscure rules, this grand-strategic recreation of WW2 takes a relatively friendly approach. For game purposes the globe is portioned into a patchwork of 364 regions and time is bundled into manageable three-month turns. Units representing armies, fleets or air-groups are constructed and supplied by factories that rely on a single generic resource (found in specific regions) to function. Simple sensible concepts elegantly implemented; so far so good.The risk with abstraction like this is that you take the simplification a step too far and wind-up with a play experience that's colourless, unsubtle and short of historical resonance. In at least a couple of areas GG and 2 by 3 Games tumble into this trap. By failing to model diplomacy in even its most rudimentary form, the developers rule-out many fascinating WW2 'what-ifs'. By representing research and development in a chronically unimaginative way (produce research points then spend them boosting the attributes of generic infantry units, tanks etcetera) they strip much of the pleasure and colour from technological progress.But these are two fairly peripheral areas. In more crucial respects WaW is eminently likeable. The simplistic single-resource economics and the equally straightforward logistics do a fine job of reproducing the real problems faced by the warlords of the '40s. Allow your industrial heartland to be pummelled into rubble by an opponent's bombers and your war machine will grind to a halt in no time at all. Do nothing as your rail and road network is ravaged and your supply stockpiles dwindle and quickly your lightning blitzkrieg in the East will become a dawdling armoured traffic-jam. For the most part, WaW punishes historical mistakes and rewards plausible plans - sure signs of a good wargame.One of the reasons the scenarios tend to play-out in a more historical manner than those in adjustable real-time rival Hearts of Iron II is that there are no 'Brazil conquers Africa' or 'Sudan marches on Berlin'-type turns of event in the game. In HoI2 you are free to lead any tin-pot nation you like and make friends and enemies with pretty much whoever you please; not so here. Annoyingly for Eurogamers the only playable states in WaW are the Western Allies (an amalgamation of US, UK and the Commonwealth) Germany, Russia, Japan and China. Those that want to tough-it-out as Finland or Poland, or plough their own furrow as Italy, Britain, or Spain should stick with HoI2. Another way the developers ensure believability is by heavily (possibly too heavily for some) scripting the scenarios. The combination of unavoidable developments like a Japanese attack on the US and German-Soviet hostilities, and AI nations that 'sleep' until specific set-in-stone conditions are met, mean you do sometimes feel like you're scribbling in the margins of history rather than completely re-writing it.With absent diplomacy, streamlined economics, and primitive R&D it's vital that combat has a bit of texture to it. WaW doesn't disappoint in this respect. Superficially simple (just move your forces into an enemy-occupied region and await results) battles actually take into consideration a surprisingly extensive range of factors including unit armour and weapon range, terrain, weather, surprise and state of supply. Lady Luck's input into these equations is very well-judged, ensuring just enough underdog victories to keep clashes interesting but not so many that you're crossing your fingers before every fight.In a brave/foolish attempt to add some visual pizzazz to the engrossing map-based manoeuvring, scraps are illustrated with a 2D animation showing stationary, inconsistently scaled units trading fire on boring bare battlefields. After sitting through a few of these dull displays you'll probably be reaching for the 'skip animations' option and wondering whether the 2 by 3 artists wouldn't have been more profitably employed creating unit icons that altered to reflect technological upgrades and the march of time. It's a small detail but blitzing into France in 1940 with your panzer divisions represented by tiny Tiger Tanks, and defending Blighty during the Battle of Britain with miniature USAF Thunderbolts doesn't aid immersion any.Another criticism that can be levelled at the, by genre standards, rather fetching visuals is that they aren't nearly as informative as they could be. Despite the elegance of much of the core game mechanics, important data that could - that should - have been displayed on the main map is in fact scattered across separate stat screens or viewable only with the toggling of map modes. Why can't the player see at a glance which territories boast factories and garrisons for instance? Why isn't your supplies total and score visible at all times and why can't you queue unit production via the map?Complaints like these aren't deal-breakers. The faults that might have torpedoed this heavily-laden Liberty Ship - woeful AI, numerous bugs, poor accessibility and impractical scope - are, happily, conspicuous by their absence. CPU-controlled opponents won't astound you but they put up a reasonably convincing fight with the help of those scripted events mentioned earlier. Bug and accessibility-wise there are unusually few reasons to rant. Practicality? Here WaW certainly has the edge over its Swedish peer. With an attractive PBEM option and game durations that can be measured in hours rather than days, this is definitely the grand-strategy title for those of us lumbered with obligations like jobs and school."}