{"ref": "https://www.eurogamer.net/r-thug2remix-psp", "date": "14 Sep 2005", "game_name": "Tony Hawk's Underground 2 Remix", "text": "Neversoft's Jackass-ification of the Tony Hawk series has been almost apologetic. Real skaters were never a problem - mild-mannered Tony Hawk always struck me as a nice chap anyway - but THUG 2 kicks off as professional-crazy Bam Margera abducts pro-skaters and shanghais them into touring the globe performing skating stunts and doing ~wacky~ things, like throwing tomatoes at a bull's testicles. Why have you done that, Neversoft? ~Well, um, er, something about the zeitgeist, skate culture, mumble-mumble. But it's okay! Because the levels are excellent! And you can have the two-minute mode back!~ Oh, well, that's alright then.And, actually, it is. Providing you can put up with the obnoxious nonsense that constitutes the single-player ~Story~, you'll have lots of fun skateboarding in the THUG 2 Remix, which is ostensibly just high-ranking-wry-pranking THUG 2 with a few new levels.In other words, it's a game about skating along, jumping, kick-flipping, spinning and ~tricking~ as you leap into the air above the half-pipes, grinding along rails and steps - virtually any straight edge, in fact - and connecting it all together by tottering along balanced on the nose or tail of the 'board - something called ~manualing~, made all the more difficult by the need to centre an icon on a pendulous balance-meter against its will to slide off to one side.The controls are more complicated than ever - and more so on the PSP, where certain buttons have to perform a couple of functions to compensate for the loss of a second analogue stick and secondary shoulder buttons - so anybody who picks this up for the first time is going to find themselves in a bit of a pickle for the first few hours. But once you do get it (concentrate on grinding first; it's the most immediately gratifying thing you can do), it's easy to become thoroughly absorbed picking off objectives.Story mode lets you roam free around the game's levels - well-known cities caricatured to host networks of grind-able edges, half- and quarter-pipes and the like - completing tasks for individual people you talk to, while Classic gives you two minutes to tackle various arcade-esque tasks, like collecting the five disparate letters of the word ~SKATE~ or setting high scores in various ways. (In other words, the way the old games used to work before it got all hi-larious on us.) There are some tasks which are just pointless (why throw tomatoes at the bull? Why is this fun?) but others, like collecting the letters C, O, M, B and O in one long stream of points-accumulation (there's probably a term for it), are inspired.As are many of the levels - with 438 Tony Hawk games under its belt now, Neversoft knows how to make levels, and these ones are full of intricate networks of insanely over-the-top grinding rails and trick locations - and the developer porting the game to PSP, Shaba Games, has done a good job making sure everything works on Sony's shiny new game-slab. Draw distance is fine, frame rate is excellent, and barring a few textural excisions and control complexities it all looks and feels exactly as a Tony Hawk game should do on any format. It even has Ad Hoc multiplayer modes for fans of the wireless bit - and Tony Hawk's is probably a game that the ~kids~, wherever they are, will be keen to play with you. It's so damn COOL, after all.You won't really need opponents most of the time though, because there's just so damn much to do. Just riding around and exploring is entertaining enough - Hawk's is one of those ~extreme sports~ games that boasts hidden depths in control and content. But even the content that's out in the open will keep you going longer than most - there are four new levels (Las Vegas, Santa Cruz, Kyoto, Atlanta), but there were loads already, and each is stuffed full of things to do when you consider both the Story and Classic modes. Plus, you've got Create-A-This, That And The Other. There's no facility for level design, but you can customise goals and tricks in addition to the usual ~Make your own skater~ stuff. Compared to many of its fellow PSP launch titles, it's got to be extremely good value for money. Got to be.Well, yes and no. On the one hand, it's a fantastic example of how much content can be crammed onto the PSP, and taken in absolute isolation it's a worthy purchase - frustrating to begin with, but perfectly accessible within a few hours and far more enduring than much of its Ex-S competition. But anybody looking to get into Tony Hawk for the first time is surely going to be better served by one of the budget-price console versions, which are easier to pick up in every sense. Aside from the doubled-up controls, another problem on the PSP is the small screen - with so much going on, it takes the eyes of an experienced Hawk to pick out the relevant items at speed - so you could argue that it's more relevant to those who know what they're doing already. Er, except anybody who already owns THUG 2 is just getting the chance to play it on the go. Four new levels and a few tweaks aren't really worth £35.It's pretty easy to understand why Activision chose to port THUG 2 instead of commissioning a whole new game, but the result is something that you've either played or passed up already. In the unlikely event that you're a newcomer, this is as good an example of the series (or indeed the genre) as any other, and not only well stocked but also the only thing like it on the PSP at the moment. A good game then, and worthy of a high score - but I still wouldn't buy it. And now I sound apologetic about it too. Cos, um, er, something about the demographics, multiple perspectives, mumble-mumble. But it's okay! Because you know what you like! And you can always just wait for Tony Hawk's American Wasteland, which is out in October.Oh, well, that's alright then."}