{"ref": "https://www.eurogamer.net/fifa-18-review", "date": "25 Sep 2017", "game_name": "FIFA 18", "text": "You know how Spurs never made a superstar signing in the summer but are still really good and should really end up in the top four of the Premier League? Well, FIFA is Spurs this year.Stick with me here. I'll explain.FIFA 18 is really good, but there's no headline-grabbing game-changer, no jaw-dropping new way to play, no superstar signing to get the heart racing. It's jam-packed with welcome gameplay improvements and clever new modes, but FIFA 18 is no revolution. FIFA 18 is better than FIFA 17, for sure. In fact, it's the best FIFA in years. But it's an unspectacular upgrade.For many fans, this will be fine. For so many - myself included - gameplay is king, and after FIFA 17's well-documented problems, it's fantastic to find EA Sports has spent most of its time sorting out the on-pitch action.Perhaps the most noticeable improvement is to responsiveness. Now, I'm not saying FIFA 18 all of a sudden reacts to your inputs with the speed of a fighting game. You still have that sometimes frustrating buffer between when you press a button and when the player on your telly actually does what you want. But you can certainly zip the ball around the pitch faster, more accurately and with more variety. It's a more fluid game bolstered by a raft of new animations.A lot of this more fluid feel has to do with the increased effectiveness of one-touch passing and the driven pass (right bumper and the pass button). This pass is a kind of Steven Gerrard ping, a fast and low bullet that shoots straight for its target. It's great for getting the ball where you need it to be right now, and it looks great on screen, but it sometimes feels a little silly because players - even mediocre ones - more often than not perfectly control this driven pass. When you blast a driven pass to your teammate who's only 10 or so yards from you, you expect it to bounce off him (and to get an angry look), but he'll probably control it.The pinged lob pass (left bumper and lofted pass) is another super effective new pass that helps create goalscoring opportunities. This higher, more looping lofted pass is great for hitting a ball up to a striker, drawing a defender in for an aerial challenge and thus creating space behind for a runner to potentially get into the box.EA Sports has done well to better balance the attributes of players for FIFA 18. It feels like rather than nerf pace and strength, the developers have made other attributes more effective. Quick and accurate passing is the name of the game, and crossing is most definitely back in business. Speaking of crossing, EA's changed the way it works to give you more immediately accessible options. Holding the left bumper and pressing cross does a lofted cross, which is good if you're aiming for a big striker. Hold the right bumper and press cross to trigger a rapid cross, which is great for Gary Lineker slide ins. And the normal cross has just a bit more swaz on it.Through balls have been given a boost, too. My favourite is the threaded through ball (right bumper and through ball), which is great for passing a ball into the channel for an inside forward or even a central striker to chase.FIFA 18 is at its best when you up the passing tempo and start to think a pass ahead. You end up pinging the ball about like you're playing a pinball machine. In previous versions, pace and strength were overpowered and so Real Madrid, Ronaldo and Gareth Bale in tow, would be the go-to team. A counter-attacking style, fuelled by the frustratingly effective AI defending, ended up being the defacto way to play. It was pretty one-note.FIFA 18's passing feels more effective and thus more satisfying. And by using consistent, two-button input commands for all the main passing options (normal pass, lofted ball and through ball), even casual enthusiasts will feel like they can tap into advanced play.Clearly in response to negative feedback on defending in FIFA 17, EA has tweaked the AI for FIFA 18 so it's not quite so soul-destroying to go up against computer-controlled defenders. You can no longer leave the computer to do the defending for you and get away with it. Manually taking charge is the most effective way to defend, as it should be.The better passing and crossing combine to make FIFA 18 a pretty high-scoring game. It feels easier to score with long shots and crosses into the box than FIFA 17 did. And I certainly carve out more chances now EA Sports has had a word with the AI defending. Some will sneer at this goalfest, but ultimately FIFA 18 is a more fun game for it. And in any case, given the awful state of defending in the Premier League right now, it's a pretty accurate reflection of real football.Despite the refinement work done for FIFA 18, long-standing FIFA problems remain. You still get that annoying defender pause every now and then when a ball is played over the top. You still sometimes lose the ball because your player runs into the path of an opposing player despite your desperate attempt to reverse course. And FIFA still struggles to switch control to the player you want it to, even when it seems the most obvious player for you to want to control next.Away from gameplay but still on the pitch, EA has made FIFA look more interesting by adding loads of paraphernalia to certain stadia. I maintain that FIFA looks better when played during the day, as opposed to nighttime games. The crowds are more varied, there are flags everywhere, and the Frostbite engine's impressive lighting shines through. FIFA really is a fantastic-looking game. One match I played at Newcastle's famous stadium St. James' Park during the day looked photorealistic.Off the pitch, EA's made sensible improvements and introduced one or two smart new modes. FIFA Ultimate Team has always been a hugely popular online multiplayer-focused game mode, but now there's a fair bit to do as a solo player. The new Squad Battles mode lets you play against other squads from the FUT community. There are even Featured Squad Battles, which are against squads of football players, pro FIFA players and FIFA streamers. Weekly and daily objectives keep you interested, and they often carry decent rewards. It's pretty cool.The Journey story mode, which I'm a big fan of, returns. I know most FIFA fans will skip the whole thing entirely, but I quite enjoyed seeing what happened next to young superstar Alex Hunter. In this second chapter, Hunter ends up leaving the Premier League (no spoiler here - EA's said as much pre-release). I won't reveal where he goes, but it's a surprising destination I didn't see coming and is a clear play for a certain market. One or two of the cutscenes are actually pretty well done, with decent voice acting, dialogue and impressive motion capture. The scene in which Hunter has it out with his slimy agent almost hits knife-edge. Naughty Dog's designers won't be quaking in their boots any time soon, but EA's done well once again with FIFA's story mode to avoid embarrassment. It's hefty, lasts a good long while and you can now play co-op. Oh, and you can now customise Hunter's haircut, which is nice.If there's one addition that sums up FIFA 18 this year, it's quick subs. This brilliant new mechanic lets you press one button to bring up a possible substitution, then press another to confirm. Then the substitution happens. There's no going into FIFA's laggy, time-consuming menus, and no need to stop play any longer than needed. Quick subs is as welcome an addition as quick throw-ins when they were introduced a few years ago.This is the thing about FIFA 18 - all the various tweaks and changes are successful and combine to make for a really fun gameplay experience. But fans won't sing songs about any one of them. Pundits won't wax lyrical about the new crosses. Social media won't blow up at the new crowds. And the back pages won't scream headlines about Hunter's new hairdo. Having pumped tens of hours into FIFA 18, I wonder how much ~innovation~, as EA Sports' producers would call it, is left for the designers to add outside of new game modes. I go back and forth on whether this is a troubling thought or not.If you're anything like me, though, you'll get a lot out of this hyper cleaned up version of FIFA 17. Like Spurs, FIFA 18 plays a fantastic game of football. But like Spurs, FIFA 18 probably won't win any trophies."}