{"ref": "https://www.eurogamer.net/r-virtuatennis-psp", "date": "2 Sep 2005", "game_name": "Virtua Tennis: World Tour", "text": "A tennis game might not sound like the most exciting game to rush out and buy for your shiny new Sony PSP, but when you're dealing with one of the most enduringly playable games of all time we're prepared to make allowances. You'd perhaps reason that we should have tired of the simple pick up and play gameplay after five long years slugging out the fuzzy yellow ball across Clay, Grass and Carpet. But like any true sporting classic, there's literally an infinite amount of fun to be had with Virtua Tennis. We'll still be playing it long after arthritis and senility have had their wicked way. It's simply too compulsive for words.The reason we're consistently compelled to gush about Hitmaker's classic time and again is quite simple: the game's purity of design, which makes it incredibly easy to pick up and play for a while, but also offers depths that keeps even the most hardened gaming veteran coming back for more.What's more, Virtua Tennis is one of a select few sport games that is almost as much fun in single-player mode as it is in the heart-stopping multiplayer mode. By virtue of an array of modes that ought to satisfy most of your whims, there's barely an excuse not to fire up the PSP and have a quick go. In the context of handheld gaming that's a truly priceless commodity, and one that you begin to appreciate more and more the longer you spend in the company of SEGA's little gem.Underpinning the whole experience is the way that the control system is directly allied to the graceful elegance of an animation system that still feels ahead of its time even now. Nailing it down is easy: you nearly always feel fully in control, and because of this the game never feels unfair. And because you always feel responsible for your successes and failures, it's one of the few games where you're happy to accept defeat with good grace. You'll always reflect that it was your tactics - your positioning and timing of strokes in particular - or the nuances of your player's abilities that won or lost you the match, not the game itself, and that's precisely the thing that makes it so damned addictive.Thankfully, UK conversion team Sumo Digital has remained utterly faithful to the inspired Virtua Tennis 2 (frustratingly something we can't play in renovated form on current home console formats; we particularly yearn for online play) - in gameplay terms at least. The only significant changes on offer come in the form of an updated roster of 14 pros, comprising the likes of World number one Roger Federer, Lleyton Hewitt, Andy Roddick, Tim Henman, Maria Sharapova, Lindsay Davenport and Venus Williams. But don't let the lack of changes put you off; in a fat-free game like this you'll be overjoyed at the ability to take it on the road with you.As ever, you're offered a full complement of single-player modes, including the instant action/random pairings of the Quick Match, the custom Exhibition mode, and the five-round Tournament challenge. Five skill levels ought to take into account everyone from the novice to those sporting thumb calluses and frazzled thousand-yard stares. If you're so inclined, matches can be further tinkered to increase the number of games in the match to six, including tense tiebreak scenarios. It's disappointing that there still isn't the option to go for matches lasting more than one set, but we can live with that. Next time though, eh SEGA?For a bit of light relief, a further four Ballgames are available in single-player mode, all of which operate on a high-score-chasing basis and provide mildly interesting diversions for a few goes. Blockbuster is, as the name suggests, a game all about busting blocks that form in a wall in front of you, and measuring your strokes to target certain blocks gives it decent legs; Fruit Dash involves legging it around the court picking up giant fruit while avoiding a red ball being fired in front of you; Blocker tasks you with protecting the blocks behind you from the ball firing machines; and Balloon Smash has you trying to burst balloons of matching colours before the timer runs out. All perfectly silly, but charming in their own sweet way; and much like any throwaway modes, you'll probably not get around to playing them much.On the other hand, the game's centrepiece World Tour career mode will force you to play all eight of its training games more times than you can possibly imagine. As ever, the basic idea is to get your rookie pro (male or female, or both if you're uber dedicated) right the way from 300th in the world right up to world number one. To do so involves entering (and winning) the various competitions that appear on the event calendar and improving your rank bit by bit.It's nowhere near as straightforward as you might imagine, though, with your chances of progressing fatally impaired by your initially useless skill stats. In order to stand any chance of progressing at all, the general idea is to work on your serve, footwork, stroke and volley skills via the eight mini-games. Much like the single-player ballgames, the training games are thoroughly silly, but delightfully addictive.You'll play games like Stomper (which have you running around trying to step on as many cans as possible before the time runs out) literally dozens if not hundreds of times on a seemingly unending quest to get those stats up little by little. Usefully, you always gain some points even if you fail to meet the challenge, meaning you'll repeat the tasks over and over in the hope that when you return to competitive duties that your silky skills will make all the difference.Although this endless repetition was always a bit of a drag in the home version, on the move it's a great way to kill the dead time of short train journeys. You won't even mind your mates being late, as you'll quietly reflect that it's okay; you've just got your serve up to level 12.Eventually, though, you'll definitely thirst for more competitive action and quit playing the ten-pin-bowling-inspired Pin Crasher for the 37th time in a row and get on with entering a tournament. As with the real deal, you won't just be playing in singles matches, so must hire a doubles partner on a short-term contract to see you through. Depending on how far you get, you end up with a cash prize that you can use to buy various upgrades and apparel at the shop.For some time though you'll probably have to endure being a bit rubbish, but in terms of offering a long-term challenge there are few sports games like it. Sure, some of the mini-games (such as Disc Shooter or Tank Attack) seem a little too challenging for their own good to begin with, but others (such as Bull's Eye or Alien Force) always feel like a pleasure. The game itself is pure joy - a joy to control, a joy to compete in - and it feels even more joyous when you've truly got the hang of it. Serving, for example, couldn't really be easier to get to grips with; simply position your player along the baseline, tap to start the rising power meter, and tap again to confirm the strength of your shot before it sinks back down again. With the option to direct your shot and go for a slice or straight serve, there are always plenty of tricks available to you without having to pull off button combos in order to do so.Returning a shot couldn't be much easier, either, which has as much to do with the way the game is masterfully animated as the delightfully responsive controls. In simple terms, if the ball is near you and you go for shot (topspin, slice or lob) your player will always try to reach it if he or she is anywhere near it. Positional sense is therefore crucial as the amount of power and angle will depend directly on where you are in relation to the ball, and as a result the game soon becomes as much about your ability to second guess where your opponent's return will end up as your timing and positional sense.It's this level of infinite possibilities which makes Virtua Tennis such a perpetually engrossing experience, and when you add a second opponent who knows the game as well as you do, it's as close to the real thing as there has ever been in sports game history. Whereas other sports games try their best to simulate what's going on and are hugely entertaining in their own right, Virtua Tennis is the sort of game that almost makes you feel like you're engaging in a proper slugging match and could take those tactics out onto the real court. Court by the fuzz, indeed.There really is only one thing stopping Virtua Tennis World Tour from becoming an essential purchase: not having a friend to play it with. With wireless multiplayer support, you'd be missing out on the best part of the experience if you didn't get a chance to engage in some two-, three- or four-player action. Scratch that, just buy it anyway and do your best persuasion job on your mates. Or just buy it for them.As a conversion, it's not one hundred per cent perfect though, but it's as near as dammit at this stage in the PSP's lifespan. The load times are perfectly acceptable (less than 30 seconds to load and start up a match), but we're slightly befuddled why Sumo couldn't eradicate those irritating little pauses when you win a point during a match, or try to scroll across the map screen in the World Tour mode. Other games (such as Everybody's Golf) don't suffer from these issues, so why does this? We were explicitly told that these issues would be fixed in time for release, but alas, they still exist. Not as bad as our pre-release build, but nevertheless still there.Elsewhere, though, it's a nigh-on perfect conversion. The visuals are up to the same exceptionally high standards as the original versions, and look glorious on the PSP's wonderful screen. Every time we take it on the tube, envious onlookers can't take their eyes off it. It's an attention-grabber for sure. Sonically it's almost irrelevant that the music's still as terrible as ever, but somehow it embeds itself into your skull and you end up liking it despite yourself. Addictive videogames have a knack of doing that.Minor quibbles aside, Virtua Tennis World Tour is close to a ten-out-of-ten game on the PSP, and in many respects it deserves top marks for being the best game on the system, and one of our most played games in 25 years of repetitive straining. The fact that it's essentially advanced Pong hardly matters when it's as endlessly entertaining as this. Just pick it up, play it and never, ever put it down."}