{"ref": "https://www.eurogamer.net/r-earth2160-pc", "date": "4 Aug 2005", "game_name": "Earth 2160", "text": "Have you seen the Fahrenheit demo yet? Christ on a bike! It looks brilliant. I mean, it's clearly not going to be perfect, but it's intelligent, insightful, funny, atmospheric and determinedly adult entertainment. Clearly, it could all fall apart in the final game, but that I've seen something which works and demonstrates it has a vision worth praying for makes me get out the dusty rosary beads and start Hail Marying.Have you seen Mount and Blade yet? Put together by a couple, it manages to be a Flight-Sim-head's approach to Dynasty Wars, joined at the hip to a medieval ~Pirates~. Freeform, action-based, simple-enough to get playing but with a literal world to explore, it's exactly what we'd hope from an indie game. What you lose in aesthetics, you gain in terms of quiet innovation and a direct appeal to a niche of gamers who get little love from the mega-corporations of this world.Have you seen Facade yet? I don't even know where to start. It's little more than the shape of an idea of a game, but to see someone attempt to do a mini-drama based around interaction enthrals. You stand. You talk. They respond, and occasionally even in a way which makes a vague amount of sense. It's not all there yet. Hell, it's not even nearly there yet, but that people are making brave and experimental games and lobbing them online can't help but excite me by the possibilities.Have you seen Earth 2160 yet? It's an RTS.There's a line which is bandied around when discussing the modern climate. ~This isn't the Future we were promised~. It's normally followed by complaining that we don't have personal jetpacks or Jetsons-esque silver-costumes yet, and centres on the feeling that somehow we're missing on a technological Utopia which was promised. We feel short-changed.Which is why something like Spore excites so much. When I first saw Wright running his celebrated GDC demo, I couldn't help but think that when I was a kid and first exposed to a videogame, it would be something like Spore that would be the official Best Game Ever in 2006. It's a weird, wired slice of the future. Just give it to us already.Conversely, Earth 2160 is small. It's an ox, looking at its feet and following a furrow, dragging a carriage full of features behind it. It's not our dreams made digital flesh.  In a year when a string of RTS sequels have generally failed, that it manages to achieve a level of entertainment is actually commendable. That it's left this reviewer so uninspired for words that he's spent the entire day watching the cursor blink back of him is testament to how uninspired a form of entertainment it is. Yes, it's fun, but I can't think of anything particularly insightful to say about it other than ~Solid, feature heavy RTS with a rubbishy story and fairly clunky mechanics~.And that's not what I'm getting paid for, y'know.For an RTS with a lack of that futuristic charm, it actually borrows heavily from the traditional ideas of the future. In fact, at best, it looks more like a retro Sci-fi paperback cover from the late '70s than a modern view of what the Future would look like. Technologically it's a marvel, and in terms of making your 3D card do clever things is probably the most attractive RTS this year. In terms of actual design it's underwhelming. Solid and Chunky, like Soviet-era car design, Earth 2160 certainly lacks glamour.The lack of inspiration continues to the four playable factions: the LC, the ED and the USC and the Aliens. Just listen to the names. They couldn't have created less evocative ones if they actively tried. And it's a real shame in this case, as each side does have a genuine personality. The ED are the men in bulky armour, and are probably the closest the game gets to delivering a traditional RTS army and are relatively easy to identify with.The LC are a novel female-only army; relatively lightly-armed; a mass of flight and jetpack-equipped troops with a reliance on electric weaponry and ultra-tech. The UCS are the mech-army, who are an interesting mix between gold-coloured terminators with a relative lack of mobility, and lots of teleporter technology. In fact they remind this particular writer of Warhammer 40K's Necrons, but since they were a clear attempt to graft the Terminator and Cthulhu mythos together, we'll forgive the similarity.All three are extremely distinct. For example, bases are constructed differently too. The ED have single structures which are expanded organically, with extra bits stuck onto the side like a Lego house designed by the richest kid in the world. The ED have three-tier towers, with different modules plugged directly in. The UCS have hexagonal structures, with modules added around the side of central structures, allowing you to specialise their output.The tech tree is another thing you'll have to master. They're each unique and each is huge. You probably won't realise at first, as you're able to call for research on the equipment ordering interface or vehicle customisation screens. However, eventually you'll find the button marked research, at which point an enormous grid will fill your screen and you'll quietly gibber at the implied breadth of options.You may have noticed the mention of vehicle customisation screens too. In a manner similar to that ageing classic Warzone 2100, you're able to take a basic chassis and add a variety of weapons, defence systems and engines to create a weapon customised for your use. Add indirect weapons to one of your faster craft, and have a speedily deployable support system, for example. More complex additions need more time or resources to construct, so it's a pay-off between having a ship that'll save the day or having a ship that you'll have in time to save the day.Then there are the heroes. These appear in the campaigns as a plot-related element, but they come into their own in the Skirmish game. (In fact, the game as a whole comes into its own in the Skirmish game. The four campaigns are badly written and conceived, and not really that entertaining. But that's enough about that, as I've been mean enough already.) Offered sporadically, you have to purchase their services before your opponent and then you have sole use of their special abilities for the duration of their contract. As well as improved combat abilities, they gift statistic bonuses on your side or can be ordered to manage your base construction.And then there's... well, that's enough to give you a taster. While some RTSs believe in choosing what to include to focus your attention on certain areas or make for logical tactical pay-offs, Earth 2160 believes in lobbing every possible thing the designers could conceive of into the mix. It's an inelegant approach, but certainly gives you a sense of value for money. The main cost is that in a Skirmish match you're left trying to decide which thing, of the eight or so things you could be doing at any given moment, you should be doing. It'll be interesting to see how this develops in the multiplayer world, certainly. You don't need to do everything to play successfully, but to play well (let alone the top level) I dare say you will.Actually, there's an exception to that. That is the fourth group, who lack virtually all the complexities of their sister-races; instead based around a cellular reproduction model. Starting with a basic type, you order it to eat and then split in two. These can then do the same, and via a process of mitosis you can build up a mass of troops. Alternatively, you can specialise them, growing them into other forms which are either evolutionary dead-ends (such as the gun-turret) or types that can in turn grow even into more heavy-duty foes. The balance between deciding whether to split to build numbers or to specialise to gain fighting ability makes them a real unique challenge. This is especially true with the second of the ~basic~ sorts, which form the Aliens support craft, which split at a painfully slow rate.  It's certainly the best idea in the entire game, which makes the fact that they're just called ~Aliens~ a bit saddening.But that's Earth 2160 all over. No matter how good it is - and in Skirmish mode, it really is pretty good - it's a bit saddening. The future never seemed so far away."}