{"ref": "https://www.eurogamer.net/steamworld-dig-2-review", "date": "20 Sep 2017", "game_name": "SteamWorld Dig 2", "text": "My absolute favourite thing about the first SteamWorld Dig - a game that, in the memory, seems pretty much bursting with favourite things - was a simple collectable. It was an in-game currency of some kind, although inevitably I can't remember what you could spend it on. What I can remember is what it felt like to collect it. You would free it from the rock it had been trapped within, where it took the form of a metallic blue sphere. The act of freeing it, though, would cause it to erupt, and so a series of tiny ball bearings would burst out at you and fly around the immediate landscape. Brilliantly, these ball bearings had a bit of physics to them: they would knock and bounce and generally rattle through the air all about you. You wanted to grab them, but you also had to dash to collect them, and in dashing, brilliantly awful things might happen to you.That particular collectable doesn't make it through to the sequel, which is odd, I suppose, because SteamWorld Dig 2 is as loyal a sequel as you could imagine. But its absence doesn't really matter. I didn't really miss it. And that's because SteamWorld Dig 2 is as loyal a sequel as you could imagine. It's loyal to the spirit of the original game rather than the detailing - although it's quite often loyal to both. So it's loyal to the spirit of that beloved collectable: it knows that physics is fun, and that physics gets more fun when different elements, each with their own predictable physical consequences, come together and start to set each other off.The first SteamWorld Dig game ends on a bit of a cliffhanger. Rusty, the plucky robot miner you send clanking through a series of scrappy adventures, has defeated an awful boss, but has been caught in the ensuing cave-in. That means that this time out you play as his friend Dorothy, who has set off to find him. Despite the change in lead, Dorothy's adventure feels wonderfully familiar. There are 2D mines filled with soft earth for you to dig through  as you progress down and down in search of your missing buddy. There are enemies and jewels buried about you, the first to avoid or despatch with a swing of the axe, the second to take back to town - a bigger, busier town than first time around, of course - and sell to buy upgrades. These upgrades are a mixture of the old and the new. Rusty's steam-punch returns, for example, and you're still juggling three resources in the form of health, lamplight and water, which powers any steam abilities. But pretty soon you have additional toys to tinker with. There's a sort of bomb-arrow that can be flung at distant enemies, or used to open up seams that runthrough a series of connected rocks, causing potentially useful cave-ins. There's a hookshot, which works pretty much the way Link's does, allowing you to zip towards distant walls, cling to ceilings and bat foes away. There's a rudimentary sort of flight mode which arrives towards the middle of the game, and which can be weaponised so that you can damage baddies and eat through loose dirt as you move around in bursts of recharging energy. There's a flaming pick-axe, which comes in useful in a way that is a little too good to spoil.Alongside new gadgets and an upgrade shop filled with bigger water tanks, better armour, and a roomier rucksack for any gems you find, there's a new cog system that basically works like sockets and gems in an RPG. All of Dot's tools can be tweaked in various ways by the addition of cogs that you find down in the mines if you really dig around for them. The backpack might allow you to stack gems, for example, while armour might make you immune to acid or lava. Cogs can be swapped around, so you can re-spec yourself for the challenge that lies immediately ahead. You have to return to town to do this, but you'll be constantly returning to town anyway, to top up health and cash in loot. SteamWorld Dig 2 is lavishly generous with the vacuum tubes that power fast travel, and a lot of the fun is nipping back and forth between a range of different underground environments - jungles, temples, something darker and stranger - to see what your latest purchase will do to open up new paths in old areas.It was around this point in the first SteamWorld Dig game that I realised I was basically playing a stripped-back Metroidvania, a genre where it seems much, much easier to make a mechanically competent game than one that's genuinely inspired. Metroidvania are door games: everything's a lock or a key. The best games make the keys interesting, or at least fun to use, and perform a neat dance act with the formula where you get to feel the chugging of its comforting rhythms without seeing the dull clockwork itself.That's always been my theory about Metroidvania anyway, but SteamWorld Dig games are different. The keys and the locks are fun, and sometimes wonderfully imaginative, but it's the digging here, an entirely unusual element, that really marks things out.Digging through the dirt means that these are linear games where you can forge your own path a little. You're headed downwards, but you're in a fairly wide channel, which means you can create your own shortcuts, and dig in seemingly unpromising areas for the chance to find something unexpected. SteamWorld Dig 2 fairly pours on the secrets and the optional caves ripe for exploring. Some of its best puzzles lurk far from the main path, and there are even a range of artefacts to find and return to town in exchange for exotic gadget blueprints. It's lovely that this stuff is there, but to be honest it's secondary to the simple pleasure of progressing through a game with an axe, carving a channel that goes where the designer wants it to go, but in a way that suits your whims.Speaking of whims, the physics that made those collectable balls so much fun to chase after is still working its tricks. Enemies tend to come with one big physical attack: they rush you, or fire off spikes, or release poison that steadily eats through the earth around them. This means that if you wander into an area that's full of enemies, you can often get them to kill each other, or knock out huge patches of earth for you, or do both and cause mad, impromptu chain reactions. There is a wonderful rigorous logic to the physical world around Dorothy, and it chimes well with the additional athleticism granted to her by bursts of flight, and by that hookshot that allows her to dash and leap and hang like an urban sports enthusiast.And at times, SteamWorld Dig 2 really surprises. It does so in one stand-out section that brings stealth and a touch of horror to this otherwise straight-ahead adventure - stealth and horror unlike any imaginings of them you've seen before, of course - and in an ending that ties various things together in a truly ingenious way. And when it comes to that ending, I'll admit that I played through the final boss and then headed straight back in. Why not? I'd seen the story play out, but I'd only scraped over the surface of all the secrets buried down there in the dark."}