{"ref": "https://www.eurogamer.net/ss-conkerlive-x", "date": "27 Jul 2005", "game_name": "Conker: Live and Reloaded", "text": "One of the great mysteries of our time is why on Earth Microsoft gave the green light to a remake of an N64 game that Nintendo saw fit to wash its hands of four years ago. Although Conker's Bad Fur Day was well-received at the time, its demented price tag or £60 or more meant precious few people ever got to play it. Just 25,000 hardy souls took the plunge in the UK. But, if you ask us, the fact that it got talked about at all had more to do with the game's profanity-laden novelty value and Rare's then-lofty status than anything to do with the game's genuine quality.Frankly, if you'd just written the cheque for $375 million to buy Rare on that heady day in the summer of 2002, you'd have expected - nay, demanded - that three years later Microsoft would be striding confidently down the gold-paved streets of Hitsville. The reality, of course, is somewhat more demoralising than that. Not content with failing so spectacularly with Grabbed By The Ghoulies, we're now forced to squelch through the mire of this distinctly average platformer all over again but Now With Added Live Content. These are real tears we're crying here.For the benefit of the majority of readers who won't have picked up the original from 2001, the main meat of the game concerns a drunken squirrel by the name of Conker. Having been on the lash down the local watering hole, he finds himself somewhat sidetracked on his way back home to his keep-fit fanatic girlfriend Berry. A whiff away from violently chundering, you take 'control' of the inebriated hairball for a series of badly-signposted tasks. Hereafter it's apparent that the 'story' makes as little sense as possible. It's there to shoehorn our furry fiend (that's ~fiend~) into a series of increasingly surreal set-pieces, and to ensure you cross paths with possibly the biggest bunch of oddballs ever to grace a videogame.Faced with becoming the replacement table leg for overlord Panther King, Conker finds himself performing a series of small (and often menial) tasks for this crazy populace. To kick off you'll find yourself foraging around looking for the missing hive of a neurotic bee, and before long you'll be trudging around doing a bunch of fetch-and-carry tasks, like grabbing cheese for a demanding mouse, or pollinating a demanding flower. It's that sort of game.But right from the start it's unclear what the task in hand actually is, and over the course of the 10-hour game you'll waste a significant amount of time trudging around wondering what to do next. With so many examples to choose from, it's blindingly obvious that the game itself is flawed on a fundamental level, and when you consistently reach these seemingly dead ends the game soon loses any appeal it was starting to gain.Only by dogged persistence and the knowledge that The Solution Must Be Here Somewhere do you seem to inch your way through what must be one of the most horrifically and consistently oblique experiences we've had in videogaming for years. The head-slapping truth is that none of the puzzles are exactly hard (some of them are downright obvious once you know what to do), but unlike other games, where figuring them out is part of the fun, here you're just left cursing the designers for being so sodding unhelpful even when you've succeeded. On top of that, the core of the game is saddled with a plethora of rank, outdated mechanics that should have been kicked into touch by now. Chief of these is the appallingly one-dimensional combat system that dictates that Conker can only swing his baseball bat while he's walking and not, say, while jumping. Not only does this make the combat a sludgy, frustrating experience, but soon leads to the realisation that the only way to dispatch most enemies is the ~hit, back-off, hit, back-off~ technique. With an almost complete absence of AI, you're left wading through a world full of idiotic automatons and checking your calendar to find out if the year really is 2005. If that doesn't sound bad enough already, then the pile of misery grows apace once you factor in the terrifyingly appalling jump mechanic and its chief accomplice the useless camera. Okay, so it's not that bad, and you can live with it in a kind of Super Mario 64 kind of way, but - again - the game's consistent inability to make you feel like you're in control of your viewpoint or where you can jump is staggering for a game in this era. Time after time you'll attempt seemingly routine leaps, double jumps and tail spins and slither off the edge of a precipice, only to suffer a health penalty for the most pathetically small tumbles. It is a quite tedious experience.And this unending tedium is given an extra injection of Valium in the form of the game's ham-fisted attempts at humour. Quite how Conker's Bad Fur Day ever got the reputation for somehow being hilarious is quite beyond us. It's like videogaming's worst example of a giant in-joke gone wrong. It's as if a particularly self-indulgent team at Rare were let off the leash and allowed to write and voice the whole thing by themselves without any actual bona-fide comedy input. At best the story mode of the game is tittersome, with some patently ludicrous and surreal scenarios thrown at you from the word go, but stand it next to, say, Psychonauts or Ratchet & Clank and it's a total embarrassment. At no stage does Conker Live & Reloaded even attempt to be sophisticated, and for that we could forgive it. For gawd's sake, any game where you're rolling giant lumps of poo around can't be taken at all seriously, right? But time and again, the game's voiceovers are borderline pathetic, with characters slipping in and out of various attempts at regional accents almost in the same sentence. Add to that the hopelessly outmoded, embarrassingly not-shocking-at-all gratuitous use of expletives at all times and you'll just shake your head at the injustice that several people earned vast amounts of money making this pile of absolute rubbish. How this game has been picking up some seriously good scores we will never know, and it calls into question the credibility of everyone that can claim with a straight face that this is somehow the pinnacle of Xbox entertainment right now.Well, to answer that question ourselves, it seems some reviews elsewhere have been prepared to accept that the single-player game is rubbish and still give it 9/10 on the basis that the Xbox Live multiplayer shenanigans are the game's saving grace. That's a ludicrous argument given that over 90 per cent of Xbox owners aren't even hooked up to Live (even more so in Europe, the latest figures suggest, where it's thought that only just over 200,000 have subscribed) and so cannot even take advantage of this mode. But, for the sake of discussion, let's assume everyone who buys the game is connected.For a start, the multiplayer portion of the game is literally nothing like the story mode. To all intents and purposes it's a completely separate game simply bundled alongside the main dish. It doesn't even use the same maps or environments. The weapons and character classes are all brand new, and even the game engine appears to be very different from the story mode. The only real connection is that it stars Conker and 'friends' against the evil Nazi-style Tediz that make an appearance briefly towards the end of the single-player campaign.But despite all the time Rare took to bolt on an all-singing all-dancing action-packed 16-player mode, the result is a tad underwhelming following on from the hysterical launch reviews that talked about it as an event to rival the second coming of Christ himself. Slight exaggeration there, but - as if you couldn't predict this - it's a good old-fashioned run of deathmatch (in team or standard form), Capture The Flag and Assault-style matches across nine tailor-made maps.As ever, you simply choose which side you want to play on and then choose a weapons class to specialise in. In this case, you can choose from the all-rounder Grunt, the Sabre-wielding and cloaked Sneeker, the Bazooka-equipped slow-coach Demolisher, the snipe-tastic Long Ranger, the pilot specialist Sky Jockey, and the flame-throwing Thermophile. Each comes with their own specific pros and cons - fast but not that powerful, slow and deadly, etc - and most come with an upgrade weapon and various default abilities, such as Self Heal, Berserk or Infra-Red vision.In this sense at least Rare deserves credit for attempting to balance the proceedings with a decent array of contrasting characters, which allow players to get involved with the kind of multiplayer experience they want (and that also applies to offline gamers, with split-screen, LAN and full-sized bot matches supported). That's the theory, anyway - a large amount of the enjoyment of any multiplayer game depends on the quality of your team mates and opponents, and with the right players alongside you there's a good deal of potential here.Finding those players, however, is another matter altogether. During our protracted Live experiences over the past month we rarely found more than about a dozen matches happening across the entire world, and even then getting a match started was a hopelessly drawn out experience with few players seemingly willing to even confirm their participation on numerous occasions. And those that were going on appeared to be largely private matches that refused connection, or specific matches that might not necessarily appeal. For example, the ability to tailor matches just so is great in theory, but you might not really fancy a match that only allows you to play a Long Ranger.Like we said, Conker's Live experience has a decent amount to offer, but only if you can somehow round up a skilled posse to make the most of it. Getting skilled, though, isn't something that will come very easily to many people, no matter how long they've been playing online multiplayer games. Each class and mode takes a lot longer than usual to get to grips with than you might initially anticipate, with each character's alternate weapons to get used to, not to mention the five different vehicle types on offer (Toad Mk II Jeep, R-Hog Quad, Tankus, er, Tank, Steed chopper and Mule troop carrier/Gunship - the latter two of which are exclusive to the Sky Jockey). The vehicles, in particular, take a while to get used to, with slightly counter-intuitive controls hampering proceedings initially. But give it time and the rewards are there, and mastering the vehicle side of the game is possibly the most satisfying aspect of the multiplayer game.In terms of the mechanics, though, the feeling of déjà vu creeps in quickly, with the usual flag-capturing or checkpoint-securing shenanigans alongside the regular need to kill anything not on your side. Sadly, even though the maps are tailor-made, they're nothing you haven't seen a dozen times before, and, after a few hours, that sense of underwhelming familiarity creeps in. You'll also start to spot the cracks in the balancing, with certain classes way too powerful (step forward the Demolishers) and most of the remaining classes suffering from a frustrating inability to score a direct hit on enemies (or at least that's how it feels, with twitchy controls and wavering reticules), or in the case of the Grunts or Long Rangers are just too feeble and too inaccurate with their default weaponry to be useful. Frustration reigns.Realistically, even with the presence of the offline modes this is a game you're going to want to play online with 16 players populating the maps, and players with a decent amount of experience - and that's a big ask for a game that's not proving too popular right now (hardly a surprise given the release of the Halo 2 map pack).So what are we left with? A stunningly below-par platform game with borked controls, oblique objectives, crass humour, and a slightly above average online multiplayer component that's not proving too popular. That's not the most glowing recommendation in the world is it?About the best thing you could say about Conker Live & Reloaded is the astonishingly lifelike graphical detail on Conker himself (the fur! Look at the fur!), but even then he looks completely at odds with the somewhat less impressive gameworld that he swears his way around. As a whole package it's something Microsoft should have put out at a budget price from the beginning, because the single-player story mode is without question one of the worst platform games we've had the misfortune of playing in years, while the multiplayer is merely adequate next to the best in online console gaming. Our heartfelt apologies go out to those of you who've bought it already (we're sorry this review is late - blame holidays, blame Killer 7), but for those of you who were wavering on whether to get it cheap in the sales, don't."}