{"ref": "https://www.eurogamer.net/project-cars-2-review", "date": "19 Sep 2017", "game_name": "Project CARS 2", "text": "You can keep your F1, your Indy Cars or your WEC. You'll find the very best of motorsport a little closer to home. Like up in Knockhill on the kind of persistently grey late autumn Sunday afternoon when the smarter part of the country is shored up at home, sheltering against the constant showers battering the Scottish countryside. There's magic to be found out there, in the twists and climbs of the short circuit where a field of Ginetta G40s splash around in the rain with the all the unbounded enthusiasm of school kids who've just been given brand new sets of wellies. And despite their humble horsepower these things can really move, using the impossible cambers and pooling puddles to power their brilliant dance. I don't think any video game has come closer to reflecting the homespun thrill of clubman racing than Project Cars 2, Slightly Mad Studio's console and PC sequel to its 2015 racing game. I've lost countless Sundays over the years enduring the elements in the hope of witnessing such a ballet, and just as long in pursuit of a video game that might do the wonder of grassroots motorsport justice. Codemasters' TOCA series briefly provided a low-poly window on that world at the turn of the century, though it wasn't really until Slightly Mad Studios' Project Cars came along over a decade later that anyone would cover the same ground with any real gusto.Billed as an upstart rival to the likes of Forza and Gran Turismo, it was - as Oli pointed out in his review back in 2015 - something even better than that: a true alternative, one that placed a hard focus on motorsport in its glitzy glory as well as shining a spotlight on some of its less glamorous playgrounds. I should have loved it, but it never really clicked for me; the handling was unapproachable on a pad and inconsistent on a wheel, its career was a featureless grind and it was hard to shake the feeling in the months after its initial release that it wasn't quite complete. Slightly Mad Studios has rectified some of those missteps, but not before broadening its take on motorsport to an exhilarating degree. Here's a game where you waltz in the rain around Knockhill with those wonderfully pliable Ginettas, making the most of a best-in-class weather system; spit dirt and gravel in a run around Hell with a group of rallycross rivals; go wheel-to-wheel with 30 other cars at 230mph in an officially licensed Indianapolis 500; watch the sun set and rise over a multi-class race at Le Mans in the best video game approximation of the classic 24-hour race since Melbourne House's Dreamcast classic; or, perhaps, dare yourself to take the now extinct Masta Kink flat in a Lotus 40 in the original 14km layout of the Circuit de Spa Francorchamps. If you've any love for cars being driven competitively, your own particular passion will doubtless be found somewhere within the bustle of Project Cars 2. And it really is a bustle, though Slightly Mad Studios has made efforts to impose a bit more order here. For all its breadth, the original Project Cars sometimes struggled to make sense of it all, and the sequel does well to impose more structure upon its career mode. You're still free to jump onto almost any rung of the motorsport ladder at the start, from karts and wingless single-seaters through to more purposeful beasts (although the very pinnacle is locked off until you've made at least some progress). Now, though, there are invitationals that unlock as you go, and the opportunity to build affinity with manufacturers and partake in factory drives for certain marques. It certainly makes it less of a slog, but in truth I'm just in awe of a game that places so much faith in the simplicity of a series of authentic races and a championship table that ties them all together. There are some delightful little quirks in how Project Cars 2 handles its championships, too, whether that's in its replication of the various rulesets that govern different flavours of the sport - now all available throughout the package as Motorsport Presets - or in how its seasons are beholden to a calendar and, in a wonderful twist, to the seasons themselves. One early club-level championship in my own career reached its conclusion at a snowy Brands Hatch; the resulting drive to fifth place that clinched the title, battling the elements just as much as I was battling my rivals, was one of the most satisfying moments I've had in a game this year. That authenticity reaches out to other parts of Project Cars 2. Its assists now include a setting that replicates those on any given car - drive a GT3, for example, and it'll come complete with the ABS and traction control that allow amateur gentleman drivers to comfortably drive these thoroughbred beasts - in a feature I'm always amazed isn't now standard across the entire driving genre. As to how the cars actually handle, it's certainly better than what went before. On a pad it's playable, at least - something which I don't think could really be said of the original on its default settings - though it struggles to communicate what the car's doing, which results in a slightly detached, overly loose feel to the handling. It's a significant improvement, though it's not best-in-class. On a half-decent wheel it's a different story, of course, and with a good set-up the cars do a lot more talking. There's still not quite enough weight there to trouble the likes of Assetto Corsa or iRacing - in my opinion, at least - and so Project Cars 2's rides end up enjoyable but never quite excellent. And so, on paper, Project Cars 2 is the game that its predecessor should perhaps have been - yet I've still experienced one too many problems in my 30 hours with it to be able to unreservedly recommend it. Maybe it's inevitable that there'd be a bump or two in the road when a relatively small team tackles a project of such scope and breadth; it's worth reiterating that, while other games might boast bigger car lists, nothing comes close to the track list or feature set on offer here. The AI, which is often excellent, can be inconsistent; I've witnessed AI drivers struggle in the wet, and on one occasion during a rallycross event in Lohéac no-one made it past the first corner intact, proceeding to crawl around so I wound up winning a six lap race with two laps on the rest of the field.Other issues are more problematic still. The dynamic racing line only works on some tracks, at many more disappearing completely or giving erroneous information. Skip to the end of qualifying having set a seemingly insurmountable time and your competitors will then become capable of inexplicable speed in your absence, ensuring the only way to get a good grid position is sitting through an entire session. Elsewhere, there's a fuzziness to the new race director that can frustrate, with penalties being handed out when you're nowhere near track limits or any of your competitors for reasons I've been unable to fathom. It's a pain in single-player races, and will definitely need attention if the multiplayer's hopes of enabling serious eSports - which see the introduction of an iRacing-like safety rating - is to take off. Some of these are known issues, and I've no doubt many of them will be addressed in the coming weeks or months, but know that on launch day Project Cars 2 is every bit as spotty as its predecessor. It's a shame, as it obscures an otherwise remarkable achievement from Slightly Mad Studios. When it lands - when I'm deep into the dark heart of the Nordschleife as the sun sinks and fog rolls in while the tuned thunder of an Aston Martin Vantage GT3 peaks - there's simply nothing else like it. But it's still too patchy and too inconsistent to be the big ticket contender it clearly has aspirations to be. Instead, Project Cars 2 is a clubman racer, one that oozes authenticity despite its many rough edges. It's not going to earn the series or the sport many new fans, but if you can endure the hardships it places on you, you just might end up loving it."}