{"ref": "https://www.eurogamer.net/r-gizmondohardware", "date": "12 Jul 2005", "game_name": "Reviews", "text": "The story of the Gizmondo should be written down in the history books, passed on from generation to generation and posted on the wall of every games industry bigwig in the country. Its message is this: if you give a console a completely stupid name, it will face ridicule and mockery - no matter how powerful the machine is, what the games are like or how many members of Girls Aloud you invite to the launch party.Now that's been said, we can relax and get on with it. We're here to tell you whether or not the Gizmondo, name aside, really does deserve all that ridicule and mockery. And the answer is - wait for it - No. Which of course leads to more questions: is the Gizmondo without flaws? No. Is it likely to, or does it deserve to, outsell the Nintendo DS or Sony PSP? Probably not. But is it a neat little machine that has enough going for it to make a purchase worthy of consideration? Yes. And we'll explain why. Let's start by looking at what you're greeted with when you open your big square Gizmondo box. The subsidised £129 version gets you a handheld, charger, USB cable, SIM card with £5 of credit, 20 free downloads, a set of headphones and a user CD containing the manual and PC sync software. You'll also find - because of the subsidy - you're subscribed to something called the Smart Adds service, of which more later. The machine itself is lighter and less chunky than rival handhelds, just fitting into a back pocket. Design wise, it's not quite as sleek and sophisticated as the PSP, and while we like the velvety black casing, there's something a little tacky about the plasticky silver buttons. The D-pad has a weird N-Gage-style dip in the centre and doesn't feel quite right, and the buttons along the top of the screen - used to control things like power and volume - are small and fiddly. That said, the shoulder and shape buttons are well placed and it's comfortable to hold. The 320 x 240 pixel TFT screen is about the same size as the DS', with a good backlight and brightness control. There's only the one speaker, which is small, tinny and obscured by your thumb if you're pressing the shape buttons - so you'll need a pair of headphones, and you'll probably want to invest in a better pair than the cheapo ones you get in the box. On booting up (which takes a while, but there is a standby option and key lock to save you having to do it too often), you're greeted with a main menu screen listing all the options available to you - Games, Movies, Music, Messaging, GPS & Web, Camera & Images, Contacts, Applications and Settings. The interface is intuitive and easy to navigate your way around, though it can be a little slow sometimes. We'll look at the games individually later, but let's start with the Gizmondo's multimedia functions.The Gizmondo uses a Windows CE operating system so you can view videos in the MPEG 4 format. Getting movies on your Gizmondo involves connecting it to your PC via USB and syncing up - a bit of a faff, since we found we had to download additional software, restart the computer and mess about for a bit to get it to work. But it's not impossibly complicated and once you're up and running it's a simple matter of dragging and dropping files in Windows, saving them either to the console or the removable SD card.There are free videos available on the Gizmondo website, which incidentally is poorly designed and can be a pain in the arse to navigate your way around. The selection isn't particularly impressive - three music videos, trailers for Hitch and Sin City, some TV clips and four films/documentaries: The Elvis Story, The KGB Paranormal Files, a live action Jungle Book and a film about rock music in the fifties. It's hard to see exactly what demographic they're aiming for here, and we can only hope the selection improves as time goes on. Picture quality isn't brilliant. Too many frames get dropped, and while the jerkiness is something you get used to it's clear from the outset that we're not talking DVD-style smoothness here. Images aren't sharp enough, either, with a slight blurring around the edges of pretty much everything. But these problems aren't so great that it's impossible to watch and enjoy a movie on the Gizmondo - while serious movie buffs probably won't chuck away their portable DVD player, the picture quality is adequate for those who just fancy watching a quick film on the go. The process of getting music on your Gizmondo is the same as for movies, and the handheld supports WMA and MP3 files. You can also buy music from the Gizmondo website, which features an iTunes-style library of tracks available from 80p a pop. There's supposed to be digital encryption technology which uses digital handshakes and the like to prevent piracy. Not being terrorists, drug dealers or pornographers or wishing to support any of the above, we do not, have not ever and will not ever engage in music piracy. However, a pirate friend of ours said they had no trouble sticking any old MP3s on their Gizmondo whatsoever, just so you know. The sound quality is fine - a little tinny unless using reasonable quality headphones, but generally clear, crisp and loud enough to cause ear drum scarring if you like that sort of thing. The only problem is that we couldn't work out how to organise a playlist, even after referring to the manual (which, annoyingly, only comes on disc - so you need to navigate it via Adobe Reader or print out all 60 pages. Grrr). There must be a way... But we shouldn't have to phone the helpline to find out. You can top-up your Vodafone SIM card to send picture and text messages via the GPRS network. Inputting text is done using the D-pad, which is a bit of a pain - it takes six key presses just to type the letter ~a~, for example. There is a predictive text system which helps a bit, but generally speaking it's hard to see why you'd want to use your Gizmondo for sending texts when you've got a mobile phone.The picture messaging is a bit more useful, since the Gizmondo's built-in camera takes better quality snaps than your average mobile phone camera. However, we've no idea how much it costs to send either text or picture messages, since we couldn't find said information anywhere in the printed literature or on the user disc. Poor. Eventually, we're told, you'll be able to send and receive emails with the Gizmondo - but this service wasn't up and running at the time of writing. Oh dear. This could have been the Gizmondo's killer app - the ability to use satellite technology to work out where you are on a GPS map, how to get to where you want to go and where to find your nearest tube station, cash machine and so on. Unfortunately it just doesn't work as well as you'd hope, at least not consistently. We managed to get a satellite lock standing outside our house, but when we turned a corner the Gizmondo lost sight of the signal and failed to get it back in the ten minutes it took us to walk all the way down the road.The same problem occurred even in central London - we couldn't get a lock all along the length of the Strand. Admittedly the literature does say it won't work near very high buildings, but we're hardly talking skyscrapers. So although the GPS, when it works, is a very cool function, it's not something you can rely on - so if you're not sure where you're going you'll still need to carry an A to Z just to be on the safe side. Also, it won't ever work indoors - you need to be ~under open sky~, which is fine unless it's raining, say. Grrr. It is, however, good value next to currently available in-car GPS systems, so if you haven't got one of those already then it's certainly worth considering on that basis.The Gizmondo has a built in 0.3 megapixel camera, and takes decent sized 640x480 resolution pics of slightly better quality than you'd expect from most mobile phones. There's no option to use it to film things, though, which seems a bit of a wasted opportunity given that this is a standard issue feature for most mobile phones these days. But what's really interesting is the potential option to play ~augmented reality~ games. We've only seen a couple of brief demos of one such game, titled Agaju, which sees you exploring an ancient tomb. The trick is that the camera uses whatever you're pointing at as a reference point so you can look and move around by tilting the Gizmondo in the direction of travel. And apparently your real-life environment will become part of the game world - in the demo we saw, aiming the camera at a special symbol printed on a piece of paper makes a weird blue character pop up and talk to you. Moving the Giz around makes it scale and rotate accordingly, which is a clever piece of tech.From what we've seen so far this is a neat application and could work very well indeed - we'll just have to wait and see what they do with it...This service isn't up and running yet but it could be rather interesting. Basically, you get a hundred quid knocked off the price of your Gizmondo for agreeing to view a maximum of three adverts a day. Some of these will come with a virtual voucher attached, and will make use of the handheld's GPS functionality. So you might receive a buy one Big Mac, get one free offer, and the Gizmondo will automatically show you where your nearest MacDonald's is in relation to where you are when you receive the ad. Not a bad idea, if you ask us - providing the GPS works as it should, of course. According to the official line, at full charge the Gizmondo battery will last for 12-14 hours if you're playing MP3s, 4-5 hours for playing games and 3-4 hours for watching movies. Not massively impressive, then, and as you might expect we found these estimates to be a little optimistic. Still, it's plenty enough power to get you to work and back, and a heavy duty battery will be available soon, priced at around £35.Having given you a taster of the hardware capabilities of the Gizmondo, we'll be back later this week with a full round-up of all the currently available games on the Gizmondo and asking the all-important question: are they actually worth buying?"}