{"ref": "https://www.eurogamer.net/r-avcontrolcentre", "date": "12 Jul 2005", "game_name": "Reviews", "text": "It's not often we bother with getting our hands dirty with the business of reviewing hardware here on Eurogamer; there are plenty of site devoted to the subject for that. But in this case we're prepared to make an exception for Joytech's rather wonderful AV Control Center range. It's something you could neatly sum up in a couple of ways; an audio-visual switcher box with a difference, or just simply the answer to many gamers' prayers. Although we've never covered it - or probably even spoken of its existence before - much of Eurogamer's 'nerve central' (in front of the TV, in case you’re wondering) has been ably taken care of over the past 18 months by the original AV Control Center (and now by its enhanced successor, which has just recently been released). Put simply, it's an AV switcher 'hub' roughly the size of a DVD player (and designed to be housed snugly alongside your home entertainment system) that takes care of practically any cable you can throw at it. So why on Earth are we devoting precious time to this instead of, say, getting on with reviewing Conker? Because it'll make any serious gamers' life better: trust us on this if you've never listened to a word we've said before.If you're anything like us, your lounge set-up on a bad day roughly resembles a car crash at a console convention. If the health and safety executives had a cursory glance at what was going on near the telly they'd be eaten alive by 2479 cables all having some sort of group hug at a rave. For the Monicas among us, that simply isn’t on. A tidy lounge is a happy lounge, or a happy Monica, at the very least.The main problem which even casual gamers face is that most TVs simply don't cater for the demands of a modern AV set up without all sorts of behind the telly cable fumbling. Most sets barely cater for the standard set up of a DVD, VHS and set-top box, never mind a console. And just try complicating matters with surround sound set-ups, multiple consoles old and new; it's a nightmare that's become unnecessarily complicated by ever-changing standards and general goalpost shifting that would stretch most people's patience to breaking point.Once, all we had to deal with were RF connectors, then over the past decade and a half the whole thing's become a joke, with Composite, S-Video, SCART and more recently Component. It's not important to know what these standards mean (only that you really ought to be using SCART if possible, or Component if you've got a really high end set up), but it is important to be able to have as much of your Audio-Visual equipment hooked up simultaneously to your TV as possible. Essentially the AV Control Center lets you hook up practically everything you can think of with the minimum of fuss, and puts an end to those hideous forays of death around the back of the snake pit that is your TV.The cheaper first version of the AV Control Center is a pretty good start (and some might argue, the better option). It has won multiple Home Entertainment-related awards, and for good reason. Allowing you to hook up four devices of multiple connection type, it copes with all four video connector types - including Component, believe it or not. On top of that, each of the four 'channels' on the device has additional stereo phono inputs and a digital optical input. A typical home set up with a DVD, set top box and a console would be taken care of with ease, regardless of what AV connection each device has. With all devices funnelled into one unit, all you need to do is connect the (provided) leads back to the TV (or Amp, etc) and basically switch between the device as and when you require it.Even better, the unit can cope with multiple video connections in the same channel. Say, for example, you have a console taking up a SCART channel, you can still plug a Composite, S-Video or Component device into the same channel - the signal will still output when you cycle through the various channels on your TV.For the high-end user, the best bit about Joytech's device is that is also has the hidden ability to act as a switcher box for up to four Component devices. All you do is simply plug the three Component cables into the Composite input and the two RCA phono inputs and Voila, four-way Component switching. We've flagged this as particularly useful, as it's astonishingly hard to actually buy Component switcher boxes at all, and for those of us trying manfully to persuade our PS2s, Xboxes and GameCubes to all output at pin sharp Progressive Scan it's positively a godsend. The presence of four optical inputs alongside four phono inputs also helps us out with almost every possible scenario.So, in a gaming context, you can basically have the PS2, Cube and Xbox all wired up next to each other and the set top box/DVD/legacy systems. With a bit of prior thought, it's actually possible to plug in older systems like the Dreamcast and Saturn alongside existing machines by effectively cheating and sharing channels. If you're confused, don't be. For example, if you can track down a component lead for the Xbox and PS2, and also buy digital optical cables for the sound, it's possible to only use two channels for four consoles. While two older consoles may use S-Video or SCART (say Saturn and Dreamcast) you could get away with sharing the same channels by using Component inputs for the PS2 and Xbox. It's not a feature that Joytech has made clear anywhere in its documentation, but once all of this becomes clear, you can see why we reckon it'll be the solution to any gamer's cabling hell.So if that hasn't frazzled your brain yet, there's even a brand new version now out to buy (for about £20 more). Simply called the AV Control Center 2, it adds a further two channels, throws in two Ethernet ports (to cope with Xbox and PS2 online, for example) and has a programmable LCD display for good measure. But although it sounds like the dream AV switcher, a couple of baffling compromises have been made - namely that there's now only two digital optical inputs instead of four. Quite why Joytech thought it was a good idea to remove one of the things that made the first unit so good is open to question, but it throws in one or two headaches if, for example, you happen to have multiple systems all offering Digital Optical output. Take our set-up, for example. Our Sky box outputs digital sound, as does our DVD, PS2 and Xbox. As will the Xbox 360, PS3 and doubtlessly the Revolution too. To remove the digital sound from the unit at such a crucial time is a real disappointment, and effectively reduces its usefulness as a Component switcher box (as you'll probably have to resort to phono, thus stealing two of the three ports you require for the full Component set). On the other hand, version 2 is still an amazing piece of kit, sporting no less than five SCART channels, and - thanks to a pop out flap on the front - SIX composite channels, six phono audio inputs and six S-Video. In theory there are still six component inputs offered in total, but the absence of digital audio means you'll have to suss out how to get the audio routed to you sound system or TV.In both cases, the all-important signal quality is absolutely top notch. The kind of dot-crawl issues normally associated with AV switcher boxes has been well and truly eradicated. One word of warning, though. We did notice a slight dulling of the colour saturation when we compared the picture when routed via the AV Control Center and plugging the cables in direct to the TV. However, this issue was resolved by simply turning up the colour on the TV itself, and so long as you bear this in mind you'll be fine.In terms of getting the most out of a box like this, our advice is to use SCART if at all possible, rather than the vastly inferior S-Video or Composite. For those lucky few that have the ability to output in the elusive Progressive Scan, then definitely go for the Component option. Outputting console games in 480p (or even 720p/1080i if you're using a modded or US Xbox) is something you won't regret.With a remote control bundled (with batteries), as well as Gold plated SCART, S-Video, Composite and Composite to SCART converter block both AV Control Centers come with just about everything any self-respecting gamer could ask for in one package. Our advice is to check both versions out and buy one to suit your needs - either way it's a purchase that will make your life better; and score you points with the Monicas of the world. Any piece of kit that makes our daily lives as gamers as easy as this has to be shouted about as much as possible.The Joytech AV Control Center and AV Control Center 2 come in Silver and Black, and are available from all good electrical retailers. For more information visit the Joytech Website"}