{"ref": "https://www.eurogamer.net/r-formulaone05-ps2", "date": "1 Jul 2005", "game_name": "Formula One 05", "text": "Learning to swim was hard. This young reviewer still fondly recalls being encouraged to practice for hours until he could make it from one side of the children's pool to the other without touching the bottom - trying to copy other people's movements, slowing the arms to move water rather than slap it, and eventually managing to do it motivated not only by the potential fun but also by the £25 worth of promised Transformers toy waiting in the toy shop up the road. With that in the bag, there was backstroke, front crawl, butterfly and eventually diving and other entertaining offshoots to master, like swimming underwater, and of course using goggles to stare at older girls in bikinis.It would've been strange, one has to say, to have been given a few pages of typed instructions and a few minutes to digest them before being thrown headlong into the deep end of the pool alongside Ian Thorpe, armed only with a rubber ring, harpoon gun and outboard motor. We'd still quite probably have drowned. ~But m'lud, we explained all the concepts to him before we threw him in!~ our parents might have yelped as they were dragged away in manacles and hurled into a pit of serpents [Tom's never been to a criminal court - Ed]. ~We gave him loads of things to help!~Bizarre, eh? And yet that's strikingly similar to the way F1 2005 works. The game goes further than any other PS2 title toward simulating F1 racing; it just doesn't seem particularly bothered about giving you a route into it.Working on the basis that what everyone really wants to do is race and win Transformers toys (well, cars actually), it's whacked in countless race options and timed test sessions with medals to fight for, included a Career mode stocked with every expected track and driver, fully simulated the race weekends from Friday practice through to the chequered flag, distilled the complexity of pit-stops into a simple reaction-based mini-game, and produced a more convincing graphics engine than any other PS2 F1 game to date. But for a few minor niggles - some questionable AI behaviour and dodgy commentary spring to mind - it's pulled it all off nicely too.But whereas you can play something like Gran Turismo for literally hours and hours just practicing in a sensibly paced and thoughtfully structured learning environment - enjoying yourself, and pushing yourself to win the best medals as you do - F1 2005 expects that a ~Learning & Tips~ section stocked with reams of information about the subtleties of motorsport will suffice. It does not. And it's doubly silly that you can't access it from within a race, either.What it does instead is give you an array of driving aids. With these turned on, the complex process of guiding an extremely fast and volatile racing car around an array of complex circuits with 19 other drivers breathing down your exhaust pipe is greatly simplified. Traction control is standard, so you don't spin your wheels on the starting grid; braking is assisted, so you don't overshoot every corner and wind up in the gravel; your gearbox is automated, so you don't have to worry about those pesky shifts; there's a virtual racing line drawn on the track which shows you where to brake; and there's even something called 'spin recovery' that turns the car round on those occasions when you've decided to see what's going on behind you without the aid of a rear-view mirror.With assists turned on, you'll find you can do fairly well pretty quickly. Races can be various lengths and there are difficulty levels to consider as well, so it's quite possible to be bad at the game even with all the assists turned on. Turn things off, however, and things get markedly harder - and completing a race, let alone winning a championship, with all your assists turned off is a task that's likely beyond just about anybody who doesn't breathe the sport instead of air.And yet being able to do that is the ultimate goal. With assists turned on, it's inconceivable that we might get gold medal times in test sessions because the faster lap times demand more thoughtful braking and steering than they can provide. And it's hard to imagine ourselves deriving much satisfaction from finishing higher up the driver's championship than whichever multi-yacht-owning lunatic is dominating the field these days either. What we have here feels like a game with no learning curve installed. You can try and wean yourself off the assists one by one - that's certainly the idea - but unless you read up and really put in the hours practicing you're going to be hard-pressed to make the most of it all. The inevitable F1 2006 might want to think about how it brings you up to speed rather than just letting you pick a gear at the start.To give the game a break on that front though, it's hard not to enthuse about its comprehensiveness in other areas. A race weekend can take hours to complete if you want it to - with two practice sessions on both Friday and Saturday to get used to a track and its conditions, a proper qualifying session and the eventual race. Each session allows you to set the car up exactly the way you want it (or just pick through some simpler presets for key areas), view standings, watch the session and more. As you fire up the first Friday session and take a casual look through the setup screen, you suddenly realise there's a clock ticking down in the top left. You only have an hour for the session, after all.Attention to detail is admirable on the track too. Your heads-up display not only has speed-o-meter, fastest, current, last lap times and sector times, but revs, details on the heat in the tyres, and even a handy gauge that shows you how hard you're holding down the accelerator. The latter is particularly useful if you're using a PS2 pad and you've done the old ~let your finger slip slightly off the X button~ thing. In fact, we ought to give it a bit of a kick on the latter point because anything near an extended session is going to leave your thumb rather sore due to the pressure you have to exert.F1 2005 is genuinely capable of being one of the most intense and comprehensive takes on Formula One available on the PS2. On the track the controls are punchy, the spectacle convincing enough and the simulation perhaps excessive, which guarantees it a large audience. And the inclusion this year of ten-player online options (albeit limited to 50Hz display mode only, rather than the options of 60Hz and progressive-scan which make it into the rest of the game) is a darn sight more impressive than last year's ghost car effort - and works as well as any PS2 Online game might be expected to do. But whether you'll enjoy it probably comes down to that question of how you'd learn to swim. If F1 compels you and you don't mind home-schooling, then this is a good buy. Otherwise you might want to stick with Gran Turismo."}