{"ref": "https://www.eurogamer.net/r-pes4-pc", "date": "24 Jun 2005", "game_name": "Pro Evolution Soccer 4", "text": "Order yours now from Simply Games.Given that it's taken an extra month to make it to market, you could be forgiven for thinking that the PC version of this year's Pro Evolution Soccer 4 is, if not substantially, at least discernibly different to its PlayStation 2 counterpart, which deservedly rose to the top of the UK Charts on its release in the middle of last month. So, er, we'll have to forgive you, because apart from a few small points this is an almost pixel-for-pixel conversion of the console version. Newcomers? Read our PS2 review then return, and we'll get down to the issues that apply to PC gamers.One of those 'issues', as anybody who's been following the build-up is doubtless aware, is the addition of an online multiplayer mode. In fact, it's our main reason for being here. Pro Evolution Soccer has long since been our preferred football game - thanks to a mixture of splendid ball physics, observantly replicated player behaviour and lifelike scenarios and balance - but being able to tackle our mates from the comfort of our respective lounges is a thrill it's never offered us before, even though the rival FIFA series has done it on the PC for literally years.Sadly, Konami's implementation on the PC leaves a little to be desired. Having seen the game's TCP/IP play lauded alongside the Xbox version's Xbox Live support recently, discovering that PES4 PC seems to be emulating null modem Doom functionality is a bit of a dampener. There's no matchmaking system or anything useful like that; one player acts as host, and the other player types in his IP address and connects. How you find your opponents, and questions about connecting to other PCs directly in these days of NAT routers, software firewalls and invasive Service Packs are not covered.At least performance is perfectly adequate, and it's obviously ideally suited for people who want to play on an internal network, but it's still hard to recommend that over sitting next to your mate on the couch and watching his pained, disbelieving expression as you flukily knock six past him and then refuse to play again until the following evening.Setting that disappointment aside though, the PC version of Pro Evolution Soccer 4 is a fairly competent package. Presentation is slightly lazy - the game still acts as though it's running on a PS2, asking you to ~press X to confirm~ and the like - but at least everything's intact, and although your mileage is destined to vary based on the power of your PC, we managed to run the game at high enough resolution that it looked very sharp and still avoid the slowdown that plagued the PlayStation 2 version during goal-mouth scrambles and other frenzied events.Indeed on that basis it's a real boon. Having configured our PS2 Dual Shock pad through a trusty converter (we had some trouble calibrating the analogue sticks, but that seems to have been a Windows problem; playing the game with the D-pad worked fine), it was like playing PES4 with the milk bottle goggles ripped from our eyes. Players don't appear to be that obviously more detailed, but more pixels gives them more life, and gives the game a degree of fluency that even last month's PS2 version can't lay claim to. In terms of player movement and general behaviour, nothing comes closer to real football. FIFA may be an enjoyable experience these days, but this reviewer just feels more in control in PES. It's more like football.Part of that is certainly down to the vast array of things you can do with the ball at your feet compared to EA's title, so it's important to note that this year's Training section is more involved than ever, striking at three potential groups of PES fan and nurturing them - us - through disciplines that go far beyond ~wiggle the right analogue stick to play one-touch football~. You can practice set-pieces, one-twos, dribbling through cones, through balls, rounding the keeper, defending crosses, etc. etc. Virtually everything you might need to put into play on the pitch is something you can specifically target in Training. With a few hours on your hands, there's no excuse for not trying to get to grips with PES4's finer points.And you'll be grateful when you do get the hang of them, because it continues to play magnificently. Players move the ball around crisply and aren't afraid of hooking at it when it's not rolling directly to their feet. They overlap and play wall passes to split defences. Whichever foot they favour makes a difference to the outcome of any move. Strikers can unleash a wide variety of different shots, but they don't travel along the sort of predetermined vectors that become so transparent after a while in other titles. Even the offside trap works.There are flaws of course. The referee sometimes sticks his nose in where it's not wanted, interpreting the advantage rule badly and calling fouls for tackles that look distinctly safe, while on the pitch the ball can sometimes react a bit too realistically and cannon around out of control, and even now players are still capable of not reacting quickly enough and letting loose balls drift into opposition hands when they should be diving in furiously trying to secure it for you. And the commentary's still total arse.But on the whole it's hard to criticise. Your frustrations will be largely sport-related, and not directed at Konami. It's not there yet, but Pro Evolution Soccer 4 is closer to real football than any game has been before - the passing, the tackling, the movement, the look, the feel, etc. It manages to emulate the sport so well that you can describe the game in much the same way. PES4 is fun whether you just like hammering the ball back and forward against a wall or booting it between the DIY goalposts in your garden, whether you're in a Sunday league team and ~one had try-outs~, or whether, on the evidence of a Konami party a few weeks ago, you're John bleedin' Terry.However we can't recommend PES4 PC to everyone for one key reason: barring a catastrophe, the Xbox version - review code for which we're expecting right around now - ought to be that little bit superior. Graphically the PC will always have slightly more pixels to play with, but the team's half-hearted attempt to include online multiplayer options is destined to be relegated somewhat when we connect to Xbox Live. On Xbox there's talk of mini-leagues and tournaments as well as proper matchmaking - and Friends list support will take a lot of the pain out of the process. On the PC we've regressed to calling up our mates, trying to figure out IP addresses and arguing over who makes the better host...If you don't have an Xbox though, assuming you can plug a game pad of some description into your beige box then this is the choice for you. It eliminates the PS2 version's slowdown problems and it plays as well as ever. And the only other issues to decide for and against are inherent to both releases - of which the player data issue is probably the most significant. Not including up to date line-ups for the current season in a game due out in late November is poor by anyone's standards, particularly given that EA launched its FIFA series with wholly accurate data a week before Konami even managed to have the PS2 version on store shelves. We're sure Konami has its reasons, but in the eyes of the consumer it's a very straightforward issue and potential deal-breaker.Nevertheless, PES4 with a slight limp is still the best football game on the PC, and if you love the beautiful game as much as we do then we'd seriously suggest you pick it up. It remains our most played game series of all time, and on this evidence will do for some years to come.Order yours now from Simply Games."}