{"ref": "https://www.eurogamer.net/r-area51-ps2", "date": "22 Jun 2005", "game_name": "Area 51", "text": "As far as alien conspiracies go, I'm in the camp that strongly suspects that truth is probably far more boring than fiction. With fiction there's literally no limit to how far you can go with creating this impressively complex sub-reality that has us all staring out into the inky night wondering when we are going to experience an alien abduction and speculating on what the US Government is hiding from us.There are several ways of looking at this: perhaps we are the aliens after all; the virus that's hungrily consuming everything in its path. Maybe the people in control of this whole sorry mess are the aliens? Or possibly, simply, there are no aliens. Could it be that we really are just sitting on the one rock that's set up right for life and as a hand wringing, God fearing, superstitious, hopelessly romantic species we can't cope with the concept that it's just us and that's it? More likely, says I. How boring.It doesn't stop the conspiracy theorists (or the plain paranoid-delusional) though, and the tangled web of possible lies, cover-ups, failed experiments and secret technology that lies within the notorious Area 51 makes for a great subject to wrap your thoughts around. For a videogame concept it's nigh on tailor-made, and it's genuinely surprising there haven't been more attempts to flesh out the myths and legends surrounding this top-secret desert outpost down the years. 3D Realms had a decent crack about 900 years ago with Duke Nukem 3D, and Midway - a lifetime ago - played around with the name with a bunch of rubbish light-gun shooters, but this Austin Studio-developed is arguably the first fleshed-out attempt at really getting under the skin of what lurks beneath this enormous enigma.It kicks off as a bit of a ho-hum, by-the-numbers first-person shooter, and ticks all the requisite reference boxes. A pinch of Half-Life, a sprig of Halo, hefty a dollop of Doom and even a side portion of Resident Evil go into the mix for the first couple of hours. Called upon to check out, contain and isolate a viral outbreak within Area 51, the first team sent to investigate is wiped out by the hideous mutated creatures that lurk within. Next up, a four-strong squad of experienced HAZMAT troopers with more than 100 missions under their belt are sent in to sort the mess out. It was supposed to be routine; it turns into a nightmare. Headed up by Ethan Cole (voiced impassively by a particularly sleepy, unexcitable, almost down-on-his-luck sounding David Duchovny) you lead the charge through a quick-fire selection of action-packed early missions that have the relentless pace of the infamous Flood section of Halo, albeit with leaping mutants more readily associated with Doom III and Resident Evil. Throw in the duck-and-dive gameplay mechanics of Half-Life and it has all the right ingredients right from the word go. Albeit ingredients you've tasted several times over. Five chapters/three hours in (there are 19 in total) you could be forgiven for completely writing off Area 51 as a pretty, but ultimately done-to-death shooter. Although it's technically pushing the PS2 further than any FPS released to date on the console (more of which later) and is as action-packed a shooter as there has ever been on the Sony machine, there is a lingering suspicion that this is all there is to it. It'd be a foolish assumption.Just when you might be getting somewhat tired of the relentless shooting fest in dark corridors the whole game turns on its head by giving you the ability to temporarily turn into one of them, complete with mutant powers and the ability to shift between human and mutant in an instant. The story twists this way and that as you firstly try and reach Dr. Cray in search of an antidote (the man responsible for the ill-fated experiments), and then find yourself unexpectedly gaining further mutant powers as a consequence. It transpires that the allure of power turned Mr. White (Cray's one-time scientific partner) into a madman, and in order to put a stop to his nefarious plans Cray is forced to release the mutagen that has such devastating consequences. Cue rampant chase after White and numerous opportunities to explore the hidden depths of the base and the conspiracies that lurk within: the faked Lunar Landing TV set, the truth behind the Kennedy assassination, the whole works.Although this all sounds rather promising, Area 51 falls into that all-too-common videogame trap of losing its audience. Most of the time it's not abundantly clear why you're traipsing around; it has the chance to flesh out the back-story Metroid Prime-style by including a hand scanner which gives you access to all manner of unlockable bonus content. But bewilderingly this (arguably) essential content is tucked away on the game menu which requires the player quits out of the game just to read (which you tend not to bother doing, obviously).Meanwhile, many of the missions themselves focus on short-term run-of-the-mill goals such as fetching key cards, activating switches, meeting Squad X, or whatever, and fail to give the player adequate context for their actions. This isn't a complaint specific to Area 51 as such, as many many videogames are guilty of doing this, but it's always jarring to realise halfway through a game that you've no idea why you're pursuing whatsisname, or why a crazy procession of military-trained sharp-shooting mutants are leaping out of the walls after you. All Area 51 needed was some kind of overview screen that pieces together the story so far, character biogs and so on, but there's literally nothing to remind you of anything within the in-game menu.Just as well, then, that the action is very solid indeed, the load delays are minimal and the checkpointing spot on. Your average scrap in Area 51 tends to be a challenging clip-unloading affair that you always feel relieved to scrape through. When there's a gang of beasties to take down you really know you're in for a tough time, especially once the game passes the halfway mark (about seven, eight hours in). The fact they're a pretty gung-ho bunch that will chase you down means there's rarely any margin for error, and eventually you'll discover that in your human state you're easy meat for their deadly accuracy and weight of numbers.Flicking to your mutant form puts you in a vastly better position, though. Not only does it slow down time, you're proportionally faster than your foes meaning that you can charge right up to them and melee-attack them with ruthless one-punch efficiency. When the odds are really stacked against you (as they become quite severely in places) the only real chance of squeaking through is to plot the path of least resistance, charge and either punch well in advance of your target or fire one of your two available mutant weapons at them. The first of these comes in the form of Parasites which consume and eventually destroy their host, but allow them to continue fighting. Much more effective is the Contagion weapon which almost instantly consumes the target but has the negative side effect of draining your stock of Mutagen, which allows you to enter the mutant form in the first place. Far better, I learned, to become handy with your fists, dodge gunfire and punch their lights out.As such, once you learn the nuances of the combat system Area 51 really marks itself out as something special by itself, as opposed to another me-too offering hanging onto the coat tails of all its big name contemporaries. Soon you'll be using human form where necessary and switching to mutant form as and when required, as sometimes you'll realise that unloading your ammo gets the job done more effectively than wading around in the mutant 'red mist' view. For example, when you're busy having the crap sniped out of you from afar. As all good FPSs ought to, Area 51 manages to borrow the good bits from the standard bearers while throwing in a few well-conceived ideas of its own.That is does so with such impressive visual panache is definitely worthy of serious acclaim. Apart from Project Snowblind (which was way too easy and struggled to implement any of its plethora of innovations in a way that actually required you to use them) I can't think of a game which pushes the PS2 this far technically. As with just about all of Midway's many multi-format games, Area 51 was evidently designed with the PS2 as its base system meaning a lot of the impressiveness seen here will be lost on Xbox owners already used to better-looking games. But focusing solely on the merits of the PS2 version, it's a veritable tour-de-force that really pushes the system in areas that have been beyond rival developers up to now.There really are a huge variety of impressive moments of technical magic, from the hugely impressive ragdolling to the impressive billowing smoke effects that ripple up convincingly from the burned-out fixtures of the increasingly shattered base. Although it's hard to neatly sum up how many impressive effects there are that bring everything to life without resorting to geekspeak, it's hard to recall any game on the PS2 that had loaded the PS2 down with normal mapping, vast amounts of hugely impressive particle effects and rag-doll physics and gotten away with it. There's nary a hint of frame rate drop even when two of the Delta team man two vast plasma cannons and proceed to take down a relentless onslaught of mutant menace, and for those of you that care, no dreaded v-sync tearing either. It's a fabulous sight that even manages to look impressive on a big, pin-sharp screen (something few PS2 games ever manage). The only slight black mark is the lack of widescreen support, but that's something I can live with when it looks this accomplished. If you need your PS2 shooters to look the part then you'll certainly appreciate what Midway's Austin Studio has pulled off. Those of you spoiled by high end Xbox and PC titles might think otherwise, but in context this is a lovely looking game.For those wondering what aural pleasures await, it's instantly memorable for Duchonvy's deadpan narration (which, although well suited to a conspiracy investigator seems a tad ill-fitting, depressed and emotionless for a HAZMAT officer who's just seen his colleagues and buddies slaughtered and has suddenly been mutated beyond recognition. He takes all this in his stride way too well), alongside Powers Boothe's chiming in over the radio along with a suitably menacing otherworldly performance by arch goth weirdo Marilyn Manson. The soundtrack struggles to rise above the kind of incidental noodling that is videogaming's equivalent of musak, but at least it doesn't grate. Be thankful for small mercies.The obligatory online multiplayer is worthy of note, if only because Midway's actually bothered to put it in, unlike Medal Of Honor - and it gains bonus eyebrow-raising for supporting 16-player online even on the under-serviced PS2. On the other hand there's very little of note to get excited about; all the boxes are ticked in terms of Deathmatch and CTF, and there's a Mutants Vs Humans variant, but in reality once you've given it the cursory run-through there's not really a huge amount to keep you coming back and dragging you away from your multiplayer game of choice. Still, at least it's in there; I shouldn't moan.Scoring a game like Area 51 is an emotional issue. On the surface it's your classic seven-out-of-ten 'solid, worthy, but derivative' type of game that we'd have no hesitation suggesting you add to your rental list, but dig a little deeper and it has a number of things going for it that nudge it just about into that eight-out-of-ten 'go and buy' territory. For PS2 owners in particular I can think of no finer FPS on the system at the moment. Given that it's technically pushing the machine further than anything else, features 16-player online multiplayer, an action-packed single-player campaign that's no pushover and provides an interesting and well-conceived twist on the saturated shooter genre I'd happily nail my hearty recommendation to all PS2 owners looking for a shooter to get them through the summer.PC and Xbox owners are a little better-stocked on the FPS front so maybe consider a rental first, but all-in-all we're impressed with yet another accomplished effort by Midway - a publisher/developer that has unexpectedly become one of the most consistent performers in the business. The truth is boring but true: Area 51 deserves more credit than some critics are prepared to give it."}