{"ref": "https://www.eurogamer.net/r-donkeykonga2-gc", "date": "15 Jun 2005", "game_name": "Donkey Konga 2", "text": "Games should leave you with memories. Like this one:As you may know, Donkey Konga 2 is a game about bashing bongos and clapping in time to various songs. Yesterday, having spent the morning working my way through its catalogue of music - prompting Rob to complain that he was ~moderately disturbed by Tom's bongos~ to anyone who'd listen - I found myself calling up the rather gorgeous Habanera.I like classical music. Not to the extent that I recognise more than a handful of tunes, but enough to know that techno remixes of The Minute Waltz - to be found elsewhere on the playlist - should be banned. So discovering a proper Habanera was soothing - particularly for Rob, whose productivity dived so low, as I sat there pounding the rubber-topped plastic jungle drums clasped between my knees, that to use the expression ~nose-dived~ would imply that his head was below sea-level despite the fact that he was often standing up in a second-floor flat on top of a small hill.Anyway. I bashed the two bongos simultaneously to get things going and listened to the introduction. ~Aaah,~ we both thought. ~You know,~ I remarked, as the on-screen markers that signal the need to drum slid into view and I started bringing my left hand down toward the drum-skin, ~this is actually quite reser-~.But before I could finish, my observation wasn't so much cut short as eviscerated - by the deep voice chanting ~BONGO BONGO BONGO~.Apparently, in my absent-mindedness, I'd randomised the drum sounds. BONGO BONGO BINGO BANGO BONGO BONGO BONGO CLAP! Such was the calamity that I spent the rest of the song laughing uncontrollably whilst Rob covered his ears and bellowed things at me and people in the next room craned their heads round to try and establish what heaven's name was going on.It's a story I'll fondly remember.Donkey Konga 2, sadly, is a game I'd otherwise forget.Rather like the original, it's a nice idea, executed reasonably well, but just too lightweight and short-lived. Icons scroll along and you drum in time, clapping occasionally, the rhythm is varied and the songs are certainly that, and available in multiple difficulty settings, with unlockable ~Expert~ versions for people who plug enough time into the game to accumulate the mass of coins required to open them up. But for whatever reason - and this being me I do have a few theories - it just doesn't grab you in the same way that rhythm-action and music games like Samba De Amigo, SingStar and even Dancing Stage do.Obviously there's the physical and emotional element. With each of the abovementioned games you're inevitably going to look and sound like a bit of a prat whether you're good or not - in fact, some of my highest-scoring SingStar performances have also been the most widely ridiculed - but with Donkey Konga you're just drumming. It's not actually that funny to watch someone drum, so those people sitting around inevitably tire (and realistically even if it was brilliant you were never likely to buy four sets of bongos), and for those taking part there's no sense of excitement about the embarrassment and inhibition coursing through you. Because there isn't really any. SingStar gives me a constant rush of adrenaline and self-consciousness. Donkey Konga just makes my arse sweat and my nearest and dearest abandon me.It doesn't really go anywhere exciting, either. Drumming is quite a procession; the difficulty stems from getting the combination right more than the actual rhythm. Only in a couple of places was I challenged with irregular drumbeats, and it was those sections I most enjoyed.There's also a disturbing lack of audio feedback when you screw up. In SingStar and Samba, you can instantly tell if someone's fouling up by ear alone. In Amplitude, another rhythm-action game which you may recall involves hitting buttons corresponding to different positions to keep different parts of a song ticking along, the musical section you're trying to complete just stops dead. It's important because you feel penalised and, depending on the nature of the game, other people realise what's happened even without looking.In Donkey Konga, your mistakes tend to be that you've clapped instead of drummed, or hit left instead of right, or something like that. Only when you totally lose it and you let a few markers scroll past to regain your composure does it become slightly more obvious to people around you. But ultimately they'd only know if they looked at the screen.And therein lies the problem, really: what you're doing isn't really important to the composition. Half the songs - stuff like Shiny Happy People, Losing My Religion, All Star, etc - see you drumming the actual vocals rather than the drums! Other games that tend toward the party atmosphere this is attempting will involve you in the music. Donkey Konga 2's greatest thrills are accidental, or during a piece of music like the intro to William Tell that involves lots of Sin-Gle-Bursts-Of-Rhyth-Mic-Bang-Ing-Sound - and even then you're just revelling in the chance to bang drums.Donkey Konga 2 is an entertaining game. It can, despite what I've said, even be fun to watch - my friend Chloe told me to inform you, ~one out of one friends watching Tom play the bongos via webcam recommend this game~. Technically it's nicely done, with lovely backgrounds and incidental graphics, and a forgiving combo system that tolerates the odd ambient noise prompting an in-game ~clap~ when you don't actually mean it. And it has some clever mini-games based on banging the drums (although if you really want to do something other than play music with your bongos, Donkey Kong: Jungle Beat is essential), lots of unlockables, and a wide range of songs, most of which are interesting despite not being performed by the original artists [cheapskates - Ed], and there are also lots of multiplayer modes.But it's not as good as lots of other rhythm-action and musical games that I've played. Here, the composition doesn't really need your input and as such you're drumming for points and exhibitionism, and while the former can make for a compelling game the absence of the latter is extremely significant. Elsewhere in the genre, the composition really needs you, points set you apart, and exhibitionism is the addiction that keeps you coming back. By comparison, Donkey Konga 2's a bit too... (ah hell, why not?) humdrum."}