{"ref": "https://www.eurogamer.net/r-wrestlemania21-x", "date": "10 Jun 2005", "game_name": "WWE WrestleMania XXI", "text": "There's a logo printed on the front of the box saying this game was given ~9/10~ by some magazine, but we think there's probably been a mix-up at the printers. Perhaps they got it upside-down and actually meant to reward it ~01/6~ - which would've been a lot closer to the mark for this disappointing return of wrestling to Xbox. WWE Wrestlemania 21 is indeed an improvement over the abysmal Raw series, but only a minor one. We'd rather play this than Raw, but that's like saying we'd rather get run over by a Ford Ka than a Ford Focus because it's a little bit lighter.But this isn't a hatchet job! We love the WWE stuff even though it's gone a bit rubbish, and had great hopes for new developer Studio Gigante - the current employer of Mortal Kombat driving force John Tobias - and its reworking of the Wrestlemania franchise. Surely a man like Tobias can do the trick? No. He cannot. Wrestlemania 21 is not a particularly good evolution. The highlight of this deal is the wrestler models - they're really very good. Impressive, almost. Studio Gigante has managed to solve the problem of making arms join onto bodies, with arms that join onto bodies really quite amazingly well. Seriously. It's sometimes like there's no join at all! Legs all join pelvises nicely, skin looks quite a bit like real skin and the detail is extraordinary. Stacy Keibler's lovely strappy ~suplex me~ shoes will have foot fetishists champing at whatever part of the body it is they champ at. Sadly a lot of this good work is undone when playing through the game's Career mode, thanks to this ~main bit~ insisting you take a homemade, custom wrestler through the ~story stuff~ instead of an established superstar. These custom wrestlers look a little second rate next to the WWE superstars, seeing as they're compiled out of blotchier pink textures. Their limbs don't join together as well either, so you're left controlling what looks like a Dreamcast-era man against the ready-made and glistening Xbox-powered WWE stars. Kind of kills the vibe, that. So you start trying to play it with your blotchy man, and yes, it's just like a wrestling game - only one that's been dumbed-down so dolphins can play it with their noses. There's a strike button, a couple of grapple buttons and some other buttons there's never any point in using. That's it. Whoever presses the strike and grapple ones quickest and the most times in a row will win the fight. It's that simple. We weren't expecting much finesse from the man who brought us Mortal Kombat, but a fighting system with depth that goes a bit beyond mashing away at two buttons would've been welcome.Playing the Xbox is monumentally frustrating, with unstoppable, Terminator-esque rampages from the computer controlled characters often leaving you wailing, hammering the pad, then wailing some more. It really is about speed-pressing over skill, which, frankly, kind of sucks. We've spent the last eight weeks playing the phenomenal Dead or Alive Ultimate on and offline, and suddenly finding our counterattacking, nimble fingers insulted by Wrestlemania's simplistic system is something of a shame.When not on an unstoppable rampage, the enemy AI is pretty much useless. Xbox-controlled men regularly get stuck in loops, bouncing from rope to rope, taking no account of where you are or what you're doing, before launching a random attack and falling flat on their faces. It's quite amusing to see it happen, until you remember you've just paid some money for it. There's also an utterly rubbish thing that happens when running characters hit each other - they both recoil and fall over. It's a bit bewildering and rather sad that there aren't more brains behind the pretty skin and shoulder joints. Yes, you can play it online against the marginally more intelligent Xbox Live hordes - in virtually all offline game modes and match types too - with player-created championships to challenge other players in. But it's so clumsy and simple that there's really no challenge or fun to keep anyone approaching or beyond puberty entertained for longer than the odd fact-finding match. And, with the game having been on sale for a couple of weeks already, we saw disturbingly few players online. We saw two players online, to be specific, and this was at around 9:30 in the evening - Xbox Live primetime. This is not really one to bother with if you're looking for another reason to justify continuing to pay for an Xbox Live subscription. There's commentary to it all, provided by fan-faves JR and The King, along with fan-least-faves that ~Coach~ guy and whatever past-it journeyman he's hooked up with this week. But that too is a disappointment. Even the smallest, lightest, most glancing of blows triggers a ~THAT'S THE MOST AMAZING WRESTLING MOVE I'VE SEEN IN ALL MY LIFE! MY GOD! I REALLY CAN'T BELIEVE THE AWESOMENESS OF THAT MOVE!~ response from the MCs, which, as you can imagine, quickly gets as tiresome as someone constantly poking you in side of the face.It also feels like it hasn't really been finished properly. At the end of a match there's a pause, the sound cuts off, then a really bad and blocky logo flies in, jerks around a bit, and everything kind of stops. You think it's crashed, but it hasn't. If you're dead into wrestling, you'll be impressed at the likenesses of the stars, then crushingly disappointed that Wrestlemania 21 is several million leagues beneath PS2's SmackDown! series in both quality and play style.Yes it's simple and probably meant for kids, and you can get a small amount of fun out of Wrestlemania 21 for a relatively short period of time, but behind the shiny superstars it has a pork pie for a brain. That's the most positive thing we can say, sadly."}