{"ref": "https://www.eurogamer.net/destiny-2-review", "date": "15 Sep 2017", "game_name": "Destiny 2", "text": "Destiny 2 feels like an apology. It is the righting of the wrongs committed by the divisive Destiny 1, a game I couldn't help but pump a thousand hours into despite it often feeling like pulling teeth.The developers at Bungie, with Halo-fuelled egos dented from the mediocre critical reception that enveloped Destiny's delayed 2014 launch, have wiped the slate clean like a raid boss swatting away a troublesome fireteam. This respawned shared-world shooter sequel is the game Destiny 1 should have been, free from frustration, respectful of players' time and inspired in its level design.And yet I can't help but feel Destiny 2 doesn't quite add enough that is genuinely new to the Destiny mix for a sequel that arrives over three years after its predecessor. It's the one glaring issue that prevents Destiny 2 from joining the pantheon of the shooter greats.It is perhaps best to start with what Destiny 2 doesn't do, rather than what it does, so sweeping are its attempts to shove past indiscretions under the carpet. Destiny 2 doesn't tell a terrible story, as Destiny 1 did. The 10-hour campaign is leaps and bounds above the nonsensical mess that came before it. With a light-hearted tone and a handful of likeable characters, Destiny 2 takes the player on an enjoyable sci-fi romp across the solar system fuelled by an angry Cabal who reckons the Travelers's gift of immortality has made the Guardians soft. So he takes it away - and you have to take it back.We visit four brand new areas: what looks like post-apocalyptic Germany; a lost human city on the stormy seas of Titan; the mysterious Vex-infused Nessus; and the sulfuric yellow moon, Io. The story, which is let down by some Syfy z-movie dialogue and a handful of other, more forgettable characters, at least has its beginning, middle and end in the right order. Destiny 1's frankenstein plot couldn't even manage that.Bungie though, still seems to struggle with straight-up storytelling. Cutscenes are packed with eye-rolling exposition, no-one says anything particularly interesting and character development boils down to re-powering the de-powered Guardians - a well-worn trick that doesn't have the impact Bungie would like it to. The theme of mortality bubbles under the surface of Destiny 2's campaign, but it never reaches boiling point. I would love to delve deeper into Ikora's character as she struggles to come to terms with the loss of the light-giving Traveler and her newfound mortality. In the end she, like all the others, seems to have learnt a valuable lesson without having gone to class.What carries you forward is the fact that Destiny, like Halo before it, is the best-feeling shooter around. Guns pack a proper punch and super abilities rock the screen. The simple act of squeezing the right trigger is a joy, the console aim assist caressing the inexorable flow of bullets into the path of heads that pop with a satisfying burst of alien blood, their bodies exploding in a shower of particle effects, glimmer and, if you're lucky, an engram or two.Bungie is the master of tailoring a few minutes of frenetic combat to a fireteam of a few players. Things get hectic enough to require just the right amount of concentration to succeed. Use super powers, throw grenades, hide behind cover, keep an eye on your health bar and fire the right big gun for the job. In between the fighting, follow the waypoint marker ever forward. Destiny 2 is made up of four decently-sized open-worlds, but missions are entirely linear. Go here, activate that, defend this, put this ball in that hole, press forward. It's pretty mindless and nothing that hasn't been done plenty of times before, but it's all so silky smooth it's hard to tear yourself away from the television. Playing Destiny 2 is a bit like driving a brand new Audi along a quiet country road, its engine quietly humming, its steering wheel an extension of your hands.Then a stunning environment, a gorgeous vista or a level twist jolts you out of your comfort zone and all you can do is stand motionless in awe. Bungie's incredible art team has produced its best ever work with Destiny 2, creating a virtual world - well, four of them - that rekindles memories of the science fiction you imagined while reading books as a child.The highlight is the play space on Titan, an abandoned human colony that rests on crashing waves. Inside is the New Pacific Arcology, Destiny 2's best campaign level. Here the tone shifts as we descend deeper into the sinking city's innards, archaic public announcements now kicked back into life, lights flickering, futuristic floors giving way to creepy corridors. You go deeper underground (Bungie loves taking players down, down and down some more) until you grab what's needed and make for a dramatic escape via a surprising vehicle. This is up there with the best of Halo.There's an incredible sense of scale to Destiny 2's environments. The maps are massive, but, crucially, more densely packed than Destiny's and more encouraging of exploration. Eye-catching detail, from weird alien markings scrawled on walls to dimension-ripping portals, is everywhere. And graphically, Destiny 2 is a tour de force that benefits greatly from leaving the last generation of consoles behind. When I first set eyes on the crashed human colony ship on Nessus, its gargantuan rockets jutting out of the ground in the distance, I thought, blimey, this is what 700 developers gets you.Destiny 2, of course, is about so much more than its campaign. It is about loot and how it fuels the improvement of your character. Destiny 1's soul-destroying progression is ditched in favour of a relatively simple levelling up system that involves repeating certain activities on a weekly basis. Bungie has done well to increase the number of activities available compared with Destiny 1, adding variety to the post-campaign game in the process. There are Strikes (missions designed for teams of three players), Adventures (post-campaign story missions), Lost Sectors (multi-tiered mini-dungeons meant to be stumbled upon while exploring) and loads more NPCs to turn tokens into for reputation and elaborate exotic quests to toil over. They're all designed to randomly spit out slightly more powerful weapons and armour than you have currently equipped, and in the medium term at least, satisfy your rabid hunt for a higher power.Then the infamous Destiny grind returns, but it's much less annoying this time around. Like Destiny 1, Destiny 2 takes an average of the power level of each item to determine your overall post light level cap power rating, but this time you don't have to soldier through levelling up each item. This is a huge time saver and much more intuitive.Your power level rises fast after you hit the soft level cap, but progression soon slows as Destiny 2 funnels players through more difficult, endgame activities such as heroic Public Events, the weekly Nightfall strike, the Flashpoint activity and the Crucible. But the point to make here is the process is no longer abstruse. Even zipping about the world is easier. Bungie, clearly inspired by community created-apps that made playing Destiny 1 just about tolerable, marks upcoming Public Events on the map (now there's a map!) and lets you fast travel from anywhere to anywhere (no need to go to orbit first, thank god). These seemingly innocuous tweaks are a revelation for the long-term Destiny 2 experience, and are evidence of a developer that is willing to not just listen to feedback, but do something about it.Bungie has re-tooled the Crucible to feature teams of four rather than teams of six, and separated playlists into easy-going modes and hardcore PvP. It's an overall more strategic experience that seems designed for some sort of esports play. Super availability is clearly signposted at the top of the screen, and the time to kill has been reduced. In some ways, Destiny 2 PvP feels more like Halo than Destiny 1, which is very much a good thing. I'd hoped for meaningful vehicle combat, but alas it's nowhere to be seen. The wait for Destiny's take on the warthog continues...Destiny 2 is also more accommodating of players who might not have friends to play with or a huge amount of time to pump into the game. The Guided Games feature encourages highly-skilled players to help those who need it. Join a clan and you'll get nice purple engrams when your clan-mates complete endgame activities. In short, Bungie has opened up the progression process in clever ways. It still takes time to level up, but it's a more fun time. Destiny 2 is still all about making numbers go until they won't go up any more, but Bungie now officiates the process like a good referee - the fans don't notice because there isn't much to get upset with.Eventually, as your power level creaks towards 300, Destiny 2's raid presents itself. The pressure was on Bungie to outdo Destiny 1's Vault of Glass, which to this day remains one of the finest first-person shooter experiences ever. It hasn't quite managed that, but it has come up with something unlike anything else in Destiny 2, and that's very much a good thing.Leviathan is a golden puzzle box that sits on top of a galaxy-travelling world eater. It is a Terry Pratchett fever dream, a drug-fuelled Prince concert, a tumble up and down an M. C. Escher staircase.Destiny raids should be experienced unspoiled (your first time is always the one you remember), but know this: the Leviathan focuses more on puzzle-solving and execution than it does overwhelming waves of enemies and killing big bosses. It stresses your concentration more than it does your power level. It's as frustrating as it is thrilling.What's fantastic about Leviathan, however, is it makes sense. As you explore its maze-like interior you get the feeling the tunnels and rooms and corridors and were actually worked out in someone's garage on a dusty table with cardboard cutouts. It is consistent. This bit leads to that bit leads to that door that opens if we do that. If there is a list of wonders of the video game world, The Leviathan should be on it.Predictably, microtransactions return for Destiny 2, and they're a bit more problematic than they were in the first game. For one, Bungie points players to the in-game shop, called the Eververse, by handing out Bright Engrams occasionally. Shaders are now consumables, which means they're one-time use for individual pieces of armour. Bungie says this change is meant to encourage gameplay, but it's just annoying. And Eververse sells gameplay-affecting mods, which is a worrying start for the store. All this in a full-price game. At launch, I've managed to get on fine without dropping real-world money on in-game currency, but I am concerned that as Destiny 2 evolves, so will the pull of the Eververse.You won't find Zavala or Cayde or Ikora spouting their nonsense on Leviathan. You won't hear relentless exposition out of your plucky sidekick Ghost (who elsewhere in the game never shuts up). Leviathan itself does the talking. It is video game world building at its best. I have given myself over to Destiny lore, which despite the universe's reputation for poor storytelling is fascinating, complex and super cool. I want to know more about the Traveler. I want to know what really happened during the Collapse. I want to know the true nature of the Darkness. My drive to keep up with the Joneses - aka my clan mates - in the loot race is matched only by my desire to learn more about this incredible universe Bungie has concocted. That is very much a good sign for Destiny 2.But Leviathan, for all its sparkling brilliance, does not do enough to elevate Destiny 2 to equal status with Bungie's very best. I just can't get past the feeling this sequel is a hugely successful refresh, but doesn't realise Destiny's potential. It is as good a quality of life upgrade as Bungie could be expected to deliver, with almost every change unequivocally for the better. But where is the new class of Guardian? Where is the new alien race? Where are the six-player fireteam patrols?Perhaps we'll have to wait for an expansion or - gulp! - Destiny 3 for Bungie's Halo killer to achieve true greatness. See you in another thousand hours."}