{"ref": "https://www.eurogamer.net/r-coldwinter-ps2", "date": "8 Jun 2005", "game_name": "Cold Winter", "text": "When Cold Winter producer Ian Stephens told us a few months back that the Swordfish-developed first person shooter is ~for the European audience... it's a pat on the back for you guys,~ it struck me as a slightly odd, self-deprecating thing to admit, as if maybe we'd somehow get it more because it's got Tom Baker's menacing, booming, leathery voice narrating the cut-scenes or something. While, yes, Baker's nostalgic tones could pin us to the spot if he was the speaking clock announcer, there's nothing particularly uniquely British or European about Cold Winter. It's a polished, competent, traditional first-person shooter with the usual web of evil conspiracy to unravel, entire armies of minions to execute, exhausting amounts of stuff to blow up and some purdy physics to play around with. Things we're all abundantly familiar with.At the start of the game it doesn't look good for MI6 agent Andrew Sterling, as he gets thrown into a Chinese political prison for spying. With the British Government apparently happy to delete his files from the system and wash their hands of him (~as dead as they come, funeral honours, the lot~) he's forced to rely on friends in high places - or more accurately unhinged friends with their own agendas. Rescued by the lithe-limbed Kim - fellow secret agent - and subsequently hired by dour Scotsman Danny for his 'private security' firm, you're set off on a series of dangerous assignments to ultimately save the world from some nutter intent on giving the biggest firework display in history with his collection of nuclear weapons.From there on Cold Winter settles into the comfortable groove we've come to expect over the years; finding keycards, blowing up installations, scouring for intelligence documents, phone-tapping, and of course, being a one man army against a procession of hapless goons all too happy to act as gung-ho as possible in order to make us feel like the hero.Although the gameplay is immediate and familiar, the controls slick and the pace fast without being frenetic there are one or two things Swordfish has done to tweak the combat balance to interesting effect. For a start, Sterling has the curious (and slightly inexplicable) ability to heal himself indefinitely with his handy everlasting medipak. Although this sounds ridiculous and a bit of a cheating fudge on Swordfish's part, the downside of administering it puts you out of combat action for a good seven seconds, which in the middle of a tense firefight is more than enough time for you to bite the dust if you don't creep off somewhere quiet first. After the initial guilty feeling about having infinite health dissipates, it's actually not a bad balancing act - believe it or not. Unlike so many shooters we could mention, the AI does actually bother to hunt you down, does take evasive cover, occasionally outflanks you, and appears in great enough numbers to cause more than a few headaches once the difficulty level ratchets up a few notches (around about the fifth level, as it happens).The enemies are pretty deadly in terms of accuracy too, and are no mugs. One thing worth mentioning at this point is to discount playing the game on the suggested ~Normal~ skill level, as it really does feel like most FPSs' Easy level; enemies can be shot down far too easily and on the flip side you can afford to take a hilarious amount of shots in return. Do yourself a favour and give yourself something vaguely resembling a challenge or else much of Cold Winter will feel like a procession on God mode. Enemies behave pretty realistically, stopping to reload (hallelujah, an FPS where they run out of bullets too!), taking up intelligent cover and not simply running around like headless chickens into walls and the like. Admittedly there is room for improvement - we still have the lingering suspicion that we should have had to work harder for our kills - but so few console FPSs seem to be designed that way. Ultimately it is something of a shooting gallery, it has to be said, but it grows into an enjoyable one when it starts piling on the pressure.Cold Winter provides an interesting incentive to kill everything in sight by hiding goodies on corpses. Unlike most FPSs, you must search every single one individually to gain their body armour and assorted clutter. Although it seems a tad unnecessary to have to manually search everything just to pick up the sort of stuff most games let you collect automatically, it does become a necessary evil when the going gets tough, with success or failure often directly proportionate to how much extra protection you're lugging around with you. We're still not sure how adding little bits of damaged body armour to your person would help you though, to be pedantic about it. [Didn't stop us liking Doom ~Armour Shards~ III! -Tom]Cold Winter also has plenty of good intentions in giving you the option to create lockpicks, molotovs and even motion-sensing bombs out of sticky-backed plastic, but the truth is you don't really ever need to bother too much. Most levels can be quite successfully navigated by simply sticking to your regular arsenal without meddling in sub-menus to enhance your death-dealing powers.In fact good intentions abound everywhere in Cold Winter. At certain points it looks absolutely fantastic, and other times bland, angular and uninspiring. What gives? In its favour the Karma physics implementation gives license for some superb one-off moments where cars and handily placed gas canisters are firing off into the air, creating some of the best explosions we've ever seen in a PS2 game. Throw in some excellent particle and smoke effects and it's a mighty scene of chaos and death. Then ladle on the most gratuitous gore seen since Solider Of Fortune spurted headless claret all over out monitors five years ago and it's bordering on insanity. After each level you are rated in terms of completion, but bizarrely even near-perfect performances are given insulting gradings - and it seems there's little incentive to do better anyway. What about unlockables for getting X percentage of headshots and so on? A missed opportunity that ultimately dulls the replayability that games like TimeSplitters thrive on.Where it also falls down is the occasional ropey frame rate when things get crazy, and an oddly alien character art style that does them no favours at all. It's not that they're badly animated or anything; they just don't look all that appealing to these eyes, and coupled with some occasionally uninspired environments with that typically blandly textured look that have blighted PS2 games all along it can be a bit of a strain on the eyes. But, as we said, then you reach a section elsewhere that's really kicking out all sorts of impressive tricks that show off all the hard work and display how well the Renderware tech was pushed; it's just a shame it's not consistently brilliant. For example, where's the widescreen support chaps?Another area that veers between majestic and ordinary is the audio. The music, for starters, deserves a special mention for helping to drive the action with its atmospheric but not overbearing style, the sound effects are sadly a bit on the anonymous side, while, in terms of the voice cast, it probably goes without saying that having Tom Baker in your game automatically grabs the attention of most sane-minded gamers. What he's actually reading out could be the biggest load of drivel ever (which it's not, incidentally); but somehow his assured, stern delivery gives it an impossible degree of authority and shows exactly why good voice actors make such a world of difference. It's a shame that he's not actually the lead character as producer Ian Stephens lead us to believe, but instead acts as narrator to the between level cut-scenes. Elsewhere, the Sterling voice actor does a good Sean Pertwee-in-a-bad-mood impersonation, while Danny is as Scottish as heart disease, and has authentically foul mouth to prove it.As British-developed games go, Cold Winter easily has some of the best home-grown voice work we've heard. It never tries too hard to play up to the sort of teeth grinding stereotypes we have to put up with and is never afraid to pepper the dialogue with expletives without resorting to Getaway levels of stupidity to make its point. Its dry humour makes a real change (When Danny notes his rescue is all down to money he quips ~You tight f[lippin] tw[i]t! Are you sure you're not Scottish?~) and is something we could do with more of in videogames. Another plus is that the characters themselves are refreshingly unstereotypical gaming 'heroes', never straying into cliché territory - and deliberately so, with Swordfish desperate to try and sidestep all those horrifying clichés that dog most action games. It's all the better for it, even if it might take you a while to acknowledge its slow burn way of doing things.On the other hand, try as they might, Swordfish's plot - when you break it down - is hardly brimming with originality and struggles to truly engage at times with its somewhat hackneyed reliance on globe trotting around the world on the trail of a nuclear weapons-wielding madman. ~Anti Social, Anti Normal, Anti Bond, Anti Hero~ says the blurb, but you really could be playing as anybody; outside of the cut-scenes the game lacks personality, and your ability to engage with it is hardly helped by not being allowed to repeat cut-scenes you may have missed for whatever reason. Fortunately, like most FPSs you're usually far too immersed in the action to really care either way. Still, it'd have felt a far more rounded package if we really cared for this giant conspiracy that the chaps up in Birmingham evidently tried hard to make interesting. After the 10/12 hours of action you're left to reflect that there's much to admire here from ~the last great garage team~, but that it ultimately needed more resources thrown at it to take it to the next level and make it one of those ~must buys~ that we love raving about.But it's not all about the single-player mode, of course. The diverse multiplayer modes promise to add a great deal to the value of the package for those that enjoy taking their skills into the split screen and online arena. We're actually taking the unusual step of playing the online modes in the real world (with the Swordfish chaps on Monday morning, as it happens), so we're holding off delivering our thoughts on this mode until we've had a chance to put it through its paces, but what we've seen so far looks flexible and expansive, with many interesting modes to play around with.But it's not all about the single player mode, of course. [Great link. -Ed] The diverse multiplayer modes genuinely add a great deal to the value of the package for those that enjoy taking their skills into the (four-player) split-screen and (eight-player) online arena. As PS2 online shooters go there have been few as fully-featured and customisable as Cold Winter, and having sunk several hours into the various modes it adds up to an excellent addition to the package that is a great excuse to dust off your network adaptor and fire up the PS2 online service.12 well-designed and varied maps make it into the package; with all but one being reworked maps from the single-player game and all serve as tightly designed arenas that work well within the confines of eight player games (with some evidently designed for four players). In terms of modes it features all the favourites (and team-based equivalents) that we know and love, including - of course - Deathmatch, King Of The Hill, Flag Tag, Last Man Standing, Domination and Headmatch (run around with a delightfully dismembered head for points).But the interest value comes not from dozens of modes (which are generally small variations on a theme anyway) but from the ability to customise all of them to the point that you can basically create a multiplayer experience tailored specifically to your taste. For example, a slick weapons loadout system allows you to predetermine exactly which of the 30 weapons you want to appear on the map in their various slots, while Swordfish has also allowed players to set how strong the damage will be from the weapons in three grades, allowing players to vary the style of multiplayer game from the one shot kill style mechanics of games like Counter-Strike, right down to the kind of game where stalking and chasing down your opponent is more important. There are even 30 skins to choose from, friendly fire toggles, player handicaps so it's definitely not short of options to tweak if that floats your boat.With full voice communication support you can bark orders and warning to team mates, or gleefully taunt opponents in the free for alls, and we're happy to report an almost entirely lag free experience which gets underway remarkably quickly and is easily as slick as most Xbox Live experiences we've had with online shooters. Interestingly, the gameplay mechanics are affected subtly by giving the player the ability to see where team mates and enemies are via colour-coded distance nodes that show up in relation to where they're positioned on the map. Running players can be detected automatically, while crouched walking players remain invisible, giving the game a delightfully tense layer of strategy that tends to kick in once everyone's familiar with the intricate map design and stops running around like headless chickens.Perhaps the Swordfish chaps could have made more effort in terms of providing a more detailed statistical breakdown of your efforts post-match, and in terms of multiplayer modes does stick very much to a well-worn formula, but these are fairly minor gripes in truth. Probably the biggest challenge you'll face right now is finding enough opponents to play against, although that should be less of an issue once word of mouth spread. In most areas that matter, though, Cold Winter gets it right. Even if you're not online, the presence of an offline four-player split-screen gives you plenty of opportunity for post-pub antics, and we're happy to report the engine holds up well against the strain with minimal frame rate loss. As a homage to GoldenEye it's probably the closest anyone's ever got - in spirit, if not in execution - and that's a compliment if ever we've heard one. Shame that the lack of an identifiable brand name will probably give this far less exposure than it deserves.In terms of how it ranks as a PS2 shooter, it easily trounces the more high profile big budget releases such as Rogue Agent and Killzone, and in many respects is a far more satisfying single-player experience than even TimeSplitters Future Perfect. On that note, Cold Winter felt at times like a dark TimeSplitters, almost GoldenEye-esque in feel and certainly deserves much credit for delivering an accomplished alternative that hits the mark enough to warrant a recommendation to those that hunger for a decent PS2 shooter. It's troubling to admit that it just needed that extra bit of polish to elevate it to the giddy heights Swordfish probably deserved for all of its (cough) Sterling efforts."}