{"ref": "https://www.eurogamer.net/r-kingdomhearts-gba", "date": "7 Jun 2005", "game_name": "Kingdom Hearts: Chain of Memories", "text": "Out of all of Square Enix' impressive catalogue of RPGs, Kingdom Hearts ranks as perhaps the most surprising. Few fans could help groaning when the company announced that it was to create an action RPG mixing up characters from across the Final Fantasy series with environments and characters from Disney movies. Disney, after all, has a fairly unimpressive track record in videogames, and the company is noted for being incredibly precious about how its franchises are used. A tame, bland, kiddy-focused RPG seemed inevitable. Fanboys spat their derision on web forums the world over before the first screenshots had even appeared.How wrong they were. Being entirely honest, how wrong we were. I certainly wasn't innocent of turning up my nose at Kingdom Hearts initially, and it was only watching the fantastic intro video - a surprisingly dark and interesting teaser set to the melodic tones of Japanese pop goddess Hikaru Utada - that convinced me to give the game a try. Quite a few people probably didn't, and in the process missed out on an intelligent, well-written, superbly produced and hugely entertaining action RPG. There were obvious flaws, like the somewhat repetitive combat, temperamental camera and downright awful Gummi Ship mini-games, but it was easy to gloss over those given the level of quality which dripped from every other aspect of the game.A sequel was inevitable. A GBA title was more surprising, and what's even more surprising still is that the GBA game ties in intricately with the storyline of both the original Kingdom Hearts and its forthcoming PS2 sequel, leading the player from the very end of the first game through to the beginning of the second.Once again, Kingdom Hearts Chain of Memories sees you taking direct control of Sora, the likeable and gutsy central character from the first game. Beginning literally at the very second where the first game ended, it takes the slightly odd approach of leading you through many of the areas which you visited in the original game, each reconstructed from Sora's memories as he searches the mysterious Castle Oblivion in the hope of finding a lost friend.As a result, many aspects of the game feel quite familiar. The areas you travel through are broadly the same, in art style terms, as those in the PS2 game - at least until you start hitting original dungeons later in the game. Everything is rendered in 2D isometric style, with sprite characters overlaid, but it all still looks great, with really nice backgrounds (aside from the occasional awful section, like the inside of the whale) and well-animated characters and attacks. There's even some video thrown in, including a lengthy and quite impressive FMV intro sequence, which is quite unusual to see in a GBA game.The characters will also feel familiar, as with the exception of some rather mysterious new arrivals (who also seem to feature heavily in Kingdom Hearts II, judging from the trailers), you'll mostly be encountering people you met before in the first game. Donald and Goofy are your constant companions (although oddly, not in battle - more about that in a moment), while exactly the same rogue's gallery of Final Fantasy and Disney characters as were found in KH also appear in Chain of Memories. This is a little disappointing, in ways, but it would have been quite hard for the developers to do otherwise given the way the plot of the game is developed.The biggest change to the game is the introduction of cards, which are important for two reasons. Firstly, you use ~world cards~ to effectively construct the world that you move through. That may sound complex, but it's not really - all these cards do is determine whether the largely pre-set rooms you move through are full of weak enemies, strong enemies, shops or even save points. You pick up these cards from battle, and every time you reach a door, you select a card to decide the nature of the room that lies on the other side. However, the game is still essentially linear, and each zone features a number of special doors which can only be opened with specific cards - which boils down to you having to pass through each of these doors in the correct order, as behind each one lies a key section of plot.An entirely different set of cards form the basis of the combat system, which takes the slightly unusual approach of being real-time but still based on cards. At first, the combat is disappointingly simple - your deck of cards consists entirely of simple physical attacks, and you'll spend most of the first zone in the game just running around hammering the attack button. There's some basic strategy here, as each card is numbered from zero to nine, and when your enemy plays a card at the same time, the higher numbered card ~wins~, but in reality combat is normally too fast to pay much attention to this. Thankfully, things start to get a lot more interesting fairly soon, as the game introduces a number of special attack and magic cards, and most importantly, the concept of combining cards for more powerful attacks rather than just firing them off one by one.The card combining system is at the heart of what makes Chain of Memories' combat so much more entertaining than it was in the original Kingdom Hearts. You shuffle through your deck with the left and right triggers, and can use a single card (an attack, a heal, whatever) by pressing A. However, pull both triggers and you add the card to a pile at the top of the screen instead, where you can store up to three cards, and then use them all at once by pulling both triggers again. Normally, this just executes the three moves in order, but as you progress through the game, you'll find that certain combinations of cards create special attacks, or powered up versions of the original spell - such as using three Fire cards to create a powerful Firaga attack, or three physical attack cards with face numbers adding up to a certain total to perform a sliding tackle.Of course, it's normally difficult to create these combos while you're running around in a battle trying not to get smacked down by the shadowy Heartless, so a major element of the game involves arranging your deck of cards so that the right cards are next to each other and you can just tap buttons to fire off your best attacks. That element is a lot more fun than it sounds, with a real puzzle game feel to it, but it's something potential players should bear in mind - this is certainly a more cerebral game than the button mashing fest that was the original Kingdom Hearts.It feels slightly unusual to be talking about a GBA game in terms of how it improves on its PS2 predecessor, but that's exactly how Kingdom Hearts: Chain of Memories feels at times. The characters are a little more developed this time around, the enemies feel a little more human and if the plot is a bit weaker - recapping the events of the first game in this way is slightly annoying, even if it is a genius way to get new players involved in Kingdom Hearts just in time for the second PS2 game - it's made up for by the much better battle system. The production values, of course, are superb, and the game boasts great graphics and artwork, impressive full motion video sequences, great dialogue and a slick interface. We missed the excellent voice acting from the PS2 game, of course, but on a GBA title that really is like asking for the moon on a stick.There's no doubt that Chain of Memories is a game which any fan of the original will find hugely entertaining, and for new players it's a great way to get up to speed on Kingdom Hearts. However, while the improvements are welcome, this is still a game with some major flaws. The battle system is a lot better, but not quite there yet; it feels somewhat too fiddly at times, and ultimately we've seen far better real-time battle systems in the last few months - Tales of Symphonia, anyone? The procedure for constructing the world map using cards is cool, but occasionally trips up, and a frustrating half hour was spent at one point searching for a specific numbered card to open a random door and continue through the game. Finally, well, the plot really is a touch weak if you've played the first game already, although it's worth persevering because in the latter stages of the storyline, things get a lot more interesting.A worthy sequel to Kingdom Hearts, then, and one which makes us salivate even more at the prospect of the excellent looking Kingdom Hearts II later this year; and a really excellent GBA game which pushes the little system to a degree that few games have tried. We only hope that Chain of Memories isn't overlooked in the excitement over the Nintendo DS and PSP, because despite being on an ageing system, it's definitely one of the best handheld games we've seen in recent months."}