{"ref": "https://www.eurogamer.net/r-pariah-x", "date": "7 Jun 2005", "game_name": "Pariah", "text": "If you're going to try and compete in a genre as saturated as the sci-fi shooter, it's a good idea to make your game stand out.Make it the best looking with astounding boundary-breaking technology that really brings it to life, give it a gripping story that drives players through the game, make sure the combat's intense, challenging and realistic, and score it with drama and flair. Give gamers no choice but to buy your game, and leave critics breathless with enthusiastic excitement.The problem for Pariah is that it fails to even come close to matching any of these benchmarks, never mind bettering them. It's a game that's really very hard to get excited about. Solid, but so very unremarkable, and beaten to the punch in so many areas that makes it hard to recommend to all but the most hardened shooter aficionado.The game starts in pretty inauspicious fashion, and does little to drag itself out of the mire. Veteran developer Digital Extremes plays by the rules throughout, never daring to try much of anything new, never infusing the game with real excitement, baffling the player with an instantly forgettable and unengaging tale, providing a done-to-death arsenal of fairly limp weapons, populating the world with faceless, predictable AI and decorating the whole thing with a tired, bland world that can't hold a candle to its competitors.It's not a bad game as such, but you'd have to be a forgiving soul to want to shell out for something that's so comprehensively outclassed by its competitors. Gamers deserve more for their money in short, and at best it's a title you'd spend a few quid on renting.The basic premise, for what it's worth, is that you fill the boots of Dr Jack Mason, seemingly stripped of his duties following a court martial and tasked with transporting a virus ridden woman named Karina who has been cryogenically sealed to stop the spread of her deadly germs.But it all goes horribly wrong when the ship Mason is travelling in gets shot down, and in the maelstrom Karina gets captured, Mason gets infected and off you go to track her down. Despite having zero military training, and doubtlessly reeling from the shock of a high impact crash, we're expected to suspend our disbelief that Mason can then handle any weapon he comes across and take out a bunch of well-drilled soldiers armed to the teeth. Interesting.Pedantry aside, the game simply plods meekly from one section to the next around regulation rocky terrain, via standard-issue futuristic industrial bases (set on Earth, although it literally could be anywhere), mixing up its indoor and outdoor sections in fairly equal doses with little to surprise or delight you at any point, relying on far too many sections featuring those clanking metal walkways that every single FPS ever made seems destined to feature at some point or other. Occasional on-rails sections or driving do admittedly break up the run-and-gun slog, and provide a mini respite from the tedium, but even those can't help but remind you of a certain Bungie title that helped sell the Xbox.Much like Halo, the checkpoint save system is in evidence while the health system is basically identical, with the need to scurry away to recharge a damaged 'unit' when you cop enemy lead, but that's more or less where the more obvious comparisons end. A few new features make it into the mix, but you can't help but feel that few of them represent real progress.For example, while the need to manually administer health via a Health Tool that you press into your wrist sounds like a decent alternative to picking up those oh-so-handy medipacks that you see in most other FPSs, in real terms it become an irritation. Having to swap your gun for the tool, spend precious seconds recharging health and then swap back to your weapon does change the combat dynamic somewhat, arguably making it a little more strategic in a sense, but having to do it dozens of times is just plain annoying.Probably the most welcome new feature that Pariah offers is its weapons upgrade system, which more FPSs should adopt in our estimation. Picking up special Weapon Energy Core tokens (often in out of the way locales that require a bit of sniffing out) gives you the opportunity to enhance the abilities of the weapon of your choice up to a maximum of three times for each. For example, the Grenade Launcher adds things like a Remote Detonator, Fragment Attractor and Target Leech, while the Sniper Rifle adds Enhanced Vision, Expanded clip and Armour Piercing rounds. It's definitely a worthy addition, and makes real difference just when enemies start wielding shields, firing flame throwers or launching rockets in your direction.But the real letdown is the standard of the combat in general. Certain weapons in the game - like the Grenade Launcher - are disproportionately powerful, and arrive too early in the game. Being able to waste literally a whole crowd of AI with one well-placed shot, or take down enemies from afar with one shot from the sniper makes for a fairly humdrum experience.Even when you use the more up-close-and-personal weapons like the Assault Rifle, Frag Rifle or Plasma Rifle, the AI behaviour is predictable to the point of making the game like a shooting gallery. Enemies either charge you like suicide bombers or flee behind cover before returning for a charge. Either way they're far too gung ho to prove to be worthy opponents, and really don't inspire much in the way of interest - even when you get the chance to see the now-standard issue Havok physics in action.Even the artistic direction lacks the inspiration of its peers, with the game generally lacking variation, making it feel rather like Killzone where you end up slogging through much of the game picking off rather similar-looking AI. At least Killzone you had to work hard. Pariah doesn't.Much like other regular shooters, it's another game where it's simply a procession. Clear one area, move on, flick switch, activate more drones, wade through those, and repeat to fade. There's literally nothing more going on that doesn't involve mowing your way through a linear path, and hitting one switch after another until you move onto the next section (18 in total). The on-rails sections never prove to be exciting or bombastic (as per, you just move the crosshair from one obliging enemy to the next), and on repetition prove to be utterly scripted anyway.It soon dawns that Pariah is your archetypal regular, by the numbers sci-fi shooter and doesn't appear to aspire to be anything more. It just wants the dollars of those millions of Halo fans that are wanting something new and are happy to accept relatively mediocre substitutes. Let's qualify that by saying it's still not a bad game, again; more that it simply suffers by being held up against some stiff competition. In 1998 the world would have probably loved Pariah, but the world has long since moved on to much better things.If you're still looking for solace, there is always the presence of multiplayer to offer a little extra value for Xbox Live subscribers (with System Link and two player co-op split-screen also supported). Again, it's regulation multiplayer stuff, with nothing deviating from the classic Deathmatch/Team DM/CTF/Assault/Siege lineage we know and love. Much like the single-player game, it's a case of been there-done that, although it does get a mini thumbs-up for bothering to include bots, with scalable difficulty. A pretty slick map editor also offers the chance to make your own and swap them online, and really does let you shape and build quite complex levels surprisingly well, and can support up to 12 players. But is it enough to warrant your cash?Well, enough of you have bought it anyway that it's already been propelled into the UK Top 10, but if you were biding your time for a few more reviews to appear our advice is to check it out first. Get a demo, or rent it to find out if you thought it was as uninspiring as we did. Pariah certainly isn't committing any real gaming crimes in what it's doing, but suffers a harsh fate for coming out just on the cusp of the next generation and looking like a tired me-too effort that does virtually nothing that half a dozen other similar games haven't already done far better."}