{"ref": "https://www.eurogamer.net/r-mohpa-pc", "date": "12 May 2005", "game_name": "Medal of Honor: Pacific Assault", "text": "Order yours now from Simply Games.After such a resoundingly disappointing demo release a few months back it's fair to say that the long-awaited second PC Medal Of Honor had somewhat fallen off our radar. We'd probably go so far as to say that we were fully expecting Pacific Assault to be - at best - generic, scripted, corridor-based fare, and at worst a disgrace to the brand in the same way that Rising Sun completely insulted the intelligence of any right-thinking gamer. We awaited the results of EA LA's four-year long toils with the bated breath of underachievement.We needn't have worried. Pacific Assault, while not breaking ranks from anything that made the series such a commercial draw for gamers fond of its bombastic, cinematic style, has so much going for it that it's a genuine puzzle how EA managed to instil so much fear among the very people rooting for it. Clearly 2015's departure a few years back can't have helped a great deal, and no doubt added at least an extra year to its prolonged development cycle, but next to Men Of Valor we know which we'd rather play. Pacific Assault, without doubt, is among the best FPSs you'll play this year.While we're happy for you to draw an audible gasp at such a bold statement, allow us to prepare you for this shocking revelation by filling you in on some of the basic background. Set - surprise surprise - in the Pacific Theatre of World War II 1941 to 1944, the premise is ostensibly similar to Rising Sun. Filling the boots of Marine Trooper Tommy Conlin, you and your invincible platoon follow a typically brutal against-the-odds campaign against the Japanese, taking in the initial assault against Pearl Harbour in December 1941, and progressing to Makin Atoll, then onto the tropical island of Guadalcanal, before climaxing with the beach assault of Tawara.After the flash forward false start in Tawara we get an annoyingly unskippable Boot Camp training exercise before an innocuous jeep ride around Pearl Harbour HQ comes to an abrupt halt with the relentless arrival of dozens of Japanese bombers intent on razing the whole place to the ground. Much like the beginning of Rising Sun, we then get an extended opportunity to dodge lead and admire the exceptionally pretty scences of carnage on the trademark on-rails shooting section, before boarding a sinking boat to rescue numerous sailors from burning to death.Up on deck we emerge somewhat bamboozled by the flames and explosions, only to oblige with a spot of plane shooting with the standard issue mounted cannons. So far so predictable. It's not until your deployment in Makin Atoll that the game really comes into its own in the dense, dangerous jungle environs with a series of deadly but hugely impressive sorties that instantly reveal just how far EA has come with the brand, both in terms of its outstanding visualisation of the conflict and the consistent suspension of disbelief from both sides of the AI war.Far surpassing previous MOH titles and topping even the excellent cinematic achievements served up by breakaway team Infinity Ward (Call Of Duty), the depiction of the battles throughout the game are a huge leap forward for war-based shooters, largely thanks to some evidently sophisticated AI behaviour that warrants serious applause. The range of animation and the dynamic responses from both sides have to been seen to be believed; marines creep along in hunched formation, each taking up convincing cover, rarely if ever bumping into objects or each other, traversing obstacles with ease and barking a multitude of orders and observations every step of the way. Pressing the attack or falling back when outnumbered, tackling enemy with real skill and precision, the feeling of being involved in a real battle is nailed right from the word go - and far more convincing a display of buddy AI than we've ever had the pleasure of witnessing in any game of this type.The Japanese foe too puts up an often (but not always) masterful display of tactics, flanking weaknesses and taking the opportunity when present to rush screaming right at you with their Bayonettes wielded high above their heads. Their deadly precision is only occasionally marred by some sloppy detection and unwillingness to flee when their own lives are clearly in danger, but we suspect much of their weaknesses are there to give the player a decent shout rather than flaws in the AI itself - you have to draw the line somewhere, and the challenge presented on the default Normal level is well pitched, being a marked cut above, say, Halo 2's supposed 'Normal' difficulty.And the high quality AI would be nowhere near as impressive as it ends up being were it not for the outstanding capabilities of the graphics engine, which - when maxed out - features some quite beautifully crafted character models not only exquisitely and uniquely detailed with some finesse, but animated to a quite remarkable level. Even small touches such as bullet impact, dodges and the grisly death animations are far beyond what you'd normally expect, and seeing a soldier writhe in pain shortly before giving up the ghost is almost harrowing in its intensity. The typically sanitised lack of gore reduces the full impact of what could have been a quite sickeningly brutal game, but there's arguably quite enough death without psychologically scarring the player for life into the bargain. Leave that to the less wholesome publishers.With decent AI and animations, you'd expect various chinks in the armour to appear, but in fact the whole things hangs together incredibly well with a game engine which puts even the likes of CryTek's Far Cry engine to shame in terms of just how beautifully the incidental scenery is rendered, with an immense amount of foliage providing one of the best FPS playgrounds ever and at the same time giving a glimpse into what Medal Of Honor games may end up looking like on next generation consoles. Imagine the disappointment when we had to duly report to a console owning MOH fan that this wouldn't be appearing on their machine. For EA, Pacific Assault is just as much about the future technology of the series as it is about re-establishing the brand's presence on the oft-overlooked format.On the other hand, unlike the more ambitious games out there, the inability to take different paths (as was one of Far Cry's strong points) still gives the impression of being shoehorned along and lead by the nose in the usually patronising manner that EA insists upon even now - and on a platform of such possibilities, it seems a massive shame that EA didn't take the opportunity to break free from the shackles that previous games in the series appear to have imposed upon the design. It's probably fair to say that scripted linearity is more at home on consoles than it is on the PC, and some PC players will feel both hindered and tired of being manipulated to an extent that is now demanded of them elsewhere.As valid a criticism as scripted linearity is, though, it's not a point we'd choose to labour this time. Pacific Assault gets away with it by making virtually every battle feel as intense as the last, and has the player scrapping away tooth and nail, desperately clinging onto their last scraps of health before they call over the medic for a quick patch up - an healthy innovation pinched wisely from Vietcong, and somewhat more realistic than constantly ferreting around for medipacks.For a game as regularly spectacular as Pacific Assault, you don't actually mind too much that its path is already pre-determined. The dynamic AI behaviour more than makes up for the ability to approach each mission in a different fashion. If anything the way each mission pans out can vary quite dramatically, depending on how you've chosen to fight it, and on a few memorable occasions doles out 'Hero Moments' if you take the time to, for example, creep your way past patrols unnoticed. Although the rewards for these acts of heroism are pretty limp, it certainly adds a degree of replayability sorely lacking from most FPSs these days, and we welcome it.Typically, EA isn't prepared just to give you a bog standard shooter, so the team throws in a fair bit of variety when it feels like a change of pace. Like manning a gun emplacement for a bit to shoot down the Zeroes (one of the most bloody-mindedly tough sections in the whole game), then doing the same in a boat, or putting you on board an aircraft shooting bandits out of the sky. Taking control of a plane itself, though, is ill-judged initially, thanks to a control system that you're given absolutely no tuition on. Once you've learned the ropes, it's actually a fairly simple diversion, but getting to that stage of proficiency might be a steep road for some, and having been caught out by a particularly evil bug which required replaying this section, we can report we were much happier once it was all over and we were back on the ground shooting people in the face with a sniper rifle.Elsewhere, the game plays out much as you'd expect a Medal Of Honor game to. Full of 'destroy the emplacements'-type tasks, and 'clear the village' trawls, you're never in any real doubt what you're in for. Even the addition of the much-vaunted squad command system is a bit of an underused addition, which, in truth, you can practically get away with not using once. It doesn't appear to make too much difference either way, especially when your invincible squaddies seem to be quite happy left to their own devices. Frankly we're glad this was the case, because endless squad micro management would have changed the flow entirely, and in the end we were grateful just be able to solider on alone, happy in the knowledge that our team would be picking off a few enemies while we struggled around on limited health.It's well worth giving the Pacific Assault's audio a mention too. As with the previous games in the series, the score almost writes itself - it's the usual sweeping array of string and horn sections that provide a suitably dramatic air to the proceedings - if not a startlingly original or standout one at that [I honestly thought he was watching Star Wars Episode II half the time -Tom]. The voiceovers are a mixture of brilliance and irritation. Team-mates will constantly praise you for your aim even when you yourself never made the shot, for example, but the general chatter is superb. As long as you don't plan to play the game more than once through, you won't get too irritated with the stock phrases being repeated over and over. In general, they're well chosen and context sensitive and really add to the sense of full-scale war, and the terrifying life-or-death urgency that comes with that.Outside of the main single-player dish, there are three multiplayer side portions to keep players going once the 12-15 hour (give or take) campaign is over. Free-For-All and Team Deathmatch you can probably guess are your basic 'kill everything that moves' modes that some people still haven't tired, while the third, Invader, is an objective-based mode, with the two sides of the war facing off across eight maps (for up to 32 players), some with the Axis on the defensive and others with the Allies performing this role. It's all pretty run of the mill stuff, with document raids, artillery destruction and the like providing probably the more interesting mode of the three. However it remains to be seen just how popular Pacific Assault's multiplayer will be, given that the game is going head-to-head with Half-Life 2, rather unwisely. As always your enjoyment is directly proportional to how much time you're willing to invest in learning the maps and working out all the relevant choke points and sniping positions. It takes something special to drag us into a game's online multiplayer mode for long, and at the time of writing the jury's still out on whether it will prove a long term draw. Why not play the multiplayer demo for yourself and be the judge?To sum up, although EA LA sticks to the Medal Of Honor formula, at least it has managed to genuinely take the series forward in technology terms, offering up much more engaging firefights than ever before, which are far less forgiving and require a hell of a lot more thought and skill than simply charging in like you're immortal. Long-term fans of the series will absolutely love Pacific Assault, and while it's by no means the best First-Person Shooter out there, it's by far the best game in the series, and a cut above other cinematic WWII pretenders by a significant margin. If you thought the Call Of Duty titles were impressive then you can't fail to enjoy Pacific Assault. With the exception of a few dodgy sections, it's masterful in places and for that EA deserves hearty applause for resurrecting a series that was in serious danger of shooting itself in the foot. Sometimes taking your time delivers its own rewards.Order yours now from Simply Games."}