{"ref": "https://www.eurogamer.net/r-thegetaway2-ps2", "date": "12 May 2005", "game_name": "The Getaway 2: Black Monday", "text": "Order yours now from Simply Games.~Eastern Europeans drunk on freedom~. That pretty much sums up what to expect from the latest Getaway title, the pseudo sequel that started life as an expansion pack and to all intents and purposes is exactly that. Dispensing with the East End old school violence of 2002's original and running with a more sinister, but somehow more faceless Eastern European theme, it's once again a semi-linear romp through a series of missions (22 this time) that don't quite match up in terms of intrigue, atmosphere or the tension that infused Team Soho's massive debut success.Wisely, but somehow unwisely, Team Soho recycles the London setting for the game. And herein lies the game's first problem, but perhaps also its saving grace: there's very little sense of novelty. We were truly wowed when we first drove around familiar streets, and for London residents such as us it's still impressive - but the wow factor is gone, and in truth we found ourselves becoming a little more picky with the fact that so much of the grand city is blocked off, with only the main arterial routes available to you. Also, this time around we were less inclined to forgive that huge sections of architecture have been crudely approximated; it's a game that can no longer trade on the fact that it's doing London. It needed to do London better and the fact that it's not really noticeably different to before in any meaningful way is something of an initial disappointment.What Team Soho hasevidently worked hard on this time is trying to vary what there is to do in the game beyond shooting and driving. The first thing to notice is the use of multi-level architecture on all of the interior locations, and starts the game as it means to go on, with a drugs bust on a block of flats quickly progressing into a dramatic rooftop chase with the kind of action that would put Bodie and Doyle to shame. The incidental music's ripped straight from The Professionals at any rate, although the language would make Dennis Waterman blush.Another appreciable difference is the learning curve - the game's a hell of a lot easier than previously, and it's no exaggeration to predict that most players will tear right through all 22 chapters in well under eight hours (assuming they don't come across the bug in Chapter five that fails your mission every single time, telling you you've run out of time when you reach your destination even if you've arrived before your target, bizarrely). With the exception of one annoyingly precise stealth mission, the rest of the game is alarmingly easy - with at least half of the chapters completed on our very first attempt.At least Black Monday's not so frustrating, then, which was something that killed many people's interest in the original's overly exacting mission design. But what's worse? Frustration from missions rich with intrigue and atmosphere? Or the mild disinterest of being able to just romp through, shooting samey looking enemies in the face with an overly generous lock-on facility that all but guarantees success? But let's in not pretend that Black Monday is immune from frustrating mission design. The stealth sections stand out as fiddly and poorly designed, with pathetic AI behaviour about as convincing as trying to avoid the gaze of a stone statue, and control quirks that make it strangely difficult to crawl through passageways, yet worryingly easy to mount yourself up on a wall in a Sam Fisher-esque manner. Daft.To keep the annoyance theme running for a bit (because we're no way done yet), in design terms the driving sections seem to vary between mildly irritating and just plain disastrous, with the worst excesses of the original returning in force. Did Team Soho not listen to any complaints about this side of the game? Where do you start? The handling model is still a total mess. Every vehicle feels like it's permanently aquaplaning, and tiny steering adjustments at speed are likely to have it lurching uncontrollably, leading to over-correction and an inevitable high-speed rendezvous with anything solid in the vicinity. Team Soho has, notably, tried to work around this inherent issue by slowing down the vehicles you chase, but this backfires almost comically. One so called 'chase' mission has you driving at no more than about 20 miles per hour. It's as if the team did realise how little fun it is to put the pedal to the metal, but only managed to make the game look stupid in an attempt to fix it.On the rare occasions you do have to really go for it the game puts you on the straightest roads to make sure it's attainable, but the minute you have to negotiate bends it's in the lap of the gods, with cars swerving right into your path. That's not to mention the missions where you're simultaneously the pursuer and the pursued. On more occasions than we can recall, you find yourself being trailed aggressively by both the Police and Russian gangs, while also having to keep up with someone else. It's a farce, with the whole of London's Police apparently out in force, not to mention dozens of machinegun-wielding morons who, having appeared from nowhere, also have the world's best acceleration at their disposal to catch up with you instantly. It's so hopelessly ill-conceived and contrived as to just be a hilariously bad example of how to design car chase missions. At best it's amusing, and thankfully not all that difficult to work through.On the other hand, compared to the original the actual driving is far less frustrating on the basis that you can refer to a map by just pressing the Start button, and the actual routes don't seem to be as insanely long, while your car seems to be able to withstand more damage than before. But it's still a tragic spectacle, whatever tweaks the team's made. Note to Sony: rubbish handling plus moronic AI plus ridiculous quantities of enemy does not equal a compelling gaming experience.So, okay, we've established that London's barely changed, the stealth bits are somewhat annoying, the driving's still not up to much (although at least is a bit easier), but what of the bits when you're not driving like a psycho in a city of lunatics flipping out at a Road Rage convention gone wrong? Well, on-foot missions follow a fairly consistent pattern: enter room, tap R1, tap square and pick off whoever's in your way, clear room, move on, repeat until the inevitable cut-scene kicks in. With a fairly forgiving health system that once again has our 'heroes' able to rest up against a wall to heal their wounds, and a few handy wall-hugging stealth manoeuvres that let you pop a cap in whoever's around the corner, it's not the sort of challenge that will require much more than a modicum of skill to master.For some ungodly reason, though, Team Soho still insists on wrapping the third-person camera in a straightjacket, and not allowing the player to use the right analogue stick to dictate the view more than a few degrees in any direction. Although we put up with it in the first game, after 50 hours of San Andreas recently it snapped into sharp focus the folly of using this system. It may well make things slightly easier for inexperienced gamers, and make sure you can't completely lose it, but it causes all sorts of other problems. The auto target often refuses to acknowledge a clear target and it's missing basic fundamentals like allowing you to peek around a corner like you can in every other third-person action game. For a reason. It's fair to say that you do get used to it, and it's not a major pain, but why not just give players the choice? Going wilfully against the industry standard is the quickest way to alienate players right from the word go. It's a recurrent theme in The Getaway; Sony manages to break things that didn't need fixing, with an approach that just goes against common sense.Another small issue we constantly came up against is the way that missions are so badly explained, often forcing you into a game of trial and error to work out what you're supposed to do. At one stage midway you're tasked with retrieving a laptop in a rather large building. But from where? Either we weren't paying close enough attention or it just assumed we knew, but nevertheless for a good half an hour or more we trawled around looking in every nook and cranny just in case. We were utterly through when at one stage our character blurted, ~There it is~. What? Where? And what's more exasperating is the fact that it wasn't there anyway. What a joke. And it doesn't end there. Virtually every single mission you find yourself quickly checking back to the mission briefing to work out what you're actually supposed to be doing, but when you do it's usually no more than a one-line description with no real context.The main reason for this is the cut-scenes and storyline, which while very well scripted and voiced, just don't engage as much as we'd hoped. There's no option to replay cut-scenes when they're gone (unless they happen to be the first part of a chapter that you're replaying), and unless you're one of those people that can memorise everything they watch the first time they see it, it's gone and that's that. As a result, we managed to lose track of why we were even chasing after certain people. It's not a great position to find yourself in during a game that's so narrative driven; some sort of text-based system in the menu that lets you read through recent dialogue (a la GTA) or some kind of verbose text-based brief would have helped a great deal.But it doesn't really matter a huge amount. The whole Eastern European gang thing... The villains just didn't seem that evil, and in any case we didn't really get a feel for what it was they were doing anyway, or what their motivations were. There's no sense of ultimate evil that dominated the first one, and the way Eddie and Mitch's storylines interweave just doesn't feel as satisfying or as coherent as it did last time around, and the characters just didn't get our sympathy, and weren't really that likeable. We wanted to like it, honest; the last time out it was almost a desperation quest born out of something you could really relate to and wanted to seek vengeance for. The tragic thing is that we just didn't care this time around.And so after your eight hours are up and everyone's dead, what's left? Free Roaming? Been there, done that. 20 races? We don't enjoy the driving model, so that's out. Four chase missions? Ditto. Four Black Cab challenges? Meh. It's Crazy Taxi minus any craziness. Additions we weren't excited about to any significant degree. We felt numb with disappointment during our time with Black Monday. We expected it to be a whole lot more than the mission pack it's turned out to be. Maybe if any of the significant flaws of the original had been ironed out, and the missions were actually compelling, we wouldn't mind, but the excitement and thirst for vengeance of the original has been replaced by exceptionally ordinary shoot-'em-up missions, one on-rails shooting section, and a few awful stealth encounters. To be honest, the best thing about Black Monday is the awesome title music and the accompanying animation. It's literally all downhill after that, and that's not something we thought we'd say. Back to the drawing board, Sony.Order yours now from Simply Games."}