{"ref": "https://www.eurogamer.net/r-lmamanager2005-ps2", "date": "12 May 2005", "game_name": "LMA Manager 2005", "text": "Order yours now from Simply Games.~If you think you've got what it takes to be or beat the likes of Ferguson, Wenger, Robson and Mourinho, put your tactics to the test...~So reads the opening line of an LMA Manager 2005 press release. In a way, that unfinished quote sums up why I'm addicted to football. When they published that release, the PRs at Codemasters couldn't have guessed that Bobby Robson - one of England's most lauded managers - would be sacked by Newcastle shortly into the season. Equally so, they couldn't have known that by the time I wrote this review, Bryan Robson would have made his belated return to management with West Bromwich Albion.I am addicted to football because it always surprises me. It is a never-ending source of conflict and drama. Sometimes it gets frustrating, but it never gets boring.Thankfully, much the same can be said of LMA 2005. While it doesn't exactly do a great job of recreating the spirit of football, it does make for a satisfying management sim. So if you're looking for a game that emulates the character and individualism of football, this isn't the one. But if you've got a healthy imagination, LMA 2005 is comprehensive enough to inspire it.To begin, you get to choose what team you'll manage from a whopping 21 leagues in eight countries, with Holland and Portugal included this year. Alternatively, you can build a 'fantasy' team to play with, which is probably the best option considering the established 'real' teams can often feel a bit zombie-like. As expected, all the stats are up to date with the 2004/2005 season.The control you have over the club is very impressive for a console game, with the ability to scout players for purchase, customise tactics, implement training schemes, hire staff and even expand the stadium. The amount of feedback you get is also welcome - players will tell you when they're unhappy, assistant managers will report on the mental state of the squad, the money-men will let you know how the coffers are doing...Of course, such extensive stats means extensive menus, but LMA really excels at dealing with this problem. There are two menu 'tiers' in the game, top and bottom. You can cycle through the top tier with L1 and R1, and likewise the bottom with L2 and R2. Some of the top tier menus have their own bottom tier menus, so you end up with a large selection of screens, all easily accessible using the shoulder buttons.But while LMA is undoubtedly excellent when it comes to stats and team tactics, other areas are lacking. The 3D match engine, while far from terrible, is utterly uninspiring. The animation is actually quite pleasing, but the football on show isn't. Very rarely did I find myself excited by the match action and, truth be hold, after a while I chose to watch the highlights reel (voice by Barry Davies, Gary Lineker and Alan Hansen) instead of suffering through the games.This is a real shame, however, because another strong element of LMA is the 'dugout' command, letting you change your team's tactics on the fly depending on how they're doing in a match. Also, any changes made to tactics are clearly visible during 3D matches, which is certainly satisfying.For that reason, LMA 2005 is especially suited to players who want to guide a lower-league team to the heights of the European Cup. It is ideal for the kind of football fan who wants to live out their own anonymous fantasies, rather than one who wants to take Manchester United to the league title.If you already own LMA 2004, this year's version doesn't radically change anything. The main improvement comes with the addition of downloadable transfer updates in January, while the in-game transfer system is now more realistic and there's an 'expert' difficulty mode that hides player stats. Like most annual management sims, the changes are just about enough to warrant another purchase from diehard fans.Overall, LMA 2005 is a very polished game that gives console owners an involving, if slightly soulless, take on the world of football management. And, like the real thing, it's really quite addictive.Order yours now from Simply Games."}