{"ref": "https://www.eurogamer.net/metroid-samus-returns-review", "date": "12 Sep 2017", "game_name": "Metroid: Samus Returns", "text": "Metroid is back. For real, this time. After the odd detour of last year's Federation Force, a serviceable co-op adventure but a horrendously misjudged comeback for the series after an eight year hiatus, we have this. Metroid: Samus Returns is a remake of 1991's Metroid 2, a side-scrolling action game in which you slowly discover and unlock new abilities, each one granting you access to further flung reaches of a vast and intricate map. It's a more traditional Metroid game, then, with so many of the traits coined in Yoshio Sakamoto's 1986 original preserved intact. The problem is, Samus Returns isn't a particularly good Metroid game. Place some blame on the original, which has always been an outlier in the series. Metroid 2 moved away from the structured elegance of its predecessor for a more formless adventure, the player searching the sprawling caverns of the planet SR388 as they track and kill a fixed number of Metroids dispersed across the map. Its charms were obscured by the monochrome display of the original Game Boy that rendered its world an ill-defined smear, its legacy overshadowed by the arrival of Super Metroid some three years later, a game that returned to the original's formula and went on to perfect it. Samus Returns has a fair crack at rectifying some of those problems, and folds in some of the features introduced by later Metroids to bring it all up to spec. It's rendered in glorious colour, of course, the 3DS' stereoscopic trick being put to good use for a side-scroller with a neat line in visual depth. An automap has been added, too, sitting on the bottom screen and coming complete with all mod cons, allowing you to place down pins or mark out places of interest for you to return to further down the line. There's even a scan function, tied to your all-new Aeion abilities that slowly unlock over the course of Samus Returns, which highlights blocks that can be bombed and sketches out a map of your immediate surrounds. On the surface it's a retooling of the original, but dig deeper and you'll see it's hardly a remake at all - rather it's a retelling, using the fundamentals then filling out the rest in the broadest of strokes. The map has been mostly thrown away, Samus Returns' own take on SR388 being much denser, more detailed and gated by the series' traditional coloured doors. It unfurls in a different fashion, too, the abilities coming at a different pace than before. The underlying structure is the same, though, which presents something of a problem. Metroid 2, as wonderful as it was, lacked the intricacy of design that marked out its peers, and by preserving the core - which was no doubt the right thing for what remains a remake - it only presents a Metroid game that's as far removed from some of the series' core tenets as the more errant recent takes. There's a coarseness to Samus Returns' requirement for you to find a set number of Metroids before the next area is unlocked, a stunted flow to its world thanks to its more free-form elements. It all lacks a certain grace. This is a very different kind of Metroid, then, which is all fine and, if you've any familiarity with the original Metroid 2 at all, is to be expected. As Samus Returns progresses it does come more into focus - exploration becomes less of a chore, the combat more purposeful when pitted against more elaborate foes - but never to the point of elevating it above many of Metroid's recent imitators. It's a problem for the series, of course, that in its absence an entire cottage industry has emerged that seeks to scratch that same exploratory itch. Axiom Verge, Ori and The Blind Forest - and, of course, AM2R, Milton Guasti's unofficial Metroid 2 remake that was served with a DMCA takedown shortly after its release last year. It still casts a shadow over developer MercurySteam's handling of the same material with Samus Returns, though, in how it nailed the aesthetic of the series. There's something a little off about Samus Returns' reading of the Metroid universe, a slight gaudiness undermining the loneliness and wonder that's at the series' heart. Even Samus presents a gangly imitation of herself, like a cosplayer in an ill-fitting suit. There's also something off about how Samus Returns folds in some of the more combat-heavy leanings of Other M - that most divisive of Metroids - into this remake. Samus now has a free aim, and is reliant on counter attacks that open up the defences of enemies. The problem is how a majority of enemies require that counter in order to be dealt with, leading to a staccato rhythm to the action as you're constantly stopped in your tracks for such one-note encounters. It's all counter to the free-form exploration that the rest of Samus Returns dictates, and it's not helped by a sloppiness that can be felt in the controls. It all adds up to an underwhelming return. MercurySteam now has the curious distinction of being the one developer to have worked on both Metroid and Castlevania on the 3DS and fallen wide of the mark on both. This isn't quite the disappointment that was Mirrors of Fate, and there's a hard-edged gem to be found in what was always going to be a troubled exercise. Samus Returns is ultimately a noble remake that fixes so many of the original's problems, but it doesn't do so without introducing a handful of its own."}