{"ref": "https://www.eurogamer.net/r-supermarioball-gba", "date": "11 May 2005", "game_name": "Super Mario Ball", "text": "Order yours now from Simply Games.It's best not to ask why Mario is a ball. Just accept it. It doesn't matter anyway. Just think of Super Mario Ball as the latest Nintendo-themed pinball game for a handheld, and suddenly it transcends classification as one of the Game Boy's quirky spin-offs and slots happily into a niche that's birthed the likes of Kirby's Pinball Land and Pokémon Pinball, both of which were excellent.With this in mind, Mario makes a bright start. It's built on solid foundations. You use the left and right trigger to control the flippers, and instead of just whacking targets to tot up a score, you have to think about beating challenges specific to each screen in order to collect the game's 35 stars, which you'll need to do to keep opening doors to new areas. Then you have to think about beating four boss-style enemies in order to unlock the gates to Bowser's castle and eventually rescue Princess Peach.It harnesses a lot of the kleptomania that's kept Mario going over the years. Apart from collecting stars, you also have to think about collecting coins dropped by enemies, which can be spent on little power-ups like a warp pipe that blocks off the bottom end of the screen for a spell, or a lightning bolt that knocks out any enemy on-screen so you can pocket more coins. And it's so vibrant and colourful - even after spending most of the week tinkering with the technically superior Nintendo DS, this still looks very good indeed - and builds in so many cute little pit-stops that play on traditional Nintendo themes and enemies. Like a haunted house full of ghosts, which, logically, you can only take down by bouncing Mario into them from behind.But, despite Nintendo's glowing track record when it comes to handheld pinball games, third-party scribes Fuse Games let the side down with a few glaring mistakes and a few subtle quirks that eventually leave you fuming. For a start, the 'tables' are quite cramped and yet devilishly fast, and it's hard to really send the ball where you want it to go, even when there's virtually nothing on the screen. All too many times it just cannons off the sides and comes full circle. It's enough to make your head spin. Particularly the circular areas inside windmills and the like; we can't figure out why anybody would decide to add levels that accentuate a game's flaws like this.Worse, the number of objects and random things for the ball to bounce off in this confined space is enough to send you plummeting back down to the previous screen with alarming regularity - and no matter how much work you've put into the screen above it'll always be reset more or less completely when you return. Kill three out of four enemies swarming round a pyramid, for example, and then find the ball bounce randomly out of reach, and you'll return only to discover another four circling in defiance. Doubly maddening when you realise that some things do not reset. You have to whack a couple of sphinx-like objects in the top corners in order to get the pyramid to emerge from the sand, for example, and the pyramid stays up regardless of your coming and going (and acts as a ramp that helps smash aerial enemies). So why respawn the nasties? It's inconsistent. It makes you think the developer doesn't like you very much.It's a shame, because some of the things Mario Ball does are pretty clever, and you definitely want to gather up all the stars when you start playing it. It's that sort of game. And although you could argue that new screens are sometimes a bit nondescript and it's hard to work out how you're meant to unlock the resident star, we actually quite enjoyed the puzzle - the only letdown comes when you realise you're being beaten back by random bounces sending you off-screen and forcing a reset, or simply being unable to control the ball with any real accuracy. As you blast your way through the game, you also find yourself getting multiballs and Yoshi's eggs, and competing in challenges for red coins, but, again, the inherent control and table design issues often turn these into frustrating quests.In the end it's far more frustrating than it should be, particularly given that it's an idea with so much potential - and Fuse Games clearly has come up with a lot of good ideas in making this. It's just hard to recommend when there are so many silly things working against it. Issues that should have been obvious to the people making it. It's also a bit short, although given that it's a pinball game and there's so much to do and collect there's obviously a fair amount of replay value herein. Not a complete balls-up then, but nowhere near as good as Nintendo's benchmark handheld pinball games, and if you're after a flipper-fest then it's to one of those that you ought to turn. And on that note, if you can't find monochrome Kirby's outing any more, don't be put off by the ~Pokémon~ part of ~Pokémon Pinball~; it's actually a lot better than it sounds, and nudges Super Mario Ball right out of contention.Order yours now from Simply Games."}