{"ref": "https://www.eurogamer.net/r-doaultimate-x", "date": "11 May 2005", "game_name": "Dead or Alive Ultimate", "text": "Order yours now from Simply Games.Thinking about it - in a wholly rational, detached sort of way - there's absolutely no doubt that Tecmo make some very attractive polygons, and indeed textures. Whatever your thoughts on being, ah, ~stimulated~ by such artificial representations of flesh may be, if you take a step back and just look, you may well find yourself looking a little longer, and a little harder (bad choice of words, perhaps) than you first intended. It's a talent almost unrivalled among other development studios; Dead or Alive simply contains more characters per square inch likely to make you go ~hubba hubba!~ than any other videogame in history.So let's get one thing clear from the outset - mere hubba hubba factor doesn't make a game great. If you just want to drool uncontrollably on your Xbox pad while wishing the rumble function was that little bit more powerful, copies of the execrable (but still terribly pretty) Dead or Alive Xtreme Breast Voyeur are not exactly what you might call rare. Kasumi and Ayane's girl parts don't look any better or bouncier here than they did there, and nor do Ryu's buttocks improve any from their showing in Ninja Gaiden [enough! -Ed].Take it as read, then, that Dead or Alive Ultimate looks good. The characters look great. They're finely detailed, modelled to perfection, and animated with loving care. Hair blows in the wind, clothes billow and flap as you move, hats and sunglasses go flying as you fight. Breasts, of course, bounce. We expect no less from Tecmo any more. Its characters look downright fantastic. They always do.It's just as well, then, that the rest of the game matches up to that high standard.What you have here, in essence, is Dead or Alive 2 converted into Dead or Alive 3's engine, with all the graphical tricks learned during the development of DOAXBV and a healthy dash of Xbox Live online play used as a hook for the entire concept. The net result is a game which pulls back from some of the balance problems that afflicted the gameplay of Dead or Alive 3, throws beautiful characters around jaw-dropping environments, and lets you bring the whole lot online once you've run out of people nearby to kick in the face. The theory is sound. The implementation isn't half bad either.Dead or Alive 2 was a far superior game to Dead or Alive 3 - in my opinion, at least, and it's important to acknowledge that where fighting games are concerned opinions really do resemble the fundamental orifice of the digestive system both in terms of ubiquity and, quite often, in terms of odour. What it lacked in graphical prowess, it made up for with far more interesting control - with much of the spontaneity and intensity which characterised bouts in DOA2 being lost in the orgy of reversals and cancels which defined Dead or Alive 3 as a game. Once you got past the stunning visuals, which sold many a cynical journalist on the Xbox all those E3s ago, you were left with a game which encouraged dull, defensive play, and where the power of the reversals frequently turned bouts into blink-matches where both players waited for the other to throw the first suicidal attack into the fray.Dead or Alive Ultimate, by basing itself on the Dead or Alive 2 game, delivers a much more intense and accessible experience for players. Cancels and reversals are still important, of course, but they're no longer all-powerful, which makes matches far more interesting and more exciting both to play and to watch. Meanwhile, Tecmo has taken the intensity of everything else in the game up a notch to match; graphics, animations, stage designs and even sound effects all taking on a tougher edge than they had in DOA3, and altogether more likely to make you wince.Throwing a character off the side of an arena is no longer assured to be a simple fall, for example. Expect to see opponents painfully bounce down stone steps, smash through stained glass windows before landing in a shower of glass shards, or slam with bone-crunching force against ledges, outcroppings or even cars before landing - all accompanied, of course, with the requisite loss of health, so learning where to kick enemies off is a new art to be considered. Even on the ground, the level of destruction is impressive - ranging from the traditional slams into electrified equipment (with requisite frying noises as your opponent eats electric death) to shattering concrete underfoot with more powerful attacks or even throwing enemies into elephants and hippos on the savannah stage, much to the annoyance of said animals.The moves themselves have been beefed up, of course. The animations are smoother, the models more detailed, and the whole effect is significantly more bone-crunching and wince-inducing. One disappointing element, however, is that there's not a lot new that you can do in the game. Lifting the Dead or Alive 2 fighting model is a good idea, but it does mean that those who played Dead or Alive 2 extensively might find this all a bit boringly familiar; although, equally, it could be argued that with a good combat system only opponents become dull, never the game itself. That's certainly the case with Soul Calibur, for example; whether Dead or Alive can make quite the same claim is a matter for some debate. New characters are also nowhere to be found, although you'll find a hugely impressive selection of increasingly unlikely costumes for the existing ones.In terms of game modes, DOAU goes out of its way to make sure that you've got plenty to do. As well as the expected paper-thin story mode, there's also a wide selection of time attack, tag team, ladder and challenge-style modes to play in single-player, and of course two-player battles with either single characters or tag teams. One nice element is the addition of a profiles system which allows you to create multiple profiles on the machine and pick from them when playing two-player, so if you have several people present and are playing pass-the-controller, you can keep lifetime rankings for each player. However, this mode is curiously crippled; it was disappointing to note that you can't, for example, play through the single-player modes using your own profile and then access the costumes you've unlocked there when you select that profile on the Versus mode screen. Instead you pick a profile when you start the game, and everyone has to use the costumes from that profile in Versus mode, regardless of which profile they pick individually.This curious behaviour isn't an isolated incident. There are a number of other annoying quirks of the profile system, such as its insistence on showing up only the national flag associated with other profiles on the system, and not their names, in the all-time versus record screen. The system really isn't remotely as clever as it could or should be, although the reason why is clear - it was obviously designed for online play, where all of this functionality actually works, and was never really meant to enhance the single-console play modes - in itself a bit of a disappointment.Admitted, the raison d'etre for the game is certainly its online modes. It's unlikely that Tecmo would have remade Dead or Alive 2 if it weren't for Xbox Live, and the team has put in a sterling effort at getting the game up to scratch on the service - creating, in the process, a new benchmark for online fighting games to be measured by. It's not so much that the play is smooth and lag-free; it certainly is that, but we've seen that before on other beat-'em-ups running on Live. Instead, Tecmo's accomplishment is in creating a fully featured set of online options that leave other games in this genre in the dust.As you might expect, all of the offline modes are available in online play, but Team Ninja has gone out of its way to try and recreate the feel of playing in an arcade in the online mode, creating a host of new options to do just that. Most notable is the slightly unusual lobby system which the game uses, which offers the option of having up to eight players participating in a ~virtual arcade~, with those who aren't playing still able to chat and view the game while waiting for their turn. A host of tournaments, team battles and so on are also available, including the very arcade-style winner-stays-on mode. All we need now is the ability to put virtual coins on the virtual arcade cab, and possibly a peripheral to pump out a virtual rancid smoke and chewing gum smell, and the arcade experience will be complete [what about the puffy jackets? -Ed].The game also boasts a ranking system for online play, which starts everyone at grade C and moves them up or down according to how you play. As you'd expect, you can opt to play against people in your own grade only, which does certainly even things out significantly, although like any ranking system it's far from perfect and your matches will often end up being very unbalanced, regardless of grading. Still, it's better than nothing and, in balance terms, it certainly beats walking down to the Trocadero and getting your backside handed to you in the two-player section by some insane East Asian chap who can play every beat-'em-up invented with his toes. Blindfolded.For the more-than-90-per-cent of Xbox owners who don't have their system online, though, all of that is somewhat inconsequential. For them (or indeed for those of us who don't really fancy playing something like a beat-'em-up against someone on the other side of the country, far preferring the added dimension you get from playing someone on the other side of the sofa), Dead or Alive Ultimate is undoubtedly a lesser package, but it's still one of the best beat-'em-ups you'll find on the Xbox by far, not to mention one of the best looking games on the system. I certainly wouldn't suggest that anyone should be put off buying this by the Xbox Live focus.It's worth mentioning in passing the other disc you get in the box, albeit only by way of a warning. If you liked the original Dead or Alive - as I did, back when it first made an appearance on the Saturn - then I would strongly suggest that you take the remake of the game which is packaged with Dead or Alive Ultimate, and throw it in the bin. Not because it is a travesty, but rather because it is a perfectly faithful remake of the original game - and, as such, is a reminder of how slow, ugly and generally bad it was. On the other hand, if you fancy a gander at the roots of the series and find the concept of women who appear to have rubber shoeboxes mounted on their chests amusing, by all means, be my guest. The port is a nice addition, but it certainly comes under the heading of curio more than anything else.If you like the Dead or Alive series, then buying Dead or Alive Ultimate is a no-brainer. It's exactly as the name describes - the ultimate incarnation of the game so far. If you're an Xbox Live fan, it's even better, because the implementation of the online modes is bordering on perfection. On the other hand, if you're a beat-'em-up aficionado who doesn't get along with the mechanic of the series, then there's nothing here that's going to attract your interest.For the rest of us, this may not be quite up to the standards of Soul Calibur II as a beat-'em-up, but it's a great post-pub fighting game, with stunning graphics, accessible gameplay (although button-mashers are generally not welcome at this party, as they're easily dealt with by anyone who knows how to do any kind of counter or throw) and a selection of brutal-looking moves that will have everyone on the couch wincing and sucking in their breath as Kasumi goes flying headfirst down the stairs of the Great Wall of China - again. While her breasts bounce, of course.Order yours now from Simply Games."}