{"ref": "https://www.eurogamer.net/r-acecombat5-ps2", "date": "11 May 2005", "game_name": "Ace Combat 5: Squadron Leader", "text": "Order yours now from Simply Games.Flight combat games seem to have pretty much died a commercial death on consoles in recent years, with even outstanding efforts like Crimson Skies and Totally Games' hugely entertaining Secret Weapons Over Normandy failing to lure the punters into splashing out on them. With Ace Combat: Distant Thunder also suffering a similar commercial fate, it seems that the gaming public at large just don't care about flying planes anymore.Why is this? Are gamers so obsessed by racing cars, shooting guns and playing sport that they don't see the idea of flying at breakneck speed an exciting prospect? Or are the games that have appeared over the years just not that exciting? It's not a straightforward question to find a satisfactory answer to; commercially the genre's barely twitching, yet critically the reaction has been largely very positive indeed. Indeed, having played some of the best over the years it's a mystery why these games fail at the tills. Can Namco's latest attempt at reviving this genre make any difference? We're not sure it can.Namco tries very hard to inject a degree of personality to what might have otherwise been a very straightforward mission-based shoot-'em-up, and as such goes to great lengths to weave a dramatic narrative around every scenario Blaze and his wingmen encounter. Pre-level cut-scenes bristle with am-dram passion and purpose, with a kind of earnest quality that Japanese games seem to specialise in, while the relentless heroic aerial chatter during the missions tries hard to make us feel like we're right in the thick of a life-or-death dogfight, saving our buddies from certain death and defying the odds for glory. Like many Japanese to English translations, though, you get the feeling most of it is thoroughly lost in translation and ends up having this camp seriousness that's entertaining only because it's so incredibly funny to watch. It's almost as if Japanese developers try and outdo each other in how bad they can make their cut-scenes. Ace Combat 5 doesn't win the prize, but it's in the running.If you can pay attention long enough to not instantly hit the start button to skip these lavish but utterly pointless intro sequences, you'll learn that the general gist is protecting your home nation of Osea from a rival superpower in the year 2010. As much as Namco tries to weave some sort of meaningful narrative around the events, it never comes close to sticking, which is a minor failing, but one that doesn't help you want to stick with it. The missions come thick and fast, and most generally kick off fairly innocuously before inevitably descending into an action packed fight to the death as various deadly enemies appear out of nowhere. Others task you with ensuring the safe passage of an allied ship, but the name of the game is most definitely shoot them before they shoot you [that's not what it says on the box, boss -Tom]. In short it's not the most complicated game you'll ever play, but pretty good fun once it gets going.As is pretty much standard with any flight combat game, arrow indicators obligingly point you in the direction of your next target from the edge of the screen, while some of the actual business of flying is taken care of. It's more about the combat, so the game makes sure the plane continues to fly at a minimum speed regardless of whether your foot is on the gas, and virtually any manoeuvre can be pulled off without having to worry about stalling and the like. It may look like a simulator, but this is firmly in arcade action territory; there really is very little to worry about in terms of learning the ropes, even if a bizarrely convoluted tutorial gives that distinct impression.As you approach your next point of twisted flaming death-to-be the distance indicator within the reticule itself counts down, and at 5,000 metres changes to red at the point your weaponry can reach them. When you get closer still your reticule expands to include a lock-on indicator which basically guarantees a direct hit when you loose off another rocket of destruction. With mastery of the basic cannon, guided missile, unguided bombs and the odd special weapon (such as high-damage cluster bombs) the task at hand is always as straightforward as possible; kill anything not on your side within the time limit while simultaneously trying your best not to get blasted out of the sky yourself or plunge headlong into the scenery. Although most of the action takes place high up in the inky blue, now and then you have to pay more attention to what's on the ground, as you drop your limited stock of unguided bombs onto aircraft carriers and other ground targets. But in the main the name of the game is chasing dots, looping all over the place trying to get them in your sights, pulling off evasive manoeuvres and trying to keep a handle on how far the ground is (the number of times we almost nailed missions, only to misjudge something right at the death and plunge to our doom and lose 15 minutes of progress was a little annoying to say the least).Although it all sounds like pretty familiar ground we're jetting through here, Namco has added the ability to call on your three wingmen during each mission. Actioned via the D-pad you can issue basic commands such as Attack, Disperse, Defend as well as issuing an instruction on whether to used their special weapon or not. For much of the time, though, you don't really have to worry too much about what they're up to, so long as you're getting on with the task at hand. You'll probably find yourself either being your own worst enemy much of the time by crashing in stupid circumstances, or you'll be doing a good enough job nailing most of the enemies on your own that you needn't concern yourself with what they're up to.So what of the longevity and replayability? With around 30 missions it's not going to be a game you'll lick too quickly, and with over 50 licensed playable classic and state-of-the-art planes to buy and fly there's much to discover and try out. But however much of a pleasant diversion it was, would we buy it? At full price, almost certainly not. After a few long sessions with the game over recent weeks Ace Combat 5 felt far less involving than the competition. Next to the tense and exciting dogfights in other slower paced, more graphically spectacular titles in the genre the actual combat itself just lacked punch; mostly you're shooting dots from afar and rarely go anywhere near the land. On top of that, enemy drones lack convincing AI and provide little more than cannon fodder, although this admittedly does improve the further you progress.The real problem is, though, that the game has already lost its less patient audience by then, and simply doesn't get off to a good enough start to warrant sticking with. With another harmless but anonymous storyline providing no hook whatsoever, it becomes one of those games where you feel no sense of attachment to what's going on. You can appreciate it's not a bad game to any degree, is technically very polished with beautifully rendered craft bursting with technical detail and slick in almost every sense - but it lacks soul. And to us, any game guilty of that becomes hard to recommend and positively screams 'rental only'. Top Gun but sadly not Top Fun.Order yours now from Simply Games."}