{"ref": "https://www.eurogamer.net/r-supermario64ds-ds", "date": "9 May 2005", "game_name": "Super Mario 64 DS", "text": "Shop for games now with Simply Games.Mario changed my life. There. I've admitted it at last. The transition from a fanatical comic reading pre-teen youth hung up on Dennis The Menace and Bananaman to hopelessly addicted Crash-reading computer gaming aficionado was all but assured from the moment Donkey Kong took its arcade bow. And yet, 22 years after our first encounter with the tubby moustachioed plumber Nintendo is still capable of flushing out cynicism, eradicating boredom and making us believe in the possibilities of gaming again.Those beliefs that game developers and console manufacturers can invent new and exciting ways of entertaining us are all too regularly chipped away by the mass production ethos, and the constant recycling of old ideas on an annual basis, until we explode with righteous indignation at the cynical profiteering nature of certain corporate entities with both eyes, hands and feet, hopefully nailed painfully, to the bottom line. Yet, for all our spleen venting fury, here we are getting excited over a blatant, cynical rehash of an eight year-old platform game, released to shift Nintendo's first truly 3D-capable handheld, the chunky, but loveable DS. What gives?The genius move in this instance is to use SM64 as something of a Trojan Horse to showcase the touch-screen capabilities of the DS. And we're not talking about the rather contentious and not altogether satisfying control system for a game that was never designed to use this input, but more the remarkable array of mini-games that serve not only as a mini-glimpse into the future of handheld games, but help drag you through one of the best platform games ever made too.Although everyone talks about SM64 in hushed tones, like it's the great god of 3D platforming games, there are plenty of people who've never played it properly. Most gamers back in the day plumped for a PlayStation (this reviewer for one), bought Tomb Raider and got on the 3D gravy train that way. More committed types maybe even had a PC as well, but shelling out £50 or more for N64 games just wasn't on the menu for many of us. Having played near enough every 3D platform of the last seven/eight years, it's an astonishing oversight, but the DS version finally allows this reviewer to atone for such enforced errors.Like most platformers it hardly needs much of an introduction. Somewhat ludicrously, the simpering Princess Peach has baked a cake and invited Mario to the Mushroom Castle to sample her fine delicacy (now accompanied by 'party crashers' Yoshi, Luigi and Wario). But as usual the whole thing goes tits up when the perennially evil Bowser manages to steal the Power Stars that apparently guard the castle and lock Peach into the walls and paintings of the castle (he's a clever lumbering sod, that Bowser). Not only that, he's reinvented history and locked Mario, Luigi and Wario in as well, leaving the big-nosed Yoshi to retrieve these Stars and begin the awesome task of freeing his chums.It's slightly odd that you start off as Yoshi, but we're guessing that Ninty wanted to show off some of the new stuff from the word go - a fact that will be somewhat lost on those of us coming to it fresh. No matter, the focus of the game remains completely intact, with the essence based around an ongoing quest to retrieve seven or more stars from each of the castle's many courses, each accessible via doors that require a set number of stars to gain admission. We're reliably informed there are around 150 of these stars, many of which have been specifically inserted into the existing levels and are only possible to obtain using specific characters.The presence of three new characters opens up the possibilities somewhat and the prospect will have owners of the original wide-eyed with excitement, presenting entirely new ways to play the game, with all new stars and new abilities meaning that it's much more than a straight run through of a much-loved favourite, which is how so many handheld ports - particularly Mario ones - tend to pan out. On the other hand, old hands have the advantage of actually being able to spot the new additions and knowing the relevance of Yoshi's abilities over, say, Mario's.But it doesn't really matter a jot whether you've played it before or not, as the drill is much the same as you'd expect from any platform game of this nature. Kleptomania, precision jumping and seeing off any minion that gets in your way in the overall pursuit of these coveted Power Stars. Of course, to earn these rewards you must eventually face a procession of bosses along with other slightly less taxing tasks (such as collecting the eight red coins dotted around every level), complete course specific challenges (like hitting timed switches and legging it to another part of the level), reach tall spires, fly through airborne rings collecting specific coins, collect 100 coins in a level... the list goes on. However you earn them, though, for the most part you feel like you've earned every single Power Star and along the way you're forced to negotiate some of the deadliest traps, some of the most evil henchmen devised, and, sadly, some of worst camera issues we've faced in a long long time.Newcomers, such as this reviewer, though, are also likely to be slightly less forgiving of these more ungainly technical aspects and have every right to question why, over the past eight years, Nintendo couldn't have come up with a more efficient camera system that doesn't, for example, make routine jumps a lottery and allow the game to completely and unavoidably obscure what the player sees on more occasions than seems reasonable. While this game was rightfully held up as a true pioneer in its genre at the time (and forever after), we've come to demand and expect certain things from platform games that - at times - SM64 quite evidently struggles to accommodate even now.Having limited experience of the analogue control system on its native N64 pad this reviewer can't say he missed having an analogue stick with which to make minor tweaks to the camera, even if colleagues may have (see separate feature). In fact, the D-pad actually does a reasonable job of approximating the experience, although those used to the old ways may find it trickier, and therefore less playable and more irritating than they remember it. We recall attempting to play SM64 on a PC emulator years ago, only to be told ~don't bother - you really need to play it with an analogue stick~. Probably the most persistently irritating side effect of having digital controls is having to constantly hold down a button to run, and then having to hold crouch (right shoulder) and jump (B) at the same time in order to pull off those often essential long jumps. Three button juggling: no thanks. But somehow, even though such issues feel awkward and just plain odd, even after 15 or more hours we can't say it stops the main game from being thoroughly enjoyable - it just means approaching it in a different way - and in many senses what you never had you can't miss. You kind of make up your own slightly odd solutions like any good gamer does. It doesn't make it especially forgivable, but there are alternatives.There is, of course, the option of playing the game with the vaunted touch-screen with a stylus. Some of the EG staff have had varying degrees of success with this. This writer found it an interesting approach, and at least it solved the problem of having to press an extra button in order to run, but in its place it added the new problem of keeping yourself in a straight line. There are a couple of options to cater for left or right handers, but ultimately neither felt like the most graceful solution. You almost want someone to produce an analogue control add-on, and we can't help but fear that the DS will constantly be dogged by issues relating to a lack of precision control. It's not a deal-breaker, but as long as the system relies on a proliferation of N64 ports as its staple then there will always be similar complaints. It's certainly a nice touch to have the lower of the two screens as a permanent map, allowing you to keep a track of where you are at any given time, not to mention some of the objects you covet, but it's not a feature you'd exactly call essential.Where SM64DS works best is the integration of the mini-games, of which eight are available from the very beginning - two per character. Any more than that involves a keen level of dedication that demands unlocking all three of the other characters, then going on rabbit hunts around the castle and surrounding areas - i.e. in the parts of the game's playable area outside of the courses themselves. Catching one procures a key which you must then trade in at the game's playroom, but in most cases these are well worth it, providing yet more incentive to play through the game and showcasing the DS's unusual talents at the same time.Continuing the simple visual style and instant playability found in the celebrated Wario Ware, Inc. titles, every single mini-game is a microscopic insight into the potential of touch-screen gaming, and collectively make the SM64DS package almost irresistible. Mario's ~Sort or 'Splode~, for example, has already passed into legend for being one of those incredibly addictive games that you can't stop playing and get incredibly competitive over high scores on. The concept is wonderfully simple: red and black bombs emerge from the top or bottom of the screen and must be ushered with the stylus into their appropriate boxes. Keep them out too long or put them in the wrong box and they'll explode. Simple gaming at its most perfectly refined.Even pointlessly simple card matching games like Luigi's ~Pair-A-Gone~ and ~Memory Match~ had us playing relentlessly, whiling away Tube journeys and whiling away stolen moments at all manner of the day and night. Simple, instantly gratifying snatches of touch gaming summed up by the wonderful ~Wanted~, a Yoshi mini-game that tasks you with matching the face of the character on the Wanted poster in a 'Where's Wally' style experience against the clock. Play it and you'll understand where we're coming from, and probably never stop playing again.Some of them admittedly don't warrant further examination; Yoshi's ~Loves me...?~ is amusing petal picking sim, but entertaining for, oooh, all of five seconds. Others, such as Wario's snowball rolling race ~Snowball Slalom~ are tricky, entertaining, and a glimpse of what can be done, but it's all over in literally seconds. Far better are the games which you can play for ages such as Mario's ~Trampoline Time~ which tasks you with hastily drawing in trampolines that bounce the suicidal Marios to safety, and reminds us of Nintendo's ancient Game & Watch effort ~Fire~.Tom's favourite ~Mario's Slides~, meanwhile is like a bonkers take on Tetris, with descending heads sliding down vertical lines, transferring between parallel lines via lines that you yourself draw in, the idea being to wind up sliding into a star rather than a piranha plant. Maddening, instant, original, perfect. There are more. Lots more, but describing them would require another feature all of its own, and it's not our place to spoil the surprise. All you need to know is that there are dozens of them, and that playing a seminal, if tricky to control platformer with camera issues is more than worth the effort to seek them out. Although none of the mini-games could ever justifiably be marketed in a package of their own, it's fantastic to see that there's still a viable outlet for this form of instant gaming, and they provide such a wonderful host of rewards for your efforts, it's genuinely exciting to see what developers will come up with next to take advantage of this control device.If there's a weak link in all of these mini-games, it's the multiplayer mode. It's wireless (woo!) and it works very well at what it does, but the idea of having to run around collecting stars as they pop up on a map of, say, the outer castle grounds doesn't stand up as much more than a tech demo - which is what we thought of it when it was used to demonstrate the game in May. We'd have much preferred competitive multiplayer versions of some of the mini-games. Which, since we're about to stop talking, we'd like to reiterate are thoroughly great.On the whole, in this reviewer's estimation, the DS more than lives up to expectations. If anything, there was little excitement about it in this corner of the EG camp in the run-up to release, and although it'll be interesting to see whether the presence of a second screen will make any real difference, it's the touch-screen gaming that has really made the difference - although it's telling to note that so far it's only been genuinely useful in games actually designed around this input, as opposed to shoehorned into accommodating it as with the main portion of SM64DS. You've got to hand it to Nintendo, though; it's moved the gaming goalposts again. Or rather it lets the players do it themselves this time.Shop for games now with Simply Games.Given that we're lucky enough to have been playing the game independently and all approached the game from a variety of perspectives and prior knowledge, let's turn it over to the other members of our reviewing panel to see what they made of Nintendo's flagship DS release. Head here to continue the journey..."}