{"ref": "https://www.eurogamer.net/knack-2-review", "date": "5 Sep 2017", "game_name": "Knack 2", "text": "When Garibaldi helped unify Italy, the story goes that he had only one request. In return for his hard work, he wanted a year's supply of macaroni. I have never looked into this business too deeply, because I don't want to find out that it isn't true, but still - isn't that kind of a weird thing to ask for? Just macaroni? And just enough for a year?The requests that history remembers tend to be the strange ones. There's Garibaldi and his macaroni, and then there's Mark Cerny and Knack. It sometimes seems that all Cerny demanded in return for making the PS4 an astonishing success was that Sony might help him knock out an archaic platformer-cum-beat-'em-up to play on it. And now we know the intriguing wrinkle that brings the story to life: just as Garibaldi wanted precisely a year's worth of macaroni, Cerny appears to have wanted not one but two archaic platformer-cum-beat-'em-ups made in his honour.As a result of this, perhaps, the makers of Knack seem uncertain about its legacy. At times in Knack 2 the developers seem able to confront the fact that the original game was not an unqualified success. A character will quip about Knack's sorely limited repertoire of punches and kicks in days gone by, while the budget price tag the sequel comes with has a whiff of contrition to it.But at other moments, Knack 2 invokes memories of a heroic past that simply does not exist. This is a trivial example, and it may have grown more vivid in my mind, but some way into this adventure Stealth Knack is reintroduced. Stealth Knack can absorb crystals and slip through laser grids, feats which, given the nature of video games in 2017, are really no big deal. But in-game it struck me that Stealth Knack was welcomed back with just a touch too much fanfare. Squint and you could perhaps be forgiven for thinking that he was the stuff of ballads, of warmly-invoked memes and spin-off cereal brands. Stealth Knack, you might even decide, if you really let yourself go, is all that's been missing from our lives for the last few years - years which can now be safely forgotten because Stealth Knack has finally returned to us.If the makers of Knack 2 appear ambivalent about the first game, they at least have a clear sense of what they might want to improve on this time around. On the surface, Knack 2 is business as usual: a cartoonish brawler with platforming elements that sees you leading Knack (a hero who can absorb little fragments of ancient rubble to grow in size, or discard them to slip through tiny vents) on an adventure that includes double-jumping and a lot of punching. Underneath all this, though, a retuning has taken place. Checkpointing, a source of serious frustration in the first game, is much kinder in Knack 2, while Knack's sparse fighting moves are now expanded upon throughout the course of the adventure. Doodads you earn from defeating foes allow you to unlock the odd new somersault kick, say, or boost the speed or power of the attacks you already have, while the campaign itself regularly drops in a new treat here and there. A telescoping grab attack? A boomerang move that allows you to stun enemies before you finish them off? You got it. Elsewhere, certain puzzles require you to absorb rock particles or ice fragments to weigh down switches or freeze gears in position. Metal can be absorbed to connect electrical components that will open doors or set machinery in motion. Stealth Knack can still absorb crystals when he wants to slip through laser grids. (God, did I mention how good it is to see that guy again?)Equally, the levels throw new ideas at you a little more frequently than they used to. Knack's old trick of growing in size over the course of a few corridors still holds, but there are moments that border on invention here, such as the ransacking of a lab that involves moving mirrors about to reprogram its lasers, or a sequence that sees you climbing a big robot to punch its head off from the inside. And while I found it mildly annoying to have a dash move rather than camera control on the right stick, the auto-camera at least frames the action fairly well. Moments in which you fall to your death because you couldn't see where you were meant to jump are rare; fights where your view is blocked by an awkward bit of scenery are non-existent. It holds up in the decent local co-op too.It is never a pain to play this game, but it did often seem like a slog to me, and that's because Knack's deeper problems remain - and they are the sort of things that no boomerang move, no clever set-piece can really solve. Knack's real issue for me is that he remains a weirdly charmless creation, and mere competence will not add that much to the basic proposition. Knack's world is an unconvincing hodgepodge of different elements: we're off to somewhere that looks like Paris one moment, and then we're rattling around in mines the next. Sure, these spaces are detailed and sometimes nicely arranged, but there is a lack of individual character to them, a blandness to the cityscapes and a repetitive nature to the castles and grottoes, and a confusion as to how they might fit together to create a single fictional world.Knack's enemies are similarly unexciting, naff Shreks and mechs who sometimes come with different attack patterns - one will have an electrical stun move, another tries to keep you at a distance; towards the end, people turn up with sort of hamster ball shields and must be forced off ledges until you learn the right flavour of punch to put them away - but all succumb to pummeling in the end, and they all exit the game with little flair. Your own gang are hardly much better. There's a plucky kid memorable only for having the strangest shirt in all of video gaming - I kept taking pictures of it, unable to wrap my head around an arrangement of collars and buttons that has no clear precedent in the real world - and a heroic uncle who seems permanently dressed for an adventure that is hard to guess the precise nature of given the clothes he has decided to wear for it. I am talking about what these people are dressed in, incidentally, because that's as deep as the characterisation goes. Beyond these two, the rest of the cast irises out in your peripheral vision as they plod through a wearyingly predictable, wearyingly generous story, and as they warp through levels that they clearly don't have the AI to navigate without such trickery. (The cast's habit of leaving Knack to it while appearing now and then on the sidelines only adds to the unsatisfying sense that Knack is the team's brutal slave who's merely there to deal with any fights that might come up or risk a hernia every time there is a heavy door that needs opening.)Worst of all is Knack himself: a lumpen thug of a hero at one end of the scale and a scamperer through endless ductwork at the other. His shrinking rarely leads to memorable puzzles, just as his ability to grow over the course of a level rarely adds a genuine sense of Katamari-ish momentum to proceedings. This loveable children's hero spends quite a lot of his time smacking around people who are much smaller than him, and to compound things, he seems to have been based on that famously loveable children's favourite Ganon, the murderous uber-monster and nightmare creature from the Zelda games. I remember reading once that good children's character design acknowledges the awesome power of the humble circle, Mickey Mouse being the prime example. Knack is spiky and angular and forgettable. I doubt that there is much in the way of a Knack cosplay community, and not just because it would be so uncomfortable to sit down in character.What a strange fate. Mechanically, Knack 2 is an adequate game that seems to have had money and effort and skill thrown its way. But in its aggressive charmlessness it only really serves to illustrate the point that games are not merely the sum total of their mechanics. A step forward, then, but I still wish Cerny had just asked for the macaroni."}