{"ref": "https://www.eurogamer.net/r-painkillerbattleoutofhell-pc", "date": "9 May 2005", "game_name": "Reviews", "text": "Shop for games now with Simply Games.~A shooter in its purest form~ says the press blurb about People Can Fly's relentless and maniacal attempt at elbowing its way onto the FPS scene. But unlike a lot of the fluff that PRs like to spin hysterically around their products, this quote is right on the money. It's a form of purity you're going to either admire because you're one of those stoic 'change is bad' types who never wanted FPSs to morph into some kind of poor-man's sci-fi storytelling vehicle in the first place, or look at it quizzically in the manner of someone who can't quite work out why someone would make something so unapologetically retrograde by design. Didn't we say goodbye to crazy AI-free 'everyone's running at me' shooters ten years ago?Well, no, actually. Serious Sam proved a few years back that Mentalist Shooters (as they shall henceforth be referred to) have a place in gamers' hearts. Like 2D beat 'em ups, side scrolling shooters and, um, our continuing obsession with football management games. Does progress always have to revolve around complication? Not if your game has Painkiller in the title it doesn't.There's everything to hate about Painkiller and its ten mission-long mission pack. It's so amazingly unsophisticated it's actually quite amusing. Enemies charge at you. More spawn. And charge at you. And if you don't kill them quickly there'll be a big long line of them after you, probably making hideous macabre noises of the undead and possibly spitting or throwing something in your direction. That's about as complicated as things get in Painkiller, and if that sounds like Doom, then maybe it's also time to rejoice. At last, an FPS that's purely about shooting as many demented enemies as possible, as quickly as possible.Painkiller's a fast and furious one trick pony, but by extension pure and exciting for the very reason that what it does it does well for much of the time. Sometimes just updating the past, and staying true to a particular gameplay vision can feel fresher than most of the supposedly contemporary titles because there's no faffing around with grand statements of intent or distractions. When they're at their best, games like Painkiller instantly deliver focused gameplay that used to be taken for granted, gameplay that's now almost completely at odds with what virtually everyone else is doing.Battle Out Of Hell, for what it's worth, picks up more or less straight from where its parent left off. The storyline is total arse, obviously, but it seems churlish in a game like this to care when the action more than makes up for it. Having battled all of Hell, you find yourself pondering your next move in Purgatory, aware that Satan and co are doubtlessly already massing their minions for their revenge. There's little point dallying too long on the finer points of why you then end up roaming a darkened Orphanage or riding a Rollercoaster, but we're reliably informed they're favoured hangouts for tortured souls. We'd recommend Karaoke nights, Christmas parties, weddings, or the set of Strictly Come Dancing if any of the undead are busy reading this.Like we said; who actually cares? There are enemies. Slavering enemies. Lots of them, and they all need to die, in pain. It also seems pedantic to point out that physical weapons won't actually work against the undead, but try telling that to a bunch of Polish developers called People Can Fly. Anyway, the game progresses roughly like this: enter level, shoot/damage (not all weapons actually require bullets as such) enemy a number of times, enemy eventually splits into little pieces and leaves a floating green soul behind, and meanwhile other variants on said enemy are busy spawning at the rate of knots to leave poor frantic gamer charging about like a lunatic trying to avoid being minced. Once you've cleared said gaggle of enemies a glowing red checkpoint portal appears, your health goes back up to 100 and the process repeats until you eventually clear the level and move on.But as with the original there's slightly more to it than kill and move on. As a shooter with a keen emphasis on how well you shoot, a number of areas of skill are rated, from how many of the level's enemies you killed to how many of their souls you collected, to a variety of other facets including gold coins collected (from busted up bits of scenery), armour collected, secret areas found, and even conditions that are only fulfilled if you complete the level having killed less enemies than completion would generally require (like the second level, the rollercoaster, where avoidance of enemies on the on-rails section is near enough impossible).Disappointingly the game's quickfire and off the wall excitement peters out early on, as if the developers realised it needed to lure people in quickly. Levels come and go alarmingly quickly on the default difficulty, providing quick thrills but little of any substance, leaving gamers with little option but to replay levels and attempt to meet the various targets - if that indeed holds any substantial appeal. The actual level design and setting quickly becomes blander as the game wears on too, resorting to boxy environments that look rushed and devoid of genuine inspiration. You'll be surprised how tight and confined most of the levels are, too, giving little of note to explore. On the plus side almost every level and its accompanying clutch of monsters is radically different from the one before, but to be brutally honest they all display the exact same 'chase you relentlessly' AI behaviour that starts off feeling crazy and exciting, but is as see through as a wet T-shirt, only less exciting after a few consecutive hours of doing the same thing.The oft-celebrated visuals, post-Far Cry, Doom III and Half-Life 2, don't really get the pulse racing by comparison these days, but nevertheless with a top specced card under the bonnet there's much to admire; it's as slick a performer even in the heat of absolute chaos with everything whacked up to the max, but don't take too much notice of the bold claims that it's anything spectacular. The presence of Havok 2.0 physics might sound good on the box, but in reality it applies to fairly regulation death animations, a few nice (but pre-rendered) object explosions and practically nothing else. Certainly the static texture detail and lighting is up to par, but the fairly amateurish character models and limited animations do little to show off your PC next to the competition. Let's face it, we've been spoiled, and spoiled by the best in the world, so it's being judged in the harshest possible light these days.Elsewhere in the game itself, new weapons get added fairly rapidly to provide that all important sense of progression, but even then most of them conform to the tired regulation FPS rules drawn up back in 1992 - although we'd have to say the newly added bolt sniper gun with its five-bolt death-dealing action and bouncing balls of explosive destruction is a genuinely fantastic invention. Some of the others, though, feel dreadfully underpowered as well as being just, well, done to death.Outside of the single-player main dish, even the presence of online multiplayer (CTF and Deathmatch) can't realistically expect to tempt all but the die-hard from the plethora of alternatives hogging server traffic the world over. It deserves nothing more than the merest of mentions, because that's about how underwhelmed we were by it.Some might warm to Painkiller's defiant purity, and for a while we were sold. But quickly the novelty wears off; you've seen almost everything worth seeing in the first 90 minutes, and while some might cling onto the belief that it has the sort of gameplay that Doom III should have featured from the outset, but don't really buy that. Anyone who stuck with Doom III into hell and beyond that knows that id did, indeed, get there in the end in a slow burn, roundabout kind of way. Painkiller blows its wad all too soon, and as a result won't feature in too many end-of-year polls.But at the budget price, we weren't expecting miracles, and nor should anyone else Battle Out Of Hell is a well-meaning expansion pack that offers almost exactly what you expect - more of the same crazed traditional Doom-alike madness for a reasonable asking price. If the parent release fulfilled your thirst for Mentalist twitch shooting and you feel like topping up then you can't really complain at what's on offer here, but for us it's almost the dictionary definition of an average shooter. For those wanting something a little more cerebral and fulfilling, this sure as hell isn't it.Shop for games now with Simply Games."}