{"ref": "https://www.eurogamer.net/biomutant-review-an-open-world-adventure-buckling-under-its-own-ambitions", "date": "24 May 2021", "game_name": "Biomutant", "text": "For the longest time, Biomutant has been my white whale. Like clockwork, a life sign would emerge, with the announcement that yes, it's coming, definitely, just not right now. In part, this is due to developer Experiment 101 having been granted an unusual amount of freedom by their publisher to keep adding stuff, which led to a game that always sounds like a lot on paper - a character customisable down to their genetic makeup who can wield any weapon, a crafting system allowing you to make virtually anything, a morality system, a map dwarfing even Skyrim's. It's full of superlatives any marketer would love, confident in selling itself as something you've never seen before. Trouble is, you absolutely have.To be fair, you've never controlled a character quite like this. The protagonist here is a mutant, a furry being reminiscent of a cat, or maybe more of a rodent, depending on which visual you're going with during character creation. You and others of your species are adept in the art of kung-fu, but you can also wield giant swords, guns, rocket launchers and karate weapons such as bo staves, sai blades and more. You can pick up any weapon regardless of your character class, which makes the classes superfluous - you can even find multiple ways to learn the starting perks each class comes with even if you chose another.To understand other areas in which Biomutant can't live up to the expectations it set itself, it's important to remember this is a game made by a team of just 20. You see it in the way copies of environments exist around the map, how some animations had to be foregone, how text repeats with certain actions. In many ways, it remains a marvel when considering the size of the team. The giant map often looks exquisite, its lush and vibrant forests flanked by ruined towns and toxic wastelands. The game runs like a dream on PC, with next to no need for loading screens and the framerate plummeting very rarely during some of the heavier action. The sheer amount of crafting items - screws, blades, bent metal, bats - is just as impressive as the many different skills the team thought of, like the psi attacks and toxic bio powers you can use in addition to melee and ranged combat. But every feature falls victim to the game's quantity over quality maxim. Take the crafting. Visually it's a lot of fun to tool together an axe and a vacuum cleaner, but of course near-endless variety in weapon design can't lead to endless variety in fighting styles. Instead, each weapon you make falls into one of four different categories, and just like that, we're on familiar ground again. To be clear - four fighting styles is still a lot, but then you have to keep in mind the strength of each weapon, meaning that if you want to switch, you might have to farm the right materials first. A great idea foiled by underlying mechanics. Biomutant simply wastes a lot of its own energy - and mine - in ways like this. You can tame mounts, only to find they're slower than your own running speed. In a lengthy side quest, you can search for materials to upgrade the mech you'll use in one boss fight, only to find the encounter is already too easy without them and you shouldn't have bothered.From afar, Biomutant's Devil May Cry-esque combat looks responsive and snappy. In reality, it feels as weightless as food wrappers blowing in the wind. Apart from the weak and sometimes entirely non-existent controller feedback - which obviously you won't miss using mouse and keyboard - it's also there in the animation quality. They're quite slow sometimes, hits don't visibly connect, and effect visuals, even the fun comic onomatopoeia, can't properly convey impact. The far-reaching consequences of this are an unfortunate masterclass in the importance of impact in animation, because whatever you do in Biomutant, no matter how wild things get, from piloting a mech to bouncing around in balls of viscous liquid, it always feels underwhelming.The overall balancing in combat feels off, as well. Biomutant has some visually wonderfully imaginative, huge foes, who will all rip you up like the aforementioned food wrapper, regardless of your level. If that was the intention, a la Horizon: Zero Dawn, I could deal with it, but an enemy's health bar and level are always prominently displayed, making me think there should be a difference at some point. No matter how many fun kung-fu manoeuvres I can do, it all wildly loses its appeal once I find out it's better just to use ranged weapons because being caught underfoot just once costs me half my health bar.Weirdly enough, this doesn't make Biomutant difficult, just repetitive. In many ways, it's far too easy - you can hack away at a regular enemy's giant health bar for ages, but down a boss with a lot less effort. It's a shame because Experiment 101 clearly poured so much into Biomutant's boss design. Those main battles, where I both got a special gadget to fight and an enemy with an interesting attack pattern, feel like Biomutant at its best - but then you go back to scrounging for loot or engaging in a collect-a-thon of side quests to the tune of  ~find every microwave~ and ~flush every toilet~. Several items necessary for progress were so out of the way from the main quest location that it felt as if Biomutant held items hostage so that I'd look at the entire map. Now and then you're asked to solve a rotation puzzle, and every puzzle plays the same - you turn knobs left or right. It's disappointing.Technically Biomutant doesn't have a story. Well, it does have a story - you're asked to fight a number of big monsters in order to revitalise the World Tree and stave off impending doom - but it doesn't have a plot. You know what you've got to do, and all that's left is to do it. Everyone does kung-fu, so there's a lot of talk of unity and harmony, honour and the value of training, but it's literally just hot air - the few characters you meet don't have conversations with you, they offer calendar quotes and some exposition, and your only way to participate is to ask for clarification - at one point when a character told me the end of the world tree would mean the end of the world, I had the options to ask ~World Tree?~ and ~The end?~.An incorporeal narrator (David Shaw Parker) follows your kung-fu rodent's adventure, but he doesn't narrate, he comments (~Fine weather to be out~) and makes combat noises (~Blam! Kapow!~). He also translates what characters are saying to you, because apparently no one in this world speaks your language, including the members of your own race. He will announce night and day, even when you're inside, in sometimes truly bewildering ways (~Better perk your ears up, darkness doesn't hurt sound~). You can tone him down if he gets too much for you, and he will, but you can't shut the narration off completely. The entire game uses baby speak to such an extent it sometimes took me a moment to figure out what it was even talking about.There are enemy camps to take down - an open world staple - occupied by six warring mutant factions. You pick one of two starting factions, the good one or the bad one, and then you go off and take your rival's bases. Genuine effort has been put into having each of these skirmishes play slightly differently, and it's greatly appreciated, but a clan war in the middle of a story about the end of the world is an entirely different, yet curiously mandatory thing, narratively unmoored, tacked on to make the game bigger. There are a lot more narrative inconsistencies, like the long conversation about the value of life and honour before you go and set an entire base on fire, but there's not much use in thinking about it, since I suspect no one will play this particular game for its narrative. Biomutant shouts a lot about its Aura system, basically just another morality system, but this, too, is close to pointless. No matter what faction you pick, no matter whether you kill or not, not only do you have the option to change your mind about whether that makes you good or bad each time - making none of the touted moral choices permanent - the choices also amount to nothing but points for your psi skills. Both 'routes', as it were, play the same.Experiment 101 took years to stuff a game with features instead of focusing on its strengths to deliver a quality experience half as long. Everything that exists seems to have been made so that someone could say wow, look at all this stuff, yet the sad truth is all of it is available elsewhere and in better quality, likely because you can't take on AAA open-world games in scope if you're a team of 20. That a team of this size felt they had to deliver something of that magnitude says a lot about the rabid appetites of the gaming industry, our obsession with ~more is more~ and how it's possible to whittle something genuinely innovative down to a nub.It hurts to say that about the effort of a team that tried to work crunch-free and was given an amount of time and creative freedom other developers can only dream of. But the whole game feels like an exercise in adding certain open-world staples, always erring on the side of caution. I've said this before, but even when gaming, more so than any other medium, feels like the place where we gladly accept being served the same things over and over, the safer we play it the more oversaturated the market feels. Biomutant is not a bad game, but it is a mediocre one, and ends up the very thing it tried not to be."}