{"ref": "https://www.eurogamer.net/the-last-day-of-june-review", "date": "4 Sep 2017", "game_name": "Last Day of June", "text": "In chaos theory, there's a well-known concept called the butterfly effect. In essence, it's about how small causes can have large effects - an idea with its roots in weather forecasting, but one with deeply poetic underpinnings. What if you had the ability to avoid a devastating future through the smallest of actions? Last Day of June tells the tale of Carl and June, a couple utterly devoted to one another and living in apparent domestic bliss until a sequence of events changes everything.On the way home from their favourite spot, an accident results in the death of June, leaving Carl in a wheelchair and destroyed by grief. Carl frequently wakes from nightmares of the accident, turning to the empty chair beside him and realising this is his reality.Playing as Carl, you manoeuvre your way around a darkened home which was once full of love and light, eventually mustering the courage to enter June's beloved art studio.The studio is filled with paintings of various characters who live in the neighbourhood. As Carl touches the painting of each character, he returns to the day of June's death and you play as the character depicted in the painting, with the goal being to stop June's death, while completing puzzles and collecting memories which paint a fuller picture of the couple's life together and their relationship to other characters.Each character has a part to play and as you progress through the story you realise this task is not as simple as it appears, making one change can result in a different series of events, not all being ideal. The challenge is to change each character's sequence of events, to ensure they play no part in June's death and, ultimately, saving her.The hook of this game is its ability to tug on your heartstrings. Imagine an interactive version of Disney's Up - most of the time I found myself in tears. The way the game conveys these emotions is a feat many games fail to get quite right.At the heart of Carl and June's watercolour world is a well-timed soundtrack, each piece weaving into the tapestry of the story perfectly. The story is inspired by the music of prog-rock genius Steven Wilson, who is renowned for his emotive and technically intricate work. Specifically, the game is based on characters created for his song Drive Home which was adapted into a music video by animator Jess Cope. Cope previously worked on Tim Burton's Frankenweenie and collaborated with developer Ovosonico to create Last Day of June, and her gothic influence is prevalent throughout.Characters lack eyes and mouths but the features they have tell us plenty about who they are. There's the peculiar-looking Carl with his bald head and round-rimmed glasses, or the hunter with his over-sized moustache and his wisp of curly hair. The Last Day of June fits a lot of character into such tiny details. And the real beauty in Last Day of June how it does so much with so little. Typically we can tell a character's feeling through their eyes or what they say, however this tale has neither. The language is unintelligible gibberish. Yet, you can feel Carl's intense grief-stricken frustration when he wakes without his wife and drags himself into his wheelchair. It is painful to watch and it relies strongly on body language. Such wordlessness ends up being incredibly powerful, and Last Day of June allows players to experience Carl's loss as though it were their own. The game entangles you in his love for June and their life together. It forces you to relive their happy memories, their tragedies and to come face-to-face with his frustration when he wakes up alone.This beautiful, melancholic game taps into the deep-instilled feeling in us that screams 'what if i could have done something differently?' when life deals us a painful hand. It's an experience that I'm sure will stay with you."}