{"ref": "https://www.eurogamer.net/r-shadowofrome-ps2", "date": "9 May 2005", "game_name": "Shadow of Rome", "text": "Order yours now from Simply Games.The most telling thing about Shadow of Rome was Tom's off-the-cuff reaction when he walked in and looked at the screen while I was busy hacking my way through one of its many gladiatorial sections. ~That's so Capcom!~ he guffawed, before dashing out of the room armed with two ludicrously impractical Tetris-shaped controllers (but that's another story).And you know what? His glanced utterance managed to distil the essence of Shadow of Rome better than I'll probably manage over the next one thousand or so. It just is so Capcom. Like 20-odd years of all its design, gameplay and artistic ethics compressed into this gladiatorial combat-cum-stealth romp set in 44 B.C. If you know Capcom you'll know Shadow of Rome. There. Job done. Skip to the score and walk away content.But you're not getting rid of us that easily, oh ho no. Having sufficiently teased with such a sweeping statement we've got to now hastily dig ourselves out of this self-constructed hole before the Capcom aficionados kick the soil over our heads. First of all it wasn't me that said it, all right? I just think he might have a point. Like most Capcom games it has a vast amount of potential, and like most games from one of gaming's most celebrated creative centres there's an irrational allure about it that makes you want to rip it out of the cellophane and pop it in the disc tray as soon as possible. Capcom could probably make a game about the accountancy profession and make it sound like potentially the best game ever. They'd call it Evil Numbers Crisis, and then the critics would celebrate the visuals and the atmosphere while simultaneously bemoan the slightly broken camera and controls.Ahem. And yes, having skirted all around the subject in a typically haphazard manner, what we're wrestling with is the fact that Shadow of Rome is one of those frustrating 'nearly' games that could and should have been brilliant, but for a number of reasons that we'll expand upon in a moment has tripped over its own mace and skewered itself on a nearby spear. Typical Capcom you might pontificate. But before we go and spoil our review construction any further with conclusions before introductions, we really ought to at least tell you how we got there.The year is 44 B.C, and the place is Rome at the height of its Empiric powers. Julius Caesar has just been brutally murdered in the halls of Pompey while on the way to a Senate meeting, stabbed 23 times and left to bleed to death in his robes. A middle aged man named Vipsanius is found at the scene with blood on his hands, but was simply unlucky enough to be the first person to discover Caesar. Framed for the crime, his fate appears to be sealed, and an execution is scheduled.But before the campaign gets properly underway, you're given a brief diversion into the different mechanics of the game; firstly dealing with the combat side of the proceedings as Vipsanius' muscle-bound soldier son Agrippa, and then the sneaky-stealth element as Agrippa's best friend Octavianus. Reconvening in Rome, Octavianus reveals the shocking news to Agrippa, but yet more family tragedy befalls the incandesant warrior before he's barely had time to comprehend what's going on.And from there the game falls into a discernable pattern between regular bouts of the world's most gory videogaming combat and sneaky one-hit-and-you're-dead stealth as this epic against-the-odds quest kicks off to free Vipsanius and bring to justice the evil men responsible for this vile corruption at the heart of the Roman Empire.It's easy to see why Capcom went down the road of contrasting the gameplay so strongly. It would be easy to get stuck in a rut as a gaming experience if you were constantly engaged in a blistering hackandslash the whole time. Likewise, a pure stealth experience would soon feel restrictive and frustrating, so mixing the two up ought to blend into a well-honed balance of two of our favourite gameplay types.So it's disappointing to learn just how basic, rigid and undercooked the Octavianus stealth sections are when held up against the standard we expect these days. From the very first to the very last they're just never that enjoyable on a basic level; at best interesting narrative devices that help add to the atmosphere, richness and suspension of disbelief of the scenario, and at worst tedious, exacting, basic and inconsistent.  Essentially, because of Octavianus' weedy frame you're completely hamstrung in the combat department, and have to make do with whatever props are dished out in each section.In the early part of the game you're mainly just trying to avoid basic yawning Roman soldier sentries that are almost as tiresome as they appear to be tired. Up and down they march in astonishingly predictable patterns like automatons devoid of absolutely any personality or intelligence whatsoever. Even when you accidentally (or deliberately) stir them from their sleepwalking patrols, they run after you for as long as you're in sight, then give up the chase as soon as the alert bar runs out. It's a Keystone Cops level of comic stealth, full of ~uh, where'd he go?~ and head scratching while you're crouching in a man sized pot right in front of them and gets little better no matter whether you've got a pot to smash over their heads, a rope to strangle them with or a banana skin for them to slip on.Bizarrely, even when you've apparently strangled them to death they will mysteriously wake up if another guard in range yelps in surprise, run after you and almost certainly kill you with one swipe. Yes, in Shadow of Rome there is no defence and certainly no attack once the alarm is raised. It's the sort of unforgiving stealth that's all about trial and error. And mainly error until you suss out exactly what it is the game designers wanted you to do. There's not a lot of experimenting or deviating from the main path they want you to take. Except when we accidentally threw a banana skin at a sentry guard's face as opposed to laying it down in his path. To illustrate how stupid the whole thing gets, he ran after us, we dodged him and entered the bar we needed to go access to in the first place. But because the game assumed we'd gained access the prescribed way, the guard didn't even bother following. D'oh. It's just so pernickety. Some guards quiz you something to try and catch you out, some don't. No Capcom, no. We just wanted to get back to the combat as quickly as possible; if only to escape the brutally repetitive lift music soundtrack that will drive anyone within earshot to drink [hic -Tom]. Having to repeat the stealth sections tens of times was only half the battle.Of course, the increasingly challenging Agrippa hackandslash sections take a lot out of you, but for entirely different reasons. It's one of the only games in recent memory that's blister inducing for a start, but not for any particularly good reasons, as the combat itself is relatively simple compared to other games we've encountered. All of the moves can be pulled off with consummate ease; it's more a case of timing, choice of weapon and context that provides you with one of 200 possible outcomes. Generally speaking, X and Square provide the main moves, and in most cases can also be charged up by holding them down. Triangle throws your weapon, while R1 acts as the game's auto targeting as well as providing a combination option when held down with X or Square.Even the most abject combat novice will get on with it, and on that basis it's a good inclusive system that doesn't take hours to learn, but not a button masher that will provide instant results. As we said, it's more about timing, and often waiting for your opponent to lunge and miss provides a window of opportunity for a counter. There are no blocks allowed, all weapons are limited and break after repeated use, some are one-handed and allow you to hold a shield in addition, while others are mighty two-handed implements of death. And all of them do very very bad things to flesh given half a chance.Probably Shadow of Rome's biggest selling point is the violence and gore. If the idea of buckets of claret and the most extreme death animations ever seen appeals to you, then this is the game for you. As we mentioned, adding up all the weapon permutations and the potential scenarios of when and where you strike your opponent tallies up to 200, which soon becomes a Pokémon-esque gotta gib 'em all obsession as you slowly rack them up.But ultimately the combat may be grisly and gory, and sometimes quite challenging, but you soon get the measure of your opponents in the first few hours. Once you start fighting your way through each city's gladiatorial arenas, though, things really start to heat up, with buddy AI based contests where you fight against a team with the aim of destroying their statues within a time limit, or a siege-style conquest with the aim to catapult rocks through a main gate and survive wave upon wave of increasingly hardcore foes. Such interesting additions add spice to the affair, but the same tactics get you through every time. It seems every time you get through you realise it wasn't that tough at all; you've just got to be patient, milk the applause at the right time, grab the best weapons and not charge in all guns blazing.Sometimes, though, the whole thing's just blatantly unfair. The collision detection is judged such that enemies can't harm other enemies (with the rare exception of when they cop an arrow, we noticed), so faced with a wall of growling swinging death, all flailing axes, spiky maces and freshly sharpened swords, they won't slice each other to bits by mistake, but often harshly combine their efforts to knock you for six. To borrow a quaint but somewhat inappropriate phrase, it's just not cricket. Of course, you learn all of this and try and run around in the hope that you can tackle them one at a time (or better still, swing a spear around and take the lot of them out in one fell swoop), but it would have been a better game were a semblance of realism to be injected. Instead of cheating.Removed from the pure gameplay argument, aesthetically speaking it's a game you'd have difficulty getting overly excited about if you happened to walk in on the somewhat bland stealth sections, but also one that definitely has its moments in the full eye of the combat storm. At its testosterone-fuelled best Shadow of Rome is trademark Capcom, with gigantic, roaring creatures full of bile and fury that terrorise the screen with their immense daunting presence, and intricately detailed blood-splattered arenas with cheering masses. And as is typical for games at this stage in the console cycle, the animations are slick, the characters exceptionally detailed and really give the game a presence at times. Then again at other times the environments are no more than cardboard cut-outs to flesh out the illusion of a living breathing Rome. But in truth most of it is no more than a tacky Hollywood set with cardboard cut-out civilians that utter drab sentences of little consequence. In this sense Capcom has let itself down because it had the opportunity to recreate Rome like no company has ever managed. It feels empty, the characters feel like nobodies. Next to some of its best efforts there's something oddly soulless about it.The other standard Capcom bugbears - camera work and control - have been almost completely fixed. There's barely a time in the entire game when a dodgy camera angle is an issue, and similarly no control hassles to blight the experience. You've more or less got full standard control for once, and in that sense there's not much more to add other than express some overdue delight that someone at Capcom is finally taking heed over the feedback that all of us have been busy stabbing in their face for many years. Now let's see it in some of your other games, please.As an audio experience it's pretty underwhelming by Capcom standards, with some truly annoying repetitive soundtrack moments that are spirit sapping in the extreme by just being so mind numbingly bland. The voice acting isn't bad in a kind of cod Richard Burton kind of way, and certainly a big leap on previous Japlish efforts, but not quite the same amount of effort went in here than, say, Onimusha 3, where some actual named actors added to the atmosphere and star billing of the experience. Shadow of Rome, although designed by Inafune (that-bloke-of-Onimusha-fame), doesn't quite have the game grandiose quality.In truth the concept of Shadow of Rome is superb on paper, and bits of it work really well. Once the combat stops being a one-button-win it builds into a genuinely captivating series of varied events and manages to present the futile bloodlust in an unsympathetic light, yet making the process of limb removal, beheading or carving someone's torso straight down the middle a thrilling experience. But given that 50 per cent of the game involves some inescapably poor stealth interludes that Capcom is evidently not experienced in pulling off you're left mumbling into your beer about a missed opportunity. One to definitely consider a rental of over a weekend, but we'd find it hard to justify a full price purchase, it pains us to admit.Order yours now from Simply Games."}