{"ref": "https://www.eurogamer.net/r-gtr-pc", "date": "9 May 2005", "game_name": "Reviews", "text": "Shop for games now with Simply Games.There are simulations, and then there's GTR. Simbin's lovingly crafted game observes such painstaking attention to detail that even an electron microscope would struggle to do it justice. It'd give the average Need For Speed Underground fan a nosebleed from 100 paces; and that's just in Arcade mode.Being a racing game fan and a racing fan are quite clearly two very different things, so I apologise in advance to the racing aficionados for my utter ignorance of what the FIA GT championship is all about. My excuse is I'm too busy playing the games to have a real life, okay? Don't hurt me. Apparently it's now in its eighth season and forms part of the LG Super Racing Weekend. As such, GTR leaves no stone unturned in its quest for authenticity, with all the supercars your heart could desire (over 70 race cars, including Porsche 911, BMW Z3 M and Viper GTS-R), all 10 circuits lovingly recreated (Monza, Donington, et al) and 70 AI opponents to, you know, pit your wits (or wit your pits) against. That's the perfunctory 'features' blurb taken care of: what about the game?It's important to note - before we get into how much GTR turns out to be a petrolhead's (there, we got it out of the way, third paragraph in, we can move on) wet dream - that it's not all about the simulation aspect. An arcade mode makes life somewhat easier on poor fragile souls not quite up to the rigours of big, hirsute, grown-up driving, with four difficulty levels allowing you to basically dip into any track and drive with any car.The Sunday Driver level is undoubtedly where most gamers will want to start, giving you a quick three lapper, every conceivable driving aid and a somewhat underpowered AI to give an almost guaranteed victory once you've got a feel for the handling and the track layouts. It's sad to note that we're apparently not much better than Sunday Drivers after 25 years of playing driving games, but this is what most gamers will face when they try and drive GTR like a videogame. It's quite clearly so above being a mere videogame. This is feckin' science at work here.Moving up through the ranks is as tough as expected. At first you'll routinely win any course with any car you choose. Move up a notch and they'll be snapping at your heels, but it's not tough to burst through the pack and take the lead. But the third of the four difficulty settings will wipe any trace of smug satisfaction off your chops as it suddenly becomes a real trial to get anywhere near the front, while staying there requires professional levels of racing knowledge; not just the right racing line, but the right revs, gears, you name it. Even an hour of determined practise will tame the flightiest soul. You quickly know precisely what you're up against. It's a brutal introduction to the main Semi Pro/Simulation dish which will really give any serious racing fan a run for their money, and probably lap them in the process and give a cheery wave.What is slightly surprising, given how far SimBin has gone in its quest for realism and detail, is how GTR simply gives gamers the option to race every car on every track right from the very beginning. Unlike virtually every other racing game released over the past decade, there's literally no structure, no bona-fide arcade championship or campaign mode to get stuck into. Just all the cars, all the tracks, off you go. I don't know about you, but I believe that the best way to encourage players to hone their driving skills is building a structured sequence of progressively difficult racing competitions that they gradually battle through. This is simple common game design sense, and without it you're literally offered everything, with barely any incentive to play any of it other than offering you much needed practise in order to stand even the remotest chance of being equipped to tackle the Semi Pro and Simulation modes.It doesn't help that from the very beginning you have a bewildering array of cars to choose from. As good as that might sound to old hands with an intimate knowledge of the car industry, mere videogamers who just want to be entertained by a decent driving game will doubtlessly feel slightly intimidated by all of this. Not only do you have little idea of how they compare to one another, you really won't know where to start. The best part of games like TOCA Race Driver 2 and GT4 is this sense that you're always getting better cars as you go along. You drive well, you get rewarded with a better car, and you can genuinely feel the difference instantly. With GTR it's a case of trial and endless error and with no prescribed learning curve to follow you'll simply flounder.If you're not already a massive driving buff with an oceanic reserve of patience then all of this choice will be lost on the casual player, which is admittedly how I approached the game. I'm somewhat torn by all of this: as much as it's somewhat nice not to have to go through hoops to get access to all of the good cars, it also means SimBin has effectively passed up the opportunity to coax the less informed driving gamers into what is in most other respects a remarkable achievement. More accurately, Arcade mode is simply a Practice mode by any other name. This game is crying out for a decent structure to provide the hook; as it stands it's intimidation by gaming.But if you're prepared to overlook the Arcade mode's deficiencies then there's a game lurking within with (almost too) much to admire if your head is already loaded with technical knowledge about the finer points of understeering on the apex, warming your tyres, adjustable seats (true), three dimensional curbs and all the intricate technical knickknacks you could possibly wish for. Some might find it utterly boring, but, really, this game is simply not for them. Be wary of this fact right away. Instantly accessible this is not. It makes TOCA look like Burnout.Essentially it's a case of plumping for Semi Pro or Simulation; the latter being largely the same apart from the obvious change of difficulty in terms of car control and minute amounts of periphery considerations in each race such as the 'behaviour' of the circuits (in terms of weather effects, rubber on the track etc) and the ability to turn off every single driving aid. Each mode comes with Race Weekend, Championship or Open Practice, each allowing racing fetishists to follow the exact same convention of practise sessions, qualifying - or just skip the lot and get straight to the main event.The main modes are simply a brutal illustration of racing gaming science. There's practically nothing more SimBin could have done to make the game any more realistic than it is in terms of the driving physics and how the car physically reacts to the environment. It's getting close to the limit of what you can do on a PC to recreate a driving experience. Of course, no matter how accurate the physics may be, there's still one very important factor no driving game could ever represent - that of actually being in the car itself. It would be very interesting indeed to see how a real professional driver gets on with GTR, because without the real force feedback of the road and things like peripheral vision there's simply nothing anyone can do to simulate that adequately without some insane hydraulics solution and a VR headset. SimBin has tried to solve the latter issue by even going as far as providing TrackIR support, which somehow manages to scan where you're looking and adjusts the in-game camera automatically, but without the necessary hardware I wasn't able to try that cunning-sounding feature out. You can always map it to a joypad (as I did with the rather excellent dual stick wireless Logitech Rumblepad 2, which comes highly recommended, by the way), but it's something of an added distraction when it's already really hard work keeping your car on the road as it is.In terms of the rest of GTR, as a visual spectacle you can't help but feel it's one of the only things left that could be improved in terms of accurately simulating the sport. As things stand, even with a beefy Geforce 6800 GT under the bonnet, the game doesn't quite leave us quite as breathless as we were expecting. The cars are truly exceptional, but what lets it down ultimately is the generally flat and lifeless trackside detail, a few inexplicable frame rate hitches (where the game noticeably stutters every so often regardless of resolution) and less than stellar weather effects. Sure, you can feel the difference when it's pelting it down, but we were left with the sense that what we were seeing didn't really do the handling effects justice. What we really need at this advanced stage in the PC's history is a next-gen racer that not only pushes the physics envelope but looks the part too. GTR never really gets close to that elusive sense of photo realism that we all want someone to nail at some point.What you're left with is a stunning simulator that true racing enthusiasts will be able to marvel at for months, but one that will be an incredibly daunting prospect for those of us just merely looking for racing entertainment. It truly goes off the scale in terms of difficulty if you've any intention whatsoever of playing it remotely seriously, and I've never come across anything quite this brutal. Even professional racing drivers would have a tough job, which begs the question whether it's really fair to rate it as an entertainment product? It's a marvellous achievement on paper, but our real-world experiences felt like a whole lot of hard work. Ultimately I have to try to score it as fairly as I can from our my perspective as a gamer who wants to be entertained and also appreciates what it's trying to do. There's definitely lots to recommend about it, and what you put in will be rewarded in time. But maybe I'm just not the sort of person that has the patience or the will to get so heavily involved, so take my opinion as a guide of simply what I think, not necessarily what its target audience thinks. Much like the driving in GTR, approach with extreme caution; the game's only as good as you are.Shop for games now with Simply Games."}