{"ref": "https://www.eurogamer.net/r-matrixonline-pc", "date": "8 May 2005", "game_name": "The Matrix Online", "text": "Order yours now from Simply Games.Neo24375 jacked out, ~Mission's gone bad.~Tr1n1ty turned to him, ~What went wrong?~~Pretty much everything.~No matter what you make of the Matrix films, the Wachowski brothers commitment to trying something with their trench-coated melange of leftist-pop ideas is admirable. When something goes as big as the Matrix did, the tendency is to simply comply to the consumerist process and sell as many toys to geeks as possible, Lucas-style. While they've hardly taken a Bill Waterson No-Calvin-And-Hobbes-T-shirts line, their involvement in all their spin-offs implies they genuinely care. It would have been easy to just give their Enter The Matrix title to a developer and leave them to it. Instead, they integrated it into the plot of the film in a devotedly cross-media exercise. Similarly, while they could have just licensed the Matrix name to any MMO maker, they're using it to actually continue their universe. Where the films stopped, the game continues and it's here where they'll tell the developing story of the Matrix.It's a big idea. It's admirable.Sadly, The Matrix Online, much like Enter The Matrix, is a piece of genuinely visionary computer entertainment which succeeds on all the levels except the one where it actually matters. That is, being a good game.~So, I was trying to rescue someone,~ Neo continues. ~Some counter-programs appeared. I tried to lead him out, but he wouldn't leave until I'd taken care of the attackers.~Tr1n1ty sighed, ~They never do, the ingrates.~Neo24375 nodded, ~I do the whole I-know-kung-fu thing, and come back. And he still wants me to get rid of the attackers before he leaves.~Tr1n1ty hmmed, ~But the attackers were dead?~~Exactly.~ Neo24375 nodded, ~Mission went bad.~Trin1ty nodded, in a similar, if more feminine manner, ~How many missions gone bad today?~Neo24375 replied monosyllabically, ~Four or five. I kinda lost count.~First things first.While it's become traditional for MMOs to release in a state which would get a single-player game torn apart by an army of avenging fanboys, after a few relatively clean launches it's no longer acceptable to lob a game onto the net and expect people to forgive when a game simply doesn't work properly.Matrix Online operates closest to City of Heroes, with you running missions for one of the three main factions in the world - Zion, Machines, or the Merovingian's Exiles. These tasks are divided into plot-related ones and standard missions, which follow a simple ~Assassination~ or ~Rescue~ format. Each, basically, takes the format of a paper trail, with you moving between destinations across the city, doing something there, and then moving to the next. Eventually you reach the terminus, and get some ever-appreciated experience points.Theoretically, anyway. In practice, Matrix missions have a habit of going bad at some point. For this particular Redpill, a significant proportion would end in failure when something broke, most often involving either an NPC not operating correctly or an item not functioning. At other times, a more generalised inventory bug halted progress, preventing you from picking up an essential item or uploading it via a hardline (aka ~Phone~). The latter can be circumvented by logging in and out, but it's hardly acceptable. Others are so bizarre that it's simply a case of quitting the mission and starting again.Even when it's not a fundamental error, the mission system often causes unneeded frustration. For example, sending relatively inexperienced characters into areas of the city which they or their team-mates are incapable of dealing with. When crossing the street on the way to the final showdown with your foes is more deadly than the final showdown itself, something is amiss. Even worse, any mission that involves guiding an NPC around the city reaches level of slapstick comedy not witnessed since hostage missions in Counter-Strike. You'll find yourself constantly turning around to make sure your chums haven't lost their way, become confused by a staircase or been attacked by a passing baddy.Ah yes. Combat.~Then, on the way back to the hardline, I got into a fight.~~Went bad too?~~Yeah,~ Neo24375 replied, ~There were three of them. One got me in hand-to-hand combat, and the other two pulled out their guns...~There was a moment of pained silence. No more words were needed. They both knew the score.Tr1n1ty scratched at her itchy natural-fibre jumper, ~Fancy an extended sex scene clumsily juxtaposed with a dance-scene full of grinding hippies?~Neo24375 thought about it, ~Perhaps later.~There are two sorts of combat in Matrix Online. Ranged attacks (including hacking attacks, which essentially act like Magic) operate in a similar manner to most MMOs. That is, you use something; it fires, and then takes a short while to recharge before it can use it again. You fire. You wait a set while. You fire again. It's simple, it's proven, and it works.However, there's a second type of combat: Interlock. Knowing that the Matrix's signature kung fu wouldn't look anything like its screen counterpart in the previous system, Interlock was developed for close combat. When engaged, you are linked to your opponent with the battle arranged into obvious rounds. In each round you and your opponent decide which attack you're using for that period, after which the statistics of each are compared, a random element added and somebody wins, damaging the loser. Formalising it in this way means that these attacks can be played out in beautifully animated fashion, with blows blocked, opponents thrown around, and so on. It mostly looks great, and captures the film's action well.Both combat methods basically work. By themselves. But when both happen at once, the game imbalances horrifically. You see, once you're inside Interlock, your next attack only takes place once the animation has played out. These are inevitably much longer than the time it takes for a ranged-combat timer to recharge, meaning that once Interlock is engaged the participants can be bombarded with attacks from the outer world. So while a martial arts fighter may perform one attack on his foe, and they one in return, anyone outside would have time for three-or-so bursts of machinegun fire against them. Standing there getting perforated by nine-millimetre shells while you wait for your opponent to get up is one of those unique Matrix-moments you'll recall fondly to your children.It gets worse. By the time you realise something is wrong, it's mostly too late to run. Because while in ranged combat you can exercise the normal MMO tactic of turning on the spot and moving in the opposite direction as quickly as possible [known, to me at least, as 'running away' -Ed], Interlock demands that you select ~escape~ as your attack for that round. And not only do you need Inner Strength to do this, it also takes a round. Since you have to choose your next tactic while the previous round is playing, you're looking at a huge delay before you can get out of there, and at least a round and a half of continuing damage before you can peg it.Oh, and certain sort of blows from your opponent can remove your ability to even select the ~scarper!~ tactic, leaving you stuck there until you've recovered. Choosing the ability also requires the expenditure of Inner Strength points (the game's equivalent of Mana in a Fantasy game, required for using special powers), so if you're exhausted during a battle it's entirely possible you won't have the points to do it. Finally, when you do manage to run, there's a slight delay before your controls return to you and the lurching nature of the camera leaves you fumbling to try and face the right direction to sprint away. Often this lapse is enough for someone else to select you for Interlock and the whole ordeal starts again.Avoiding Interlock and focusing on ranged combat would be the sensible thing to do, but then what's the point of all those glorious animations, which the team have doubtless spent whole lifetimes working on. Equally, you can't really avoid it, because your enemies can happily enter Interlock with you. Yes, there are ways to avoid getting involved with Interlock, but they are far from reliable.In other words, playing involves lots of deaths which really have nothing to do with your merits of failings, especially when the game does little or nothing to teach the player about the intricacies of how to work around the extremes of the system. This is actually a fairly general point for the game. While the game's got a mass-market licence, it's far more hardcore in terms of how it introduces things. The inexperienced Man In The Street attracted by the possibility of a trench-coat of his very own is going to be the one who bears the brunt of Matrix Online's foibles.As a final note, Interlock also has an occasional moment of going spasmodically wrong, with people facing opposite directions and then continuing to fight the air. It's fairly characteristic of a game which is rife with graphical glitches. The atmosphere, built up by a huge dedication to the world and ultra-fu fight animations, just disappears. How terribly disappointing for all concerned.Tr1n1ty looked for the silver lining, ~Anything good happen?~Neo thought for a long moment before answering, ~I got a really cool pair of sneakers.~Tr1n1ty grinned, ~Well, there you go then.~The clothes are nice. In terms of dressing up, it makes The Matrix Online look like City of Heroes for Goth kids. Want a pair of purple knee-high boots and cool tribal tats? This is the game for you.It's also got an array of other charms, which the game's players are going to huddle around to keep their spirits at least lukewarm. For example, while the awkward controls make it horrible to actually navigate the city, the metropolis itself is quite a technical feat. While World of Warcraft managed the streaming technology to allow you to wander as far as you like, The Matrix Online does it in a far more baroque landscape. Every building can be entered with no pause, and every floor visited. When you're inside each, the view from the window is actually the real view. The only problem is that due to the real world environment it makes the game look horrifically repetitive. If grey concrete and rain aren't your thing, you're out of luck.Perhaps best is the character development system, which uses the Matrix background to create mechanics to empower the player in a unique fashion. Rather than having any set character classes, at any level you've got a certain amount of memory available. Into this space you can load whatever skills you've want, as long as you've purchased them, and reconfigure your set up with a simple visit to the phone booth. The skills are arranged into a lengthy tree structure, with lower level abilities required as a bridge to the more powerful ones, so it's not just a case of grabbing the best of all worlds. Still, if you've the information (the in-game currency), it does mean you can effectively change your character class at any moment. The Interlock system finally driven you mad? Buy gunman skills and turn into a distance fighter, or swap for one of the hacker sets. It's unique, it's clever, it's flexible and it's Matrix Online's finest hour. Good work.The actual plot side is another strong point, with the Wachowskis' involvement clear. Apparently there's a team of actors playing as important NPCs. Clearly most players will never see them, but the possibility is still a thrill. Seeing the Matrix world develop, with regular scheduled events planned, with you as a part... Well, true devotees of the Matrix may manage to eke sufficient enjoyment here, but they'll have to wade through a lot of aggravating rubbish to really enjoy it. Though after Revolutions, true devotees of the Matrix will be used to that.The Matrix Online, then. It's just about possible that the game may evolve into something marginally more palatable, but it's not particularly likely. Even if the surface mistakes were removed, its problems are so fundamental to its design that it's hard to imagine it transcending into a serious competitor for the big boys.Which is a shame. But whether you believe it's real or a computer simulation, that's life.Tr1n1ty hmmed, ~So... what now?~Neo24375's jaw set firmly as he reached over to the battered retrotech console, ~I'm jacking back in. It's a virtual world, but the battles must be fought.~Tr1n1ty blinked, ~Really? After all that, you're going back into the Matrix?~Neo24375 plugged in, ~You must be joking. World of Warcraft for me. Bagsie the Rogue.~Tr1n1ty prodded his shoulder, ~Remember to take the Red Healing Potion.~~Will do,~ Neo24375 replied chirpily, before logging in and disappearing forever.Order yours now from Simply Games."}