{"ref": "https://www.eurogamer.net/r-cossacks2-pc", "date": "8 May 2005", "game_name": "Cossacks II: Napoleonic Wars", "text": "Order yours now from Simply Games.When is a real-time strategy game not a real time strategy game? Keep that question in the back of your mind. The answer will be revealed later.Cossacks 2 takes the formula laid down by its forebear, and stays true to the spirit of Napoleonic Real-time wargames by setting it in space and turning it into a console-orientated platformer. Jump, Welly-Wellington, Jump! Ultra-Napoleon must be stopped.Well, that's what's happening on an alternate Earth. In this particular shard of the multiverse, they decided that they'd rather do another real-time strategy game. While there's considerable changes, both in structure and mechanics (the game's economic focus has been trimmed in favour of more detail on the actual troop side), it's still very much about men in brightly coloured uniforms with matching muskets.Its most immediately notable aspect is the sheer massed ranks of men. Cossacks 2 allows you to have at least (ooh) many [I have to admire your deliberate lack of research -Ed] men on the screen simultaneously. Manufactured in your barracks one by one, the formations of 120 (or 45 for cavalry) are then manoeuvred en masse rather than as individuals. They only return to a singular state when their morale cracks, and they all leg it back to their origin. Here, if you can fill their numbers back to the limit, you can send them back into the field.You'll have noticed the word ~morale~. This is an important one for any player of Cossacks 2. Let's add another while we're at it: ~Fatigue~. Between the two, your success or failure will be decided. Morale is kept on a bar formation, rising and falling depending on the situation your troops find themselves in. If it bottoms out, they crack. One major influence on it is the fatigue bar. If that empties, it starts sapping at the morale. The major cause of loss of fatigue is walking around. Marching in formation a couple of hundred metres will completely exhaust a unit, leaving them vulnerable to a short sharp shock. And since, as noted above, this is essentially the destruction of the unit with no chance to reform in a traditional manner, it's clearly a Bad Thing.The way to avoid the communal heart attack of the entire British Army is either to rest regularly or to utilise the roads. When travelling on one of these handy paving pathways while in column formation, a unit will lose no fatigue. This means that the control of the travel network is of paramount importance in victory, and channels the conflict. Of course, column formation is rubbish for fighting, making you terribly vulnerable.If you're expecting some beastly roughness, arranging into rows will expose as many guns towards the blighters as possible (alternatively, if you're surrounded, the dramatic and fashionable Square is a good alternative). In fact, mentioning firearms leads neatly to how Cossacks 2's economics vary from most of its peers. While resources are usually used just for construction, here two have a more transitory use. Food is constantly used by your ever-munching armies, and a complete lack will lead to a major hit to morale. Coal is used as gunpowder, and is used up with each shot by your units. The period is one of the few where you could actually get away with using coal, due to the extreme time needed to reload. Since you count your shots, you know roughly how many volleys your resources will allow you before they're exhausted.What increases the tension is that a gun's effectiveness is inversely proportional to the distance to the target. Holding Alt reveals the area zones. Fire in the green and you'll probably do little harm. In the amber, expect some damage. Wait for the extremely close Red, and it's utter devastation. While most fights end in hand-to-hand, it's the actual timing of each side's volley before engagement which decides most fair fights. Luckily there are a few ways to make sure that fights aren't fair. High terrain extends range (particularly devastating with cannon). Stay stationary in line for a while and your troops arrange into the incredibly defensive holding ground, gaining bonuses. However, that leaves them highly vulnerable from the rear and flanks. Essentially, Cossacks 2's battles are ones of supply, position and morale. It's a distinctive mix.In terms of structure, there's a mixture of the game standards, with a few twists. Skirmish mode, Internet play and a narrative campaign. The skirmish only has ten levels, with no random mode, which is a clear weakness. Internet play allows you to play in a skirmish fashion against other humans. No, really. The campaign is your abstract introduction to the game's foibles, a task it manages to perform with admirable mediocrity. Certainly the missions aren't particularly interesting, and there's a rather overenthusiastic difficulty gradient at work. The plot, such that it is, is inherently ludicrous, with any real amusement caused by some particularly ill-chosen American voice-acting. A special nod must be made to the section where the subtitles state a ~Huzzah!~ while the actor appears to yelp ~Yee-haw!~Other modes are more interesting, underlining its position as a historical game well. Firstly, the lesser seen historical missions section, which allows you to play through tasks more directly inspired by the period. Even more interesting is the Battle for Europe mode, where you step up from the tactical scale of the conflict to an overall strategic map of Europe. While you'll initially compare it to the similar section in the luscious Rome: Total War, it's actually far simpler. Rather than playing like Civilization, it's more like a slightly glorified Risk with each region giving your growing (or shrinking) Empire more resources, and your General gaining experience through conflicts (thus allowing him to command more troops). While far from genius, it provides a reason for playing battles far more enthralling than that of the more traditional campaigns. Also, rather than Rome's ~Just Kill 'em All~ approach, you're given secondary missions which you can accomplish to gain more needed resources or experience for the commander. For the single-player, it's definitely the most interesting part of the game.Probably the most important thing about Cossacks 2, however: it's hard. I found myself losing incessantly. While I wouldn't lay claim to any Napoleon of the RTS-esque mantle, the amount I was thrashed about you'd be thinking I'd chosen to invade Russia in winter or something. And then came a single moment of clarity, which made everything click into place.It was the moment when I pressed pause.Now, the majority of modern RTS games feature the ability to give orders in pause mode, but it's primarily used to take stock in a difficult situation rather than a constant crutch to your tactics. Not in Cossacks. It's not that you have a lot to think about and do (Well, you do, but that's not the real problem). It's that it has to be particularly well timed, and if you mess it up, that's the battle decided.Let's take a hypothetical example to illustrate the point. Consider you have two lines of troops at either end of the battlefield, facing off against similar number of opponents. They're standing still, just outside each other's close attack range. You could shoot now, yes, but it'd be far less damaging than if they were a few steps closer. So you're skipping between the two sides of the battle, trying to catch the moment when one or the other makes the necessary advance. Yes, you could take the initiative, but the computer will almost certainly get the first shot off, and the opening volley can decide many conflicts. After all, only the survivors return fire.So, you catch one stepping forward, and now sit, finger hovering over the mouse button for the moment when they cross into the red danger zone. Pull it off right and the massed belch of smoke and flame is enormously satisfying, as an entire row of Johnny Foreigner goes down. However, while you've been doing all this waiting, your attention is entirely removed from the other side of the battlefield. If they advanced when any of this is going on, that's the initial attacks in their pockets. And if you spread this across a larger battle, with more than two battle lines, it becomes more exponentially more difficult to control. While you can order the troops to fire at will, they'll loose their shot at long range. The only way to maximise your killing potential is to constantly abuse that pause button. In a very real way, in the heat of the battle, you don't even have time to scroll the map.So, to answer the initial question, a Real-Time Strategy game isn't a real-time strategy when there's no strategy in real-time. Real-time is just pay off for the decisions you made while suspended between seconds. Against something with the seeming omnipresence of the AI, you've got no choice but to play in this manner.(And, yes, that's a cue for some superhuman player out there to mock the reviewer's non-l33t status. I'm sorry. I only have human neurones, and they've been battered senseless by years of Robotron abuse.)It's not necessarily a bad thing, but it's certainly a thing. And, for this reviewer, a bigger thing than any of the game's more obvious attributes dictated the experience. It gives the game a deeply stilted rhythm while playing solo (though that clearly isn't an issue when wrestling with a similar human intellect). It also means you lack the time to actually appreciate the game when it's at its most exciting. Compare it to the (admittedly much shallower) Dawn of War, where you can admire the march of Dreadnoughts through marine flesh. Here, you don't get the chance to really appreciate the elegance of a cavalry charge, as there are half a dozen things you need to check up on.There are also some awkward technical aspects to face. While running mostly well, I've had several nasty system-freeze crashes while playing. While the AI's mostly capable, it does have some odd holes in it, and gets particularly confused about fighting against cannons. Also, despite specs comfortably above its recommended, I experienced some persistent frame rate problems when the game starts reaching towards the larger conflicts. At its worst, the game set up a border-fortress overlooking the realm of unplayability. When a fair chunk of the game's appeal is such massive conflicts, that's a real fault.Which leaves Cossack's 2 a curious mix. Some undeniably strong and distinctive pieces of game design, tarnished by some elementary errors, such as the lack of a decent training program or real in-game help. The limited skirmish options are a depressing, and the Battle for Europe mode - while initially charming - fades with worrying speed into repetition. Technical and occasional control errors settle Cossack 2's fate. If there's one genre where the PC has enough quality to afford to be picky, then it's the RTS. Cossacks 2 will find an audience among a certain, more sedentary, strata of Wargame fan. Everyone else, unless they have some Napoleon complex that needs urgent satisfaction, has an army of better options awaiting inspection.Order yours now from Simply Games."}