{"ref": "https://www.eurogamer.net/r-batenkaitos-gc", "date": "8 May 2005", "game_name": "Baten Kaitos", "text": "Order yours now from Simply Games.Few would have believed, a scant couple of years ago, that the day would come when a GameCube would be an essential platform for any fan of JRPGs to own. After all, if there was one field where the PlayStation thoroughly trounced the N64 (and let's be honest, there were quite a few), it was RPGs. Their sprawling scale and love of full motion video and detailed backdrops were far more suited to the CD than to the cartridge, and Nintendo's falling out with Squaresoft was a final hammer blow to the platform's chances of seeing much in the way of RPGs headed its way. For a long time, we thought the Cube might suffer the same fate - and indeed, for quite a long time the only decent RPG on the platform was Skies of Arcadia Legends, which was unquestionably excellent, but merely a slightly touched up port of a Dreamcast game.The last few months have turned that around to quite an extent. Tales of Symphonia easily rates among the top five best RPGs of the current generation, Paper Mario: The Thousand Year Door is a departure from the traditional style but still absolutely excellent, and what do you know? With only a few months to go before the launch of the new Legend of Zelda, one of the most promising action RPGs in a long time, here's a little-known morsel from the Far East to keep JRPG fans nibbling contentedly and keep the dust off the top of those GameCubes.Baten Kaitos: Eternal Wings and the Lost Ocean (or Baten Kaitos and the Ridiculously Long Subtitle as it's known around here) is the second project to emerge from Japanese studio Monolith (not to be confused with the significantly less Japanese studio of the same name which is behind the likes of The Matrix Online and FEAR), a team largely made up of ex-Square developers who jumped ship to work on RPG titles for Namco. They're best known as the people behind the epic space opera Xenosaga, but in between Episodes I and II of that series, they also squeezed out this little contribution to the GameCube's repertoire - which, despite the fact that we Europeans apparently aren't worthy of the rather more famous Xenosaga, is now arriving on our shores. Rejoice!Let's get some basics out of the way, so that you can get your prejudices in order before we move on to the meat of the review. Firstly, this is a card battling game. Yes, recoil in horror; every action you take during the game is dictated by a shuffled deck of cards, known as ~Magus~. Secondly, this may be 2005 and the Cube may have proven itself more than capable of producing graphics on a par with the best the Xbox can throw out, but Baten Kaitos harkens back to an earlier age - combining pre-rendered 2D backdrops with 3D character animations and effects. A 2D card battling game? How does that grab you? No, look - come back. Don't stop reading.The fact is that Monolith have taken these two fairly unpromising core elements and woven them into a game that's significantly better than any 2D card battling game has a right to be. The card system is varied and flexible, and has been used to create a unique battle system that relies almost as heavily on your reaction times as on your strategic skill, while the 2D backdrops are not only incredibly detailed - to an extent which still couldn't be managed in 3D - but are also touched up in real-time with incredible lighting and animation effects which make Baten Kaitos into one of the most beautiful games we've seen on the Cube. From being a 2D card game to being a stunningly beautiful RPG with a unique and rapid-fire battle system - victory from the jaws of defeat!That battle system, then. When you walk into an enemy (you'll be pleased to hear that there are no random encounters), you transition to the fully 3D battle screen. Each character and enemy gets an Offensive turn - so far, so normal - and when attacked, gets a chance at a Defensive turn. On each turn, you're given a set of cards at the bottom of the screen, randomly shuffled out of your ~deck~, which can include weapon attacks, magical attacks, armour, healing items, status effect curing spells and what have you. You pick a number of these cards and they are played in turn against the creature you have targeted, creating a combo whose damage is totted up at the end. On your defensive turn, you have to rush to pick appropriate armour or defence cards while your opponent plays offensive cards against you.Simple? Like any good game system, yes - but there are all manner of complex elements for you to master as well. For a start, there are some impressive special attacks which can only be executed once you're into a combo, and there are six elements with opposed effects which cancel each other out if used in the same combo (so no firing off water and fire spells at the same time, for example), but can also be used to cancel out elemental attacks in your defensive turn. Then there's the fact that your cards ~age~ throughout the game, so that bamboo shoot you were using to replenish health earlier may suddenly turn into a bamboo spear that can be used to smack enemies in the chops, or that apple may become a jug of cider. It's a slow process, but one worth keeping an eye on.Another interesting aspect is that while cards you use in battle never disappear - even healing items - those which you can use from the menu outside battle are single-use only. As such, it actually makes more sense to heal up during a battle, because you can do it for free, although obviously it does introduce a certain element of risk to the proceedings since you're healing next to a slavering beast with ravenous fangs. I don't think you'll find that one in the Boy Scouts Survival Guide.It's not that the battle system doesn't have some problems. It was incredibly frustrating, at times, to take terrible beatings in battles just because we were dealt useless hands of cards - all offensive items in a defensive round, or vice versa. The random nature of the system makes it more interesting in general, because no two fights are the same, even against the same enemies, but can also lead to the odd situation where you lose a battle, reload, walk to the same enemy and kick its teeth in mercilessly, with exactly the same characters and deck. It's rare for this to happen, though, because the difficulty curve in the game is nicely stepped - and it's been designed so that dungeons don't escalate in difficulty as you push through them, since although you gather XP in dungeons, it's impossible to level up until you enter a town and pay a visit to the church, which prevents the usual nonsense of running around levelling up before facing a boss.The flaws with the battle system are initially frustrating if you're used to the fine-tuned control that traditional RPG systems give you, but you get over them quickly and settle into really enjoying the battles. This is just as well - because while the battle system may be great, and the 3D-on-2D graphics may be stunningly beautiful and varied, the story and characters in the game leave quite a bit to be desired.The story of the game focuses on Kalas, a not particularly likeable youth who's out to get revenge on a tragically clichéd evil empire that killed his grandfather. Kalas lives in a fantastical world made up of islands that float in the sky, where the surface is nothing but a legend and the people have wings. Well, most of them - Kalas, being awkward, has one wing and a mechanical one to make up for the imbalance. On his quest to find the men who killed his grandfather (yawn) he encounters a young girl named Xelha with magical ability (no, really) who is, amazingly, after the same men (you don't say), who are soldiers of a creepy evil empire (shockingly). Kalas and Xelha proceed to ignore the warnings of a village elder (honestly!) and accidentally wake up an evil god of legend. Well, blow me down.Sorry, that all sounded rather cynical. The fact is, however, that Baten Kaitos chooses to start with a whimper rather than a bang, and while the story is held together quite well by the increasingly fantastical and beautiful locations you travel to, it never really rises past the same familiar old RPG clichés that other storytellers in the genre have been trying to move away from for years. In a game with a less enjoyable battle system, this would be unforgivable; as it is, Baten Kaitos maintains an uneasy balance that keeps you playing through despite not really caring that deeply about the characters or what happens to them. I know, defeating evil empires and dark gods should keep me on the edge of my seat - but I've played a lot of videogames. I feel unaccomplished if I don't defeat at least three dark gods before lunch.The game does exhibit some of the design brilliance that characterises its battles and art direction elsewhere, to give it its fair due. One element I really enjoyed was the constant breaking of the fourth wall - involving the player, referred to throughout as Kalas' Guardian Spirit, directly in the gameplay. Your characters refer to you by name, ask you questions directly, and turn around to look out of the screen straight at you - a real break with traditional RPG conventions (although Fire Emblem does something similar) and quite a nice addition to the game. The music, it should be noted, is also absolutely excellent, with Motoi Sakuraba contributing a score which easily matches the beauty of Yasuyuki Honne's art direction. Unfortunately, the voice acting is a bit of a letdown, and some odd sound mixing decisions make the already very stilted characters sound as if they're speaking underwater. You'll probably find yourself turning the voices off pretty quickly, to be honest.Baten Kaitos isn't up to the standard of the last two RPGs we saw on the Cube - Symphonia and Paper Mario - but it's still a worthy addition to the platform's small but very high quality range of Japanese role-playing titles. The unique battle system and beautiful graphics and music really set it aside from anything else that's recently appeared in the genre, and somehow the quirky style of the whole thing feels more at home on the Cube than it would be on either of the other consoles. While the story and characters are unfortunately very weak, Baten Kaitos is easy to recommend to anyone looking for an RPG that focuses strongly on gameplay rather than storytelling.Who'd ever have thought we'd be saying that about a game from the makers of the cut-scene-heavy Xenosaga, eh?Order yours now from Simply Games."}