{"ref": "https://www.eurogamer.net/r-snowblind-ps2", "date": "7 Mar 2005", "game_name": "Project: Snowblind", "text": "Order yours now from Simply Games.There's probably some kind of unwritten journalist's code that states that you can't do corny DJ-style links between the title of a game and the weather [there is? -What's New], but given that god is busy shaking off his dandruff outside my window as I write, I feel I've got a decent excuse this time. Even Crystal Dynamics can't resist the opportunity to throw in a few puntastic opportunities, with the central character of Snowblind going by the name of Nathan Frost for gawd's sake. Someone lock us up before it all goes pear.But just as London snow gives us a dizzy thrill for a few minutes as we all watch mouths agape at the pretty scene, there's always the knowledge that the urban hell gives it almost no chance to settle long enough for us to have fun with it. And if you haven't seen where I'm going with this already, much of that same empty joy struck us about this pretty little one-time-Deus Ex spin-off.Stripped of its associations with that critically revered but commercially stunted brand a long time ago, Snowblind still carries that weight of cultish expectation and has tempted those in the know with its familiar near-future cyber thriller setting and Warren Spector associations. The look and feel - for a start - are more than a little similar, but the similarities are barely more than skin deep. It's, as we suspected all along, the 'action' DX. As in action minus the role-playing overtones. Linear action as in Medal Of Honor. A sci-fi FPS where you'll never be stuck or left in any doubt what to do next. Just what the masses want, in fact.Dumbing games down to appease the less skilful, less patient audience is a moot point among most gamers who want a little more than a game that almost wrenches the joypad out of your hands and plays itself for you. If you're the kind of gamer that likes to be challenged it's best not to get your hopes up too high. First of all, even though there are 18 delightfully rendered levels that ooze with atmosphere to wade through, it'll take the average gamer no more than 10 to 12 hours to see all there is to see. The first half of the game is almost embarrassingly forgiving, leaving the gamer precious few opportunities to mess up thanks to the designers' fondness for leaving as many medipacks as possible strewn around.And although the number of weapons and augmentations at your disposal are exceptionally fresh, innovative, and downright impressive, they turn Nathan Frost into the most overpowered gaming cyber hero there has ever been. As fun as that probably sounds on paper, in practice it just feels like you're not being tested to any great degree. At the greatest extremes it feels like you're running around in God mode, blatantly cheating as you come back from the 'dead' with a Nanoboost yet again.Apart from the health pack-a-go-go, the heart of the issue lies with some of the augmentations that Frost winds up with as the game progresses. Now, although every new ability you get is immensely cool, there's simply an issue of balance to contend with; in the sense that it's almost always tipped in your favour unless you're just being plain reckless. Top of the list in terms of allowing you to plainly cheat is the Ballistic Shield which effectively makes you invulnerable for a good 20 seconds or more, making it possible to clear even the most stubborn wave of enemies with no damage whatsoever. Others, though, feel much more strategic and work far better in giving the player a sense of being able to approach dangerous situations much more tactically.Invisibility is the classic example in that you could try and sneak around instead of the default tactic of charging in all guns blazing. But as much as the game occasionally tries to offer a change of pace there's rarely any real need to explore that side of it when instead you can hack into a giant combat bot and take out anything that would have caused you trouble instead.As far as the other augmentations go, the Vision ability only becomes anywhere near useful near the end of the game when cloaked enemies start (dis)appearing, the Electric Storm ability arrives late on only to be somewhat ineffective, while the inevitable appearance of the Bullet Time-style slow motion ability comes in handy now and then when things get utterly hectic but never feels like the best option.The simple fact is you're always far better off saving your Energy reserves for your Ballistic Shield and using whatever weapon/grenade combo is best at dispatching the enemies you're facing than wading into combat unprotected. Try as you might, using any of your other abilities just seems like folly, yet at the same time you can hear this inner voice berating yourself for using Snowblind's get out clause.But it's not just the five billion health packs (almost every one in a wooden crate for some bonkers reason) or an invulnerability shield that makes the game too easy. The ability to go back and record your progress at any point at the nearby save stations lends a hand, as does a selection of immensely powerful weapons. Or lightweight enemies with slack AI, depending on how you look at these things. We're more inclined to blame the enemies, to be perfectly honest. The weapons are absolutely brilliant. Probably the best futuristic arsenal any game we can recall has offered. Sure, there's nothing necessarily stand out inventive about most of them (Pistol, Shotgun, Carbine, Sniper Rifle, yawn), but once you start getting to grips with the Fletchette, Laser Rifle or the DCH electrifying gun of death it's a more interesting prospect when having to decide on the spot whether you need a more flesh ripping gun or one to mash up their electro magnetic pulses.With this kind of dynamic there's huge potential here. And towards the latter third of the game the challenge ramps up sufficiently to make some of the levels genuinely memorable and among some of the best FPS encounters we've had on a console. But in truth the game is hamstrung by always handing the player the initiative. Enemies largely serve as little more than cannon fodder in that they appear, stand their ground and rarely give chase. More irritating chasing armies of Spider Bots, or gangs of enemies that hunt you down, would have been preferable, but no matter how often your buddies appear and do their own thing there's never a true sense of battle - and ultimately that's where Snowblind fails to live up to the star billing it could have so easily reached.While we're on the subject of buddy AI, the game was supposed to offer more emotional attachment to your pals, but does no more than any other Medal Of Duty: Call To Valor type game has ever managed. They storm in with you, fail to take decent cover, get killed alarmingly quickly, et voila. Amusingly the end of the game shows you a hall of shame of fallen comrades (presumably your fault, right?), but quite how you're supposed to stop these lemmings putting themselves right in the line of fire isn't really that evident given the lack of squad commands. I'm sure you'll do just what I did. Ignore them and look after number one.Like most shooters, Snowblind suffers from that perennial problem of none of the AI enemies having any degree of self preservation. It's all a case of charging in regardless of how close to death they are. When is a game going to come out that ever bothers to reflect that sort of cowardly scurry that comes to us all when we're about to pop it? To be fair, Snowblind doesn't do that much differently to most of its contemporaries, but it just seems more evident here as it's that much more forgiving for the majority of the game.After giving the core of the game a bit of a mauling for one reason or another, you'll probably be trying, as ever, to work out how a game we reckon is so fundamentally flawed can still score so highly. The simple fact is for all of its obvious weaknesses (which are probably more apparent to someone who has played 46 FPSs in the last 18 months), it's still really bloody enjoyable. At no stage does it ever feel tedious or uninvolving, and gets a real shot in the arm thanks to it ranking as one of the most atmospheric shooters I've seen on a console - or any platform for that matter.You could argue that the very fact it keeps the player constantly moving forward makes you want to keep going all the way to the end. Snowblind definitely isn't one of those maddening games that you'll resent for having some arbitrarily bloody minded section that you can't get past. It's ten hours of almost constant entertainment, and one that over three or four short sessions leaves you feeling truly entertained and satisfied in the main; if it were an action movie it'd be a popcorn blockbuster that doesn’t wilfully confuse its audience or make anyone have to think too hard. By the end you can wearily nod that it didn't exactly break any boundaries, and maybe moan that the director could have been a little more ambitious and less mass market, but you appreciate it for what it is, as opposed to what you want it to be. Whichever side of the fence you sit on, you can't deny the game has its strong points and is exceptionally well put together.Inevitably you can't talk about Snowblind without addressing the fact that it's probably the best looking FPS to ever grace a PS2. How on earth Crystal Dynamics has managed to squeeze this level of detail and performance out of Sony's perennially difficult to fathom machine will be a question more than a few developers out there will be puzzling over, but without exaggeration Snowblind's engine is a revelation. Although the lack of widescreen support does let it down a notch, you'll barely care once you're revelling in an exquisite environment with an atmosphere so palpable you could almost breathe in it. It's simply rammed with tiny touches that draw you through the game and make you wonder what's coming next. Every steaming vent, every flickering console all adds to the sense of being part of the world.And although the game is largely a linear affair, the levels are designed in such a way that often you're backtracking to previously visited areas - only to then see them disintegrate; maybe allowing you access to a previously off-limits part. It's far better than merely continually going in a tedious straight line, and while the sheer level of detail has ensured a tight environment it never feels anywhere near as constrained as you might imagine. Alternate routes crop up through the now-traditional air vents to allow you a safer passage, or vehicles become available to occasionally allow you to speed through a wave of sentries or possibly open fire on them with weapons of mass destruction.Although the cut-scenes, voiceovers and soundtrack are fairly throwaway chest-beating fare, we've seen far worse sci-fi fodder. Much of what you're doing in each mission is a little hackneyed if you break it down but no worse than what we gamers are fed routinely. The important thing is it rarely outstays its welcome and the audio never delivers more than a fairly airy ambience that washes over you. I was happy to let much of it drift past. I never felt like making notes on what was going on; it didn't really seem to be all that important, and when the end baddie was swiftly despatched on my third attempt and the panic-stricken ending played out it didn't leave much of an impression. Equilibrium was swiftly restored; we weren't really in too much danger. The thing is we've been here before, and that's probably Snowblind's problem, all told.Much of the criticisms of Snowblind are ultimately down to personal preference. You might like games this short or ones that let you win. If that applies to you then you'll have a blast with the myriad of gadgets and abilities, fall in love with its technical brilliance and rank it up there with your favourite shooters. The one per cent of you that play online console games (or have the patience/ability to set up a PS2 LAN) will no doubt also be very enamoured with the prospect of 16-player support. It's hardly going to trouble Halo 2 in the multiplayer stakes, though, with a bunch of fairly generic CTF and Deathmatch modes to try out; but in context it's arguably one of the better PS2 Online games around and certainly recommended on that basis with a decent amount of customisation to make things more interesting. It's slightly self-defeating to not support split-screen multiplayer, although admittedly the maps would simply be too big to have a decent match, they could have, you know, designed smaller maps for smaller matches? Just a thought.Snowblind deserves to succeed. It's clearly been tailored for a certain audience and one that's bigger than the hardcore minority that generally gravitate towards sites like these. On the other hand, Eidos and Crystal Dynamics needs to appreciate that by chasing the money, they alienate a section of people that have frankly seen all of this done before and done better with more of a challenge. We really wanted to rave about Snowblind; we appreciated what it was trying to do but in the end it holds the player's hand to such an extent that you just want the stabilisers to be kicked away so that the game can fulfil its obvious potential. Still utterly entertaining, just a little vacuous in truth. If you fancy the idea of action-oriented Deus Ex then a rental is completely essential as you'll easily romp through it inside two evenings. It's just tricky to justify owning Snowblind it at full price.Order yours now from Simply Games."}