{"ref": "https://www.eurogamer.net/r-settlers5-pc", "date": "2 Mar 2005", "game_name": "The Settlers: Heritage of Kings", "text": "Order yours now from Simply Games.It's a bad time to be a fanboy.If you want an overarching theme for the last couple of years on the PC, then it's the tender hopes of the devotee being stomped upon. You buy your identity into a videogame, only for a sequel or - hngggh - ~re-imagining~ to Kill The Woman You Loved. Cue screaming. From the reactions all over the web, you may suspect that certainly developers actually did creep into gamers' houses under cover of night to kill the family, have sex with their expensive furnishings and then leave the toilet seat up at the exact moment to annoy to the point of apoplexy a passing aunt.Sometimes it's hypersensitivity in the community. A good recent example would be Thief: Deadly Shadows, who - among its sins - raised hackles for swapping one means of wall climbing for another. It's clear that if the original Thief had climbing gloves and it was Deadly Shadows which swapped it for a rope-arrow the indignant cries would have been just as piercing. Equally often, however, there's more of a kernel of truth to the complaints - in fact, sometimes a kernel of sufficient size to, if set rolling, crush decently sized settlements.Some sequels are rubbish. Some are just inappropriate. Some are both. Increasingly, it's a simple case of using a pre-established franchise name to tag onto a game in hope of attracting a little attention and an initial audience. From such thinking comes such horrors as X-Com: Enforcer, where the classic game of turn-based counter-xenoterrorism was used to base a regressive third-person alien-blaster around.Yet sometimes a developer manages to sneak a quite frankly ludicrous use of a franchise into a gamer's affections. Most obviously. Nintendo have made a career of it to the point where they could release Mario Antivirus (Itsa Me! Mario! There's a Trojan on your C: Drive!) and no-one would even raise an eyebrow. On the PC, cast your attention towards current critical fave World of Warcraft. That's as extreme as if Ion Storm had said the next Deus Ex game would be an RTS, but it's addicted a sizeable portion of the free world.I suppose the lesson paraphrases to ~Command and Conquer: Renegade wasn't a bad idea. It was a bad game~. It's important to remember that difference.Which leads us to Settlers: Heritage of Kings, which doesn't. It's the fifth in its lineage and not really much of a Settlers game at all.A good way to see whether a game has been fundamentally altered is to glance down to the genre box. Previously, you'd have seen ~Management~. Now you see ~Real Time Strategy~. Now, glance up to the mark. A thoroughly mediocre five.That's it.Really, you can go now. It used to be a management game and now it's an RTS, and it's not very good. There's not much more to talk about. If I wasn't afraid of the comments thread calling for my head, I'd spend the remainder of the word-count rambling about the ramifications of corporate (and designers - I remember tales of the stickers on Programmer's PCs at Core circa the fourth Tomb Raider of ~Die! Lara! Die!~. Who can blame a developer for thinking ~Screw This For A Game Of Soldiers - let's try something different and stop worrying about the regressive slobs who just want the same thing but a baby-step bit better, forever~. Maybe Angel of Darkness was less a game than a cry for help. ~Don't make us have to make another one~. And lo! It worked) attempts at franchise subversion than spend another word talking about this almost brutally average real-time strategy game.See: I've put such a huge bracketed comment in the middle of a paragraph that broke any flow to the argument whatsoever. I'm so deeply uninspired I find myself sabotaging my own work. Why should I care when the developers seemingly didn't?Now, I haven't spent considerable time in the company of The Settlers since its first iteration on an old-skool Amiga that had a tendency to shudder when the milling of the tiny people got too much, but even to me it's clear that the game has changed to the point where it's simply unrecognisable. While the importance of combat crept up over the iterations, the centre of the game was creating a bubbling economic infrastructure where wood-choppers cut wood to bring to a saw-mill to make into beams which were taken to the giant-sized impractical Rolf Harris replica factory to be assembled into a giant-sized impractical Rolf Harris replica. Settlements were huge, and the game really one of micromanagement of resources.Here, while the settlements are a little larger than the average RTS, it's really not. Five resources are gathered from assorted Stone, Wood, Clay, Iron and [~Sulphur~ - Ed] deposits, magically added to reservoirs which can then be spent constructing more buildings and/or pay for units of troops. A little complication is added due to the ability to alter tax levels, force-work the settlers who are inside each building and that each of the workers require both housing and feeding for optimum performance. The settler cap can be expanded by constructing a new settlement centre on - er - a settlement centre spot. Occasionally you're attacked, in which case you'll need troops to defend yourself and often you'll have to attack someone else, in which case you'll need troops to march in and tear down buildings.It's an RTS.As well as the standard unit types which I dare say you'll be able to recite a complete list of without even knowing anything about the game, in the same way that you know the first-person shooter will have a shotgun in, there are hero units who have special powers which can be activated to help in combat. An original feature, for sure. Sadly, not Blue Byte's.Basically, Warcraft 3, without Blizzard's craft. Or, really, much of the war. Combat lacks any real deep tactics due to the relatively slender selection of troops, though the acquiring of experience and the ability for unit leaders to replenish to full strength as long as they survive means you do pay more attention to their survival than most games. While there's multiplayer online play, it lacks a truly dedicated skirmish mode to sit alongside the single missions and the fairly limited campaign. Equally, while vaguely promised by the developers, there's no mission construction kit yet, meaning what's in the box is all that you get. Compared to any of the major RTS of the last year, it's simply not enough.Time to say something about the plot. Boy who's actually King's son collect parts of amulet to - well - give a vague thread to hang the campaign on.Time to say something about the tone: Playful and light with lots of people trying to be funny. Occasionally, they succeed. Mostly, they don't.Time to say something nice about it: It's fairly pretty. Stick that on the box, Ubisoft.In short, by losing virtually everything that made the Settlers unique, Blue Byte has ended up with something that - somewhat predictably - that's the same as everything else, but not as good. From an original to the photocopy of a photocopy of a photocopy.To the distraught Settlers fans, to badly paraphrase Oasis, don't put your life in the hands of a videogame franchise, who'll only throw it all away. For modern-age economic micromanagement, I'll suggest a long, slow boat down the Nile to the City of Immortals. You'll like it there.There's no need to settle for this.Order yours now from Simply Games."}