{"ref": "https://www.eurogamer.net/r-gtasanandreas-ps2", "date": "8 Nov 2004", "game_name": "Reviews", "text": "Order yours now from Simply Games.At a time like this when you've got a game with such massive expectations heaped upon it, it's almost futile trying to offer anything but the most positive comments you can possibly come up with. With Grand Theft Auto: San Andreas, where we've been fed more pre-release information and preview opportunities than just about any game in history, it seemed impossible that the game couldn't be anything other than absolute mind blowing genius. Everything we'd seen, read and heard spelt out that this was a title so far ahead of the sorry pretenders that there simply could be no other game out there worth playing. The game of the generation. The game to end all games. Technically advanced, bigger, better, even more controversial. But you all know how it works. They would say that wouldn't they? The first commandment in the law of games is 'Thou shalt hype'.But it was not always like this. GTA III slipped out to zero fanfare, and worried PR types pleaded with journalists to not mention the violent aspects of the game, lest the British tabloids pick up on it and demand to have this 'sick filth' banned (only three years late, eh?). Even Vice City emerged a healthy shade of pink, with a mere handful of screenshots to tease us with in the run up to release. The same deal with Manhunt. And then suddenly Rockstar decided to go from one extreme to the other, literally bombarding our mail box with new shots, exhaustive documents going into meticulous detail about the various new features that have been shoehorned into the game. Then followed three preview events, but yet not one opportunity to wrestle the joypad off them; and no opportunity to review the game until the finished boxed copy was finally delivered just three days ago. It was akin to a starving man being forced to watch a culinary dish being prepared, cooked, tasted and savoured in front of him. ~Look, smell, but don't taste. We'll give it to you when we're good and ready.~ Oh the agony.Somehow we preferred the enigmatic media blackout of old. Leave the surprises to be discovered. Let the word of mouth spread the game's gospel. That's how the last two worked; did Rockstar really need to go to such lengths to effectively spoil a lot of the game's surprises? The game could have hit the shelves today with zero advertising and no reviews and still sold out. It's that type of game. The less we know about it, the more we want to find out what's in there. The pre-release media splurge was a novelty; we thirsted for every morsel to begin with. Of course we did. Everyone did. Towards the end of the campaign, though, we actually couldn't believe quite how much Rockstar was prepared to spill and we politely declined to attend the final preview event for fear of spoiling it for ourselves, never mind everyone else. The very charm of the GTA games was the element of surprise; the exploration factor. Ringing your mates up excitedly reporting on your progress and all the craziness you've come across. Comparing notes. Playing through San Andreas did reveal a few surprises, nevertheless. It's that sort of game. You could write an entire book on the game and still only find yourself skimming over certain elements of it.But we're not here to exhaustively run through the myriad of things you can do in the game, but more whether they're actually fun and whether the game's really what it's cracked up to be. The first thing that cannot be overstated is that Rockstar really weren't making it up when they said it was a big game. It positively redefines the concept of what constitutes an epic game. There is absolutely no question that San Andreas is in the region of twice as big as previous GTAs. Maybe even three times, depending on what lengths you'll go to. To even work your way through half of the missions alone would take more time than it would normally take to finish two average sized action-adventures. In value for money terms it's hard to imagine another game like it.Pile on the extras and it's almost too much to comprehend. Pimping missions, Trucking, Driving school, Ammu-Nation challenges, Dating, Territory occupations, and more join the usual distractions on offer such as Taxi driving, Vigilante, Ambulance, Fire fighting and the ongoing quest to find hidden items; in San Andreas' case they're not as prevalent as you'd expect, but seek and you shall find.As veterans of previous campaigns it's easy to come to hasty conclusions about San Andreas. Your expectations really don't help. What we perhaps expected was more of the same. Much more of the same, with tweaks, technical improvements and the benefit of an entirely contrasting set of scenarios, characters and, naturally for a game set in 1992, the soundtrack. What you don't expect or even particularly acknowledge at the time is how the game lurches dramatically in different directions, often throwing you completely off balance into the bargain, and not always in a positive sense.You start out, of course, in Los Santos as Carl Johnson - a twentysomething former Grove Street gang member returning to a less than enthusiastic welcome after five years in Liberty City exile. Soon it becomes apparent the game's much less of a clichéd GTA; it's about a low-down bum working his way up the crime tree, and far more focused on the ins and outs of gang culture, the relationships between the 'family' and restoring the gang pride of old. Soon, of course, stamping your authority on the immediate vicinity and taking out frustrations on the rival Ballas gang becomes the priority.Ruling Los Santos proves to be an early highlight, and immediately sets the game apart from the other GTAs by virtue of its focus on dialogue, narrative and constantly going that extra mile to set the scene - not just via the between-mission cut-scenes, but through regular colourful exchanges as you're driving, and all manner of banter during each mission. As a cinematic experience it goes to inordinate lengths to get things right, with a quite staggering attention to detail providing endless opportunities to truly immerse the player in a convincing environment where every character, every pedestrian feels as part of the day to day life as you are. Check out the huge roll call for the pedestrian voice actors to see the crazy lengths Rockstar has gone to make sure the ambience of the environment matches up to the quality on show elsewhere.Once again the voice acting and radio stations are simply incomparable to any other game out there. If anything, the musical variety is even greater than before, drawing on a greater diversity of genres, ramping up the DJ humour to almost genius levels of parody and providing an excellent template for the game that no other game has yet to come anywhere near close to matching. Even after 40, 50 hours, you're still hearing fragments of dialogue, spoof adverts and songs that you've somehow never heard. It's the sort of thing you'd be happy to pay money for on its own; that it's such a throwaway part of the game just goes to show how far Rockstar is willing to run with this excellent concept. Sure, the music won't always be to your taste, but somehow in the context of what you're doing it all fits, so you don't mind while the truly cringeworthy ~All My Exes Live In Texas~ or ~Queen Of Hearts~ play for the third time that evening, or, if you do, flicking to another of the ten stations is but a mere D-pad nudge away.And as if the pedestrian voices and DJ scripts aren't enough, you get hit by the likes of Samuel L Jackson and Chris Penn making you realise just how good and how compelling gaming narrative can be when you're prepared to hire the right talent for the right price. The constant swearing might not be to everyone's taste, but when you've got a Rockstar game about hardcore gangsters, what does the audience really expect? In truth, some of it does veer a little into the realms of shock for the sake of it, and the way certain characters flit in and out of the storyline doesn't always make for a coherent, logical plotline, but for the most part they're enjoyable, amusing, and energetic, and a lesson to many publishers as to not only use as a plot device, but for pure entertainment and reward for the efforts you've put into playing some often intensely challenging missions.Perhaps when we say challenging, we mean fascist, as it has to be said that certain areas of San Andreas will have even the most committed fan tearing their hair out to move on from. It's a series complaint, really, that has yet to be addressed. The odd tough mission here and there is fine, too - so long as the player doesn't have to play more than about 10 times. After that, the whole thing becomes a chore and you just want to give up. Worse still is the fact that some of the toughest missions in the entire game are held up as immovable barriers - parts of a linear obstacle course that must be overcome before anything else can move on.Naming and shaming the countryside segment in particular, more or less all of these missions must be completed in order, and culminate in two particularly nasty point-to-point races one after the other; both set on twisting parthways on the side of a hill. The AI is fairly gentle, if truth be told, but actually not plummeting down into a ravine or into a stream proves a lot harder than many of you will have patience for. What adds to the growing frustration at the point of failure is the realisation that you'll not only have to drive back to the mission start, but if you've wiped out your car, finding another one of similar spec suddenly proves impossible without driving back into Los Santos. While Rockstar intermittently aids players with a 'Trip Skip' feature to avoid constantly replaying earlier sections of a mission, it's less useful than you think, given that most of the time you've lost all your weapons through dying, or, worse, you've got to spend several minutes getting back to the mission start. It's during this second portion of the game in the countryside that you really start wishing Rockstar could simply offer a mission-retry option. To not include such an option gives rise to enormous resentment, boredom, frustration and injury to inanimate objects. No-one really wants to waste so much time when playing a videogame, but Rockstar positively revels in forcing you to go though hoops to do the simplest things.It's somewhat fortunate then that after only ten missions of cross-country tedium you're back in the somewhat more familiar surrounding of San Fierro. Without wishing to drop any spoilers, the game really starts to go back to its roots, feeling much more like GTA III in structure and purpose after the fairly radical opening two sections. With its undulating terrain and the types of mission you'll have to perform, San Andreas marks itself out as very much an ever-changing game - a game that's almost impossible to judge prematurely because you never quite know where it's going to go next. Sometimes, though, even when you're admiring the brilliance on show, there are some terrifyingly badly designed missions to rile you up again. A special mention has to go out to the sadistic souls that designed the Zero remote control/shooting missions, which were neither fun nor playable in the traditional sense, unless you delight in having to learn entirely new and unwieldy control systems for things that have been more than adequately represented in other games.Sometimes, though, the faults in San Andreas come down to pure technical issues. While it's true that the visuals are an improvement on Vice City, with far better animation and detail levels, the issue of sluggish frame rate regularly reared its ugly head in the middle of an intense battle or - in particular - fast driving in congested areas. It may well be pushing the PS2 for all its worth, but it comes at quite a heavy price and Xbox and PC owners will be looking forward to seeing such problems eliminated when their respective versions emerge next year - assuming Rockstar 'surprises' us with an Xbox announcement in the coming months, anyway. The age-old issue of targeting still hasn't been solved satisfactorily; although it's a massive improvement over previous versions, the auto-lock constantly fails to engage a nearby target, causing the player to suddenly be twisted 45 degrees away from their intended target for reasons we still can't work out.That said, some of the new additional effects are superb, and the layer of polish addresses many of the concerns over what is underneath quite creaking technology at this point. Just leaving the joypad alone for 30 seconds or so is worth it, just to admire the view as pedestrians go about their business and the camera pans appreciatively - with a huge amount of crime kicking off at all times, rather worryingly...Pulling it all together, there's no sense in glossing over San Andreas' flaws. There's a sense that some gamers are happy with more, whatever that extra content actually turns out to be. In this case, much of San Andreas' 'more' is padding that frankly we could have done without. The countryside section, for example, was a mistake. Some of the missions elsewhere are simply ill-conceived, and in extreme cases just bar players' progress entirely. The decision to relentlessly persist in forcing players to backtrack often across vast sections of land in order to restart a mission is unquestionably bad game design that punishes the player for arbitrary reasons. Combining these issues with some flawed missions takes the shine off an otherwise amazing package, and, for us at least, means it stops short of being the complete package that was promised.All round it's still an incredible achievement for Rockstar, and it deserves all the success it's sure to get from this release; but like a band at the peak of its powers that releases an ambitious double album with 30 songs on it, less often turns out to be more. There may be some classic moments on it, but you have to wade through the self-indulgent bits first, and for all San Andreas' pomp and ambition it's not a Be Here Now, but it's almost certainly Rockstar's White Album. Ultimately, if I had a penny for every time someone asked this week 'what score are you going to give San Andreas then?' I'd probably have almost ten pence. Probably nearer 9.9."}