{"ref": "https://www.eurogamer.net/r-payback-gba", "date": "25 Oct 2004", "game_name": "Payback", "text": "Shop for games now with Simply Games.While handheld gaming fans are busy wondering what Grand Theft Auto is going to be like on the GBA, this week we've been busying ourselves playing, er, Grand Theft Auto on the GBA. Except not. Rockstar hasn't given us code for its handheld car-jacking extravaganza just yet, but fortunately for fans of old school, top-down, mission-based driving antics, ZOO Digital has its own Grand Theft Also due out in mid-November. Say hello to Payback, one of the most brazen attempts to recreate the original DMA Design formula on any platform to date - and easily the most successful of the various handheld efforts we've seen.This is the grand old theft of yore. You take control of a diddly little man-shaped sprite and set about shotgunning pedestrians, chucking grenades into traffic, pinching cars and racing them around a selection of decently sized cities, and taking on missions for an unknown mob boss - the idea being to hit a certain cash total and then move on to the next sprawling metropolis. If that sounds familiar, it should be - fans of the original PC Grand Theft Auto will find themselves immediately at home with Payback, which appears on the GBA via the Amiga, of all things, having begun life as one bedroom programmer's attempt to recreate the DMA classic for fans of homebrew Amiga titles.The result is a game that emulates the original as much as it can get away with. Graphically it aligns very much with what we can still see of the PC game in our mind's eye. Sprites for peds, chunky explode-able vehicles (complete with similarly quirky names like the 'Mundane-o'), bridges and buildings that change perspective as you zoom past to try and foster a sense of three dimensions, payphones offering one-off missions, countdown timers on a little pager in the top left of the screen, and a fairly basic selection of objectives that dabble in round-the-city racing, tailing people, blowing people up, delivering cars to garages, killing cops, stamping out a meeting of the KKK (a white-hooded rabble of which bear more than a passing resemblance to GTA1's yellow-smocked Hare Krishnas), and jumping the odd bridge.Each city has a cash points total that you have to meet by tackling the mob missions or just creating your own downtown mayhem, and like the original GTA there are no mid-mission save points to take advantage of; the idea is simply to let you loose and have you cause as much damage and rack up as much cash as possible in order to move on. Whether you do that by following the story missions, running over peds, taking on the cops, blowing up tens of cars or what-have-you is entirely at your discretion. There's even a bonus Rampage mode with no mission structure, which just wants you to score as many points as possible. And, like the original GTA, you'll also find a multiplayer mode - although in this case you'll obviously need a link cable.However in reality it's not quite the same as the first Grand Theft Auto. Graphically it's sacrificed some of the colour and detail, and the cars are less distinct as basic 3D models than they were as sprites. But, on the other hand, they are in 3D, and there is certainly more depth to Payback's engine than there was to DMA's - cars can topple a bit and leave the ground, and although it's easy to look at it and complain that it's not running at a tip-top frame rate all the time, or that the textures are quite low resolution, it's worth remembering that this is the Game Boy Advance we're playing with, and in terms of technical achievements on this platform Payback stands fairly tall. The developer hasn't skimped here at all; you'll see tyre tracks, damage skins on cars, billowing smoke and other particle effects and big, booming explosions, and unless you've been playing with a Nintendo DS or a Sony PSP lately you'll probably decide that it's one of the more impressive handheld feats to date.But while Payback exceeds the original GTA in certain areas, it falls short in others. Most notably - and off-puttingly - it just can't match DMA's sense of humour. Your mob boss's messages come through on your phone and appear as text along the bottom of the screen, and the scripting here is pretty unadventurous. While the mimicry of the tech, structure and design is generally sound, the lack of punchlines and throwaway gags tempers our enthusiasm. As much as it's fun to splatter a group of Klansmen in the park, or pinch a police car and drive it over its former owner, or play getaway driver, we miss the smiles that met our first ~GOURANGA!~, and we miss picking up the swaying hips of sprite-ly Candy and racing across town in a limo as she plied her trade on our boss in the back.We also miss the film references and other little knowing nods, like having to keep a bus over 50mph racing between objectives. And we miss the music. Okay, we weren't expecting a GTA III-style mix of radio stations and DJs, but we had hoped for something or other - the accompaniment here quickly earns a 'mute', and the sound effects, whilst they caress our nostalgia glands with their squeaky voices, screeching tyres and blaring horns, seem tinnier and less helpful than they used to be.Which is a shame, because in many respects Payback has jacked the right car. The controls take a little getting used to (holding A to go forward, B to go back, with the D-pad left and right for turning and a camera that always spins so you're facing upward), but before long you'll be tearing through the streets sliding into corners, splattering pedestrians and finding increasingly violent ways to stack up your cash. Indeed, the only things we'd complain about in actual gameplay terms are the size of the cities (they're a bit on the small side, and quite samey in design), the fact that police cars are so speedy that you often can't stop in time to avoid hitting whatever you're racing towards, and the way the handling model deals with 180 turns (it's just not Hollywood enough).With a bit more humour behind it and some slightly more adventurous mission design, Payback could have been a must-have. As it is, it's a perfectly enjoyable way to spend a few hours and it certainly does a decent enough job of emulating Grand Theft Auto's media-baiting exterior. But by failing to nail down the true appeal of the game and stuff itself to the gills with the requisite gags and hidden distractions, it's ultimately a bit on the thin side. We await the true Grand Theft Auto's riposte with great interest.Shop for games now with Simply Games."}