{"ref": "https://www.eurogamer.net/r-segasuperstars-ps2", "date": "21 Oct 2004", "game_name": "SEGA Superstars", "text": "Order yours now from Simply Games.EyeToy is a very important piece of kit for Sony. It's enjoyed huge sales all around the world, and plenty of publishers have set about creating their own camera titles as a result (Konami's U-Move Super Sports being the most recent example), or at least incorporating the functionality into their PS2 titles (Harry Potter, etc) and providing PS2 versions of multiplatform games with something of a unique selling point - and giving console fans something else to think about as they stand there in Dixons contemplating which version of a game to buy. It's important enough that Nintendo has publicly admitted its fondness and even jealousy for the 'Toy, and it's even prompted Microsoft to go one further and develop its own competing Xbox camera.And yet, although there are undoubtedly plenty of the little Logitech-made cameras atop TVs around the globe, EyeToy is still considered something of a novelty. The original EyeToy: Play package was entertaining enough, and a decent demonstration of what the tech could do, but it lacked depth, and clearly wasn't enough to justify future EyeToy titles to PS2 owners by default - as evidenced by the failure of quick-fire follow-up EyeToy: Groove to renew interest in the peripheral last Christmas until it was hastily discounted to the impulse price it should have been released at in the first place.Consequently there's quite a lot riding on the second generation of EyeToy titles. PS2 owners want something else, something more - something innovative and replayable. But while most commentators expect Sony's EyeToy: Play 2 package to go some way to providing that, SEGA has quietly pipped the platform holder to the post, delivering a game rife with clever thinking and replay value that could well wind up being the best EyeToy game of the year.The modestly named SEGA SuperStars is a compilation of 12 mini-games based around popular SEGA franchises, most of which remain surprisingly faithful to the originals. Monkey Ball involves guiding a monkey in a ball around a maze and through a finishing post, Space Channel 5 is about matching Ulala's dance movements to those of her alien friends the Morolians, and ChuChu Rocket is indeed about guiding mice into a rocket whilst blocking off weird orange cats with big teeth.What's particularly impressive though is the wealth of new thinking and clever applications of the camera. Take Puyo Pop for example. It's difficult to imagine how a puzzle game about aligning similarly coloured blobs could translate to EyeToy, but developer Sonic Team's answer is both ingenious and hilarious to watch; you have to catch showers of blobs by cupping your arms upwards and then trying to direct them into little chutes on either side of you. It's like I'm A Little Teapot set to the Acid Trance [and just as hilarious to watch from the sidelines -Ed].Many of the games translate surprisingly easily, and often with surprisingly entertaining results. Samba de Amigo has lost the maracas, so instead you flap your arms rhythmically at six icons dotted around you as a stream of blobs (blue for a single beat, red for drumroll style antics) erupt in their direction. Watching someone play it is a bit like watching someone trying to dance along to Saturday Night Fever - complete with hastily thrown poses. There are a bunch of songs including a few unlockables and several difficulty levels for Samba alone, and it seems likely that we'll come back to it quite often, and not just in the typical EyeToy fashion of giving your mates a quick look at the game and then filing it away with your other underused peripherals.The other rhythm-action style offering, Space Channel 5, is similarly good fun to watch and play. As in the Dreamcast original, you first watch a little alien perform some dance moves, then copy them as best you can - and the game is a pretty fair judge of your timed flapping with a bit of margin for error too, so you tend not to get too frustrated with it. Again it's home to several difficulty levels, and again you look like a total loon dancing away to it. And, again, you have a lot of fun whether you're on your feet or creased up in a foetal position on a beanbag giggling incessantly.Samba and SC5 may be obvious ideas and implementations, but they're well executed. Virtua Striker and Virtua Fighter, and to a lesser extent House of the Dead, fall into the same category. Virtua Striker ought to be rather throwaway - all you do is head a football sideways towards some balloons with point totals on them and then bank what you hit - but it's still likely to earn some replay if only for the comedy value of someone pretending to do diving headers across the room and headbutting the coffee table. This is why we should have a ~no cameras~ rule in the lounge.Virtua Fighter, meanwhile, will definitely have you coming back. The idea is to stand side on and split your focus between blocking and hitting various VF opponents over three rounds. The game throws up block and attack icons where it means for you to move your arms, and the effect is quite convincing. More importantly, it's pretty challenging. Easy mode is as it says, but Normal and particularly Hard won't be conquered in one go, as enemies throw more complex combination attacks your way and block symbols shift slightly a split-second before a punch is thrown. It's genuinely satisfying, and something you're bound to come back to.House of the Dead, on the other hand, probably won't have you rushing back, as it's one of the weaker links in the chain. The idea is to move through rundown metallic industrial areas slapping zombies and bats and other hellish creatures as they emerge on-screen, whilst trying to avoid slapping any damsels in distress who pop up along the way. It's still passable, but it's a bit too much like swatting flies, and avoiding the damsels can be a real pain, particularly when they're blocking off a well-placed zombie, leaving you to choose between slapping her to get him and incurring a penalty, or ignoring her and getting slapped by him instead to the same effect.But while HOTD is a little lightweight compared to the likes of Virtua Fighter, Samba, SC5 and co., Billy Hatcher is the real bad egg of the bunch. The idea is to flap your hands over a pair of handprints on the screen, which makes Billy roll his egg around, squishing enough enemies in the vicinity to open a big door at the end and escape. The problem is that it's basically uncontrollable. Half the time you can't see whether your hands are in the right place, so one of your hands slips off the sweet spot and our little chicken-suited platform hero starts pirouetting unhelpfully, and in general it's just too fiddly - Billy has the turning circle of an articulated lorry, and that doesn't work particularly well when the harder levels introduce raised platforms that require quite precise movement, and your enemies generally have small circular movement patterns that often leave you missing them by an agonisingly narrow margin and then having to do a big loop to come back round and try again.But as much as we swore like a vengeful fishwife with really ferocious PMT at Billy this week, we found it hard to stay angry with SuperStars, because there always seems to be something else to go and try. Heck, there's even a Crazy Taxi game that involves screaming and waving your hands as wildly as possible to try and attract the attention of a cab - somewhat cathartic after trying to manoeuvre a stubbornly useless egg around a vast and boring beach area in search of bouncing purple whatever-they-ares.There's also a Sonic game that involves manoeuvring the blue blur around the inside of a tube as he sprints along collecting rings and chaos emeralds and avoiding spike mines. There are eight positions on the inside of the tube that Sonic can run along, and if you're able to gather the seven chaos emeralds during your run then he morphs into Super Sonic, who seems to be impervious to the mines. If you tried it on a D-pad it'd be utterly boring. Standing there and doing it with your arms though is surprisingly enjoyable - which, as you may have noticed, is something of a running theme - and it surely deserves a bonus point for making you look like you're in Monty Python's Semaphore Wuthering Heights skit. There aren't many games that do, you know.ChuChu Rocket doesn't bring to mind any particular Python links, meantime, but it does demonstrate the sort of mileage and variety SEGA is getting out of ~rubbing the screen a bit~ here. There are four buttons (two on the Easy difficulty), one in each corner of the screen, and each corresponds to a particular bridge on a spiralling path linking an entrance hole to a spaceship in the centre of the screen. By default the bridges are down, and the idea is to rub each of them as a stream of mice and evil cats scamper along the path. You have to keep them up for the mice, and also keep them up long enough to trick the cats into setting foot on them so you can dump them into the abyss - otherwise they'll simply jump the gaps. It sounds simple, but it requires the sort of coordination that we'd normally associate with rhythmic gymnasts. Taking turns at this is bound to keep SuperStars in the disc tray for yet another evening.All of which leaves us with Super Monkey Ball and cult Saturn favourite NiGHTS, and it's interesting to note that, while they use very similar control schemes, we vastly prefer one to the other. And that one, to the relief of SEGA's hardcore, is NiGHTS. In both games, you're meant to control the respective characters by holding your arms up or down (to tilt the ball in Monkey Ball, and to ascend and descend in NiGHTS) and diagonally either way to turn. But while it works very well in NiGHTS, which feels like a controller-less Pilotwings for want of a better comparison, and involves soaring through rings and collecting things, in Monkey Ball it's just too hard to move steadily and keep the ball under control. Navigating monkey mazes ought to be difficult, but robbed of the much-need fine-tuning capacity of the analogue stick, it ultimately proves to be far too frustrating for all the wrong reasons.Overall though SEGA SuperStars should definitely be celebrated for getting far more right than it gets wrong. Samba de Amigo, Virtua Fighter, Space Channel 5, ChuChu Rocket, Puyo Pop and NiGHTS are the sort of well-made, occasionally very inventive, and distinctly replayable games that we've been crying out for ever since we got bored of EyeToy: Play, while the likes of House of the Dead, Crazy Taxi and Virtua Striker are bound to get a look in too, even if they're more comparable to the throwaway stuff we've played in previous EyeToy games than they are to the top names in this compilation.But still it's difficult to give SuperStars the top marks it probably sounds like it initially deserves, because while Sonic Team has undoubtedly done things with the tech that deserve applause, and created games that we'll undoubtedly come back to, it's neglected the sort of multiplayer functionality that an EyeToy game demands. There's no profile system in place here, so keeping track of turns is left down to you, and this also means that you have to put up with the increasingly irritating process of inputting your initials after every single round using a cumbersome on-screen keyboard. After a few hours we wound up using plain old A, B and C to save us the bother. It's nice to have photo-snapping after decent performances, and the requisite high score tables, but given how well EyeToy: Play nailed this side of things - and Play 2 will inevitably improve on it - it's something that SuperStars really ought to get right.But then we always want more. The truth is that even without these things SEGA SuperStars is still well worth your money - particularly at £29.99. It does face some potentially stiff competition from Sony's EyeToy: Play 2 next month, but judging by the steps Sonic Team has taken here, it could well prove to be a photo finish. Easily our favourite EyeToy game to date.Order yours now from Simply Games."}