{"ref": "https://www.eurogamer.net/r-sharktale-ps2", "date": "21 Oct 2004", "game_name": "Shark Tale", "text": "Order yours now from Simply Games.Games like Shark Tale are akin to starting a walk in the snow with trepidation only to rediscover your childish love for freezing weather. Ten year-olds may play with snowballs, but that doesn't mean it isn't fun. And the latest transformation from animated movie to videogame is certainly that.The player is Oscar, a raffish fish who begins the game evicted from his squalid, sub-aqua bedsit by a rather overbearing lady with gills after being chased by a shark in a dream. An adventure then follows which first sets out the rules for Oscar's world by characterising the scaly chap - he's an adventurous whale-washer who likes to party and gamble - before throwing him into a plot that sees him save all the fish from the deadly shark menace (cue cheering, singing, etc).As you'd expect from an Activision collaboration with Dreamworks, the presentation is exemplary. Little Billy on Christmas Day is going to be thrilled with this. The animation and water effects scream quality and the source material is obviously world class, so concepts such as fish taxi chases and the Whalewash (where whales are... washed) are plentiful and fun. The game enjoys near-perfect voice acting from the likes of Will Smith and Angelina Jolie and the game design is as solid as game design can be, even if it is on the extremely basic side in order to appeal to children. Shark Tale is a highly competent movie to game conversion. It was always going to be.Each mission starts with animation of one of the characters explaining part of the plot. Then a screen appears which tells you the name of the mission, the object of the mission and how you can complete ~bonus~ and ~elite~ challenges (the first is to dodge a shark to the end of the stage by completing directional presses, although bonus and elite honours and points are awarded if you complete it with 50 or 80 per cent health respectively). The pattern is then set: you complete a mission, a cut-scene explains what's going on, then you take on another one. Eight year-olds will ~get~ it, just in case you're wondering.The gameplay is very basic, settling down into what amounts to you following a series of directional changes or button presses. There's invention in there as well though, with Oscar having to circle items by dashing around in the water to stop them smashing on the sea bed or ringing pearls from clams to give him extras in the bonus section. Oscar has to stop child-fish from spreading graffiti, and sneak into cruise ships to pilfer betting tips, and is just a general all round good egg, if a little roguish one. He dances for TV crews (rhythm-action to MC Hammer and At the Carwash, if you believe that) and there are featherweight exploration and stealth sections as well, but, again, adults will find very little challenge, unless they're a bit rubbish at thumping out a beat. But that's not really the point. Shark Tale is colourful, loud, accessible, easily challenging enough for kids without frustrating them too much and has its finger firmly pressed on the fun button. There's the 'F' word again.Shark Tale is the sort of game you buy for your nephew and end up completing in a stupor while the Queen's speech pours over your snoozing Grandma in the front room. Kids will love it. There's nothing to dislike about it. It's well-rounded and harmless in every respect, but there's no real challenge to anyone remotely used to playing games or over the age of 10. Shark Tale is a credit to Activision's ability to take on this type of project, and, like THQ's adaptation of Finding Nemo last year, shows brilliant quality, is diverting for adults and perfect for children. Remember what it felt like to run out into the snow in your wellies to build snowmen? Then get this for the little people for Christmas.Order yours now from Simply Games."}