{"ref": "https://www.eurogamer.net/r-undertheskin-ps2", "date": "19 Oct 2004", "game_name": "Under the Skin", "text": "Shop for games now with Simply Games.For a company with more than 30 Megaman games under its belt, a similar number of Street Fighter titles and a host of franchises that stretch to several sequels and spin-offs, Capcom's output of late has been surprising varied. Perhaps the company's just in search of some new fodder to help guide it through the next decade. Perhaps someone high up is sick of games with 2004 on the end. Whatever; some of the results have been a far cry from what we've come to expect. Indeed, while Devil May Cry etc. pay the bills, games like Viewtiful Joe, Gregory Horror Show and Under The Skin are busy standing in front of an audience of wilting D-pad junkies, trussed up like some sort of dyslexic inverse TJ Mackey and screaming ~RESPECT THE CULT!~In Under The Skin, you take control of a young alien sent to earth as the final part of his training as an intergalactic prankster, the idea being to go around using all manner of contraptions to cause the human element as much distress as possible, and pinch the coins they drop as they fall about in horror. Meantime you're trying to evade the attentions of the local constabulary and anti-UFO element by disguising yourself as various humans, and to avoid dropping any coins by steering clear of the thrashing arms of your soon-to-be livid victims.Take a hit and your human exterior will be stripped down to its briefs; take a second and you'll be exposed as an alien and lose a lot of coins, and you'll be hounded until you assume another form. Ultimately, as you waltz around punching people with boxing-gloves-on-springs and planting exploding firework displays in their midst, the whole thing starts to feel like it's been extrapolated from backpage adverts in Mad Magazine. You half-expect the next prank item to be a stopwatch that pauses time. It starts to scream louder than either Greg or Joe.But while the idea behind the game is bellowing the right tune, the game itself isn't. It may have exotic pranks, but they quickly become repetitive, and there's nothing inventive about the way you put them to use and harvest the coin crop. The idea is simply to run around fairly small levels hitting X to deploy your selected prank, and then run around some more collecting the coins when they tumble to the ground. And because our little alien hero cannot afford to be seen, and each human identity he assumes is only worth a handful of pranks, he also has to press circle every so often when he comes up against a likely host to absorb, and then find one of a handful of little spawn points denoted by miniature hovering flying saucer things to swap outfits.This quickly boils down to running around, pressing X, pressing circle, and haring it away from an increasingly rowdy mob afterwards. Five minutes of chuckling over the various pranks at your disposal and a few changes in scenery aside, Under The Skin is arguably devoid of interest and variety. And you can see that the developer figured that out too, because the single-player game only consists of eight levels, the majority of which can be completed first or second go, and a few little diversions, and overall can be completed in less time than it took to write this review, leaving only the co-operative and competitive multiplayer modes to tide us over, neither of which is likely to earn it a place in your permanent collection.It's one of those games where you've seen everything that it has to offer by the end of the first level. Each of the eight scenarios tasks you with some sort of coin-collecting objective and usually you get ten minutes to do it. The most basic of these involves getting 500 coins before the ten minutes is up, but there are also a few variations that involve staying ahead of a rival prankster's coin total and similar. And we do mean ~similar~. To be fair to the dev team though, you can see where they made some effort to try and stave off the tedium - special level-specific, time-limited ~Panic Time~ events will try and knock you off-kilter, throwing up a sandstorm that strips your mini-map of its helpful spawn point indicators, or bombarding you with harmful rays that you can only elude if you absorb and replicate a human in a protective suit.And, in what's probably the game's most memorable moment, one of the levels even transports you to Raccoon City, where the usually lively populous stumble around groaning, enslaved to the T-virus, and your objective is not to build up a coins total but to use your pranks to try and topple Nemesis until he drops all his coins - and avoid his relentless pursuit, of course. But, again, it's a few seconds of recognition followed by around ten minutes of monotony.By the time you finish it, you've had quite enough. You're tired of scrambling for coins, and praying that your new human host will have a vacuum cleaner prank amongst his or her assets, saving you the bother of squirming around to collect them manually; you're tired of the virus items that gradually infect and eliminate your other pranks before you've even used them, and then expose you and lose you a load of coins in the process; you're tired of all the roaming around between spawn points and clusters of humans, bemoaning your slow movement speed and wishing you had the rollerskates item on-tap; and worst of all you're tired of the pranks themselves, which sound far better on paper than they are in practice.Example? The sharks. You lay this item down and shark fins appear scything through the ground before leaping out of the asphalt and battering humans so they drop their coins. It sounds great, but you soon come to ignore it because it can harm you just as easily, it's not targeted enough, and between those two things it becomes a rather humourless experience. Or there's the rocket, which you can manoeuvre only slightly. Both quickly become last resorts, and the mainstays - boxing gloves, giant mallets, fireworks, and bombs - are just glorified whipping sticks. Under The Skin is basically about hitting people until you have enough coins. It's a mugging simulation dressed up like a TV ad for mobile phone ringtones and Saturday morning cartoons.There are some items we do like - the karaoke machine, the Superman-style cape and fist of justice, the charging elements - but in the end they're the highlights of an otherwise dissatisfying few hours.It's also not worth the asking price of £29.99. As much as we'd like to draw comparison to Gregory Horror Show and Viewtiful Joe, both of which were discounted and deservedly became attractive purchases among connoisseurs of their respective platforms, Under The Skin isn't just not worth £29.99, you could argue that it's just plain not worth owning. If you can put up with the repetition and the anti-climax then be our guest, but, in our view, this is just too basic. Where Gregory and Joe were as often inventive and ingenious as they were incomparable to anything else on the shelves, Under The Skin's clever thinking dried up before it even made it off the blackboard. While it's good to see Capcom coming up with new ideas, sadly this is never destined to tame the cult.Shop for games now with Simply Games."}