{"ref": "https://www.eurogamer.net/r-donkeykonga-gc", "date": "13 Oct 2004", "game_name": "Donkey Konga", "text": "Order yours now from Simply Games.Donkey Konga is a real crowd pleaser. Haul out the bongos on a Saturday night, and start hammering and clapping away to covered versions of songs like Blink 182's All The Small Things, 99 Red Balloons and Supergrass's Alright, and you'll be a party king in no time (or Satan incarnate to the neighbours downstairs trying to get the six week old baby to sleep). But, as much fun as the game is, you'll really need an extra pair of bongos (or an extra three pairs) to get the most out of it, and even then you'll probably find that it doesn't go the distance, and soon makes way for party mainstays like Samba and SingStar. Or, if GameCube is the king of your jungle, Super Monkey Ball and WarioWare.The idea, much like the presentation, is simple and effective. You pick a song and a difficulty level, and then, as various symbols pass over a circle on the left of the screen, you drum left, right, both hands together, or clap so that the built-in microphone picks up the noise. Apart from the occasional as-fast-as-you-can drum roll bit, that's pretty much it. The game rates each beat Great, OK or Bad, and if you can keep in time without going Bad, then you can build up a combo and earn more points - and points mean prizes. Or rather, coins mean prizes; points are for jungle-cred.Earning coins in the single-player Street Performance mode allows you to journey to DK Town (represented by the usual menu graphics rather than anything more exotic, sadly) and purchase harder versions of the game's songs, alternative bongo sound sets, mini-games and other trinkets. The mini-games, also played with the bongo, are variants on Whack-A-Mole and the like, and there's also one that involves whacking the drums alternately to climb vines. Sadly none of them is likely to 'drum up' all that much excitement, but they do represent something else for your guests to drum to while you try and find the WarioWare disc...We should stop being so down on Donkey Konga though, really, because although we might sound a bit nonplussed, we do actually like it a lot. Drumming along to the game's line-up of 30-plus songs, when it's at its most frenetic and instinctive, is an addiction comparable to our endless hours with Amplitude on PS2. The problem is that it isn't like that often enough, and the rewards for getting good at the game - in terms of bonuses, audio-visual treats and sheer satisfaction - are seldom enough to compel you to keep playing it single-bongo'd.Gather some friends (cha-ching: £20 each for another set of bongos) however and it's a different story. Challenge mode, for one or two players, lets you drum along until one of your bongo bars (made-up term) is withered to nothing by a steady stream of Bad and missed notes, and if you're up against a similarly talented drummer then you're likely to keep this going for quite some time. Playing it as a single-player marathon is a nice workout for your wrists, too, although going at this alone more than anything demonstrates the game's limited appeal; with a few hours of experience behind you as you go into Challenge mode, you'll probably tire of it before you see the Game Over screen.Other modes, like Battle, introduce power-ups that influence your or your opponent's score. POW blocks can be used to whittle down your adversary's, while the Slots machine bit mid-song has you pounding barrel notes to try and get a point bonus. Battle is probably the best fun you can have with Donkey Konga and a friend. That and Jam Session, which supports up to four players and is ~all about making sweet music~, rather than scoring points against one another.The Jam options, on the other hand, are probably the least fun, unless you're one of the few people warming up the keyboard for an almighty rant about how great it is on the ensuing comments thread; in other words, unless you've played the game to death. The idea is to drum through the songs successfully with no bongo prompting. We managed to learn one song semi-off-by-heart, but we can't imagine a learn-'em-up mode is the answer to Donkey Konga's problems.The bongos units themselves are sturdily built and well made and, at £20 or thereabouts, surprisingly reasonable value for money. The drummable bits have a leathery surface texture that's comfortable under the hands even after endless hours of drumming, and there's a good chance they'll survive quite a few tumbles, although we wouldn't recommend throwing them at the wall in frustration. It's also worth pointing out that you can, at a pinch, play the game without a set of bongos. Although we wouldn't really recommend it, it's a good way of getting a two-player game going if you haven't the extra £20 to spend on a second controller.Whether you'll want to buy it at all though is a question we're having trouble answering. It's undeniably entertaining, with a solid, lovingly made custom peripheral to irritate the wife, and it's so simple to play that it genuinely is accessible to all. Sit around playing it and anybody wandering past is bound to take an interest and probably want to join in (or kill you). But, on the other hand, it's when you consider the actual controls behind the game laid bare on a normal Cube pad that you understand its limitations. What it boils down to is a game of hitting one of four buttons when prompted. The drumming novelty can only mask that for so long, and soon it runs out of steam compared to the likes of SingStar, Samba de Amigo, Amplitude and co., which still dominate the rhythm-action landscape in this household.That it doesn't go the distance is, in our view, also down to a couple of other things - the fact that the game's 30-odd songs aren't full length, and thus disappear into the ~heard this five times already~ pile within a matter of hours; and a lack of ritual humiliation. Donkey Konga may be tossed into the same hat as games like Samba de Amigo and SingStar - particularly by the Cube-only specialist press as they search for a comparable party game - but those games are arguably at their best when someone's making a total idiot out of him or her self. And although you'll look a touch odd whacking a pair of plastic bongos in front of the television, you'll never elicit the same sort of laugh-out-loud reaction. Unless you start playing with your feet or something - and that's not terribly hygienic. And although it has the same instinctive reacting-faster-than-the-brain-can-process fascination about it as Amplitude, it lacks the audio pay-off and satisfaction that game so easily generates.In the end, Donkey Konga is just too short-lived, even in multiplayer, to be worth the sort of outlay it represents. Nintendo has been surprisingly generous in its pricing here - most people will sell you the game and a set of bongos for £30 as far as we can see, and extra sets run to just £20 - but with the songs already shortened (and covered by a fairly decent bunch of impersonators, rather than licensed, curiously) Donkey Konga just doesn't have the legs. We appreciate the simplicity of the idea, but in the absence of the hidden depths we normally expect from this sort of game - or the ritual humiliation we now demand - it ultimately wears thin far too quickly. And for that reason we can't see it becoming the eBay legend that Samba was, although we've little doubt that you'll be able to find it on there all too quickly...Order yours now from Simply Games."}