{"ref": "https://www.eurogamer.net/r-rometotalwar-pc", "date": "4 Oct 2004", "game_name": "Rome: Total War", "text": "Order yours now from Simply Games.So: nine or a Ten? What a dilemma.Tens are precious, and it takes more than merely being extremely good to get them. Perfection is no guarantee. In fact, perfection just implies you were setting your sights too low. To have your fingers brush the firmament, you have to risk an Icarus-like fall to earth on internet-forum-flaming wings. To get a ten you need scale. You need to be more than just a game.When compared to all the standards above, Rome is a Ten. It didn't have a design doc; it had an act of hubris.In a real way, Rome: Total War is the absolute exemplar of PC gaming. It's about what only PCs can really do: that is, everything, and everything at once. In an age of comfortable genre-games, the Total War series have always stood slightly aside from the main thrust of culture. Anything cerebral and PC-centred, they take from, with even trace elements of RPGs showing up. However, the two great atrium of Rome's bulging heart are labelled ~Strategy~ and ~Tactics~. In the former, you organise your growing domain on a Civilisation-styled map. In the latter, you lead your massed forces into action in lusciously rendered fully polygonal 3D worlds. And if I hadn't used the word ~maximalist~ in last week's Dawn of War review, I'd lob it in here.It's very big.The full campaign game will cause fear-related heart attacks on the more casual gamer. This places you as one of the three families in Republic-era Rome, setting forth to carve an empire from the yielding flesh of B.C. Europe. Even if you choose to auto-resolve most of the battles, set on the lower difficulty levels, you're looking at some serious game playing time - your correspondent currently has a bedraggled half-beard due to how its dissolved his social life - before you turn on your masters and become Emperor.Senate aspects are particularly welcome. In previous Total Wars, the latter part of the campaign, where you mopped up the remaining resistance, was where attention began to wander. Here, at the exact point where you're in a position to bully almost anyone into submission, your allies turn on you for fear of your growing popularity, leading to a suitably dramatic final act as you take on Rome itself. The move from slaughtering rag-taggle barbarians to locking gladius with disciplined ranks of legionnaires is particularly memorable.Eventually, you'll be victor, turn to the game options and realise that you've only just begun. Forget about altering difficulty levels - with both tactical and strategy AI capable of being set individually - leading to a genuinely different experience on replay. You'll also find that you've unlocked the opposing races as playable factions, allowing you to play the campaign as the Greeks, Egyptians, Gauls, Carthagians and so on and so History Channel. While previous Total War games have differentiated the races both on the strategic and tactical scales, Rome pushes it even further. The challenges you face as Pharaoh of the Nile are fundamentally different to those of a woad-smeared chieftain in Briton. Play the latter and you're separated from the world, resource-poor with barbarous troops. Play the former, and you possess a surplus of riches, with expansive realms it takes aeons to march across and a population that you'll have trouble stopping growing even if you wanted to.The unlocking aspect may grate slightly with some PC players, but they should be forgiving (especially because it's easy enough to do an .ini file fiddle to side-step the issue). Total War has been traditionally intimidating, but Creative Assembly has undergone great pains to make this as accessible as possible, without losing the depth or - hnghh! - 'dumbing down' in any way (and if you want one easy step to improve the quality of videogame discourse online, then hooking your thumbs into the eye-sockets of anyone who uses that particular phrase and pulling off their face is as good as any).By playing through as the Romans, you're learning invaluable lessons about the game, which means by the time it comes to play as their foes, anyone will be capable of attempting the task. There's none of Shogun choosing of a simply inferior side - Total War games' strong basis in history means that they've never pretended that all sides offer an equivalent challenge. Even here, taking over Europe as a lesser side is going to be a much harder proposition than if you're at the head of the legion - and getting hammered from your lack of experience, then giving up bored and alienated. For those who just wish to dabble, there's a (excellent) shorter tutorial campaign, an abridged version of the full campaign, the tactical-scale multiplayer and the genuinely lush historical battles - which are also some of the best historical lessons I've ever seen included in a PC videogame. It's just as friendly to get into as a Total War game could ever be.Take, for example, how trade is introduced to the player. It's stressed that it's important in the tutorials. By ordering a market or a port constructed you start to see ships heading between various destinations. It's possible for a player to just see this and get on with it. However, if they investigate further, they'll find that on the settlement they can summon up the hard Civ-style data of exactly what's being traded with where and utilise that to gain greater efficiency. Anyone can play Rome... but it allows the very best people to play it really well. And that's the secret of accessibility.Speaking generally, the strategy map is a revelation. Previous Total War games have worked on a more Risk-based model with whole regions counting as the same place. Rome works more like Civ, with units being positioned in specific areas on the map, interacting with the near vicinity and moving according to the speed of the slowest element in the army. This means that large territories, like those in North Africa, can take forever to slog across, changing how you approach them. Compare and contrast with Northern Italy, where the paths through the Alps make obvious points to hold and defend. This stresses Terrain in a way which has never been done before.Better, this also influences the tactical combat. The lay of the land where an army is standing is actually what the army will fight upon, making it more important than ever to choose your battlegrounds carefully. After all, the last thing any army wants to do is fight a literal up-hill battle. This is because Rome, like its forebears, pays more attention to the actual practicalities of real battles than any of its peers. Positioning is of paramount importance and morale more often than not the clinching factor in any confrontation. Provoke a general panic with a charge in the rear, and you've got a chance to turn around even the most badly stacked odds.The most noticeable changes here from the previous games is an increase in pace, with troops making their way around and slaughtering at greater speeds. This has the advantage of making playing out a battle rather than auto-resolving a more attractive prospect in the full campaign, as before even the most inconsequential skirmish took getting on for a good twenty minutes to play through. Of course, the actual infrastructure of how fights are won means that all the tactical depth of the original is still present. If it's too quick, a pause-order system for the more stately player is fully supported.Oh yes - the graphics are as spectacular as a large-numbers strategy game has ever been. Look at the screenshots. But what they don't show is how the polygonal models actually improve how the battle plays out. Information which was obscured in the previous game's muddy sprites is transparent in the animated figures. For example, you can tell when a phalanx is prepared to meet a charge and when it'll be vulnerable at a sudden attack. City Sieges especially have been paid proper attention, with battering rams, wall climbing and firestorms sweeping across a city providing ironic set pieces.And... Oh you can go and on. Rome doesn't need reviews to discuss it properly - it needs entire books.Holistically, it could be argued that there are better turn-based strategy games than Rome - but not by much. It could be argued that there are better RTS games than Rome - though not nearly as convincingly if you limit it to pure tactical combat games.  And it's not even that Rome manages both, which would be an impressive game design feat but of no actual intrinsic worth... it's that Rome manages to integrate both, and by doing so elevate both. In any strategy-scale game, you construct armies, but thanks to its real-time side in Rome you know the units in a far more intimate fashion that makes the acquisition of elite troops suitably powerful, since you know exactly why they're feared. In any real-time strategy game you'll fight desperate battles against hopeless odds, but here, thanks to the strategy side, you know the precise cost of loss will be. It's a magical, beautiful synergy and there's nothing quite like it in the entire gaming lexicon.So - Ten then! Best Strategy Game Ever! Rome claims its laurels and marches up the throne...No, it's a nine. As much as it pains to stick daggers into this noble Caesar of a game, I must. Luckily, they're mostly small daggers.AI - while genuinely sterling - has moments of ineptitude. This especially noticeable in battles where you have two armies in play at once. You control one, and the other is under computer control and not responding to your orders. The ability to issue a general order (~Hold back!~ ~Attack now!) to your colleague would have alleviated this hugely. Equally, enemy generals can be a little over enthusiastic in battle, leading to a relative ease of slaughtering them. While the naval side of Rome advances over Medieval, it's still only possible to auto-resolve battles, which can't help but make it feel vestigial and under-rendered compared with the detail in the rest of the game. There's a fair few tiny control issues, for example when two armies are standing in front of each other, actually trying to get the man behind is far more awkward than it should.Heh. ~Selecting one person behind another is tricky~. See what I mean by ~Small daggers~. But they're still daggers enough. It's a nine.But you know what? When you tell it that, it freezes you weak-kneed in its severe, contemptuous Roman gaze, then turns and walks away...Well, it walks like a ten.Order yours now from Simply Games."}