{"ref": "https://www.eurogamer.net/f1-2017-review", "date": "25 Aug 2017", "game_name": "F1 2017", "text": "It was always better back in the day, wasn't it? Over the years I've collected all sorts of F1 paraphernalia - pocketfuls of discarded rubber picked up from just off the racing line of Eau Rouge during a post-race track invasion, photos of drivers awkwardly coerced into standing next to me and even a set of Johnny Herbert's Goodyear Eagles from a Monza test session that the cats now like to nestle in at the foot of my dad's garden - but an enduring favourite is a compact disc, an unofficial piece of memorabilia from the 1995 season. It is, quite simply, a compilation of sounds from that year's Belgian Grand Prix, and it's electric.It's the variety that delights; a multi-layered chorus of thundering cylinders and ear-piercing pistons. There's the tech and groan of a Renault V10, the sonorous roar of a Hart V8 and - of course - the urgent scream of the Scuderia's V12. Say what you like about the current state of F1, but I can't imagine any 12-year-old fan of the sport as it is today coveting a recording of the thin whistle of the modern V6 hybrid. Stand trackside at a modern Grand Prix circuit and you're more likely to make out the sound of Hamilton and Vettel whining than the whispered drone of their power units.What a treat, then, to be reminded of the din and drama of a different age in F1 2017, the latest in Codemasters' official series that reintroduces the classic cars last seen in 2013's entry. They're a diverse, expertly picked bunch, hero cars from the last 30 years of Formula 1 and each one with a legend of its own. There are the cars that dominated entire seasons - McLaren's MP4/4, Williams' FW14B and Ferrari's F2002 and F2004 - and others that took centre stage in memorable campaigns. The MP4/6 that gave Senna the last of his F1 crowns in 1991, or the R26 that gave Alonso the last of his eleven years ago - or how about the MP4-23 that took Hamilton to the title on the last corner of the last race in 2008.My pick, though? Ferrari's 412 T2, not a great car by any means  - it notched up just one victory, which would also prove to be Jean Alesi's sole win, the occasion proving so emotional for the French Sicilian that in the final laps his tears would splash against the inside of his visor every time he braked -  but one that marked the end of an era. The last V12, for one, and the last F1 car from Maranello to bear the iconic number 27 as well as the last Ferrari campaign before a slightly more bloodless regime was ushered in with Schumacher's arrival the following year. All of which is a very long-winded way to say how emotive these vehicles can be for a certain vintage of F1 nerd, and how beautiful they are to behold in F1 2017. Those sounds are spot on, and enough to send a shiver down the spine of anyone old enough to have stood on the verge of Silverstone's Becketts corner at a time you knew what car was coming as soon as it was in earshot. The V12 howls just as it should, the V10 in the back of Hakkinen's MP4-13 capable of a very different but just as fearsome scream, and they all look as sublime as they sound.It's a small shame not to have classic tracks to enjoy such vintage machinery around, but they're at least more thoughtfully woven into F1 2017's main career mode than before, appearing as occasional invitationals that showcase each car in one-off events. They're short, sharp arcadey counterpoints to the sprawl of a season's campaign, and so detailed, in-depth and exacting is that latter part of the game, it's enough to convince you that maybe modern Formula 1 isn't so bad after all. 2017's cars are certainly the most handsome for a while, their wider tires and lower profile a knowing throwback to the icons of the sport in the 80s and early 90s, and they've proven effective in bringing lap times tumbling. F1 2017 does its best to replicate that newfound speed - these things feel seriously quick, making mincemeat of corners that last year put up a formidable challenge. Take Copse, Silverstone's mega quick right-hander that sits at the tail-end of the old pits complex. It's easy flat here, as some drivers speculated it would be in the run-up to this year's British Grand Prix - although in reality it required a sizeable confidence lift as well as a downshift from top gear, even during Hamilton's outrageous pole lap. F1 2017 isn't a full simulation, though - Codemasters' series has never really set out to be - and instead it's an effective appropriation of what us bewitched bystanders imagine driving one of these aero-heavy, low-slung and mean-looking new Formula 1 cars would be like. I've always enjoyed Codemasters' take on the behaviours of modern F1 cars and - barring the minor blip of F1 2014 - it's only really gotten better over time. F1 2017 does a commendable job of communicating understeer, making the most of those moments where you're desperately trying to work the front-end of the car, while also making the most of those more glamorous moments of oversteer that turn you into a superstar for a few brief milliseconds, snapping the wheel back in a fit of opposite lock and a flash of Gilles Villeneuve heroics.More importantly, the handling allows you to find the sense of rhythm that's essential to the sport - driving fast is one thing, but driving consistently is quite another, and is equally important. F1 2017's cars are a dependable bunch, making the skill of extending the lifespan of a set of tires over a stint - again, something hard-baked into modern F1's DNA, and well replicated here - not only satisfying, but brilliantly hypnotic. Combine that with a dynamic track that rubbers in over a weekend, can be slicked by a sudden downpour and can dry out over the course of a race, and you've got all the ingredients for a faithful take on a Sunday afternoon's antics. That dynamic weather has been improved upon in F1 2017, and it can enliven an otherwise dull race - a steady shower at the start and a late gamble to move to slick tires made one hard-fought victory at Sochi one of the most exciting races I can remember having in a single player game - as can the safety cars that now feel like a more regular occurrence throughout a season. Codemasters' greatest trick with this series has been how it's drilled down into what makes modern F1 tick and extracted that into a game that's as authentic as it is enjoyable - and F1 2017 only improves upon that. I think it could also, in parts, be better than the real thing. The rules in F1 as they stand aren't really conducive to great racing - despite the drama of the inter-team rivalry between Mercedes and Ferrari, as well as the spectacle of the new cars, this season has felt strangely flat - but good god do they make for a great video game. Managing the limited number of power units and components available to you over the course of a season, something compounded here by the possibility of technical failure that's been introduced in F1 2017, is oddly compelling. It's about knowing when to push and knowing when to hold back, and knowing how best to play the hand at your disposal.  It runs deeper still. Overseeing the technical development of your car is now complemented by a tech tree so vast and complex it'd do a Civ game proud (and you'll be pleased to know there's also a recommended path you can take through it should it prove too intimidating). Development points are acquired through racing or by partaking in programmes during practice sessions - itself an incredibly smart way to make what happens on a Friday afternoon in the sport a captivating part of the game - and then poured into different paths, allowing you to keep up with the tech race that's part of a season, or to help a smaller team leapfrog its opponents. Micromanagement becomes macromanagement becomes just the simple thrill of enjoying an incredibly well put together racing game. It's exquisite stuff, and I haven't even really touched on the more direct new championship modes or the new downloadable events that give you a scenario and a leaderboard to pit yourselves against. Once again this is a game with a clearly modest budget - there are more than a handful of rough edges, and the character models you come across in the career mode are works of cold horror - yet despite that it's a remarkably generous one too.Indeed, F1 2017's biggest problems come from F1 itself. There are 20 locations here, including a few new configurations of existing tracks, but the heart sinks when you're faced with the miserable trio of Bahrain, China and Russia's faceless Hermann Tilke-penned autodrones, and there's no getting away from the fact the sport can be a fairly dry proposition. This is a celebration and exploration of F1's peculiar minutiae and complex glory rather than an attempt to turn it into something it isn't, and that's sure to leave a fair few cold. For someone like myself, whose interest in F1 has waned in recent years as I've started to look elsewhere on a Sunday for my petrol fix - be that to MotoGP, WEC or touring cars - it's enough to make you fall in love all over again. Codemasters' nerdish passion for the sport shines through, and it's kind of infectious.And so F1 2017 makes a fairly convincing argument that maybe it wasn't so much better back in the day, and even if the sport itself isn't exactly going through a golden age the games inspired by it most definitely are. This is, I'm fairly confident, one of the finest official takes on motorsport there's been, earning a place alongside classics such as Geoff Crammond's own Grand Prix series or Papyrus' IndyCar Racing. Now, just imagine what this lot could do with the BTCC licence..."}