{"ref": "https://www.eurogamer.net/r-defjam2-x", "date": "28 Sep 2004", "game_name": "Def Jam Fight For New York", "text": "Order yours now from Simply Games.~The Kids~ are fickle beasts. Adults trying to be 'down' with them is quite possibly the most dangerous media event of any company's life, and if any attempt is ever made to do so, you'd better make damn sure you know what you're doing. EA probably knows what it's doing. There are only two ways games like Def Jam, of which Fight for New York is the second in the hip hop fight series, will ever be successful.Firstly, the game is a big budget version of a tried and tested brand. Think Harry Potter. EA could have put Harry's kickable face on 10 million cottage cheese cartons with biro and called it a video game and it would have sold faster than the 'special' punch at village fetes. Really.Secondly, the game is so stupid (only The Kids will understand), and features so many stupid things that The Kids so obviously love because they spend all their money trying to be like/look like/sound like the stupid things, that its success is assured. Fight for New York sits in this camp, along with Pokémon, although the Nintendo RPG is by far a superior proposition. Remember the word: stupidThe Def Jam sequel is, quite literally, ridiculous. It surmises the following: The Kids like hip hop, The Kids like aspiring to be hip hop stars in terms of the way they talk and the way they dress, and The Kids obviously want to be hip hop stars embroiled in a culture of Fight Club-style ass-whupping nonsense. Def Jam surmised right.Sean Paul, Ice-T, Snoop Dogg and just about every other rap star you've ever heard of (and plenty you haven't) appear with their true likenesses and voices in the game, in which you either take control of one of the aforementioned music people or create your own fighter. Shouting hero Henry Rollins is your coach, teaching you how to spend development points you earn during fights to improve your fighter, while D-Mob, L'il Kim and the rest of your 'homies' provide the backdrop to the Story mode. It's slick, funny and ultimately supremely daft. It's so teenage it hurts. Low-level expletives (as well as some rather high level ones, don't you know) are bandied round with absurd regularity. If you were 15 you'd love it.The actual fighting is well above average. You square off against various opponents in different clubs, where you take them to task with punches, kicks, heavy versions of both, grappling, martial arts and other styles, weapons, crowd interaction and knock-out specials. The camera can be a little painful, but the overall feel and look is solid and high spec. And then you fight Ice-T as a boss Original Gangster plays in the background. We like that.One-on-one action occasionally gives way to four-way fighting (multiplayer also goes up to four players) but this is less successful due to the fixed camera. You versus the Iceberg is where it's at.Unfortunately, you also have to dress your character in the manner of Barbie. This really is like playing with dolls. You spend your money on 'bling', haircuts, tattoos, sportswear and other stuff, with the gameplay excuse of causing the crowd to respect you more during fights. We all know the truth. ~Wow, I just bought a new cap and got my ear pierced!~ The Kids: being odd for all eternity.Def Jam: Fight for New York is slick, mass-market entertainment for, well, the mass market. This is not a discerning game. It's exploitative and very well made, although not flawless enough to raise any eyebrows from those heavily into games and certainly not enough to tempt you away from the myriad, more hardcore offerings this Christmas. Buy it for Little Johnny's stocking. As long as you don't mind Ice-T shouting, ~You're nothing but a punk, yo daddy's a punk, and yo momma's a b***h~ every time he Shaolin's his head in.Order yours now from Simply Games."}