{"ref": "https://www.eurogamer.net/r-cmr2005-x", "date": "24 Sep 2004", "game_name": "Colin McRae Rally 2005", "text": "Order yours now from Simply Games.It must be incredibly tough to churn out a new version of a game in a year and make it sufficiently alluring. After all, people spent 40 quid just 12 months ago - the developer has to find a way to encourage them to get their wallets out again. And not only is it tough, but it's incredibly perilous as you pile your resources into meeting a deadline, at the risk of ending up with a game so similar to the one you started out with that the fans start to lose patience. Such is the problem that Codemasters faces with one of its key brands.The other big issue for the Britsoft studio is keeping up with the Joneses. As benchmark setting as the wonderful PSone originals were - both in terms of visual and technical excellence - it’s hard to extend the same compliment to this generation's Colin McRae efforts. Although CMR 04 improved massively on the disappointingly ragged-looking third version, both lagged well behind DICE's wonderful Rallisport Challenge. The release of the Live-enabled RSC 2 only makes the task significantly tougher to drag version five up to the required standard. On top of that (and needless to say), the one key new feature CMR 2005 definitely could not omit was online, and Codies has wisely bolted it on at last. But more of that later.The most obvious thing to comment on this time around is the way it looks. Every time we fire up a new CMR it's in the dogged belief that eventually they'll get it right - especially considering how impressive the recently released TOCA Race Driver 2 was. The press information confidently proclaims ~just when you thought a McRae game couldn't offer more detail or visual splendour...~. Well actually guys, to be brutally honest, we've always thought it didn't offer enough detail or visual splendour...It's clear that, having taken this on board, the team has worked very hard to improve things. For a start, you'll immediately welcome the addition of a bonnet cam (and about time), not to mention a few general tweaks and improvements (like the dazed blurring effect when you crash heavily), the sunlight streaming through the trees, improved dynamic lighting and the damage model is again very convincing, both in terms of the look and feel.Even with that in mind, the overall standard is still a notch below what we've been treated to elsewhere; in particular how frustrating to note that TOCA Race Driver 2's Rally sections actually look better than this? Codemasters' talk of big improvements to the scenery is certainly justifiable, but not so much that it brings it into RSC's league. In truth though, it's a little mean-spirited to always bang on about this side of CMR when it’s the gameplay that counts, but then how can you avoid it when the competition is so strong?Simple factors, like the occasionally unflattering use of colour, doesn't always help its cause, and the fact that we know the Xbox is capable of better texturing is a minor frustration. We appreciate that the game is almost certainly primarily developed for the PS2 (as has always been the case), and as such the technical level has to follow that, but yet TOCA Race Driver 2 wasn't and somewhat shows it up - and RSC 2 is out of sight from the start of the race. Codemasters continue to believe making a PS2 version makes the best business sense. They're right, of course, but that doesn't make it possible to avoid disappointment.The good news for those not hung up on the relative visual merits of driving games is that these initial eye candy observations are not tremendously important once you get down to playing it. CMR has always been about the gameplay, the handling and the challenge, and in those areas, long-term fans have little to worry about. It's still a cracking way to spend more spare hours of your life than you have time to spare.As ever there's an assured sense that getting the feel right has been the basic goal. Personally we've always regarded the CMR games as having the best handling of them all, giving you a palpable sense that the car is truly reacting as realistically to the terrain as it could, yet remaining within the realms of acceptable playability - and if anything that's even more apparent now.Every pothole, every undulation in the track, and change of surface is truly evident. As ever, playing it like any normal racing game is going to end in pain and suffering. Every course is a treacherous exercise in getting the balance right between pushing your car to the limit and staying vaguely on the track, and it's damned hard work at times. Suffice to say patience is the key to ever getting anywhere, and so long as you adopt that mindset, success and real enjoyment is never that far away.Once again, the principle of being able to tweak your car prior to the race in a multitude of ways is there for those who want to (we tend to just keep an eye on the tyres to be honest), and damage that you sustain out on the track between races carries over to the next one. We liked the repair system introduced in 04, and we're pleased the team retained it, while the upgrades system is also a non-broken idea that didn't need fixing.It's tricky to know whether keeping almost everything the same is a good thing or not when it comes to parting with another £40, but what you're essentially getting for your cash is the chance to finally take your well honed skills online as well as getting a vastly expanded Career mode, which now features 23 individual events over 300 stages, taking in (deep breath) 4-wheel drive, 2-wheel drive, 4-wheel Classics, Super 2-wheel, Rear Wheel, Distinctive and 4x4 classics.It's a massive challenge to work your way from the bottom right to the top, and should keep you occupied for literally weeks on end. The truth is, though, as brilliant an addition as it is, we probably preferred the more sane challenge of the basic Championship which offers a direct, linear run-through of the tracks. Either way, it's a veritable feast by anyone's standards and offers something for everyone, whether insane hardcore fan or getting into it for the first time.Aside from the career-based gluttony, though, just one all-new Rally makes the cut this time, Germany, joining UK, Sweden, USA, Finland, Australia, Spain, Greece, and Japan, with each country sporting eight stages each. We've certainly no complaints about added content, but it's a stage that looks and feels very much like the wet and green terrain of the UK to offer too much of a contrasting sensation of being an especially important addition. It's probably more a wise commercial decision to give it a greater appeal over there than anything else.Whatever. The Xbox Live mode is ultimately the thing that most interested us in playing our third CMR in the space of two years; there's only so much enthusiasm you can be expected to show for franchise games once they hit the stagnant waters of the mid cycle. What's to report? Unlike the vile mess of our last Live experience on Burnout 3, it's a flawless example of why publishers should just let Microsoft get on with running the service.Giving you the choice of racing all eight stages of a specific Rally, or one of the stages, it's a relatively simple premise based around the idea of improving your World Rank. Don't expect the fully implemented system that Gotham 2 or RSC 2 employs; it's basic, there are no solid cars to race (although you can race with up to seven players at once and there are ghosts to download), but it's still a sound and welcome addition. Once again, not quite up to the standard of what the Microsoft-backed RSC 2 does, but realistically that's to be expected.On the whole, we'd still have to admit CMR 2005 is, by virtue of the Live play and added content, the best value package in the series, and by extension the best Colin McRae Rally game yet. However, for those of you who already own CMR 04 and can't take advantage of online play, it's a game that's so chock full of single player content it may well still prove a worthy purchase. Is shelling out full price for an incremental update justifiable? If you're hooked, then most certainly, but we'd still plump for the (now undoubtedly much cheaper) competitor, Rallisport Challenge 2, which may not simulate the sport to the same degree, but is by far the more impressive offering in almost every area - although it's obviously Xbox-only.In fairness, there's no longer the state of rabid excitement surrounding the brand, and we got EA-itis playing it after a while, but then after three versions in the space of two years that's hardly surprising. The online play is a very welcome addition (although not really the full monty), the campaign is enormous and there's no doubt at all that in isolation the game is a solid, enjoyable experience with immense longevity, but some may correctly observe that this is the game CMR3 should have been in the first place.It's a quality product, make no mistake, but it feels like a terrible fence sitting reviewer's cop-out to keep churning out the ~if you don't own the others then buy it~ line. It is, evidently, an incremental update, but you could say the same about many other great games right now. Is that bad practice or good business sense? Probably both, so we'd strongly advise you get a hands on before you make the leap. Another case of a good franchise being milked.Order yours now from Simply Games."}