{"ref": "https://www.eurogamer.net/r-mariogolf-gba", "date": "21 Sep 2004", "game_name": "Mario Golf: Advance Tour", "text": "Order yours now from Simply Games.GOLF. Actually, no - that would be too easy. HOCKEY. For all the pads, facemasks, blades, feints, spinning pucks and prancing flecks of sheered ice, hockey itself is a more effective videogame experience when it glosses over the little details and focuses on pace and responsiveness. This is why we used to love NHL games back in the day when they were all sprite-based and looked like Sensible Soccer. Modern hockey titles may be far more realistic, if you like, but that classic and improbable 16-bit facsimile of the sport held our attention for far longer. It aped the aesthetic but simplified the skill elements so they were more fluid and appealing. And it worked.And (welcome to the connection), with the exception of a few PC games, that's why modern golf games are so popular - despite that fact that half the people buying Tiger Woods or playing Links over Xbox Live probably couldn't pick a real pitching wedge from a five iron without consulting the label. Modern golf games aren't really that much like golf. They look similar, but they simplify the bits that take years to master - the long drives, the spin on the ball, the fade and draw, long-range putting, flopping and chipping-and-running, and so on and so forth - into a charitably simple and immediately gratifying process that doesn't take too long to learn and is still balanced by enough variables that there's enough skill involved to keep the player interested.The measure of a good golf game then, at least for the Tiger Woods generation, is not whether it kicks your arse for months on end, rains on you, forces you to walk ten miles a day and makes you go and find your own ball every time you land in the rough, but how quickly you can pick it up, how much there is to do and unlock, and how likely you are to try and fit another round (or two, or three) in before turning the game off and actually doing whatever it is you're supposed to be doing. And on that last note, the fact that we're writing this at around 6:30am on Monday and not well within the comfort zone of our leisurely Sunday evening probably speaks volumes.Mario Golf: Advance Tour [379 words to get there; well done -Ed] does more or less everything that's required to stand out as a top golf game, and for the Nintendo fetishists it's plenty quirky too. A round of golf unfolds in much the same way as it does in the GameCube Toadstool Tour, to which this is something of a companion piece (with interchangeable characters via link-up): you get a wide (overhead) shot of the hole, aim your looping trajectory marker at the position you want to end up (adjusting distance or club type to achieve the best possible results), gauge the possible effect of the wind and any hazards in the vicinity of where you're going, perhaps fine-tune your aim by changing the bit of the ball you'll strike, then let rip.The game now swings into a behind-the-character 3D-ish view. Here you hit A to start swinging, A or B when the cursor makes it to the left hand side of the shot meter, then A or B again when it travels back and gets to the centre-most point of a narrow band near where it started. Depending on whether that final button press happens when the cursor is left or right of or dead on the little marker, you'll add a bit of curl or just hit it dead straight. You can also add extra oomph to your shot by gambling one of your six power shots - press B to cycle to the power shot meter and you can let 'er rip further down the course, and even avoid using up one of your precious power shots if you can get the cursor to stop at precisely the right points on the meter.It feels almost exactly like the GameCube Mario Golf to play, and perhaps surprisingly it almost looks that way too. The presentation is distinctly Toadstool Tour-esque - the tunes, the course design with its nods, albeit a bit more reserved here, towards Mario game tradition, the menuing and art style. There are only a couple of areas where Advance Tour really stands apart. First there's putting. Perhaps uncertain of how to build a challenging but engaging putting game, the developer seems to have taken the easy way out and just given us an easy ride. Virtually every putt is sinkable with minimum adjustment - the speed arrows on the green indicating the angles can usually be overcome by just hitting the ball slightly harder - and the only thing that ever really throws you is the weather. Rain means adding about an extra half-load of power on top of what the shot meter suggests. Putting, then, is different to Toadstool Tour. The other big distinction is that Advance Tour is an RPG.Yes. Confusing though it might sound, Mario Golf: Advance Tour is a form of ~role-playing golf~. We only took this long to mention it on account of the fact that we're not entirely sold on the idea. It's rather cute and gives the game some body - and Camelot, being the masters of the Golden Sun series, certainly know how to make pleasant-looking, vibrant 16-bit RPG environments on the Game Boy Advance - but it seems a bit excessive that we're forced to sit through around fifteen minutes of dialogue between the budding golfers, their injured-but-fancies-a-comeback coach and the owners of the golf club where they've come to train for the summer before we even get to hit a ball. The little rivalries, sheer volume of good-natured folk with a line or two of semi-helpful or obvious tips, and all the walking in-between activities veers dangerously close to the excessive dillydallying the makes real golf rather more of an acquired taste than the virtual alternative.Fortunately it's not that serious, really, and it does have its benefits. Character development is handled cleverly, for example - at the start your little nobody-golfer is paired with one of his or her fellow students and, as you practice on the course, compete in tournaments and match-play games, visit training camps and tackle other diversionary golf-related gambits, you're given a pot of experience points to distribute between the two characters. When one of your golfers levels up, you get to upgrade one of a number of attributes, like driving distance, spin, control, etc. This works well. Plus, it masks a lot of the learning aspect from those who don't care about it, breaks up the rounds and gives you tangible goals to aim for - become the best and you can face off against the legendary Mario! Etc.Perhaps it's a little odd that you can't control Mario from the get-go (however, to satisfy the pedants, there is a ~quick golf~ mode where you can do just that, although you won't unlock anything), but then Advance Tour is an odd little game. And a very enjoyable one. The courses get progressively more difficult, and the challenge of completing them well within par is a tricky but, thanks to the quality of the control scheme, also a very satisfying task. And although the game hardly has enough courses to give the likes of Tiger Woods a worry, it does feature 'Star' versions of each of its main circuits, which introduce staple Mario elements like speed strips, warp pipes, chomps, piranha plants and even question mark blocks with certain benefits.It's also packed with options besides stroke and match-play rounds. The doubles options are a fairly blasé example but well worth mentioning - played either with another player (round-robin style on a single GBA or link-up cable style) or with your AI partner, these matches have you alternating from shot to shot like you're playing pool at the pub, and this kept us interested as we tried to overcome the various poor lies we inherited and tried to avoid landing our colleague six inches in front of a sheer cliff. Even if it is home to one of the game's only little niggles - some rather jerky camera behaviour when the AI-controlled character is lining up his or her shot.But more than that it's the quirky, totally un-golf-ish tasks that give the thing depth. Things like training mini-games, speed golf, club slots (use a slot machine to pick the only three approach clubs you're allowed for a three-hole challenge), and the through-the-rings challenge from Toadstool Tour (reborn in 2D) give you more to think about and help break up the continuous cycle of tournaments. And even when you reach the Mario showdown, you'll probably realise there's still a lot left to unlock.With Mario Golf: Advance Tour, Camelot proves it has that shrewd appreciation of what keeps people coming back to the likes of Toadstool Tour, Tiger Woods and the console Links - and also like those games it renders the sport with a degree of artistic licence. The result is a game that you can pick up and play, but won't necessarily be able to turn off and put down for several hours if you do, and the only drawbacks are that it sometimes looks a bit ropey, it doesn't quite manage to pull off the RPG idea completely, and the lack of a proper putting game detracts a little bit from the final few feet of every hole. But, in all honesty, if our SP's battery hadn't run down last night and the power cable hadn't proved elusive, we might have sat up in bed playing it until we had piranha plants burnt into our retinas. As it is, we're up at dawn to try and convince you to buy it. Well, if you want portable golf, just do. Ho-kay?Order yours now from Simply Games."}