{"ref": "https://www.eurogamer.net/r-futuretactics-ps2", "date": "16 Sep 2004", "game_name": "Future Tactics", "text": "Shop for games now with Simply Games.Having spent many a happy handheld hour hiding in the corner with an Advance War in progress, or steering our ragtag band of oddly named Fire Emblemeers towards their goal, we've long kept an eye open for a turn-based strategy title to play on our consoles under the TV. And with Kuju's Advance Wars offering still some way off, and surprisingly few similar titles in the PS2, Xbox or Cube's back catalogue, Zed Two's Future Tactics has swallowed up a fair bit of our curiosity ever since we first heard about it - the subsequent downfall of the UK-based developer notwithstanding [Zed's dead - dead Ed]. It's been out for a few months in the States, as you may know, but now it's on its way to Europe, and should be with us by the end of October courtesy of the good folks at the questionably capitalised JoWooD. We couldn't be bothered to wait any longer.The premise is very simple. You control a small band of downtrodden humans fighting to stay alive in the face of insurmountable numbers of purple-coloured vaguely crab-like enemies known simply as the Creatures. The idea is generally to kill them all, kill a specific unit, or reach a specific point on the map whilst keeping your entire party intact. Since it's a turn-based game, you do this in cycles - moving, then attacking, deciding where to leave your unit at the end of the turn, and then waiting for the enemy to make its moves.What separates Future Tactics slightly from the sorts of console turn-based strategy games you may have played in the past is the game's slightly more skill-based combat system, and an almost tic-tac-toe-esque end-of-turn setup, which either has you rest in your default state - leaving you relatively susceptible to attack, depending on any immediate cover in the vicinity - or opt to spend the time between turns shielded or healing. The upshot of shielding is that you won't take as much damage, and healing is fairly self-explanatory. The downsides, respectively, are a decreased range of movement in the next turn, and an increased susceptibility to enemy attacks while you patch up your wounds.Another key difference is the game's deformable scenery. Whenever you fire your weapons, which we'll get onto in a minute, the chances are you're going to blow a Worms-style chunk out of the landscape, and possibly send one or two of the oddly indestructible items in the level (usually carts, abandoned cars or big black boulders) careening around and possibly into the faces of your opposition. Although the effect is never quite as pronounced as it is in Team 17's series of games, it does occasionally open up some interesting possibilities that have to be factored into your strategy - impromptu cover points, uncovered upgrade packs (which allow you to up your damage rating, the range of your weapon, etc), and even, on a couple of occasions, handy ways of reaching higher ground.That's because Future Tactics isn't quite as prosaic as you might imagine of a turn-based strategy game. Your characters are actually fairly active - when it comes to movement, you're given a big green circle within which you can move anywhere and as much as you like. There are no predetermined number of grid spaces or anything of the sort here. Indeed, you can move back and forwards across the area until you're settled on a spot, jumping on top of buildings and boulders, scouting out the odd health pack (very useful in a tight spot) and even, as we said, taking advantage of chunks you've dug out of the top of a nearby hill and scaling the heights - particularly useful in a rather tricky level early on where you find yourself up against a hilltop-mounted catapult.And it doesn't lose that sense of liveliness once you've found a decent vantage point to take your shot, either. The combat mechanisms here are actually quite involved. With the average line-of-sight projectile weapon, you'll press the fire button and have a sniper scope-style aiming reticule drawn up in front of you. It's then up to you to keep it steady over an enemy as it wiggles around and hit X just as it's in the right place. You then have to hit X a couple of times as a pair of lines perpendicular to one another cross over the aiming reticule, trying to get them both to stop on top of the bull's eye. Do that and your shot will have 100 per cent power and accuracy. Make a meal of it and it won't, but you'll probably still do some damage as long as you were pointing in the right direction in the first place. Later on you also get to worry about timing a fourth button press to add extra power, taking multiple shots, and more besides.Before then however you'll also come across enemies with bazooka-style weapons that can be shot over the tops of buildings. These are also fairly easy to make use of - just press X and the game switches to an overhead view with a sonar-style pulse moving in and out from the centre. The idea is to hit X when it gets to the point at which you enemies - indicated by particular icons - are standing. Then a radar-style circular sweep pattern kicks off and you have to stop that beam once again when it coincides with the position of your enemy, ideally so that the two beams meet right on top of him. Bang, weapons fired, and with any luck it'll splatter down and leave a crater with him at the bottom of it nursing his wounds, and muttering in a frog-in-the-throat alien voice about how he'll get you next time.It is, however, rather unlikely that you'll kill him in one go, and this is perhaps where the game starts to seem less like fun. It's full of neat ideas - the destructible scenery gels wonderfully with the cartoon character models and action-oriented and yet turn-based strategic approach; the battle tunes, though they do become a little repetitive, are far more than your average throwaway battle accompaniments [sounding like groovy 70s rock to these ears - Ed]; and the design of the levels is increasingly varied despite a fairly rigid set of battling parameters - but it's also a little bit on the spiky side when it comes to the difficulty, and there are rather too many straightforward things in there that take rather too long to do [and cause Tom to shout at full volume in frustration -Ed].Consider the fact that the first and second levels are arguably a lot tougher than the subsequent five or six, and that some of them have the tendency to introduce respawning enemies or otherwise unhelpful deviations, and the overall impression dampens somewhat. It's also irritating that certain enemies lumber about ineffectually but still take a lot of popping up and battering to actually do any damage to - on more than a couple of occasions we found ourselves lurking behind rocks, ducking out to take a pot shot, ducking down again, and then just waiting for them to waddle around for a bit and give up so we could do it again. In fact, there's too much sitting around in general - too many pauses for enemies that don't plan to move much, too many repetitive respawn animations, too many things that could have been streamlined without making the game seem too jumpy. And the real problem with that is that Future Tactics isn't particularly complex, so you really don't have too much to think about in the intervening periods - the end of turn question of whether to rest, heal or shield is probably the most strategic decision you'll make turn to turn.Oh, and the camera, naturally, though it is less of a problem in a game like this, isn't very good at showing you what you want to see when you want to see it. But by far the game's biggest flaw, and arguably the clincher for us, is that a lot of our success seemed to be down to the AI's stupidity. Frighteningly effective at times, it is on the other hand capable of some grossly foolish mis-steps - propelling itself backward onto inescapable dropped-down ledges thanks to recoil, shooting the same rock on every turn even though there's no hope of hitting us (which is another Worms-like tendency, come to think of it), and standing in groups rather suicidally at the end of the odd turn.Yet despite all that, Future Tactics is, whether by a fluke of design or actual genius, really quite enjoyable. The story may not be the most earth shattering we've heard, the voice acting (though delightfully it's British!) can be a touch jarring on occasion, and it's initially frustrating and rather basic and rough around the edges in some other respects, but nevertheless it grows into something that you can happily sit down and chip away at all evening without getting too worked up. There's even a multiplayer or skirmish mode with a host of unlockables for those who want to persist and fulfil the criteria - by killing all enemies with one character, etc. Overall the sense of progression is there, and the variety of the missions and the surprising length, albeit not depth, of the game should be enough to tease £25 or thereabouts out of the wallets of turn-based strategic types with a hankering for something along these lines - even if it's arguably simple enough to master in a single evening. Not a classic then, but when it comes to filling time with something a little different, Future Tactics might prove to be a good strategy.Future Tactics: The Uprising is due out on PS2, Xbox, Cube and PC on October 22nd.Shop for games now with Simply Games."}