{"ref": "https://www.eurogamer.net/r-armymensargeswar-x", "date": "11 Aug 2004", "game_name": "Army Men: Sarge's War", "text": "Shop for games now with Simply Games.The Army Men brand may well apply to the toy soldiers we played with for all of ten minutes at some point in our youth, but as we've grown older it's become far more synonymous with mediocre videogames. Ubiquitous and generally half-arsed, they became something of a joke amongst the hacks over the years, particularly with those who'd followed the franchise from the very start of 3DO's ill-fated plastic putsch.What we're trying to say, really, is that we don't completely understand Take-Two budget label Global Star's decision to buy up the franchise during the recent 3DO car boot sale, and resurrect the likes of Sarge and, er, well, you know, all the others. But that's what happened, and the cheap and cheerful Army Men: Sarge's War is the first result. And, well, it's certainly a worthy follow-up...In fact, if 3DO's name were on the box and not Global Star's, it wouldn't be much of a surprise. This is exactly the same sort of formulaic run-and-gun crud that we're used to - boring to look at, tedious to play, unadventurous to the very last and often just plain daft. There's a four-player deathmatch mode, for example, and the game is Xbox Live 'aware', but ne'er the twain shall meet. And while the dev team seems to have grasped the obvious two-stick third-person movement of most games and mapped lock-on to the left trigger, apparently it's a better idea to map 'fire' to A than the right trigger, so you're forced to swing your right thumb back and forward between firing and wrestling the camera under control.Wrestling with the camera - and movement in general - is certainly a common theme. The game is a very basic third-person shoot-'em-up affair that involves navigating short chunks of level brimming with identikit enemies and repetitive objectives and then pressing B when you reach the exit. But the process of doing this is exacerbated by the over-sensitive analogue sticks, which have the brutish-looking Sarge pirouetting on the spot, getting caught in doorways and generally looking or running somewhere other than where you want. It doesn't help that locking onto enemies is a bit of a lottery and sometimes - usually when the going's actually tough - the game actually looks the wrong way when you lock-on if you're not facing the enemy already.This union of iffy lock-on and unwieldy camera - coupled with the AI 'Tan' army troops' erratic movement patterns - also makes it rather fiddly to use anything other than the Assault Rifle or the default Carbine popgun. Occasionally you'll pull out a grenade and hold still while you measure its firing arc, but aiming the bazooka or the powerful sniper rifle generally leaves you exposed for too long as you try to get the sights onto anything resembling an enemy - and not just the nearest mud-brown textured wall.As such, a lot of the game is spent gunning the same enemies down with the same weapons, picking up the same health pick-ups that all of them drop, and cursing the same flaws whenever you come unstuck. Sometimes you'll have to avoid a tank or gun turret long enough to clear out pesky Tan troopers and then toss grenades to take them out; and sometimes you'll have to dodge airstrikes from planes overhead long enough to shoot a 'spotter', but that's about as adventurous as it gets - unless the thought of climbing ladders and jumping over crates is something we're not giving enough credit. There are also some controllable turret sections, but these are just paste-down-A-and-wiggle-the-left-stick affairs that last about 20 seconds, and only serve to break up the action every once in a while.There really is nothing here to keep you playing on anything other than expressionless autopilot. The 'real time destruction' touted by the publisher amounts to enemies whose limbs visibly fly off when shot, and a hole that pops up in Sarge's chest when he's hit good and proper, but neither occurrence is particularly discernible in the low-poly world of Sarge's War - certainly not enough for you to get a kick out of it anyway - and graphically the rest of the game is pushing the Xbox about as hard as a real life toy soldier might be able to. As for the audio, there's Dolby Digital surround, but Saving Private Ryan this is not, with generic explosions, dull 'I am a videogame' voice acting and forgettable music the order of the day.All much as we've come to expect from the Army Men series, then. It's not thunderously bad, but it is offensively plain, and there are some really daft design decisions lurking among the ridges of this DVD. The fact that it only takes a handful of hours to complete on Normal difficulty is probably a good thing, all said, and the multiplayer is even more frustrating thanks to the awkwardly over-sensitive player and camera movement. With so much available on PS2, Xbox and PC that eclipses Sarge's War, we really would advise you not to bother, even for less than £20. Then again, you probably weren't going to anyway...Shop for games now with Simply Games."}