{"ref": "https://www.eurogamer.net/r-worldwarzero-ps2", "date": "14 Jul 2004", "game_name": "World War Zero: Iron Storm", "text": "Shop for games now with Simply Games.Never, in the field of human conflict, has so much been ~borrowed~ from so many by so few. Never has the game-playing public seen such a melange cobbled together from the great and good as it has in World War Zero. It's apt to twist Big Winston's words, as World War Zero - the Rebellion-developed first-person shooter - paraphrases the entire 20th Century in its guts, telling us that the War started in 1914 and is still raging 50 years on, and the Russians and Chinese have joined forces against America and, well, everyone else. America has put its armies on the stock exchange to fund the war, everything's dirty and trenches are full of semi-Samurai men in gas masks. And exploding dogs.The premise is most likely borne of a need to escape the unending wave of WWII shooters, but while the idea may have been interesting on the drawing board it does little to lift the game away from its obvious kin. In fact, it would be fair to say the World War Zero does nothing new. The amount of ideas and scenarios it hikes from previous examples borders on the hilarious after a good few hours of rattling away with your pseudo-realistic weapon set.Nyet? Da. World War Zero proudly shows off cage sections reminiscent of Quake 2 (full of dogs instead of groaning prisoners), lightning test-room effects just a little like those in Half-Life's prelude and a town called Wolfenburg. Wolfenburg? The ~bloom~ PS2 effect premiered in Burnout 2 is on full display, as it was in Judge Dredd, and there are soldiers above viewable through holes and pitched sniper battles across no man's land, reminding us of Call of Duty. As for Frontline, well let's just say there are rocket battles with tanks, a heavy reliance on the premise of bunkers and machine gun nests, an armo(u)red train, explosions surrounding the player to add the impression of thrill and AI compatriots rocking with you in house to house fighting. Any action fan (and after the last few years, every action fan will be more than familiar with gaming's genre-pushing WWII portfolio) will have seen it all before. But that doesn't necessarily mean World War Zero has no viable place. It's just a place on the periphery.What World War Zero does well is grab pretty much everything it likes from others of its ilk and lumps them together into a coherent whole. It works. It's a little shabby, but it works. You occasionally stick on scenery, you wander scratching your head as to what to do next from time to time, but its structure is relatively polished.Weapon balance leaves a little to be desired, and while you're handed a healthy list of lethal options, you tend to find yourself relying on a fully automatic gun, a sniper rifle and a rocket launcher. Again, that's not necessarily a horrific thing, as World War Zero is actually a lot of fun.Yes, fun. The big F. Shooting stuff always is, and Rebellion's effort is more immediate than Frontline, forsaking realism in weapon loading times for punchy action, especially noticeable when using the semi-automatic sniper rifle. Just like the paratrooper rifle from Wolfenstein. Oh. And did we mention the graphical style, which, while nobly trying to remove the game from the crowd with the addition of Tsarist and Mongol undertones, couples with the weapons' visual architecture to create a look not dissimilar from GSC's Codename Outbreak? Shame. But, nevertheless, World War Zero is an enjoyable, solid shooter. It's just not a new one.Multiplayer mode, however, is highly commendable if you're a first-person shooter fan. There's Deathmatch, Team Deathmatch and Capture the Flag for up to four players, and it all runs smoothly and explosively. It's a laugh in the same way Red Faction 2 was (it's actually a fair amount more exciting than that, but the core remains the same). But that's the rub. Constantly. It's impossible to talk about World War Zero in any respect without comparing it to endless other games.In essence, World War Zero shows little of the gloss and panache of Wolfenstein (on Xbox and PC at least, although it stands up well against the less than inspiring PS2 version), nothing of the exuberance of Call of Duty's power-played set pieces, nothing of the stunning inevitability and teen angst dumbness of Quake's hypnotic slog, despite trying to emulate them all. It has everything of Frontline, but dulls the sheen of that package's austere completion with relative daftness and the laying of a steaming log of mediocrity in its very core. Most of what it does is good, some of what it does is bad. Nothing is exemplary. We really did like the lighting, though, which casts moody, rock solid environments in a tightly tongue in cheek atmosphere. Thanks for that.Buy it on budget for that free weekend. It has plenty to recommend it, and shows Rebellion's skills in the console first-person shooter department are improving markedly, given a desperate first attempt with Judge Dredd. 2000AD fans should well take note. But in judging the game itself, Churchill would probably sneer a bit, nod patronising approval and blaze up a stogie as big as his head. It's okay. But we're probably glad WWI ended when it did.Shop for games now with Simply Games."}