{"ref": "https://www.eurogamer.net/agents-of-mayhem-review", "date": "18 Aug 2017", "game_name": "Agents of Mayhem", "text": "It's probably unfair to question the very reason for a game's existence, but with Volition's purple-hued Saints Row spin off, Agents Of Mayhem, it's hard to think of anything else.This is a game set in the Saints universe, with essentially none of its characters and absolutely none of its charm. It's an open world game with barely anyone or anything in said open world. It's an action RPG with stats and buffs and unlocks where you head into battle with a team of partners, but one that can only be played solo. It's a pastiche of an 80s children's cartoon, but crammed with so much swearing that you couldn't possibly show it to a kid. You tackle Seoul's new threat, LEGION., using a combination of three of the 12 titular Agents of MAYHEM., a GI Joe-style gang of misfits and oddballs, all of which bring unique attacks, weaponry and special moves to endless firefights against waves and waves of enemies. More puzzlingly, they also have the kind of buffs, status effects and coordinated attacks you'd typically see in an MMO. If Agents could be played in coop, it would make so much more sense - characters could support one another, different agent choices make for different team compositions, and all those nostalgia-tinged cosmetics you unlock? You'd actually be able to show them to someone. And yet, you play alone.But enough about what the game isn't, let's investigate what it actually is - a laborious shooter with almost no variety whatsoever, where every mission plays out identically, only with a gradual upwards curve in difficulty. You pick up a mission out in the open world or at your Agency Hub, known as the Ark, you bomb around Seoul until you get where you need to go, you hop out, and you shoot. Agents of Mayhem's hook, then, is that you can take control of three agents simultaneously. They all blend into one body like a Final Fantasy party, but with a jab of the d-pad you can switch between the three, essentially making you your own coop partner. When one of your agents is close to death, switch out to another. A tough enemy using a particular status effect or armour buff? Change agents to someone better suited. It works well and definitely makes Agents feel unique, but only for so long.Despite being an open world game, set in a garish purple version of a near-future Seoul, Agents of Mayhem barely uses its setting at all. You can drive around (and enter cars in impeccable fashion in animations that almost make up for the rest of the game), but outside of a few side missions and occasional story beats, you rarely have to do much driving, or exploring, or anything other than shooting. Nearly every one of Agent of Mayhem's sizeable number of missions ends up in an aesthetically identical underground bunker, where rooms are chained together in a way very reminiscent of Bloodborne's chalice dungeons, and so the bright lights of Seoul are often ignored or forgotten about.We've all played boring, unambitious shooters before, but what makes Agents Of Mayhem particularly exasperating is the fact its combat is actually clean and crisp and crunchy. Despite the thousands of bad guys you're asked to blast over the course of a few hours in the game's company, the act of pulling the trigger is enjoyable. Everything explodes in a shower of sparks and so much purple even Prince would have said 'this is probably a bit too much'. And the agents themselves are great. You begin with a Johnny Cage-a-like called Hollywood who can fire grenades and has a special that rips off explosions around him like a Michael Bay sequel, and he's joined by Hardtack, a giant tank-man with a shotgun who bears more than a passing resemblance to street fighting legend (and now sadly deceased) Kimbo Slice. Rounding out your original Mayhem trio is Fortune, a Hispanic girl with a drone whose special pumps a samba beat through the speakers and turns the action into a carnival of chaos. They're joined, among others, by a melee-focused ninja, a lady with a bow who can turn invisible, even Johnny Gat and Kingpin from Saints Row. And let's not forget the huge Russian man made out of ice who can be dressed up like Panthro from Thundercats. It's easy to like this band of b-movie badasses, but when all they're doing is incessant shooting, if doesn't matter if you're hanging out with The Rock, Will Smith and Stephen Fry - it's all going to get boring eventually. In between missions, you can warp back to the ark to purchase upgrades to your agency, levelling up your squad in the process or unlocking some more ordnance, but even this feels like work for work's sake. The inclusion of paid-for skins, too, never sits too well in a full-price game, but in truth they don't make a great deal of sense in a product with no online element to keep players hooked over the coming weeks and months.Perhaps Volition believes its story, told in animated cut-scenes, about a maniacal Dr. Babylon and his band of henchmen, is enough to maintain interest, but when you're coming off a game in Saints Row 4 where you play as a time travelling President, it's a bit of a comedown. The gags miss far more often than they hit, and  the constant swearing is inoffensive but feels weirdly out of place - it's a very unusual tone.Somewhere during the development of Agents of Mayhem, I'm sure Volition had something potentially exciting on its hands. Every part of this game feels like it was built for coop or at the very least some sort of asynchronous multiplayer where you compete with other agencies, but all we're left with is a soul-crushing husk.It'd be easier to stomach if the mechanics weren't so solid, if the characters didn't handle so well, if the pyrotechnics weren't so spectacular, but there's just not enough here to warrant the time in this most bounteous of gaming years. What is this all for? Why am I in another shiny metal underground base blasting shiny metal robot people? Agents of Mayhem exists in a purgatorial endlessness grind to nothing - if a tree falls in the forest with no one around does it make a sound? If a million robot dudes die in flames in a weird purple city with no one around to see them, shouldn't you be playing something else?"}