{"ref": "https://www.eurogamer.net/r-sonicadvance3-gba", "date": "8 Jul 2004", "game_name": "Sonic Advance 3", "text": "Order yours now from Simply Games.However many times Sega insists on tugging on the creamflow teat of Sonic, be it fully fledged 3D romperamas, pinball games, party games or even really terrible RPG-tinged franchise exercises, we always come to the same conclusion: the original was best. It's something of a small, albeit predictable victory that 13 years on since it all started that the latest title to feature the not-very-spiky hedgehog is a return to the very style that got people interested in the insanely fast platforming game in the first place.After the disappointment of Sonic Heroes - and to a lesser extent the Adventure series as a whole - the real hardcore following will want to wave SA3 in Sega's faces in the hope that its return to the series' roots has some influence on future Sonic titles; perhaps demonstrating why the series became such an international phenomenon in the first place. But although SA3 is another reminder of past glories, it's rooted so far in the past that it seems like Sonic Team dare not take things forward either. It's fine to dig up and recycle the past once or twice, but three times is probably asking a lot of the audience - especially for the money.Even the storywriters couldn't be arsed. ~Join the quest to defeat the evil Dr Eggman~ Oh please. Essentially it's all about playing through seven worlds, each with three levels, and their own boss, plus an end of game boss. Not much different there. Sonic Advance 3's hook is the tag team gameplay that allows you to pair up and play as any combination of five characters, including, of course, Sonic, Tales, Knuckles, Cream and Amy. Each have their own moves, and pairing them up offers different ways of dispatching enemies and accessing difficult to reach areas, so there's a ton of potential ways to complete each level, and it might take a serious amount of replaying on top of that if you plan to seek out the hidden Chao.A few new objects are thrown into the fray to up the comedy quotient such as catapults, swings, balloons, and seesaws, which take a bit of getting used to. New moves and new additions aside, the goal remains the same; collect rings, run from left to right as fast as you can and try not to hit enemies and traps along the way. Couldn’t be more familiar if it tried, basically.Taken on its own merits, Sonic Advance 3 is yet another fine exercise in showing off exactly what the GBA is capable of doing. No other game comes even close to blitzing the handheld's 2D capabilities quite so intensely - not only is it pushing the system to speeds that the human eye can barely keep up with, but the excellently detailed backgrounds and animation are possibly as good as we're likely to see from the humble handheld. But far from being just an excuse for Sonic Team to show off how fast it can make a game, it's a triumph of sorts that Sonic is still in the position of being the only platform game of its type, still managing to feel like nothing else out there.On the other hand, we have to pose the question whether more of the same is necessarily a good thing; there's probably a very good reason why other platform games don't pull the kind of tricks that Sonic games do. Not only would it be just plain thievery (like that ever stopped anyone), but blazingly fast side scrolling action is hardly something to salivate over these days. Several titles tried the same tricks in the early 90s with varying degrees of success, and although Sonic has outlasted them all by being the original and best, that doesn't make it necessarily better than other platformers out there, just different. The rest comes down to preference - and as far as this reviewer is concerned, it's time Sega considered making 2D Sonic platformers that didn’t rely quite so much on trying to impress the player with speed.Having played an almost endless succession platformers over the last 20 odd years, the reliance on fast paced sliding, jumping, bumping and the like arguably hinders the gameplay more than it actually helps it. Sure, the race to the finishing line is a test of reactions and skill like probably no other game of its kind, but the novelty has worn so thin you just wish the Sonic Team guys could branch the gameplay off into a different direction - without necessarily having to switch genres to milk the franchise for all its worth as they have done very successfully.Questioning Sega's continual rehashing of past glories won't necessarily be words that the stupendously loyal aficionados will take too kindly, but the truth is gameplay as a whole has moved on, yet Sonic remains firmly rooted more or less exactly where it began back in '91, dozens of incarnations ago. The question you, the consumer, have to ask is whether it is really worth another thirty-five quid to play what is - for the most part - more of the same.Multiplayer certainly helps improve matters a notch, but only if you've got a mate who owns the game. Both the adventure mode and Time Attack can be played two players with one character each. Single pak multiplayer games such as Find The Chao and Team Races are also available, but the excitement factor is limited, sadly. Multipak link up is where it's at, as ever.If you're one of the few that has never played a Sonic game, then playing Sonic Advance 3 will probably strike you as a bit of a rush - an exciting charge to the finish line and a real challenge to seek out the hidden paths and objects along the way. But for many of those who were around during the Mega Drive years and bought the Advance games out of an excited sense of nostalgia, this might be one too many. New characters, new moves, but in essence the same old Sonic. Sonic is a bit like the band you used to love when you were a nipper but just refuse to change their sound: they keep a loyal crowd and play all the hits on demand for nostalgia's sake, but the new tunes sound like the old ones. Only the real obsessives need worry about this one.Order yours now from Simply Games."}