{"ref": "https://www.eurogamer.net/r-dkc2-gba", "date": "25 Jun 2004", "game_name": "Donkey Kong Country 2: Diddy Kong's Quest", "text": "Shop for games now with Simply Games.2D platformers. Back in 1996, when DKC2 first graced these shores (that's Blighty, by the way - I'm sure it came out in other places beforehand), the Super Nintendo was rife with the things. They were to that generation what third-person action games are to this; ubiquitous, varying in quality, largely the same sort of thing, and generally flawed in all the same ways. It was inevitable then, that when Nintendo decided to re-release 400 of them on the Game Boy Advance, we were going to get cross with one sooner or later.Not Super Mario Bros. 2 though, oddly. Perhaps it was the joy of playing something like that again on a shiny new handheld, or perhaps we're just idiots, but we liked it. Same for Super Mario World, of course. But then that was a feat of precision that would make Audi engineers vomit in admiration. As for Yoshi's Island - arguably it was even better (in fact, since I don't want to argue about it, they were both top), and then there was Super Mario Bros. 3, which was probably a defining moment in this reviewer's young life when it originally appeared. Sure, graphics improved, level designs got craftier and more imaginative, and enemies learnt how to move around the screen properly after that, but the point is it was ace and still is.And, of course, Nintendo also thrust Donkey Kong Country upon us again with another handheld port. Which we also liked. Not as much as the Mario games, for obvious reasons (mainly that they were much better), but in a sort of nostalgic ~I played this all Christmas day in the early 90s and ooh crap it was gorgeous~ kind of sickening rose-tinted sort of way. Arguably though (and I do want to argue about this one), that's where it should have stopped. Enough's enough chaps, we've had all the best ones - third parties took care of the others - and you know it can only go downhill from here.But no. In its latest fit of frenzied restoration, Nintendo has given us Donkey Kong Country 2: Diddy's Kong Quest. Or is it Diddy Kong's Quest? We're never sure which it is, but we like the first one better. And that goes for the game too. You see, DKC2 wasn't particularly revolutionary. It tried a few different things, sharpened up a few areas (controls, difficulty curve, bonus rooms) and lasted slightly longer, but it was, however enjoyable, a pretty standard example of the genre game. Not a bad thing then. And still not quite the 2D platformer we're going to throw a wobbly at some day. But, the outside possibility of a ~lets shelve the GBA and focus on the DS~-level change of heart notwithstanding, this is probably where we ought to say schtop. Lest we all wake up next year and find ourselves playing trumped up versions of modern day classics like Super Mario 64 on handhelds instead because Nintendo's running out of older back catalogue. (Oh.)Still though, if Nintendo's enduring efforts to make us play its old platformers were to end with DKC2, then it wouldn't be so bad, because this isn't a bad swansong. It's a pretty standard 2D platformer, which means the plot's incidental (K. Rool has kidnapped Donkey Kong and Diddy Kong and his girlfriend Dixie are out to rescue him), you can take one hit before having to restart a level (banishing your selected character to a barrel with 'DK' written on it, which can be broken open to return him or her to your side), there's lots of stuff to find and collect (bananas, DK tokens, extra lives, coins with crocs on them, bonus room entrances), and you generally move left to right, leaping between platforms and objects, bouncing off the heads of enemies and occasionally deviating into a forced-scroll or mine cart level. Or a boss encounter.What sets DKC2 slightly apart, as it did its predecessor, is the ACM (Advanced Computer Modelling, or so it was) rendered visuals, which make the whole thing look rather like a digitised set of plastecine models. Albeit very pretty ones. It had (and has) little incidental touches that bring the world to life, like Dixie pausing to lick honey off the walls of a level set in a giant beehive, and character models that don't just sit still when you're not moving them. And all of this gave it a certain amount of character, which was aided somewhat by developer Rare's decision to spare Donkey and Diddy Kong any embarrassing dialogue, leaving third parties like Cranky Kong to make jokes about how rubbish he thinks the game is. (Although in actual fact, the latter is an approach bizarrely abandoned with the addition of a small in-game intro 'movie' slapped on to the beginning of this GBA port, which features Donkey, Diddy and Dixie uttering some crap lines on the beach. But the game still has enough character regardless.)Besides the visuals, then, it was and is only a solid platformer. This one learns from some of its predecessor's mistakes (it's slightly more forgiving in places, the controls are refined, bonus levels are actually skill-based from time to time, the mine cart levels are actually enjoyable), but not from others (it still has instant death 'issues' in some levels, and the rendered graphics mean the collision detection is sometimes a bit off). The use of Diddy and Dixie's differing skills (Dixie holds barrels above her head and can twirl her hair Tails-like to hover; Diddy's animations don't move him as far along as Dixie, meaning he feels more responsive to control) makes for a slightly more interesting dynamic, and equally in its favour, some of the game's new level ideas are great. The hot air balloons that have to be topped up with air from little geyser things are a nice alternative to just-plain-sinking platforms, and the new Kong creatures are also cleverly deployed - Squitter the spider can make little web platforms, which works well, while Rattly the snake can coil himself up to spring much higher than usual.It is still a bit short though, even if you scour every level for every last token and bonus item to get a completed save. Fortunately, this is where Nintendo hopes to annoy reviewers like this one who have hinged their entire concoction on the moany ~stop making 16-bit ports~ train of thought, by chucking in some bonus modes. One of them, Diddy Dash, is just a breakneck race through the game, with checkpoints to save you restarting levels entirely from scratch, and is probably good for a bit of added value if you're masochistic - or didn't bring Mario World on the same trip.The others vary. Bag a Bug is a sort of top-down rendered runaround which has you directing Diddy around a little circuit waiting for bugs to settle and then collecting them in a pot, whilst dodging attacks from a Kremling; and Expresso Racing is a side-scrolling, er, racing game, oddly enough, in which you control one of four Expressos (she was the ostrich), holding B to run left to right, hitting A to jump and moving in and out of the screen to align yourself with boost pads using up and down. The best of all though is probably Funky's Flights, which is similar in design to one of the latter single-player levels where you have to direct Squawks the parrot around a maze. In that level you tap A to keep him up; in this you just use the D-pad to manoeuvre Funky's gyrocopter, but it's still good arcade-y fun.But despite Nintendo's efforts to derail us in full flow with these extras, they still don't add a huge amount to the package. In fact, apart from Funky's Flights, which is genuinely diverting, they're all a bit simple. Although, to be fair, they beat the tedium-encrusted hell out of those Mario Bros. multiplayer games Nintendo shoves onto every Super Mario Advance cart, and they do have two and sometimes four-player modes.So then. Slightly more things to do, some new background visuals on the world map, and, for no apparent reason, rerecorded music that doesn't sound quite as catchy as it did before, on top of a remake of a platform game that had some good ideas but ultimately didn't take the genre anywhere new and probably signalled the last days of Donkey Kong's reign over the hyperbole of 16-bit games journalists. Not a bad package, really, just not a great one. It's never going to trouble the likes of Super Mario World or Yoshi's Island in the sheer artistry and quality of gameplay stakes, at least not in this reviewer's book, and it's not worth buying if you still have a copy of the SNES version kicking about, but for anybody who still gets excited about 2D platformers, this is a very solid and entertaining example.Shop for games now with Simply Games."}