{"ref": "https://www.eurogamer.net/r-cygirls-ps2", "date": "6 May 2004", "game_name": "Cy Girls", "text": "White boots. When a footballer steps onto the pitch in white boots, there's a sort of air of expectancy around him. He looks like he's running differently. He looks like he should be special. So, when it emerges that he's actually Phil Neville, and he gets nutmegged by some random Swedish attacker, we understandably get a little angry. ~Get back in your clunky 20 quid knock-offs you back-pedalling moron!~ we all yell at the TV screen.Two discs. Two discs are much the same. When a game pitches up on two discs, there's a sort of air of expectancy around it. It needs a different package. It looks like it should be special. So, when it emerges that it's actually an appallingly mundane and uninspired collection of tedious puzzles, pointless combat and repetitive gameplay, we understandably get a little angry. And we write really nasty and spiteful things about it on our website even when it comes from one of our favourite companies.Cy Girls is based on a line of toys from Japan. Out of all the toys in Japan, Konami picked a pair of girls (Ice and Aska) who go around hacking into things (both physically and technologically) and trying to uncover some sort of global conspiracy, flashing their breasts and generic sword and gun play around at every opportunity. And (we smell a gimmick) the result is a pair of intertwining adventures split onto two separate discs (theeere it is); one for the blond and gun-slinging Ice, and one for sword-wielding ninja cliché Aska.This in itself isn't a bad idea. As Konami's Japanese rivals Capcom proved with Resident Evil 2 (which, by some bizarre quirk of fate, this reviewer wound up playing through last weekend), intertwining stories are fine as long as they both stand out individually, the interaction doesn't feel too contrived, and the story is worth digesting as a whole. As you may have guessed, Cy Girls doesn't manage this at all. Instead, it seems to have heard about this approach from a mate at the pub and then tried to replicate it from memory a couple of years later. After a lobotomy. You get the idea.What we actually have here is some sort of sort of hackers-take-on-The-Man rubbish played out by voice actors who were probably kicked off the Power Rangers cast for their lack of talent. Describing the dialogue and acting as ~poor~ wouldn't do it justice, and it's hilarious to us that the game seems to be using technology from Metal Gear Solid 2, a game that pretty much rewrote the rulebook when it comes to engrossing and audacious storytelling.Okay, granted, some of you won't agree with us on that, but you'll certainly share our disgust if you're ever forced to sit down and play Cy Girls, because despite exhibiting yet more Resi 2 structural envy with its repetitive combat, respawning enemies, non-linear levels and traipsing back and forward across the game world, it never once managed to elicit a positive reaction. Believe it or not, we don't go into these games looking to rip into them; we go in looking for fun. But there just isn't anything entertaining in this. Neither the action nor the puzzles, which make up 90 per cent of Cy Girls, are in any way worthy of merit. Quite the opposite in fact.Take the combat. Take it outside, beat it with a stick, and leave it for dead. Hack, slash, shoot - apart from the odd moment of rummaging through the inventory for a Special Bomb to break through a wall (grenades are too wimpy), there is almost nothing here to alleviate the tedium of walking up to brainless enemies, whacking them a few times without response, and maybe jumping at the same time to pull off a slow motion finishing move, which requires no actual skill or technique at all. And, you know, it's really come to something when 'rummaging through the inventory' is a means of staving off tedium. To be fair (although quite why...), you can occasionally duck behind a wall and pop out to attack, but your enemies really aren't worth that much respect.There are plenty of them though, most of whom respawn if you leave a room for more than a few seconds and then return. And you will, constantly, because the puzzles consist of memorising objects, doors and other things you can't do anything with, and then traipsing back to them later when the game says you can. Switches, card keys, other plot devices - you'll soon realise that the level designers have just spread them at the farthest flung points of the level, and that it's your job to make sure you move between them in the right order.Even this is a bit more arduous than it should be, because impressively even the controls are half-arsed (it's nothing if not consistent). Analogue movement translates to two speeds - creeping (too slow) and running (too fast). Any time you do anything else (grappling, hanging from ledges) it feels hideously contrived, and the camera is predictably unhelpful throughout.It really doesn't have to be this way. To use Resident Evil 2 as an example again, that game is overflowing backtracking, respawning enemies, contrived puzzles, silly characters and general repetition - exactly what we're criticising here. The difference is that Resi 2 provokes an emotional response, masks its artificiality, and manages to instil a sense of satisfaction in you when you successfully juggle a head full of unrelated trivia and unravel the mystery of how to make progress. It feels like an adventure.Cy Girls, for its part, feels like a total waste of time, and if we had any white boots right now we'd ram our studs through its rubbish cover so it could never bother us again."}