{"ref": "https://www.eurogamer.net/r-projectzero2-ps2", "date": "29 Apr 2004", "game_name": "Project Zero 2: Crimson Butterfly", "text": "The camera always lies. If it's not making us look like the latest zombie half-breed candidate for www.ishaggedaminger.co.uk then its mood swings bizarrely round to the other flattering extremes. What a lovely backhanded compliment it is when someone says you're photogenic, when what they really mean is 'you don't look anywhere near as good as that in real life'. Sigh. Project Zero 2, for us, merely reinforces the principle that some things in life really shouldn't be photographed.Think of it as a kind of spiritual paparazzi hunt for all the tortured souls out there, where the depressed restless legions of the undead of the sleepy All God's Village fundamentally object to being woken up from decades of sleep by a camera wielding teenage girl. For god's sake, can't you perform a huge, bloodthirsty sacrificial ritual without some busy body sticking their great fat zoom lens into our business? Evidently not.Exactly like its predecessor, Crimson Butterfly twists the survival horror template by introducing a snap-happy mechanic that arms you (for the most part) with the curious Camera Obscura as a kind of makeshift weapon in order to fend off the unwelcome attentions of a procession of really not very happy individuals.For whatever spurious reasons, the twin teenagers Mayu and Mio stumble blindly into the perma-darkness of the aforementioned village and gradually uncover the fact that several people have gone missing trying to investigate the legend behind the infernal place - not least a chap who came armed with a rather useful camera that has the cunning ability to capture images not visible to the naked eye.The whole game is essentially built around the stupendously scary combat mechanic of the Camera Obscura, which allows the player to instantly switch to a first-person viewpoint in order to snap away at these denizens of the damned and put them at rest. For reasons you'll just have to accept, the special anti-spook abilities of the camera cause damage to these spirits every time you get within an acceptable range of them. In basic terms, the closer you can get to these fiends, the more damage you do to their souls, but also the more risk that they'll cop a feel of your tender neck and scare the bejesus out of you. Drain their soul energy and they're put to rest, often leaving behind useful upgrades or items essential to puzzles and plot.As you progress through the nine chapters (plus bonus) of the game, your 'firepower' gets continually upgraded with better camera 'ammo' that does more damage and reloads quicker, along with permanent enhancements to the camera via points gained during combat combined with the use of the occasional Spirit Orb that is left behind. Three key areas (range, sensitivity/firepower, and accumulation/charge power) can be powered up a maximum of three times, with four special attacks (slow, stun, see, blast) also available for you to choose from that, for example, give you increased damage, or slow down your assailant to help you creep right up to them before popping a flashbulb in their miserable faces.Although it doesn't fundamentally feel any different to the previous survival horror outing from Tecmo, both in terms of the play mechanics or the atmosphere, it's a game that had us gripped almost throughout such is the high quality of the all round feel and mystery of the proceedings.Visually it's consistently amazing how Temco manages to push every platform it turns its hands to, with a delicious degree of craft going into every location, creature and cut scene. Although lacking a widescreen option, the sheer quality of the immensely detailed highly textured environments coupled with superbly realized lighting and particle effects give the gamer a great desire to explore every inch of the village. The architecture itself is a wonderful example of how to design a compelling and credible gaming environment, with intertwining areas and the often superbly dramatic camera views that create an environment that remains consistent and - eventually - explorable down to the last nook.Being in perpetual near-darkness certainly aids Tecmo's quest to create a horrifying and unnerving environment, but it's backed up all the way by interesting lighting tricks, an excellent torch, with some truly nasty 'negative' effects and a grainy sub-reality mode where you can almost feel the characters losing their minds among the madness that threatens to engulf them. In combat, the use of simple but effective graphical trickery induces a sense of panic that even Silent Hill can't compete with. Wrestling unarmed against an increasingly aggressive posse of twisted, tortured souls isn't something you can rest easily over when they're busy sucking the very life out against a backdrop of an orchestra of truly unsettling noise.In fact, the audio is possibly as important an ingredient as anything else in the game, with an alarming barrage of disconnected voices pleading for answers (~why do you kill? Don't kill~) against a twisted cacophony of screeching feedback and the rumblings of troubled souls. Seriously, at the risk of sounding like a cliché, playing this on your own with the lights off and the bass up must rank alongside the most unsettling gaming experiences ever. The tension's literally pouring out of every keystroke, and anyone even vaguely interested in survival horror, or narrative-focused action adventures owes it to themselves to check Crimson Butterfly out.There are, of course elements of the game that conspire to niggle away at our desire to praise Tecmo's latest to the rooftops. Top of the list of complaints is that the gameplay just hasn't really moved on in any meaningful way since we last waved our cameras around at spooks. In a sense, this isn't a criticism as such as the same issues apply to the entire Ressie Evil and Silent Hill series, and there's arguably a whole lot more innovation going on here than either of those, but it still feels like you're playing largely the same game in a different setting.Possibly the most damning criticism is the way Tecmo has structured the game so that you're forced to wander around areas again and again, with scripted events constantly needing to happen in order to advance the plot at all. If, for example, you happen to have not gone back to a specific, predetermined room, then literally nothing can move on until you do. This tends to result in a mass bout of headless chicken wandering and map-checking to ascertain where you've been, and can hold you up for literally half an hour at a time if you're unlucky.Not only that, while you're stuck in limbo land it's possible that there's literally nothing else to do if you've already taken care of the pre-scripted baddies, and merely running around empty environments can be a frustrating slog. There does appear to be a sort of handy in-game hint device in the form of a white haired boy trapped behind bars, but until you actually discover that for yourself, there will undoubtedly be times when you'll just wish you could move things on.It's also worth pointing out that beyond the excellent combat encounters, the actual core of the game still conforms rigidly to the old school survival horror template of finding the key to unlock the myriad of doors that you face. Some of the puzzles are genuinely good fun, though, but if you've played your fair share of horror adventures, the whole map check/item search slog does feel more than a little tired 12 years on from Alone In The Dark.With a static camera system causing a few headaches in terms of disorientation and not actually being able to see where your enemy is coming from half the time (although camera power ups eventually help you with this), it's a game you're more likely to accommodate through your experiences with similar titles than if you're new to this sort of thing. Having played the new Silent Hill this week, some of the general mechanics feel rooted in the old school, and that's a little disappointing. Still, discarding relatively minor mechanics issues, Crimson Butterfly gets along by virtue of its intensely unnerving atmosphere, crafted by delicious graphics, decent storyline and even better-than-usual voiceovers. It's not perhaps the hardest game in the world, but the fact that frustration was kept to a relative minimum can only be a good thing.If you feel like you've had your fill of this type of game, then there's not a huge likelihood that Crimson Butterfly will change your mind about that. For the aficionados, though, it’s another wonderfully honed effort from Tecmo that firmly establishes the team alongside Konami and Capcom in the horror adventure stakes. Although not much of an advancement from the woefully ignored original, its storyline and atmosphere carry it into 'worthy sequel' territory. Would we shell out full price for it? Yes, on the basis that it's one of the most gripping, if not exactly groundbreaking games we've played so far this year, but check out the cheap-as-chips original first if you haven't already - if you have the stomach for the fight."}