{"ref": "https://www.eurogamer.net/r-metroidzeromission-gba", "date": "16 Apr 2004", "game_name": "Metroid: Zero Mission", "text": "Say what you like about Metroid Prime (we'd prefer that you say it was magnificent, but that's neither here nor there), there's no doubt that it's done wonders for the career of one Samus Aran. From her beginnings in a 2D game which left her gender in doubt right until the very end, young Ms. Aran has come on in leaps and bounds (often off the heads of frozen enemies) and is now probably one of the most bankable stars in videogames. John Woo wants to make a movie with the power-suited vixen in it - and since so many videogames have spent the past decade stealing ideas unashamedly from the self-same Mr Woo, there can hardly be any higher praise than that.Often, when the full light of international fame falls on a rising young starlet, they'll go to great lengths to cover up their earlier works. Not our Samus, though, oh no. She's a Nintendo girl through and through, which essentially means that she's perfectly happy to dust down any two-bit game she starred in when she was young and needed the money as long as there's a quick buck to be made with a GBA re-release. So then, here we are, with Samus' very first adventure - right from back when her curvy bits were rattling around inside that big suit (probably) - making the leap over to the Game Boy Advance.Of course, we jest. Samus Aran never starred in anything particularly rubbish as a young lady, which is why (Metroid Prime-related career revivals aside) she remains such an enduring game character to this day. However, we can't help but approach Metroid: Zero Mission with a certain sense of trepidation, since despite the rose-tinted spectacles with which we tend to view the hard-suited lass' first venture beneath the crust of the planet Zebes, we couldn't help but feel that in light of more modern Metroid adventures, it might all feel a bit basic. Boring, even. Dull.We need not have worried. Nintendo's development team haven't taken the word ~port~ even remotely literally - and it would be fair to describe Metroid: Zero Mission as a re-imagining of Samus' first brush with the Metroids rather than as a GBA conversion of the old game. Many segments of the game will certainly be familiar to veterans of the Metroid series, but the whole thing comes together quite differently from the original, and features a number of brand new areas and a completely new chapter at the end of the story. The basics of the first Metroid remain intact, but they've been brought up to date in an artful fashion to create a game that echoes the classic Super Metroid as much as it does the original, playing like a more modern title.For those who haven't played a Metroid game before, a brief explanation is necessary. The game is largely speaking an action platformer, but one which relies on exploration as its key gameplay mechanic. As you progress through the game, you're rewarded with upgrades for Samus' powered armour suit, some of which grant abilities that can be used to reach previously inaccessible parts of the world map. The whole game is littered with hidden secrets and logic puzzles that often require a particularly lateral bit of thinking regarding the use of one of your abilities, and as such platformer staples such as pixel-perfect jumps are relatively rare.Despite its free roaming nature, Zero Mission can actually feel quite linear at times, as there is often only one path open to you which will actually open up any more of the map - and this is generally pointed out to you by the target indicator triggered by sitting in the alien Chozo statues that litter the game. Resting in the statues changes their position, allowing you to proceed past them through the game, but also gives you a very deliberate indicator of where you're meant to go next by way of a great big marker on your map. It's not subtle, but it's not actually as intrusive as you might think either. We often found ourselves thankful of the marker since it indicated that there were new rooms to be discovered in a part of the map we hadn't even considered.Besides which, there's sufficient freedom to allow you to roam wherever you like and discover some of the game's huge number of secret areas if you don't fancy following the path exactly as laid out. In fact, Zero Mission makes a point of rewarding you for re-exploring old areas with the new abilities you've learned, and often leaves bonuses such as extra missile capacity and energy tanks lying around for you to discover in earlier parts of the game once you've unlocked more of Samus' abilities.And what a range of abilities they are, by the way; perhaps not as extensive as in some later titles, but right from the outset Samus has been a very versatile young lady. All the staples of the Metroid series are here - firing a variety of different types of energy beams and rockets, rolling into a ball to plant bombs, double jumping, jump attacks, dash attacks - all of these and a number of other abilities combine to give the player a platform puzzle solving arsenal that's second to none, and Zero Mission's designers haven't let the side down in that respect either, with each map area filled with intelligent, interesting puzzles - some optional, and some vital to progressing through the game.In fact, the whole mechanic of adding new abilities and enhancing your combat and puzzle solving capacity is incredibly addictive, as the popularity of the Metroid and Castlevania series' proves, and there are few finer examples of that kind of gameplay than Zero Mission. Significantly better than the previous GBA outing, Metroid Fusion, which had a tendency to rush you through the game with a highly obtrusive storytelling mechanism, Zero Mission is hugely enjoyable - which brings us to the core problem with the game, namely that there simply isn't enough of it.Admittedly, there's as much content here as there was in the original Metroid, and much more besides - but you'll probably find yourself finishing the game in only five hours or so, which isn't exactly epic length. Completing it the first time unlocks a new ~hard~ mode, which is genuinely challenging, along with a copy of Metroid in its original form, but the replay value aside, the game is really very short.Which isn't to say that it's bad by any means. In fact, every minute of that five hours was excellent, and Zero Mission takes its place as one of the finest titles in the GBA's already impressive pantheon of platformers. However, we can't help but wish that it had been longer - or at the very least, that Nintendo would release games like this a bit more often. The caveat of the length of the game being duly noted, we can't recommend this game highly enough to fans of the Metroid series or to platformer fans in general."}