{"ref": "https://www.eurogamer.net/r-hitmancontracts-ps2", "date": "15 Apr 2004", "game_name": "Hitman: Contracts", "text": "As noble an intention as 'open-ended gameplay' is, Hitman: Contracts is both blessed and cursed by its refusal to lead the gamer by the hand. As good as it sounds on paper to give the player the freedom to attempt their objectives as they see fit, it's a hefty risk to leave people with a joypad in hand and a headful of ideas. But while Contracts takes time to appreciate, somehow it gets away with it. As much as it can come across as trying to be all things to all people, and less than the sum of its parts, Io succeeds by always remembering that games are supposed to be fun. Contracts is never less than fun, no matter how many times you tell yourself that it's neither the most convincing stealth experience nor the most clued-up action game. It's an odd blend, but like Peanut Butter and Jam on toast, somehow it works.In the third part of the popular series, 47 wakes up trapped in a dingy hotel room, and Io tells the story of the bald assassin's plight via a series of often surreal flashbacks to justify why it is you've been hired to kill a succession of henchmen. Split into 12 'contracts' and set across distinct and often gorgeous locales (including Hong Kong, France, England and Russia), the game follows the template laid down by Silent Assassin in that you're given a few basic mission goals and left to your own devices as to how to achieve them.After the initially bizarre escape mission, the game quickly settles into the comfortable and predictable groove of taking out specific unsavoury gang members while acquiring objects along the way. But while the basic goals may be simplistic, the varieties of ways you can achieve your missions are almost mind-boggling.Part of the success of Contracts is in its level design, which nearly always demands repeat exploration before all of its secrets come to the fore. Some of the very hardest levels actually turn out to be incredibly simple if you're prepared to take the time and effort to check out the map, investigate the clues offered (in the form of exclamation marks on the map) and work out what they're used for. Unlike, say, Splinter Cell, there's often little requirement to do everything in a prescribed fashion, and if you screw up you can still succeed - albeit with a whole pile of lead following in hot pursuit. As noble a game design decision as this may be, it leaves you forced, as with the previous games, to engage in a hefty bout of trial and error before you finally take the time to observe the movements of guards, and stop giving yourself away by marching around wielding your firearms screaming 'shoot me'.However, thanks to some fairly slack lemming-like AI, picking off a huge crowd of enemies is never as hard as you suspect it will be. Once you're rumbled, the only tactics seemingly open to these drones is to come streaming towards you, and with some incredibly forgiving hit-zone collision detection and a generous degree of health, the chances of surviving are a lot higher than almost any game we've ever played. Seriously. Throw in seven instant saves per level and most of the 12 levels (on default Normal skill level) can be conquered in between half an hour and 90 minutes, which means that most of you will have polished this off over a weekend.But unlike most games around these days, part of Contract's charm is the replayability of some - but not all - levels. For example, one of the Hong Kong levels tasks 47 with causing the death of a Triad leader and making it look like the death was caused by a rival gang. Arguably the hardest level of the bunch, there are actually a least two (maybe three, this reviewer couldn't pull one of them all off) ways to succeed, and every single one feels like a triumph once you manage it. Another level even offers you the choice of fighting your way out of an apartment building swarming with SWAT teams or legging it from roof to roof - and it's all the better for offering you the choice.Often you actually feel like throwing caution to the wind and killing everyone just to prove that you can; other times the thrill of the sneak seems like the more compelling option. It's very much up to you. If we were to side with one style over the other, it's true that Contracts feels at its most cohesive when it's forcing the player to think rather than allowing the player to simply run around shooting everyone. It seems a shame in a way that often the most efficient way of completing a level is to manage your save games wisely and just charge through each mission blasting everyone and keeping your distance. The upshot is that this approach means that you can effectively ignore all the cunning, sabotage, stealth kills and disguises available to you - i.e. all the bits that the game does really well.Having said that, the fact that Contracts doesn't punish the player too hard for alerting guards and playing the Rambo mass murderer is something of a relief for the simple reason that the game would otherwise risk becoming ridiculously frustrating. Part of the fun, for many, may well be to charge through the game sightseeing, then pick from favourite 'contracts' and attempt to win the extra weaponry rewards - offered by completing each contract 'cleanly', with no blood on your hands and no-one the wiser to your presence. Regardless of your gaming preference though, it's a pleasant relief to be able to tackle a level via your own route, with your own weapons and choice of disguise (or not). No one's forcing you to do it either way. At the very least Io deserves praise for even attempting to pull off such a feat.But as we touched on earlier, this mix and match approach would be so much better than it is if Io had managed to hone either element. Armed combat at the default difficulty level requires little to no skill to master, while the stealth side of the game often feels too restrictive to be as useful as it could be. While not wishing to make unfair comparisons, Splinter Cell gets it right by allowing you to lurk in the shadows and use sound to your advantage, while MGS gives the player an instant reference of the subject's field of vision (at least for the most part). In Contracts, unless you're lucky enough to be right behind a player and able to creep quietly enough (they're prone to turning around at the most inconvenient moments), your chances of garrotting or injecting an enemy are limited. Also, luring guards away from the areas they are guarding is next to impossible, meaning that a disguise is often the only option available to you. Much of the time you're basically working around the design limitations imposed, when logic suggests that the solution should be easier than cutting off the gas, poisoning the drinks and dressing up as a chef.A minor gripe comes around the halfway point when it's apparent that the team basically ran out of ideas and decided to repeat entire levels wholesale. The first time it happens it feels a bit of a jolt - finding out that another level is entirely reused feels a little cheap. Sure, the scenario is somewhat different, but the point remains that you're only effectively seeing 10 levels, and some of the latter missions fall into a formulaic trap that hints that the project ran out of steam under pressure to release the game on time.Onto more aesthetic matters, the detail level throughout the game never fails to impress, with some of the most subtle effects and intricate design yet seen on a PS2. What it lacks in texture detail it more than makes up for with sound architecture, and the presence of some beautiful post filter effects, which Io has reportedly managed to bring in thanks a refined, four-times-faster game engine. If the early part of the game doesn't impress dramatically, by the time you're wandering around the steam-laden streets of Hong Kong you definitely will be. Subtle effects such as post colour correction are especially noticeable as you emerge from a darkened area into the light, although it's worth noting that our review build still had a few very minor incidents of slowdown in the more ambitious sections.In-keeping with the other titles in the series, the animation is somewhat stylised and open to criticism, particularly for the odd quirk that leaves 47 looking more like a wobbly-legged puppet than a cold-eyed killer. Io seems more than capable of ramming the game chock full of excellent death animations and well defined characters with bags of charm, but making them run convincingly seems to be a task too far once again. If you happen to change direction repeatedly, 47 slides haplessly, and the overall feel is that you're gliding along rather than actually running. But if it feels all a bit odd to begin with, the reality is you don't really care for too long and the more you play the game, the more you appreciate the ability to instantly flick between first and third-person viewpoints. For the most part, the game works exceptionally well in either mode, although it's fair to say that the sniper rifle and night vision goggles could have been better implemented, as they tend to act as more of a hindrance than a help.Audio-wise, Contracts follows the series tradition of employing the considerable talents of Jespar Kyd, who has yet again conjured an exceptional soundtrack that for the most part is an unobtrusive backdrop to the already dark and moody ambience on show elsewhere. Especially impressive is the way that room-based music pans in and out of the speakers depending on where you're positioned. Meanwhile the voiceovers are generally of a high class in the impressively stylish cut-scenes, but tend to stray into parody territory in almost every worldwide setting (note the Clouseau-esque Frenchmen on the last level for starters).All told, Contracts is a game that's almost always enjoyable thanks to the freedom it grants the player. Also, with its more forgiving default skill level it's less likely to induce those settee-smashing moments that other sneaky games seem to revel in. With this in mind though, the more seasoned hitmen out there would definitely feel less inclined to moan about dumb AI and unrealistic health levels by heading straight for the Expert level - although reducing the save count to two per level is bound to cause a few headaches.But with only a few relatively minor tweaks such as a few new weapons, moves and animations, its fair to say that Contracts is a solid evolution of the series rather than the dramatic improvement version two was over the original. If you're a gamer that embraces the open-ended trial-and-error gameplay, and don't mind that it's neither the best example of stealth nor action gameplay, then this will serve you well. But as entertaining as Contracts undoubtedly is, there's still plenty of room for improvement before Io nails this compelling pot pourri of gaming styles."}