{"ref": "https://www.eurogamer.net/lawbreakers-review", "date": "15 Aug 2017", "game_name": "LawBreakers", "text": "To have even the slightest chance of survival in this viciously competitive shooter world, your game needs to have that moment. That almost indefinable feeling that suddenly elevates it above all the mechanically sound, competent first-person shooters out there; the second where eyebrows raise, heads nod and expletives echo from open mouths. In Overwatch, a game that has more than just a little bit in common with LawBreakers, my 'moment' came when my team and I held down a capture point for over five straight minutes, chaining and comboing Ults, maintaining constant frenzied communication, battling for our lives. In Titanfall it's the first kill-to-wallrun-to-Titan embark. Easy. In Playunknown's Battlegrounds, it's probably the first time you actually manage to kill someone. There's no guarantee of what these moments will be or how they'll affect you, and they'll rarely be the same for everyone. But the game needs to have one, and have it quickly, else it'll go the way of Battleborn. Or Homefront. Or whispers MAG.My first true LawBreakers 'moment' came from an unexpected source. I wrote in my beta preview about the game's zero G sections being its 'big deal' - how the thrill of chasing someone from the ground up into full 360 degree motion, all while maintaining control and accuracy, felt truly fresh in a genre that is so well trodden. And that's absolutely true, but it was only when I wrapped my head around LawBreakers combo system and unleashed the potential of each class in my mind did I truly appreciate the level of design that has gone into this finely-tuned production. The 'moment' where LawBreakers turned from good to potentially great came from nothing more than a simple backstep and a kill. Using the Enforcer class, who comes equipped with a medium-range assault rifle, an electromag grenade and the ability to run (and a multi-missile Ult, although they're not called that in LawBreakers), it was probably 20 or even 30 matches in before I realised that pressing down on the stick (or 'S' on a keyboard) in conjunction with the run power makes you take a large, jet-propelled step backwards. Combo that with your grenade, which not only deals damage but stops its target from using their powers for a few seconds, and you suddenly have a way of maintaining that crucial range when you have an Assassin or Juggernaut bearing down on you. I executed this combo, in a mild panic if truth be told, and finished my pursuer with a headshot - which has the most satisfying crunch you've heard since Gears - and a little medal popped up at the bottom of my screen, almost like an acknowledging nod from the developers. That was my moment. And it's been the first of many.LawBreakers is a shooter of true pedigree. That word keeps springing to mind because you can feel the heritage here. Yes, Boss Key Productions is a new studio, but Cliff Bleszinski's fingerprints are all over this, and it's abundantly obvious that multiple veterans of the much-loved but long-lost Unreal series have cultivated LawBreakers' design. Yes, the Overwatch similarities are clear and are worth discussing, but on the battlefield, where it matters, this is about as Unreal as it gets. There's both a precision and weight to the firefights, the punch of the guns, the sizeable TTK, the wiry character models, the gruesome gibs - it's both proudly old fashioned and chest-thumpingly modern. You just don't get that without some of the brightest minds in shooting games getting involved. What are you actually doing in LawBreakers, though, beyond flying about the place shooting people in the face? This is a purely multiplayer experience, with eight maps, nine classes (across 18 characters, two cosmetically different folk per class) and five modes, namely Turf War, Occupy, Uplink, Overcharge and the tremendous Blitzball.  Turf War and Occupy are both zone capture affairs, with the latter being a fairly typical King Of The Hill variant with a zone that moves every 45 seconds. It's LawBreakers' least interesting mode, but it doesn't stop matches being thrilling, especially when the zone spawns in the middle of a zero G section. Turf War, though, looks very familiar - a three point Domination - but the twist here is that each capture point is locked down as soon as it's taken. Once all three are captured, there's a brief, live intermission, and it all starts again. It completely disrupts the classic Domination archetype, requiring totally new tactics and strategies. Do you stick to your base to make sure you at least lock down one zone, or risk piling into the middle to battle over B. What if they take both the flanks? And each round informs the last - it's a brilliant take on a classic idea.Overcharge and Uplink are two similar and two similarly inspired modes. Both ask the teams of five to pile into the middle of a map to collect an item; a satellite core for Uplink and a battery for Overcharge. Take them back to your base, charge them to 100 per cent, hold that for another twenty seconds, and you score a point. In Overcharge, though, the battery keeps its charge even if the other team nicks it, so you can theoretically (and in practise, it's happened to me), charge the battery all the way up to 100 per cent, have it stolen during the final 20 second hold-out, and the enemy sprints back home, sticks it in their base, holds for 20 seconds and takes the point. The bastards.Uplink is essentially the same, only the item doesn't hold the charge, so there's less scope for last-second misery or elation, but just as much room for tactical advances or dramatic base defenses. Both modes conjure up amazing back-and forth tussles, as LawBreakers is designed to almost force drama out of its match-ups. And in the quite brilliant Blitzball (sit down Tidus, we're not talking about you), LawBreakers really finds its sweet spot. Again, it's about rushing the center of the map, grabbing an item, and taking it back to the base. However, apart from the timed shield that dissipates when you grab the ball, there is no charging or waiting needed. Rush it to your base, score a point, and the first to eight wins. It's frenetic, tactical, aggressive and often hilarious, particularly as the actual ball has its own voice (provided by none other than Morty himself, Justin Roiland) and looks very much like Don-Chan from Taiko No Tatsujin. This mode also shows off the brilliant transitions between ground fighting and zero G, as tussles over the ball take place in mid air, then those last-minute dashes across the ground while everyone desperately tries to pepper you with bullets. It's terrific.With so much riding on the back-and-forth nature of these modes, then, it's disappointing that LawBreakers' matchmaking currently feels like it needs major work. It may be down to the relatively low player base (although I never had trouble getting a game on PS4 or PC), but the majority of matches are either 'stomp' or 'be stomped', and even though there's a large red message telling us about team rebalancing after each match, it rarely seems to make a difference. Also, another connectivity issue reared its very ugly head on launch day on PS4. Massive stuttering and frame hitching rendered the game nearly unplayable until a patch was deployed, a strange problem considering its total absence from the beta just two weeks prior. There is still some hitching here and there; far more infrequent and less horrific, but still not ideal when you're ten seconds into an epic gun-on-gun battle. Hopefully these little problems get ironed out too - they're no longer game breaking, but they still shouldn't be there. But what about those Overwatch comparisons? Let's get it out of the way. There's a reason smart-arses on Twitter are calling this Bro-verwatch. The class-selection screens, the warm up areas, the powers - they all owe an obvious debt to Blizzard's powerhouse, and as I said previously, LawBreakers just cannot compete with Overwatch's charm and personality. In fact, it's often quite off putting - some of the characters seem wilfully obnoxious, and it's hard to get excited about class types as generic as Wraith, Vanguard and Battle Medic. Still, unlock a few Stash Boxes, grab a few new skins and LawBreakers does start to show a bit of flair. And as you become attached to your chosen two or three classes and build out each one cosmetically, there's definitely enough character here to get attached to. I am now very fond of my Kitsune Assassin in her golden coat and tie, thank you very much. And in truth, it's the powers that really make the classes exciting. That assassin can dodge three times like Tracer, fire out a grappling hook like a Titanfall 2 pilot, and switch from her melee-only knife to a plasma shotgun when she can't' get up close. Master her, and some of the plays you can execute will be legendary. Vanguards can fly forward and smash the ground. My friend the Enforcer can use his run to buff the speed of his teammates, not unlike my other mate Lucio. It's tough to avoid the direct comparisons to other shooters, because they're all there in plain sight, and this does make LawBreakers easy to dismiss. But the important point here, is that LawBreakers may seem like Overwatch and 20 other shooters, but it doesn't feel like them. It feels like Unreal Tournament made for a 2017 world; a world of Twitch and esports and DLC and loot boxes.LawBreakers can't match Overwatch's strategic complexity or the amazing synergy between its classes, but do you know what? In that pure 'moment', that 360-degree, gun-on-gun struggle, I think it's stronger. As a pure shooter, it carries a violence and a punch that Overwatch doesn't quite match. Bleszinski and co. have bet the farm on this project and the early signs are worrying - lower Steam launch figures than that fabled flop Battleborn, and far from huge numbers on Twitch and YouTube, but in 2017, a shooter can recover from a faltering start. Rainbow Six Siege is now massive. Titanfall 2 has a steady footing and a consistent community. And crucially, LawBreakers has that pedigree, that quality to stand tall with those top-tier games and command an audience over time.In truth, this could end up being the best classic competitive shooter released this year. There's plenty of competition to come, of course, and it needs to tweak its matchmaking and push out some new content before long, but don't be fooled into thinking this is just another also-ran hero shooter wannabe. Cliff and his crew know exactly what they're doing."}