{"ref": "https://www.eurogamer.net/r-tenchurfd-x", "date": "6 Apr 2004", "game_name": "Tenchu: Return from Darkness", "text": "When Tenchu: Wrath of Heaven was released on PS2 last year, it was hailed - third-person camera issues notwithstanding - as a gruesome and generally competent example of fleet-footed slaughter, and topped the charts. Upon closer inspection though, it was hamstrung by technical problems that regularly conspired to derail our ninja fantasies in punishing and frustrating ways, and ultimately it fell some way short of achieving its full potential. Yet, despite our initial misgivings, the thought that Return From Darkness might address Wrath of Heaven's technical failings was more than enough to tempt us back for another helping. And with so many look-but-don't-touch stealth titles doing the rounds, all that painstaking murder sounded slightly cathartic, too.You can imagine our disappointment, then, when it turned out that Tenchu: Return From Darkness is little more than a slightly expanded version of Wrath of Heaven, which still suffers from all the same problems and seems to have aged worryingly fast in the intervening period to boot. And if you can't imagine our disappointment, here's roughly what it sounded like: ~Oooo... Aaawww! Bastards.~For those who missed Wrath of Heaven or the original PSone Tenchu titles, the idea is to creep around and brutally slaughter enemies without revealing yourself too much. Playing the game will come easily to any modern console owner - the left and right sticks are for movement and camera respectively, A jumps and double-jumps, Y uses items (with the D-pad for selection), while X, B and the triggers come into play in stealth and combat.Although there is a varied combat system here, and an increasing number of attacking moves as you work your way through the game, it's generally best to avoid direct confrontation. By holding the left trigger while moving, your ninja hunches and creeps along, allowing him to evade detection, sidle along walls and peek round. When you've sneaked right the way up to a blissfully ignorant sentry, the X button is used to administer a stealth kill, which the camera frames in gruesome close-up.Helping you on your way is a meter in the bottom left that represents the nearest guard's wariness as a growing exclamation mark. Next to it a little counter ticks up and down between 0 and 100 depending on his alertness, and when it turns into a pair of fiery exclamation marks and you start hearing shouts, he's spotted you, and you'll either have to fight him off or run away and hide. Fortunately the latter isn't very difficult to do, but you won't get the highest ranking for a level if you're spotted.And therein, basically, lies the game. Each level is like a big ninja playground in which you can climb around with your grappling hook, creep silently over rooftops, and observe your enemies until you're comfortable enough to start picking them off. Stealth killing is your main tool, and there are a number of different animations to see by attacking from different angles. Jump from a building, for example, and you'll plunge your sword into an enemy's throat, but for a more intense takedown you can always climb onto his shoulders and drive a sword through his skull.It's worth trying to approach from riskier angles, too, because the grislier kills offer more reward. With each kill, a section of your stealth kill meter lights up, and filling it once per level gives you access to a new ability, like a fighting move that slams enemies against the wall, robbing the average grunt of most of his health, or Ninja Vision, which allows you to zoom in and get a better view of proceedings. To add more incentive to replay, K2 also offers several guard layouts for each mission, and lets you pick between fellow ninjas Rikimaru and Ayame (and the good doctor Tesshu, once you've unlocked him), each of whom has their own stealth kills and individual mannerisms.But while stealth kills are entertaining and exhilarating enough to begin with, they are also very easy to do - so much so that before long the only real challenge is picking your moment and then surviving the quirks of design that rush to try and thwart your plans. Worst of these is the camera, which is supposed to be clever and dynamically react to show you what you want to see in a given situation - looking straight down when you reach the edge of a rooftop, for example - but instead virtually refuses to point in sensible directions, particularly when you're sidling or creeping around. It feels like you're wearing a neck brace, and it makes you wonder if the camera's designers had any idea how their creation would be put to use.Equally frustrating are the regular bottomless pits, often placed in utterly stupid positions and guaranteed to send you back to the beginning of the level, whether or not you have a Ninja Rebirth item equipped. One section on the third level is so deliberately moronic that it's guaranteed to kill you at least once. Faced with an upward incline and an enemy just beyond it, the camera rears up to try and give you the best view. Once you've figured out his movement pattern, you rush forward at the opportune moment, preparing to cut the face out from behind his scowl, only to realise a fraction of a second too late that the camera has failed to keep you abreast of developments closer to home, specifically the disappearance of the ground from beneath your feet... Oops. Best use the grappling hook next time.On the other hand, perhaps it's a good thing that you keep dying unfairly and can't see what's going on, because dodging design issues is far more challenging than dodging the guards. When they spot you, they whistle for reinforcements (which generally don't turn up), carry out a half-hearted search (sometimes climbing up onto low rooftops), and then return to their patrol routes. On the whole, all they do is patrol and get killed. Their stupidity is probably meant to balance out the game a bit, so that single guards don't become insurmountable obstacles, but there has to be a better way of doing that than lining up all these goldfish-brained morons.A bit of variety might do it, but although K2 has implemented all manner of different items to keep you plugging away, very few of them play an active role. Things like rice balls can be used to distract enemies, while crimson blades can be used to kill dogs that might bark and alert enemies to your presence, but none of them is really necessary to make progress, and few if any give you a sense of satisfaction more than once. Sometimes it's nice to have options to explore on subsequent replays, but that's about all these serve to do - stave off boredom for another few minutes.With the single-player game out of the way (and despite the presence three campaigns and multiple guard layouts, that still won't take overly long), the idea is that the new two-player online modes will take over and keep you playing. In practice, though, we don't reckon they will. You have to finish the single-player mode to unlock some of the levels, the amount of lag is quite unusual for a Live game - over half a second on a pair of very nippy connections - and in any case actually finding someone to play with is a mission all of its own.When you do find someone, there are a handful of co-operative missions and a Vs. mode to explore, but while the co-op missions allow you and a friend to execute impressive double-team stealth kills, they also suffer from the same flaws as the single-player game, ironically intensified thanks to the needs of two players. ~Shall we take him?~ this reviewer mumbled to some drawling yank pretending to be Ayame. ~Wait a second, I can't see where he's gone!~ came the reply. Rinse the blood off and repeat. That's annoying enough, of course, but you can actually fail entire missions just by failing to remain hidden, which is doubly frustrating.Elsewhere the Versus mode, which lets you pick from characters and bosses and duke it out, is an immensely tedious and unfulfilling experience, much like the combat in general. You can give up fighting each other and just tackle the guards, but stealth kills have been turned off, which isn't the end of the world but doesn't exactly provoke enthusiasm.Tenchu isn't a particularly complex beast, and it doesn't take long to get the most out of it, so it's a nice alternative if you're bored of creeping around gloriously detailed locations pretending to fight terrorism. On the other hand, only a few shiny surfaces and high-poly models stand between this and the visual mediocrity of most PS2 titles, and despite the addition of a few less-than-interesting filler cut-scenes, some new combat moves and a couple of extra levels, the only thing that jumps up and screams 'new feature' is the online multiplayer mode, which fails to deliver. In the end it's just as ropey as it used to be, and the addition of Xbox Live options and a few tweaks isn't enough to lift it above a growing number of similar titles. Consign it to darkness."}