{"ref": "https://www.eurogamer.net/r-forbiddensiren-ps2", "date": "24 Mar 2004", "game_name": "Forbidden Siren", "text": "What is it about the Japanese's sense of the macabre? Did Shinji Mikami lay awake at night dreaming of zombies after playing Alone In The Dark? Did he long to hear the ~gnurrrrrrrgh~ death rattles of 1,000 tortured undead souls, and the soft squelching sound of putrefying flesh rousing itself into twisted irrational battle one last time?It's funny to think that (undead) moment in French gaming history would prove to be a watershed moment. Since that inspired moment of plagiarism in 1996, we've experienced ever more fascinating insights into the terror-stricken Japanese psyche: Silent Hill, (Project) Zero, Dino Crisis and now the latest product of an unhinged mind: Forbidden Siren. Conceived by Keiichiro Toyama, director of Silent Hill while he was at Konami, this Sony first party offering in many ways is the most deliriously off the wall yet.Based around the events of a small rural town three days after an earthquake, we follow the fortunes of 10 survivors fighting for their lives, and unravelling the mystery of why this tragic natural disaster has somehow awoken the souls of the undead. Siren deliberately nurtures a sense of bleak disorientating confusion by making the sights and sounds as terrifying as possible, then structuring the narrative around this 72 hour period and telling the interlinking story from ten different perspectives, switching to another character after each scenario has been completed. Confused? You will be.Getting to grips with the various strands of the narrative, though, isn't likely to happen until you've devoted a huge chunk of your time not only playing it, but also pouring over all the various clues you pick up along the way. For a long time it can seem a little bewildering to figure out, but luckily the game is self-contained enough to allow anyone to immediately enjoy the feeling of panic as you escape the clutches of the roaming Shibito (literally translates as 'Dead Person'). Right from the word go you're thrown into one test of full-on survival after another, often with nothing more than your bare hands and wits to help avoid an untimely death.Apart from this well-conceived narrative structure, the games' other key innovation is what's called 'Sight Jacking'. Each character in the game has the ability to literally see through the eyes of their aggressors by hitting L2 and circling around the compass points on the left stick as if tuning in a radio. Enemies can then be assigned to the symbols on the pad to allow you a shortcut to where they are.It's a stunningly innovative system, and it adds to the suspense enormously to hear them excitedly groan and slaver disconcertingly in anticipation of their next meal. Just watching them puffing and panting, head darting around scanning the area and checking out whatever distraction you've placed for them, is genuinely unsettling, and it feels like victory to avoid their gaze and slip past unnoticed.Each scenario typically throws the player into (initially) unfamiliar surroundings with the task of going from point A on the map to point B. Easier said than done. Somehow the Shibito have organised themselves to the extent that they patrol key areas such as bridges and vantage points, constantly looking around to cover all conceivable bases. Worse still, they have an unerring accuracy with firearms, and as you find out to your cost repeatedly, there's just no getting away from them, no matter how dark it is, or how hidden you think you are.What makes matters even worse is the fact that your hyper-aware enemy spots you immediately whether you've got your torch on or not, and walking slowly doesn't help either. Running into their line of sight is pretty much curtains, as just two hits from a rifle or around four from a pistol will do you in, and running away usually isn't good enough unless you can find cover within about a second. Even enemies without firearms are a menace to society. Get up close with a spade wielding creature and it's much the same story - they chase you down, let out a lupine howl and alert the others to your presence. You quickly learn to run like hell from the unarmed foes and avoid all chance of being seen from the rest. While you're totally unfamiliar with the rather unwieldy control system this strikes you as a grossly unfair system, especially when you realise that these undead don't even die when shot. But stick with it, for patience is what this game's all about.Thanks to this almost vertical learning curve, most of the early scenarios feel oppressive in their difficulty and it's not helped by the fact that the game does little to tutor you through this stealthy approach to survival horror. But in an odd way, it's exactly this lack of hand-holding that lends the game a certain unnerving charm that many of the more formulaic games in this genre have gradually lost over the years. The best piece of advice anyone could ever give about Forbidden Siren is simply: watch, become proficient with Sight Jacking, take your time, and make your move. Once the penny drops, the game quickly emerges as one of the cleverest, original and most unsettling anyone has produced in this genre for years.Some of its good work, though, is undone by a horribly clunky control system that makes combat a good deal harder than it ought to be. Hand-to-hand combat is reliant on the completion of an animation cycle before you can adjust yourself, you can't block, and making contact is literally a hit and miss affair. Things improve with a pistol, but you get so little ammo it's hardly worth your while - not to mention the startling realisation that you can only knock the Shibito unconscious for all of two minutes, which is nothing when you're creeping around in the dark trying to avoid imminent death.Worst of the bunch is when you have to use the rifle, which is a total lottery thanks to its missing lock on, and an auto-zoom mode that focuses and leaves you with no more than a couple of seconds to shoot before your enemy either returns fire or charges. It certainly makes things tense, and there are none of the perspective issues of, say, Resident Evil, but it's a wholly impractical system that does literally nothing to aid you in your battle for survival. Maybe that's the point, but it certainly won't win any kudos with the less patient gamer who wants to be able to pick up and play.Another of the game's less endearing traits is the way it forces you to replay already completed scenarios later on in the game without explanation. With often more than one escape route on offer, it's possible - through no real fault of your own - to miss out on objectives that move the story on and complete the 'loop', but this isn't ever fully explained. You're left wondering why this is happening, and possibly annoyed at having to repeat yourself, but the confidence of greater familiarity of your surroundings and the controls often allows you a much easier ride to explore further and complete what you didn't the first time around. In fact, you'll wonder why you had such a hard time initially, and the game becomes a great deal more satisfying as a result of the enforced practice. Then again, it still doesn't explain why the designers felt the need to include a map that doesn't indicate your position on it, causing you no end of problems when you first dip into any given environment.In a game that persistently tests you to the extreme, it's easy to perhaps assume that we weren't enjoying it. It's true that it can be one hell of a frustrating experience while you're getting to grips with it, but once you acclimatise it's a game that does the job of scaring the crap out of you exceptionally well. Playing with the lights off, at home alone is definitely recommended for those of a masochistic bent.Part of its charm is definitely the stylish presentation that understandably borrows the grainy, foggy, oppressively weird approach of the Silent Hill series. It bears plenty of Konami's hallmarks, but rather than just give you one big environment it chops the experience up into bite-sized chunks, meaning things rarely become remotely dull. In fact, it's this tightly focused approach of challenging you with set piece after set piece that keeps things interesting at all times. Most survival horror games can end up a frustrating slog as you work out what to do with your increasing inventory and proliferation of locked doors. Siren cures this problem by making each problem self-contained and therefore much more like a scene in a movie that you have to solve.Unfortunately, the effect of the stylishly gritty visuals and the incredible attention to facial detail is undermined by some truly harrowingly bad voice acting. It seems as if Sony went to its local am-dram society and recorded the rehearsals. While the Capcom titles get away with the Japanese B-Movie hamminess, these voiceovers are quite obviously English, and not only seem totally at odds with the Japanese cast they're representing, but all hope of conveying terror and suspense is lost there and then. What a disgrace! How this got through Sony's QA system beggars belief. Oh, actually it doesn't.The rest of the audio, however, matches the quality elsewhere with brooding sound effects that effortlessly conjure a gruesome backdrop to the proceedings, and genuinely help to strike terror into your heart. If only the subtlety extended elsewhere - but you could apply that sentence to much of this deeply flawed masterpiece.As a whole, Forbidden Siren manages to display enough genuine quality and innovation to overcome its frustrating shortcomings elsewhere. For newcomers to the scene, getting into the designer's desired mindset will arguably prove too daunting, but veteran adventurers will admire the new ground that Siren breaks and its chilling atmosphere, and be able to forgive some of its basic flaws long enough to follow through with what is, at times, an immensely challenging and absorbing experience."}