{"ref": "https://www.eurogamer.net/nidhogg-2-review", "date": "15 Aug 2017", "game_name": "Nidhogg 2", "text": "The original Nidhogg was a great example of minimalist elegance. Messhof's two-player competitive fencing game shaved the one vs one fighting game to its core with only two buttons (jump and attack) and a single game mode wherein each player ran towards their goal on opposite ends of a seven-stage scrolling arena. Ludicrously simple on its surface, the depth came from a multitude of context-sensitive movesets. Based on timing, positioning and momentum, you could slide into foes, dive kick, stab, parry, disarm, deflect, and toss your sword. Barring that, there was always the option to viciously rip your opponent to pieces with your bare hands.It was a beautiful ballet of blades and brawn, distilled into a scant four maps. For some, however, it was too bare bones. Nidhogg wasn't lacking in complexity, but it was in variety and scope. Lead developer Mark Essen spent three years refining Nidhogg's systems, so it would be a shame to simply let them run their course in a single cult hit. Messhof aced the basics, but had more to offer.Enter Nidhogg 2. This sequel doesn't reinvent the wheel but it does add further depth and flavour to its predecessor's winning premise in a delightful, if inessential, way.The most noticeable change this time around is the aesthetic, eschewing the first Nidhogg's classy pixelated sprites in favour of garish multicolored monstrosities that look like stretchy  Play-Doh molds. Gone are the striking evocative 8-bit neon backdrops of old, and instead we're given excessively detailed, and often disgusting, animated environments that wouldn't feel out of place in a Ren and Stimpy episode.Initially it's a shock, and not necessarily a pleasant one. The shift from glamorous to gross is downright upsetting at a glance, but this initial impression melts away after a few rounds when you realise this garish aesthetic accentuates the game's goofy humour. The gooey, bug-eyed combatants express their horror of being slain in the sort of comically exaggerated way that made Bart Simpson guffaw at many an Itchy & Scratchy episode. These Silly Putty swordsmen (and swordswomen) exacerbate the ridiculous qualities of this gruesome sport, full of spectacular stunts and ultra violence galore. In fact, the whole point of the Nidhogg's combatants is that they wish to be consumed by a god-like snake (that's the Nidhogg!) to arrive in Valhalla. It's an amusingly anticlimactic end to each battle, when the victor is eaten, and the  beast itself has never looked more laughably indifferent.The new environments are also far more varied than that of the first Nidhogg, both aesthetically and practically. Some add new obstacles that vary the flow of combat, be it a conveyer belt of hardened lava, claustrophobic tunnel, or tall grass obscuring both players' field of view. Other times it's purely a mood setting variant. Where the first Nidhogg was all pristine medieval arenas, this sequel expands the series breadth to shimmering rainbow stages in the sky, gruesome slaughterhouses, and the suffocating wetlands of a Viking sewer system. Each arena has a vastly different vibe with a wide variety of musical scores ranging from horrifying, to enchanting, to straight up danceable. Nidhogg 2's soundtrack joins the ranks of Hotline Miami's as a surprisingly eclectic club mix. Outside of the drastic aesthetic change, Nidhogg 2's main addition is that of three new weapons. Where the first game limited players to a single variant of sword, we now have slower but bigger broadswords that swing in a wider arch, short daggers that make up for their limited range by their ability to slice at swift speeds, and bow & arrows that offer unlimited long-range attacks at the expense of being slow to load. Bows in particular really shake things up and arrows can be deflected back at to their source. In one particularly preposterous duel, I shot an arrow, had my opponent deflect it, then shot another arrow that sent the first on back to its original target. The new weapons don't drastically alter the feel of Nidhogg 2, but their subtle changes add much needed variance to the spartan jousting series.Beyond that, the other changes are minor. If you were hoping for a more robust single-player campaign, you'll be disappointed as it's merely a run through each map with an increasingly challenging AI. I sped through this solo mode in a mere 22 minutes on a first attempt (though I'd had some practice in multiplayer) and leaderboards only calculate your completion time. It's also very easy. To wit: my friend who had never played any Nidhogg before provided a stiffer challenge to me after 10 minutes of play than this AI did at any point. This ~Arcade Mode~ is a fine way to learn the game, as it only introduces new weapons gradually, but it won't provide more than a trainer's guide for beginners. The only other additions are minor ruleset variations you can implement, by altering the weapon selection, adding a timer, or disabling certain moves. Tweaking the settings to your own tastes is an appreciated option, but it's not particularly game-changing.Nidhogg 2 isn't a drastic evolution from its predecessor, but it is a better game. It's deeper and more diverse with its stage setting and armaments. This sequel was never going to feel as fresh as its predecessor, but it's a smart enough variation on a theme that I can't see myself going back to the original Nidhogg much after this. Nidhogg 2 isn't revolutionary by any stretch, but it's hard to imagine many fans of the first game being disappointed with this robust follow-up."}