{"ref": "https://www.eurogamer.net/r-dragonslair-gc", "date": "17 Mar 2004", "game_name": "Dragon's Lair 3D: Special Edition", "text": "Stepping into a darkened arcade circa 1983 was a magical experience for a wee ten year old gamer. The space age had arrived; a wall of sound, cabinets engulfed in cigarette smoke and mulleted callow youths with bad skin strutting their stuff in drainpipes, ten pence pieces the size of your FACE. A pound could go a long way when you're the king of Donkey Kong, Gorf, Mr Do and Star Wars. This crazy world of 8-bit light and noise was a frustratingly brief affair (~If only mum would buy me that ColecoVision, my life would be complete...~). And then someone had the audacity to install some kind of cartoon machine in the corner that took fifty pence pieces. But it looked like magic. How could they do graphics like that? Its name was Dragon's Lair - a tale of rescuing princesses and the hapless adventures of Dirk The Daring.After admiring the delicious attract sequence for possibly hours, although it was probably only a few seconds, I took the plunge and fed far too many coins into this strange hybrid laser disc machine, realising that was my morning's game money gone. But look at the animation. Cartoon quality graphics? This was a cartoon. 90 seconds later you died. Shit! Being 10 and broke sucks, so I ended up hanging around waiting for other people to play it.It wasn't long before the realisation hit that this 'game' was nothing of the sort, and was a basic trial and error/memory test that was designed to siphon as much cash as possible out of unsuspecting pockets. The basic capitalist principle of arcade gaming was in full evidence - wow 'em with the flashy visuals and laugh in their crying face at how quickly you can make the Dirk-turns-into-a-skeleton animation screen appear. This was evil. Pure evil. I wasn't fooled. Trudging off home on the 871 bus, I vowed to save my cash for home gaming, and after a brief, but expensive love affair with an Atari and a ColecoVision (£30 a game! In 1983!?) I ploughed my cash into Sir Clive's much loved rubber keyed machine of dreams with its surreal £5.95 cassette based games and even more weird 8-bit noises, and the rest, as they apparently say, is history.After a 21 year sleep I awoke recently to discover that technology has caught up with these cartoon visuals, and they can - in fact - render them in real time. Truth is, sometimes stranger than fiction. Well, it would be if Dragonstone Software had the technological ability to do this, but instead it has come up with a distinctly average engine that fails in its noble attempt to provide us with that videogame holy grail of 'cartoon quality' visuals.For reasons best known to the designers, Dirk has all the physical presence of a beanpole. Surely he is the thinnest game character ever conceived? Whatever the reasons for it, it makes initial forays feel somewhat odd - and odder still is his ability to completely shift his position in any direction during a jump. Rather than opt for a system of lining up your jump and heading off in that direction, you find yourself wobbling weirdly all over the place in your attempts to land correctly. It's something you can adapt to fairly easily, but it's entirely at odds with the feel of any other modern hackandslash platformer.While we're on the subject, the combat feels oddly one-dimensional from start to finish. Having to manually pull your sword out each time you use it causes all sorts of problems, and is often maddeningly unresponsive, requiring two or more presses before the prescribed jumping animation will allow you. The game at least allows you to auto-lock a target, meaning that wherever you run your target will always be in the centre of the screen, but this in itself causes headaches as many of the levels feature bottomless pits to fall into, and often merely auto-locking can inadvertently send you falling to your doom as your direction will often change as a result.Fortunately, the game has a merciful checkpoint system, which saves your progress every time you die, meaning that back tracking is never a big issue. This, however, isn't as easy as it sounds once the game ups the pace and challenges the player with a succession of tough rooms to negotiate. If it wasn't for this, it might risk being one of the most frustrating games ever, but with this feature implemented it ends up being a tough but manageable game that you can make steady progress through - if you're feeling masochistic and don't mind beating up inanimate objects when you hit the really torturous moving platform/disappearing platform sections.The game is essentially designed around a spiral staircase tower hub, with certain sections remaining off limits until you've defeated other areas and their respective bosses and picked up a new ability - such as the Dragon Wing, which allows you to glide your way around to previously unreachable platforms. Other rewards come in the form of new weapon abilities, such as the crossbow or a charged sword blast, but for the most part you won't really care too much, with some of the most uninspired enemy AI seen in a modern platformer. In the main, these drones spawn and respawn, hopping around like three legged headless chickens begging to be put out of their misery, while the irritating airborne nasties require a lock on attack - and very often some terrifyingly poor collision detection means that they pose rather more of a problem than they have any right to.So with all the various high resolution modes stripped out of the PAL versions, what you're left with is an exceptionally generic platformer shaped around quick trial and error design and limp enemies, and built around a tired looking cel-shaded engine that does little justice to the visuals of the arcade original. The gameplay is relatively faithful, but things have moved on to such an extent that some of the design issues strike you as being embarrassingly out of touch with today's efforts.The voice of Daphne, the princess you're risking your life for, remains as simultaneously amusing and irritating as ever - especially when you're on your 20th attempt of a particularly taxing memorise-'em-up section - although the sweeping orchestral score redeems the otherwise shoddy feel of this forgettable package.With the arcade original having been available on DVD for some time now, there seems little point in shelling out thirty quid for one of the more ill-conceived platformers of the 21st century. PC owners can pick up the game for less than a tenner now, but the rest of you should be reminded that although Dragon's Lair was fantastically innovative 21 years ago, it was also fantastically annoying. So what did change while I was sleeping?"}