{"ref": "https://www.eurogamer.net/r-arxfatalis-x", "date": "16 Mar 2004", "game_name": "Arx Fatalis", "text": "We've all heard of the underground music scene. Most of us have probably even run across the slightly more dodgy underground film scene. But did you know that there was an underground gaming scene? Of course, when I say underground, I literally mean underground.Anyone who used to enjoy a spot of PC gaming in the pre-Pentium era will know what I'm talking about. Ultima Underworld, Elder Scrolls: Arena and their many clones swallowed up more hours than virtually any other kind of game. People used to spend months on end wandering through the dank passageways of claustrophobic dungeons, desperately searching for decent armour, a much-needed potion, or just the bloody exit.Even though the likes of Morrowind have kept old school role-playing alive, up until Arx Fatalis was released on the PC two years ago the first-person dungeon crawler was all but dead. Surprisingly, the game turned out to be very decent and received good press - and, even more surprisingly, it's just been ported to the Xbox.The real question with a game like Arx Fatalis is not whether it's any good, but whether you'll think it's any good. Anyone truly interested in the anorak world of dungeon crawling probably already owns, or has played this game on the PC. Everyone else, however, probably won't have a clue what to make of it. But that, I suppose, is where this review comes in.Arx Fatalis begins, like so much fiction in the past, with a hero who has forgotten his identity. He lives in an underground world, the people having fled to caves after the sun died out on the surface above. He wakes up in a prison and, after breaking out with the help of a fellow inmate, is given the name Am Shaegar (which means ~one without a name~).From here on, the game revolves around a lot of exploring, fighting, casting spells and ... well... role-playing. Character customisation comes in the form of choosing a face, and then applying points to four base stats. On top of the base stats, points must also be applied to skills like stealth, magic, ranged weapons and so on. Every time you level up, you get more points to upgrade your skills. As such, you'll be able to customise your experience (slightly) to lean towards thievery, magic or combat.Xbox owners who have been broken into gaming on Halo are unlikely to find themselves engrossed in Arx Fatalis. In fact, the conventions it is based upon might even come as a System Shock... sorry, a shock to the system.At its core, the game maintains a very nice balance between Morrowind-type freedom and a more linear, structured main plot. So unlike the Elder Scrolls games, you won't find yourself wandering around doing all manner of quests for people, never bothering with the big picture. Instead, to do anything constructive, you generally have to stick with the story and progress as the game intends.Therefore, anyone who liked Morrowind's basic gameplay, but found it too overwhelming, or even too soulless, could well love the structure offered by Arx Fatalis. And because the developers limited the size of the game world, they were able to concentrate a little more on giving it character and atmosphere - but more on that in a moment.Gameplay can be broken down into two distinct camps: dungeons and towns. In the dungeons sections, you can expect to do a reasonable amount of fighting (never too much though) and overall the system used is comparable to Morrowind. You equip yourself with a weapon of your choice and the longer you hold down on the left trigger, the more damage you do upon release. You can also wear various bits of armour and other trinkets to boost your abilities. It's as simple as that.The magic system is a little more complex, but it's executed really well. As you collect 'runes' during the game, you can combine them to create various spells. In order to cast a spell, however, you must 'draw' the runes with the D-pad. It's almost like pulling off a Street Fighter special move in slow motion. This is a joy to do, and I can honestly say I've never felt more like a wizard. (Ok, except for that one time I was really drunk). It doesn't ever become much of an annoyance in combat, either, because you can pre-cast up to five spells for use later.Nonetheless, as always with games of this type, the combat system has plenty of flaws. If ever you're in trouble against a tough enemy, there's nearly always a way to wiggle your way out of it. For instance, in the large human town of Arx, I spent three hours killing every NPC who lived there - just for fun - from the blacksmith to the King himself. I was only level two at this stage (barely able to take a few hits from one of the guards) but by using a ranged weapon I could pick off characters without being hurt myself. Personally, the freedom to do this is what I love about games like Arx Fatalis, but it might just frustrate gamers who are used to more typical console offerings. This is especially true considering the game never once informed me that I couldn't progress having killed the king. (Though, obviously, I knew this to be the case anyway).When it comes down to it, Arx Fatalis plays no differently than the likes of Ultima Underworld did well over a decade ago. But there is one big difference between the two, and that's aesthetics. The underground world in which Am Shaegar roams is unlike any other on consoles. It exudes a strange atmosphere of fantasy and apocalypse - like a cross between Baldur's Gate and Fallout, if you will. This is complimented by reasonable graphics, excellent sound and a world full of detail.As you walk through the populated areas of the game, you'll hear guards coughing, frogs slipping into water, and various other haunting sound effects. You can pick up almost any small object in the game - from cups, to pillows, to vegetables - even though many of them are of no use. You must feed your character intermittently, by throwing uncooked ribs and the like on open fires; the sound of the meat crackling as it cooks is typical of the game's attention to atmosphere. You can sneak in the shadows and backstab enemies. You can steal from people by 'bumping' into them, a lovely little touch.While the game's textures and models are quite good, you'll never find yourself gaping at the visuals (at least not in admiration). Still, Arx's ambience on other levels more than makes up for this, and it's worth mentioning that the game's voice acting (there are no text conversations like Morrowind) never grates.However, despite all this, the Xbox version of Arx Fatalis suffers from three minor hiccups that could well have people casting Ignite at their consoles in anger. The first is slowdown, something that barely bugs gameplay in dungeon areas, but actually hurt my eyes in the town of Arx. The second is a similar complaint - the right stick sensitivity is set to a slightly iffy level, and it can't be changed. Finally, and probably the most frustrating of all for myself, is the crosshair. It can't be turned off. For a game that places so much emphasis on exploration, it would have been nice to be able to see the world without an 'X' obstructing the view. In short, it puts the 'cross' in crosshair.But all this doesn't mean Arx is cumbersome to play through. For the most part, it handles 'PC gaming' standards like bulging inventories and on-the-fly magic very comfortably.So, is this Art Fatalis or Arse Fatalis? That, as with most cult games, depends on your tastes. This is very enjoyable dungeon crawling indeed, but for some people there's no such thing as an enjoyable dungeon crawler. If you like Morrowind, then you should bite the bullet and give Arx Fatalis a go too. If Morrowind, fantasy and claustrophobia are not your favourite things, then there really isn't a point.Arkane Studio's effort deserves plaudits for atmosphere, character and solid gameplay. But is it the last of a dying breed? Let's hope not."}