{"ref": "https://www.eurogamer.net/sundered-review", "date": "12 Aug 2017", "game_name": "Sundered", "text": "A concept beloved of H.P. Lovecraft - one of the games industry's most enduring influences - is impossible geometry. His tales of cosmic entities meddling in human affairs are strewn with rooms, temples and cities that unnerve not (just) because they're works of palpable malevolence, but because they are inherently wrong, curving and connecting in ways the narrator struggles to follow. In one story, an attic's odd contours give rise to dreams of a repulsively angled void. In another, an unfortunate sailor is swallowed by a knot of unreal architecture. In practice, much of this proves camouflage for the author's racism - ~arabesques~ and ~Hindoo idols~ crop up frequently in descriptions of these supposedly ~alien~ artefacts. But the essential idea is a fascinating one, and it has inspired generations of artists in every medium - amongst them Thunder Lotus Games, the creators of wonderful new 2D action-platformer Sundered.A hybrid of Metroidvania exploration, Devil May Cry's gravity-defying combat and Dark Souls' grinding, Sundered is absolutely rank with Lovecraft. Its sumptuous, hand-drawn bosses are Cthulhoid paroxysms of bones, tumours and tentacles, so vast that the camera is obliged to pull all the way out to fit them on-screen. Its plot is a vaguely Randolph Carter-esque tale of bartering with occult beings for power at the risk of losing one's sanity and humanity: it casts you as Eshe, a wanderer who is drawn into the ruins of an underground civilisation by a crystalline entity known as the Shining Trapezohedron, which offers to enhance her abilities in exchange for ~shards~ obtained by slaying the abominations that roam the depths. Its backstory pays both implicit and explicit homage to Lovecraft's eldritch universe. But above all, its geometry is perilously elusive, shifting when not in view.The overall shape of each region you'll traverse is fixed, as are key landmarks like boss chambers, exits or the shrines that confer new abilities, but the intervening rooms and their contents are reshuffled when you die (whereupon you'll respawn at the world's hub sanctuary, there to spend any shards you've earned). What was once a stairway made up of dinosaur vertebrae might become a cramped chimney where you'll dance around clumps of wiry thorns and shafts of purple fire. Much of this, of course, won't strike the seasoned enthusiast as eerie. Games have always dealt in nonsensical landscapes, from Mario's moving platforms to the bizarre geology of Spelunky, and Sundered owes as much to such experiences as stories like Beyond the Wall of Sleep. But the twist of the knife is that Sundered's premise is an invitation to read all those influences through the lens of the Cthulhu mythos. The game doesn't merely seek to recreate Lovecraft's idea of an unearthly space, in other words, but suggests that all video game spaces are inherently Lovecraftian - that what lures us to them isn't their consistency and fidelity, but precisely the ways in which they don't add up.If that's a disturbing thought, Sundered's other accomplishment is the pleasing grace and savagery its layouts, animations and punishing yet scientific enemy combinations inculcate. The world might be a jumble of moving (body) parts, but each shaft, pitfall and hazard obeys a logic that is carefully tailored to the player's expanding abilities, and Eshe herself is an absolute joy to control - a flurry of cloth and limbs invested with just the right balance of responsiveness and inertia. Her basic moveset is conventional by beat 'em up standards - you can dodge-roll, combo attack, launch then juggle enemies and ground-pound - but everything flows together in an uncommonly elegant way. In particular, it's marvellous how at home you come to feel in mid-air. Boss weakpoints are generally located high up, and to linger on terra firma is to risk being swarmed, so you'll want to use tricks such as wall-kicks or aerial uppercuts (which reset your jump) to extend your hangtime. The major unlockable abilities, meanwhile, are appealingly open-ended, very much things to toy with rather than just the keys to new sections of the map. The Valkyrie cannon's recoil hurls Eshe back across the screen even as it nukes everything directly ahead - it's a tool of both destruction and evasion, providing you remember to check behind you for anything spiky. The charged four-way dash attack, similarly, is both a means of smashing through certain magical barriers and a means of getting some height. Once you've amassed an Elder shard or two, you can also have the Shining Trapezohedron corrupt unlocked abilities to apply exotic effects (a decision which has story ramifications). The grappling hook can be modified so that you leave an exploding particle in your wake, the wall-run re-jigged so that Eshe sprouts spidery appendages, fixing herself in place. On top of all that, you can equip perks for a mixture of advantages and disadvantages - a perk that restores a little of Eshe's energy shield for each enemy slain, for example, at the price of slower shield regeneration in general.These sorcerous feats would be nothing, however, without the game's florid and exacting enemy design. Waves of attackers spawn unpredictably as you roam, with larger assaults signalled by the peal of a gong. The golden rule, in the absence of a defensive block or parry, is to keep moving - swarms of cowled octopods and crackling drones will run you down on the horizontal plane, while laser snipers and fire-spitting bats apply pressure from off-screen, their beams and projectiles carving up the visible environment into short-lived windows of opportunity or safety. Cultists are a particular nuisance, not just seeding your vicinity with bursts of plasma but boxing you in with walls of writhing tendrils.The intensity approaches that of a bullet hell shooter towards the end of the game, but if Sundered's tactics are bruising, they're seldom unfair. As in the Souls games, the frustration is greatest when the game spawns a horde just before a boss encounter, either slaughtering you on the doorstep or forcing you to dip into your precious stockpile of healing elixirs - but unlike in Souls, you at least get to keep all your character progression when you die. Sundered is also very considerate when it comes to telegraphing enemy patterns, both in the form of wind-up animations and audio cues; you'll commonly pitch up against mobs of 12 or more, but it's possible to avoid each blow (or at least, enough of them to stave off death) with a bit of attention.If it's occasionally tempting to throw down the pad in despair, the game's aesthetic helps alleviate the pain of defeat. The early areas - a collection of abandoned factories lodged among jungle - are a bit murky, but they also harbour the first of the shrines, immense robed statues with light pouring from their eyes. To the west you'll find the befouled remnants of a city, its floors and buildings coated in violet flesh, shadowy tentacles flickering across elevated surfaces. To the north-east you'll find the city's polar opposite, a grand cathedral made up of ethereal golden platforms and delicate ironwork. There are also warrens of crystals that, when struck, fill with boiling blood while the Trapezohedron tells stories about an ancient clash between civilisations - the conflict that kicked away the pillars of the world, setting the game's Lovecraftian geography in motion.The great irony of Lovecraft's preoccupation with alien geometries is that he's trying to express the inexpressible, and many of the stories ultimately tail off into descriptions of undeniably monstrous but nonetheless just-about-comprehensible objects; the better ones refuse to say what they're afraid of, with characters who glimpsed the entity dying of fright. Sundered is in no way a work of horror - it's far too good at making you feel powerful, or at least balletic and brutal, to inspire real fear. But its exquisitely judged battles and glorious backdrops are more captivating for that sense of an underlying, eldritch formlessness - each layout a play of intangible algorithms, at once heavy with threat and not quite there at all."}