{"ref": "https://www.eurogamer.net/r-goldensun2-gba", "date": "5 Mar 2004", "game_name": "Golden Sun: The Lost Age", "text": "Making games is a risky business. It seems that for a title to be successful these days, it needs to fulfil one of two requirements. It must be either a) attached to a franchise, in order to lure the unsuspecting masses, or b) simply outstanding. Unfortunately, even the latter option doesn't seem to guarantee success any more, with last year's Rez and ICO being obvious examples.Yet if one genre holds more risk to publishers than any other - especially in Europe - surely it's RPGs. Because while there's probably nothing better than a good RPG, there's certainly nothing worse than a bad one.After all, what other type of game requires so many elements to come together in harmony? Music, direction, plot, graphics, combat, control scheme - if one of these falls short of the rest, it has a major impact on the game overall. You might get away with it in another game, but not in an RPG.Which is why Camelot's Golden Sun deserved all the credit it got. Released on a system that was being treated as nothing more than a SNES emulator by its makers, it not only compared favourably to 16-bit classics of its kind, it even surpassed the majority of them.How ironic it seems then, that as Golden Sun's sequel The Lost Age is released Stateside, Nintendo still await the GameCube's first original, traditional RPG. In truth, Nintendo should have commissioned Camelot to do a Cube RPG long ago because, as The Lost Age proves, they know a thing or two about the genre...Strictly speaking, Golden Sun: The Lost Age is not sequel. It doesn't add a whole lot to the first game, and it certainly doesn't change the core gameplay. Instead, as was intended by Camelot all along, it is part two of the Golden Sun story. So if you haven't played the first game, but intend to sometime, it's worth considering this review as serious spoiler material. You'll read it anyway, of course.At the end of GS, the band of adventurers you were controlling defeated the antagonists Saturos and Menardi, who had become the ‘Fusion Dragon', but failed to stop the Venus Lighthouse from being lit. Venus was the second lighthouse to be fired up and, according to legend, if all four are ignited then the world will see the return of alchemy - and with it a new age for mankind.The Lost Age picks up right where its predecessor left off, but this time around instead of controlling Isaac, Garet and company, you control Felix and his sister Jenna - whom you'd been chasing for the entire first game.A great earthquake takes place early on and, in a rather convoluted manner that involves a tidal wave and the formation of an island, Felix, Jenna, the old scholar Kraden and Sheba (who appeared towards the end of Golden Sun) find themselves on a new continent, Indra. And it's here that The Lost Age really begins.We have to admit that for a long time, this game had us a little confused. And because we now know this confusion stemmed from the beginning of the game, it needs to be explained before continuing.Unlike virtually every other traditional RPG in the past, and unlike the first game, The Lost Age is surprisingly open. In other words, once you enter the game's first town, you aren't actually given a set quest to follow. Sure, the villagers all hint at various places to visit, but there's no obvious imperative to do anything.So upon leaving the first town, Daila, we entered the nearest dungeon-like place on the map, which was just a few steps away, and expected things to be taken from there. But no. Instead, the game produced a small cut-scene involving a boy stuck on a ledge, but the only way to help him involved using psynergy that we didn't have.The weird thing is, 12 hours, a few towns, a bunch of dungeons and a lot of exploring later, we still had no real idea what we were supposed to be doing. We'd been to at least four different towns, each with different stories and troubles, and had solved dungeons and earned new psynergy - but we still didn't see the point of it all. There had been little or no mention of the main plot, with the party's only objective revolving around finding themselves a working ship. Yet nothing we did seemed to be in any way related to that objective.Now, while that might sound like a criticism (and it is to a degree), it should be noted that had we known about this almost semi-linear gameplay beforehand, we might have been more prepared for it. Instead, we spent about 15 hours unsure of our destination, stumbling upon our next ‘quest' with little idea if it was the one we needed to do or not.As it turns out, this was mainly because we turned right after the first town, instead of heading south. This meant we missed the first dungeon area, and therefore missed learning ‘Lash' psynergy, which would have cleared things up no end. Still, the fact that the game lets you do this could be seen as either refreshing or annoying, depending on your patience.That's not to say that we didn't enjoy those first 15 hours, however. Despite its lack of a guiding hand, The Lost Age's towns and dungeon areas are a definite improvement on the original's. The puzzles, in particular, are a fair bit harder and you'll need all the skills you learned from the first game to solve them.The towns sport a little more character too. Unlike in Golden Sun (where you spent the whole time chasing Saturos and Menardi), these villages generally have individual stories going on, some of which intertwine, but others - like the excellent Garoh, a town of werepeople - stand alone. Thankfully, the level of writing remains top notch - plus you can mind read from the very start this time, which makes for some amusing quotes!You know a battle system's good when playing through it for the second time is as much fun as the first. And while The Lost Age may not build on its predecessor's engine, it does offer enough new content to keep you interested.Unfortunately, because Felix and party start off at level 1 and with no djinni, the classes gained for much of the game are identical to those in Golden Sun. It is possible to find items that bestow new classes, such as Trainer or Pierrot, but for the most part you'll end up being a Defender, or Hermit, or Commander and so forth. Most of the djinni you find are new, and therefore have different battle powers to those of the first game, but the classes they bestow are dependant on element type and not name.A nice new feature is the ability to summon a combination of standby djinni of different elements. Whereas Isaac's party could only combine djinni of the same kind, Felix's can discover stone tablets that give them even more powerful summons. These are spectacular to watch - not to mind useful - and it's unlikely anything of the sort could have been achieved on the SNES. Found in caves or by collecting a series of items in side quests, these tablets are certainly worth hunting down.This kleptomaniac gameplay is probably Golden Sun's greatest homage to older RPGs, especially with regards to finding weapons and armour. It was a rare occasion that we actually needed to buy weapons in the towns, as almost every dungeon provides a new super-weapon for at least one member of the party. The Lost Age has really upped the ante on 'enchanted effects' too, with most attacks inflicting an ailment or extra magic damage on top of the physical damage.Now, we love this sort of thing, but it does make the game a little easy. In fact, the only spell that ever needed casting during standard battles was the healing type. The weapons did all the rest. The lack of an intelligent targeting system makes up for this a little - characters don't automatically move on to the next enemy if their original target is killed - but our little chaps were never in danger of getting killed outside of a boss battle.The option to battle a friend via the link cable is also good fun, though there's no real incentive to do it from the single-player point of view.You won't find a prettier game on the Game Boy Advance than The Lost Age. Aside from the technical excellence it displays, the sheer variety of landscapes, colour and obvious artistic endeavour is a joy to behold. The enemies are a mixture of old and new, but unless you've played the first game 16 times over (what... you have!?), then it's unlikely that will hamper your enjoyment of the game.In one particular area, the large full moon could be seen reflected in a pond as the party walked by. Touches like these are what make a game special. That said, most of the sprites seen in towns and dungeons are the same as in Golden Sun, just used to better effect. The overworld, too, is identical, with the same green-grey patches of land and mountain as before.Thankfully, Camelot did have the good sense to revamp a lot of the music for this outing. It's not that the music wasn't good in the first place (it was great, in fact), it's just that sound dictates atmosphere to such a degree that using the same tracks as before would have made The Lost Age feel a little stale. The new music is easily as good as the old, though, with most of it found in towns, battles and the overworld.It's also worth noting that The Lost Age allows players to transfer their original Golden Sun data over to the new game. This doesn't affect your starting stats, items or djinni, however. It only takes effect when Felix is reunited with a certain group of old friends about 3/4 of the way through the game...In summary, The Lost Age is a thoroughly enjoyable game that matches its predecessor in every way. It's true that the plot never becomes as epic as Golden Sun hinted it might, and it's also true that the game will be a little too ‘freeform' for some RPG fans, but it is basically the middle of a story - and thus plays as such.Camelot recently said they were unsure if a third game in the series would materialise, but the safe bet is that it will in some form or another. Making games like this might be a risky business - but buying them sure ain't."}