{"ref": "https://www.eurogamer.net/r-virtuatennis-n", "date": "2 Jan 2004", "game_name": "Reviews", "text": "Virtua Tennis on the Dreamcast had me convinced that tennis games had reached their evolutionary peak. They couldn't develop beyond this point. This was the pinnacle of bat-and-ball gaming. As far as I'm concerned that certainly was the series' peak, with the sequel and PlayStation 2 ports heralding a steady decline in quality, eventually making way for the arguably superior Top Spin on the Xbox. However, the original VT made a pretty successful leap to a handheld format with the Game Boy Advance port. With the N-Gage pulling off a number of fairly convincing GBA impressions with its range of launch titles, I was hard pressed to see how Sega could go wrong with this one.I'll cut to the chase. For myself, there hasn't been another game in recent memory that has completely shattered my expectations for the worse. Delving, as most would, straight into Arcade mode, I learned within one match that the N-Gage version of Virtua Tennis has barely managed to bring to the court anything that was good about VT in the first place.So what's wrong with it? Where do I start? The directional controls are unresponsive, crippling your ability to move around the court and making each and every return far more difficult than it should be. The game is also slow to the point of crawling, making every single match a dull, plodding affair that seems to last an absolute age - it even had me losing matches on purpose just so I had an excuse to do something else.Finally, your AI opponents are frustratingly talented, disproportionately so when you consider the speed and power handicaps introduced by the rubbish control response and apparent ineptitude of any player you choose. So not only is every match irritatingly over-long and almost completely lacking in action, but they're incredibly difficult to boot. While the original Virtua Tennis' success laid in its accessibility, the N-Gage version completely fails to recreate its fast-paced pick-up-and-play dynamic, instead creating a sluggish, tiresome trawl through a procession of matches against offensively talented opponents.Reeling from the disappointment of the Arcade mode, I focussed my attention on the other facet of Virtua Tennis - the World Tour. This mode lets you create your own player to enter into various tournaments to earn cash and increase your world ranking. You start by choosing your player's name, colour, left or right handedness and most importantly the player type, of which there is a range of eight with differing combinations of skill types split into power, footwork, control and stamina categories.While it sounds initially promising and almost like it could possibly overshadow the shamefully boring Arcade mode, all hope is quickly vanquished as we're banished back to the same painfully slow pacing and ridiculous AI opponents. In fact, the World Tour suffers even more than the Arcade mode because you're not simply playing against a long line of increasingly challenging players, but having to play through semi and quarter-finals before you even get a sniff of attempting to win a tournament. It's nothing more than a dull, painful chore that challenges your patience and attention span rather than your reactionary skills.It's confusing that this could go so wrong, because the basic core of the Virtua Tennis we all know and love is there. You can dive straight in and get playing within minutes, quickly picking up the gist of the game - the controls are simple to pick up with strokes and lobs bound to 5 and 7 respectively, and combined with D-pad presses these can be roughly targeted around the court. The graphics prove solid and functional but never once threaten to push the N-Gage's performance capabilities, and the audio is horrible. All of it. Wailing guitars backing the repetitive plonking of the ball and the occasional blast of white noise posing as a crowd reaction.The game is just as it's always been then, except now in a new terrifyingly dull flavour. The Bluetooth wireless multiplayer jiggery-pokery threatens to liven up the experience thanks to a levelled playing field of equally crippled participants, but the novelty of being able to wander to the kitchen for a beer between shots won't last for long.Frankly, I find it quite amazing that Sega has managed to produce a port of an established, high quality tennis game and end up making it this boring. This is a fine tennis game watered down to its absolute base elements and further ruined by irritating, unresponsive controls. It's only just rescued from being a total write-off by its multiplayer features, but there is little else to reward your putting up with the painfully slow pace of matches and the joylessly challenging AI competition that render Virtua Tennis on the N-Gage one of the dullest, most pointless games I've ever played. Steer well clear."}