{"ref": "https://www.eurogamer.net/r-xiii-x", "date": "15 Dec 2003", "game_name": "XIII", "text": "Gaming can be such a contradiction. One minute you're sporting the intense expression of immersion, caught up in a thickening plot that's spinning out of control in a breathtaking web of conspiracy, built around the solid frame of creeping stealth tension and manic action, and the next you're a foul-mouthed sea of rage with veins bulging out of your temples in throbbing sympathy as you're forced to repeat the same section for the 50th time. Welcome to XIII, a game that so easily could have been game of the year.When Tom delivered his various previews earlier this year, it wasn't especially clear how XIII was going to stitch together into a coherent whole. Like being shown a couple of unrelated scenes from a movie it's easy to make knee-jerk value judgements about what it's going to be like, when the reality is somewhat different when you play it as intended. Any initial suspicions that XIII was going to be A N Other FPS dressed up in swanky threads have been comprehensively blown out of the water by what strikes this author as one of the richest, most varied and involving games released this year. And also one of the most annoying, damn it to hell.But let's not get ahead of ourselves. The game is based on a Belgian graphic novel (popular in France!) and its premise centres around you, the mysterious central character, an amnesiac with 'XIII' tattooed on his body. Found washed up on a desolate beach in New England, it's clear that whoever you are you're a wanted man, and most people you meet want you dead. With only a key to a New York bank as a clue to your identity, it quickly becomes apparent that you're Steve Rowland, the man wanted for the assassination of the president, JFK-style. Oops.In a game so heavily reliant on narrative to give it context and structure, Dargaud - the developer - has effectively styled the game to look just like a graphic novel, right down to the cel-shaded appearance so beloved of game developers in recent years, but complemented by interspersing cartoon stills to augment the narrative. But it's the use of words and symbols to depict visualisations of the sounds that gives XIII the finishing touch, with shocked enemies appearing with an exclamation mark above their heads, or ~Nooooooo!~ as they take a bullet in the cranium (complete with a three frame close up of their death). Even explosions (~BAOOM~), the firing of your gun (~TAT-TAT-TAT-TAT~) and the sound of an approaching enemy (~tap-tap TAP~ in increasing or decreasing font size depending on how near or far they are from you) show up on the screen, and in the latter case it's a wonderful innovation that's not only cool to look at, but is genuinely useful in making you aware of imminent danger.Unlike almost every FPS we've played, XIII mixes up its gameplay styles like almost no other game of its class, with all manner of mission types including Bond-style stealth reconnaissance, unlikely escapes, chases, rescue missions, unarmed combat, hostage taking, all complemented perfectly with the usual staple diet of run and gun blasting with a finely balanced selection of weapons.In terms of control, XIII plays it by the book, sticking very much to the classic FPS configuration, with an alt function for every weapon (usually a melee attack in the absence of, for example, a zoom or a grenade). Gadgets, meanwhile, are accessed by the D-pad and give you access to the ever-useful grappling hook, the lock-pick, health packs and various other one-use only type items like bombs and so on. Aiming feels crisp and precise, with none of the heinous targeting issues present in games such as Rainbow Six 3, and everything feels natural within minutes. Frustratingly, though, XIII lacks a lean function - something we suspect would have cured almost all of the game's ills, but more of that later.The catch-all action button also allows you to interact with scenery items, usually to break things (including the necks of hostages). Talking of which, occasionally you'll find yourself bereft of weapons, and XIII not only allows you to bash chairs, ashtrays and brooms over the heads of unwary assailants (that sometimes you must incapacitate but not kill), but in the presence of gun-wielding police or guards, taking a hostage might be your only route to success, and dragging a scared-stiff body around while waving a gun in the faces of your enemies is handled exceptionally well. Turn your back on them and they'll shoot, given half the chance, but sidle along and creep backwards and they'll nervously hold fire, giving you crucial leeway in your charge to safety.Likewise, the ability to carry out stealth kills is handled with grace, neither being too twitchy or fussy in the manner of the Splinter Cells of this world. In general, enemies patrol a set area, so it's easy to predict what you can and can't get away with, and the trick is to make sure no-one else sees or hears what you're up to and try and pick them off one by one. Disposal of unconscious bodies (i.e. ones you haven't shot) is also a simple process, and adds greatly to the credibility of the game world to realise that you just can't leave your victims lying in a heap without chucking them in a handily placed cupboard first.Keeping silent and out of sight are always important factors in XIII, with the AI always keen to scream at the first opportunity. But thanks to a silenced pistol and a couple of scoped weapons, you're generally well stocked with opportunities to take them out at long range. If enemies do see something, they go through stages of awareness, and react accordingly. A sudden movement in the distance or noise might provoke some temporary curiosity (a question mark above their head) and some half-hearted investigation, while a sudden loud noise or your appearance might lead to alarm (exclamation mark) and a frantic head-turning search for the source, while a near missed shot or you appearing right in front of them provokes ~Danger~ quickly followed by the cry of ~Alert!~ to all their colleagues. But usually you've got a clear second advantage with which to fire as much lead into their head as possible.We say ~usually~, as for the vast majority of the game, XIII lets your skill take care of the drones thrown into your path, and dishes out plenty of health packs and check points to ensure a steady progress. That is, until you meet the psychic enemies of doom that seem determined to make you want to hate the game and everyone connected with it. You'll probably curse anyone within earshot, curse the joypad for making you die, and curse the fact that a significant part of your evening is being sucked away by game design so hateful that it should come with a health warning attached. Case in point is the dreadfully designed Canyon section that places three RPG-wielding cretins in strategic vantage points. No problem there, as such, apart from the fact that if you show so much as one pixel to them, they rain explosive death down upon you. Now, even that wouldn't be a problem if you could run away quickly enough, but the rocky terrain is such that you'll regularly get snagged on the scenery, meaning a trek back to the checkpoint.So on and on, attempting to pick them off with the sniper rifle, but with the absence of a lean key you're forced to inch bit by bit until their head is within sight, but of course - ~Blam!~ - the second you inch out from behind your cover, another RPG is loosed off and you're left scuttling back. In the end, it came down to luck. Each of the three have five RPGs, and once they've been fired they're left firing a largely useless gun back, but this section alone gobbled up a good hour and a half on its own, and probably 50 attempts. All this after seven hours of good solid progress. Not amused.And then a few hours later comes The Boss From Hell after a level with odds so stacked against you that you'll arrive pretty roughed up anyway. Not only does this 'boss' utterly cheat, with an almost 100 per cent accuracy, and a rushing attack that makes it practically impossible to avoid, but the level is designed so that you can't safely shoot him unless you're close to him. In the end we probably cheated as much as him, taking refuge in a building that, for some inexplicable reason, he doesn't/can't enter, and diving out taking a few per cent off his health and repeating ad-nausea. Even the lone GameFAQs guide couldn't offer any help. We suspect they played the PC version with its unerring mouse accuracy and cheating quicksave mechanic. Gits.These two gameplay spikes, the occasional unsympathetically placed checkpoint save, and the rigid sense of linearity throughout depressingly sullies what is at times a fantastic package with such attention to narrative detail, it ranks among the finest gaming stories ever told, with an atmosphere that is truly breathtaking at times. Not only is the story told with unusual conviction, it's splendidly voice acted (by Adam West, of 60s Batman-fame, no less) and illustrated with true graphic novel style, and it's one of the few FPSs I can recall that bothers to provide a whole pile of extras that all add to the back story and help solve the mystery of the twenty conspirators and XIII's role among them.Poking around in otherwise useless locations not only unearths the inevitable health packs and extra ammo, but the occasional document as well, which when you exit to the front end results in a page where you can access a whole series of scraps of evidence, financial transactions and the like which, while not crucial to the game, add the final layer of polish and effort that helps make it an even more satisfying experience. In a genre where narrative is usually limited to unbearably lame cut-scenes, voiced by amateurs and bolted on after the event, it's very clear that Dargaud has in fact written the story first and then built the game and its environments around that, and it makes for a massively refreshing change. If this is a pointer of the future of videogames, then I, for one am excited at the possibilities.Another area well worth praising is the audio, which with its dramatic jazz-tinged spy-mystery feel ebbs and flows with the action. But whether it's a relentless series of manic drum fills or a panic inducing throb of shady keyboard stabs as you lurk in the darkness, it's a carefully considered and well executed backdrop to the action and among the best scores ever to accompany a game. The voiceovers, as previously mentioned are also top class, even down to the random conversations you regularly eavesdrop on.Although we've touched on the visuals already, they're far more than cel-shaded gimmickry. You'd have trouble placing the Unreal II source in a game with a style all of its own. And whether it's depicting an island military base or the innards of a submarine there's always something surprising and unique to discover as you battle your way to the truth. The moment you arrive on the edge of a cliff to witness the lapping waves and beautiful sunset is one of many such outstanding moments when you appreciate the visual tourism on display. The characters, as well, are exquisitely designed, full of cartoon expression and a unique presence that allows you to forgive the even their exaggerated leaps as they engage you in combat. There's room for improvement, sure, but the novelty value makes it all feel so much more fun, which is, after all, the point. A times you feel like cel-shading has been used to allow the team to get away with the apparent lack of texturing, but you really won't care. That's not why we're here.Although it's clearly a side portion to the main dish, the addition of online multiplayer to the Xbox and PS2 versions (two-player split-screen for PS2, four for Xbox and Cube), comes as a welcome addition with the standard Deathmatch, Team Deathmatch, capture the flag, and format-specific modes. The PS2 version ships with The Hunt and Power Up, but only four-player online support versus the Xbox's eight, while the Xbox version comes with Sabotage mode exclusively. Wha?Sabotage mode is a simple defend/attack the checkpoints affair that has you blowing up or defending the points, while the PS2-only Power Up is a comedy take on Deathmatch, with 'amusing' power ups such as the SuperGnome that deforms the player for a limited period, and The Hunt has players legging it after a running target across a map, with the idea to inflict the most damage you can. All good, albeit non-essential stuff, and with 14 or so maps there's enough to keep you going for some time, although we'd be surprised if the Xbox version didn't offer maps for download at a later date even though it's not a feature listed on the box.In truth XIII is a flawed masterpiece. A game brimming with variety and a freshness lacking from most of the factory farmed franchise exercises that pass through our offices with crushing regularity. The visual style and narrative will admittedly have a select appeal, and some of you might come away underwhelmed from initial impressions, but my advice is stick with it, because it's one of those games that becomes more endearing the deeper you delve into it. Having played literally hundreds of games this year, and devoted an unhealthy number of hours to XIII already (18 and counting) I've come away with a warm glow that Ubisoft has tried to conjure something a little different and has for the large part succeeded. With some minor tweaking this would have been hailed as a classic, but instead it nestles in that frustrating 'nearly' category."}