{"ref": "https://www.eurogamer.net/r-crashnitrokart-ps2", "date": "9 Dec 2003", "game_name": "Crash Nitro Kart", "text": "Everyone loves Crash. Vivendi-Universal could release turd in a Marsupial-shaped box and it'd be giving EA a run for its money, such are the puzzling buying trends of our nation's gamers. Naughty Dog (the original developer) must be more than a little annoyed to see Travellers' Tales pale facsimile The Wrath Of Cortex continue to outsell its far superior Jak franchise (WOC's 350K vs Jak's 200K), and it's an equally surprising to learn that the critically ignored Crash Team Racing is easily the best selling Karting game of the last two generations of consoles in the UK (CTR's 330K vs MK64's 280K). On that basis, expect sales of the multi-format Crash Nitro Kart to massively surpass the noisily awaited Mario Kart: Double Dash!!, stuck sadly on the fast-fading Cube. If ever there was an argument for Ninty to go multi-format, Sega style, it's to combat statistical anomalies like this.On the other hand, aside from the fact that CTR was an innovation-free, generic franchise cash-in on a popular genre that was ripe for the pillaging, it was actually a damned good take on Nintendo's idea, and a follow-up isn't as tedious an idea as the more cynical among you would expect. Sure, commercially it's a no-brainer with the Xbox and PS2 both bereft of a decent karting game, but it's far more entertaining than it probably has any right to be.You hardly need reminding what's in store - it's a 12-track karting game (with an extra six unlockable). First past the post, seven opponents, 15 power ups with two variations of strength, boost pads, apple filled crates, short cuts... Anyone who has played a karting game will immediately know the drill, and CNK does little to complicate matters by straying from the successful formula.The game offers a similarly familiar array of modes including the ubiquitous Time Attack, two flavours of Time Trial (lap and race), Quick Race, Team Race and of course the ever-popular Cup Tournament. For multiplayer thrills the latter is where it's at, with the opportunity to race any of the four cups in a three track series for up to four players split-screen. The multiplayer-only Battle Mode also makes a welcome return in five Deathmatch/CTF variations for some arena-based match-ups; none of them will excite with their stunning array of new ideas, but all recycle a bunch of tried and trusted gameplay ideas to good effect.Frivolous games such as this are always at their best in a four pad party-style duke out and CNK doesn't disappoint with a series of fiendish tracks that will have even karting veterans cursing at their evil ways. However much you feel like CNK should be so passé, in the presence of a bunch of competitive mates it's one of those games that quickly becomes a throwaway household favourite - especially for PS2 and Xbox owners not prepared to go out and buy a Cube just for the sake of Double Dash. You wouldn't exactly rate it among your favourite games, but for quick mindless fun it's an obvious choice.But even in the relative sanity of the single player Adventure mode, there's enough variation and longevity to provide enough gameplay to keep you going for far longer than initial impressions hint. Basic progression comes from merely beating each of the five world's three tracks (as either Crash's team or Cortex's team) and racing a one on one with its 'boss', but there's a whole slew of optional extras that help flesh out what would've otherwise been quite a simple and empty challenge.The Relic Race, for example, is an excellent variation on the standard racing fare, putting you alone on a familiar track, with an insanely fast time to beat and a collection of time freezing crates which stop the game's clock for up to three seconds. The devilishly challenging Crystal Arenas, again, pit you against the clock, but task you with collecting all of the crystals before the time runs out - a mode that will have you filling up your swear box in no time. Elsewhere, there's also the CNK challenges, which augment a standard race with the need to find the three letters scattered somewhere in the obscure reaches of the track, while the Gem cups are special races against computer opponents only accessible once you've beaten a set number of other races. In terms of longevity, it's not a game that could be accused of lacking, and most races beyond the couple of worlds will take plenty of practice to finally crack.After a fairly gentle introduction, the tracks quickly become a sinister array of right-angled bends, loop the loop tubes, huge jumps and deadly hazards. If you're not being eaten by giant Dune worms, you're avoiding vast spinning vent fan blades, or simply the seemingly endless procession of power-ups being fired at you with gay abandon. Needless to say, you get your chance to fire back if you can pick up the numerous crates lying around, and thanks to the team mechanic you can call on the help of your buddies every so often to grab a power up even when there aren't any to hand.While you're busy hurtling around the track, your Team power up meter slowly charges up, and once it's full you can unleash a Team Frenzy, which is basically an unlimited number of power ups until the meter is empty once more. It certainly comes in useful although it seems a bit petty to be told off for whacking a team-mate when you're about to claim first place. Surely winning is everything? Meanwhile, power ups themselves can even be powered up if you happen to collect 10 apples and get 'Juiced', which also has the effect of making your character go faster.Needless to say, speed will ultimately win you races, and CNK provides a multitude of ways to boost, including the ubiquitous boost pad, jumping boosts, power slide boosts as well as turbo canisters and other stationary boosts. It's not a game you can get away with ambling along, and unlike MKDD is far more unforgiving in terms of its AI. If you lose in CNK, it's simply because you were not fast enough, and there's no cheating elasticity with AI allowing you to catch up or sticking to your tail when you're doing spectacularly well. It's a fairer system on the whole, and while it can be frustrating to realise you've got no hope of winning once you're way off the pace, it's ultimately more satisfying.Visually CNK stays in exactly the cutesy ballpark you'd expect from the day-glo series, neither straying in any way from the generic cartoon worlds of old nor providing any graphical trickery that surprises hardened gamers looking for a splash of eye candy with their cartoon frippery. In most senses it's about as generically 'computer game world' looking as it could possibly be with every check box marked. Boring to veterans this might be, but it still looks fantastic in comparison to the comparatively chunky CTR, with crisp character models and bright, pleasant tracks all fired at you at a steady but not fault-free frame rate, even in four-player split-screen mode. It's not one of those games you look to for technical benchmarks, but Vicarious Visions has set a reasonable standard that will leave no one complaining about a lacklustre effort.All told, CNK is one of those easy to produce games that Vivendi must be delighted to have on its roster. It'll sell for years for its beautiful simplicity, addictive, formulaic gameplay and easy on the eye brand recognition, especially when it goes down in price. At full price it's hard to justify a purchase in our view as it's simply not all that essential or different from anything that's gone before, but if you ever fancy a quality party game that you can slip out when the time is right for some multiplayer action and see this game knocking around for a more realistic price then you won't be disappointed. With online multiplayer action this could have been essential, but as it is CNK qualifies for being a solid, unrepentantly generic karting title that will sate anyone hungering for some mindless fun."}