{"ref": "https://www.eurogamer.net/r-crouchingtiger-ps2", "date": "5 Dec 2003", "game_name": "Crouching Tiger, Hidden Dragon", "text": "Style. Elegance. Beauty. These are words that embody Ang Lee's masterpiece, Crouching Tiger Hidden Dragon. Imagine a game that captures those infamous tree-top skirmishes; the gravity defying melees that traversed walls and launched combatants into thin air; the enormous leaps across rooftops; the balletic swordplay. Just imagine it...Now grip onto that thought with all your might because Ubisoft's videogame translation of one of the most successful martial arts films of all time manages to capture precisely none of this, and depicts the events in the film with all the style and grace of Johnny Vegas ice skating with bowling balls tied around his ankles. Drunk.Surely you saw it coming? It's close to Christmas, high time for another tragic abortion of a film license, parading around as a pale imitation of its source material. To be honest, I'm not even sure if developer Genki has even seen the film.The title's story is loosely based on that of the film, but follows the three main characters - Jen, Shu Lien and Li Mu Bai - on their own separate paths through the plot as opposed to concentrating on a single character. The game begins with Jen under your guidance, who steals Mu Bai's Green Destiny sword, which was entrusted to Shu Lien. Mu Bai discovers that Jen is training with the notorious Jade Fox, responsible for the death of his master and Shu Lien's fiancé. The three characters' paths cross at numerous points during their time in the game.Playing through as one character and restarting the story as another initially seems a nice touch, but when the game is so mind-numbingly repetitive the distinction between each character's part of the game is disappointingly vague, with character models the only major difference. Each time round you'll be set upon by crowds of sword and spear-wielding thugs, all of whom have to be despatched before the doors to the next section open - where you'll take on an identical band of sword and spear-wielding goons. The story is tacked onto the front and back of each character's chapters with some scrolling text and - if you're lucky - some actual film footage. When Genki decided to take the game off in a different direction, it has employed some poorly produced CG to do the work. Compared to the film footage, it looks pathetic.So having neatly shoved the storyline under the carpet with only a few bits poking out here and there, Genki decided to focus the game on the film's incredible action sequences. If they'd put all the work in here and delivered a truly intuitive, rewarding and awe-inspiring combat experience then all would have been gladly forgiven. But it isn't. It's a horrible button-mashing extravaganza with some animation that only very occasionally resembles what you're actually doing with the joypad.The four buttons on the right of the Dual Shock pad are split into two unarmed and two armed attack buttons, and it's up to you to find some comfortable combinations of attacks with which to off the faceless nitwits who surround you and prod you with their giant pointy sticks. Evasion tactics involve hitting the jump button and dragging the analogue stick in your preferred direction, which will allow you to get on the outside of a pack and attack properly before you're quickly surrounded again.Combat feels extremely sluggish and awkward due to the game's insistence on completing character animations before any further action can be taken. Should you want to lunge at an enemy with your sword, for example, you will need to face in his exact direction and then start the animation. If he moves or you're slightly off-course (which happens more often than not thanks to the camera, but more on that later), you'll be unable to pull your character out of the two-second animation to try again, by which time your foe will have shoved his bladed pole up your arse. Collision detection is also woefully inadequate, and quite often you'll find yourself being pummelled from afar when the opponent's weapon clearly isn't anywhere near your body.Genki's attempt to innovate in this incredibly ordinary orgy of disappointing fisticuffs is the game's combo blocking system. This attempts to recreate some of the film's incredible fight scenes by allowing characters to block and avoid combo attacks by performing some remarkable feats with the sword and body. What it actually involves is stabbing L1 and bucket load of patience.For instance, I was stuck for hours when the game demanded that I pull off four successful rounds of combo blocks in order for me to progress, and so a quick glance at the manual (which is completely inaccurate in some areas, I might add) revealed the I merely needed to tap L1 in time with the flashing block icon. And tap in time I did, resulting in my abject failure over, and over, and over again. A revelation came when I finally discovered that I could ignore the flashing thing entirely, and simply lean into my enemy while tapping L1 in a rhythmic fashion; problem solved, level passed. Honestly, if you're going to implement an interesting system to pretty up the fights, at least make sure it works properly!The other vaguely interesting part of the fighting is the special moves, which can only be pulled off when you have your enemy in a grab. Once you've got hold of them, you tap in a button combination and watch your character embark on an assortment of flowery and quite painful-looking animations. Which is nice, except in reality what happens is you pause the game while your enemy is tethered to the spot and just look up the button combination in the menus, wheeling out a special move a few milliseconds after you hit pause again - a skill-free way to enjoy the flamboyant 'special' animations.Crouching Tiger also attempts to introduce an element of character development, gaining experience and subsequently levelling up through combat and the types of attacks that you use. Once an enemy is downed, experience points float through the air for you to collect, and these will boost your Attack and Defence attributes depending on how you mix up the armed and unarmed combat. Unfortunately, the building of stats doesn't seem to have much of a noticeable bearing on the way you fight.But what about the incredible acrobatics? The running along and up the walls? The hurtling through the air at terrifying altitudes? Well, believe it or not it's actually in there but naturally as clumsily and lazily implemented as possible. Holding down the dash button will have your character run at and up a wall before jumping off again about eight feet up. Wall running is slightly more exciting, but it barely comes into use. You're also able to double-jump and hold the jump button to glide to the ground, and leap up to and off of walls.Unfortunately wall-jumping doesn't work the way you would expect, with you character bounding off the wall at the angle the wall is facing - you're not given the ability to get your character to jump in a specific direction, and this has the effect of your character rebounding off the walls and towards the camera almost completely uselessly. A fair amount of trial and error and - again - patience is required before you're lucky enough to get the desired results. Prince of Persia this is not.Just when you start getting bored of all the frantic battling - and trust me, you will - the game will often head off in a more action adventure-oriented direction. Usually, these sections degenerate into teeth-grinding platform puzzles peppered with more five-man skirmishes. Skimming along ropes, precision gap-jumping and crumbling platforms all make an appearance and make short work of your stock of continues, mostly thanks to the infuriating camera and the way characters seem happier to slide along surfaces and off into the abyss than, you know, grab them.But, ah, cameras, eh? They can make or break games, but Crouching Tiger's camera further decimates an already considerably broken train wreck of a game. Occasionally the camera is an unobtrusive beast, sitting behind your character portraying the action ahead and letting you rotate it around and lift it up or down when you need a better view. This is okay. It's not okay when the camera arbitrarily removes any control from your hands and stubbornly refuses to budge from its shockingly ridiculous position. This further increases the already considerable pain of having to negotiate mountainside platforms because you can't see where the next sodding platform is. Here's a tip Genki: having to risk starting levels over and over again because you have to make blind jumps onto platforms that aren't there isn't any fun at all. Are you mad?! Did anybody test this game?And after all the jumping puzzles, - by the way, that's what your glorious tree-fighting section has been reduced to - rolling boulder sections, mindless melee combat and other lazily implemented gimmickry, the game can't even redeem itself in the visual or audio departments, looking and sounding for all the world like it could have been released alongside the movie three years ago.Crouching Tiger Hidden Dragon, alongside Terminator 3: Rise of the Machines, drags movie licensed games right back down into the sleazy underworld of quick cash-ins, with a blatant disregard for why the licence might have been a good idea in the first place. There are endless beat-'em-ups, platformers and third-person action adventures that do everything Crouching Tiger does infinitely better, and manage to make it fun while they're at it. Buy this for a loved one this Christmas and don't be surprised if they flat out refuse to return your phone calls - get them the DVD instead. For a gaming alternative that is far, far ahead in terms of playability and actual fun, get Prince of Persia. Please."}