{"ref": "https://www.eurogamer.net/r-zoe-gba", "date": "4 Dec 2003", "game_name": "ZOE: The Fist of Mars", "text": "Zone of the Enders is probably best referred to as Hideo Kojima's            other game; the giant mecha and space battles title he works on as            a snack between Metal Gear Solids. While the first game, released            on the PS2 early last year, will certainly go down in most people's            memories as ~the free game you got when you bought the MGS2 demo~,            in Japan the franchise has been somewhat more successful, with a TV            animation series based on it, a second PS2 title on the way - and            this, the GBA game known as ZoE: 2174 Testament in Japan, but            mysteriously renamed to ZoE: The Fist of Mars for its            English-language release.                         Those familiar with the PS2 title will know the basic ZoE formula;            you fly a fearsome mech with a HAL-9000 style personality problem,            blow up lots of other somewhat less fearsome mechs, save the girl            and futilely try to vanquish the bad guys, all set against an            anime-esque backdrop of epic conflict. Fist of Mars retains many of            the basic ingredients - epic conflict, check; fearsome mechs,            check; bad guys, check; anime stylings, check; girl to be saved,            check.... However, the gameplay of the PS2 game is wisely disposed            of, as it simply wouldn't work on the GBA, and replaced with a turn            based strategy which is more than slightly reminiscent of the            seminal Advance Wars.                         Early in the game, you assume control of a rag-tag band of Martian            freedom fighters, who become embroiled in all manner of political            intrigue as they battle to protect Martian civilians from the worst            excesses of the Earth-based military. Your team includes all manner            of units, from supply and repair vehicles through specialised            mecha, right up to the mighty Orbital Frames - a similar brand of            fearsome mech to Jehuty from the original ZoE. Unlike Advance Wars,            you can't manufacture units on the battlefield; if you lose one,            it's gone until the next encounter, so you have to be quite            sensible about your defensive strategies.                    The strong points of the game are certainly in its plot and            presentation. Compared to the somewhat infantile plot of Advance            Wars, Fist of Mars is practically War and Peace; filled with            interesting and amusing characters and a fair bit of twisting and            turning in the plot, it's compelling enough to keep you going            through the game despite other flaws. The incidental graphics are            superb, with well-drawn characters and vehicles, and the overall            presentation is excellent, although the colourful and distinctive            graphics of Advance Wars are certainly in a class of their own in            this field.                         Constant comparisons to Advance Wars, as you may have gathered,            are inevitable; and while Fist of Mars has a better plot and more            dialogue to keep RPG fans interested, it's not half the game            Advance Wars is in terms of sheer playability. The clever            strategies and combined arms approach of Advance Wars is nowhere to            be found, replaced with units which are all too similar in terms of            offensive and defensive abilities, and overall the game feels dull            and uninteresting compared to its illustrious rival.                         This is a terrible shame; one can't help but picture the Fist of            Mars development team crying into their sake when they first saw            Advance Wars, because were it not for the existence of that game,            this would be the best turn based strategy on the console by a            mile. However, with the impending release of Final Fantasy Tactics            on the GBA, Fist of Mars looks even less impressive; if ZoE is a            snack between MGS titles for Kojima, then this is nothing more than            a snack between excellent turn based games for the GBA. It's a must            have for ZoE fans such as myself, but its glaring flaws and total            inadequacy when stacked up against Advance Wars make it impossible            to recommend to the casual gamer."}