{"ref": "https://www.eurogamer.net/metal-gear-survive-isnt-as-awful-as-it-is-forgettable", "date": "8 Aug 2017", "game_name": "Metal Gear Survive", "text": "Metal Gear Solid has always been a self-referential series, but this is something else entirely; a Metal Gear game that feels like an unofficial rip-off of itself. Even the premise of Metal Gear Survive reads like fanfic. Set in an alternate universe, the player-created character has been sent through a wormhole, along with other Militaires Sans Frontières soldiers and the remnants of Mother Base, to a world populated by weird crystallised zombies. It all feels strangely heartless; without Hideo Kojima at the tiller, those odd moments you'd previously write off as the eccentricities or flights of fancy of one man can now feel empty, soulless and written by committee by comparison. There'll be an option to play solo, but the emphasis in Survive is squarely on co-operative play and 'survival action,' as you gather resources, craft weapons and ammo, fortify bases and fend off hordes of enemies with your squad. There are no character classes, allowing players to tailor their avatars to whatever play style they prefer, free of team role archetypes. During the most recent demo presented at this year's E3, three other players and I were put together for a co-op mission and, to save time, made to choose from four preset character builds - two long range, two melee, two male, two female. I chose a character equipped with a bow, some mortars, and moveable fences that you can set down to provide a blockade against crowds of zombies. The controls are more or less identical to The Phantom Pain and Ground Zeroes, meaning you can perform a roll, lay prone, and perform basic close quarter combat moves. Given the sizeable shift in Metal Gear Survive from stealth-based tactical gameplay to (at times) frenzied gunplay against crowds of close-quarters enemies, these controls don't always feel entirely natural - let's face it, surviving aggressive hordes is not what the Metal Gear framework was built to do. Setting up a high vantage spot and using a bow and arrows to pick off as many oblivious enemies as I could did prove satisfying, however, even if it wasn't exactly efficient. And also, a little too easy, because these zombies are thick as mud. If I hadn't had to climb down to craft more arrows, I may never have needed to move again for the entirety of the demo. The mission saw our team tasked with defending a wormhole generator from three incoming zombie hordes, each more aggressive than the last - by which I mean each wave was larger than the last, the zombies had nothing big riding on a win, as far as I could tell. The generator was situated in the middle of a ruined courtyard surrounded by ramshackle buildings and collapsed barbwire gating. I was able to plug up some gaps in the yard with my deployable fences, but there were still plenty of entryways through which zombies could rush through or pull down with enough force, so I ended up climbing to a tilted piece of destroyed highway, from which I could pick off anything shuffling towards one of the main thoroughfares to the generator. In between these three waves, markers would pop up on the map to serve as optional side quests to quickly undertake while waiting for the next event to start, typically these involved killing additional enemies to yield extra ammo or crafting resources. Following one such marker, however, led me and a teammate to two small abandoned one-man Walkers, which we immediately hopped aboard and rode back to the main mission objective before the last gaggle of zombies hit. The Walker is armed with guns that ripped right through enemies before promptly overheating, but it was much more fun to dive headlong into a crowd and kick them to death with the Walker's powerful robot legs long after the ammo for the thing had dried up. The third and final wave was the only time there needed to be any semblance of teamwork among our players, given that it had been like shooting fish in a barrel up to this point, or kicking them to death in my case. The final assault threw everything at us, including multiple exploding enemies staggering in from several different directions while swarmed with regular zombies making it harder to get a clean shot at them, so though it wasn't an especially cleverly co-ordinated attack, it was enough to at least make us feel some pressure as the zombies closed in around the generator. The Walkers were destroyed by the end, but I definitely feel like we'd have long been overrun without them. The thing about Metal Gear Survive is, despite it feeling like an unofficial mod in almost every way, it's not the awful experience I was expecting. The small dose I had was actually fun. I am very aware, though, that what translates as fun in a carefully chosen and constructed co-op demo most likely won't be as enjoyable in an extended single player campaign or in the wildlands of online multiplayer matchmaking. And I can't see how it will hold up long-term, after players have had a chance to build up an arsenal that will basically allow the base to defend itself. I suspect even Metal Gear fans will tire of it all very quickly. But the whole thing was just not as terrible as expected, is what I'm saying, though perhaps that's mostly by virtue of the work that's come before. And fun or not, there's nothing about Metal Gear Survive that warrants the Metal Gear name, save a glut of reheated Metal Gear Online assets. I wouldn't go as far as to say it discredits the Metal Gear franchise, as some are suggesting, because the whole experience is ultimately very, very forgettable. The problem is, if Metal Gear fans won't play it, as many are suggesting they won't (and there's no real reason they should with nothing linking it back to the series as a whole at present), then who will? Fans of survival games are already well catered for, as there are plenty of PC mods out there already doing what Metal Gear Survive does with, laughably, more polish. What Konami are hoping for at this point with Survive is anyone's guess, but based on what we've seen, it'll be lucky if it does beyond this potentially doomed outing."}