{"ref": "https://www.eurogamer.net/r-links2004-x", "date": "3 Dec 2003", "game_name": "Links 2004", "text": "When you think of Links games, you tend to think of lush but static backgrounds, immensely detailed physics and a control system that rewards precision above all else. Golfer's golf games, if you like. Tiger Woods, on the other hand, is best known these days for its analogue swing, preposterously unrealistic courses, forgiving controls and physics and its devotion to fun rather than authenticity. Unsurprisingly, ever since EA went down this route instead of trying to mimic Links, the series has struck something of a chord with the rest of the world - the folks to whom three clicks does not represent the swing of a golf club and bonuses for striking the pin or chipping in direct from a bunker are significant draws.So, as the developer of the world's longest running golf series, how do you respond to the peasants climbing over one another to get hold of EA's more comfortable alternative? That's easy, right? You just borrow the analogue swing idea - after all, EA's pinched enough from Links over the years - and give us a choice between click-click-swing and tug-thrust-wheee, then release it all on a console. You get both sets of fans interested and, because you're not colossally stupid, you also make it the only golf game to support multiplayer over broadband on a console. Hey presto, you've just beaten EA. If it sounds like a good idea that's because, well, it is. Or rather it would have been.But in fact despite having finely tuned its three-click system for longer than most of us have had computers (or adult teeth), the development team behind Links 2004 has apparently now given up and cut it out completely, instead preferring to surrender to EA's mass market know-how and deliver an analogue swing system - and in fact overall control scheme - that borrows heavily without giving anything back. And despite borrowing heavily, it clearly hasn't been paying close enough attention, because I'd still rather be playing Tiger Woods PGA Tour 2004.To be fair to Links though, a lot of what I'd rather be doing is down to EA's all-consuming obsession with presentation. Links 2004 has a Career mode with a simple character customisation screen (with a few new ball colours, club shafts and other items to unlock, some of which improve statistics), a series of tournaments, mini-championships and challenges (mostly to do with landing a series of balls in specific spots or completing Par 3 courses in a certain number of swings), a separate Challenge mode (with even more of these sorts of tasks), online play, a basic exhibition-style single round option and nine courses in total. A decent complement, no question, and it'll take you some time to put paid to every last hole and take your rather arbitrary world ranking up to No.1 (side note: what happened to Gotham 2-style world rankings over Xbox Live?), but then you come to consider Tiger's offering...Master Woods' 2004 outing has all that plus an expansive shop full of desirable items (with 'desirable' the operative word here), about three times the number of individual stats to upgrade, god knows how many more courses (including Tiger's ridiculous Dream 18 and various other fictional locations), real golfers and 'character' golfers (Links has neither) and one of the most engaging, balanced and consistently rewarding gameplay mechanics in any sports game.It also has trophy balls and real-time challenges that sync up in-game competitions to fit real-life (and a few fictional) events, and let's not forget that it's incredibly easy on the eye and one of the few sports games we've ever encountered which has passable, in fact, sod that, genuinely decent commentary. We never turned it off. Compare and contrast with Links 2004 and it's a bit depressing - Links has virtually no incentives or bonuses other than overall victory, all-round awful audio (including classic cut-and-paste commentary that grates your very eardrums after a while and simply must be turned off, coupled with infuriatingly non-stop clapping from spectators and one of the most badly-judged soundtracks ever) and less of a sense of fun. It's a serious person's golf game masquerading as a dumbed down console competitor for Tiger Woods. What a sorry state of affairs.On a single-player level at least, then, Tiger Woods definitely has the edge. Stuck on my own with a thirst for golf, I would pick Tiger first. But as I've moaned time and time again since I got my glove round Tiger Woods 2004, EA's decision to favour PS2 Online over Xbox Live - and, in the case of the golfing series, America over Europe - means that I simply can't pick up a pad and headset and play a few rounds with my old flatmate, or anybody else for that matter. If Tiger had debuted with Xbox Live support (and a custom soundtrack option, actually), this would be a much shorter review, mainly focusing on interesting alternatives for your £40 (remote control Mario Kart toys, for example, or obscure real ales).However, with the advent of Xbox Live, Links 2004 takes on greater significance. Although in terms of content it falls someway short of its main rival, the option to pick up a pad and lock shafts with a huge range of real people is a real selling point (and, as with most Xbox Live titles, there are a surprisingly large number of people playing it already). All the usual options are there - Optimatch, Quick Match, Download Content (none yet), etc - and the developer has even included a few multiplayer-specific game modes to complement the obvious stroke play, match play and skins options. These fast golf options don't leave you at the mercy of the other player's time-wasting, allowing you to tee off in tandem and compare scorecards instead.Thoughtfully, the developer has also placed a sort of shot clock on the standard modes, so you'll never find yourself blanked by a losing opponent who wants you to quit the match so you look bad and the result won't stand. It's also extremely smooth (which seems to be a pre-requisite for Xbox Live titles) even with a handful of players on the same server. That said though, I did suffer a couple of hard locks when hooked into somebody else's game, so it was hardly a hole-in-one experience. More like a birdie. From the bunker.Then again I did say it was mostly Tiger's depth of content and presentation that excited me. Sadly, the rest of the reason I prefer Tiger is that it feels smoother and more precise to play. Which is amazing given the fluffiness of some of the putting in Tiger, and the camera's apparent refusal to balance the game by giving everyone the same view of the ball in flight...It's not that Links' analogue swing system isn't intuitive, or that the series' long held obsession with simulation has rendered it impossible to pick up - if anything it's quite the opposite. Links is just too... easy. Even on the supposedly tougher difficultly levels it's not all that hard to mash through each hole on autopilot and still save a stroke. And that's with a severely undeveloped character with middling stats and basic kit. When you fail, it feels more like the game is punishing you - a shot goes astray off the tee, for example, when you feel sure you played the stick forward at no more of an angle than on any previous occasion, or you match the blue guiding line on the putting surface to a perfectly weighted shot and the ball still rolls short on the incline.Taken in isolation, Links 2004 is a good game. It's easy to pick up, it has some seriously challenging courses and plenty of things for the single and especially the Live-connected gamer to do. It looks great - with some of the most impressive texture detail on the Xbox (even if the character models all have peculiarly vast Baboon-sized rear ends) - and it captures the essence of the sport even if it lacks the official trimmings. However compared to Tiger Woods PGA Tour 2004, Links 2004 comes off second best. Tiger is accessible enough that you'll happily be able to find someone locally to play the game with you in front of your TV, it has enough content to keep you going for weeks - and so many little bits and pieces to unlock or uncover that you could be happily playing it when the 2005 version inevitably pitches up next October.It might seem a little harsh to spend most of the review talking about another game, but, to play Links 2004 after playing one of the previous versions, it certainly feels like Microsoft spent most of the development period talking about Tiger Woods. If you absolutely must have online golf, then you haven't really any other option than to pick up Links, and you're unlikely to find yourself too disappointed. You could even argue that it exceeds its copy and paste mandate with a more manageable camera, and there will be some who prefer its more realistic putting system. But however good a game this may be, it's still left falling off the shoulders of a true giant, and even without online play and custom soundtrack options Tiger Woods PGA Tour 2004 still hits the clubhouse well ahead of its rival."}