{"ref": "https://www.eurogamer.net/r-amped2-x", "date": "26 Nov 2003", "game_name": "Amped 2", "text": "SSX 3 is undeniably one of the best games of the year. It pushes almost every button convincingly - it has speed, it has a deceptively simple trick system which yields some truly exhausting displays of acrobatic artistry, it has intricately designed, beautiful and occasionally exotic tracks, it has EA's trademark presentation values and it has a vast number of things to do with a snowboard. But what it doesn't do is accurately portray the mother of extreme sports, give any sort of inkling as to how professional snowboarders come to exist, or demand anything more than a crude level of precision. In short, it's effortlessly stylish.Is that really a criticism? Microsoft obviously thinks so, because the centralising theme behind Amped 2 is that snowboarding is meant to be hard - you can't land sideways or you'll fall over, you can't perform more than a couple of flips or spins per jump, you can't glide along a rail or surface forever, and you can't speed away from a collision as if nothing happened. Instead of rewarding you for cramming fifteen variations on a particular flip trick into a single jump, it rewards you for steadily rotating in the air and hitting or releasing the right button at the right time. It also spits in your face and says ~nobody loves you~, forcing you to go off and perform for photographers and pander to the desires of sponsors instead of just carving your way around and expecting the plaudits to follow you.It's not enough any more to jump from a platform and smash every button in reach whilst yanking the analogue stick as hard as possible and willing the board to complete that eighth vertical rotation. Less is decidedly more. In Amped 2 you actually earn more points holding the analogue stick halfway and rotating through the air consistently. Doing so brings up a little 'style' meter which grows and grows until you land - the snag being that if you have to compensate to get back on an even keel you'll shed those hard earned bonus points.Part of the difference is also a radically altered control scheme. Instead of holding combinations of four shoulder buttons you instead get to push the right analogue stick in one of eight directions to summon a particular grab, and you can tweak the grab for more style by gently squeezing one or other (or both) of the shoulder buttons. The A button is still given over to jumping, but with no boost button and only half-speed when holding the left analogue stick forward, it's also the primary means of acceleration, so you'll spend more of the time with your thumb firmly on the A button, only releasing it while you're in the air.It's also far removed from SSX 3 visually. The seven mountain environments in Amped 2 look and feel very believable by comparison - some are even based on real mountains, like Breckenridge and Millicent - with no conveniently contoured rocks, spiralling tunnels, ludicrous cityscapes or overhead rail networks, just rows of benches, packed-snow jumps, downed trees and other realities. The draw distance is enormous, and it is a lot more like looking down a mountain than it ever was in SSX, and with no slowdown either - despite real visuals stretching far into the distance rather than unconvincing background images. In contrast to EA's rather boring mountain flybys, Amped 2's equivalents are amazing, maintaining the main view's level of detail with only a touch of jaggedness.As for the powdery slopes themselves, they're consistently well textured with less outlandish surprises than SSX, and the distribution of tasks amongst the mountains is sensible - having more than one 'run' to work on those high score totals for the mountain and for the photographers means you're far less likely to get bored of each environment, even though there are no fireworks, glass panes to smash or giant logs to catapult yourself through.Then again, this determination to be different from SSX and the extreme sports pack doesn't run the whole way through Amped 2. Take ~butters~ for instance, Amped's newfound equivalent of Tony Hawk's manuals or, more appropriately, SSX 3's ~board presses~. As with SSX 3 (and most extreme sports titles), butters are used to connect strings of tricks to tally up enormous combos, allowing you to combine a series of careful flips, grabs and rails by moving the left analogue stick quickly forwards and backwards before landing - and then by moving the stick up or down to keep balance, much as you already have to do left or right while grinding a rail.Likewise, the Career mode may be structured differently to SSX, and may lack the racing element, but it'll still fit like an old snowshoe when you get out on the mountain, with your time split between high score challenges, runs relying on particular trick types and short sharp bursts of skill - photoshoots, for example, have you trying to gather a high score within the space of a few seconds by flipping, grabbing or grinding your way coherently through a series of hoops. Then there's the snowmen challenge, which has you hunting down and crashing into eight manic-sounding snowmen. The only significant deviation here is snowskating, a vaunted but ultimately rather minor attraction in which players are given a snowboard/skateboard hybrid which has to be grabbed whenever in mid-air, can be kickflipped with the X button and invites more rail tricks. As this is not available on every mountain, however, it fails to really take hold and instead just becomes another box to check on the way to the next unlockable.Still, with good looks, variation, well-designed tracks and a trick system routed in reality with a clever risk/reward system to back it up, Amped 2 makes a good case, seemingly destined to mark out a mature niche for itself - particularly thanks to its Xbox Live element, which, as well as the usual optimatch/quick match/download content options, boasts support from Microsoft's XSN Sports system of leagues, tournaments and worldwide leaderboards. Certainly if you like Amped 2 then competing for high scores on particular runs, crisscrossing paths with up to seven opponents when SSX 3's PS2 Online equivalent manages just two to a game (if that), trying to dominate individual bits of track with big trick displays, and the sheer level of customisation available to you will count as a significant draw. The fact that lag is minimal and players are abundant just serves to reinforce that. It's a fair old challenge, too, online and off, and will probably eat away at your life for several weeks as you gradually clamber past each peak and scramble up the rankings.Ironically though, Amped 2 suffers in the long run not because of its reluctance to ape SSX 3's flamboyance, but in its failure to grasp what makes EA BIG's game so utterly playable. Although refined from the original, Amped 2 is still frustrating to play - navigating slopes is more irksome than it ever should be, recovering from a fall and building up speed takes too long (and some collision detection that wouldn't look out of place in the original SSX means you'll end up on your arse often enough to accentuate this), and although you're told that your slower and steadier tricks are more stylish, they look and feel too sluggish - like Microsoft wants to drag the ~extreme~ out of ~extreme sports~.The control scheme is another issue, with various buttons performing nothing tasks (like the shoulder and the D-pad) whereas the left analogue stick seems to be mapped to everything - acceleration, braking, turning, flipping, spinning, buttering, etc, many of which intersect - causing untold levels of hassle as you try to adjust a landing and end up accidentally buttering and splashing points all over the place just seconds later. And while we're on the subject of butters, there is nothing more frustrating than trying to connect a landing to another jump by buttering up to a bank of snow and instead mistiming and ending up on your backside with 12,500 points down the drain. EA Canada knows this, because in SSX 3 you're given four ticks of a small clock between letting go of a board press/butter and having to start your next trick to salvage a combo. That's a clever evolution of the traditional combo structure in extreme sports games which relieves the pressure. This is not.It's all the more frustrating because on many levels Amped 2 has caught up with SSX and justified its position as a more realistic snowboarding game. With the exception of an occasional, paralysingly painful announcer who seems to think you're a ~dog~, presentation is excellent with responsive and easily navigable menus, the indie/snowboarding soundtrack is vast, there's a custom soundtrack option for the rest of us, the structure and execution of much of the game is commendable and it really ought to give EA Canada something to think about. It really should.Is less really more? When it comes to snowboarding games, a lot of the folks who strap planks to their boots and zigzag down mountains will argue yes. Nothing, they will say, not even ridiculous 1080-degree diagonal flips and breakdancing in mid-air with Rahzel calling the shots, is as pure and exhilarating as grinding a series of benches without tumbling or performing a steadily rotating front flip and landing it perfectly. And perhaps they're right. Perhaps there is a more dignified glory in performing feats - given equipment, training and athletic ability - that are technically possible to replicate in real life. That's certainly the line that Microsoft has taken here.But I'm not convinced. And it's not that I'm a dunderhead reviewer who can't accept that somehow less can be more, because I'll be the first to admit that there is logic and courage in the developer's efforts to provide a more realistic and toned down alternative to EA's barnstorming SSX series. No. For me, Microsoft's biggest mistake with Amped 2 was not in shunning its chief competitor's vivacious aerial antics, but in failing to mimic its ease of control and combo structure - areas where the ~less is more~ idiom could most do with application. That SSX 3 is more entertaining than Amped 2 has far more to do with its failings in these areas than its lack of razzmatazz."}