{"ref": "https://www.eurogamer.net/r-dungeonsanddragonsheroes-x", "date": "20 Nov 2003", "game_name": "Dungeons & Dragons Heroes", "text": "When was the last time you had a good slash with someone, eh? How long has it been since you hacked up with a friend? The answer to this is probably: ~Last Saturday night actually,~ but it could also be ~God, not since... blimey, not since Baldur's Gate: Dark Alliance!~And that's a bit sad really, because co-operative hackandslash gaming is something we should never really be without. Yet despite the critical and commercial success of Dark Alliance, there hasn't been a single contender for its crown since the day it was released. The Hunter series might be fun, but it's not to everyone's taste.In fact, so bad has the drought been that were it not for the impending release of Champions of Norrath, Brotherhood of Steel and the subject of this very review, come February Dark Alliance 2 would have been its predecessor's only real competition.However, Dungeons & Dragons Heroes ensures that while the crown remains firmly on DA's head, there is competition nonetheless.Heroes is exactly what we expected. It's a straight clone of Dark Alliance and makes no orc bones about it. It brings very little to the torture table and pulls its punches like a drunken ogre. It has clearly been designed to appease fans of the Baldur's Gate game, and to this effect it might well have succeeded.The problem is that, unlike Dark Alliance, is doesn't do enough to attract the kind of gamers who otherwise might not enjoy roaming through swamps hacking up goblins. So while anyone looking for a roughly enjoyable multiplayer hackandslash might find comfort in Heroes, everyone else might as well wait for DA2 and, perhaps, Norrath.The premise is rubbish. We wish we could say it was about diseased giraffes taking over a Japanese mining corporation or something, but it's not. Instead, it's the 'tale' of four heroes who rise from the dead to defeat the evil they defeated 150 years previously.These heroes are a human warrior, a dwarven cleric, an elven sorcerer and a halfling rogue. As you'd expect, each of these characters plays quite differently, and most of the fun revolves around how you and up to three friends decide to handle them. Are you going to have your cleric hang back, heal and only do the odd bit of fighting? Or will you give him powers that lean more towards some of Heroes' deadly finishing moves? Will your wizard play it safe, or will she get her hands dirty in the thick of the action? Will your halfling get over her self-consciousness and realise size doesn't matter?A quick glance at Heroes, and you'd be forgiven for thinking it was actually Dark Alliance. The game plays from the same overhead perspective (albeit with a zoom function), the characters lay into enemies in the same fashion, the levels are littered with chests and some of the characters' powers are even the same. The graphics, while not as good as DA, could still pass as the Baldur's Gate game half of the time.The similarities aren't just skin-deep, either. Progression through missions is almost identical, with little or no real objectives other than 'infiltrate this' or 'find that'. The characters level up just like in Dark Alliance, with points awarded to buy and upgrade skills. A lot of the enemies fight and act very like their counterparts in DA. You get the picture. (And if you haven't played Dark Alliance already, then you really should consider buying that instead.) So it soon became apparent that the question here was never ~Is Heroes better than Dark Alliance?~ just ~Does it live up to it?~In many ways, it does. Yet for every aspect of DA that Heroes matches, there is another in which it lags behind.Take the game's camera, for instance. While the ability to zoom in and out of the action should be a welcome feature, we soon realised that having a fixed height would have been much easier to manage. In multiplayer outings, the game has a very frustrating habit of zooming out to the max automatically, to accommodate players fighting in different directions. This is not optional, and means the perspective needs constant management in order to stay at any height below the highest.In single-player, this isn't an issue - but you really shouldn't be playing it that way because Heroes is, after all, a game for friends to have a laugh playing together. Unfortunately though there are a few issues that dog the multiplayer side too. For example, one of the joys of Dark Alliance was trying to beat your friend to the best weapons. Personally, I still haven't forgotten my friend taunting me after getting his sneaky hands on the Onyx Sword before I did. In Heroes, this is never an issue - because characters don't share the same weapon types. It's true that the game does have a nice upgrade system (where the original 'ancestral' weapon you start with gets upgraded to a better one later in the game) but all the fun of 'loot racing' is gone. Most armour is still interchangeable, but that just isn't the same.Unfortunately, the same can be said of smashing barrels and opening chests to find potions (some restore health, others mind points, others raise you from the dead and others still produce attacks). The fun of racing to these is also somewhat depleted, mainly due to an annoying reaction delay in the engine, whereby the player who breaks the barrel can be beaten to his loot by the other player. In other words, if you hit the barrel, your friends need only step over its remains to take the reward before you've a chance to get it first.Of course, most of you probably won't mind such things. Killing stuff is where the real fun is to be had, and on this level Heroes puts up a pretty good fight. Of special note are the finishing moves that you can acquire as you grow stronger. In normal melee mode, stringing together basic A-button attacks results in a combo, but if you have a finishing move assigned to either X or Y, you can release it at the end of the combo. These tend to do a lot more damage than normal attacks and add an extra dimension to DA's standard Dungeons & Dragons special attacks, such as Bull Rush and Burning Hands. Also of note are the long-range attacks, which are available through throwing knives/hammers and so forth. Pressing B lets fly with a few of these and it makes the whole experience seem a little more arcadey than Dark Alliance.Still, while the basic engine is quite impressive and handles well, the repetitive nature of the levels and the lack of any real sense of exploration ruins any chances the game had of elevating itself above standard hackandslash affairs. The level design itself is the worst example of this - not a single level surprised us, and most of them have no real puzzles or are littered with dead ends to confuse you. Some of them are just hopelessly contrived, too, like a swamp level with about a dozen treasure chests littered around. Barrels in the basement we believed. Chests in the swamp though...Another problem is your enemies. Although there are a very creditable number of them, they're generally little more than mindless minions that rush at you and wait to be killed, or hold back slightly for ranged attacks. Unlike in DA - where defeating a horde of goblin archers might take ten attempts - Heroes never really provides any challenge aside from the sheer number of enemies that sometimes flood the screen. Your hero's level will always seem to be one step ahead of the opposition too, and with the help of raise dead amulets you're not likely to be throwing your controller at the screen too often.In short, most of Heroes' fun comes from the finishing moves, the abilities available to your character, and the relatively comfortable way it's all put together. Indicative of this is the left-trigger's function; it brings up a menu so you can assign abilities to the face buttons - cleverly slowing down the game as you do so. But, as always with this game, there's a negative side to discuss here too. Unlike Dark Alliance, only one player can access their inventory at any given time, with players placed in a queue to get their chance.Graphically, Heroes is pleasing, but never anywhere near jaw-dropping. The lovely water effects seen in DA are also present here, but otherwise the game never really impresses. This is especially true when the game is zoomed in close, with models looking slightly blocky and animation a little clunky. The game also suffers from some slowdown at points, which is strange considering it's an Xbox exclusive - and therefore should be able to handle such action with ease.The sound effects on the other hand are never annoying, with satisfying 'splurges' and 'thunks' to go with attacks and the pleasant tinkling of gold as it hits the ground (it doesn't stay there long, mind). The music is completely standard fare, even more predictable than the levels, so whoever writes all these echo-filled fantasy tracks is obviously stuck in a rut.One thing that does stand out is the CGI. Each segment is very well drawn and accompanied by voice acting that seems almost on a par with Dark Alliance's - a fine compliment indeed. These CGI movies give the game some much-needed cinematic flair, and save it from being utterly soulless on an aesthetic level.Basically, Dungeons & Dragons Heroes is Dark Alliance's little brother. Heroes looks like its older sibling, acts like him, and obviously wants to be him. Yet despite copying his brother admirably in many ways, Heroes never really matches up to him. Which is only partially acceptable, because he's had two years to catch up.If you're looking for a stopgap hackandslash between now and Dark Alliance 2 or maybe Champions of Norrath, then this is certainly worth a go. A rental, preferably. It won't frustrate you too much, but likewise it won't inspire you either. It's a straight up hackandslash that anyone with friends to play it with will probably enjoy, falling somewhere between Gauntlet's button-mashing traditions and Dark Alliance's intelligence and fun.As it stands, Dungeons and Dragons Heroes is DA's only rival, and benefits as such. Ask us again in a few months though and we probably won't give it the time of day..."}