{"ref": "https://www.eurogamer.net/r-rainbowsix3-x", "date": "13 Nov 2003", "game_name": "Tom Clancy's Rainbow Six 3", "text": "Being of silent and deadly persuasion (in more ways than one) counter terrorism games have always commanded a special place in our hearts. Sneaking around darkened warehouses/mansions/offices half crouched, disarming bombs and capping ne'er do wells between the eyes in the name of gaming justice is alright by us. Taking a realistic squad-based approach, the Rainbow Six series forces the player into a completely different mindset from the usual gung-ho look-at-me-I-can-take-500-bullets-and-heal-myself-with-this-handy-medipack approach.Behind every door, around every corner and lurking on every stairwell is another cold blooded terrorist killer waiting to kill you or one of your boys. Such abject danger instils a fear and shit-yourself tension that few other games ever manage, and the negotiation of every level feels like a genuine achievement. The more action-oriented gamer may find all this creeping around and ease of death a tad frustrating, but patience has its own reward and it's not surprising the series has earned itself a special place in the hearts of the stealthier games player. If it wasn't for those anally elaborate set-up sequences that the PC versions insist on, it may have tapped into the mainstream audience sooner, but that's where this version comes in.Nearly four years after buying Red Storm, Ubisoft has finally cottoned onto the fact that hardcore pre-planning route maps and the infinitesimally minor differences between 50 different types of firearms only matters to a tiny fraction of its audience, and the result is a stripped down Rainbow Six exclusively for the Xbox that removes the less accessible elements, apes the front end of Splinter Cell and drops you straight into the action without ever compromising the core gameplay that the PC has delivered so successfully for more than five years.Wisely, Ubi has decided to avoid doing a straight port of Raven Shield, and instead has concocted a broadly similar experience with 14 new single-player levels and an overhauled interface redesigned to take advantage of the strengths/limitations of the Xbox. Anyone familiar with previous R6 titles will know the drill; kill the tangos, rescue the hostages, defuse the bombs, get out alive. A strong narrative is still as out of reach as it has ever been, with some uninspiring cut-scenes delivering a fairly humdrum tale of some Venezuelans intent on causing trouble. Neither the box, the manual or the press releases make any reference to the story, and probably for good reason - it's even more by-the-numbers than most, so be warned.Each mission boils down to a familiar goal - stay alive and kill the bad guys - although this time you can command your squad with a degree of ease and accessibility that has been frustratingly out of reach in other console attempts. Ubi has done a marvellous job of simplifying the controls to allow players to carry out most commands with just one click thanks to the context sensitive cursor. Wherever you point, you'll be able to carry out a variety of useful commands. For example, pointing towards a door and clicking A instructs your team to 'Open and Clear', while going closer to the door dynamically changes the targeting reticule, assuming you want to perform that task.Meanwhile, if you point to a part of a room of your choice and click A, your team is sent scurrying over, each taking up intelligent cover and engaging any enemies they see. If you happen to buy the headset edition or have the Voice Communicator already via Xbox Live you can bark these orders simply by speaking the command rather than pressing the button, with the team confirming the order with a ~Roger, open and clear!~ or whatever.More complex door opening orders give you the opportunity to adapt your level of violence, depending on whether you need to keep the occupants on the other side alive or not. Holding down the A button and hitting the appropriate D-pad direction or speaking the appropriate command allows you to, for example, Open, Flash and Clear, which will result in your team tentatively opening the door, lobbing in a flash grenade, shielding their eyes from the blast and then storming the room to take out the (hopefully) blinded occupants. A further layer of strategy also allows you to issue the commands on a Zulu code (white button), allowing you, for example, to storm a room from two different entrances at the same time. If all else fails, just shout 'Go! Go! Go!' and they'll just storm ahead, probably to their doom!Barking the orders over the headset in an offline game is a truly superb experience when it works, but as with SOCOM on the PS2, the voice recognition seems to be mutton jeff half the time, resulting in much frustration as you repeat the command slowly and clearly yet again. Often repeating it in a fake German accent seems to work better than my neutral English tones, bizarrely, making you wonder what regional accents the Canadian testers had. After a few hours of it, and a sore head, going back to using the pad shortcuts was actually a far more efficient system, and certainly a whole lot more reliable, sadly.Most of the 14 single-player missions are fairly short-lived quarter of an hour affairs once you learn the layouts and the enemy placements. The real skill is learning where best to use your two save games, as the chances are that a poor decision on this front will cost you dear, either resulting in repeat failure, or worse requiring a complete restart/rethink as just a few hits are enough to kill you, and if you're dead, it's Game Over. Curiously, your team mates merely become 'incapacitated' when they run out of energy/life and you're allowed to carry on towards your goal without them - albeit at almost impossible odds. Strangely, they always make a miraculous recovery for the next mission - should you succeed. However, for some astonishingly lame reason, your save games will be wiped should you switch your Xbox off, so any mission attempt should always be approached on the basis that you'll need to get through it in one sitting.Unlike most FPSs, you won't find any medi-packs in RS3, and as a result things do get a tad frustrating, forcing you to be almost insanely careful. What doesn't help is the rather sluggish controls that rarely allow you to target anything with any degree of precision, while most weapons shake your reticule wildly, making the seemingly simple quite a task sometimes. Choosing your weapon type does make a difference here, but it's still a less than perfect feel. More often than not it's a case of creeping around a corner, zooming in by clicking the left stick and picking off any exposed enemy pixels by carefully inching your cursor over them. It's hardly the most natural or satisfying way to engage in combat, but it's the more effective we could come up with.Although the single-player campaign does get a bit samey after a while (and extremely tough at times), it's by far the best approximation of squad-based combat on a console, shading the like of Conflict: Desert Storm by a margin. But as with CDS, it suffers from a less than cutting edge graphics engine which will do little to satisfy the graphics whores among you. Allegedly using the same Unreal-based tech that powered Splinter Cell to such glorious effect last year, you'd be hard pressed to believe that claim, with some ugly blurry texturing and uninspired environments that would have embarrassed a PC five years ago. Obviously the bigger your telly, the more this becomes an issue. The character models fare slightly better, with some decent ragdoll deaths and convincing positioning animations, and a decent degree of blood splattered detail. From a distance, though, the enemies are indistinct, featureless blobs, while the incredible lighting effects used in SC are almost entirely absent, save for some nice whiteout effects when you're in a sun lit room.Some excellent effects do make it into the game, such as the incredibly convincing smoke that billows out from grenades, the door explosions and the temporary blindness/deafness that occurs when you catch the glare of a flash grenade, but overall it's a major disappointment after the heady heights demonstrated by Ubi's greatest achievements. The lack of visual/technical flair has also curtailed the gameplay ambitions to a large extent. While Ubi's Splinter Cell was littered with excellent innovations, such as the use of darkness and sound as core gameplay features, all these stealthy essentials are conspicuously absent from RS3. Add to that a rudimentary level of destruction, a lack of anything approaching decent physics and the numerous other standard features missing from the mix and you can't help but feel like it's a step backwards in many respects. Added together this lacklustre approach counts as a disappointment after all the hype and pre-release awards hysterically handed out with gay abandon.The AI also remains as frustratingly inconsistent as it's ever been in the series to date. On the one hand, the CPU AI (whether your team or enemy) displays some terrifically convincing responses, ducking and diving behind whatever cover it can find, lobbing grenades and generally doing everything you'd expect a real human player to do. But then the illusion is shattered by the sight of your team blundering into each other through a door, or an enemy bizarrely bobbing around like a freaked out jack in the box or merely remaining exactly in their spawn point, no matter what's been going on just a few feet away. And why exactly does the AI refuse to move to certain points when you command them to? It's plain annoying.The scripted nature of the game also makes it all rather predictable. There's simply no sense of the tangos living in the game level. It's merely a case of them being woken up when you're in range, rather than being part of a last stand fighting to the death. This is undoubtedly part of the game's way of always keeping things largely manageable. For example there are no more than three or four enemies to fight off at any one time, and in the light of other more ambitious game recently, RS3's single player does feel like it's been designed around an old school template in need of an overhaul.Despite this long list of niggles (and some of them are admittedly minor), fire it up online or via System Link and it's a different story. Of the five main modes, the ability to play the single-player missions co-operatively (in Terrorist Hunt or Mission mode) ranks alongside the best online gaming experiences we've had.Providing your three squaddies have any clue what they're doing, the missions take on a far more cohesive and compelling nature than merely ordering a bunch of slightly unpredictable and inconsistent bots around, which is essentially what the single-player game boils down to. Actually being able to chat to fellow players and order them around in real time is a blast, and it really helps being able to warn them of approaching evil. This is clearly the future, although the ostensibly linear nature of the game closes off certain sections of the level until you've performed certain tasks in the order it wants you to, which is a little irritating.No such issues blight the other Deathmatch-style modes; the basic all Vs all Sharp Shooter has you simply fighting it out for the most kills, while Survival and Team Survival are great if you don't mind having to wait for the next round, Counter-Strike style. Out of these, Team Survival was arguably the best of the bunch, with the environments full of excellent sniping points and crossfire locations that are already proving immensely popular if the busy servers are any indication.As with all Xbox Live games, set up is an absolute doddle, with the ubiquitous modes to let you jump straight in or create your own matches in a matter of seconds. Nine maps of varying sizes make it into the package out of the box (only two support sixteen players, though), with an extra 'Garage' map available for download if you fancy. Lag issues were noticeable on some servers, but as ever you're warned of any speed issues in advance (rated on a one to three star basis) - and only on one occasion was it ever so bad as to ruin the experience.It's a shame there's no objective-based sixteen-player modes, Enemy Territory/Wolfenstein style, but the co-operative modes for four players certainly help make up for this. Whether RS3's online modes are good enough to trump Counter-Strike is highly unlikely, but as Xbox Live gaming goes, this is one of the best around.As an all-round package, RS3 offers just about enough to warrant its price tag. The single-player is compelling and disappointing in equal measures in a seen-it-all-before-but-I'm-enjoying-it-anyway kind of fashion, but it's the multiplayer action that saves the day, offering as good a reason for signing up to Xbox Live as we've seen (especially with its two month trial voucher inside). Go and shoot some terrorists in the face and scream at your mates online. You know you want to."}