{"ref": "https://www.eurogamer.net/r-commandos3-pc", "date": "20 Oct 2003", "game_name": "Commandos 3: Destination Berlin", "text": "The house I share with our esteemed deputy editor has been home to a lot of shouting recently. Tom says Jak II is mostly to blame, although I did vent some Anglo Saxon myself when I burnt my hand cooking an omelette... But now there's a new force fuelling bad language at ferocious volumes, and that force, ladies and gents, is Commandos 3: Destination Berlin.The latest in Pyro's series of traditionally rock hard World War II strategy titles once more has the player in charge of a small team of Allied commandos battling the Nazis from behind enemy lines. At first, the game seems to work a lot like a real-time strategy title. You view your units from a camera angle high over the battlefield, as they follow the points and clicks of your plan of attack. Each of your commandos fulfils a specific role. Over the course of the game's twelve missions, you'll make use of a spy, a sapper, a thief, a sniper, a green beret and - to a disappointingly lesser extent - a diver. Some missions grant you access to the majority of your outfit's skills while others strip your squad down to a lone man, depending on the briefing. Each man has a rather endearing, cartoonish personality with a purposefully over-the-top voice, but although Commandos 3 does attempt to introduce a narrative to the series, it remains fairly uninvolving and superficial throughout. But the game's allegiance to the rules of real-time strategy wanes once you get your head round the delicacy of approaching each mission. The careful planning required, while not similar in function, is reminiscent of tactics-heavy titles like Rainbow Six, and the reliance on stealth throughout calls to mind Splinter Cell and Metal Gear Solid. The ability to spot the position of enemies with the prodding of a hot-key, and being able to see a single soldier's line of sight become the most essential tools of the game. When you start out, it all seems straightforward enough. It certainly seems a challenge, that's for sure, but the short tutorial gave me confidence that I was going to fare well against the Nazi threat - the controls certainly seemed simple enough, with a right-click selecting a man and a left telling him where to go. Other, more skill-specific functions are taken care of with a context-sensitive pointer. Oh how I laughed, then, upon finding myself utterly demoralised within five minutes of starting the first campaign. ~Eliminate the enemy sniper!~ chirps the game, before throwing you into a snow-covered Stalingrad with a sniper and a few pairs of clean pants... Three days later and the very sight of the box had me grinding my teeth, snarling about ~that bastard thing~ with a scowl that would scare small children. Yes, it is hard. It's so hard that, before long, failure meant I drove the veins on my neck outward like I was a wrestler having a coronary in the grip of a full body suplex. Commandos 3 demands so much that your efforts can seem futile. When I failed to make much of an impact whatsoever on that first sniper hunting mission, I decided that I'd try my hand at cracking the other two available campaigns. Absolutely impenetrable. While I was aware of the series' legacy for demanding the patience of a saint and an enormous amount of cunning, it was clear that I was approaching this all wrong. Back to the start I went. Instead of attempting to take the sniper head on, I decided I was going to bide my time, wait until he was busy and take short dives in and out of cover, right around the square until I could get around his line of sight and pop one in the back of his head. What I assumed would be a relatively simple plan eventually involved the slaughter of about eight German soldiers while the cat and mouse chase between the sniper and I continued apace. Eventually, as sheer luck would have it, a lapse in concentration meant the sniper ran directly into my sights as he was changing position. A single bullet and he was mine, as was the mission. It was exhilarating. Triumph coursed through me. I was The Man. And then the bombers came, sprinkling the town with explosives and demolishing it in one fell swoop; chimney stacks crumbled and staggered into one another, houses collapsed and burned, vehicles split open and erupted, and I was immediately thrust into my second mission to protect a Russian general against small waves of advancing troops. Another momentous task of a mission began. It soon became clear that each one goes a bit like this: ~Damn!~ Reload. ~Shit!~ Reload. ~For CRYING OUT LOUD!~ Reload. It sounds horrible doesn't it? But the word ~reload~ is a clue as to why the three Commandos 3 discs aren't sitting at the bottom of the wastebasket, and why I've been sat here for the past few days trying, retrying and constantly attempting to anally perfect every single intricate little detail on each of these painfully demanding missions. The game taps into the very core of that 'one more try' mentality that drives us as gamers, consuming you totally and constantly egging you to get onto that damned Nazi train before it leaves the station, over and over and over until... YES! It's a feeling of accomplishment I can't even begin to explain. It would be quite easy to give up on Commandos 3 after spending a day attempting to get anywhere, but sitting back and properly absorbing what the game is presenting to you should be one of the first skills to perfect. Purposefully vague mission briefings open up a vast number of options for the player, and sitting for a few minutes at the start of a mission pondering routes and sneaky tactics is usually essential. Analysing the patrol routes and behaviours of the ever-present and terrifyingly astute Nazi threat becomes instinctive. Even getting comfortable with each of your commando's individual talents can take many tries and retries alone. Full-frontal combat clearly isn't the ideal tactic to take, and thankfully your men are more than up to the job of slipping past or offing guards without being rumbled, as long as you're aware of their capabilities. As an example, the thief could make use of razor wire to choke unwitting soldiers, or even less subtly deal a swift blow with his fist. He could then drag the body off to a secluded spot, pinch his uniform and hand it to the hiding spy, who could get changed and quite easily waltz outside to direct the attention of lower ranking soldiers elsewhere, while the thief sneaks past undetected. The variety of small plans you can formulate to overcome seemingly trivial situations elevate the gameplay to a level of intrigue and complication I've never experienced before. Aside from the difficulty of the game itself, another element you're going to have to get to grips with is the interface. At times, the right-click, left-click, control-click combinations to perform simple functions like firing a sniper rifle can become a little overbearing - the last thing I wanted to have to do in the middle of a desperate struggle for the life of my men was to fail at the hands of the controls. No amount of memorising will help you overcome the fiddly icon-wrangling. For all the reliance on careful planning and precision execution, the game does at times feel a lot more confrontational than previous titles. A subtle addition that makes a huge amount of difference is the ability to tell your troops to cover specific areas of the map and automatically fire upon enemies that enter their line of sight, enabling you to take a man or two off at a time to set up traps and ambushes elsewhere on one of the typically huge levels. Also helping to differentiate from the previous games are the horrible, stressful timed missions. The game retains the familiar beautifully detailed isometric landscapes that were delivered in Commandos 2, but brings them up to date with the addition of some spectacular particle effects and scenery deformation techniques that produce some truly impressive sequences. The introduction of hardware-accelerated features also enhances the visual splendour, with each person in the game rendered with brilliant detail. But the most significant addition in this area is fully rotatable 3D interiors. But while this must have seemed like a great idea at the time, the transition between the essentially 2D exteriors and 3D interiors doesn't flow particularly well, forcing a sudden change in playing style as you attempt to yank the rooms into the ideal viewing position. All these lovely visuals come at a price too, and I had concerning performance hits when asking the game to conduct what I assumed to be relatively simple tasks, like rotating the exterior view ninety degrees. A brief pause would be acceptable, but a full minute or so wait for the game to catch up is not, particularly as the game itself continues while the engine updates the screen. There was more than one horrendously irritating occasion when I would rotate my view, only to hear my man get located and shot dead without being able to see what was going on. The fear of repeat occurrences became so great that I usually constrained myself to one viewing angle unless it became absolutely necessary to change. The lack of graphic options to improve performance is shoddy, too, with only high or low detail buttons to choose from - there isn't even the option to change resolutions. Commandos 3 is the first title in a long, long time to make me feel like I am crap at games. It's a hideous, nightmarish bully that steals your lunch money, flushes your head down the toilet, bloodies your knees and rubs your face in the mud. Yet despite all that, you still want to be its friend afterwards. There aren't actually many new ideas in this, the third game in the series, and at twelve missions it might even seem a bit short to the grizzled, possibly magical veterans who lap it up. But trust me when I say that it's more than enough to keep you occupied. The addition of twelve-player deathmatch is a nice touch, too, but for some reason it comes at the cost of co-operative play from previous Commandos games. Make no mistake that it is going to give you absolute hell, yet beyond the initial frustration at your apparent gaming impotence, attempting to penetrate its steely exterior becomes a bizarre pleasure that offers a triumphant sense of achievement. If you think you have the patience and what it takes to lead these men to victory, then be my guest. Give it your best shot."}