{"ref": "https://www.eurogamer.net/r-voodoovince-x", "date": "16 Oct 2003", "game_name": "Voodoo Vince", "text": "Two years on, despite Microsoft's megabucks, the Xbox still doesn't have the thing that all consoles are supposed to have: a platforming icon. Blinx, the grinning, time-shifting cat failed spectacularly to translate into a mass market Christmas hit this time last year, and Sega's re-launch of Toe Jam & Earl exclusively to the platform was another commercial flop earlier this year, despite actually being quite good. Can the Redmond giant make it third time lucky with a bulgy-eyed cloth-eared Voodoo doll called Vince, and join the exclusive icon club?As we discovered in our lengthy first impressions, Beep's first attempt is something of a pleasant surprise, combining the well worn, objective-based, collectathon, head-stomp platform template with excellent production values, warm humour and compelling gameplay. And a twist. The twist being that Vince can hurt himself yet cause pain and death to those getting in this way. Ah, of course.But why on earth are we tasked with guiding Madame Charmaine's 'third favourite Voodoo Doll' around in any case? Kosmo The Inscrutable has been trying to get his hands on Ms Charmaine's Zombie Dust for ages, and in a flurry of flying chairs, she's knocked out and captured, leaving young Vince to pick up the pieces (literally) and come to her rescue.This is where you come in, and the basic premise is platforming by numbers. Vince comes equipped with a jump, double jump, spin and head stomp move, as well as a move to slow his descent during a fall. Later you earn an All-Seeing-(X Ray)-Eye and sort of thread lasso, but that's your lot. Each level and sub level is scattered with blue vials of Zombie Dust, Zombie Pages and populated with numerous fairly generic bounding enemy types, so not much break with tradition there. Whether you choose to take any notice of these is entirely up to you, but as a reward, collecting 100 vials of Zombie Dust gains you an extra blob of health, while collecting the Pages creates a skull which you must then chase across the level and collect to gain an extra blob of Voodoo Power - effectively a smart bomb that - when fully powered up - can be unleashed on any enemy (by holding down both triggers at the same time) within range.Every game has to have its gimmick, and Voodoo Vince's is the fact that you have over thirty of these Voodoo Powers, including Running With Scissors, which results in a sharp implement becoming impaled in our hero's bulging eye, and severe pain to anyone in range. Most of the thirty of so levels in the game houses a unique Voodoo Power, and it's up to you to seek them out, as most are genuinely amusing and a decent reward for your persistence. Sadly, you have no control over which power you unleash, and unless you've literally just picked up a new power, it becomes a seemingly random process for the game to decide which of them to use next.The game itself is a charming affair from start to finish, even if it does come across as fairly predictable fare for much of the time. Divided into about six chapters, it follows a fairly linear, task-based progression system that might, say, have you visiting several levels within a hub in order to get three ingredients for a soup. Each level itself is usually pretty self-contained, with its own set of micro objectives, and set of collectibles. Should you lose all your lives (which is likely to be quite often), you're annoyingly returned to the title screen where you can then pick up from where you left off, with three more lives in the bag. Although all the monsters you may have just painstakingly killed return, all the dust and pages you've picked up are logged, slightly lessening the frustration. You have to ask, though, why didn't Beep just follow the principle employed by most platformers and just ask the player if they want to restart? It would save the hassle of reloading it, and a fair bit of frustration into the bargain.Although the game is pretty linear, you can attempt most levels with in each chapter in the order of your choosing, and you can switch back and forth between levels by utilising the tram system if you fancy cleaning up already conquered levels in return for more Voodoo Powers or health. At the end of each chapter Beep throws in the inevitable boss battle, although most won't cause you too much hassle - until near the end of the game at least, where they can get pretty testing and genuinely require a bit of thought to defeat.In the main, the regularly interspersed puzzles are barely more taxing than negotiating a series of tricky jumps and then ultimately fetching an object as a reward. Some of them, however, have you performing all sorts of craziness, such as herding onions, or sending a posse of cute furry creatures up a series of conveyor belts in order to make a sausage. Occasionally we tripped up when the game failed to provide any clue as to what to do (damn those fire flies!), but these were few and far between and making steady unfrustrating progress was the order of the day.At its best, some of the scenarios are so surreal and full of warm Southern humour that you can't help but smile all the way through. A bit of LucasArts-style lateral thinking, generally consisting of ways of hurting young Vincent, makes for an excellent template for a platform game. I mean, what other game has you herding onions around, or diving onto a pit of spikes, or setting yourself on fire in order to progress - things we've been taught to avoid throughout the history of gaming!The combat, disappointingly, isn't really a major part of the game. The spin and punch moves are pretty much useless, leaving you with the head stomp as your only non Voodoo-power option. However, with a bit of persistence, knocking the crap out of the enemies spews forth multi-coloured gems, which help boost your health as well as Voodoo Power, meaning you can quickly work your way around carrying out amusing death sequences. The problem is there's actually little point even bothering with killing most of the game's creatures, as they don't really present much of a problem to avoid - and regenerate as soon as you lose all your lives anyway.As a spectacle, Voodoo Vince is often delightful in its brilliance but other times just plain ordinary. Vince himself looks incredible, with a superb level of detail that is a joy to behold when the camera's fully zoomed in. It's a shame, then, that the majority of the enemies within the game hardly bear a second glance, being of generic platform stock and rarely providing any flicker of interest from start to finish. The level design, meanwhile, varies from the standard to the cunning, with a pleasing level of variation to each environment and decorated to the kind of standards you'd expect and demand from an Xbox exclusive. As we mentioned in the first impressions, there's an air of Day Of The Tentacle about the early part of the game, and this exaggerated Toon factor carries on throughout the game - albeit with the requisite change of scenery.The humour and quality of the voiceovers tended to remind us of that golden era too, and even the New Orleans jazz-tinged music had an air of LucasArts finest audio moments back in its early '90s heyday. Don't ask us why, it just did. Although it might not necessarily appeal to your ears, the music was a real revelation for us. Throughout the game, it's packed with enjoyable and non-repetitive ditties that perfectly suit the mood and create a good-time vibe of which many publishers would do well to take note.All round, Voodoo Vince is a classy package with plenty going for it to satisfy those with kleptomaniac/sado-masochistic leanings. If Beep had bothered to innovate just a little bit more, we might be raving about it instead of rueing another missed opportunity by Microsoft to join the platforming Hall of Fame. In its favour it's got an endearing theme, warm humour, excellent characterisation, and solid Xbox class visuals, but were it not for the fact that it has series of amusing smart bombs, you'd be left with the feeling that you'd seen all before."}