{"ref": "https://www.eurogamer.net/r-munch-gba", "date": "14 Oct 2003", "game_name": "Oddworld: Munch's Oddysee", "text": "Munch: an Amphibious Gabbit with Odditude on a quest to save Break Wind Hill with his Mudokon buddy Abe. Need we say more? Well, probably, seeing as you're doubtlessly here to find out how on earth an Xbox launch title has fared in the translation to the small screen.In case you're confused as to what the hell a Microsoft game is doing on a Nintendo platform, it's all part of the Redmond behemoth's plan to take over what's left of the world, having signed a multi-title deal with THQ to port some of its bigger titles to the GBA. So hence Munch's Oddysee is the first fruit of this alliance that also allows it to make good on all those unreleased Rare titles (more of which later this week).As anyone who has played an Oddworld game before, the story is a load of complete nonsense, albeit slightly endearing nonsense. In a nutshell, the mutated hopping frog-a-like Munch is a bulging eyed Gabbit, while the comparatively gangly, but no less slimy Abe is a hero to his Mudokon race, having saved them in a previous Oddworld adventure. In Munch's Oddysee, both have teamed up to defeat the evil Glukkons, stop the Evenwurst (groan) Weener factory and save Break Wind Hill.In the GBA version, the core co-operative gameplay of the original remains pleasingly intact, with Abe and Munch working together to make their way out of a dozen or so levels, via a series of increasingly taxing puzzles that generally involve pulling switches, collecting Spooce (green blobs, basically), zapping enemies and ordering allied creatures around, and unlocking all manner of doors along the way.Switching between characters during the game is essential beyond the early solo 'tutorial' levels. Both Abe and Munch have their own set of strengths and weaknesses, and without paying careful attention to both, you'll be stuffed pretty early on. For example, while Munch is great at accessing water-based environments, he's sluggish and vulnerable to enemy attack when on dry land. However, in his favour, he can command his cute blobby Fuzzle friends to follow him and attack enemy Glukkons in range, as well as send them into a rescue portal and increase your level of Quarma.Abe, on the other hand is pretty quick on dry land, but a hopeless swimmer, although has the cunning ability to chant and possess enemy Glukkons, allowing him to make them fight each other or send them to their doom. He can also use his chant to regrow Spooce, which helps unlock the Spoocelocks in each level, as well as help in other areas such as enemy possession and ally regeneration. Like Munch, Abe also has his own band of allies, the Mudokon Scrubs who are happy to be put to work, chanting down doors and generally attacking any undesirables in range.If your loyal mates happen to perish, you can handily regenerate them elsewhere in the level, while death to either main character can be temporary as long as you activate the Egg that subsequently spawns in a nearby nest. While it is Game Over if both characters kick the bucket, Munch's Oddysee tries to keep the emphasis firmly on the puzzles.In most senses it's an almost identical gameplay experience to the Xbox Oddysee, with the same story and even the same temporary power-ups (such as the Zap, Expresso and Health Dispenzah machines) and feels pretty faithful in terms of its learning curve and level of challenge. On the other hand, with only 13 levels and a tight-fisted password based system, you're only looking at four hours of gameplay, and very little replay incentive.And if got into the Xbox original on the back of the rather gorgeous 3D visuals, don't expect anything but the most rudimentary approach from Art Co. With an isometric simplicity, basic animation and scenery repetitiveness that most Spectrum games would've bettered, it's fair to say there is room for improvement. To be fair, it's hardly what you'd deem offensive, but you'd expect more even on a platform as limited as the GBA.Possibly the thing that damns the whole package is the fact that the later levels are a basic selection of flick screens; as if the developer didn't have the talent to create a scrolling play area. As a result of this, coupled with the repetitive scenery, you can quite easily get confused as to where you are, or at least just bored. The audio, meanwhile, snatches a few speech samples from the Xbox, but barely goes any further than burbling a few short ditties at you to keep you from turning the volume down.Even the controls feel like a let down, rarely being as responsive as you'd like, with inconsistencies allowing Abe to pick up objects one minute, and not the next, with the same complaint going for switch activation. The whole thing just feels sloppy, as if it was ported over as quickly as possible with the minimum effort required.For about an hour we were quite impressed with how the simple game concepts translated to the GBA, but the longer we played it, the more the lovelessness of this port dawned on us, especially when you consider you can now pick up the vastly superior original for probably less than half the price that THQ is demanding right now. Later levels tend to get merely more irritating rather than more enjoyable, and the many fans of the Oddworld series would have been better served with handheld versions of Abe's Oddysee and Abe's Exoddus, rather than this frankly overpriced, lame effort. A bad advert for handheld gaming."}