{"ref": "https://www.eurogamer.net/r-zoe2-ps2", "date": "13 Oct 2003", "game_name": "Zone of the Enders: The 2nd Runner", "text": "There's no doubt about it - Hideo Kojima loves giant robots. From the earliest days of his career, he's had a fascination with them - okay, admittedly he couldn't find a way to fit big stompy mechs into his high school romance dating sim, Tokimeki Memorial (although given half a chance we bet he'd have turned it into Gunparade March...), but Policenauts was full of the things, and there's a strong case for saying that the lengthy exposition of Metal Gear (in all its various incarnations) is just an excuse for throwing around some really cool robots at the end of the day.Given this, it's hard not to see Zone of the Enders as not so much a side project, but the game Kojima has always wanted to make. Giant robots battle it out among the stars in an epic space opera that combines themes of war, love and loyalty with the traditional anime-esque trappings of huge explosions, insane pseudo-science and crazy mysticism. It's a heady mixture for any Japanese child of the Gundam generation, and Kojima is exactly that. The first Zone of the Enders, however, suffered from two major problems; firstly, it was excessively repetitive, with extremely similar missions and enemies throughout, and secondly, it came bundled with a demo disc of Metal Gear Solid 2, which stole the game's thunder entirely - even if it did probably help to sell a few copies.The second serving of Zone of the Enders picks up broadly where the first left off - although this time the central character is a gruff ex-soldier called Dingo, replacing the somewhat weedy Leo Stenbuck from the first game. This time, the story is narrated using a combination of in-game cut-scenes and 2D anime video, rather than the pre-rendered 3D of the first game - a system which works extremely well, and fits the tone of the game perfectly. Following an introduction sequence that attempts to ease you into the fairly complex but powerful twin-stick navigation system, you're dropped straight into the action - sat in the cockpit of the immensely powerful Orbital Frame, Jehuty, and blowing seven shades of shit out of everything in sight.So far, so similar to the original game - but very quickly, the huge differences in pacing and variety of gameplay become evident. Like the original Zone of the Enders, the game is mostly structured in a way that sees you dealing with several waves of minor enemies before having to take on a boss, generally in the form of another powerful Orbital Frame - unlike the original ZOE, however, there are a vast array of different enemies on offer, and you have a huge selection of different ways of disposing them at your fingertips.The game calls upon you to master a variety of combat techniques, all of which result in spectacular pyrotechnics - from firing off huge charged bursts of homing lasers into swarms of low powered enemies, to deflecting enemy beams with shield power-ups, to picking up large girders and other objects from the scenery and battering your enemies into submission with them. A particularly satisfying trick is the ability to grab a damaged mech, swing it around your head and throw it with great force into the path of another oncoming enemy - usually resulting in a large explosion and a double kill.Boss encounters are another element which Second Runner has in spades, and again it doesn't skimp on the variety. Each boss has a certain trick to defeating it, and thankfully the game has achieved a perfect balance between allowing you the satisfaction of working out the trick for yourself, and having the game drop increasingly unsubtle hints about what's required from you in any given situation. As you might expect from the designers behind Metal Gear Solid, each boss is also full of personality and fantastically imaginative - imagination being something which the game as a whole has in abundance, be it in terms of the crazy plotline, the fantastic environments or the great enemy designs.Imagination is a key factor in some of the most memorable levels of the game as well - the two that stick particularly in the mind being one where Jehuty, newly armed with a stunningly powerful cannon that takes several seconds to set up and fire, takes on an entire fleet of space battleships - hopping from one to the next in the midst of withering fire, and standing on their decks to pound their engines while listening to the panicked radio broadcasts of their captains. Superb, stirring stuff - and matched (or indeed topped) a few levels later where you get involved in a massive battle between thousands of opposed enemy mechs, rushing from one end of the battlefield to the other to support your comrades and minimise losses on your side.Levels like these are an amazing experience to play through, aided by stunning graphics (the MGS2 engine being pushed to its absolute limits) and incredibly good music. Sadly the voice acting doesn't quite live up to the production values of the rest of the game, but it's not so bad as to detract seriously from it either - although in places, the dialogue is very stilted and seems to have suffered a bit in the translation from Japanese. Speaking of translations, it's worth mentioning in passing that despite the lack of a 60Hz mode in the game (that we could see), it runs at full tilt in 50hz mode and there are no borders - a completely perfect PAL conversion. Nice job, Konami!Indeed, as we said in our preview of the US version of the game back in July, there is only one key criticism to be levelled at Zone of the Enders: The Second Runner - there simply isn't enough of it. The game is packed to the gills with imagination, stunning design and addictive, hugely varied gameplay - but while it triumphs in quality, it lacks in terms of quantity. We managed to plough through the main story mode in just over five hours, and while there's plenty more to explore in terms of VR missions and a fair degree of replayability (finishing the game unlocks new modes), it's still a disappointingly short experience. However, anyone who liked the first game will absolutely love Second Runner - and for those who thought the first game had potential but found it lacking, this is definitely worth checking out, even if only as a rental. It's certainly left us gagging for a third runner - perhaps a decently long one next time, eh Kojima-san?"}