{"ref": "https://www.eurogamer.net/fi-mystreet-ps2", "date": "1 Oct 2003", "game_name": "My Street", "text": "When you're ten years-old, parties are basically the best thing ever. Or they were the way I remember them. The simple pleasures of Jelly and Ice Cream, radioactive pop, followed by a clip round the ear for breaking everything to the soundtrack of Baggy Trousers bring us over all nostalgic.A party game starring a bunch of ten year-olds, therefore, ought to rank alongside the best things ever, especially an online-enabled one. Sadly, this one's not based in the early 80s, nor is it in urban England. It is, in fact a fairly goofy West Coast suburban USA affair where every kid on the block inserts the word 'like' in every other syllable, like, totally.Should you plump for My Street's story mode, at first glance it comes across like a cutesy little adventure game, set in a day-glo world of mom's Apple Pie, where the sun always shines, the birds chirp merrily, the dogs bark along, and the neighbours always have a cheery smile for you. First off you get to create your kid, with a multitude of personal features to customise before you unleash them onto your new neighbourhood.You've just moved into a new town, and you've got one month before school starts to make friends and basically avoid being twatted by the local thugs. Wandering around the pretty confines of your street, various kids are out doing chores or generally hanging around, and it's up to you to talk to them and find out what items they require before they'll let you play their game.Once you've collected whatever they require, you trot back to engage in some progressively difficult mini-games, which normally require that you win three rounds before you 'win' them for good. In total, there are a seven such mini-games; Marbles, Volleyball, Chicken Herding, Chemistry Set, Dodge Ball, RC Racing, and Lawn Mowers. As with most party games, all of these are incredibly straightforward pick up and play multiplayer games for up to four player.For example, Marbles tasks you with turning a flow of marbles into the same colour as yours, magnetically guiding them to a goal and knocking them in while attempting to stay on the table. A bit like Monkey Fight, but fiddlier, with Yankee kid taunts and an array of power ups (such as magnet off and double score) to help give you the edge.The others are also reminiscent of past multiplayer classics: RC Racing is a simple top down Super Sprint clone, Chemistry Set is a blatant lift of Dr. Mario, Dodge Ball is a four on four smack 'em up that has you hurling a ball at one another in an attempt to knock your opponent out, Lawn Mowers has you, um, attempting to mow more grass than your opponents while avoiding the flower beds, while Volleyball and Chicken Herding are exactly as you would imagine. Cutesy, simple, fun, but will they hold your attention for more than a few hours in total?As a single player game, the answer is probably not. Party classics such as Bishi Bashi, and even the derided Fuzion Frenzy had scores of mini-games, as did the various Mario Partys. In all these cases, they generally worked, because even when played solo they provided plenty of fun even when human competition wasn't an option. Taken a step further, Super Monkey Ball 1 and 2 even had a fully-fledged standalone main game to divert you from the added bonues of the mini-games.In My Street's case, the mini-games are basically all there is to it, apart from the fairly mindless third person story mode, which essentially involves wandering around a very small suburban environment, fetching and carrying objects for no good reason other than to give you a justification for why you're playing these games in the first place.The games are entertaining enough on their own in reality, and the regular interruption to go home to bed, Shenmue style, gets on your nerves very quickly. After the first couple of days even the ability to dress up your kid in ever more wacky outfits hardly keeps your attention, leaving us wondering why Idol Minds felt the need to pad out the package so pointlessly.In its favour, the online option gives PS2 owners their first opportunity to engage in some simple multiplayer party gaming. Our copy refused to connect to the online network, but from our offline multitap tournament experiences (which will ostensibly mirror the online experience), the chance to engage in some head to head Marble madness, RC Racing and Chemistry Set fun will get quite heated.Visually it's hardly a stunner, although its cutesy, exaggerated stylings lend the game a certain charm, while the twee audio and incredibly irritating voiceovers will have you leaping like a salmon for the mute button, lest you lose control of your faculties.Although quite an endearing idea on paper, My Street simply fails to fully engage for long enough to warrant splashing out £40 on it. With about triple the number of mini-games, or a budget price launch, we'd probably recommend it as a quirky curiosity/novelty purchase, but if we have to hear another squeaky kid utter the word 'like', we'll probably self-combust."}