{"ref": "https://www.eurogamer.net/r-islandthunder-x", "date": "30 Sep 2003", "game_name": "Ghost Recon: Island Thunder", "text": "Taking a trip for what is surely the umpteenth time into Tom Clancy's world of foliage-clad soldiers, panicked AK47-wielding terrorists and relentlessly bad tropical weather, we couldn't help but wonder how much more life there is to it all. Surely there's only so many times you can be informed that your team has ~bagged another one~ before you start looking for something else to do? This is how we felt. We were ready to view Ghost Recon: Island Thunder with the most cynical of eyes. Ah.Well come on, it's an expansion pack for a start, and all the expansions we've played lately have been cash-ins. But... well, Island Thunder is a standalone expansion pack designed to accompany a fine tactical shooter at a cut-down price and... sigh... okay, okay. It's good. Better than we expected, in fact. Not because it pushes the envelope, innovates spectacularly in any respect or even adds a whole lot to the experience - it's just good.Like many Red Storm titles before it, Island Thunder features a guff, useless plot that rarely interferes with the game and merely serves as an excuse for your camouflaged warriors of justice to gallivant across the globe, popping the heads of desperate criminals and ~securing~ all sorts of ~packages~. Yeah, you know what we mean. Stop us if you've heard something like this before: It's 2009 and in post-Castro Cuba, the country's first free elections in decades are in danger of sabotage from a drug-funded warlord. This is where our chaps in the US Army Green Berets (Ghosts) come in to set things straight.And that is all you will ever need to know. In fact, that's all you'll ever hear about the story behind your jungle-bound shenanigans aside from references in the briefings that bookend the eight new single player missions in the pack. No cut-scenes, no narrative, no nothing; just straight in at the deep end. However, to newcomers and old hands alike, the challenge presented from the off might seem unnecessarily deep.We're old alumni from the Clancy school of tactical action, but we didn't remember Ghost Recon being quite so demanding. It's not over-complicated in that Rainbow Six plan-or-fail sort of way, it's just that the missions presented a steeper challenge than we were used to.Perhaps we were having an unfortunate few days wrestling with the Xbox pad, but the AI seemed to be putting in a good deal more effort than we were used to, outwitting us and culling team members like diseased cattle time and again even on the easiest of difficulty settings.Employing the planning map afforded us a little bit more success, however, whereas previously this feature could have easily been discarded. Setting up waypoints and firing arcs is intuitive enough that plotting a quick course of action for your teams isn't much of a chore, and you might find that the difference between failure and success lies in a cleverly thought out approach.Aside from the steeper challenge, though, Island Thunder brings little in the way of changes to the table. Each of the eight missions feature fairly uninspiring objectives (most of your time will be spent ~securing~ areas by eliminating all the enemies), and they feel very much like they could have been picked up from the Recycle Bin when the original was sent for reproduction.The visuals won't win any awards for their slightly haggard looks either, with the distinctly angular landscapes forming a major sticking point - literally in some cases. Still, each of the maps has been fairly well designed for the most part, and the occasional implementation of weather effects makes all the difference, sometimes drenching the otherwise ordinary missions in atmosphere.Speaking of atmosphere, a special mention has to go to the incredible work in the audio department. When a thunderstorm combines with the crack of automatic fire, the wind in the trees and the slow, cautious pace of the gameplay, we defy anyone not to be drawn in by the sense of danger permeating through some of these missions. Experiencing some of these moments makes the single player game worth persevering with.So far, so ~good~ then. But Island Thunder really comes into its own when you get online and engage your foe on one of the twelve magnificent and varied multiplayer maps. The implementation of the multiplayer features in such a nigh-on budget title really did take us by surprise, and for most this will be the only part of the pack worth purchasing - there is only so much longevity the campaign mode can offer in its various guises of trickiness, after all.Naturally the online success of any tactical shooter relies heavily on finding yourself some decent, friendly and co-operative players to team up with, and we seemed to hit the jackpot on the day we spent testing Island Thunder's Live! features. It can often be a bit of a chore finding your way onto a server that fulfils your specific requirements - be it team deathmatch, last man standing, co-operative or any of the other six or so multiplayer modes available - and one doesn't have a fifteen minute wait before you can play. However, once you find a good crowd of players to join, you won't put the pad down for hours.Of course there are players out there to ruin everyone else's enjoyment, but as we've said before, this isn't a criticism that can be levelled at the game itself. When the players are at their best, Ghost Recon: Island Thunder has the kind of compulsive multiplayer charm Live! subscribers are looking for. The twelve multiplayer maps on offer coupled with the wide variety of play modes are alone worth the price of admission as far as we're concerned - the single player campaign missions are a bonus.So we reach pretty much the same conclusion we did back in January, except we're all the more charmed thanks to the low price. Island Thunder may not be the best-looking tactical shooter ever made, nor does it bring anything to the genre in terms of progress, but there's little else on Xbox worth looking at in the genre until Rainbow Six 3 shows up. At under twenty quid, this standalone expansion's Live features will give you more joy than most full-price titles, and any Clancy-style shooter fan would be doing themselves a disservice to miss out."}