{"ref": "https://www.eurogamer.net/final-fantasy-12-the-zodiac-age-review", "date": "18 Jul 2017", "game_name": "Reviews", "text": "30 years and 15-or-so games after its debut, Final Fantasy is not a string of sequels but a solar system of discrete planets, of varying likeness, linked only by a weird selection of motifs - airships, crystals, birds that can be ridden like feathery ponies. Within that solar system, Final Fantasy 12, first released in 2006, is an outlier, a Pluto quite unlike any of its neighbours. In other Final Fantasies - and many other RPGs for that matter - you adopt a clutch of orphan fighters and, experience point by experience point, chip away till you have revealed each individual's predetermined potential. In Final Fantasy 12: The Zodiac Age, there is no such predestination. Each character begins as a lump of clay, ready to be shaped to whim or strategy. The potential future of each character - Vaan, an irritating, fey ghetto rat, Balthier, a smartly dressed, quipping sky pirate, Fran, an Icelandic giantess, dressed as if she just stepped off the set of a Beyoncé shoot - is mapped out on a chart. This license board, as it's known, is divided into chessboard squares, and each square represents an upgrade: 100 HP to add to his or her total, the ability to equip a particular sword or hat, a screen-quaking special move. Collect enough license points from downed enemies and you can buy the square, which then opens up any adjacent squares for future purchase. In the original game, every character shared the same board; by the game's conclusion every character was exactly alike. In The Zodiac Age, which is based on the previously Japanese-only 'International' version of Final Fantasy 12, you choose a class for your character (Knight, Archer, Monk, Red Mage and so on) and then unlock squares relevant to their speciality. Later, you can choose a second license board for each character to plunder, creating fabulous, terrifying hybrids. It's important to start down here, in the weeds of gritty detail. Final Fantasy 12 is a cathedral built from ten thousand of these shifting, agency-gifting parts. Next, you must design how your emerging party members work together in battle. While it's possible to direct every swipe of the sword and each life-restoring potion tossed into the air, long term you must step back and play a role closer to that of a football manager. Each character must be programmed with simple lines of logic to autodirect their behaviour. The format of these 'Gambits' is simple and always the same: 'If X then Y.' This could translate to a command such as 'If your ally's HP falls below 20 per cent then consume a potion' or 'If you meet a monster that's vulnerable to fire then cast fire spell.'As you plunder the license board you unlock more and more Gambit commands for each character, which can be customised and then stacked into complex towers of logic. Soon you have fashioned a cascade of commands designed to cover every eventuality. A well-designed team will be almost completely self-sufficient, singling out the weakest enemies, keeping everyone well stocked with health points and dismissing any negative status effects without you having to twitch a thumb. If there's a flaw in your logic, however, the entire enterprise can come crashing down in moments. One character may stand idle, another use up the party's entire stock of ethers for no good reason. In other Final Fantasy games you shepherd a group of characters from prelude to postscript; in Final Fantasy 12 you must, line by line, programme a roving, many-limbed computer. The Zodiac Age includes another feature from the International version of the game, one designed to sharpen your sense of delight at the battle system. It's possible to double or quadruple the speed the game's running speed, like scrubbing forward video footage. In this way, your characters are able to sprint with comical, Benny Hill-like speed across, say, a desert, while making quick, five-second work of every low tier group of enemies they encounter. Seeing your team carve through the landscape double-time, showing off the brilliance of your Gambit design, elicits the feelings of a proud parent. Final Fantasy 12's battle system is not only the best in the series, but it's one of the best in the medium: idiosyncratic, endlessly flexible, and elementally rewarding. In the 11 years since its debut it's never been bettered, partly because it's never been copied. It feels as fresh and daring today as ever.What about the rest of the game in which all this assured, delightful invention features? Final Fantasy 12 was directed in part by Yasumi Matsuno, lauded creator of Final Fantasy Tactics and Vagrant Story. Matsuno's fingerprints are all over this game, especially in its opening third, which tells a compelling, pseudo-historical story of a case of mistaken identity surrounding the assassination of a king. Matsuno, however, left the project three quarters of the way through its development. His departure was blamed on poor health. Others close to the development team, however, have claimed that Matsuno was pushed out following the departure from the company of his friend and mentor, Hironobu Sakaguchi, Final Fantasy's creator. (Sakaguchi later said that he refused to play Final Fantasy 12 beyond its opening scenes on principle, which all but confirmed the rumour of mistreatment and compromise). Perhaps for this reason, the latter two thirds of Final Fantasy 12's story falter. What begins as a story filled with vivid characters behaving in logical, memorable ways soon fizzles out to a rather dour tale, filled with expository cutscenes in which rather dry political machinations are discussed at length. Vaan is a weak protagonist (reportedly, Matsuno intended Balthier to front the game and Balthier repeatedly refers to himself as ~the leading man~). Understanding this context helps to explain Final Fantasy 12's uneven texture. Huge parts of the game, including, mercifully, its core systems feel carefully authored, and cleave to a clear vision. But many other elements are disjointed, and the game's story suffers from Square Enix's mistaken and damaging belief that every Final Fantasy game must revolve around magical crystals, those ever-present McGuffins of Fantasy lineage that no player has ever, or will ever, care about.This update takes great lengths to smooth over many of those cracks and niggles. The high-speed mode allows you to breeze across huge swathes of terrain (it's a feature that players will surely now wish made it into every adventure game). This makes chasing down the game's extra-curricular marks - freelance hunting missions that you accept, Witcher-style, from notice boards - a much brisker endeavour. It's possible to manually save your progress, but the game now auto-saves whenever you enter a new locale, so you won't lose hours of progress by accident. And some careful, yet unsubtle massaging of the license board layouts will enable newcomers, or those who struggle to adjust to the new battle system, to flourish, without compromising on grand flexibility for experts. The final addition to this rerelease is a delicious Trial Mode, which allows you to import your current levelled party form the main adventure, and put then hurl it against a one hundred-stage series of battles with increasingly powerful enemies. This too can be played at double- or quadruple-time, although you will routinely need to pause the action in order to tailor your team's Gambit set-up - it's been carefully designed to prevent a purely hands-off approach. As a post-game diversion Trial Mode is ideal, allowing experienced players to tweak and optimise their parties, before testing them against a pre-set, uniform challenge.The Zodiac Age is an anomaly in the Final Fantasy lineage, a game made with the kind of singular directorial vision only matched by the Sakaguchi games (and, arguably, Naoki Yoshida's more recent Final Fantasy 14). Quite how close the finished game comes to Matsuno's vision is a question we will likely never know the answer to - especially now he is again working with the company, and obligated to remain tactfully silent. What is clear is that this is the definitive version of Final Fantasy 12, a game that despite its developmental difficulties, still emerged as one of the most fascinating projects to take the series' name."}