{"ref": "https://www.eurogamer.net/r-chaoslegion-ps2", "date": "10 Sep 2003", "game_name": "Chaos Legion", "text": "After the success of Devil May Cry it was inevitable that the successful hackandslash formula and superb game engine would spawn a sister title with a twist. It's a familiar tactic of Capcom's - after Resident Evil came Dino Crisis, then Onimusha, which in turn employed the RPG-style upgrade system that both DMC and now Chaos Legion employ.But if we're scaring off action gamers with talk of RPG shenanigans, fear not. Any hint of complicated gaming should be cast out of your mind, for at its throbbing heart, Chaos Legion is a back to basics, level-based button masher that requires gamers to despatch whatever evil-doers cross your path with a hefty swish of a mighty blade.Instead of Dante, we get 'master swordsman' Sieg Wahrheit, a similarly chiselled man with superior sword-wielding skills, flowing wardrobe and coiffured barnet to match anything the gothic prince of DMC could boast. Even though the story is basically superfluous to the action, we get one anyway (well, they have to make use of that excellent CG studio don't they?).Apparently Sieg's oldest ally - Victor Delacroix - has been consumed by the forces of evil, and wants to deliver chaos on the world. We know how he feels. In a nutshell, you've got to put a stop to these evil plans with your elite combat skills and your ever-willing legion of helpers against an army of aggressors.The game starts as it means to go on; with a whole crowd of bizarre enemies clustered around waiting to die at your hands. To begin with, the game's gentle enough to allow you just to stab square repeatedly until everyone's shuffled off into oblivion, but by the third section of level one you'll probably be wondering what this Legion business is all about.Very quickly it becomes apparent that playing Chaos Legion on your lonesome is near enough impossible, thus requiring you to call for back up at particularly intense moments. Hitting L1 brings one of two selectable teams of heavies into the fray, which will by default act aggressively and attack anything in sight, or form a defensive shield around you if you press R2. Futhermore, hitting triangle then unleashes a special attack, while hitting square orders your troops to lock onto a particular opponent.This ability to lock on is especially important, as each level (and sub-level) houses a number of 'targets' which you have to destroy before you can move onto the next section. Oddly enough, if you defeat these 'queen' enemies, every other enemy within the level immediately dies, basically allowing you to bypass most enemies and concentrate on the end of level target - but should you choose to battle meticulously through every creature you've be rewarded with more experience points, which you're then allowed to spend on upgrading whichever Legions you've been using between missions.Every Legion is effectively comprised of five main areas of upgradeability, including Attack, Defence, plus areas relating to their power and special attacks. As you progress through the game, you're rewarded with more Legions to choose from, up to a maximum of seven. But given that you can only earn experience points for your Legions if they've actually been equipped, you have to make a decision early on which ones you find most effective.Each enemy in the game is either organic or metallic. You'll basically be switching between Legions depending on what you're up against, so there's an element of strategy involved in how you tackle each level. For the first third of the game though, Chaos Legion resembles a basic brawling beat em up, in the vein of Capcom's ancient Final Fight; all brawn and very little brain.Most levels can be defeated with repeated use of the - you guessed it - square button, occasional use of the jump button, and most often you'll have the level licked in under two minutes. But then suddenly Capcom turns up the heat you'll soon find yourself desperately struggling to slug your way through the mire and forced to think about different ways to approach these often obscenely tough enemy-packed environments.The game tries to help out every now and then, offering up bonuses such as health and soul recharges, as well as on the spot upgrades including max health and defence boosts - and you'll doubtlessly need every one. In true Capcom style, the point where you get hopelessly stuck is the point when you realise you've got to go back and play the game far more carefully, storing up every health and soul recharge you possibly can as the proliferation of evil rains down on you relentlessly.As with Devil May Cry it's a great looking game, full of delightful architecture, great animation and bizarre characterisation. The detail level is admirable, the frame rate rock solid even when the screen is utterly rammed with two dozen gigantic monsters and as a result the controls are as responsive as you could wish them to be. In terms of polish, it's spot on, although perhaps it's fair to say that there could be more variety.DMC veterans will especially feel that they've seen most of what there is to see very quickly, and sadly even the later levels do little to make you believe this project was a labour of love. Some might say it was a formulaic title that Capcom knocked out with the minimum of fuss using existing tools and technology, and we wouldn't argue with them for thinking that. But it still has its own merits.Despite Capcom's protestations of Chaos Legion being some 'intense gothic opera' fusion of action, RPG and strategy, it's still an essentially simple game at its heart, and might not be as involving as many would like. But if you want to feast on non-stop action with an interesting power up mechanic then there are few games out there that can match its challenge. As with any game you're not entirely sure of, try before you buy. The chances are if you like the idea of a whiter version of Devil May Cry, you might like it."}