{"ref": "https://www.eurogamer.net/r-dromeracers-x", "date": "19 Aug 2003", "game_name": "Lego Drome Racers", "text": "With most of our childhoods now strip-mined, publishers are being forced to think of new and ~unique~ (uh-oh) ways to reap what was sown all those years ago. One such option is to take a popular genre and wrap it round an old idea. Welcome to Lego Drome Racers, a futuristic racing game built around cars made out of plastic blocks.Now, we don't expect every game here at Eurogamer dungeons to hit our eyes like light bouncing off Elisha Cuthbert (or, depending on your tastes, someone that you find attractive), but Drome Racer has more in common with 90s racers like Rollcage in visual terms than the Quantum Redshifts and F-Zeros of this world. So on that front, there's certainly no room on the packed futuristic racing podium. Cars look near identical to their Lego Racer brand equivalents, but the world itself is a frenzy of boring locations (canyons, mountains, cities) draped in someone's half-hearted vision of the future. In other words, it looks perfectly acceptable, but makes no effort to innovate. If you've ever seen a futuristic racer (or looked a screenshot) then you know what to expect.We're toploading the review with a word on the graphics because they outshine the rest of the game considerably. From here on in, it gets worse and worse. Apparently in the next 12 years the world topples off its axis until all the sound effects and musical compositions are spacey and needlessly electronic, and everyone talks like an extra from Scooby Doo. What's more, by the time the year 2015 rolls around the world is hooked on the sport of Drome Racing, which is controlled by the race king Dromulus. As a member of Team Nitro, you are trying (for some reason we don't care about) to secure the Drome Championship, which involves completing a series of increasingly difficult races, vanquishing rivals in occasional one-on-one face-offs, and fighting oversteer.Apart from racing around typical futuristic racer landscapes, you will also get to hurtle around a couple of off-road tracks in quad bike-style buggies, but the handling remains mostly the same (the only real difference being the dust storm going on in your wake) and it feels like there's an ACME-sponsored anvil lodged in each tyre. The collision detection is also rather unfavourable, and regularly sends you spinning for no good reason, and the up-to five other racers on the track are always quick to capitalise thanks to numerous boost pads and weapon pick-ups.Weapons consist of the usual assortment of mines, missiles and shields, with a couple of interesting wildcards - the flare attack, which blinds your enemies like a flashbang, and the repulsor, which rather amusingly endows your Drome Racer with adequate speed and handling for a short period of time - but like the visuals and feel of the game in general, you know them well enough already.There are some redeeming features, but they're mostly superficial. Before each race in the championship, you're given the opportunity to improve your starting position by taking place in a drag race, where balancing gear-shift and acceleration to avoid wheelspin or an engine blowout and go faster than your opponent is quite challenging. However, these are entirely optional, and this isn't Formula One, so grid positions are about as important as they are in any middling futuristic racer: they're not. Another potentially laudable inclusion is the ability to upgrade your Engines, Turbo, Tyres, Armour and Aerodynamics to five levels each, but these changes make virtually no difference to the feel of the game or performance of your vehicle.The best thing we can really say about Drome Racers is that there's a lot to do for those willing to do it. Even before you consider unlockable tracks, there are four ways to approach any level, with a couple of ways through each and the option go round in the opposite direction for each, and we feel confident that if you were to enjoy the fundamental racing activities and persevere with Drome Racers, you'd find yourself with enough to keep you busy, with all the usual trappings (Time Attack, Quick Race, etc) to explore as well.But ultimately we're quite confident that, like us, you'll decide that you've much better things to do with your time. Drome Racers may be inoffensively put together, but we still find ourselves struggling to grasp why it was commissioned. On the Xbox (the version reviewed here), Quantum Redshift is clearly and vastly superior, and there are plenty of better futuristic racers on the PS2. Certainly for anyone who also owns a GameCube, Amusement Vision's F-Zero GX is one reason to stick this £40 in a jar and wait for Christmas. Coming from that to this, as we did, is like dumping Elisha and dating Vanessa Feltz on the rebound."}