{"ref": "https://www.eurogamer.net/r-futurama-x", "date": "18 Aug 2003", "game_name": "Futurama", "text": "Good news everyone! Someone's made an entertaining cartoon-based videogame! Whu? Oh, only it's not entertaining as a videogame, it's entertaining because somebody hired an ex-script writer for the show, rescued the voice actors from the Job Centre and checked the box next to 'Platform Game' instead of 'Skateboarding' or 'Crazy Taxi clone' during the design luncheon.UDS, who put the pieces together, obviously share our love for the show, because Futurama is brimming with ticklish one-liners and ads for Human Rinds. The idea is that the Professor has sold his Planet Express delivery company to Mom, which just so happens to take her ownership of the world's assets over the 50 per cent mark, plunging the Earth into her servitude. Fair enough: cheese it! Except the ship's busted up, the professor's pawned the backup engine and New New York is crawling with hover bots.As you'd imagine, Fry is the first chap you get to control, and after 15 minutes scouting round the company building collecting the professor's tools and acclimatising yourself to the simple controls (R to lock on, A to fire/hit, X to charge a shot or thwack, B to jump, Y to open doors/activate switches and L to centre the camera), he's dispatched to the pawn shop to retrieve the spare engine. Which the Professor pawned for a gun.Bearable, if a little unexciting, the first tutorial section collecting objects scattered around the joke-infested Planet Express HQ is a darn sight more enjoyable than what's to come. Before long Fry is scampering around sewers hammering the A button repeatedly to take out rambling monsters and mutants, pulling easy-to-find switches to open doors, and leaping from box to coffin across lakes of toxic waste. One bad jump, or too many hits from the monsties, and it's back to the last checkpoint.Fair enough, the game has a sense of humour. Fry's very first task involves plucking a hammer from under a dangerous pile of debris, which duly falls on his head and kills him leading to a demonstration of the Professor's ~re-animator~ machine - followed by Fry's insight that when you die it all goes black and white lights appear reading ~Game Over~. But the joy of Futurama on the TV was that you could watch it without having to then repeatedly hop, skip and jump past simplistic platform levels, cursing yourself each time your impatient haste sends you hurtling into green goop, in order to access the next scene.Yes, it'll have you chuckling to yourself in a way that many games won't, but it'll also have you cussing the television in tones usually reserved for Kilroy's latest exposé on women who don't like their hair. Even if you can take on the mean streets of New New York in a giant mechanical chicken suit and straddle peculiar beasts with the crunchy Dr. Zoidberg.It's just a little bit too much by the numbers. The graphics engine is a nice cel-shaded affair that captures the essence of the show but rarely leaves you gasping (and it had our Xbox juddering in places), overwhelming odds and ease of death compensates for childish level design, there are numerous fairly pointless collectibles which unlock video and audio Extras, and the camera has a habit of clipping behind walls and generally misbehaving in close quarters. In other words: a standard platform game. What kept us going was the show's intoxicating humour.And, yes, admittedly for some this will be enough. Four of the show's main characters (Fry, Leela, Bender and Zoidberg) each get a run-out, there are regular cut-scenes and load screen ads (Tri-Curious?) to enjoy, it's a goodly length with replay value for those who want to uncover all the Extras, and with the show cancelled after three seasons (with just the DVD release of the completed fourth season to look forward to), it's about the only thing left to plunder for laughs.But whatever the developer's intentions (and we're willing to bet, given their obvious love for the show, that they weren't the ones who picked a platform template), this is still a cynical and at times deeply boring game to play. As a platformer, it won't have Naughty Dog barking [groan] or keep Insomniac up all night [make that a double -Ed] - rather it's like humans in general according to Douglas Adams: mostly harmless. If you're convinced, by all means take the plunge. We'd rather buy the third season box set."}