{"ref": "https://www.eurogamer.net/r-lostkingdoms2-gc", "date": "11 Aug 2003", "game_name": "Lost Kingdoms II", "text": "They've had another go, and they still haven't got it right. For those of you that missed out on Lost Kingdoms, it appeared at a point in the Cube's life when ~RPGs~ was usually preceded by ~where are all the effing~, so we really did give it the benefit of the doubt for as long as possible.We balked at the contrived puzzling, but kept puzzling. We cursed the random battle system, but battled on. We fought the four-point camera system at every turn, but still we continued. We even tried to tolerate unassailable two-foot walls, vital magic gemstones falling outside the battle area, a convoluted plot involving a foxy maiden, a faceless magical threat and tales of prophecy, and a main character who pivoted like a netball player. We tried, but in the end, how can you put up with so many flaws? Even if the card battling system is really, really clever?The answer is that you probably can't. And so, with a heavy heart, we declared it ~just above average~ and sat around waiting for From Software to fix everything in time for the sequel.The good news is that From has clearly listened to the many complaints levelled at Lost Kingdoms II, because the puzzles are better, the random battles have been swapped for real-time encounters, the camera is free roaming, and gemstones are always within fetching distance. The bad news is that, agonisingly, this still hasn't made the game any more recommendable.But let's start at the beginning. For those of you who missed out on Lost Kingdoms entirely, it lives in a halfway house between traditional RPGs and card battlers like Magic: The Gathering. Levels and towns are spread out on a big world map to be completed one by one, and your would-be hero - a young girl, this time named Tara Grimface - has to race around each of them using a series of magical cards to dispatch foes until none remain.Cards and enemies are split into distinct and opposing elements, like water, wood, earth and fire, with a few neutral/mechanical cards to boot. Fire beats wood, wood beats earth, earth beats water, and of course water beats fire. On top of that, your cards take the form of weapons (instant attacks, like sword thrusts), independents (monsters that spawn to fight in your stead), transformations (that turn Tara into a monster for the duration of her attack), summons (that invoke giant monsters for one huge attack) and helpers (such as health fairies). Cards are shuffled and dealt to your face buttons one at a time, as indicated in the bottom right of the screen, and from here you can use them by pressing the corresponding button, send them to the back of the pack by holding R and pressing the button, or combo them.Before each level, you are given the chance to customise your deck, inserting cards acquired at the end of previous levels, found in treasure chests, bought at a shop or obtained somewhere else, and you can pick up to 30 for each level. Although you can fiddle with the deck at mid-level ~fiddle points~, you can't use any more than the 30 you start with, so if you run out you have to choose ~Abort~ from the status screen and start again. Customising your deck plays a huge part in Lost Kingdoms II just like its predecessor, because each pre-level screen advises you on the range of enemies within - perhaps 60 per cent fire, 20 per cent water and 20 per cent earth - and challenges you to construct a suitable fighting deck, and one will can last for the duration of the level.So far then, not much has changed. The game is still about obtaining cards, building decks and conquering levels in the same manner as before. In addition to the above, you can improve your alignment to a certain type of card by using it more often, providing some much needed character progression. Using multi-star cards when you really shouldn't will soak up far more of your magic than is economical, so it's important to specialise and practice. You can also power up certain cards, increasing their magic requirement but obviously multiplying their attacking potential - and that can be important against bigger monsters that threaten to split your delicate frame in two if you stand around fumbling your deck.Furthermore, From has included a combo system, and if you're fortunate enough to draw cards which can be used in conjunction with one another, then by holding Z and using one of the cards, the combo will be set into effect. These can be devastating, and very useful in the right situation - yet another thing to consider when you're constructing your deck.Despite the similarities to its predecessor though, Lost Kingdoms II plays in a fundamentally different way, because this time you're not being plunged into random battles. You can't avoid enemies outright, but the new real-time system means you can see them coming and engage them when you want, and you no longer run the risk of losing out on gemstones because they've fallen outside the boundary of the battle. The outcome of individual battles loses some of its satisfying finality as a result, but that's a small price to pay if it means you won't have to stumble five steps celebrating and then repeat.However in spite of this improvement, you're still forced to battle with the camera at every turn - perhaps even more so than before. We complained that the original game's camera, which would swing between four points, was crying out to be let loose, but we'd happily take it back. In LK2, the camera swings around to inconceivable viewpoints, leaving you to tug on the L trigger to centre it behind Ms. Grimface, and in a game where a lot of attacks depend on your being within a particular range, or at a particular angle, being unable to see your foe as you flee their attacks is obviously a problem.Then again, you simply aren't meant to beat some foes until you have particular cards. You'll certainly realise this as you dabble with the game's hidden areas. There are plenty of different levels to be unlocked, even if there's only one true path to the game's conclusion. Certain cards instil special abilities, like a long jump, and if you're keeping tabs on all the things you wish you could have done - like jumping across a gap in a bridge to an abandoned castle - then you'll be able to fight for some seriously elusive cards and build up a deck to rival an aircraft carrier.But although it's nice to see some non-linearity, puzzles which do less to trouble the word ~ridiculous~, and a refined battle system, it's not going to keep you going for the duration if you're not interested in what you're fighting for - and sadly, we lost interest very quickly.It's not that it's a bad story, or even that the characters are rubbish - it's just the overwhelming number of clichés that you encounter at every turn. Whether it's a heroine with a troubled past who stands to solve all of the world's problems, morally destitute bandits who've taken her in, tedious one-line conversations with every lonely soldier in the kingdom, or just the overriding sense of sameness, it's a problem.If you're interested, the idea behind it all is that Tara Grimface, abandoned at birth, has been thrust into a world where card-casting runestones are being counterfeited - a practice that could turn every wannabe Merlin into a deadly sorcerer. She's out to stop them and uncover the truth that lies in her wake. There will be RPG die-hards who find this sort of thing engrossing, but we're no longer among them - we want something more exotic these days.We do feel at pains to try and defend Lost Kingdoms II, because in certain areas it continues to do well: the card battle system is one of the best in any game, delivering on virtually every level, and the refinements over the previous version will impress the veterans. It doesn't look bad either, with detailed characters and some nice monster design, even if it manages to look exactly like its predecessor in a lot of ways, and the soundtrack can be quite stirring when it's not being drowned out by Tara's noisy footsteps. Plus, if you can find someone else with a passion for deck-building then the two-player Vs mode is bound to keep you happy for ages as you square up with increasingly exotic decks, full of cards you've plundered from secret areas and on hidden missions.For us though, with the last battle still fresh in our memories, we can't help but wonder whether the series has much left to offer. If From does want to have another crack, then we'd suggest that it starts from the ground up. Entertaining though Lost Kingdoms can be when it's raising two fingers to RPG convention, it's still blighted by conventional RPG problems."}