{"ref": "https://www.eurogamer.net/r-megamannt-gc", "date": "28 Jul 2003", "game_name": "Mega Man Network Transmission", "text": "It takes a lot to coax new ideas out of Capcom. Even its most acclaimed titles of recent months and years have been old-school ideas obfuscated by new-school dressings. And one series that seems almost impervious to the modern fashions of 3D engines and dramatic cinematography is Mega Man. It's hardly surprising, then, that the blue bomber's Cube debut offers little more than a few RPG-style ideas to underpin the tried and trusted formula of its classic side-scrolling 2D gameplay.Set between the first and second GBA Battle Network titles, Network Transmission sees the young student Lan Hikari and his ~Navi~ counterpart Mega Man.exe - a kind of sentient Tamagotchi - fighting viruses on Capcom's version of the Net, with help from local school kids and their respective Navis. The game's futuristic approach to the Net is a familiar otherworldly 2D platform environment, which can be ~jacked into~ at various points in Lan's neighbourhood, and is populated by various laser, fire, etc-spitting 'viruses' in standard enemy form.After climbing, jumping and blasting his way to the end of each area (or node, perhaps), Mega Man comes up against a boss. Once defeated, the blue bomber can take him on in a sort of digital coliseum at any time, or advance to the next area to continue his quest. Behind the cheesy cyber-talk, cel-shaded 3D cut sequences and mock web interface, then, it's very much the same game.However instead of leaving it at that, Network Transmission also throws in some Battle Network ideas, like different armour and suit upgrades, and ~battle chips~ - collectible power-ups that can be downloaded to Mega Man from outside the net and used in combat. These chips, which let players fire shotguns, throw bombs, charge enemies, wield mighty longswords and recharge Mega Man's health, are chosen at the start of the level, and Mega Man can retool his five chip slots at intervals whenever a gradually replenished blue ~Custom~ bar at the top of the screen fills up.Battle chips certainly add a new layer of interest to an otherwise tiring formula. By picking out favourites in the start menu, players can make sure they will always turn up on the retooling screen along with a random selection of others. Up to five can be carried at a time, each requires a certain amount of power per shot, and after a while it's easy enough to gauge which are likely to be needed against certain enemies.It's certainly satisfying when you get midway through a level and find yourself with all the right options. It's just a pity that organising them in your inventory involves disarming yourself first. Even glancing at what you might move to the top of the list involves sending the blue bomber's current chips back to the ~Folder~, leaving you with a choice between edging forward with the paltry chargeable beam weapon and standing around waiting for your Custom bar to fill up again.It's also disappointing that chips dropped by enemies are not readily identified. In order to find out what you've got, information which could mean the difference between living or being ~deleted~ on the next screen, you have to navigate to the menu showing you recently acquired chips, which, you've guessed it, means sending items back to the inventory and the agony of standing around waiting to recharge again.What hit us harder than anything though was the initial challenge. To begin with, Mega Man's charge beam feels more like a spud gun that doesn't even charge, and the first two bosses gave us plenty of grief, despite a decent stock of backups (extra lives) and the chance to rejoin the level right before the boss encounter.After that though, you can afford to buy upgrades from the local shop, and things settle down on the Net as you start to get the hang of organising your battle chips and how to deal with each enemy. Few of them do anything remarkably different to what's come before; firing beams, igniting the floor in front of them or hopping along until they can zap you, but they're challenging enough en masse, particularly if you're running low on battle chips.Level design is equally conservative, with a few barriers requiring access codes every now and then (usually 'hidden' somewhere in the near vicinity behind a sequence of viruses) and the usual mixture of enemies, ladders, levitating and disintegrating platforms, and instant-death spike traps.And although there are some new additions to the control scheme, like a sort of pause button (X) which lets you fiddle with your battle chips (left and right triggers) unmolested, it's pretty standard, with jump mapped to A, the charge beam on B and battle chips on Y. You can also pull off other simple moves like sliding (useful for skating under jumping enemies and through small tunnels) and hanging from wires by holding the directional pad or analogue stick down or up whilst pressing A, but on the whole anybody who has played Mega Man before, or indeed any other 2D platformer, needn't worry about the complexities of the control scheme.Despite making a few changes, Network Transmission still feels like the same game, with a cel-shaded 2D engine that tries a bit of perspective here and there still fundamentally the same as the one Capcom employed back in the 80s. There's a bit more up and down, certainly, but all that really distinguishes it is the sharp, cartoony look, smooth framerate (even if we couldn't find a 60Hz option) and web-like interface for loading each level. And the soundtrack? It's the same guitar-laden elevator music for superheroes that we've been groaning about for ages.'Tis a pity, because with the exception of equally samey Resident Evil titles, Capcom's Cube output has been fairly refreshing so far. P.N.03 and Viewtiful Joe in particular are some of their better concepts, and neither was afraid of doing adventurous things with old-school ideas. The bossmen behind Network Transmission, however, are clearly frightened that at this stage in the series life, Mega Man fans will only go for one thing: jump, shoot, boss, repeated ad infinitum. Whether that's true or not is up to you to decide, but these days we're decidedly nonplussed."}