{"ref": "https://www.eurogamer.net/valkyria-revolution-review", "date": "30 Jun 2017", "game_name": "Valkyria Revolution", "text": "Well, at least the soundtrack is just fine. If you've any love for Valkyria Chronicles, an affair likely started with Sega's 2008 original which saw Skies of Arcadia director Shuntaro Tanaka injecting some of that same breeziness into an exquisite tactical RPG, you'll likely already know how the story goes. How Sega's own 2010 sequel was confined to the PlayStation Portable, and another follow-up in 2011 from developer Media.Vision was confined further still to Japan only, with an official localisation never forthcoming. How Media.Vision was given another crack at the series with an action-based spin-off, and how it released to fairly dismal reviews in Japan earlier this year. Six months later, following a noble localisation effort from Sega and Deep Silver, I can only confirm what you likely already know. Valkyria Revolution is not a good video game. And how. A prequel set in an alternate timeline some 100 years before the original in an analogue of the industrial revolution, this new Valkyria inherits some of that same fantastical fiction. It's a softly spoken steampunk - perhaps steamfolk would be a more fitting term - where an alternate Europe is beholden to and transformed by the magical properties of Ragnite. Revolution's new setting allows for a slight spin on the aesthetic, where Parisian-esque streets are busied by vast arcane contraptions. It can be, like the games that preceded it, a sight to behold.Yet there's something amiss, whether it's the anime excesses of the character design or the sheer bland ugliness of the game in action. It's not an exaggeration to say that 2008's Valkyria Chronicles is the prettier game despite being an entire generation apart (the recent HD remasters, meanwhile, leave this comfortably in the dust), and it exposes an unfortunate truth about Media.Vision's effort. All that's half-decent about Valkyria Revolution is borrowed and, frequently, bastardised beyond breaking point, leaving a sorry dirge of a game. As a spin-off you can hardly bemoan it for veering away from the template of the original, but Revolution makes the mistake of appropriating too much from its predecessor without knowing exactly what to do with it. You're constantly reminded of another, better game, and Revolution's never bold enough to tread its own path. Instead it's a half-hearted musou game with RPG elements slapped on with no rhyme nor reason. It's a limp mess. You play Amleth Grønkjær, an anonymous anime hero who leads an equally anonymous squad where no archetype is left unturned (the gruff veteran! The clumsy cute girl!). On the battlefield, control can be split between your teammates, flitting from one to the other as you work your way through thin mobs and then on towards the boss that concludes most levels. You've access to magic and weaponry, but Valkyria Revolution rarely throws up a challenge that can't be solved with little more than a blunt sword to the head. It's another of Revolution's big problems; there are plenty of systems here, but none of them are ever put to good use. There's a cover system and stealth mechanics that never make a case for their existence, skill trees that branch obscurely into nothingness and a class system that falls flat. Potentials - one of Valkyria Chronicles' most charming systems which introduced buffs and debuffs for each character such as 'Chatty Cathy' whereby more talkative members of the group would lower the accuracy of nearby teammates - make an appearance here, but they're never fully explained and seem to have negligible effect. All of which makes battle a weak and clumsy sprawl where partner AI seems non-existent and apathetic enemies don't even have the spark to put up a challenge. Add in looping objectives and backdrops and you've a recipe for prolonged misery, so maybe it's something of a blessing that the gameplay makes up less than half the package here. That's until you realise the cutscenes that make up a vast amount of Valkyria Revolution are more lumpen and leaden than the action they set up. A shame, as there's the glimmer of something special there. Revolution's story is neatly framed by a conversation between a professor and his student, and there's a dense history the two explore. It's lost, though, in overlong and under-animated cutscenes that stretch onwards for over 15 minutes apiece with little respite from anodyne and over-earnest exposition. Tedious is too polite a word for it, and the one good thing I can say for Valkyria Revolution is in my week with it I've been inspired to see off countless overdue chores. Hedges have been trimmed. Hard to reach shelves have been dusted. Expenses accounts have been squared. All to put off spending another hour with this joyless vacuum of a game. But yes, the soundtrack - from Chrono Trigger and Xenoblade's Yasunori Mitsuda - is okay. Though even then it's far from the moving pastoral beauty of Hitoshi Sakimoto's score for the original three games, yet another area where Revolution falls so short of their greatness. It all adds up to a minor travesty. The only sane reason to invest in Valkyria Revolution is to send a message to Sega that this series should live on, and to hope that somehow it leads to the revival the originals deserve. Given the state it's left in after this turgid affair, though, that time may have already been and gone."}