{"ref": "https://www.eurogamer.net/r-planetside-pc", "date": "1 Jul 2003", "game_name": "Planetside", "text": "A lone sniper sits atop a small hill among the trees, scanning the walls of the installation some distance away with his scope. The skies have opened up today, the rolling thunder and rain falling from the thick grey clouds washing away the sniper's ability to hear enemy footsteps. No matter, the reinforcements will be here soon enough. There's a rumble now, and as it gets louder, it turns into a synthetic whine. The sniper turns to see what's coming, and a huge blue and yellow machine collides with his face, then blackness. ~WTF!!!11~ cries the sniper. ~LOL! sorry man~ says the soldier driving the personnel carrier. Welcome to PlanetSide.PlanetSide - a massively multiplayer first-person shooter - is a fantastic idea. Essentially it takes the futuristic, large-scale battles and settings of Tribes 2, expands them into ten huge ~continents~, and fills them with hundreds of players firing enormous guns at each other. It's one big war. Well, that's the idea anyway. Hopefully this kind of gameplay can provide the long-lasting appeal necessary to make it worth the £8 a month or so subscription fee, but being the sceptics that we are, we took advantage of the 30-day free trial that comes with the game and gave it a couple of weeks to prove itself to us.And we were quick to find out that logging straight into PlanetSide is not advisable; you will be completely aimless unless you find someone willing to hold your hand through the basics. That, my friends, is the job of the training mode. So in we went, fresh-faced and wide-eyed. We were told of three warring empires: the oppressive Terran Republic, the rebellious New Conglomerate and the progressive Vanu Sovereignty. Each empire is struggling against the others for control of the continents around the planet, and each has its own pro's and con's. TR soldiers are equipped with weaponry that aims to sling as much lead at the enemy as fast as possible, whereas the NC prefers to rely on more powerful and accurate weapons. The VS, however, ignores conventional weaponry and has instead pilfered both its name and energy-based technology from that of the Vanu race that originally inhabited the planet.The training sets you up with the bare minimum of basics, teaching you how to aim and fire, how to recognise your enemy, how to drive a vehicle, how to transport yourself around the planet, how to capture enemy bases, and so on. There doesn't honestly seem to be a great deal to it to begin with, and so we decided to dive into the game proper and see what we could see.So we logged in, chose our preferred empire (for the record, we picked the New Conglomerate) and then the look of our in-game avatar, and finally our server of which there are five: two on the US East Coast, two on the West, and one in Amsterdam for us lot. You start off as a lonely and lowly grunt, spawning fresh inside a grey tube in the bowels of some base somewhere without a clue where you're supposed to be or what you're doing. A quick peek at your inventory screen will show that you're wearing pathetically weak armour and carrying a rudimentary pistol. In order to better equip yourself, you need certification points to spend on new skills. To earn certification points, you need to level up a bit. This is where the virtual reality training centre comes into play.So we ventured outside and hunted around a bit for another big grey building until we stumbled across the one with the ~Training~ sign on the side, the only thing distinguishing it from many of the other buildings in what's known as the sanctuary - a kind of safe house for the entire empire, which is impenetrable to the enemy. The VR lets you drive different types of vehicle and try out every type of weapon and armour in a non-combat environment, and each time you do something for the very first time, you are granted a bundle of experience points for it. And experience points, as we're sure you've guessed by now, equal levels (or rather, battle ranks), and these in turn equal cert. points.We were able to gain Battle Rank 3 via the VR training centre, and this set us up nicely and enabled us to pick up some slightly fancier weaponry. A trip to one of the many equipment terminals littering bases around the planet presented us with a menu of guns, ammo, support equipment and armour. Picking suitable armour and weaponry for your tastes is quite self-explanatory - heavy MAX armour types can carry one main, built-in heavy weapon and a wealth of ammo and support equipment which can be dropped for fellow soldiers, whereas the light and nimble armour types can move swiftly (and stealthily with the light-bending Predator-style camouflage armour) but must pick and choose their equipment far more efficiently due to limited space.Eventually as players gain further experience and begin to rank higher through simple combat, the chance presents itself to specialise in certain areas of combat or support. Players who opt for a supporting role can provide Advanced Mobile Stations (essentially equipment terminals and respawn tubes), build up medical or mechanical skills, or even become a pilot, letting players rain death from above and ferrying them straight into raging battles. These can be pretty thankless jobs though, especially given the effort involved in driving and deploying an AMS to the front line, and we found that many players just wanted to get into the thick of things and get their hands dirty.Thankfully, PlanetSide offers plenty of opportunity for different types of combat role. There are the polar opposites of the stealth and MAX soldiers, but in-between you'll get assault grunts riding speedy combat bikes right up to the enemy gates to join the fray, snipers holding back and picking off enemies when they least expect it, and lightly-equipped but highly-skilled hackers who are required to break into and capture the bases.Thankfully, it pays off to become co-ordinated with your fellow troops. Joining a squad of up to ten members, or a larger outfit, is usually a case of merely requesting it, and eventually you'll be invited into one. The benefit of offering yourself up for recruitment is that not only do you get to take part in larger combat efforts for your side, but the experience generated by these battles is spread across your entire squad or outfit. Capturing a base when you're not part of a squad doesn't earn you a thing in the way of experience - you'll merely get more points for your kills, and this is PlanetSide's way of ensuring players work together.Once you get into the swing of things and figure out how best to deploy where you're most needed, the initially daunting experience soon turns into sheer anticipation and excitement as you board some transport on your way to a huge fight. Finding out where to go is merely a case of bringing up the world map, locating the combat hot-spots, then boarding either a HART dropship or a vehicle heading for a warpgate. The HART is a large vessel which docks in your sanctuary every ten minutes. Once the ship launches, the world map pops up and you simply place a waypoint where you'd like to be dropped, wait until you arrive at the chosen continent and join the fun.The latter method is far more co-ordinated and is usually the transport mode of choice for properly instigated attack waves. Large numbers of troops will board personnel carrying trucks and aircraft and head for one of the sanctuary's warpgates, each linked to another island. This enables an empire to literally rain troops down on the opposition. The anticipation is tangible in the chat windows and nervous mannerisms of other players as you all peer out of a Galaxy transport and spot explosions and tracer fire arcing across the ground below. It's when the bullets and guided missiles start to strike the craft that the panic sets in and all hell breaks loose.PlanetSide feels at its strongest in moments like this, when the absolute hell and chaos of war is played out spectacularly through the effort of some 600 players battling it out over a camp of grey buildings. The sense of triumph and camaraderie as the soldiers finally breach and penetrate a base's defences, hack the control console - the heart of each base - and defend its core until the base is captured is very tangible. It's wonderful to feel part of a successful combat effort as you poke your head back outside the base to fend off the last of the struggling resistance, and your support troops are already busying themselves with fixing up the base's terminals and generators, and supplying it with nanites - the juice that the base runs on.But that's pretty much it. Every day you'll log on, perhaps with some mates from IRC or a forum, team up and head off to capture a base, gain some experience, spend it on new skills (or, later on, Deus Ex-style implants which offer improved vision, or faster or silent running and the like), and repeat until satisfied. And this is PlanetSide's biggest downfall, because once you become adept and used to playing 'Musical Bases' with the other empires there's not much else to do, and what starts off as actually quite a fabulous and addictive experience becomes tiresome and repetitive.Triumph in each battle isn't always a case of a well-planned attack either, and more often than not victory is simply dependant on the amount of players storming a base. A well organised and skilled base of players will still be unable to shake off attack from a side reinforced with sheer numbers, and once you realise this then you can start to feel quite detached from the proceedings, realising that actually, it's all quite random. There is no real skill to harness with these weapons; it's all a bit 'shock and awe'. Maybe that's why Sony trademarked it. Or tried to...When we quizzed a few players as to what they would like to see done to PlanetSide to improve it, they were quite vocal in their almost-disappointment. The general consensus is that there simply isn't enough to do to warrant a monthly subscription fee beyond capturing a base and moving on to the next until you've wiped out an entire continent, and coming back the next day only to have to do it all over again. There is nothing to explore, every continent is more or less the same: lumpy with snow, lumpy with marshy bits, lumpy with lava bits... and all the bases are carbon copies of one another. We'd like cities to explore, bars to chat to people in, or homes to go to. There doesn't seem much point to the persistence in PlanetSide's world as it stands, and there certainly doesn't seem much point in paying to play for more than the few short months we can imagine it'll take you to get completely tired of it.SOE is of course promising continued support and content updates, but what have we seen so far? Bug fix upon bug fix, and one new anti-aircraft buggy. One player even suggested that they recode the game thanks to some serious lag issues and the absolutely staggering amount of power required from your system. Our normally well-faring review system was struggling pathetically with everything set to low-detail at 800x600x16, particularly in the larger firefights, and this is a shame because if you've got the machinery then PlanetSide can be a very pretty-looking game with crisp visuals that will enhance the realism of battles twofold.So, do we like it then? As a fairly simplistic FPS that took us back to when Tribes 2 was good and bolted on some fantastic large-scale extras, yes we liked it. In a subscription-based massively multiplayer context, however, we just can't see much point in playing it for longer than a few months at the most. For a persistent world, it's just not very persistent, and the lack of anything to explore or do beyond shooting wildly at the enemy and swapping bases once a day begins to grate after a while. It would be nice to envisage winning someday.Of course it has its moments - some absolutely incredible moments - and we were initially hooked, ready to pile the praise on with a nice juicy nine sat at the bottom. But once you've scratched the surface and delved around beneath, that's when you'll realise that a game like PlanetSide needs constant development and a flow of new content to keep it fresh and interesting. And at the moment, that just isn't happening."}