{"ref": "https://www.eurogamer.net/r-speedkings-ps2", "date": "27 Jun 2003", "game_name": "Speed Kings", "text": "Imagine Burnout 2 with bikes, developed by Climax. It sounds like a winner, doesn't it? After all, with Burnout 2 we get spectacular high-speed races and collisions, almost Ridge Racer-esque physics, a sumptuously detailed graphics engine and some of most entertaining scenarios ever conceived. Crash mode, anyone? And with Climax we get the developer that drove motorbikes from niche to the pinnacle of online console gaming, and equally splendid technology, from the iridescent glow of sunshine on bump-mapped tarmac to flailing riders catapulted like bats out of hell across the path of other racers and into gravel traps.Now imagine Burnout 2 stripped of its excellent alternative race modes and the ability to build up a burnout meter by racing into oncoming traffic, with a game engine based around a few primary colours, invisible walls to bounce off, and a seemingly random crash dynamic. Throw in bike physics that Vice City licks and MotoGP positively defecates on, and you're almost there.In retrospect, we had our hopes way too high, and Speed Kings isn't a terrible game - it's just that it's so easily ignored! Graphically, it looks like an N64 game without the fuzziness. Textures are bland and blurry, but sharply defined, traffic consists of yellow, green, blue and red blocks with wheels and a bit of writing on the front in some cases, and the scenery in general struggles to make any sort of lasting impression.Now, in strict fairness, it does manage to do a couple of things right. The bikes and riders themselves are suitably detailed, and a lot of effort has been spent on retaining their dignity as they clamber onto the handlebars and 'surf' along the track; it's fair to say that the way the bikes kick up rain as they zoom along blustery rain swept tracks is vaguely convincing; and the crashes look sufficiently bone-shattering. But then again if you took the resolution down a couple of notches, it would fit perfectly on the PSone - right down to the occasional fogging and blue strips to represent rain.In terms of gameplay, it's about as bland and uninspiring as anything we've seen on the PS2. You hold X to accelerate, with front and rear brakes mapped to square and R1 respectively, and you can do wheelies and endoes by wiggling the left analogue stick whilst accelerating or braking respectively - anybody with more than five minutes of Vice City under their wings, and we imagine that's most of you, will feel quite at home. You can also kick or punch other riders by pressing circle whilst riding alongside, and along with tricks - which are executed by holding L1 and performing a button combination - these contribute to your ~PowerBand~ meter.The PowerBand is basically a Burnout, and you have to hold R2 to use it - suffering a wide-angled blurry rendition of Criterion's masterful effect in the process. However rather annoyingly, you can't combine successive Burnouts to gain even more speed and raise even more hairs. Indeed, this is your classic use-it-and-lose-it ~turbo~ power-up. Equally annoying is that you can't fill your PowerBand meter in any of the truly exhilarating ways Burnout lets you. So for instance racing into oncoming traffic is just gratuitous and we'd strongly advise you not to bother, and, somewhat stupidly, instead of powering up by accumulating near misses, you actually have to prang (sorry, ~ding~) passing cars in order to do so.This would presumably be all very well if Speed Kings wasn't even more unforgiving than Burnout. Half the time you take a corner you're going to hit something, and the other half you run the risk of being dislodged by another rider or just suffering at the hands of the Gods. The frailty of the bike renders the game unduly hard, and when combined with trucks driving in front of you and swerving vehicles it's possible to drive plenty of flawless races only to get sideswiped by AI-controlled scenery whilst driving straight towards the finish line...Even if you are miles in front, you'll probably still surrender the lead, as your fellow riders wear their artificialness on their sleeves, slowing down considerably or swerving into things in order to let you regain the lead, then keeping up with you even at peak speed. During the course of the game's many overly long races, anybody foolish enough to play will become intimately familiar with the AI's ~adaptive~ tendencies, if they're not too busy wondering why they're bothering.Fortunately for those who do get lumbered with Speed Kings, there is plenty to do, with 'licence tests' as a sort of glorified training mode, time trials, single races, race meets (complete three races well enough to unlock the next three, etc), split-screen multiplayer, a grand prix mode and even a trick mode. But at the end of the day, it copies, it copies poorly, and the only new idea that we can find - if it even is new - is the ~Powerdown~ move, where the ride hits triangle to slide on his side beneath a low obstacle. And even this gets tiring after a while. Other than this the only thing to stave off the monotony is building up ~respect points~ by doing crazy stuff as prescribed before a race.OK, all right, we're being harsh. Speed Kings is vaguely entertaining, and certainly there are worse racers, but with Burnout 2 and Midnight Club II to compete with, it's as if Climax couldn't see the point. Surely being able to perform a handstand, surfing trick or wheelie and hold it for upwards of 1200 feet is a joke? And why is Acclaim now stealing its own ideas? What is going on?As we said at the start of the review, taken alone Speed Kings' various inspirations remain brilliant. Burnout 2 is an arcade racer that everybody should own, and Climax's MotoGP on Xbox and PC is the best bike-racing game there is. But despite borrowing most of its ideas from the former and seizing on the popularity of the latter, Speed Kings is a nowt but the sincerest form of flattery."}