{"ref": "https://www.eurogamer.net/r-warioworld-gc", "date": "19 Jun 2003", "game_name": "Wario World", "text": "As the man himself says on the inside cover of his game manual, ~I've always been stuck in those liquid crystal displays, but not anymore.~ Yes, Nintendo has finally decided to thrust Mario's bulky adversary into the red, green and blue of true console limelight, after years of quirky coin collecting, block-busting and puzzling platform games on various Game Boy consoles. And in-keeping with the big N's current strategy of outsourcing popular franchises to trusted second parties (which seems to be working if Metroid and F-Zero are anything to go by), Wario's first Cube adventure has been concocted by gameplay gurus Treasure, whose 2D shooter Ikaruga - also reviewed this week - is a poster child for playability over pretentious polygons.Those of you pessimistically anticipating a joyless union of Mario Sunshine and Wario Land will be pleased to hear that Treasure has done something vaguely different. Instead of full 3D, the game is played side-on, as Wario moves left to right, right to left, and up and down in much the same way Mario and cohorts used to do in their 16-bit adventures. What characterises Wario World though is the quasi-3D environments, into which Wario can move quite a distance, even though he can't centre the camera behind him or take a look around in the first person.There are 13 levels, split into four worlds of three levels each and a final showdown. Eight of these are platform levels with a selection of important collectibles, some incidental ones, a whole raft of respawning enemies, plenty of coins and a final mini-boss fight at the very conclusion. Four of the others are 'proper', dedicated boss fights which unlock fragments of a key. Once reassembled, the key opens the big treasure chest sitting in Wario's castle courtyard, which houses the tentacled black jewel responsible for transforming all of Wario's treasure into monsters. And Wario wants to smack him 100 times, apparently.As with all platform games, Wario World is packed to bursting with things to collect. First of all there are eight red jewels. These can only be found in puzzle/challenge rooms, which lurk beneath glittering trapdoors (that require butt stomps or piledriver moves to open), and a certain number must be recovered in order to open the end of level goal and access the boss battle. Then there are the various discarded pieces of Wario's golden statues, which alert you to their presence with a ringing, glittering sort of noise, are often hidden just off-screen or in challenge rooms, and once collected add another half-heart to our anti-hero's health meter.You also have to consider lost items of treasure, everything from pots and pans to NES consoles and Ming Vases, found by hitting colour-coded, W-stamped buttons somewhere in the level and opening chests where they materialise on W-stamped platforms of the corresponding colour. Find eight items on every level and you can unlock various Wario Ware mini-games for download to your Game Boy Advance. There's nothing here that isn't in Wario Ware itself - from nose-picking and rope-skipping to shooting aliens and bouncing on a trampoline - and the game bafflingly fails to offer anything to Wario Ware owners, but completists will want to find them anyway.And we're not done yet. Also strewn around each platform level are five black, bouncing boxes. Find these and give them a smack and you'll release a spriteling, the natives of the land or something, each of which offers a tip. Some of these are useless, some of them are not, but if you value the completeness of your end sequence, you'll pick up all five of them on every level before taking on the dark jewel.Aside from all that nonsense, there's the small matter of coins. Every dispatched enemy, and most vaguely secreted treasure chests and out of reach platforms play host to a bit of Wario's treasure, and over the course of the game you'll amass many thousands of coins, with a bonus for completing each level too. Coins are important here, because when that final heart is sapped from your health meter and Game Over looms into view, you're offered the chance to revive yourself - immediately, with half a health meter to work on - for a few hundred coins. The cost of doing so goes up as the game goes on, but upon completing Wario World we'd used many, many continues and still had more than 10,000 coins.Anything else to worry about? Just your health. Garlic keeps Wario ticking over apparently (as opposed to Mario's magic mushrooms), and apart from the odd treasure chest clove, you'll have to invest in your life's herb at irregularly distributed garlic dispensers. And the price goes up the more you buy.Each level is much more than a simple exercise in running and jumping, and they vary in pace and theme, even within each world. The second section, for example, is your typical haunted house theme, or so you think. The first level of the two has you moving through a graveyard clobbering skeletal dinosaurs, rhinos and pterodactyls, hanging onto and manoeuvring to jump off spinning ethereal glue balls as they float from the ground towards inaccessible platforms, fighting sharks in a shallow, murky pool at the foot of a stony church, climbing up and down chains, fighting past electrifying blue doors, taking on various respawning enemies in a 60-second showdown and eventually crashing through the depths of a spooky-looking house and taking on a ghostly boss.After that we expected nothing more than more of the same. These are themed worlds and this is a platform game, after all. But to our surprise, the second level was set in a quirky, psychotic circus with bouncy big-top style music, enormous cannons on three second repeat, glue balls on rotating sticks, electric fences disabled by successfully hitting targets with thrown enemies, giant elastic bands, rhinos in clown suits, caged demons whose hands reach out from behind the bars, charging elephants and even five-pin bowling for a cash reward.Indeed, the game may repeat many of the same elements over and over, but it also enhances them, augments them and even plays on the game's perspective to add to the challenge. We thought our Mario and Ratchet-hardened fingers were getting a decent enough workout in world two, so when the ~Sparkle~ levels asked us to climb along grilled netting, navigate obstacles and overcome invisible enemies blindly, relying only on a mirror image on the far wall, we had to sit up and take notice. And Wario World isn't afraid to break up the play with a stop-and-beat-me enemy like the ice world's ~Angler~, a massive iced-over fish with a weak spot that has to be targeted by piledriving smaller enemies and having them bounce up and hit it like cartoony collateral damage.Probably the best example of this upward difficulty curve is Wario World's secret challenge rooms, which must be beaten to obtain the all-important red jewels. These come in two styles and, to begin with, are simple enough to overcome. On the one hand, the small and enclosed room puzzles have you bashing blocks on a particular side to break them, and as a result creating tiered piles so you can reach a platform high up. Meanwhile the exclusively platformy, mile high alternatives have you leaping between moving platforms and lining up the best place to butt stomp down to the red jewel, amongst other things.Then they both start throwing in disappearing blocks, spiked mines, moving spiked mines, rotating platforms and arrow blocks, which when smacked on one side move in the opposite direction until they come up against a hindrance, sometimes rebounding back again. By the final levels of the game, these will have you trying over and over and over, and it's mercy on Treasure's part that you don't lose a life or heart every time you fall to oblivion.And in a roundabout way, that brings us on to one of our main criticisms of Wario World. Despite upping the ante with each subsequent level's new occupants and spacing garlic dispensers father apart, it's still too darned easy. Although there are lots of enemies, none of them ever has you thinking ~yikes~, not even the really big ones. Some of them have patterns to figure out (like the path-blocking trees with spiked acorns, which can only be picked up and thrown once downed from the tree and picked up by the non-hazardous side), but mostly they're just stupid. You can actually run past most of the enemies in the game, and after a while you will, because you rarely need the coins they represent to add to your total. By the end of the game enemies became a platforming tool rather than an obstacle. KO'ing them became tedious; something we'd only undertake in order to piledrive through iron trapdoors, kill other enemies that bar the way, or reach raised areas by spinning them round - a process of rotating the analogue stick quickly - on platforms that react to this sort of behaviour. Then again perhaps Treasure expects this, throwing in magnet and shovel enemies, which can be hurled at metal panels or soft walls to produce makeshift platforms...On the whole though, some tougher opposition would have countered the game's startling brevity. If you can find enough trapdoors, and you'll usually only have to struggle to find the ones you could do without, you can open the goal and get on with the boss pretty quickly. You don't have to collect the treasure pieces if you don't fancy the downloadable Wario Ware tasters. You don't need the spritelings if you don't care about the sanctity of your end sequence. You don't even need the statue pieces if you think you can survive on four hearts' worth of health (between four and eight hits). And if you duck out you can save all your progress, down to the last coin.And despite employing plenty of ~bottomless pits~ to catch out fleet-footed, impatient or just plain untalented gamers, you don't lose a life for plummeting to your doom, you discover there actually is a bottom after all, and on it is a sort of mini-game, shot from above and behind Wario's head, where the anti-plumber has to smash crates open until he finds the one with the spring in it - the catch being that the crates are on small platforms surrounded by coin-sapping water. Still, it doesn't take much money, the floating ~Unithorns~ are easily stopped if they get a hold of Wario, and ultimately it makes fishing for secret goodies off-screen a lot easier, when it's actually more rewarding to think about the layout, locate the path the game wants you to take and unlock something that way.Probably the thing that we found most annoying about Wario World though was the way it tired you out. For us it was over in about eight hours, and that's having unlocked every red gem, every statue, every piece of treasure, every spriteling and having conquered every boss. And yet, by the time it was over we were hardly clamouring for more. If anything, we were glad to see the back of it. Maybe it was something about the constant repetition of the same sorts of platforming tasks. Maybe it was the borderline cynical distribution of chests and switches, forcing you to backtrack or dive down to the ground floor of a pyramid-style level in order to tag a hidden switch, sacrificing 10 minutes of painstaking progress. But in all probability, it was the overuse of boss encounters.Now, shoot 'em ups, which we'll certainly not deny that Treasure are very good at, can get away with a boss behind every level, and mega, uber bosses thrown in for good measure. Platform games, however, generally cannot. Particularly when almost every single boss (and there are 13 in eight hours, lets not forget) is beaten by the spin and throw move circa Mario 64, even if you have to do something to loosen them up first. Spiders, pirates, sand-dwelling serpents, circus performers - even giant black jewels which epitomise that brand of evil nobody, not even Wario, can get on with - all eventually succumb to wiggle-wiggle-wiggle-wiggle-chuck.This over-reliance on ~boss padding~ is a shame really, because from a technical standpoint Wario World is a masterfully constructed title, blending 2D and 3D without ever looking cheap and shallow in the way Luigi's Mansion occasionally did, and writhing in bright colours and darker, slightly spookier ones. The graphics engine is blemished only by a few moments of slowdown dotted around the game, largely to blame on there being some 15 complicated skeletal enemies on screen at once, but on the whole the game handles everything - even the tricky bits, like mirror image gameplay - without a hint of slowdown or incongruity. Everything looks like Mario Sunshine gone dark, and the eminently listenable soundtrack matches it with its eerie, wacka-wacka tunes that sound a bit like Mario inverted. Heck, Wario World even manages a likeable main character whose catchphrases and repertoire really aren't that funny when you think about it.If only, then, it lived up to the bits it does so well. Of Nintendo's closely overseen second party Cube titles, this is the first one we've felt a bit unhappy about. It's a good, spirited bout of intense platforming for fans of the genre, and neat little, magical touches all over it, like ratings for the height of your piledriver and strength of your spin-throw, but it's not a patch on Mario Sunshine in terms of depth and variety of gameplay and longevity. Treasure may be an excellent, clinically precise developer with a hard-coded adherence to clever structure and gameplay, but it feels like they're not sure who this game is aimed at. It's neither hardcore in the way Sunshine's notorious Pachinko sub-level was, nor accessibly lite like Sly Raccoon. To add insult to injury, the GBA link-up option so expertly interwoven is spoilt by a dearth of interesting prizes, as Nintendo once again fails to sell connectivity.Wario will inevitably be back, and we do hope Treasure is at the helm once again, but what this game needed more than anything was variety and more inspiration than Mario and Wario titles. As it is, priceless moments of its own making are too few and too far between, and although it gets so much right - controls, perspective, distribution of collectibles and level design - all it represents is a good rental or something to buy on Player's Choice in six months' time."}