{"ref": "https://www.eurogamer.net/r-bruteforce-x", "date": "18 Jun 2003", "game_name": "Brute Force", "text": "With so few games publishers willing to go out on a limb and release exclusive titles for the Xbox (unless Microsoft passes around its huge money hat), it's been a frustrating year for those of us who want to see them really pushing the boundaries, and actually release killer content. Apart from the odd exceptions (Splinter Cell, Panzer Dragoon Orta), we've largely had to wait for Microsoft's own first party offering to emerge to provide the really compelling reasons to invest in the big black box. It's been a barren period.Like a self-referential comment on Microsoft's bulldozer approach to the console market, Brute Force emerges from a protracted development process to provide the missing link between Halo and Conflict: Desert Storm. Developed by the previously PC-only Digital Anvil (responsible for Freelancer, Starlancer, and, in the pre-DA days, the Wing Commander series), it's a squad-based all-action balls-out third person run and gun, with only a little room for subtlety amongst the blasting.Playable either in single player, split screen co-op (for up to four players) or over an Xbox LAN (more of which later), the game quickly reveals more than a few similarities to Halo. For one, the tutorial approach is nigh on identical to the Bungie classic, while the controls and the two weapons mechanic also closely mirror Halo's. Similarly, the visuals bear more than a passing resemblance, with some delightful texturing, bump mapping and a level of craft in the design of each of the six main environments that makes exploration a real pleasure. Xbox owners will also be delighted with the widescreen support and some of the best surround sound we have yet witnessed. But despite its seemingly reverential approach, this level of basic quality only serves to ensure that Brute Force is built on solid foundations, rather than attempting to be a pale facsimile.Beyond what is an undeniably slick introduction to the proceedings, the game quickly settles down in an established pattern that runs the course; namely kill, crush, and destroy wave after wave of foes until you've wiped out everything in your path. Although it's not exactly the most complicated blaster we've ever played, the squad-based dynamics lend it a pleasing degree of variety.The four ~highly specialised super commandos~ at your disposal take a few missions to assemble, but once you're familiar with their abilities, you're able to draw upon the distinct special powers on each. Tex, the first member available to you, is a fairly generic muscle-bound hulk of a man, full of throaty quips and sexist asides, but is also the most powerful of the bunch, with the ability to fire both his weapons at the same time. The most likeable of the four, lizard man Brutus, quickly joins the fray, and has the curious ability to draw upon the spirit of Arsene Wenger (we sort of made that bit up), and go into a furious glowing French strop, regenerate his health and literally bowl over opponents. Next up, the stealthy female Hawk can't carry as heavy (and therefore decent) weaponry as her male counterparts, but can cloak herself, sneak undetected into enemy lines and send the opposition to their death with a swing of an energy blade. Finally, the team's line up is completed with sniper specialist Flint, whose ability to split skulls from a distance and automatically target far flung foes make her one of the most crucial members of your posse.Along the way, you quickly realise that Digital Anvil's attempt to drive the missions with a generic Unreal 2-esque sci-fi narrative is a fairly clumsy and an inherently flawed exercise. Apparently bolted on towards the end of the development to give you some sense of character progression, you'll snooze your way through interest-free dialogue as your personality deprived holographic commander attempts to justify why you're being sent to the next killing zone, while members will sometimes engage in conversation at predetermined intervals to give the shooter some personality. But, really, there's little point even listening to what Commander whatshisface is burbling on about, or Tex's sexist crap, because all you really need to know is that you'll have to work your way from the beginning of the level to the end, killing everything in sight along the way.Just as well, then, that the non-stop action works as well as it does. Although in essence all you're doing is fighting off wave after wave of alien scum, it's excellent entertainment for the most part - save for the first few tediously gentle levels. But halfway through the 18 chapters, Digital Anvil realises that it really ought to start challenging its audience, and throughout the learning curve inches up to an almost insane climax.For the first half of the game, it's not really necessary to think too hard about such minor irritations as strategy and planning. Simply picking off everyone with Flint's sniper rifle while the rest of the team picks off the onrushing hoards works a charm in most of the open levels, while two-gun Tex (geddit?) can take care of the more congested close combat scenarios.Death is never a serious business in Brute Force. Simply, if all of your team gets wiped out, you're offered the chance to respawn them at the last checkpoint - effectively offering you infinite lives or continues, and easier still, the game never re-spawns enemies you've already killed.But to simply wade through with mere Brute Force will result in a severe dent in your bank balance, as each time you clone it knocks 5,000 credits off your total, meaning either a poor score, or no score at all. Whether earning high scores will really bother you is questionable, but it is genuinely satisfying and tense to make it through a mission without having to respawn, or to have only lost a few lives.But by the halfway stage, despite the ostensibly simple gameplay, we were utterly sucked into it all and more than happy to begin to adapt our approach. Faced with some stunningly evil enemies, it's a major challenge to make it through without multiple respawns, meaning that you're forced to start actually experimenting with your approach. Pulling off some stealth kills and generally taking your time proves to be pretty rewarding, although issuing orders to your squad can be a fruitless exercise in the heat of the battle. You can attempt to tell one of more of your team to 'Fire at will', be cautious or stay back, but they seem best left to their own devices for the most part.With a few curious exceptions when the enemy just fails to see you at all, the AI is a cut above the general lacklustre fare, and successfully dispatching a well-placed gang of alien thugs can take a massive amount of effort. Squad AI is also largely excellent (except when they stubbornly refuse to follow you, for example), but for the vast majority of the time you're never left feeling that you're patrolling around with a bunch of headless chickens, like you do when you play it with your mates. Fortunately, even when you do get caught out, the game's infinite respawning mechanic means you'll get through even the hardest levels in the end, but you can arguably treat your first play through of the latter levels as a training exercise if you want to play it that way.Being a squad-based game, you'd imagine that the multiplayer elements would be excellent. In a rare organisational triumph, the four game playing EG members got together for a System Link session, each taking one of the characters and playing two-player split screen. Sadly, the game just wasn't designed to throw around the kind of detail we were expecting of it in split screen, and within minutes we were suffering some serious frame rate and draw distance issues - which, coupled with hangovers, weren't conducive to 'fun'.Although the detail level has been reduced in split screen, it obviously isn't enough to make it run smoothly, and introduces some very poor gameplay issues, like being sniped by enemies the Xbox hasn't even drawn yet. Our advice is to not even bother if you want happy memories of your Brute Force experience; just stick to single player, otherwise you're facing the organisational headache of getting four TVs, four Xboxes, and four copies of the game in one room, and how likely is that?Digital Anvil says it would have had to put the release date of the game back to the end of the year to implement Live multiplayer support (it does have two multiplayer maps for download, however), but we can't believe Microsoft didn't insist upon it. With all the ingredients there, it would have been a very compelling reason to sign-up to the service; an interesting squad based gameplay prospect that - played properly - works very well indeed, with some fairly standard deathmatch/squad deathmatch modes (for up to 16 players) to sate the needs of those that just want to shoot each other in the head.On the other hand, like any co-op game, actually getting your team-mates to work as a team, rather than a collection of manic, shooting headless chickens is wishful thinking [particularly when everyone except you is hung over, you don't tell us what the controls are, and you choose repetitive swamp levels for us to play on -aggrieved co-workers]. As such, playing it in this mode is fairly fraught, unless you're all well versed in how the single player campaign works.But perhaps the over-riding criticism of Brute Force is that it should have been an FPS. It seems like Digital Anvil designed it in the third person for the sake of it, without acknowledging that it completely screws up the opportunity to play it split screen, thanks to inherent third person viewpoint issues. There are no jump-related puzzles at any point, and in every respect it plays just like any other FPS ever made, so it's even more head scratching. Maybe it was an attempt to make you associate with whoever you're controlling, or maybe they just wanted to avoid the inevitable Halo comparisons. Whatever the reasoning, it's just not as good an experience as it could have been as a result.If you're prepared to forgive the baffling online multiplayer omission, and split-screen frame rate issues, then Brute Force stands out as one of the most compelling, relentless shooters released this year. It won't win any awards for originality [wanna bet? -cynical Ed], but when you encounter a game as obviously polished as this, it's frustrating that Digital Anvil didn't hold out that little bit longer and deliver us the finished article. But isn't that what sequels are for?"}