{"ref": "https://www.eurogamer.net/r-starfoxadventures-gc", "date": "9 May 2003", "game_name": "Star Fox Adventures", "text": "Rare will likely never make another GameCube game. It's a sad fact,            but Starfox Adventures, completed just prior to the Microsoft            buy-out, will stand as the final serious collaboration between            Nintendo and Rare (save for some GBA titles waiting to have their            fates determined). And with 15 hours of Ocarina of Time-like stick            swinging and a liberal sprinkling of classic Arwing action ahead of            you, you'd think it would make a delicious swansong. However, the            truth couldn't be further from the myth.        It all begins brightly enough. A mysterious blue fox called            Krystal finds herself swooping through the atmosphere of Dinosaur            Planet, trying to find the source of a distress call. Instead, she            finds the source of the planet's distress, and after an aerial            tussle, during which she loses her magic staff, she boards the            nefarious General Scales' beautifully rendered airship and has a            look around. Unfortunately, her benevolence gets the better of her,            and before long she's incarcerated in Krozoa Palace, the would-be            resting place of the six Krozoa Spirits. Without someone's help,            she'll be stuck there for good, and the planet and all its            peace-loving reptilian inhabitants will die.                    And it's here, after half an hour of toiling with Krystal and            learning the basics of aerial combat, then ground-based movement            (left stick), camera use (C-stick), auto-jumping, using            items/explosive barrels and dodge-rolling, that we're finally            reintroduced to Fox McCloud and his team. Fox is a mercenary now,            but he still kicks around with the same crew, and when Starfox team            is chartered to return Dinosaur Planet to peace by retrieving the            six Krozoa Spirits and the four Spellstones, Fox hops in an Arwing            and lands on the surface, beginning a journey which will take him            across the six orbital chunks of the planet and into the damaged            core of General Scales' empire.                    Along the way he'll receive help from Slippy, Peppy and co. via his            communicator. The gang provide tips and tools, and at times it does            feel like a team effort.                    It should be magnificent. Rare has borrowed from past work like Jet            Force Gemini and injected plenty of things learnt from Ocarina of            Time, and the result is a beautiful, accessible adventure of            mammoth proportions, with Lylat Wars-style space combat missions            thrown in for good measure.                    But ultimately Starfox is a poor imitation of greater games. Most            notably Zelda. Anybody who has even looked at Ocarina of Time will            feel quite at home here - so much of it is borrowed. From the            health system (with its quartered hearts, sorry shields, which grow            in number as you progress) and puzzle-filled dungeons which yield            sacred stones, to life force doors (which require multiple enemy            dispatch to open) and the entire combat system, the whole game is            eminently Zelda. Put Link in a fur coat and it's not too hard to            imagine him roaming Dinosaur Planet as you travel around.        Unoriginality is not the foundation of a bad game though. If            that were true then 90 per cent of the games we write about would            be decidedly awful. What's upsetting is that despite three years of            development, despite one of Nintendo's most endearing franchises            and despite delivering beautiful visuals, SFA falls down on account            of stupid little things - like flaws in the combat system. Zelda            had you measuring the distance, blocking as much as you swung and            thinking about it; Starfox can quite simply be played one-handed.            Enemies - even in great numbers - will queue up and take you on            one-by-one, and fighting them is simply a case of hitting the A            button quickly. Thanks to a nice, artful stop-starty effect the            sight of Fox twisting and turning and wielding Krystal's staff like            a lightsaber is enjoyable... for about five minutes. Five hours            later though, and you might change your mind. However, as a            professional games reviewer I welcomed this - thanks to WaveBird I            could play Starfox whilst stirring the pasta, which made my life a            lot easier.                    The more you play, the more you realise that each borrowed idea            seems poorly implemented, like the symbols you have to shoot to            open doors. Another remnant of Ocarina, these have either been            hidden (to frustrate, probably) or stand out like an elephant at a            hamsters-only basketball tournament, and you have to shoot them            with your newly acquired fire attack, losing you ammo rather            pointlessly. On that subject though, it's easy to expend ammunition            like confetti at a wedding, especially with another Zelda            relic, the swarms of irritating bats. It's another example of a bad            move by Rare - fire on them and you're wasting ammo (especially            since they're so tediously hard to target), don't fire on them and            you're wasting health, but they'll respawn in a few seconds anyway            so it's all very academic.        In fact, one could argue that the entire good/evil thing is            pointless - you collect different types of fruit to replenish your            shields and harass plants for weapon-augmenting buds, but these are            in such abundant supply that we made it almost the whole way            through the game without dying. That's 15 hours.                    Other issues range from the in-game store (which is located beyond            a rather pointless virtual obstacle course, and full of items you            have to buy to progress) and the over-reliance on the map            (in the absence of any real feeling of where to go) to a rather            pointless and contradictive story (why, if the planet is actually            going to die, do the locals want payment for their help?!)            and the most awful dialogue in a game since... well, since ever            [Are you sure it's worse than Die Hard Vendetta - Ed?]. I can            understand the need to flesh out the story with lots of talk of            Palace this and Legend that, but why do all the locals (including            Krystal) speak total gobbledygook with the names of important            people and places in English? At one point early on, Krystal says            in a 'not so fast' sort of voice: ~Acky wah blah di blah gah            GENERAL SCALES!~ We felt physical pain.        All that said            though, Starfox Adventures is not a game without redeeming            features, as you must have guessed from the score. Fans of Starfox            will enjoy seeing their favourite characters on a new adventure,            and graphically there's little on the Cube which can compete. The            3D environments are sprawling and laden with incidental detail, and            the characters are decked out in a new fur effect which looks            stunning. The depth of field effects are a bit awkward at times,            but along with the many, many dinosaurs and assorted enemies in the            game, Fox and his companions are all magnificently detailed and            their animation is extensive and very smooth. Thanks to the variety            of locations you rarely get bored of looking at SFA either - it's            the constant running around badly made dungeons in search of a            switch and the exhaustingly repetitive combat which sees to that.            If I did have to make a criticism about the graphics though, I'd            simply say that there's no 'wow' factor. You rarely cast your eyes            over anything and think 'cripes, that's a first'. In a way, it all            comes back to the lack of innovation - such a disappointment from            the team that brought us Lylat Wars.                    Speaking of which! Arguably the most enjoyable aspect of Starfox            Adventures is the actual space combat! Unfortunately, the game is            so heavily weighted in favour of the third person adventure            sections that you often forget that it exists at all, and the game            is structured such that these flying sections are merely brief            rewards for your having beaten off the latest chunk of planet and            recovered another Krozoa Spirit. However, they're great fun,            however momentary - with an emphasis on flying through hoops and            dispatching enemy ships whilst avoiding debris and asteroids great            and small.                    Sadly though, nice visuals and an hour or so of Arwing action isn't            enough to rescue Starfox. It lacks tension (combat is totally            one-sided), set pieces (there are two whole bosses in the entire            game), a gripping story (Krystal's kidnapped, you rescue Spirits,            you fight General Scales), and any of the myriad different things            that the game it principally tries to emulate (Zelda) was so famous            for. What's worse though is that much of the game is filler - of            the fifteen hours, several are spent simply wandering in search of            your next destination. So on reflection, it's not a bad            game, but it's too short, it's too samey and it's just not good            enough. Unless you're a huge fan of Starfox, have a soft spot for            simple, pretty adventures or you're simply a glutton for            punishment, Starfox Adventures really isn't worth the bother. Rent            it for a weekend - that's all the time you'll need and all the            entertainment you'll glean.                            Starfox Adventures screenshots                    Starfox Adventures screenshots                    Starfox Adventures preview (August 2002)                                    Starfox Adventures preview (August 2002)                Starfox                    Adventures preview (September 2001)                Starfox                    Adventures preview (September 2001)"}