{"ref": "https://www.eurogamer.net/r-zelda-gc", "date": "1 May 2003", "game_name": "The Legend of Zelda: The Wind Waker", "text": "Had a look, didn't you? First of all, let me assure you that what you just witnessed was a very, very high nine. In fact, it's so perilously close to the upper echelons of the top flight that it almost feels stingy not to give the game a ten, but at the end of the day I've been wrestling with the pros and cons of that for over a month and this is the right choice for me. The Wind Waker gets a nine. You're probably wondering why.Historically, Nintendo has been the biggest and best supporter of its own consoles. Quite why it persists in making bones about it, refreshing its claims of massive third party support with each successive hardware launch, is beyond us. Nobody really believes it any more. Not even us. But whatever you make of the European marketing machine that made us wait eight months for the console, pushed Metroid Prime back an entire quarter, and will almost certainly never release Animal Crossing [fools!! – Ed], Nintendo does make some very good games. And The Legend of Zelda: The Wind Waker is certainly one of them.It all starts out with babyish charm. Link (this year's model) is a wily scamp barely old enough to attend secondary school, living on a little spec of green in the bottom left corner of the ocean (you'll see) called Outset Island, a verdant, idyllic corner of your friendly neighbourhood fantasy world. However, this world is actually troubled by dark forces, led by the nefarious Ganon no less, which have once again risen up in hope of causing some mischief. The people are obviously rather upset about this.So, every time a young boy comes of age, he is trussed up in green like old-school Link and watched closely for signs of heroism - that he might live up to the prophecy of a saviour. Somewhat tellingly, our young would-be hero's day of reckoning begins with the kidnap of his sister, snatched by a big bird after its intended cargo - a pointy-eared pirate captain lass called Tetra - wriggled free (with the help of a cannonball) and landed headfirst in the local forbidden forest. So that's not one, but two damsels in distress in the first half an hour. Link's clearly going to be busy.As you will know, The Wind Waker is divided into islands, and you spend a lot of the game sailing between them in your big red boat. That's what all those screenshots were on about. There are a number of proper islands, which stand tall out of the ocean and present story elements, new characters and often a dungeon to overcome. As well as these larger landmasses, Link can explore the many corners of uncharted ocean for smaller clumps, which may contain dwellings, people, rupees, treasure, a few blades of grass, or just some of Ganon's minions.But the mainstay of the game is of course intricately designed dungeons, of which there are just over a handful of major ones in the game. Each takes several saintly hours to complete, and they're packed with the sort of genius puzzles that you only expect to find in games of the highest calibre, and hidden extras - like treasure maps that lead you to hidden bounty elsewhere in the world. Each dungeon has its own unique setting, with individual environmental effects (like the heat haze and bubbling lava in the Dragon Roost dungeon) and you often have to use the setting intelligently to your advantage - we'd love to tell you how, but that would definitely spoil the immense satisfaction you get from completing them by yourself. Suffice to say that you should think about how hot things react to the sudden presence of cold things, and how whichever item you've just obtained can be used to affect items in the immediate vicinity. And if in doubt, look up! Link gets a grappling hook pretty early on, and it comes in handy pretty regularly.Along with varied puzzles, we also have differing styles of gameplay, too. The first pseudo-dungeon set in a Fortress is a nod towards the industry-wide invasion of stealth gameplay, as Link creeps around dressed as a Ming vase (Sly Raccoon, anyone?), while the second one is the more traditional 'run, jump and slash' Zelda gameplay. The third and fourth go off on completely different tangents though, and you can always be assured that the next major objective will challenge you in a new way. We honestly couldn't wait to get to the next one, only falling foul of trepidation when we realised how close we were to the very, very end. Aww.The controls and handling of the Link character pay more than a passing tribute to the likes of Metal Gear Solid, too, although much of it simply makes the transition from Ocarina of Time. Automated jumping and all. Of course you can use the left stick to have Link tiptoe, walk or run around, and the C-stick handles camera movements. Swinging it around with your thumb gives you free look, and you can centre it behind Link with a tap of the left shoulder button. Pushing L the whole way down though allows you to crouch and crawl, allowing you to edge through small spaces to hidden chambers full of rupees and other secrets, as do his new sidling abilities (good for nipping along small ledges and leaning round corners).On the combat side of things, Link relies on L for enemy lock-on, R for shield defence, and the context-sensitive face buttons (which - apart from A - are bound via the inventory system to various items) for anything other than the Master Sword. Helpfully, as an enemy lunges, Link is prompted by a little yelp from the speaker and a hazard icon in the top right - a signal to hit A, which pulls off a neat counter that sees Link scoot round his adversary and measure a blow. Enemy AI may not be that fantastic, but they usually put up a reasonable fight, and this element of the game is more about finding a particular foe's weakness and then learning how best to exploit it, rather than expecting them all to dash for cover and fight like Jet Li.The whole combat system is just as intuitive as the counters, with horizontal and vertical slices coming like a snap of the fingers; thrust and jump attacks raining down like sulphur; and the ever-useful 360-degree spin attack taking care of all sorts of problems. Tight spaces? Ha. Of course you won't need to plough through the manual for a grounding in all this, because the game teaches you the basics of combat very early on - via an old codger on Outset Island, who will fight you to various degrees. This raises his opinion of your fighting skills, and that's bound to be worth something, right?Link's inventory is another revelation. You obviously collect series mainstays like the boomerang, bottles (to fill with various collectible elements) and bombs, and promptly come up against puzzles geared towards their exploitation, but you also come across various new additions, not least of which is The Wind Waker itself. Picked up a few hours into the adventure, this magic wand of sorts can be waved with the C-stick, whilst Link selects the rhythm with the left stick, and it allows you to employ the various tunes (think spells) that you discover during the adventure. After equipping it and hitting the corresponding button, you have to hold the left stick in one direction to pick the rhythm (3/4, 4/4 or 6/4 time) and wiggle the C-stick into the right orientation for each beat of a metronome. The first spell lets you choose wind direction, which is crucial in allowing you to sweep across the high seas, and you'll also pick up spells allowing you to control some of the heavenly automatons parked in various dungeons (yet another opportunity for Miyamoto to show off his team's puzzle-building genius), and so on.Aside from The Wind Waker, there are many more objects to get to grips with, including the Deku Leaf, which lets Link float around [even on webpages, apparently -Ed] and fan objects for a time - limited by a sort of wind meter. The Deku Leaf comes from the Deku Tree, see, and you need to make sure you have enough Deku juice or else it'll stop working and you'll fall to the ground. Of course, with the wind blowing in the right direction it can be very useful in finding those hidden rooms that the dungeon map pinpoints for you.Another useful tool in the search for The Wind Waker's many, many hidden delights is Tingle, a rather camp looking and sounding pixie that you find locked up on one of the islands. Tingle is controlled via the GBA (and it's a good excuse for buying that cable), allowing another player to drop bombs on enemies and sections of wall that Link can't get to. Quite frankly, it's engrossing enough watching someone else play The Wind Waker, embellishing their dungeon mastery with helpful hints on how one might solve a particular puzzle, but being able to directly contribute is an excellent addition and we hope Nintendo also does something like this next time out.At one point, the thought popped into our head that we might not even mention the visuals in The Wind Waker review, but such is their notoriety that it would be a crime not to - if only because we feel the need to point out how utterly fantastic they are. You may not like cel-shading. This reviewer too can live without it. But as with anything the competition thinks it has a handle on, if you put it in the hands of this man, he waves a magic wand over it and turns it into the best example in the world of gaming. Zelda's graphics are no exception.Every character looks like something out of a cartoon - except we can't think of any cartoon that's ever used this particular visual style of bulbous heads, reasonably proportioned but swift-moving limbs and tiny feet - it's a style all of its own within a style we've all seen before. And each of them has plenty of wonderfully emotive facial expressions and eye movements to keep things going - utilised by the developer in and out of the various in-game cut sequences. Each outfit, inventory item or weapon Link collects is detailed but not overly so, because Miyamoto prefers to play with the lighting, which uses layers of shading expertly, all over the game world's inhabitants and environments, which are themselves just the right blend of detail and simplicity.Of particular note are the various animations. It's amazing how lively the world is - even at sea, which suffers at the hands of a day/night cycle, a weather system, cyclones and other, darker troubles which afflict different areas of the map. It's even better on land, and the contrast between the townships (lively, with flowers flapping in the wind, people wandering around and things going on) and the dungeons (which do feel abandoned) is a testament to the strength of the atmosphere. Ramble ramble ramble.Unlike Ocarina Of Time, which was stunted by the N64's lack of texturing skill, The Wind Waker looks beautiful throughout, its buildings and townships decked out obviously but smoothly, with the rippling, frothing, writhing ocean always in sight and a sea of lush foliage on land too. Earlier this year we said that gaming has hit the heights most cartoons aim for, and we agree with that to a certain extent - The Wind Waker's environments and animation are certainly moving in that direction - but the depth of field effects (very much akin to the reflections in Mario Sunshine, actually) still cast a gamey shadow over everything.We can hardly let you go without mentioning the bosses. They aren't always that difficult to overcome, but by God do they look awesome. Right from the Outset [wink], they all fill the screen with menace and for a good few seconds you'll be worried by their sheer girth and intricacy, never mind that you only have a few heart containers to spend figuring out their undoing…And complementing the awesome visuals are the usual array of fabulous Zelda sound effects and tunes. The new tunes are as memorable as ever, mixed in with the classic eight-tone success jingles and themes that will have you wiping tears of nostalgic love from your eyes. Ahem. As you'd expect, Nintendo hasn't gone for voiceovers or anything absurd like that, preferring to preserve the innocence and elegant childishness of gibberish expressions - which despite being nonsensical do convey enough emotion.Also throughout the game we get bursts of sound effect skill, like the pang of music that greets a clash of blades, and the orchestral chants of the Wind Waker itself. If anything, one of the things that really makes you think of Zelda as a cartoon is the way Nintendo has organised its sound effects.We shouldn't have gone into the graphics really, should we? They are, like most of the rest of the game, totally absorbing, snug-fitting and passionately constructed. Not a pixel wasted. Visually speaking.But despite our love for 90 per cent of The Wind Waker, it's also one of the most intimately flawed games in the Zelda series. It is, in our opinion, the first title to feel cynically stretched out. We can't fault much of what happens on dry land, but Link's seafaring is nowhere near as entertaining as it should be, and you'll watch whole hours evaporate into the salty air as you plough through the high seas. Combat here involves halting to fire your weapon of choice, and it's maddening that you can't fire your bomb cannon on the go, or drop bombs like depth charges in your wake, or even have Tingle drop them. On the whole, you err on the side of avoidance rather than confrontation, which marks a change for the series.Certainly, your wise old boat is a poor substitute for Epona, and the buccaneering approach is barely comparable to the average trek through the Hyrule of old. A good example being an ongoing reluctance to go searching for treasure - you regularly unearth hidden treasure maps in dungeons, but it wasn't until halfway through the game we bothered to go and find any. It's just such a chore to go anywhere, even after you obtain the warp device, and given the sheer amount of time you spend at sea, that's a black mark for sure.We also grew tired of The Wind Waker itself. The metronome/C-stick technique is to be applauded, but we quickly grew impatient watching the unskippable animations over and over again. The camera, too, is frustrating, requiring regular attention as it ducks into walls on occasion and generally evades the optimum angle, and though we've always liked the method of binding inventory items to face buttons, the design often demands one more item than there are buttons on the GameCube pad. Perhaps Shigeru Miyamoto's a Dual Shock fan.Another question that crept to our lips as we sauntered through was: is this too easy? On the whole, 25 hours into it, we're of a mind to say 'no'. Yes, you can overcome many of the challenges the game sets you with limited difficulty, but it's a mental challenge that The Wind Waker poses, not strictly a gameplay one.However, as must be plainly obvious, we're besotted with The Wind Waker in ways that we can only begin to explain. We could stand around all day talking about it, and if our bosses didn't crack the whip so much, we probably would. It makes us feel happy and gleeful about gaming again. And you know, even when you think you're playing it thoroughly, you'll stumble across things in one of the latter dungeons and think, ~well, cripes, that probably applies to all of them~. Did you use Tingle everywhere? Did you find the Pictographs? Did you help the Koroks water their trees? Despite failing to create a rounded world where every last pixel counts, Shigeru Miyamoto and his team have packed the world with subtlety outside the main quest that will take many months and probably several lengthy replays to truly uncover, and it is an adventure you can see yourself playing again and again. Not the best Zelda game, then, but utterly brilliant all the same. And the best is thrown in on a bonus disk anyway."}