{"ref": "https://www.eurogamer.net/r-marioparty4-gc", "date": "1 May 2003", "game_name": "Mario Party 4", "text": "When Mario Party appeared in early '99, it was one of the pioneers            of the party game genre, but the second game in the series,            released a year later, was arguably the best. Now it's 2002, and            Hudson is throwing a whole new party, with 50 original mini-games,            five whole boards to traverse, support for four players and an            optimistic ~Story Mode~ to fill the hours between multiplayer            parties. But is it really any different to what's come before?        Like its predecessors,            MP4 is a board game starring Mario characters - Mario, Peach,            Luigi, Donkey Kong, Daisy, Yoshi, Wario and Waluigi - who dart            around one of five twisty-turny board designs collecting coins.            Different squares prompt different reactions, adding and            subtracting coins and mushrooms from your tally, or triggering one            of the various mini-games. While the object of the game is to amass            the most coins and purchase stars by landing on the right square,            and the person with the most coins and stars at the end of the game            wins, most of the fun is in beating your friends at various            mini-games.                    There are 50 mini-games in MP4 - a bit of a decline after the            70-odd in the third and last N64 release - and they vary            tremendously, with free-for-alls, three-on-ones and two-on-twos, in            skiing challenges (outrun an avalanche), drag racing and other            peculiar events. It might seem a little odd to gang up with your            competitors in some cases, but when tussling for an even share of            the points it makes more sense to do this than to sulk in the            corner.                    There is one consistency amongst these games, and that's a simple            control scheme. Almost without exception, button-bashing,            reflex-testing and simple moves make up the requirements. You can            win most of them simply by mastering the one button, but that            doesn't make them any easier. If your reactions are crap, for            example, you're going to lose out quite often.        Many of the additions since Mario            Party 3 are purely incidental. The general flow around the board is            still quite steady and balanced, but now you can pick up Mega or            Mini Mushrooms to hasten or stifle your progress. Mega Mushrooms            double your size, hand you an extra die per turn and let you swipe            10 coins from anyone unfortunate enough to be in your way. Mini            Mushrooms do much the opposite, shrinking you and limiting you to            die rolls of 1-5, but allowing you to fit through pipes, thus            opening up some desirable short cuts around the board...                    Not all of the additions make sense though. The new reversal of            fortune space is a totally pointless addition which prompts a            mini-game and somewhat randomly robs the player of his or her coins            or stars. Which is a bit unfair.                    And although the five boards are obviously different, they're all a            bit too big. Mario Party 4 is played at a glacial pace at times, as            each players moves and moves and the mini-games roll around,            animations are played out and little cut sequences punctuate the            silence. The problem is that interest wanes very quickly in a group            of four, and it should be a lot faster to react to moves and load            sequences, particularly since it's a GameCube title. In good news,            you can now save your game anywhere, but how likely are you to            resume a four-player game if a few of you get bored?        Although Mario Party 4 is a lot of fun to begin with, it            quickly becomes too tiresome to be entertaining in a group. Turning            to the single player aspect though is certainly not the answer. The            so-called ~Story Mode~ is basically a normal multiplayer game with            three CPU adversaries. Unfortunately, no allowances have been made            to minimise the time you spend watching their turns - the CPU            treats its kin just as real players, and lets them carry out their            turns, mini-games and so on at the same snail's pace. And of course            they aren't within slapping distance, so there's no way to prompt            them to get on with it. Perhaps most maddening though is that in            the absence of human error, the outcome is totally arbitrary - it's            rather like playing Patience (or Solitaire if you like) without one            of the aces.                    On the bright side, Mario Party 4 looks stunning compared to its            predecessors. Character designs and animations are a lot smoother            and quite intricate, and interaction with board elements - like            Mario's trademark 'butt stomp' on blocks - fits like the plumber's            silky white gloves. One should also raise a glass to Hudson for            giving each of the many, many mini-games a distinctive look. It            would have been very easy to cut, paste and airbrush in many cases.            Sadly though, that seems to be what's happened in the sound            department - you can trace some of the oohs and aahs and jingles            and jangles back to the 80s if you try hard enough...                    There's nothing bold about the moves Hudson has made with Mario            Party 4. Some are reasonable additions, some are a bit daft, but            most of the game is only vaguely removed from what's come before.            The mini-games have different faces but they play ostensibly the            same, and even with the visuals buffed to a sparkle the overall            effect is very much 'more of the same'.                    If you have a few pals coming over for an evening, MP4 is the            perfect game to wheel out, but on a system which already plays host            to Super Monkey Ball, Sega Soccer Slam, Super Smash Bros. Melee and            many other party-able games, it's only an also-ran. And unless you            regularly have four well-palmed pads plugged into the front of your            Cube, it isn't worth picking up.                            Mario Party 4 screenshots (Cube)                                    Mario Party 4 screenshots (Cube)                                    Mario Party 3 screenshots (N64)                                    Mario Party 3 screenshots (N64)"}