{"ref": "https://www.eurogamer.net/r-rayman3-gba", "date": "1 May 2003", "game_name": "Rayman 3: Hoodlum Havoc", "text": "Many moons ago, when everything Nintendo touched turned to gold,            the idea of the GameCube and GBA co-existing in link-up heaven            seemed fantastically innovative, and provided gaming possibilities            that would finally see the convergence of handheld and console            gaming.                    Despite the hundreds of titles available on the GBA, and the scores            on the Cube, less than a handful of titles spring to mind that            offer link up possibilities: Sonic Adventure (less said the            better), Animal Crossing (only importers need apply), and Metroid            Prime/Fusion. For all Nintendo's bluster, it's hardly the gaming            revolution we were promised, and third party publishers have            largely ignored the idea.                    Until now, with the resurgent Ubi Soft making a big noise about the            linkage in Rayman 3. But will you want to cough up around £75            for the privilege? We've already aired our thoughts about the            GameCube version here and            reckon it's one of the best platformers you can get on the format.            Simultaneous multi-format releases tend to result in us overlooking            the Game Boy Advance, but given the hype we were keen to check this            one out - especially given that our SP's still looking at us with            those 'play with me' eyes.                    But before we get into the finer points of link up gaming, some            background. The Dark Lum Lord has turned all the Lums of the world            into gun wielding, trench coat wearing Hoodlums, and by a bizarre            twist of fate Rayman's sidekick Globox has swallowed the leader of            these evil fuzzballs. With the fate of both the world and his buddy            in the balance, it's up to the limbless freak to seek out the three            Teensie doctors and free their imprisoned pals.                    As you'd expect, the handheld version of the game has reverted to a            side scrolling 2D affair, and closely resembles the original Rayman            Advance - one of the three biggest sellers during the GBA's summer            2001 launch. For anyone unfamiliar with the first Rayman GBA            adventure, the visuals are a cut above the standard handheld            quality, and are not far off the PSX original, which makes a change            from the deluge of 16-bit shovelware that we're subjected to on a            regular basis. They're extremely colourful without being garish,            cartoony without being twee, full of incidental detail (such as            butterflies fluttering about), and topped off with a garnish of            parallax scrolling (remember the days when that really impressed            people?). The animation is also up to the same high standard, and            on a technical level it's a very good advert for the system.                    Gameplay wise, it's no revolution. The basic idea is to clear each            of the 50 levels of imprisoned Teensies, dispatch the baddies and            pick up the yellow lums on the way. Red lums restore Rayman's            health, while green lums act as a mid-level save point. Fortunately            once you've picked up a yellow lum, or rescued a Teensie, it's            collected forever, so there's no need to torturously replay every            level even if you've lost all your lives (unlike the nasty,            unforgiving full blown version, we bitterly note). The game is a            mixture of standard left to right platform antics, with the            occasional sub-game thrown in for good measure - which don't            outstay their welcome, while offering pleasant, albeit simple            diversion from the main game.                    The controls are somewhat stripped down too, with the A button for            jump, (tap again for helicopter blade to slow your descent), B to            shoot Rayman's fist (double tap to shoot both of them), or to grab            onto the purple lums. R breaks the ground, while L allows Rayman to            climb between walls, and the D-pad controls movement. All round,            it's a fairly uncomplicated, but eminently playable and addictive            platformer that is tougher than you'd imagine, and has great            longevity.                    So what of the link up? Well, you'll have a job even getting the            thing working for a start. For a kick off, the GBA manual is            spectacularly vague in revealing where the GC link menu is. The            game menu itself offers no clues, and only by complete accident did            we discover that running Rayman left off to the World Map allows            access to this menu. Oh, of course. How silly of us. After that,            it's a piece of cake - and basically acts as the means to            downloading one of 11 extra maps from the GC to GBA. For every 100            lums you're rewarded with another 'world' to download, so there's a            decent incentive to progression. After connecting up the GBA/GC            link cable (sold separately), and booting up Rayman 3 on the Cube,            it's simply a case of entering the GC's GBA Extras menu, and then            selecting your level of choice from the GBA screen. Although you            can't save them onto the cart, you can then unplug the cable and            play your chosen level on the GBA for as long as you like.                    Meanwhile, the GC version has one co-operative link game available            that does not require you to own the GBA version (although,            annoyingly, if you do have the cart plugged in, the game            does not work!). By simply going to the Mini-Games menu, and            selecting the game with the GBA icon next to it, the game downloads            onto your GBA in about 20 seconds, and involves the GBA player            playing Tetris while your GC buddy drives Rayman (in one of his            shoes, bizarrely) on the 'track' your mate is building with his            Tetris blocks. It's hardly the sort of stuff to revolutionise            gaming as we know it, but there's a fair amount here that your Xbox            and PS2 mates won't get to mess around with, and the fact that you            don't have to own the GBA version is a nice touch.                    There's one further mode to comment on - multi-player. There are            four fun, but lightweight games to choose from: Tag (punch your            opponent, run away), Burglar (tagged player must avoid being            touched for a minute), Bumper Car Race (come first, win the game),            and Bumper Car Arena (last man standing wins), but the latter mode            only unlocks if you find every cage in the game, which is no mean            feat. The necessity of each player to own a cart is going to mean            finding mates to play with will be very difficult. Why do            publishers nearly always demand this?                    To sum up, you get a twee platformer, multi-player and bonus            levels. We weren't overly excited, and doubt you will be. If you're            a hardcore Rayman fan and were going to buy them anyway then it's            certainly a nice bonus to be able to mess around with, but for            anyone else, we'd strongly suggest you stick with the full blown            version. £75 for the pair is pushing it a bit, although if Ubi            and Nintendo had come up with some kind of value bundle, it'd be a            different story, and maybe somewhere down the line this will            happen. Taking the game in isolation, it's a very pretty, highly            playable, but run of the mill platformer, and no-one's pretending            otherwise. Rayman 3 neither comes close to toppling the mighty            Mario games, nor gives a compelling argument for the merits of            cross console link-up gaming, but platform addicts will be well            served. The more demanding gamer won't be."}