{"ref": "https://www.eurogamer.net/emily-is-away-too-review", "date": "9 Jun 2017", "game_name": "Emily Is Away Too", "text": "Emily is Away Too is a choose-your-own-adventure masquerading as a knock-off instant messenger from the early 2000s. For a certain subset of people, it'll also likely be dizzyingly nostalgic, invoking memories of staying up late, exchanging music, and hoping no one shouts at you to free up the phone line.More than anything, however, Emily is Away Too is committed to its aesthetic. From the faux-installation screen to the counterfeit social media services to the way the game creates actual text files on your desktop, it all comes together to build a surprisingly vivid sense of immersion. The first time I saw a familiar name and a familiar icon in the game's buddy list, I jumped. I hadn't expected Emily is Away Too to pull from my Steam rolodex of friends but it did, and you know what? All these details do add up.Seriously, look at that YouToob link. You could argue that it isn't particularly interactive. You can only click on the video and a few hyperlinks. But I loved the fact that there are comments from one of the game's characters, that we have the Numa Numa guy sitting there in the box, the Evolution of Dance. Shoes. And it is rather charming that the Newgrounds link actually does lead you to small, playable titles on the actual Newgrounds site.But what about the game itself? Under all the bells and whistles, Emily is Away Too is a relatively straightforward experience. Broken into five chapters, it sees your protagonist interacting with two girls - Evelyn and Emily - over the course of several months. Talking to them is simple enough. You click on one of three possible options and watch as your character types out the sentence, sometimes backspacing through bouts of adolescent anxiety. At least, that's what happens if you've got type assist turned on. Otherwise, the game will have you mashing at your keyboard, each keystroke producing another letter from the pre-determined response you've chosen from a list. (It's clever but considerably less fun than it sounds.)The rest of the interface functions much the way you'd expect one of these old-school chat clients to work. You can click the links you've been given, change your avatar, edit the quotes displayed in your profile, alter your font color, paint your background black as sin. You can click through your buddy list as well, but there's not much to do there except giggle over the stylistic excesses of the late 90s. Emily and Evelyn are the star attractions here. And what stars they are.Both girls come across as happily believable; insouciant teens feeling out the last days of their adolescence, afraid and excited for what the future will bring. Their play-acting at cool is largely endearing, especially after the introductory chapter. Like any normal human being, both Emily and Evelyn take their time to open up, and when they do, it's hard not to care about them.It's not perfect. Occasionally, the writing falters. Exposition sometimes takes precedence over character building, and the dialogue rings a little false. Similarly, the girls sometimes feel predictable, more archetypes than individuals. Evelyn is very much the punk with hidden depths, Emily the gamer girl with a vision that'd take her far away from this little town that you share.But the problems are relatively minor and they didn't detract from my enjoyment of the game. Especially not once the drama got going. Without giving too much away, Emily is Away Too does very clever things with its use of timers and Telltale-style 'X will remember that.' The finale caught me completely off-guard, a bittersweet bad ending (I'm pretty sure there are a few more) that had me wincing at how one small mistake could ruin everything. It hurt, something I wasn't expecting. I'd played the game in chunks, breezing through the conversations with the girls, only half-heartedly invested in chatter about music and other people's boyfriends.But as it turns out, the little things do matter.Emily is Away Too had me walking away from the last chapter feeling like I'd been kicked. For the ghost of a moment, I caught myself thinking, ~I need to call X. I need to make this right.~ And it is hard not to endorse a game that leaves such a strong impression."}