{"ref": "https://www.eurogamer.net/r-cvs2eo-x", "date": "1 May 2003", "game_name": "Capcom Vs SNK 2: EO", "text": "~The awesome sequel to 'The Fighting Game Of The Year', Capcom vs.            SNK,~ Capcom proudly boasts of this one. Indeed, that would be a            good claim, if it weren't for the fact they probably mean the year            1999.                    If it weren't for Live, we'd be a bit stuck for what to say about            this Xbox port of Capcom Vs. SNK 2 EO. It hasn't changed more than            a bit since its outings elsewhere, and if you've owned a major            console other than Xbox in the last few years you've already made            the decision to either own it or ignore it. The question is, does            the online element thrown into the mix here make enough of a            difference? Join me, gentle reader, as some of you already            literally have, for a journey into the world of online fisticuffs.                    And if one particular recent opponent is reading this, I can            throw a dragon punch to save my life, and I don't live with            in my parents' basement. I don't think we even have            basements in England. Your Mother, however, informs me that you do.        So: CVS2. Let's refresh. This is your basic 2D beat 'em up in            pretty clothes. Capcom has been making them for years. This one            could just as easily live on the PSX, Saturn, or even Super            Nintendo really, apart from the scrolling 3D backgrounds. It has            over 40 characters, from Street Fighter, Final Fight and            Darkstalkers on the Capcom side to Fatal Fury, Samurai Showdown and            King of Fighters in the SNK camp. Many of the characters are clones            of one another or at least similar enough to be considered the            same, though, so don't expect quite such a massive selection of            styles and abilities.                    But what of ~EO~? On the Cube, it was ~Easy Operation~, but here EO            stands for ~Extreme Offence~, according to Capcom, because it gives            players of questionable skill access to special and super modes at            the touch of a button. Which is exactly what it did before. The            idea is that by selecting an ~EO-ism~ for your character, you can            use the buttons on the right of the pad to perform special moves.            The game determines the strength of said manoeuvres depending on            how hard you tug the left or right triggers. So instead of wasting            hours trying to pull off Chun Li's spinning bird kick, you can just            hit a button and watch it happen. Alternatively, players can choose            the ~AC-ism~, which behaves more like you'd expect, with basic            soft/medium/hard punches and kicks and lots of quarter-circle            motions and button combos required to pull off specials and supers.                    Not content with that, Capcom complicates matters further with the            ~Groove~ system. There are six grooves (C, A, P, S, N, K) to            choose from (as well as your -ism), and each has a specific            structure. 'A' groove, for example, lets your use the combo style            from the Street Fighter Zero series, freely mixing and matching            moves to create custom combos. 'N' groove, meanwhile, lifted from            King of Fighters '98, gives you three levels of 'super' gauge and a            sustained boost in strength thanks to 'Power Max'. Each groove has            its own strengths and weaknesses, and with more than 40 characters            you could spend months experimenting. 'Could' being the operative            word. Thanks to the traditional tenets of arcade, versus, survival            and training modes, and even a colour edit mode to fiddle with            Ryu's pants, there's also plenty to do with each character - all            this before you even hook up to the net.        But it won't be long before you tire of playing with yourself.            The single-player modes aren't enough to keep you going forever,            especially if - like me - you've played them before, so it's very            likely that you will hook up to the net just as soon as you get the            hang of slinging a fireball with Controller S (which is a lot            easier thanks to the six button config!). And with so many fighters            and combat styles, surely CVS2 is perfect for online play…                    Realistically though, you're going to want to specialise and seek            bouts on the net which allow you to cut your own style. Going for            the quick match option in the Live menu (which feels awfully bolted            on, we must say) will be punished by 'server' players, who set the            rules. If you just dive in without trying to find something that            fits your game, you're at an immediate disadvantage. The trick is            to shop around for a bout or even start your own and wait for a            challenger.                    And on the whole, CVS2 is mostly what it sets out to be.            Bouts are relatively lag-free (admittedly I ran into problems here            and there, but I spent much of my time with CVS2 pre-European            release, playing against American teenagers, so that's forgivable),            players are legion and of a fairly high calibre (enough to pummel            me more often than not anyway), you can continue playing against            one another for as long as you like, the game is pretty good at            handling unforeseen interruptions, and with a few minor flaws aside            (like being unable to see your opponent's Gamertag during bouts),            it's pretty smoothly done. The ability to screen against people            using the EO-ism (which isn't really appropriate for online play)            is also a nice inclusion.                    In fact, although we spent most of the weekend playing one of            Capcom's other, somewhat spookier releases, CVS2 is literally the            only disc, which has sat in my Xbox over the last fortnight. The            ability to just pick it up and immediately play somebody new has            the same sort of allure that Quakeworld did back when Wireplay was            fashionable. Playing other people just adds something, and it's a            novelty that won't wear off for quite some time. But then            again…        Here at Eurogamer, we're ardent Capcom apologists. And            recently, we've felt somewhat vindicated. OK, in the past we've had            very little in the way of innovation, with an increasing number of            ports, marginal updates and yes, a slew of backward-arsed PAL            conversions. Things have changed, though. Some wise overlord in            Japan decided that making new games might be an idea. Sure, some of            them weren't the best, notably Auto Modellista, but some of them            almost were, like Devil May Cry and Resident Evil Zero. With four            original franchises due from Capcom's new Shinji Mikami-led            sub-drama in the next 18 months, a new, less PSX-based Resident            Evil title due out in 2004, and games like Steel Battalion            inspiring the hardcore, we're a lot better off than we used to be!                    With this newfound variety in mind, Capcom's decision to play safe            with its first online Xbox game is almost forgivable - almost, but            not quite. Capcom Vs. SNK 2 EO may be a fairly good beat 'em up,            but this juxtaposition of old and new isn't the avant-garde fighter            that Xbox Live needs right now. Heck, if all developers and            publishers are planning to do is inject replay value into old            games, then why don't they just chuck multi-player patches onto            Xbox Live and be done with it? Have us all sign in to a central            lobby server and download bolt-on replay value for our year's worth            of Xbox back catalogue. That's what happens in the PC world.        Capcom can sleuth out of that one with an apology for not            releasing any new beat 'em ups since the Xbox's inception, but            nevertheless CVS2 is very easy to throw abuse at. Anybody who owns            a PS2 or GameCube has had access to it (and in the PS2's case            several much better beat 'em ups) for ages. Furthermore, anybody            with a Dreamcast has had better fighters and a huge            catalogue of Capcom beat 'em ups to choose from, including this            one, for three years!                    But multi-player is something we almost always commend when it            comes to beat 'em ups. The only reason it isn't of paramount import            in every case is that very few of us are in a position to spend the            whole time playing Versus Mode. (I don't think any of our            readers are Siamese twins, or possessed, or anything like that,            though we do have a few split personalities…) So CVS2 becomes            a lot more attractive thanks to Xbox Live, and online play is            mostly excellent - and as long as the game sells there should be            plenty of local opponents to help you dodge the dreaded lag.                    Don't kid yourselves though: the only thing that raises CVS2 up and            above the likes of Dead or Alive 3 or even Mortal Kombat: Deadly            Alliance is its online element, and I'll only really recommend it            until a beat 'em up developed within the last three years            makes its mark on Xbox Live. But given that DOA4 is about the only            thing on the radar, that could be a while, and there's a world of            random strangers out there to dragon punch and throw finely honed            verbal abuse at in the meantime. So if you're 'Live', then go            ahead, buy it. You probably should, because online play adds more            to CVS2 than we'd ever imagined possible.        Capcom Vs SNK 2 EO                    screenshots (Xbox)                Capcom Vs SNK 2 EO                    screenshots (Xbox)"}