{"ref": "https://www.eurogamer.net/prey", "date": "7 Jun 2017", "game_name": "Prey (2017)", "text": "How do you add intricacy to a genre as fearsomely intricate, as batty with systems, variables and knock-on effects as the so-called ~immersive simulation~? One of Prey's answers to that question - and I promise this isn't me feeling around for a headline - is to add a bit of Minecraft. Folded in amongst the game's roster of Jedi uppercuts, fire pillars, remote hack attacks and prototype beam weapons is the ghostly suggestion of an in-game map editor. Consider the Recycler Charge - it looks like just another grenade, and can indeed be treated as such, but rather than blowing loose objects and enemies apart it sucks them in, stripping and compressing them to pleasing, Duplo-sized blocks and balls of generic raw material. Pop the latter into a Fabricator - the clunk of a resource cube sliding home is immediately addictive, like the cartoon pop of a bullet impact in Call of Duty - and you can 3D print a new weapon, item or object, providing you've unearthed the right blueprint during your forays. You can also drop random junk into a full-sized Recycler to whip up a batch of resources without wasting your precious Charges. In either case, the resulting items don't just materialise in your inventory but cascade from the output hopper - a show of pure delight in the illusion of physical matter undergoing magical reassembly.There's also a touch of freeform level construction to the Gloo Gun, one of the first tools you'll acquire, which can be used either to swaddle agile enemies in quick-setting cement, or create walkways along surfaces, ~cheating~ the level design much as you'd plant blocks along a cliff face in Minecraft. It's all representative of a game that is significantly weirder than the presence of shotguns, door codes and med-packs may suggest.Prey's title is a franchise fig leaf: the game has little in common with Human Head's 2006 shooter (or its aborted 2012 sequel) - though Arkane pays tribute to the original's vaunted dimensional portals with ~Looking Glass~ displays, flat holographic recordings that, story revelations aside, contain the odd hint about a safe code or hidden door. ~Looking Glass~ also, of course, points to the System Shock series, the new Prey's biggest inspiration, though there are echoes of Arkane's own Dishonored in the unfurling of your power wheel and the emphasis on combining abilities.The game takes place in 2035 - following an alternate 20th century in which Kennedy survived assassination and NASA had a lot more funding - and is the tale of rich-kid scientist Morgan Yu, who wakes up one morning to find that all her (or if you prefer, his) colleagues are being gobbled up by extra-terrestrial wraiths known as the Typhon. If Morgan is the protagonist, the game's star is very much its space station setting, Talos 1: a kilometre-long slab of gold and glass in lunar orbit, which resembles the offspring of Alien's Nostromo and a luxury art deco hotel, equipped with a glistening multi-storey lobby, a plush sales department (complete with naff foam dart office toys) and an ornamental garden, alongside cacophonous reactor chambers and not-entirely-legal research labs. It's an absurdly magnificent edifice, perhaps the grandest and most beautiful facility of its kind ever imagined for a game, though coming from the art team behind Dishonored 2, this is hardly unexpected. Every chamber, blind corner or overlook is a mesmerising study in light, colour, texture and period detailing, from the radiance-filled tunnels that let you space-walk along the facility's immense spine, to the Tesla blues and Soviet reds of its many hardware workshops. Every object, from the silky touchscreens of Talos 1's terminals to its tastefully compact foldaway turrets, is an elegant, variable balance of style and function. To meddle with the furnishings in however tiny a way seems outrageous, like doodling an email password on the bottom of Michelangelo's David, but meddle you must if you're to amass the means to battle the Typhon and access Talos 1's many barricaded compartments. Still, it's hard to resist lingering over the nuances. With a deadline bearing down on me, I once spent 10 minutes trying to replace a whiteboard I'd accidentally grabbed hold of exactly as I'd found it, annoyed at having ruined the symmetry of a scene.Not all the furniture will take kindly to being manhandled. Prey's most original foes are the Mimics, wispy spiders who are able to assume the shape of any loose object of roughly the same mass - a nasty trait indeed in a game where you'll spend lots of time picking up and setting aside things like baseball gloves, test tube racks and wrecked circuit boards in search of ammo and door keys. The Mimics are programmed as much to get on your nerves as to attack you, often breaking off an encounter to scuttle around a corner and transmogrify with a triumphant squeak and clatter. Advancing, you'll squint at innocent-looking pairs of objects, take careful aim at one of them and wind up your melee attack, only for an unsuspected desk lamp to hurl itself screeching at your face. It's another mark of Arkane's delight in the idea of reconfigurable matter, though the nod here is to John Carpenter's The Thing rather than Minecraft.The Typhon are both a threat and an asset: scanning each variety with a Psychoscope (obtained a few hours in) unlocks branches on three funky, extra-terrestrial skill trees on top of your starting Science, Security and Engineer upgrade paths. As you probably already know if you've been anywhere near a trailer, the pick of the Typhon unlocks is the ability to mimic matter yourself, skittering around as a coffee mug or jar of organ samples in order to slip through a window hatch or avoid detection, a wonderfully whimsical sight in a world strewn with gruesomely disfigured corpses. Beyond that, Prey's abilities and customisation options aren't terribly unusual for an immersive fantasy of this stripe: a mix of hacking and repair skills, elementally themed attacks and abilities that sabotage, deceive or flip a target's allegiances, plus the usual passive stat buffs. By the time you grow seriously conscious of this, however, you should be thoroughly absorbed in the minutiae of Talos 1 itself.There are quests aplenty - a main plot arc which sees you working out whether to save Talos 1 or destroy it to prevent the Typhon spreading to Earth, and a number of missions to help surviving station residents or delve a little deeper into the surrounding narrative. All keep you hurrying to and fro across the facility, which gets a little laborious (particularly when Arkane repopulates cleared areas with tougher enemies) but is an opportunity to savour the consistency and plausibility of both the station's architecture and the lives preserved within its email accounts, post-it notes and audio diaries. You're free to head in pretty much any direction once you've made it to the station's lobby area, pushing past obstructions as your blossoming skillset allows, which means you're free to piece together Prey's assorted backstories in any order. There are some lovely asides and melodramas to glean alongside the genre-standard sinisterly bitten-off answerphone messages: the on-going mystery of Talos 1's ~Reployer~ devices, which everybody seems to have but nobody seems to quite understand; inter-departmental power struggles and bickering over resources; a boffin's attempts to hide his failing memory from his assistant. Tucked beneath one stairwell I came across a janitor's stabs at composing a love note to another character, way across the station. You'll also get to know a tabletop gaming group, with amateurishly illustrated character sheets to collect as you explore Talos 1's living quarters and recreation areas. The latter setup is one of many allusions to the game's ending, which is, without giving too much away, exactly the outcome you'd expect from a sim in the System Shock tradition. That said, the over-arching sentiment that a game is fundamentally a way of teaching empathy deserves a longer analysis.Sadly, the more you get to know Talos 1, the more you'll have to reckon with the limitations of Prey's first-person combat, its most significant downside. Part of the problem is that Morgan moves like she's pushing a shopping trolley through ankle-deep treacle, which often makes it hard - or at least, tedious - to do anything more elaborate than halt and shoot, swing or hide. But the larger issue is that Prey's various combat gizmos and gambits don't react together as gratifyingly as those of the Dishonored games. For the most part, it's a question of two-part combos - lobbing a Nullwave emitter to shut down a Typhon's paranormal abilities, for example, then polishing the target off with a kinetic blast or a couple of Q-Beams to the kisser. The combat is at its best when you eschew gunplay entirely - combining terrain elements such as turrets or volatile gas pipes with powers or abilities that distract, disable or bamboozle. One of my personal highlights came when I had to deal with a sort of giant amoeba engulfed in radioactive spores, lurking at the bottom of a depot in micro-gravity. Rather than floating down to engage it head-on, I found a couple of turrets in the area above, hoofed them through the access hatch and sat back as they spun crazily, vomiting rounds in all directions. For every moment like that, though, there's a moment where you're hustled into a corner and obliged to chug food items (Morgan's trim figure belies the insane quantity of junk you'll have her eat) while firing point-blank into clouds of tortured flesh and mist. Much as the abilities don't quite knock together, domino-style, so the Typhon never quite offer a challenge worthy of a Dishonored player's ingenuity. Each breed has its surprising qualities, but none of them are as devious as their seething visual design would suggest. The Mimics are a thrill when they're playing hard to get, but when they aren't, they're just a bunch of glorified molerats, nibbling on your knees as you lay about yourself with your wrench. Similarly, the agile, aggressive Phantoms are hair-raising at first - and elite specimens switch things up with the ability to self-duplicate, electrocute you at short range or carpet their surroundings with fire traps. But all of them ultimately fall before the dread power of the one-two combo, and beyond that you've got a selection of half-hearted bullet sponges - obese octopods wallowing around in mid-air with an escort of possessed machines or humans, and a giant biped that can be either laboriously worn down or hidden from until it loses interest. Prey's enemy ecology survives comparison with BioShock's Splicers, but the likes of Dead Space's sliceable, inter-dependent Necromorphs knock the Typhon into a cocked hat.There's the sense, at times, that Prey is another jumble of exotic raw materials thrown into a Fabricator, a button's touch away from brilliance. But if the chemistry between powers, terrain variables and opponents may fall short of Arkane's best work, the setting's gravity and the charm of certain individual systems are enough to pull you through to the finish. The new Prey began life under a cloud - to be specific, the cloud kicked up by the demise of its Human Head predecessor - but in Talos 1, Arkane has fashioned one of the greatest virtual environments, as ornate and soggy with hubris as BioShock's Rapture, yet far more open-ended. And in the mercurial applications of Mimicking, recycling and the Gloo Gun, there are tantalising hints of something arcane indeed."}