{"ref": "https://www.eurogamer.net/r-shiningsoulb-gba", "date": "30 Apr 2003", "game_name": "Shining Soul", "text": "RPGs. I get excited about RPGs. I steal them away into my bag and race home, boarding up my doors and arranging elaborate traps and puzzles to withstand intruders. However after an hour or so with Shining Soul I switched off the electrified cattle grid, tied up the swinging tree trunks with attached knives, and took the ten-pound note out of the mousetrap. It's really not worth the bother.It says ~RPG~ in the genre box, but it's really not. Role-playing games are renowned for their engaging (or at least expansive) plotlines, diverse characters and locations, progressive combat and intricacy. Shining Soul is notable because it singularly fails to live up to anything that's come before it. There was a time when RPGs were a bit like this, but even then they proved vaguely entertaining - however else did they inspire titles like Final Fantasy VI and Chrono Trigger?That said, Shining Soul does at least dispense with random battles, opting instead for a real-time combat system, and a very seat-of-your-pants, no pausing, you're in this until you're dead or victorious method of level design. You take control of one of four characters (warrior, archer, wizard or the close-combat favouring Dragonute), and traipse through various dungeon-type stages, each endowed with a multitude of similarly ineffectual nasties. You slash them with A, backing off between blows to avoid being hit yourself, and pocket the spoils (herbs, scrolls, weapons, etc) for use or sale later on.Between levels, you pop back to Prontis, where the various other members of the Shining Fleet are assembled, waiting for you to prove yourself so you can all take on the nasty Dragon which holds the land in a vicelike grip of pure evil. But if you're looking for a plot, then we've just spoilt the entire thing. Apart from a few passing mentions from the end-of-level bosses, a brief intro cinematic is all that's made of the plot, so the entirety of the game is spent buying and selling junk in the village, struggling through a dungeon, beating a boss and then doing it all over again. Or dying and losing any cash not stored in the village, then doing it all over again.We felt guilty about giving up on games like Breath of Fire II before the best bits of the story made themselves evident. We felt positively cheated for every minute we wasted on Shining Soul.If we're completely honest, there are nice things and OK things to be said about it, but barely any of them concern the mainstay - the game's simplistic combat mechanics. The graphics are quite nice, certainly on a par with most 16-bit conversions/updates we've seen, but the character models are fairly poorly animated - particularly the enemies and weapon-swinging actions of the main characters, which regularly expose a dearth of frames. The levels, too, are all fluffy bushes, pale greenery, rocky dungeons and so on, in a style that Squaresoft well and truly licked a decade ago.On the plus side, the levelling and inventory systems are quite good, the former giving you the option of spending your experience points as you like, and the latter giving you simple control over your character's weapons, armour and so on, but there are too many shop vendors to worry about, and it's sometimes tricky to work out why you can't equip a certain weapon or item. The good bit, actually, is the ability to bind up to three weapons/items to each arm and then have them cycled via shoulder buttons and used with A or B.But you can hardly sell a game on the strength of its inventory system, and apparently that's what Shining Soul aims to do. Otherwise it's left relying on its combat (ironically even more repetitive than turn-based random battles), its storyline (what storyline?), its visuals/audio (come on now), its multiplayer (which would be fun if it wasn't a multi-cartridge job - nobody is going to buy this, let alone twice), and its longevity (20 hours is only 20 hours with no mid-level saves and hundreds of spawn-out-of-nowhere enemies).On the whole we're deeply disappointed with Shining Soul, and pity anybody who trusted the peculiar 5-7s out of 10 we've seen awarded, which all seemed eager to sing its praises just because it's got a Sega logo on the box and looks like an RPG. Hardcore? Don't be fooled, chaps. Maybe, somewhere, deep within the bowels of the hardcore gamer there's a desire to play endless, sprawling, repetitive games which offer no motivation to continue, but really, if you're looking for a hardcore RPG status symbol, then pick up Breath of Fire II or Golden Sun - or buy Zelda, because that's a real-time RPG done right."}