{"ref": "https://www.eurogamer.net/r-vietcong-pc", "date": "30 Apr 2003", "game_name": "Vietcong", "text": "War. Huh. What is it good for? Absolutely nuttin' sang the late, great Edwyn Starr, slightly naively. You see, what Mr Starr failed to realise is that all that mass death, misery, fear and destruction would, one day provide a perverse form of entertainment based on the harrowing events of past, present and even future conflicts. God bless the first person shooter, and all those who lose themselves in its bullet-spraying madness.For years, publishers have been foisting WWII-based FPSs down gamers' throats, and we're quite sure this isn't going to stop any time soon. But with the advancement of technology comes… foliage. And what better use of all this greenery than to simulate everyone's favourite rock n' roll conflict, Vietnam? Movie makers have been mining this subject matter for decades, but now it's the turn of a myriad procession of likeminded developers to show us how hellish this futile war really was, starting with Pterodon's long-awaited Vietcong, ably assisted by fellow Czechs, Illusion Softworks.As with last year's rather lamentable Soldier of Fortune II, the name of the game is to duck and dive through a series of jungle-based environments and pop a cap into the chops of anyone that dares get in your way. But while SoF II had you picking your way through leafy environments on your lonesome, Vietcong puts you in control Steve Hawkins (no, not him), a slightly gawky, big-nosed Sergeant, in charge of a five-man team, each with their own special abilities.Prior to each mission, you're briefed back at the base camp in Nui Pek, a few miles from the Cambodian border, with an animated sequence that sets the scene nicely - not quite as cinematic as Illusion's Mafia, but not far off. It's not all that necessary to pay 100 per cent attention at this point, as one thing you get used to very quickly in Vietcong is that things rarely go to plan.When setting off on any of the 12 main missions, you almost expect the unexpected, as befits the wayward and unpredictable setting. Choppers crash en route, POW rescue attempts fail, tunnels collapse during routine inspections - it's chaos most of the time, and your intel is not what it could be. But it's this venture into the unknown that makes Vietcong gradually more and more compelling; because you're never quite sure what sticky situation you’re going to end up in next.The game itself sports a pleasing amount of variety, with various on rails sections that have you firing at the fleeing Gooks from a helicopter, or a boat, or even driving a jeep en route to a mission. It's hardly up there with Operation Flashpoint in the variety stakes, but we're not complaining. Weapons though, are well represented - for those that care about such things. Not only does the two-pronged system of aiming work very well, the ability to only carry one pistol and one heavy weapon adds a layer of strategy to a much overlooked area of FPSes.The presence of a squad certainly helps inject something extra into the game. Although it's stretching the bounds of credibility, the same five squad members stay with you throughout the game, and unlike the generic clones that accompany you in, say, Black Hawk Down, you start to build up a recognition and affinity with your buddies. Although sometimes you're forced to go it alone, for the majority of Vietcong you're accompanied by a Point man, (a guide/booby trap scout), a Medic, an Engineer (explosives expert and ammo provider), a Radioman (for communicating with the base), and a Machine Gunner (to provide heavy fire support). It's up to you whether their services are called into action, as you can charge off ahead regardless, but your game will probably be fairly short-lived if you think you can take on a posse of heavily camouflaged VCs on your own.Vietcong requires a fair amount of co-operation with your squad. Use of the Point man not only will help reveal where the Gooks are hiding out, but will also save you the embarrassment/annoyance of constantly falling into pits filled with excrement-tipped spikes, or blowing yourself up stumbling over trip wires. Most crucially, it's vital to holler for help to the Medic, as you'll be riddled full of holes more often than not, and medi kits are sparse to say the least.Achieving help from your squad mates can be achieved in one of three ways; either by pressing one to five on the number pad, hitting X and commanding them to adopt a specific tactic, or simply hitting the 'use' key on them when you're near them; but like we said, you can get by without them if you think you're clever. Regardless, the presence of the squad adds an immense amount of atmosphere to the game, with dozens of jubilant one-liners emanating from them in moments of triumph, always guaranteed to raise a smile in the heat of the battle (~We've f***ed them up good man!~ and ~Rock and mother f***ing roll!~ being particular favourites of ours). Likewise, in moments of panic, various members of your squad will whimper for medical attention like frightened children with a grazed knee, or yelp for more ammo, or let you know where the next enemy advancement is coming from.As an audio experience, Vietcong is possibly one of the best games we've ever heard. Not only do the weapons all sound suitably meaty, the whistle effect when an explosion goes off nearby (to simulate deafness) is superb, as are the ambient effects of the jungle, and the gut wrenching screams of agony when you die, or suffer extreme pain. The voice acting isn’t much to shout about, but in all other respects Vietcong's audio is supreme - in particular the occasional use of music.Vietcong certainly taps into the rock n' roll subject matter in a clever and subtle way that has never been exploited in any other first person shooter we can recall. Although it's no Vice City in its extensive use of back catalogue, it does make ingenious use of limited resources, with an air guitar selection of late '60s tunes. Kicking off with a gorgeous 'Little Wing' inspired lick for the menu theme tune, the intention to create some period ambience is truly impressive. Between missions, fictional DJ Jonah Jukowski [what, no Robin Williams? -Tom] blasts out an uncanny mixture of licensed tunes and extremely clever parody versions of famous tunes of the era.Amongst the four licensed tunes, we get an obscure Deep Purple cover of 'Hey Joe', along with The Stooges classic 'I Wanna Be Your Dog', while the station cycles through a dozen or so inspired rip-offs that neatly dodge the need to expensively license every single one, while retaining the period ambience. Keen-eared listeners can't fail to notice the similarity to the likes of Hendrix's 'Manic Depression', The Byrd's 'Eight Miles High', as well tracks inspired by The Kinks, The Velvet Underground, The Rolling Stones, and Sly And The Family Stone. If we were to be really pedantic, we'd point out that many of the game's tunes came out after the 67/68 era, but we're sure you're not that bothered.All this wittering on about the music might seem unnecessary, but for those of a certain, ahem, vintage, it really does elevate the game's atmosphere above and beyond the norm, and helps differentiate Vietcong from the pack. Well done Couchlife and Nimrod for providing one of the best gaming soundtracks we've ever heard.Visually, however, Vietcong varies from being exceptionally good to downright poor. The engine itself copes reasonably well with depicting the jungle environment convincingly, but for every time you're impressed with your surroundings, you're questioning why some elements of it are so bad. At its best, Vietcong creates a lush, foliage-laden, varied and thoughtfully designed set of levels, especially when you stumble across the temple ruins. But just as often, the glaring flaws in the engine come screaming to the fore, with some horrendously uninspired texturing conspiring to spoil the effect.Likewise, the relatively pleasing character models are just as inconsistent. On the one hand, the tiny touches such as the hand motions when danger is near, and the way that your squad will occasionally kick a dead body to make sure it's dead are excellent, but then the effect is ruined by some of the worst incidents of clipping we've ever seen. Characters walk through one another like ghosts, flop haplessly into the scenery when dead, and generally lack the kind of convincing animation you expect from a PC-exclusive game in 2003. And with Id's Doom III engine just around the corner, you can't help but fear that Vietcong will look very dated very quickly indeed.To compound the issue, the lamentable path-finding issues so prevalent in Illusion's Hidden & Dangerous rear their ugly head again, albeit four years down the line. On admittedly rare occasions, we’ve found ourselves stuck on the scenery, obstructed by our squad mates in tunnels and trenches, and been thoroughly irritated by poor AI when your Point man refuses to lead the way, and shaken our heads at the sight of men regularly jumping like buffoons into the scenery.Some of the tunnel-based solo mission will have you tearing you hair out with frustration too. One question to Pterodon: why? They add nothing to the game, and wandering around a bland maze will try the patience of a saint.The jury's still out on the multiplayer, but with the various modes included (Deathmatch, Team Deathmatch, CTF, Assault Team Game, Last Man Standing, Real War - CTF variant -, and an intriguing Co-op mode), there's plenty to get your teeth into.But if you can bear to put up with the obvious lack of polish in the graphic and AI department, (similar bugbears that Hidden & Dangerous players will confess to), then there's a very absorbing FPS to get to grips with here. The intensity of the atmosphere is more than enough to compensate for the flaws, and there are enough supremely tense set pieces that drive you on and on. Add to that the superb audio, excellent weapons system and fact that the Vietnam setting is still a novelty, and the plusses start to push the niggles further into the back of your mind. With a decent engine, and some sharper AI, Vietcong could have been a must have single player classic, rather than the rough diamond that it has ended up being."}