{"ref": "https://www.eurogamer.net/r-crimsonsea-x", "date": "30 Apr 2003", "game_name": "Crimson Sea", "text": "Crimson Sea. Could be about anything, that. The most important            thing though, surely, is that it has nothing to do with Blood Wake.            In fact, this one's from Koei, masters of ~Romance of the Three            Kingdoms~, and drags the developer's trademark thousand-unit            battles into a sci-fi, anime-inspired setting, with ludicrous            cleavage, bright spiky hair and wacky translations - with wacky            voice acting no less.        The game tells the story of Sho, a fairly conventional anime            hero with the aforementioned prickly red crown, a mysterious past            and a thirst for adventure. Along with his distressingly young lady            friend Yangqin (it's platonic, honest), Sho traipses around the            galaxy knocking seven bells out of aliens and tickling the            underbelly of society for a few loose coins.                    That is until we meet him, and he picks up a peculiar job            from a voluptuous tartlet in a very revealing dress for a            disproportionate wodge of cash. Fishy though it seems, Sho and            Yangqin hop to it, scouring some gunmetal grey back alleys and            fighting off hordes of Mutons - water-based enemies (get it?) of            the dragonfly, bug, spider and liquid blob variety - with pistol            and sword. At the end of a few fairly boring rooms, Sho faces off            with a fairly generic screen-filling liquid blob boss, easily            defeated with a bit of evasion and button-bashing.                    The game is pretty good at easing you into the whole story,            starting off with a montage of scenes and fight sequences in and            out of the game engine, allowing you to meet the characters, get to            grips with the control system, and work out how to fight with blade            and blast attacks of the locked on and manual varieties. Each level            or sequence introduces you to something new, and by the end of the            first three levels (about 45 minutes work) you'll be well and truly            ready for action.        But before we get onto that, let's deal with the basics. What            we have here is a fairly common or garden third person action game            with some borrowed quirks and very pretty graphics. The player            controls Sho from above and behind using the left analogue stick.            Forward moves forward, back shuffles you backwards, and left or            right turns you. But, infuriatingly, it's a Resident Evil take-off,            meaning that you can't change direction and move at the same time.            The only means for doing this is a dash command activated by            holding B firmly and prodding a direction, and the only means for a            hasty retreat is to tap B to perform a 180. Imagine how annoying it            gets when the game mistakes your tap for a press, and so on.                    Fortunately, the camera is locked dead on behind you, and when you            get too close to a wall or caught in a cramped room, your character            (and accomplices) become transparent, allowing you to keep an eye            on your target. For what it's worth, you can also wiggle the camera            around manually with the right stick, but it always returns to the            centre when you let go - giving you the optimum view of your often            very pretty surroundings. Levels are packed with detail, to be            sure, although we quickly grew tired of the grey textures, but the            sight of a thousand bugs swarming over crisply detailed anime-esque            characters is very impressive. Think Starship Troopers.                    Back to the gameplay though, and mercifully the Evil control scheme            is diluted by the trigger functions; left for strafe (sorry,            ~shuffle~) and right for lock-on. With the left trigger depressed,            you can strafe left and right whilst moving as you like, allowing            you to scarper pretty hastily without having to stop and adjust            your direction around obstacles all the time. And with the right,            you can keep your sights honed on a particular target and            circle-strafe it. On the whole, the triggers save you from the most            annoying quirks of this bog standard control template, but there            are still problems: in boss fights, for example, you frequently            want to target the main creature but can't, because the targeting            reticule hops from the boss to its various underlings like a            hyperactive flea; and for a game which demands quick reactions and            lots of blood-letting, having to pause to turn your character at            any point is a stupid design decision, let alone in the face of a            deviously patterned boss.        Crimson Sea may be a third person action title, but it wants to            be an action RPG. Your health bar sits along the bottom of the            screen along with the magic meter; you gain experience from using            spells; you have party dynamics to worry about; you can upgrade            your weapons and construct new ones from various elements; and            between levels you retire to a Pioneer 2/PSO-inspired concourse            with vending and save game robots, a crew of sci-fi clichés to            talk to and various new mission briefings to pick from.                    As it turns out, Sho is the only Vipa in his home system of            Theophilus, and this means along with a sword and a gun, he can            channel magical power via ~Neo-Psionics~. As the game goes on, Sho            picks up new abilities, and he can equip these to the white button            on the Xbox pad, allowing him quick and easy access in the midst of            battle (and its neighbour the black button isn't bound to 'reset            console' or anything daft like that for once).                    With plenty of options, combat can be quite varied. Enemies turn up            in huge numbers, but often take only a few hits each to dispatch.            At a distance, you can pop them with your gun (X), but it's more            fun to wait for them to swarm and instead employ your multi-swipe            blade attacks (Y). Each swipe of the sword can cut through multiple            enemies, and whether they're in front or behind you, they'll take a            hit if the sword lashes them - and you'll quickly rack up            big-numbered combos, which equate to a points reward at the end of            the level and more money to spend back at base. With all these            methods of destruction and the often-radial last ditch ~slaughter            'em all~ Neo-Psionic attacks, you're rarely short of ways to kill            your prey, but even at that you're not alone.                    As quickly becomes obvious, you shouldn't just ignore the little            band of CPU characters wandering around at your heel - you can            organise them into formation using a mid-battle menu screen, and            they'll more than earn their spurs if you stick with them.            Otherwise, they take quite a pounding and quickly use up all those            medical kits you bought back on the ship. Having a rag tag            assortment of colourful but petulant sci-fi clichés to keep            track of might not sound fun, but they help raise the combat - very            much the mainstay of the game - above a lot of similar titles.        But having said that, we                 still didn't find Crimson Sea any more exciting than a hundred                 and one other action titles. This is partly because the                 control system is a bitch, partly because the storyline is                 fairly boring and partly because there isn't much innovation.                 OK, you can hunt around for different weapon parts, and                 having, say, a long barrel on a heavy weapon makes for a sort                 of BFG 9000 meets lightsaber combo, but the game doesn't                 combine RPG elements with third person action as nicely as,                 say, Devil May Cry, and it doesn't have the overall integrity                 of games like that either.                    The characters, for example, are pretty one-dimensional and            stereotypical - the women bitch about one another and show more            flesh than they hide, and the blokes are generally broody, camp or            downright cowardly. And the script is truly cringeworthy at times,            seemingly penned in places by people who do not speak to other            humans. Meanwhile, level design is based around old standards like            shepherding a stupid NPC through an alien swarm, eliminating all            the enemies in an area to unlock the next, ~rescuing~ compatriots            and then teaming up to make it to safety, and so on, and the            challenges you face generally comprise overwhelming force and,            ahem, moving walls. What's more, the prize boss fights are like an            assault of first-generation GeForce tech demos. ~Why are we            fighting a big floating blob which envelopes us occasionally?~ we            mused, as we tried to get our character facing in the right            direction for the seventieth time.                    If we had to liken Crimson Sea to another game, we'd probably opt            for Unreal 2. It's better than that, sure, but despite melding            various elements of risible action games together with RPG            mechanics, without so much as a seam showing (glorious 60fps, too),            the game doesn't take a single step forward. If a historian looks            back in 100 years and wants a good example of the third person            action title, this one has everything in abundance - but they'd            have trouble working out where the genre went next. There are no            clues here."}