{"ref": "https://www.eurogamer.net/r-splintercell-x", "date": "23 Apr 2003", "game_name": "Splinter Cell", "text": "After all the hype, the plaudits and the TV ads Splinter Cell            hardly needs much of an introduction. But is it another compelling            reason to own an Xbox, or a pretty but overrated attempt to depose            the mulleted Solid Snake from the stealth action throne?                    It's hard not to be seduced by the game's visual splendour, which            set new standards in almost every area. From the first moment you            set eyes on Splinter Cell, it impresses with its intricate level of            detail, which is given even more credibility by the most exquisite            use of light and shadow we've witnessed in a videogame. The            animation and range of manoeuvres is handled very deftly too, and            the camera rarely acts like the drunken cad that so many third            person games trip themselves up with. Add to that some marvellous,            delicate touches, such as the way curtains and blinds react to your            movement, as well as the night/thermal vision aids, and it add a            gloss to an already slick package.                    The cut scenes are also well realised, in a mock CNN kind of way,            although they're not quite in the same league as the Hideo Kojima            epics for visual polish.        If it wasn't for the absence of a native 16:9 widescreen mode,            this would be the best looking game on the Xbox (and therefore a            console), but sadly, forcing the game into widescreen makes            everything look very odd indeed, making characters look fat and            accentuating jaggies. 4:3 TV owners won't be concerned in the            slightest, but for the growing number of Widescreen TV owners, the            lack of a 16:9 mode is extremely irritating.                    Great, so it looks absolutely stunning. There won't be many of you            willing to argue this point, but most of you will be hoping that            Ubi has bothered to conjure a game to match the eye candy, and the            answer is perhaps more complicated and contradictory than you would            necessarily hope.                    Being a game entirely reliant on stealth, the key to enjoying            Splinter Cell is to have a patient nature, be persistent, and above            all pay attention. If you're the kind of gamer that likes to rip            through levels gung ho, killing everything in sight, then you will            probably find Splinter Cell unforgiving and eventually irritating,            because you'll die a thousand deaths trying to get through even the            training missions. We're of the pretty patient persuasion, and even            we found it hard not to throw the Xbox pad out of the window on            several occasions. Per level.        But you'll            also love Splinter Cell for being a challenge in an age when            videogames have all the interaction of a fairground ride. For the            most part you're expected to guide Sam Fisher past patrolling            guards while avoiding detection, which is harder than you might            expect - especially with an extremely limited amount of ammo, or in            some cases no ammo at all.                    Also, the bad guys aren't just patrolling drones for you to pick            off. They react to light and sound in a fashion we've never seen in            a videogame, so if you want to get by undetected, then sticking to            dark areas, eliminating light sources, and generally being quieter            than a mouse is the way to go. Occasionally, though, you might            actually want to make a noise in order to coax a guard away from an            area that you need to access, and through clever use of cans and            bottles you can craftily lob them wherever you want them to            inspect, and quietly tip toe your way past them while they're off            investigating the source.                    Charge off like clod hopping elephant, though, and you'll soon be            rumbled by your increasingly suspicious and usually heavily armed            foes. A noise meter lets you know exactly how much racket you're            making, but in most cases it's just best to only run when you            absolutely have to. Even the material you're walking on has an            impact on the noise you make when you walk, so sometimes you're            best to stick to softer ground to slip by undetected.                    Naturally, there are wall mounted cameras abound, but you can            either shoot them out or dance past them while they're pointing the            other way. On the occasions when incapacitating your enemy is the            only option available to you, there are various strategies to be            employed even here. Creeping up behind them quietly gives you the            chance to grab them in a headlock, drag them off and club them over            the head when you're good and ready. Failing that, a headshot            normally takes your victim down in one, while if all else fails a            quick couple of blows to the head will suffice if you're all out of            ammo.        Whatever you choose to do, hiding the evidence of your            misdemeanours is often essential, but Splinter Cell offers plenty            of dark corners and cupboards for you to dispose bodies into,            ensuring those pesky, meddling patrolling guards won't raise the            alarm. Your carelessness almost always gets you into trouble, so it            definitely pays to be thorough.                    When you finally get past a section that's been bothering you,            you'll feel like dancing a celebratory jig it's so sodding            rewarding. With the absence of a ~save anywhere~ facility, you can            opt to save your progress via a series of checkpoints dotted around            liberally around each level. Sometimes, however, these checkpoints            aren't as evenly spaced as they could be, with two appearing one            after the other, and then forcing you to negotiate huge tricky            sections in one piece.                    Unless you're following a guide, then Splinter Cell certainly won't            be one of those games you can polish off in a weekend. Sometimes            the fun is in working out the solution to the problem - although            even when you do know what you're supposed to do, carrying it out            is notoriously tricky. So many things can go wrong, and inevitably            they do. Our advice to anyone who gets stuck on the game is: don't            look up the answer in a walkthrough - stick with it. Sometimes it's            as simple as performing a manoeuvre you've long since forgotten you            could perform, or just being incredibly patient. It's not that            Splinter Cell is hard, as such, but sometimes it's hard to know the            right route to success. Once you've mastered certain sections,            you'll ask yourself why you found it so tough in the first place -            and repeated plays will no doubt allow ninja gamers to show off and            tell everyone how they completed it in three hours or some            nonsense. But trust us when we say that this is a game you'll            really need to persist with to crack.        The            control system, fortunately, rarely lets you down. It's a well used            system that has a lot in common with console first person shooters,            with movement controlled with the left stick and camera/turning            with the right. With all the weapon and the numerous movement            controls mapped intuitively, you're very soon comfortable with the            system. Considering how many controls there are, it feels            incredibly easy to use, while the analogue controls are as            sensitive as they should be - allowing you to make minor            adjustments while you're creeping along.                    The range of moves is certainly worthy of applause; Sam Fisher does            all the usual stealthy moves such as peering around corners,            climbing, dangling from ledges, crouching, etc, but new moves such            as being able to do a                        split jump between walls and climb along pipes mounted            horizontally allow for some cunning level designs, as well as            looking smug in their own right. The gadget count is impressive            too, with the optical cable allowing you to peer through keyholes,            a cunning 'force feedback' lock pick system. Meanwhile, the slow            appearance of the weaponry can be irritating, but when new            firepower does finally show up halfway through the game, it doesn't            disappoint.        Naturally there are some flaws. As good as the AI is, there are            times when gaping holes appear in it. For example, relatively early            on you're expected to point a microphone at an ascending lift, and            once it gets to the top three guards burst out of a room to attack            you. However, if you choose to just head for that room first, the            three guards just stand there looking gormless and don't attack            you. Elsewhere, you often see guards getting stuck in repeating            animations that can result in you having to restart your progress,            while the process of grabbing guards in a headlock seems sometimes            overly unforgiving - forcing repeated restarts when it shouldn't            really be necessary.                    Fisher's certainly a less irritating lead character than the            rambling supposedly enigmatic lunacy of Konami's bandana wearing            hero. For those of you who found the endless codec and FMV            sequences of MGS2 a deathly bore, Splinter Cell does a much better            job of keeping you involved in the game, rather than trying to wow            you with convoluted cinematics. Although the story is hardly Oscar            winning, it makes a whole lot more sense if you can be bothered to            pay attention to the FMV and the numerous notes that you find            scattered around. It is quite amusing how hard Ubi has tried to            make Sam Fisher look like George Clooney, though. He should sue!                    But will you want to part with your cash? If you're even remotely a            fan of the Metal Gear series, or fancy a cutting edge stealth based            game then the answer is, of course, yes. If you find trial and            error based games hugely annoying, and haven't got hours to spare            learning the intricacies of each of the nine levels, then you'd be            better off trying before you buy. At the very least try it - you            might just like it, (and frankly it'd be rude not to), if only to            admire the delicious visuals on display. We reckon it stands tall            as one of the games of the year, and along with Halo one of the            main reasons to own an Xbox - although a PC version is due out at            the end of January."}