{"ref": "https://www.eurogamer.net/r-segabass-ps2", "date": "24 Mar 2003", "game_name": "Sega Bass Fishing Duel", "text": "Despite the attention of an over-zealous father, sitting by a river            freezing our nuts off never really appealed. Even worse, sitting in            a leaky boat in the middle of the night, fearing for our lives;            surely this is as close to madness as you can get? And what's this?            Sega's made a third Bass Fishing game? Are we missing            something?                    As you know, fancy peripherals brighten up even the dullest games,            and anyone who had a Dreamcast couldn't fail to be intrigued by            that fishing rod peripheral. The fact that we now have fishing rod            controllers for two separate formats is either worthy of small            celebration, or means we deserve to be locked up for semi-worrying            behaviour. The sight of grown men whirling round a pretend fishing            rod is the stuff of every woman's nightmares. Probably.        But if you can lock your doors and have no shame, then maybe a            spot of mindless fishing fun in front of the TV isn't such a            ludicrous proposition. This time you can even indulge in two-player            split-screen fishing, with the usual claims of ~smarter AI~ and            ~ultra-realistic graphics~. Um, well, more of that later.                    If you're familiar with the arcade or the Dreamcast versions then            it's fair to say that not a whole lot's changed. The basic            ~gameplay~ of old remains largely as it has been for the past four            years, and arguably the visuals remain rooted in the past too. So            what's in there to, cough, reel you in?                    For a start, there's a fair few gameplay modes to get stuck into;            Free Fishing allows you to just get your rod out, choose which part            of Lake Eagle you'd like to visit, set the month, and fish            leisurely, with a roll-up poking out of your mouth, a tub of            writhing maggots and a wireless tuned to Radio 4. Ok, we lied about            the last bit(s), but you get the idea. Along with the Training            mode, this gives you some grounding in honing your fisherman            skills, before taking on a human or CPU opponent or entering the            Tournament mode.                    For the noobs, the training takes care of all elements of how to            become the next John Wilson (whose house I ended up living in, fact            fiends), with boat operation, selecting the right type of lure, the            act of casting, hooking the fish, and, scarily, how to fight the            fish, all dealt with. Yep, these buggers are Ninjas, given half the            chance.        Jumping into the game, the first task is to position your boat            in spot where you think the fish might be lurking, which, depending            on the time of year, could be hugging a structure (such as a            bridge), in the depths or basking in the top water. Choosing which            kind of lure is all important here, as the weight, size and colour            will all have an effect on whether the fish will be interested.            Non-fishermen will probably be losing the will to live at this            stage, but it's important to pay attention to the basics of good            fishing practise or you'll be doomed to failure, as fish after fish            swim by disinterested.                    Once you've got your lure sorted, and set your casting position,            you simply hit X to cast your rod, and hit one of the four            directions to perform various types of casts (overhead, backhand,            sidearm and pitching) at a part of the lake of your choosing. At            this point the game switches into an underwater view and you slowly            reel in your line (tap R1, or better still actually reel it in if            you have the aforementioned Thrustmaster peripheral), in the hope            that Billy Bass and his friends are up for biting. If you can tempt            the hungry beasts into action - normally by being careful and            taking your time reeling the line back in - the game warns you that            the fish is approaching, at which point you either mess it up by            being too hasty, or you stab L1 to hook it. A Line Tension bar            appears on the right side of the screen, the rod/pad vibrates like            crazy and some dramatic rock music kicks in to inject some urgency            into the proceedings. Then it's up to you to reel the blighter back            to the boat without snapping the line or letting it off the hook,            making sure to slacken the tension if it's struggling too hard,            while being mindful not to let it get away. It's stirring stuff,            and luckily you'll be piling up a decent haul in no time.                    Whether you then feel confident enough to enter the tournaments is            up to you, but once you're against the clock it's a whole different            kettle of (clears throat… dramatic pause) fish. To start with            you have three characters to choose from, each with their own set            of stats, comprised of Casting Distance, Fighting Technique, Sight,            Catching Technique and so on, with the curious ability to change            their clothes, sunglasses, hat, and even boat colour. Those crazy            Japanese developers, eh? Four tournaments await you, starting at            Amateur level before progressing to World Classic, with third place            in each event unlocking the next. The Data Book keeps a track of            the various fish you catch, and your performances along the way,            and for what was originally an arcade game, there's a fair            simulation slant to keep the real fans happy.                    Graphically, however, it's a tad disappointing. Back in '99 when            the Dreamcast was streets ahead of the PSX, we were impressed with            the slick, crisp visuals, despite the generally murky surroundings            and samey looking fish. Fast forward to the present day and for all            the world it looks like the same game, and is undoubtedly a            straight port of a game originally destined for the sorely missed            Sega machine.                    Despite the obvious advantage of split screen-battles, the game            really remains much the same too, although this will only be a            major factor if you own one of these games already. It's a curious            gaming experience, and strangely enjoyable, even if, like us, you            haven't got even the faintest interest in fishing. Add a rod into            the equation and the novelty factor is even greater, but like so            many Sega games of arcade origin, there's only so long you can            glean enjoyment out of doing the same thing again and again. But            without wishing to sound like an aquatic version of Saint and            Greavsie, that's fishing.                            Sega Bass Fishing Duel screenshots (PS2)                                    Sega Bass Fishing Duel screenshots (PS2)"}