{"ref": "https://www.eurogamer.net/r-drmuto-ps2", "date": "13 Mar 2003", "game_name": "Dr Muto", "text": "Dr. Muto's not your average mad            professor. No, before you ask, he's not mute; he's apparently a            Doctor (although of what, we're not entirely sure) and he can            mutate himself into other creatures. Do you see what they did?            Those crazy fools.                    Muto is your classic Einstein on Acid mad professor; wild hair,            milk bottle glasses, and a worrying tendency to accidentally            destroy planets. But he wants to make amends for his error, and            presumably the genocide of billions of innocents, by rebuilding his            home planet by harvesting bits of four other nearby planets. Armed            with some nifty morphing technology which at various points allows            him to morph into a Mouse, Spider or a Gorilla, Dr. Muto has to            run, jump, open crates, collect everything not nailed down, and            complete a multitude of tasks on the way to defeating the            inevitable end of level boss.                    Before you all fall into a coma at the prospect of yet another            platform game, the first thing in Dr. Muto's favour is that it's            not a sequel! In a stale era where publishers play it safe,            churning out multiple sequels it's a surprise to not only find a            company willing to take a chance on a new character, but to make it            sufficiently good to stand out immediately.        Despite            the entertaining high gloss cut scenes, things get off to an            ominous start. Ah hello, my glowing object family. We meet again.            How inconsiderate of you to be left lying around all over the            place. We'd better guide this goggle eyed freak around and scoop            you all up. Crates? Well, we'd better crack these open, you never            know what might be inside. If there's one thing we can't abide,            it's a mess; call us domesticated, call us anally retentive, or            more politely, call us tidy. It's the way we're made; we can't help            it. Don't hold it against us.                    And, would you credit it? There's a whole army of patrolling            enemies just gagging to have their bodies broken into tiny pieces.            And oh look; they're considerate enough to leave behind health            pickups. So far so predictable, but despite our justifiable            cynicism, we couldn't help but warm to Dr. Muto within minutes.                    With a bigger budget, we'd probably have had the whole            metamorphosis concept rammed down our throats a hundred times, but            in the event it came as a nice surprise to be able to change our            form, by tapping the triangle button. From the first level you're            able to shrink down into the body of a mouse (with Muto's features,            disturbingly), and immediately scurry into a conveniently            mouse-sized hole, bound around for a few minutes before exiting            later and returning back to your former state.        As you charge through the delightfully detailed world you'll            pick up the blueprints of new creatures that the good Doctor can            morph into. By stunning the required creatures with your electric            shock gun you can extract their DNA. Extract enough and you can            then build up a roster of creatures that enable you to access            otherwise inaccessible parts of the planet. For example, as a mouse            you can enter the tiniest of entrances, as a Gorilla your giant            hands allow you to climb fences and overhead bars, as a Spider you            can traverse walls and ceilings, while as a Fish you can breathe            underwater. Each form has its own unique set of attacks and moves            accessible via the X, Square and Circle buttons, and you'll quickly            work out which creature can most effectively deal with the            patrolling hordes.                    In addition to the array of morphs are a selection of area-specific            power ups, which include jet packs, guns, or even cannons you can            mount to take out enemy or pieces of scenery you're tasked with            destroying. Also a nice touch is the way Muto has to utilise each            planet's 'Gomer'. These poor sods squat around minding their own            business, until you zap them, and subsequently chuck them at crates            or generators, and so forth, within the 30 second limit. Hear their            futile, wibbling moans, and try not to crack a smile.                    Mercifully, despite the game's tendency to kill you at            extraordinary regularity, the frustration levels are kept to a            minimum thanks to a considerate checkpoint system that not only            keeps a track of which of the key objects you've collected, but            also restores all the health crates. Save points are also regularly            dotted around, and therefore your motivation to carry on is            greater. You're rarely forced to keep doing the same thing over and            over again, and it's this consistent variety that ensured that once            we got into Dr. Muto, we really had trouble putting it down.                    As well as having a neat gadget/morphing system, the game is a real            looker. The scenery doesn't ever hit the heights of Ratchet &            Clank, but in terms of character models, these are among the best            we've seen on the PS2; both superbly detailed and well animated,            and full of charm. It's obvious there's real talent behind the            game, and the level design is also commendable, being cleverly            designed around the strengths of the various morphs at your            disposal. The instant rescaling of the levels as you shrink and            grow is also handled with aplomb, when it could have been a            nightmare.        Sadly, it's not all good. The camera system is controlled in            Jak & Daxter style, with movement assigned to the left stick            and the viewpoint swinging around the character with the right            stick. And in common with J&D's worst excesses, you're often            tripped up by a wayward system that never quite feels convincing.            In addition to that, the game can tend to be poorly signposted,            even in the early stages, leaving you trudging around battling it            out with respawning Robo dogs and Rent-a-cops (evil Midway, plain            evil). Rather than helpfully suggest you might wish to try changing            your form, you're left to your own devices, until inspiration            strikes and you realise your 'mistake'. The decision to allow both            enemies and pick ups to suddenly appear as you walk up to them            strikes us as a lazy, inexplicable inclusion too. It may well keep            the frame rate high, but we've never seen that kind of behaviour in            rival games, and it simply adds an unnecessary and irritating            hindrance to clearing each level.                    Dr Muto's rarely gives you an easy ride, which might put some            people off, but with hindsight we're glad it's slightly tougher            than your average. Far too many collectathons seem to think it's            acceptable to allow the player to breeze through half the game on            their first go. Make no mistake, this will take you a fair while -            easily 20 hours plus to get to the end first time through.                    Having cracked all the best this genre's got to offer recently,            it's a rare joy to play a wild card such as this. An unheralded,            unhyped game, with some neat new ideas, a stylish look and a            backbone of tried and tested ideas to entertain throughout. With a            little more polish, a less insane camera and some mini-game            variety, this would have been a must have. As it stands, Dr. Muto            joins the growing band of quality platformers on the PS2, without            touching the heights of the very best. Buy it if you're a platform            junkie, or at the very least rent. You'll be pleasantly surprised.        Dr. Muto screenshots                    (PS2)                Dr. Muto screenshots                    (PS2)                Dr. Muto screenshots                    (Xbox)                Dr. Muto screenshots                    (Xbox)"}