{"ref": "https://www.eurogamer.net/r-markofkri-ps2", "date": "11 Mar 2003", "game_name": "The Mark Of Kri", "text": "Cartoon violence is a difficult subject to tackle. Broadly            speaking, we have two different schools of thought. On the one            hand, people will often argue that cel or toon shading and similar            techniques detach games like GTA from reality, and thus exclude            them from the sort of Commons witch-hunts we've seen in the past.            ~Why not focus on more brutally realistic titles like The Getaway            and their wanton take on real-life violence,~ Vercetti            followers may bitterly muse.                    On the other hand, when it comes to games like The Mark of Kri,            visually akin to the average 90s Disney flick, and its nauseatingly            vivid realisation of bone-shattering stealth kills and bloody            slaughter, some would say that the effect is worsened. After all,            it's an invasion of a kiddy medium - and how would Mummy's little            urchins react if, instead of a slapping Khan into a fiery chasm,            Simba had pulled out a sword and stuck it through his uncle's face?                    Fortunately for you, we're not here to preach one way or the other            - we just want to tell you about the game - but you might want to            take it into consideration if you like playing PS2 with your            nippers crawling around on the carpet. This isn't one for the faint            of heart, despite its Disneying pretence.        Ya see; The Mark of Kri is a traditional but very bloody            slasher at heart, with a burly, almost husky hero named Rau whose            grunts and brutality belie his apparently moralistic tendencies. At            the start of the game, Rau is a rogue, untested warrior, and when            the local barkeep asks this inexperienced but highly talented young            swordsman to rid the surrounding forest area of its crooks and            bandits, he duly agrees, and having done so thenceforth a further            five quests will drop into his lap, thanks to characters or events            at the tavern.                    But after accepting a dubious quest and earning a bag of cursed            change, Rau decides not to take money in spite of conscience in            future, and his path becomes more righteous, leading him through            forests full of evildoers, Ewok village-style treetop mazes, on            quests through stonewashed environments ripped straight out of            Greek mythology, and into the company of some sort of bizarre            LSD-fruit-spitting oracle tree. All in the name of vanquishing the            mystical Mark of Kri, which blights its bearers and could bring            doom to the world. Blimey.                    In all, it's a simple, fairly linear adventure which sees Rau            journey around complex but predictable environments picking off set            clusters of enemies in the various ways the developer intended.            When faced with enemies, the player whirls the right analogue stick            around and an ethereal orange dingdong tags up to three enemies (or            up to six or nine enemies later on) with different button labels.            Pressing the corresponding button (X, square or circle) will attack            that specific enemy, and depending on the size of your weapon            [enough -Ed] and the manner in which Rau elects to swing it, may            well splash damage several others. Double and triple tapping of            each button will perform combos, and if you only have two or even            just one enemy tagged, you can use the remaining unassigned attack            buttons to modify your combos, or just swing the dingdong out again            to tag some more. Wherever they are, front, back, or side, Rau will            attack.                    It sounds a bit complicated, but your whale of a coach Baumusu will            teach you how to do all this before you start, and teach you some            brutal new attack or offer up an advanced weapon for each of the            game's six levels. Finish level one, and you'll be taught about            stealth kills. Finish level two, and you'll learn the ways of an            archer. Etc.        Sadly though, the two most interesting aspects of the combat            system are stealth kills and disarm manoeuvres. It's sad because            once you get to grips with these, the task of hacking and slashing            your way through the opposition (which takes much longer and is            much more damaging than anything else) seems largely worthless and            is saved only for the final level where Rau is besieged by            relentless hordes of zombies. You won't pull off as many of the            special combos that Baumusu's Challenge demands in exchange for            DVD-style extras, but you won't get bored of dying over and over,            either.                    So unless an enemy unavoidably sees you, or needs to be sniped with            your bow from a distance and can't be (due to armour), you'll want            to perform a stealth kill - done by sneaking up slowly behind him,            using the prosthetic dingdong [Who is this guy? Mark Wahlberg? -            Ed] to tag him and up to two pals as usual, and then waiting for            the button label above his head to stop flashing so that you can            press it (and any others in sequence) to get a swift, Tenchu-esque            stealth kill.                    Alternatively, if you are forced into combat, you'll quickly            learn to rely on the disarm technique of hitting R1 as an enemy            throws an attack. Doing so sees you nab his weapon and then perform            the technical equivalent of a stealth kill - a swift, decisive            manoeuvre with a brutal accompanying animation. A few tries and            you'll be able to do this for most situations where enemies queue            up in small groups.        Getting back to stealth kills though, we do mean            'Tenchu-esque'. One of the things which struck me as odd, when we            finally had playable copies of both games in our possession (about            a fortnight ago), was how similar their stealth kill mechanics are.            In the case of Tenchu, the whole game is largely given over to            leaping from rooftops and ducking out from the shadows to slice,            dice and crack skulls, but on the whole you do just find an enemy,            wait for him to turn away and then dive in with an R1-plus-Y-button            combo to do the job. Visually, the style of execution - a cleverly            framed sequence with a vicious finale - is almost identical, which            leaves the control systems, which obviously differ but work in much            the same way.                    However, Kri has something of an edge in the camera department,            which seems a little ironic when compared to a game whose raison            d'être is stealth killing. Apart from using the L1 button for            stop-and-look-around camera control (same as Tenchu), you can't            control it directly, and it's a burden in hand-to-hand combat, but            it hops into mostly acceptable positions for stealth - particularly            on roof kills, where it stands poised above the target allowing you            to select him from above and then leave the entire sequence in the            hands of Rau's AI from that last step off the roof onward.                    Anyway, it's safe to say that both games have very rewarding            systems for stealth killing, but this probably isn't why you            thought you'd play The Mark of Kri, so to say that stealth            killing and disarm killing are the most enjoyable activities (along            with the similarly designed archery system) is surely a bit of a            problem. We'd very much like to say that fighting is fun, but it            isn't. You lose health rapidly, you face overwhelming odds, and it            takes ages to kill even one enemy efficiently. Mercifully, by the            time there's no escaping it on the final level, you're armed with            the biggest and baddest weapons with a massive reach and can just            decapitate all over the shop in one, sorry, 500 fell swoops.            Assuming the annoying 'steal your weapons' enemy isn't about.            Equally merciful is the total absence of bosses, although we were            disappointed that Studio San Diego didn't seize on the areas of the            game that work really well to produce some memorable boss            encounters. Perhaps next time, eh?        Graphically, as we've said, it's very Disney-like, with chunky,            well-defined characters, and equally chunky environments. The size            of these often means they are quite spectacular, but graphically            the game offers more of a GTA-style level of adequacy than Gran            Turismo on horseback. There are no horses, either! There are,            however, a lot of carefully thought out animations to give the            stealth killing some much needed variety. You can do pretty much            anything, although you haven't much control over what Rau actually            does do, if you see what I mean.                    Speaking of visuals, a special mention is due here for the fisheye            (well, bird's eye) view that you get from Rau's spirit guide Kuzo,            whose gravely voice it is narrating the story during intermissions.            Kuzo is an excellent gameplay addition, allowing you to scout out            the level for a better chance of stealth by flying off to distant            perches - triangle is used to switch between Rau and Kuzo's            respective views, to recall the bird or send him off to the next            perch - and he can also operate the occasional lever or pick            something up. Ok, these are arbitrary additions to make him look            more important, but his main job of letting you see round corners            is hugely important to your style of play.                    Actually though, despite his usefulness, Kuzo almost feels like a            digital apology for the boring hackandslash sections. It's as if            San Diego thought they'd give you his extra set of eyes to limit            the amount of time you spend walking into combat and give you more            opportunities to kill stealthily. Throughout the game, Kuzo is            mainly used for evasion of hackandslash activities.                    One section where he is particularly important is at the end of            level four, where Rau is faced with an enormous round basin, like a            coliseum, with ladders, walls and enemies strategically placed so            you're forced to work your way down gradually and painstakingly. It            takes absolutely ages and the final showdown (on your last grain of            health) with two huge axe-wielding psychos is nerve-wracking. This,            we liked. Having to fight an unending, sprout-from-the-ground            legion of crack zombies for a finale, we didn't.        Where were we? Ah yes. We've tackled the combat system and its            flaws, the way that you spend most of the game relying on the bits            that are fun and not the bits which are expected, and that the            developer pushes the cartoony graphical boat out into freshly laid            seas of blood, but the one thing we really should mention above all            else is the issue of brevity. The Mark of Kri takes roughly six            hours to finish - a playtime so slight that we were able to            complete it a second time (in four hours!) before sitting down to            write this review. That's once through, start to finish, in six            hours, and we located all of the so-called hidden Tukus,            which (if you get them all) open up a Level Select option. Even if            you do this, and complete all Baumusu's challenges and take on            everything the game might have to offer beyond then, which isn't            much, six hours only is not going to be enough for average            so-and-so, especially during March 2003, the proverbial sequel to            Christmas 2002, with massive, terrifyingly long and intricate            blockbusters on every shelf.                    Sure, as anybody who played ICO will happily tell you, six hours            can be sheer gaming joy. But the operative there is 'can'. The Mark            of Kri isn't the best game ever, and it isn't really even sure what            it wants to be. As a stealth killer it's occasionally on a par with            Tenchu, and fans of that will lap up the methodology behind Rau's            slaughter with aplomb, but as a hackandslash alone it's on a par            with Gauntlet sodding Dark Legacy - there's no compulsion to become            good at the system, as you're often fighting the camera when            confronted and with so many enemies it's just arduous and boring.            Kri's got a lovely story though, and otherwise it is very            compelling, thanks to thoughtful level design and so on, but we            just don't want San Diego throwing different styles of combat into            the periphery if they're going to screw up the main one.                    Although we very much enjoyed The Mark of Kri, which we finished in            one day, it has arrived at very much the wrong time for a game of            its almost-brilliance. Tenchu: Wrath of Heaven, which sits            handsomely at my side, its manual beaming at me in all its            photocopied glory, tackles stealth kills almost identically, and            concentrates its efforts solely on that subject. Instead of giving            the rest of the game over to hackandslash tedium (which, if you            can't get a handle on the 'disarm; slaughter' technique, will            quickly become depressing), a bit of focus might have alleviated            the problems. Our advice? Rent it, complete it, return it and wait            for the sequel. If the ending's anything to go by, there will be            one."}