{"ref": "https://www.eurogamer.net/r-contra-gba", "date": "13 Feb 2003", "game_name": "Contra: The Alien Wars EX", "text": "As you may have gathered from our rather stinging review of            Contra's PS2 debut, we don't            have much time for this recycled style of memorise 'em up gaming            when the platform and the developer are clearly capable of so much            more. However, Konami's decision to port the last SNES Contra (~The            Alien Wars~) to GBA is a more understandable one, and we do have            some excitingly positive, dewy-eyed recollections of how much time            we spent with that one - so in some respects, we're less inclined            to slag it for the same reasons; for being a ten-year-old game.                    Nevertheless, a few hours with The Alien Wars EX doesn't leave us            as pumped as it used to. Things really have moved on since this            sort of basic, side-on shoot 'em up action was cutting edge, and            unhelpfully several of the more explosively visual scenes (yep, the            Mode 7 overhead ones which added some variety) have been cut to            make things easier on the humble GBA. Word is that we have more            side-scrolling levels from Contra: Hard Corps on the Mega Drive in            their place.        Sadly, The Alien Wars are just as unfairly            difficult as they used to be, and the mechanic is virtually            identical to the PS2 version. You run from left to right (without            the occasional aesthetic variation of the PS2 version) blasting            enemies before they can blast you, and if not, retreading your            steps and having another go. Halfway through each of the game's six            big levels, you get a mid-level boss, some of which are quite            clever. At the end, there's the big, screen-filling mother of a            boss who won't stand for any of your crap. You get a certain number            of lives, respawning on the same screen until you run out, and if            you can't finish the game with them, then hard luck - try again.            Fortunately, there's a password save system to keep you happy. Hang            on, passwords? 18-character passwords? Cripes fellas, splash a bit            of cash on some battery backup!                    Visually it's the same as the SNES version. That means that you get            the wonderfully realised backgrounds and fairly pixelly            characters/enemies for the most part - the problem being that the            Mega Drive levels look pretty shoddy by comparison. Think of it as            porting Tomb Raider Angel of Darkness to some handheld in ten            years' time and sticking some PSX levels in to fill the gaps,            without making any effort to touch them up. These are grainy, and            poorly detailed by comparison.                    As with the PS2 version, there's a two-player co-operative mode for            link cablers, but you need two cartridges for that, and the six            levels won't take you more than a handful of hours to overcome.            Much less if you know what you're doing.                    Ultimately, in this day and age Contra: The Alien Wars EX is            flagging badly. It uses outdated visuals with no changes, cobbles            together levels which the GBA can handle in order to avoid            problems, uses a lazy password system which is totally unwieldy,            and continues to rely on a ten-year-old gameplay dynamic.                    Yes, yes, yes, we know that some people don't have a problem            with inching further and further into a game by repeating it over            and over, sketching diagrams of the layout and so forth - and in            terms of reward, finishing any given level is like having an            in-growing toenail removed. You will be immensely satisfied if you            manage it. But the pain and frustration you'll have to endure in            the process - particularly those of you who weren't even around for            16-bit and before - is beyond agony for us. Sorry folks, but that's            how we feel. If you can put up with it, then go ahead and buy it.                    So why do we prefer Contra on the GBA to its PS2 sibling, you're            probably wondering. Well, it costs less, obviously, and we can            remember enough of the levels that it isn't such a chore getting            through them. No, to be fair, we still enjoyed The Alien Wars EX to            a certain degree. It wasn't as disappointing as its PS2 sibling.            Then again, that's hardly a recommendation, is it? One for            nostalgics, we reckon, and those of us who never stopped playing            Probotector. Otherwise, leave it alone! Judging from GBA software            sales figures, you probably will anyway.        Contra: The Alien Wars EX                    screenshots (GBA)                Contra: The Alien Wars EX                    screenshots (GBA)                Contra: Shattered Soldier                    review (PS2)                Contra: Shattered Soldier                    review (PS2)                Contra: Shattered                    Soldier screenshots (PS2)                Contra: Shattered                    Soldier screenshots (PS2)"}