{"ref": "https://www.eurogamer.net/r-contrass-ps2", "date": "12 Feb 2003", "game_name": "Contra: Shattered Soldier", "text": "Contra is the videogame equivalent of those wire-buzzer games            you used to get at school fetes. You remember the ones. You had a            little metal ring on a stick, like a needle with its eye opened            wide enough to fit your index finger, and you had to move it slowly            along a bumpy course without touching the magnetised wire in the            centre. Touching said wire rang a buzzer so loud and obnoxious that            you'd stutter and do it again and again, until you ran out of            chances and everyone gathered around would chorus that ~you got so            close~, yes, and you lost your five pence piece forever.                    Except, in the case of Contra, the wire is about a mile long,            peppered with explosives, you can't see what's around any given            bend and you have to do it all at 50mph on pain of death. Oh, and            your view is regularly obscured by huge, hulking blobs of gas,            rocket, beastie and fire spitting monsters, with aggressive attack            patterns and virtually no room to manoeuvre.                    How do you overcome such an obtusely constructed labyrinth of            certain and repetitive doom? That's right, you have to memorise            every single aspect of it, until you can make it from one end to            the other without dying. With your eyes closed.                    Some of the frustration is relieved by having four different levels            to try out - Train, Fortress, City and Seabed - but you have to            finish all four in order to unlock the next lot any road, so this            supposed non-linearity is a bit pointless. What's more, the levels            are all just variations on kill everything, meet boss, uncover            weakness, kill boss. Didn't I do that in Contra III in            nineteen-ninety-sodding-one?        Is there anything            clever in the game? Well, no. The so-called innovations (Two            characters! Three weapons per character!) are unexciting, and you            can't even take advantage of things like chargeable attacks in boss            battles because the circa-1991 level design doesn't allow for it.                    What else? Oh yes, your difficulty level options are splendid.            There's Easy (99 lives) and there's Normal (three). That's            the sort of balance that the Star Wars coin-op had licked about two            decades ago.                    So. Redeeming features? We did enjoy the co-op mode for an hour or            so, which we played along with another Contra vet who found the            game equally disappointing. However, it was only in the company of            one of our other friends, an abject hardcore gamer who claims his            Jaguar is superior to the Xbox, that I started to encounter an            alternative viewpoint to my own. ~This is what defines            hardcore,~ he proclaimed, hands aloft. ~The fact that you don't            like it doesn't make it any less brilliant!~                    Now, we're a good-humoured fellows most of the time. We can accept            a bit of thickness when it comes to game design. However else did            we complete The Getaway? But when the entire dynamic is given over            to memorise 'em up nonsense, with spiralling, ever present            frustration forcing you to babble so loudly and so profanely that            your elderly neighbour destroys her hearing aid for good and locks            her door for a week, how can you claim it's entertaining? If the            bar of entry for hardcoredom is knowing the way from one end of            Shattered Soldier to the other, then we'll stick to casual gaming.            Ta.        The only real            distinction between PS2 and GBA versions, by the way, is            technological. Fundamentally, they're both a product of the same            drug fuelled design meeting. It's just that in the PS2 version's            case, you get to do it all with the added benefit of            distinguishable main characters (Bill and Lucia, if you care), more            detailed landscapes and the occasional swirling camera, replacing            your traditional side-on perspective with front, rear and other            perspectives - whilst maintaining the same dynamic of moving left            and right only, jumping, ducking and shooting. Somehow the GBA            version is actually more enjoyable - but we'll save that for            another review.                    It's a shame that Konami couldn't grasp the body of past classic            Contras (which never felt this frustrating) and thrust them into a            decent 3D model. This isn't an attack on 2D games, which are fine            and dandy when they're done well (Metal Slug X, for example), but            we've seen excellent 2D to 3D updates in recent history - Mario 64            is a prime example, and just 18 months ago Capcom's superb Maximo,            which even managed to retain its Ghoulish predecessor's mountainous            but rewarding difficulty curve - and compared to their ilk, Contra:            Shattered Soldier's pseudo-3D overtures are a total non-event.                    The graphics are ~okay~ in an unadventurous, 1999 sort of way; the            audio is one of those unnervingly constant metallic accompaniments            (elevator music for Goths?); the gameplay is one dimensional and            very rarely enjoyable; and there is no replayability. Once you            clear these levels, which we freely admit we couldn't be bothered            to do entirely, then you'll merely want to put it all behind you.            Or you could try and dance and frolic between laser fire and            explosions once again, maintaining a higher hit percentage - but            why would you want to?                    Anyway, anybody who remembers the good old days of Contra should            steer clear of Shattered Soldier, unless you have some sort of            sadistic urge to lay waste to your senses and pollute your fond            recollections of this once proud series.        Contra:                    Shattered Soldier screenshots (PS2)                Contra:                    Shattered Soldier screenshots (PS2)                Contra:                    The Alien Wars EX screenshots (GBA)                Contra:                    The Alien Wars EX screenshots (GBA)"}