{"ref": "https://www.eurogamer.net/r-sfa3-gba", "date": "2 Jan 2003", "game_name": "Street Fighter Alpha 3 Upper", "text": "2D beat 'em ups have long since felt left out on the three chief            gaming platforms, with only Capcom, Sammy and a couple of others            still delivering them from time to time, but the Game Boy Advance            is relatively unexplored territory for the genre. Past successes            are thin on the ground, mainly thanks to the prohibitive D-pad and            control layout.                    But in the hands of the late Crawfish Interactive, this relatively            unexciting port of Street Fighter Alpha 3 has become something            quite remarkable - a beat 'em up which is almost brilliant on the            diminutive handheld. When we spoke to associate producer Dave            Murphy recently, he told us that thoughtful changes to the control            scheme might surprise us, and they have.                    The only question is whether the UK-based developer has done            enough, or whether it was a lost cause to begin with.        And it starts off well. Fans of            Alpha 3 will feel instantly at home, diving into this SFII-style            concoction with its more than 30 fighters, individual styles and            trio of -Isms. As with its big brother, the GBA version of Alpha 3            lets you pick from two turbo modes before entering battle, and            special power bar-based -Isms (X, A and V), which allow you to use            Super Combo moves, wield smaller combos regularly or even create            unique combinations.                    It looks beautiful too. Instead of stretching the image to fit the            GBA screen, Crawfish has given us a wider view of each stage and            reasonably sized characters, each endowed with more frames of            animation than your average Pixar creation. Everything looks right,            from Chun Li's spinning bird kick to Edmond Honda's blurry            hand-slap, and dragon punching is still emphatic.                    Sadly though the audio doesn't live up to the visuals. Digitised            audio has been a standard fixture of SF titles for years, but the            infamous ~Hadoken!~ and ~Shoryuken!~ are both scratchily rendered            for SFA3, and the music isn't much better. We're not saying that            SF's musicians have ever done anything to worry the likes of John            Williams, but familiar tunes sound weedy and misplaced here, and            when coupled with the lack of an announcer to call rounds or            victory, we quickly muted and stuck on our own tunes.                    Picking an appropriate speed and -Ism is important to success, but            your efforts with Ryu won't simply translate to Chun Li. Each of            SFA3's 30 plus characters has his or her own arsenal of offensive            moves and it all takes learning. And thanks to the changes in the            control system and particularly the way you execute signature            moves, you'll probably pull off close to nothing until you glance            through the manual.                    However, armed with a bit more knowledge of each character's            repertoire, you'll quickly slip into the rhythm. The changes to            controls are obviously quite drastic, because the GBA only has four            action buttons to the traditional six, but the compromise is quite            endearing - jabs and heavy blows can be administered simply at a            single button press, by hand and foot, with medium attacks            available by pressing R and B or L and A in tandem. It's a little            awkward and hard to adapt to, but we managed it eventually.                    Overcoming the D-pad's shortfalls seems to have been a step too far            for Crawfish though, as we had one hell of a time achieving            anything approaching a fireball for a good half an hour.            Traditionally, quarter and half-circle motions on the D-pad plus an            action button initiate the more basic Street Fighter moves. This            remains the same, but we'd challenge anyone to pull off a fireball            at their first attempt here. In reality, although Crawfish has            simplified the scheme so that specials like Ken's Shoryu-reppa are            easier (quarter-circle forward plus A and B as opposed to two            quarter-circles followed by punch), pulling off moves on demand is            still much too difficult.                    And ultimately that's all it takes to floor a good fighter. SFA3            Upper is fully furnished with all of the game's modes (including            the hidden ones), secret characters (including the hidden ones) and            the various other perks of the 32-bit versions, but the controls            are too much of a pitfall. The game's saving grace is perhaps its            excellent two-player link cable mode, but even this is thwarted by            a need for two cartridges.                    At the beginning of this review, we questioned whether this was a            lost cause. Well. Hum. Street Fighter fans in need of a Game Boy            beater have nowhere else to turn, and SFA3 is by far and away the            finest 2D beat 'em up on the system. Sadly though, a fabulous port            cannot make up for the GBA's own inadequacies, and as we learnt            with Castlevania back in the day, if it's enough to put us off it's            enough to put you off.                            Street Fighter Alpha 3 Upper screenshots (GBA)                                    Street Fighter Alpha 3 Upper screenshots (GBA)                Street                    Fighter Alpha 3 Upper interview (GBA)                Street                    Fighter Alpha 3 Upper interview (GBA)"}