{"ref": "https://www.eurogamer.net/r-mohaaspearhead-pc", "date": "10 Dec 2002", "game_name": "Medal Of Honor: Allied Assault Spearhead", "text": "Medal of Honor: Allied Assault is a game that virtually everybody            on the staff here at Eurogamer has conquered - a rare feat given            the high volume of software that crosses our desks. However, a            quick tour of duty in EA's Spearhead expansion robs us of our            rose-tinted spectacles. It's a spectacular and well-decorated broth            as ever, but how easily its flaws bubble to the surface.        What we have here is EA's slick presentation (minus a few            points for the cumbersome menu system) binding a brief campaign            through Normandy, set in the wake of a botched parachute landing.            Although development has shifted to EA's Los Angeles studio (with            2015 now working on something secret for Vivendi), none of the            spirit of the original has been lost - every soldier's a hero with            no qualms about walking into certain death for his country, you            still find yourself taking on vast swathes of Germans in            increasingly elaborate set pieces, and it's still hair-amputatingly            frustrating from time to time and book-ended by gravely narrated            wartime footage.                    Despite EA LA's adherence to the formula though, a number of            unwanted changes have crept into the game's make-up, starting with            the one major technical amendment - the addition of smoke. As we            told you last month, France, 1944 is a very smoky place. Grenades            line your belt and each explosion sees enormous, volumetric wisps            of the stuff gorging themselves on the cold winter's air. But it's            a throwaway effect in the grand scheme of things, and merely leads            the gameplay to stutter.        One of our chief concerns with Spearhead is the peculiarly            heightened system requirements. If Allied Assault and Spearhead's            respective manuals are to be believed, then nothing has changed,            but even a cursory visual comparison is enough to convince you            otherwise. Playing on a regularly watered 1.2GHz Athlon system with            a 32MB GeForce3, a system Allied Assault was quite comfortable            with, Spearhead shudders and heaves whenever smoke billows or            soldiers congregate. Drop the detail and it's still no good -            there's something fundamentally chuggy about it. This quickly            interferes with your fun, too, especially when you realise that            each set piece is preceded by the whole rig lurching violently, and            as a result you work out how to spot them...                    It isn't just the engine that needs tuning though; it's grey matter            on both sides of the conflict. Your squad mates are still totally            useless, killing a token German for each situation and leaving you            to trawl through houses with a full magazine, but as long as you            can keep them alive you're happy. (Don't you just hate it when the            game auto-saves three seconds before your squad is wiped out, thus            automatically failing the mission for you?)                    Now, the Germans themselves, well, they've lost a lot of their            guile and quick wits. Admittedly Allied Assault was often guilty of            being ridiculously hard, with snipers in every window attuned to            your presence before you even arrived, but it seems that EA LA has            taken things to the other extreme. Guards still pop up from nowhere            and open fire, but now it's only the machine gunners and            mortar-wielding bastards that are hideously accurate, with some of            the Germans failing even to fire once. During a routine trawl            through a French village early on, we found ourselves out of ammo            and facing a German guard in a doorway. He flatly ignored our            soldier. It wasn't until we went up and smacked him with a rifle            butt that he noticed.        That said, quite why anybody would notice someone with a total            lack of personality like our Sgt. Jack Barnes is anyone's guess. As            with Allied Assault's nameless hero (well, he had a name, but we            can't remember it), Barnes is a man with words only for the            intermission, and again Spearhead is completely devoid of story,            companionship, heroics, or any form of compassion. And in achieving            a 15+ rating from the ELSPA it avoids any form of blood or gore -            shoot an enemy in the neck and he'll gurgle his way to the ground            double-quick, but he won't spill an iota of claret. With so little            cleaning up to do it's a wonder that 'quick load' takes any time at            all.                    It's not all bad though. There's a lot to be said for the cinematic            parachute landing, the trip through Belgium and the predictably            explosive finale. Missions and objectives are constantly varied            albeit linear, and playing through it with the volume up and the            visuals maxed out (assuming you upgrade to a cutting edge machine),            it's difficult not to be immersed once again in the rigours of            warfare. As long as you liked Allied Assault and can handle the cut            and paste presentation (complete with the same sound and the same            mix of English, American and German voiceovers) and the sensation            of 'same old, same old', then the only thing that stands to halt            you is the game's worrying brevity.                    Rather like Half-Life's Blue Shift expansion, Spearhead is over in            barely three hours. That's less than 200 minutes, about two footy            matches, less time than it takes me to drive home from work and            about eight hours shy of its predecessor. Of course it was to be            expected, and EA has also tightened up MOHAA's net code and            introduced 12 new maps to spice up the multiplayer side of things,            but the parts aren't enough to make a valuable whole. It's only            because Spearhead chimes in at 20 quid or thereabouts that we don't            rip it apart - as it is, it's rather like buying a DVD of your            favourite war flick. You know its flaws and you tolerate them            because it's entertaining in the short term, but you probably won't            get much out of your investment in the long run."}