{"ref": "https://www.eurogamer.net/r-tombraider-gba", "date": "3 Dec 2002", "game_name": "Tomb Raider: The Prophecy", "text": "Can it really be six years ago that we were first seduced by Lara            Croft and her plaintive sighs? Apparently it is, although we'd            swear the calendar is lying profusely, and after five fairly            exhausting adventures, and two fairly forgettable Game Boy Color            stabs, we're now presented with the first Tomb Raider to hit the            Game Boy Advance.                    We were pretty intrigued on the basis that we thought the GBA might            be capable of doing a decent version of the original PSX adventure,            albeit with a fair amount of programming trickery. Core Design            itself handled previous handheld versions, so it was something of a            disappointment to find that an unknown Ubi Soft Italian dev team            had taken on the project - becoming the first Tomb Raider project            to be coded outside of the Derby based company.                    Even more of a disappointment was to discover that the team has            opted to go for an old school isometric approach. Clearly, the GBA            can cope with these kinds of graphics with consummate ease, but            they do scant justice to playing Tomb Raider As You Remember            It™.                    With these initial impressions put to one side for a moment, the            experience of playing the game has all the elements you'd expect:            running, jumping, climbing, shooting, shimmying across ledges,            pulling switches, avoiding flame traps, spikes, and general            exploration.                    In addition, narrative is sprinkled liberally to give you some            sense of structure and purpose within each level, although in            fairness it's really not worthy of your attention, being limited to            tedious ~This place could do with some air~, and ~that guard looks            like he could do with a weapon~ type quips. Comparisons to the real            thing are inevitable, and in this context die hard Tomb Raider fans            won't be anything other than disappointed. Ubi Soft has neither            pushed the GBA's technical capabilities, nor designed a compelling            handheld substitute.                    As such, the 2D nature of the proceedings turn it into a fairly            ho-hum platform game, which sees our heroine bounding about as            usual, searching for switches, keys, and an assortment of            artefacts, while dispatching irritating baddies. Luckily the auto            target makes things easier than usual, although it basically makes            the game way too easy in the combat department. Just hold down the            fire button and run around until the baddies go away. Ho hum.                    As per usual with handheld titles, there are some spectacularly            irritating sound effects guaranteed to shorten the lifespan of both            you and your GBA if you intend on playing this in a public place            without the aid of headphones. In fact even with headphones, you're            likely to trigger off latent mental illness, as the piercing yelps            of dying wolves and the endlessly sighing Lara will bore into your            skull within seconds. [Oh God yes the pain... -Tom]        Visually it's 'alright'. It            does its job reasonably well, but blandness abounds, and the whole            thing just looks like it's been rushed out to fulfil a contractual            obligation, rather than a labour of love. At least Core's GBC            efforts were lavished with detail; this comes across as a quick,            formulaic effort lacking polish in any area. Level design is            sparse, basic, often tedious, and mostly far too easy. It has all            the elements that you associate with Tomb Raider, but minus any of            the atmosphere - and given that some of the finest 2D platformers            ever, such as Flashback, Prince Of Persia and Another World were            dripping with atmosphere, this is a fairly unforgivable omission.                    We realise there's not much money to be made from GBA games, and            that development budgets have been slashed of late, but when            publishers serve up half baked, lazy, uninspired software for            £35, it's hardly surprising gamers aren't rushing out to buy            them. Tomb Raider: The Prophecy isn't going to change anyone's            mind.                    Having said all that, if you got this as a gift, and had a few            hours to kill beside a sun drenched pool, it's actually quite an            addictive, untaxing game to get along with, if you have a            compulsion to unlock doors and disarm traps endlessly. Under no            circumstances would we recommend you parting with £35 for it,            though. For that, you could pretty much buy the entire series - or            for an extra fiver wait for the forthcoming Angel Of Darkness.        Tomb Raider: The                    Prophecy screenshots (GBA)                Tomb Raider: The                    Prophecy screenshots (GBA)"}