{"ref": "https://www.eurogamer.net/r-spyro2-gba", "date": "27 Nov 2002", "game_name": "Spyro 2: Season Of Flame", "text": "The GameBoy Advance is like a breeding ground for these damn            things. Platformers, that is. While it has its fair share of            innovative and distinctive games, developers seem keen to exploit            the system's 16-bit gaming roots, so we're stuck with an endless            stream of cheap, uninteresting rubbish. Spyro 2, at first glance,            would appear to pander to this very trend.        The            basic essence of the storyline is that when Spyro returns to the            Dragon Realms from his adventures in the first title, Season of            Ice, he discovers that the Rhynocs have pinched all of the            fireflies, in turn causing dragons to lose their fire breath.            Naturally being the kind of upstanding chap that he is, Spyro sets            about recovering all the fireflies. What follows is a pretty basic,            innocent adventure through a number of lands splintering off from            the main hub of the game, the Sunny Plains.                    Unlocking portals from the hub to outside lands requires set            amounts of fireflies in your collection, thereby encouraging - or            rather forcing - your exploration of every nook and cranny of every            level to ensure your progress in the game. Thankfully your progress            isn't at all linear, and once you've opened a level you can leave            and return to your heart's content. This serves a purpose;            throughout the game Spyro can gain new abilities, such as regaining            his fire breath (to start, he is simply endowed with ice breath,            which serves to freeze enemies and fireflies for capture), and a            rock-smashing headbutt. As you gain these abilities, previously            inaccessible areas become unlockable through their use, and so            travelling back through levels to obtain more fireflies becomes            essential.        As a            diversion from the main isometric platforming of Spyro's quest, you            can also take the role of his two sidekicks Sheila and Agent 9 in            their own short levels by paying your way through portals with            collected gems. Sheila's levels are jump-fests over multi-layered            blocky landscapes where you, ahem, grow flowers by jumping on plant            pots (shrug), while Agent 9's are simple side-scrolling shooting            affairs. Completing each of these earns you a firefly but aside            from that function, they offer a nice respite from Spyro's often            tiresome adventure.                    And we've just identified Spyro 2's major and quite glaring            shortcoming - boredom. There's plenty to do here, but none of it            really makes you want to carry on the story through to its end            because none of it is particularly fun. Even the promise of an            extra game mode to unlock once you've collected every gem and            finished every level doesn't do much to motivate us, due to the            very basic nature of the game. There's nothing to surprise, nothing            to amuse beyond the admittedly charming graphics, and nothing to            challenge apart from the occasionally irritating reliance on            pixel-perfect jumping. Gradually, as you get bored, frustration            will set in too, as you wrestle with navigating Spyro around the            isometric landscapes.                    Spyro 2 starts off really quite well, but when it fails to            gradually improve on its own good starting points and doesn't            introduce more variety beyond the initial extra game modes, it gets            stale very quickly. There's a well produced title in here            somewhere, with excellent cheerful visuals, nicely realised            characters and a skilfully crafted progression model - all that's            missing is fun. It's strange how the game avoids being fun so            easily, and despite having its moments, particularly early on, we            just weren't hooked by it.        Spyro                    2: Season Of Flame screenshots (GBA)                Spyro                    2: Season Of Flame screenshots (GBA)"}