{"ref": "https://www.eurogamer.net/r-wwesmackdown4-ps2", "date": "18 Nov 2002", "game_name": "WWE Smackdown! Shut Your Mouth", "text": "We've been            looking forward to the latest SmackDown game ever since its lauded            predecessor first arrived. Although Just Bring It was extremely            popular and sold enough to justify a Platinum re-release, we            weren't exactly piledriven into loving it, as it suffered from a            number of irritating niggles which conspired to spoil the illusion            of 'real' wrestling. Nevertheless, we knew Yuke's would return with            something bigger and better, and it has. In fact, Shut Your Mouth            is arguably a more enjoyable spectacle than the TV series, which            continued to shed its regular viewers throughout this year.                    Ironically, it's the soap opera style of presentation and scripting            that make SYM more enjoyable than Just Bring It. Season mode starts            with WWE boss Vince McMahon drafting wrestlers into SmackDown and            Raw schedules, and you'll have a full card of fighters to negotiate            in the boots (or indeed high heels) of your chosen wrestler. These            range from typical one-on-one bouts to the more elaborate ladder            and cage matches, tag team battles, Royal Rumbles and even            Pay-Per-View specials, which take you all around the globe.                    These days though it wouldn't be WWE without a bit of variety in            location and outcome. You'll witness brawls in the dressing room            area, your allies and enemies interrupting matches and swinging            steel chairs about behind the ref's back, and all manner of            incidents which adhere to the scripting.        There isn't            really an ultimate goal in the season mode - it is what it says on            the tin. You have to fight your way through a season, and if you're            good, you'll be able to start thinking about challenging for belts.            Indeed, if you can work off the deficit of losing the first few            matches (as we did) then you can start requesting ~title shots~            from big man McMahon. He isn't guaranteed to say yes, but you can            always go after one of the other myriad prizes on offer in the WWE.                    This new season mode has proved very popular around Eurogamer, and            the results are rarely the same. It isn't all text with names            swapped around either - there's actual ~acting~ here, in all its            glorious cheesiness, and different characters get very different            receptions from fellow wrestlers and the crowd. And the management,            too. It all depends on whom you befriend, and with whom you lay the            smack down.                    But apart from being the best yet interpretation of modern day            wrestling with plenty of replay value, which respects the sanctity            of the 'sport's stupidity, progress in season mode also rewards you            with new costumes, characteristics and other options in the            create-a-wrestler mode. And since you can enter your own custom            bodyslammer in season mode, it's another bullet point for the            replay value column.                    Seasoning isn't all you can do, though. You can still opt for            single matches, using just about any variable imaginable. Do you            want ladies only with ladders and cages? Sure thing. Blokes versus            birds in the car park? Righty ho. Men in pants only Royal Rumble?            Go right ahead. In fact, if it's on the TV, or a combination of            elements on the TV, you can probably do it in here. Very            impressive.        The            improvements continue almost unabated as we move onto the game            mechanics. Even using Just Bring It's visuals and controls, SYM            would be an incredible improvement, but by upping the polygon count            to a level the PS2 regularly (but only marginally) strains to            deliver, Yuke's has made it look almost real to boot. Okay, the            animation and arena detail get most of the attention, and the            models do look a bit like waxwork sculptures, but throw in improved            collision detection, with only the odd blemish, more than 50            real-life wrestlers each with increased move counts, the ability to            execute your enemy's signature moves if you're cheeky enough, a few            control improvements (like easy reversals) and a thick coat of            varnish and you have a real beauty to see and play.                    Sadly though, after extensive play a number of little            inconsistencies emerge in much the same way they did with Just            Bring It. For example, for some reason your characters are still            capable of floating in midair standing on the ring apron. And in            the mechanics department, the ability to induce a dizzy state in            your opponent (opening him up to finishing moves) is so            inconsistent that we've yet to work out exactly what triggers it.            Some reversal moves seem to, and yet huge power moves often go            apparently ignored. Oh, and although we like the way the script is            characteristically cheesy, Yuke's Japlish is a bit iffy and a lot            of the jokes don't really work. Likewise the commentary, though an            improvement over Just Bring It, still falls a bit short of 'good',            and we're not quite sure why the wrestlers remain mute...                    But there's so much that is good about the latest SmackDown!            game that it's easy to forgive it. Multiplayer (for up to six            players) is no longer limited to enthusiastic post-pub brawling -            the game's mechanics lack the glaring flaws present in previous            versions, so you can feel safe wheeling it out to a lucid audience.            And also unlike previous games, this one offers so much for the            single player that it's easy to forget about beating up your            nearest and dearest.                    Shut Your Mouth is the best PS2 wrestler there is, largely thanks            to Yuke's success in mimicking the cheese that oozes from every            pore of the WWE. We've often joked that WWE television reminds us            of game scripts with appalling acting and laughable dialogue, but            it really came to Yuke's aid here, because as a simulation of the            WWE bastardisation of combat, SYM is hard to fault. As a piece of            gaming software it's a bit easier to pick holes in, but if you're            even remotely interested in, ahem, ~sports entertainment~, you're            unlikely to come away disappointed. It's by no means perfect, but            WWE SmackDown! Shut Your Mouth is a scissor-kick to the wrestling            genre's collective throat.                    But please folks, call it something halfway defensible next time,            eh?                            WWE SmackDown! Shut Your Mouth first impressions (PS2)                                    WWE SmackDown! Shut Your Mouth first impressions (PS2)                                    WWE SmackDown! Shut Your Mouth screenshots (PS2)                                    WWE SmackDown! Shut Your Mouth screenshots (PS2)                                    WWE SmackDown! Just Bring It review (PS2)                                    WWE SmackDown! Just Bring It review (PS2)"}