{"ref": "https://www.eurogamer.net/r-rct2-pc", "date": "15 Nov 2002", "game_name": "RollerCoaster Tycoon 2", "text": "I loved Rollercoaster Tycoon. I find theme parks and the            construction of the rides therein really quite fascinating, so for            someone to develop a game based on this very premise was a dream            come true. Nearly four years ago Chris Sawyer took the formula            pioneered by Bullfrog's Theme Park and pushed it forward            dramatically to produce an enormously satisfying theme park sim.            Can he pull it off again?        Sadly, the resounding answer                 appears to be ~no~. Well, sort of. You need only take a look                 at the screenshots here to realise that any advancements made                 to the engine are extremely tricky to spot. You can play it at                 higher resolutions, certainly, but that doesn't make it look                 any better than it did in 1999, and in the present company of                 games like Sim City 4 it looks distinctly... well, crap. The                 textures are reminiscent of Windows 95 wallpaper tiles, and                 the colour depth of both the interface and park graphics                 haven't improved in the slightest.                    There's been no attempt at smoothing the landscape either, and your            parks just look like mental Lego sets. This was acceptable in the            game's first incarnation, when many systems would have been            struggling to push it around at 1024x768, but now the functional            graphical style has the effect of diluting your experience - it            becomes difficult to identify with the world you're creating.            Worryingly, RCT2 just isn't as fun as it should be because of this.                    Sawyer would have us believe that the underlying code is ~all new~,            but there just isn't much to show for it apart from the fact that            your old saved games can't be used. The major additions to the game            are the inclusion of a rollercoaster designer for use outside of            park management scenarios, and a scenario editor where you can set            up landscapes and win conditions to play with. The two tools share            the same cumbersome construction interface as the main game, and in            the case of the rollercoaster editor, it doesn't ease the            construction of rides any further than taking away the            responsibility of running a park while you're trying to design your            uber-coaster.                    There is also a set of twenty new scenarios to play, although you            can now go about completing them in any order you like. With this            complete open ended-ness, the feeling of progression, achievement            and reward from Rollercoaster Tycoon has been replaced with what is            essentially a toy set.        The fact that the developers didn't see                 fit to improve on the original's frankly clumsy interface                 either is really quite baffling. They might have felt that the                 original was so well liked that they can't go wrong by                 recreating it, but this isn't good enough. Creating simple                 slopes, tunnels for your coasters and rides to pelt through                 isn't as simple as it should be, and the fixed ninety-degree                 rotational angles don't exactly make matters any easier.                    How about a function to automatically generate queues when you            can't see through pieces of scenery, no matter what angle you're            looking from? How about the game taking the initiative and digging            some tunnels for you when a ride needs them? It's little things            like this that are so obviously needed that it frustrates me that I            should even be having to point them out. Even the added            functionality of being able to build your own scenery up            block-by-block in the scenario editor is hampered by the dated            construction tools. Taking what was good about the original and            making it twice as good is what we expect to see in a sequel, not a            half-arsed effort with some editing tools that could have been            given away on the website.                    Oh, but what's this on the box here? It's a Six Flags logo!            Somebody somewhere saw the dollar signs, and as a result we get a            set of scenarios based around recreations of the franchise's parks            from around the world. The license does bring some interesting new            rides to the already impressive collection, however, and just            watching some of the awesomely designed coasters is an absolute            pleasure.                    Considering that it's perfectly possible for you to create            similarly impressive rides for your own parks, it's here that RCT2            redeems itself somewhat; you have absolute power to create rides            that you've only been able to dream about before, but it's just so            frustrating that a potentially stunning game is handicapped by an            absolute dog of an engine and no sign of real innovation. I mean            look at it, for crying out loud!                    'If it ain't broke, why fix it?' you could say, and as a critic            this puts me in a difficult position. I could spend pages mouthing            off about how nobody saw fit to really change the game and craft            the sequel we deserve after gobbling up the predecessor in it's            millions, but RollerCoaster Tycoon 2 is still a pretty good game in            its own right, if you try to forget that it's pig-ugly and meant to            be a sequel.                    If you've never played RCT before, then this is an excellent            opportunity to sample what is the still the definitive theme park            management sim - add two to the score if that applies to you. If            you're a veteran of the series, however, I wouldn't blame you for            not handing over your hard-earned for what is essentially a patch            and expansion pack in a box. Though it pains me to do it, for the            almost complete lack of innovation and progression of a nearly            four-year-old title (and a now-budget title at that), I have to            hand an old friend a score like this."}