{"ref": "https://www.eurogamer.net/fire-emblem-echoes-shadows-of-valentia-review", "date": "30 May 2017", "game_name": "Fire Emblem Echoes: Shadows of Valentia", "text": "An unexpected pleasure in recent years has been the resurgence of Fire Emblem in the west, Intelligent Systems' fantasy tactical RPG making the unlikely crossover from exquisite curio to Nintendo staple. This 3DS offering, coming late in the handheld's life-cycle, is one of three Fire Emblem games out in 2017, and I wouldn't be surprised if by year's end it emerges as the very best.It can certainly boast some of the most interesting heritage. Fire Emblem Echoes: Shadows of Valentia, to give it its full and gloriously overstated name, is a remake of 1992's Fire Emblem Gaiden, a late Famicom game that never found its way out of Japan. Famed for being an idiosyncratic follow-up to the original Fire Emblem - the Zelda 2 of its own series, if you will, offering a very different take on the formula with ideas never to be seen again in a Fire Emblem - there's a certain novelty to be found in this full-blooded makeover, where all those quirks are embellished in lavish detail.Gaiden was, to date, the only mainline Fire Emblem to feature dungeons, and in Shadows of Valentia they're now glorious 3D affairs for you to crawl through. Towns can be visited from the world map, explored by moving from screen to screen and being treated to the wonderfully wistful work of illustrator Hidari, who brings Gaiden's cast to vivid life. Hidari's character art, in all its fulsome beauty, speaks to a sense of innocence that lifts so much of Shadows of Valentia.It's there in the story, the tale of friends Alm and Celica who are separated at childhood before finding their paths intersect later in life, the two protagonists spearheading the dual campaigns that forge their own paths across the map. Following the sometimes painful convolutions found in the plots of last year's Fire Emblem Fates, there's something to be said for the simplicity here; for all of its familiarity there's something of the wide-eyed wonder of early 90s RPGs that's been captured in this restoration, all fully voiced and enthusiastically articulated.There's simplicity, too, in its systems. Gone is the weapon triangle, and absent too are the support systems that have blessed more recent Fire Emblems. Perhaps more importantly, love doesn't blossom on these battlefields and you can no longer pair up units and make lovely baby soldiers. It's a heavy edit, then, so it's credit to how much else is going on in Shadows of Valentia that this particular flavour of Fire Emblem remains so satisfying.Skirmishes are stripped back, taking place on maps that lack some of the smart complexity seen in Conquest, but in getting back to basics the combat can be quietly brutal. Attrition plays a larger part, with fatigue setting in while mages use up their HP when casting spells, and in stripping away so many of the tools familiar to fans of more recent Fire Emblems you're required to think that little deeper about how you play.Shadows of Valentia offers some new tools of its own, introducing Mila's Turnwheel - effectively a rewind feature that allows you to skip back past any mistakes. You're limited in how often you can use it, but given how permadeath still plays its part here (on the default difficulty, at least), it's an elegant alternative to the hard reset that's become a part of the series' make-up. Here's hoping it becomes a part of the series' future. Such quality of life improvements are part of a package that's every bit as sumptuous as Awakening and Fates, scored handsomely by Takeru Kanazaki with bold animation interludes from Studio Khara.Perhaps it's coming fresh off the back of mobile entry Heroes, a very different distillation of the series that's been a commercial success yet hasn't ever been wholly satisfying, or having worked through the clutter of last year's brilliant but convoluted Fates, but there's an electrifying simplicity to Shadows of Valentia. Some of that depth and richness is missed, perhaps, but in its place is something just as powerful. It's a curious but enjoyable send-off for the series on the platform that helped re-establish its name, and it's with some sadness that this perfect marriage comes to an end. There's something about the 3DS that's always proved ideal for Fire Emblem - the portability that lets you carry around these 40 hour adventures like a well-loved book, or how the stereoscopic 3D makes each battlefield look like a pixel-art tabletop, a delicious diorama for you to tinker with to your heart's content.This isn't even the 3DS' best Fire Emblem, ultimately, but it's certainly one of the most interesting entries in the series' long history, an eccentric offshoot with an identity all of its own. It forgoes the soap opera of recent games and delivers a different brand of strategy that's remarkably refreshing - and it's a chance to spin back the turnwheel and see what might have been."}