{"ref": "https://www.eurogamer.net/r-unrealchamp-x", "date": "7 Nov 2002", "game_name": "Unreal Championship", "text": "~Do yooo waaaaant suuuuuuuum?!~ roared Jay Wilbur at X02 recently,            before producing a flak cannon and fragging the entire 900 strong            European audience as if to prove a point. The Eurogamer staff            miraculously lived to tell the tale, having nipped off to the gents            at that point, and returned to wade through the bloodied chunks of            the industry's finest littering the Isla Magica theme park. Wilbur            was naturally mortified; having assumed his cannon wasn't loaded,            and is now serving a life sentence in a secure institution            somewhere near Seville.                    Still, it was a good experience for research purposes, and when            Unreal Championship finally landed on our desk yesterday, we felt            ready to step into Jay's shoes and start killing for fun. Resisting            the temptation to do it for real, we were more than happy to            indulge in such violent fantasies on our Xbox - a machine that is            now pretty well stocked for gibtastic games after Halo and            TimeSplitters 2.        But the            long-awaited and exclusive Unreal Championship has something that            neither Halo nor TS2 offers - online play, and when this service            gets its public switch on next spring, it's obvious that UC will be            pretty much top of the list of the games you'll be wanting to play            on it.                    We got to grips with the online side of the game at X02, once we'd            rounded up some of the survivors, and with a headset it's just as            much fun as you'd hope it would be. Being able to bellow out            commands to your team mates, or taunt your gibbed enemies adds            plenty to the experience, and with a pitch shifting utility, you'll            also be able to create a spectacularly annoying voice to deliver            your taunts too.                    We can, however, imagine that as with Counter-Strike, this facility            will be abused by idiots and you'll end up wanting to rip off your            own face than hear squeaky teens making smug remarks. But used in            the right context, it breathes new life into a game by ensuring            you'll be able to order your team around in the best way possible.        Until next spring,            sadly, most of you will have to be content with either some four            player split screen action or LAN link play for up to 16 players.            For you lonesome fraggers, UC borrows heavily from Unreal            Tournament, almost to the point of zero innovation. What you            basically get is a ladder campaign, structured almost exactly like            UT, with seven Deathmatch, Capture The Flag, Double Domination and            Bombing Run levels. As before, complete a couple of DM levels and            CTF opens up, and so on until all four are available to you. Once            you've conquered all seven levels of each you get a one off            Survival match and you're the champion.                    Deathmatch and Capture The Flag need no introduction, while Double            Domination is a slight variation on previous attempts, with the            premise this time being that two zones have to be turned your            team's colour for ten seconds consecutively to score a point.                    The other main mode, Bombing Run is perhaps the most interesting of            the three. Taking elements of CTF and Speedball, the concept is            that you have to carry a ball into the opponents' goal, although            while you're in possession you lose the ability to shoot. You can;            however, either pass to an opponent, or throw the ball away and            kill those intent on frying your ass, and pick it up again when the            job's done. Failing that, you can just try and run for your life,            which isn't all that easy when you've got four opponents all            chasing you at once. To score all seven points you have to run or            jump into the goal, or for three points you can throw the ball into            it. Whatever, it's tremendous fun and a hugely welcome addition.        But before you get to play, you have to choose a team of five            bot buddies (which is not perhaps the wisest choice of phrasing,            but we'll carry on), who accompany you in crushing the opposition            throughout the campaign. Each has three vital statistics; Agility,            Endurance and Strategy, so it pays to check each one out in advance            if you want to put together a strong unit. Each player also acts as            a specialist in one key area, be it Defence, Offence or Freelancer,            meaning an all rounder, as well as having a weapon of choice. As            you'd expect, each also has a uniquely freaky appearance and their            own set of taunts, all delivered in their own voice.                    A word of warning, though. Don't even think about playing UC single            player on Novice level unless you're a total newbie, because you'll            blitz through every level on your first go, probably without dying            once. Three other more challenging skill levels are available, and            should at least provide the average gamer with five or more hours            of fragging fun.                    If you can't be bothered with winning trophies and climbing            ladders, there's always the instant action option that enables            players to jump straight into the fray, selecting whichever map            takes your fancy. Horses for courses.        Visually it's well up to the beautiful standards you'd expect            from the Unreal engine. Packed with detail, the character models            are top notch, the texturing is superb throughout, and the            architecture is sublime on every single level. The maps are the            usual mirror image layout, so finding your way around is            straightforward (maybe a little too straightforward?), but you            won't tire of seeing such well realised creations. Next to Halo,            they're arguably on a par in terms of looks, but are designed in a            more traditional sense which might irk the more experienced fragger            looking for something new. Remember, this is a console experience,            and feels a little dumbed down at times.                    Audio is uniformly superb, with mellow understated, atmospheric            tunes, and crunchy sound effects all realised in 5.1 surround,            which adds a great deal of depth to the gameplay if you've got the            kit (which we recommend you go to the effort of setting up, because            it really is worth it).                    Control wise, it's a breeze if you're used to playing console FPSs,            and uses the right trigger for primary fire, left for secondary, A            for jump, and weapon select with either X or B. And talking of            weapons, it's a case of more of the same. If it aint broke…                    The only real gripe we have with UC is the occasion frame rate            stutter as the Xbox accesses data from the hard disk. This kind of            thing really shouldn't be happening a full year into the Xbox life,            although in all honesty is doesn't detract from the gameplay - but            in an intense Live battle we can't help but wonder how annoying            this might eventually prove to be.                    Frames rates in all other senses are ok without being super slick.            Multiplayer is acceptable, but you do get the sense that it could            have done with a little more tweaking to make it absolutely slick.                    In conclusion, Unreal Championship is a great companion to those            who've had their fill of Halo. It's by no means anything remotely            original, borrowing almost all of its ideas from a three year old            PC game, but in terms of console fragfoolery, it's up there with            the best of them for visual splendour and all out intense action -            and once it goes Live we can see a compelling reason to own it. It            doesn't have the all round appeal of TimeSplitters 2, and can't            compete with Halo for the lone player, but for refined hardcore            shooting action and the prospect of online play, there's much to            admire. PC owners, however, should stick to UT 2003.        Unreal                    Championship screenshots (Xbox)                Unreal                    Championship screenshots (Xbox)                Unreal                    Tournament 2003 review (PC)                Unreal                    Tournament 2003 review (PC)"}