{"ref": "https://www.eurogamer.net/r-blinx-x", "date": "5 Nov 2002", "game_name": "Blinx: The Time Sweeper", "text": "Revealed to the public with some fanfare at E3, Blinx is one of            Microsoft's biggest hopes in the run up to the crucial Christmas            period, but has already been simultaneously fawned over and damned            by the specialist press, which always makes relatively late reviews            such as this one an even tougher proposition.                    But forcing the opinion divides to the back of our minds, as ever,            let's get the easy bit out of the way: the first thing you should            know about Blinx is its heritage. Developed by ex-Sonic Team            members under the name of Artoon, it's obviously going to be of            interest to anyone who thought that Sonic The Hedgehog and Nights            were pleasant ways to spend your spare time.                    But that was then and this is now. Things have changed, moved on,            and not only do we demand supremely playable and innovative            gameplay, but we expect it to come dressed in shiny new clothes            that make our eyes bulge in a slightly freakish fashion.        So what have we got? Ostensibly a            quirky 3D platformer starring Blinx, the grinning cat who's basic            mission is to rescue a Princess (would you credit it?) and destroy            all the 'Time Monsters' that occupy each area. The reason behind            this is fairly unimportant (click            here for our first impressions if            you really want to know), but suffice to say that the brave            young Blinx is armed with a Time Sweeper, which sucks up debris            that you can fire at these unwelcome visitors. Despatch these            critters in under ten minutes and it's onto the next stage.                    The whole game's premise is centred on time, and being a worker in            the Time Factory, Blinx possesses the nifty ability to mess around            with the stuff, via the various Time Crystals that populate the            levels. Blinx can hold up to four of these colour coded crystals at            once - pick up at least three of the same colour and Blinx can            control the flow of time to his advantage. Holding down B brings up            a VCR style control panel, which Blinx can use to pause, play,            record, rewind and fast forward the action. Pause, rather obviously            allows you to freeze the on screen action for a short period, which            is handy for dispatching a cluster of enemies, rewind allows Blinx            to restore broken areas of scenery, record results in Blinx being            able to effectively record himself thus being able to co-operate,            fast forward speeds up time, while play speaks for itself.                    All of this is possible thanks to cunning use of the Xbox's hard            drive and is one of those innovations that makes you wonder why no            one has come up with the concept on the PC at any point in the last            ten years or so.                    Ok, so it's a nifty idea, but how does it work in practise?            Certainly, being able to fiddle with time can be immensely            enjoyable in the early stages, if and when you manage to collect            the correct crystals, but it's more often than not a tough task to            find the colours you want, when you want them. Ultimately, you soon            realise it's a novelty, and not a particularly useful one at that            thanks to the way the game proffers its goodies.        In the early stages of the game, when the difficulty level is            basic to say the least, the crystals seem to be plentiful. As you            progress and the difficulty level suddenly cranks up you seem to            have to fight for every last one of them. Getting three of the            right colour can be a frustrating lottery - which ultimately means            you have to be incredibly careful what you pick up, and when you            pick it up, as once they're gone, they don't respawn. And because            of this, you're forced to either restart and play through more            carefully, or defeat the monsters via mere use of your Time Sweeper            alone.                    Fortunately, Artoon has included a limited number of other pick ups            to help you out, one of them being gold, which you can use to            upgrade Blinx's abilities. New Time Sweepers can be acquired and            have progressively more powerful suction and 'continues', up to a            maximum of three. Collecting red crystals enables this feature, and            can be the difference between success and failure, and there's a            very fine line between the two, which will probably have you            tearing your hair out within a short time.                    Your chances of success are certainly not aided by the rather            unforgiving camera system used either. In the early stages you're            not under so much pressure, so this isn't such an issue, but as you            start to encounter revolving platforms, vicious enemies, and            dreaded death traps, the last you need is to get completely            disorientated by the camera at the vital moment. And we're not            exaggerating here - if you're close to a wall, Blinx regularly            disappears, so you're left waddling around in first person mode,            completely unable to judge distance or aim properly or in fact play            the game properly.        This certainly comes            as a big disappointment, because the game has the potential to work            so well. The visuals, for example, are staggeringly beautiful. The            sheer amount of detail on Blinx alone is completely unparalleled            for a videogame character, while the backgrounds are, in some            cases, literally dripping with detail. This is one game that has an            Xbox look stamped all over it and anyone playing it for the first            time would be impressed at how far ahead it is of rival consoles in            this respect.                    This, combined with the initial sense of innovation and strangely            addictive gameplay makes Blinx initially an enjoyable experience,            but it's laced with an unnecessary level of frustration that should            have been ironed out well before release. The tag line says ~who            needs nine lives when you can control time~, but frankly, we could            have done with the nine lives as well. There's death around every            corner, and whether that's down to a poor targeting system,            unhelpful controls or the frankly comical camera system, there's            always something around the corner to spoil your fun. Add to that            the time it takes to suck up debris, and the five ammo limit, and            you've got another unnecessary chore for the gamer to deal with.            Imagine having to pick up every single bullet before you fired it            in an FPS, and each bullet taking three seconds to pick up?            Exactly.        The linear level            system hardly helps Blinx's cause either, with a very rigid level            structure involving the completion of each world's three level in            order before facing one of the game's gigantic boss monsters. The            likes of Jak & Daxter and its ilk allow the gamer massive scope            for exploration and multiple objectives. In comparison, Blinx feels            stubbornly old school for an innovative next gen title, and will            kill your initial enthusiasm for it stone dead once you hit a brick            wall.                    And the less said about the audio the better. In typical Japanese            style, the music just has to be heard to be believed. Tinny,            pathetic plinky nonsense that should have been outlawed from gaming            ten years ago. But hey, it's in 5.1, so at least you get some            decent sound effects now and again.                    So now it's decision time - will you want to invest in the best            looking, but most fatally flawed platform game we've seen in ages?            We reckon despite all our moans it's a well worth checking out on a            demo pod (or disk, assuming there's one coming). Fans of            platformers still have to check it out, if only to see the gorgeous            eye candy on display. Real old school committed sufferers who enjoy            repeated deaths and against the odds gameplay might get something            from it, but for us, Blinx smells like a massive missed opportunity            that will do the Xbox no favours at all, and at this time of year            Microsoft really doesn't want to be missing opportunities.        Blinx:                    The Time Sweeper screenshots (Xbox)                Blinx:                    The Time Sweeper screenshots (Xbox)"}