{"ref": "https://www.eurogamer.net/r-formulaone2002-ps2", "date": "31 Oct 2002", "game_name": "Formula One 2002", "text": "Now that Formula One is officially the most predictable sport            in the world, it must be hard for videogame makers to generate            enthusiasm for something that has lost all the elements of            competition and surprise that it once had.          Turning right didn't seem like a good idea at the time, and it won't in a few moments either!            Nevertheless, Sony has had a pretty decent track record of            producing F1 games, stretching way back to the launch of the PSX.            We've lost track of how many it has produced over the years, but            including the often excellent Psygnosis developed editions, this            must be at least the seventh it has released.                    Developed by 'Team Liverpool' since the demise of Psygnosis,            Formula One 2002 hardly needs any introduction - it features all            the real life tracks, constructors, drivers and cars as usual, and            even dear old Murray Walker doing his usual excitable, and slightly            irritating commentary.                    Gameplay modes are plentiful, with something for everyone: Quick            Race, Arcade, Arcade Season, Time Attack, Simulation, and two            player split screen mode. Three difficulty modes enable you to turn            off or on numerous driving aids, so in theory whether you're a            veteran or a rookie, you should be able to get to grips with the            game in no time.                    Arcade enables you to jump in on any track and have a five lap            quickie, but features a damage bar - so charging around bashing            into everything is not an option. Ram too hard and it'll be Game            Over before you've made it around the first lap.        Single race is a similar story, although this time you can            whack on the driving aids and blast around to your heart's content.            This does, however, show up the rather suspect physics within the            game that enable you to perform some truly bizarre manoeuvres, such            as flipping the car multiple times, and being able to drive on            regardless - while, of course, showing no signs of damage. These            anomalies aside, the handling is the right balance between            challenging and forgiving. The right amount of braking and            knowledge of the oncoming bends does give even novices the chance            to work their way up the pack.                    Time Attack is self explanatory, while Simulation mode is where the            real effort has been made, giving gamers the chance to prepare for            each race in the most authentic fashion possible. Tweak the cars,            shave seconds off the practise lap times - it's all there. If            you're really keen, you can even perform the same number of laps            that the professionals would in real life; but surely you'd have to            be some kind of masochistic nutter to want to race around the same            circuit for over an hour.                    Sony claims the driver AI has been set up so that you'll begin to            really notice driver personalities, with some acting aggressively.            We honestly didn't notice, but then we suspect you'd have to play            the game a) in a serious, committed fashion (i.e. not driving like            a lunatic like us) and b) for a long long time before elements like            that become noticeable.                    One area Formula One 2002 does excel is its simulation of the            engine noise - as you're powering towards a bend, it's just as much            your reliance on the engine sound as your speedometer that tells            you if you're going too fast. Whoever's responsible for this            deserves a hearty pat on the back - shame about the really bad            generic 'rawk' music that accompanies the Arcade mode. It's hard to            know what's worse: that, or Murray Walker bellowing ~He's on the            grass again~ for the 19th time in succession.        But            whatever your racing preferences, it's immediately apparent that            the visuals are nowhere near approaching the standard we've become            accustomed to on the PS2. Texture blandness abounds, with            advertising hoardings blurring in and out of view, trackside detail            uninspiring, and spectators wafer thin cut outs. Compared to the            competition (mainly EA's F1, but Infogrames has the promising Grand            Prix Challenge out soon) the eye candy just isn't up to scratch.            While pop up and slowdown doesn't appear to be a problem, the whole            game looks like a first gen PS2 game. In its favour, at least the            frame rate is nippy and the gameplay experience isn't hindered in            any serious way, but still, any discerning gamer faced with such            visual blandness has to dig deep to find out whether the game makes            up for it in other areas.                    Formula One 2002 is by no means a turkey - it's just that we've            been spoiled by visual splendour from the likes of Burnout 2 and            Shox lately. And besides, with at least three publishers releasing            F1 games every single year, Sony needs to at least make its version            visually exciting - otherwise they end up looking like limp, also            ran cash in releases.                            Formula One 2002 screenshots (PS2)                                    Formula One 2002 screenshots (PS2)"}