{"ref": "https://www.eurogamer.net/r-mhpb2-ps2", "date": "23 Oct 2002", "game_name": "Mat Hoffman's Pro BMX 2", "text": "Bikes are more fun than boards. You can do far more entertaining            things on a bike, and there are less people wearing baggy trousers.            Or 'pants'. However, in videogame circles, boards are more fun than            bikes, as Tony Hawk aptly demonstrates on an annual basis with            little or no response from biking circles. Until now? Well, not            quite. Like the original, Mat Hoffman's Pro BMX 2 is a very good            BMX biker, but it's still only as good as the last Tony Hawk title,            and in reality a bit worse off than that.        In fairness to developer Rainbow            Studios, it has had The Condor (that's Hoffman) in and has gone            back to the foundations of the game, catering the various levels to            the sport instead of just building on top of last year's Tony Hawk            tech. However, much of Hoffman's game could happily interchange            with what appears in its closest rival's series, and vice versa.            Fundamentally, they're the same game.                    In fact, the biggest changes could be considered refinements to the            formula. Like the control system. As with Hawk, you hit X to pop a            jump, and use combinations of the directional pad, circle, square            and shoulder buttons to perform spins, flips and tricks. A few            practice sessions and you'll start to grind and trick a bit. A few            more and you'll be linking the odd spate of tricks with a nice            manual. A few more still and it'll be all that anyone can do to            stop you hammering the analogue stick back and forward to pull a            manual whenever in sight of the ground, and trick combos will end            only when you no longer want to risk the points total. Nothing new            here.                    But as Hoffman (and his pals on the 'circuit') all ride bikes, not            boards, they can perform peculiar tricks whilst manualling on one            wheel, twisting and contorting themselves to your button presses to            rack up some extra points. Bikers in Hoffman's 2 also command an            adrenaline bar (rather like the one seen in Z-Axis' Aggressive            Inline), which once full can be unleashed via spectacular signature            moves for each of the riders.        Apart from that though, it's the same game with different            packaging. You pick a biker from amongst Hoffman's crew and embark            on a road trip around eight real-life locations (New Orleans,            Vegas, etc), pulling tricks and opening up new challenges. Each            victorious session unlocks clips and footage of the real-life            Hoffman crew doing their own real-life road trip, and it's            awe-inspiring stuff.                    Instead of handing you a bike and showing you the playground            though, Hoffman's 2 has you attempting to complete tasks in sets of            four at various difficulty levels. Each set of four earns you 50            road trip points, and with enough points you can unlock the next            level. Since you're on a bus, you can always pootle back to            previous arenas later on if you decide you can only do the amateur            and semi-pro challenges at first, and the challenges start off easy            so you can bus around a bit and get a feel for the various indoor            and outdoor levels.                    Tasks range from the criminal (smacking a few fire alarms) and the            peculiar (collecting five hot dogs) to the amusing (fighting a            giant tentacle) and downright ridiculous (collecting a condor), but            they tend to take one of several forms; racking up a high score,            grinding a high ledge, collecting five of something, crashing into            five of something, doing a particular trick at a particular point            or doing something along those lines. Those very, very familiar            lines.        Sadly, along            with the unsurprising mission objectives, the game boasts some            pretty lamentable level design. It's the usual collection of sharp            edges to grind and things to jump off, but levels are much less            fantastical than their counterparts in Tony Hawk's, Aggressive            Inline and so on. Admittedly, this is a restriction of the road            trip / real-life angle, but it's still a daft restriction. More            fantasy levels would have improved this game by quite some way.                    Beyond the single player road trip mode, we have another set of            standard options; park editor, freeride and multiplayer modes. None            of which really does anything special, although you can have some            good fun with the park editor if you can be bothered to tinker with            it.        Another problem is the game's visuals. They're a problem            because they're pretty boring - well defined, quite detailed and            nicely realised, sure, but grey, unsurprising and unadventurous -            and because the PlayStation 2 can't handle them. Slowdown is a            fixture of most of the outdoor environments and for a game which is            all about quick thinking, quick fingers and clever button combos,            slowdown is a big problem.                    It's not much better on the audio front, although that is at least            more subjective. The opening salvo of tunes is your typical extreme            sports catalogue of grunge, punk, rock and metal acts and few of            them really fit the mood. There are some timeless classics in            there, like Iggy Pop's The Passenger, but when these brush            shoulders with music by a group called Swollen Member amongst            other, equally brash contenders, you have to wonder why. I did say            the opening salvo though. Fortunately you can unlock more (and            frequently better) tunes by uncovering hidden CD tokens in the            various levels, which is a nice touch.                    Right chaps. Pop your bikes up against the wall and let's work out            how good it really is. The benchmark in the extreme sports genre            (and it's a single genre for as long as there's zero divergence            from title to title, eh?) is Tony Hawk's Pro Skater 3, with            Aggressive Inline nosing its way into view as well. Mat Hoffman's            Pro BMX 2 isn't as much fun as either of those - it's not as smooth            to play or as imaginative as Tony Hawk's, and it's not as            innovative or open-ended as Aggressive Inline. The two-minute timer            (which even Neversoft has dropped for the next Hawk) is grossly            restrictive, and the whole game just feels like a poor man's Tony            Hawk's. It's also niggled by slowdown, which is quite unforgivable.                    However, there's no better BMX biker on the PS2 at the moment, and            fans of the sport will no doubt find Hoffman's 2 very realistic and            an exciting prospect, in the same way that boarders first found            Tony Hawk's. But whereas this is virtually the same game as the            last Hawk release, the next Hawk release is just around the corner.            Is it really worth it in the meantime?                            Mat Hoffman's Pro BMX 2 screenshots (PS2)                                    Mat Hoffman's Pro BMX 2 screenshots (PS2)                                    Mat Hoffman's Pro BMX 2 screenshots (Xbox)                                    Mat Hoffman's Pro BMX 2 screenshots (Xbox)                                    Mat Hoffman's Pro BMX 2 screenshots (GBA)                                    Mat Hoffman's Pro BMX 2 screenshots (GBA)"}