{"ref": "https://www.eurogamer.net/r-quantumredshift-x", "date": "10 Oct 2002", "game_name": "Quantum Redshift", "text": "Futuristic racing has been a well beaten path ever            since Psygnosis blew gamers away with WipeOut way back in 1995,            with its gruellingly exciting blend of combat, stupendously fast            racing, top class (for their time) visuals and a cutting edge dance            soundtrack. It's probably not too wide of the mark to suggest that            this was the game that made the PlayStation a cool machine to be            associated with, and stands as a landmark achievement.                    Several incarnations - and copycat games - followed, inevitably,            but the impact lessened each time with just incremental            improvements added each time. And when Sony's Wipeout Fusion on PS2            was virtually ignored by the punters earlier this year, it was            clear that the public's appetite for such games was at an all time            low. Time for a re-think? Maybe that's where Quantum Redshift comes            in.                    The signs are pretty good when you realise that it's been developed            by a team (Curly Monsters) comprised of the same chaps that brought            you the original Wipeout - so it's by no means an exercise in            bandwagon jumping. And it's not their first, either, having already            released the critically lauded, but low profile NGen Racing. And            with this experience of futuristic racers behind them, perhaps it's            no surprise that Quantum Redshift is a class act.                    Using the familiar template of weapons, white knuckle speed, a            lush, futuristic setting (100 years hence), cutting edge graphics            and a pumping soundtrack (Junkie XL - yes, they of No.1 'A Little            Less Conversation' smash hit fame), Quantum Redshift isn't exactly            gunning for originality awards. But whatever it does, it does            extremely well.        Essentially it's another            racer that has most of its real goodies locked, and so the game is            littered with incentives to brush up on your racing skills.            Initially you get about half of the 16 vehicles and characters and            tracks to play with, and gradually via winning races more becomes            available to you. No surprises there.                    But what is a delightful surprise is that, for once, we have the            pleasure of reviewing a game that has clearly been coded to make            the most of the Xbox. Visually, it's a tour-de-force, with a sheen            that makes it stand out in a way that only a select few titles have            managed on the format to date.                    Being a futuristic racer, Curly Monsters has taken the approach of            'anything goes', so any resemblance to reality is purely            co-incidental. Track wise, the design alone is immediately            impressive, with multiple climbing, spiralling routes and beautiful            scenery to be admired at every turn. The graphical wizardry            warrants a special mention; the water effects in particular are            inspired, especially when droplets splash onto your camera lens            after a brief underwater excursion, and generally elicit gasps from            anyone observing. And with full 16:9 support and 5.1 Surround            included, this is one title that the more flash gamer will be            wanting to show off on their home cinema system.                    Meanwhile, the 16 vehicles that populate the game have also            undergone the same degree of polish. While undoubtedly 'inspired'            by the Pod Racers in The Phantom Menace, (not as bad an idea as it            sounds), the animation and attention to detail lavished upon them            is top notch, with incidental touches making them look and feel            convincing as you scream around at speeds up to 900 m.p.h. Tap the            boost or brake and the visual effect on the craft is highly            noticeable, with flaps opening out, and various parts of the ship            shifting in relation to the forces exerted upon it as you burn            around. The game genuinely feels more convincing as a result.            Arguably, Quantum Redshift is how 'that' scene in Episode One            should have ended up as a game. Only three years late. Ah well.        By now, you'll be            wondering how it actually plays. And the answer is very nicely - as            with any good racing game, the controls and handling are paramount.            Simply use the right trigger for acceleration, left for brake, with            two buttons for weapons, one for boost and one for shield.            Throughout, the controls feel intuitive and once you realise that            breaking on corners is essential, it becomes a question of how well            you can memorise the track layouts and your weapons using ability.                    But your destructive abilities, to begin with, are pretty poor -            it's only once you start earning cash and upgrading your craft that            things get interesting. However, before you go piling your cash            into weapons upgrades it's worth bearing in mind how useful it is            to have a longer lasting speed boost, or a better quality shield.            In fact, correct use of the boost system can be the difference            between success and failure, with a quick blast capable of getting            your craft up the many hills, or around the many corners swiftly.                    As you'd expect, the weapons play a huge part in the game, and the            tracks are littered with them. Every ship has its own unique            weapon, and over 160 weapon effects are said to be present in the            game, so you could say a fair amount of effort has been made here!            The weapons system is especially useful for stopping rivals from            getting too far ahead, but it does also mean that unless you're in            sixth place (out of six) you're always likely to be under attack            from your aggressive rivals, therefore having a decent shield is            vital, especially as you progress deep into the game. Just as well,            then, that the game warns you of incoming enemy attacks and a tap            on the shield button can temporarily ward off the threat of            missiles or enemy cannon. Your competitors can get seriously            feisty, and will think nothing of stopping you in your tracks - so            defence is often the best form of attack, especially once you've            powered up your shield enough to deflect the blasts onto them.            Bwahahahahahaha.                    Once your begin to progress from the fairly powder puff attacks of            Novice and Amateur modes, Expert mode is where the game really            starts to challenge, with heavy weapons and beefed up, smarter            enemy AI making it a tough, but still playable nut to crack.        But where's the innovation, I hear you cry? Well, it's not            overly abundant, it has to be said, but at least some effort has            been made to stand out. Each of the racers has a particular nemesis            and a 'home' track, and every race is introduced by a short            animated exchange between your chosen racer and the track's home            hero. All very dramatic, and amusing in a beat 'em up kind of            fashion. And in order to unlock more characters and tracks, you            must first win each race of a mini series, culminating in a one on            one race off against your foe. Beat them and your nemesis becomes            playable, along with their track, which certainly makes a change to            merely winning a mini league, or series of races to progress, and            adds charm to an otherwise straight up racer.                    Whether it's worthy of purchase comes down to your tastes. It's by            no means a screaming ~must have~ release for the simple reason that            games like this have been done to death, and many veterans may feel            like they're re-treading old ground. On the other hand, Quantum            Redshift is easily the best game of its type. It's by far the best            looking, plays brilliantly, and has huge replay value thanks to the            upgrade system. It also has the now standard four player split            screen multiplayer mode, which sadly has to be unlocked, (an            annoying oversight), but at least it's a good incentive to play            through the single player campaign.                    Quantum Redshift is one for the less jaded gamer or the future            racing fanatic, but the old school may want to try before they buy."}