{"ref": "https://www.eurogamer.net/qt-driver2-gba", "date": "8 Oct 2002", "game_name": "Reviews", "text": "Until Grand Theft Auto 3            came along and completely blew every other mission-based driving            game out of the water, the Driver games were king of the hill. Ok,            the second version with its hideous pop-up issues and unfinished            feel tarnished Reflection's reputation somewhat, but it still sold            by the bucket load. But that was two years ago - and surely the GBA            can't cope with the graphical demands that even the PSX couldn't            cope with?                    The answer right from the word go, is comprehensively, unavoidably,            no. Anyone even vaguely familiar with Driver 2 will take one look            at the GBA version and wonder why they bothered.                    The signs, to begin with, a quite promising. The familiar mission            structure is there, but right from the word go you're wondering why            the car is so small, and why Tanner now resembles some kind of            stick man. The buildings look more or less the same, while the            actual driving lacks any of the subtlety of the game it is based            on. And as for the sound, I guarantee if someone was playing this            on a train, and you were sitting near them, you'd have to wrench            the GBA off them to save yourself and your fellow passengers from            impending madness. It's so screeching and annoying, it's almost            funny.                    It's like the whole thing has been reduced to its basic elements,            in some kind of vile contractual obligation. On the surface it's            all there. The missions are much like the original (drive to point            X, chase him, bash baddie off the road, etc), while the extra mode            such as Take A Ride, Checkpoint and Survival are there, but I            challenge anyone with a pulse to play them for more than three            minutes and have any compulsion to play them again. One mode we            didn't get to play was the multiplayer mode. But don't get your            hopes up.                    If you've got £35 burning a hole in your pocket, do yourself a            favour and buy the two PSX Drivers. Don't even think about            investing in this travesty."}