{"ref": "https://www.eurogamer.net/r-silenthill2-x", "date": "2 Oct 2002", "game_name": "Silent Hill 2: Inner Fears", "text": "Upon its PS2 release nearly a            year ago, Silent Hill 2 was undoubtedly the blackest, most            sinister, twisted game ever to grace the world of videogames.            Successfully splicing the survival horror and adventure genres to            brilliant effect, Konami was universally applauded for producing            one of the games of the year - thankfully the public thought so            too, and bought it in droves.                    And after a torturous delay, the game finally makes it to the Xbox            in Europe on October 4th (despite having been available in the            States for ages), and comes complete with an exclusive episode in            which you get to play as the mysterious Maria, but more on that            later.                    The main game tells the story of James Sutherland, a slightly            confused and desperate individual who returns to the fog bound            lakeside town of Silent Hill, after he receives a letter from his            dead wife Mary, asking him to return to their 'special place'.        Of course,            Sutherland's mind is more than a little blown by this, but decides            to investigate anyway, which is where you come in. The game has you            dashing around the deserted town in search of clues, and quickly            takes on the adventure game formula of finding objects, solving            puzzles, talking to anyone you come across and inevitably unlocking            doors to further your progress. But you don't have it all your own            way, with bizarre, twisted, slimy and deformed creatures shambling            around to provide the all-important horror element.                    After an unnecessarily drawn out beginning, where you're wandering            around for ages looking for something to do (although it does give            you time to admire the gorgeously stylised graphics, and fantastic            fog effects) you finally find an apartment to explore and unlock,            and it's here where the game really begins to take shape.                    Inevitably, comparisons will be made to the various Resident Evil            titles, but Silent Hill 2 scores over all of them in a myriad of            ways. Firstly the voice acting and dialogue are a world away from            the often hammy Res Evil efforts, and weave a genuinely intriguing,            and adult plot line. How many games can you name that tackle            Euthanasia and suicide? Granted, the often Twin Peaks-esque story            might not be to everyone's taste, but it demonstrates that            videogame plot lines are finally growing up.                    Elsewhere, the dynamic camera system is superior, and nearly always            gives a sympathetic viewpoint, which is essential when you're            trying to dispatch a bunch of mutant undead, although there are a            few exceptions when you're running blind into a pack of salivating            limb waving monsters. The combat is generally pretty limited            (usually a case of fire, fire, fire, stomp on head) only coming            into its own during the boss sections, but it's always terrifying.                    The use of lighting also deserves a special mention. Once you're in            the deserted and filthy apartment environment, and you find a            torch, the grainy, grimy look complements the unhinged storyline            perfectly, and is the perfect game to play with the lights off.            Sadly, the Xbox version's graphics are functionally identical to            the PS2, but don't let that put you off - it still looks stunning            throughout, and the cut scenes are uniformly impressive. And as for            the audio - we can't recall there ever being a more vile concoction            of other worldly noises. Clearly the dev team are people you            wouldn't want to meet down a dark alley.        The puzzles are also extremely well conceived, and recall the            glory days of early '90s LucasArts point and click adventures for            sheer forehead slapping brilliance (once you crack them, of            course). If you're into lateral thinking, Silent Hill 2 is a real            joy to tackle, although you can always adjust the difficulty level            if the challenge is proving too much. Likewise, the level of combat            difficulty can be adjusted to cater for your tastes - all things            that make the play experience more accessible to a broad audience.                    For a game that relies so heavily on the narrative to drive the            player on, it's worth mentioning in advance that it never really            makes sense. But that's not to say it's frustrating or unsatisfying            in any way - right to the end you're left with that 'what the            hell?' feeling, but it all adds to the enigma. For the real            die-hards, there are four different endings, and different objects            that appear once you've completed it, but whether it makes any more            sense is another matter.        The PS2 owners of Silent Hill 2 will no doubt be intrigued as            to what the extra content is, but prepare to be underwhelmed.            Essentially you get a mini episode that casts the player in the            role of Maria, who runs around in a rather fetching mini skirt and            crop top doing much the same things as James does in the main game.            The only problem is that it'll take any self respecting gamer less            than an hour to complete, - and that includes the inevitable            running around, puzzle solving and monster slaying.                    To say we're disappointed with this extra is an understatement, as            it's more like a demo than anything, although it does shed a tiny            bit of extra light on Maria's role in this curious tale. Oddly,            Konami has decided to strip out the extra DVD content that came            with the PS2 release, such as the 'Making Of' featurette. Surely it            could have squeezed it onto the Xbox version? Meanies.                    In conclusion, Silent Hill 2 is an essential purchase for Xbox            owners who don't already own the PS2 version. For the die hards -            rent or borrow it, but don't be tempted to part with another            £45 - get Project Zero instead (providing you own a PS2)."}