{"ref": "https://www.eurogamer.net/qt-conflictds-ps2", "date": "30 Sep 2002", "game_name": "Reviews", "text": "The PC version of UK-based Pivotal Games' Conflict: Desert Storm            left us with mixed feelings - whilst refreshing and more than a            little enjoyable, Pivotal disappointed us with disengaging visuals,            the likes of which even the humble PlayStation could realise. The            question is, does the PS2 version bolster our faith in the old            gameplay over graphics adage, or does it flop face-first in the            sand?        Controlling            your troopers mid-battle is one of the most satisfying features of            Conflict: Desert Storm, and you'll learn all about it in the            extensive pre-game training area, but squeezing that great amount            of functional control onto the PS2 pad has resulted in an            over-complication of the system. Heavy-duty button combinations are            the order of the day, and memorising them can be tricky, especially            when you're trying to pull orders off on the fly in the middle of a            heated firefight. The training is all well and good, but I kept            having to refer to the manual in order to get the most out of the            system for a good while, and that somewhat defeats the purpose of            such button-combo shortcuts, does it not?                    Once you do manage to get your head round the way things work, you            can start to get into what is a very engaging tactical action            title. While stealth can be an important part of the proceedings,            you'll more often than not end up having to pull out all the stops            and go on a reckless shooting spree to dispatch your foe. Being            able to split off from the group of four soldiers and perform            different tasks, like sneaking off to set explosives or heading            into an installation to pop some caps, is a welcome ability that            heightens the realism and depth to some of the tactics you can put            into play, and contrasts nicely against the panicky shooting            sprees.                    Try as we might though, we simply can't get past those god-awful            visuals. The engine hasn't improved or declined on the PS2 - it            remains pretty much the same as the PC version. With some higher            resolution textures, more detailed animation, character models and            scenery, Desert Storm could be an immensely atmospheric game. As it            is, the atmosphere is well realised through clever, imaginative            level design and enemy placement, but we can't help but think that            better visuals would have raised the quality of an already fine            gaming experience that little bit higher. As it stands, it looks            like 'My First Tactical Game'.                    Conflict: Desert Storm is a great game. It really is. You just have            to persevere a little and keep telling yourself that the looks            don't matter. There is no finer game of this kind on the PS2, and            fans of tactical action would be foolish to ignore it."}