{"ref": "https://www.eurogamer.net/qt-aggressiveinline-gc", "date": "22 Sep 2002", "game_name": "Reviews", "text": "Microsoft tells us that most ported games look best and offer the            best extras on Xbox, and as far as Acclaim's Aggressive Inline            goes, they're right on the money. AI on Xbox offered us an extra            level and a custom soundtrack, but the Cube outing is the same old            game as its PS2 sibling. However, that's not bad news for Cube            owners. AI is, after all, a game we described as our vision of Tony            Hawk 4, and the reasoning behind our argument was quite simple: no            skater past or present has offered as much variety, progression or            entertainment for your money.                         Building on the success of Tony Hawk, AI takes everyday locations            (like streets and skate parks) and throws in more exotic options            (like a movie set and a fairground), fits you with skates and a            laundry list of tasks and sets you to work, borrowing most of Tony            Hawk's control system in the process. Graphics are at about the            same level as the PS2 version, where they were as good as Tony            Hawk's Pro Skater 3, but also offered improved model animation and            in particular, clothing animation, with a very clever physics            engine which ludicrously also applies to the enormous breasts of            the two female skaters.                         Fortunately for Z-Axis, it works to a large extent - it's very            playable, easy to get into and easier than Tony Hawk to get good            at. You'll be chaining tricks and grinds together with            comparative ease, and the lack of a time limit is a blessing here            also. AI introduces an adrenaline bar arrangement, and it's if you            run out of juice that the party ends. Another boon is experience            points, so you're always levelling up your trick capabilities. In            fact, the only problem with the game is the Cube pad's shortcomings            - a fiddly directional pad is almost unusable, and the analogue            stick is too sensitive.                    Aggressive Inline and I know one another inside out now, and I'm            still enjoying it despite playing the same bits over and over.            There's plenty of longevity in this one, and if you simply can't            wait for the fourth Tony Hawk game, this is your best option.            However, if you own a PS2 in addition to your Cube, I would            recommend your seek out that version instead."}