{"ref": "https://www.eurogamer.net/the-surge-review", "date": "18 May 2017", "game_name": "The Surge", "text": "Despite its futuristic setting there's a strange, Willie Nelson-esque song in The Surge. It's tucked away in the OPs rooms you encounter - OPs rooms being the equivalent of Dark Souls' bonfires. It's a hesitant, downbeat number that starts with the line 'I was born in a prison with no hope of escape'. I quite liked it at first, but it slowly became symbolic of my time playing The Surge; given enough repetitions it becomes dull and samey - a dispiriting inevitability couched in something that should, by rights, be thoroughly enjoyable. The Surge starts promisingly enough, with a brief but punchy intro sequence - you're Warren, a man who has applied to work at high-tech corporation Creo in search of a better quality of life. From the moment a company issue exoskeleton is painfully grafted to his frame, however, it's evident that something has gone horribly wrong and that Warren is going to have to fight his way out if he wants to stand any chance of survival. Much of the story from that point is played out either in collectible audio logs or through encounters with NPCs, and it's a shame that neither really feels especially relevant to the environment or to the immediate problems Warren faces. The NPCs are incidental and while the audio logs give a sense of what things were like before everything went horribly wrong, they don't really help bring the world to life around you. While it's certainly not an ugly game, the environments in The Surge nonetheless feel drab and empty. The problem with setting a game in a functional industrial facility is that the environment behaves like one. While the hallways, walkways and wire clad maintenance passages are all faithful recreations of what a Creo facility might look like, they do little to spark the imagination. There are flourishes, of course - a blood smear here, a now bitterly ironic motivational slogan there - but even these can't rescue The Surge's various environments from feeling distinctly mundane. They look very much like the purpose-built levels they are, in other words, making it hard to get the sense anyone ever really lived or worked there. That's a criticism that could be levelled at a number of games, of course, but for a game whose storytelling is mostly done through descriptive audio logs, having environments that feel mostly static is a real obstacle to immersion. The Surge's best material lies not in its world or its world building, but in its systems, which do a great job of translating the concept of different character builds to its near-future setting. Your character's level is articulated as core power, with that number affecting the number of neural implants you can have active, how much gear (of what level) you can have equipped, and of course your base health. Power level also affects which terminals you can override in the world, meaning some areas are very explicitly locked off until you've hit the right level. Balancing your gear and implants, all of which draw from your core power at different rates, makes for some very engaging character customisation. You can focus on making your rig more energy efficient (at the cost of defensive stats), for instance, which will allow you to install some of the more costly implants. Similarly, you could focus on having only the most sturdy of rigs and rely on raw power to see you through. The unlockable implants themselves are a treat, with all sorts of injectible healing items, drone control modules and stat boosting nodes to collect and install. With The Surge's industrial setting, scrap takes the place of souls, allowing you to level up while going towards crafting gear and upgrading what you already have. Crafting and upgrading, however, also require specific alloys or machine parts, which is where finishing moves come in. I'll explore the combat more thoroughly in a minute, but for now it's worth noting that you can use The Surge's lock-on system to target a specific body part. You can focus the majority of your attacks on this particular bit of enemy before unleashing a finishing move which will hopefully cleave that body part from the rest of your foe - this, in turn, allows you to isolate and acquire schematic for certain bits of equipment, or salvage the necessary bits of tech for an upgrade. If you want a new headset or to upgrade the one you already have, in other words, you'd better start collecting heads. It's a nice touch, even if it does mean you start treating your enemies like a living Wickes catalogue, focusing on particular body parts only for as long as it takes to get the required parts. The Surge, in other words, has a solid foundation with some innovative twists thrown in for those who want to dive deep on character builds. With that in mind, it's a shame that the combat is a bit one-note. Even when changing up Warren's build, the combat feels very formulaic and lacks the sense of polish that makes its contemporaries so thrilling. This is not helped by the overall feeling that there's a lack of spectacle in The Surge, again related to the fact it's set in an industrial facility. Barring the odd tense section that sees you explore an unlit corridor in an attempt to turn the power back on, there's very little atmosphere to be found - Warren simply carries on plodding through each bit of the facility, picking off enemies that obligingly stand and wait for him to approach. Victory in The Surge rarely feels exhilarating, which is one thing, but the far greater problem is that defeat so rarely feels instructive. The thing that makes dying in Dark Souls or Bloodborne so great is the moment when you go 'ahh, I see how this works', which lends a rewarding sense of progression even as you get punted back to the nearest bonfire or lantern. This sense is conspicuously absent in The Surge, which rarely evokes a reaction deeper or more profound than 'well, they got me'. This, incidentally, is the exact moment the 'I was born in a prison' song starts up yet again. That feeling is, unfortunately, only exacerbated by a timer being attached to your dropped scrap, changing the trip to recover what you lost from a journey of redemption to a bit of a mad dash. If you got greedy on your previous life and pushed it a bit far, you'll often respawn knowing practically no chance you'll fight your way back to your scrap in time - effectively rendering it lost immediately. It's a tension that runs counter to the spirit games like The Surge work so hard to create, the sense that even in failure, you're failing forward - that perseverance will be rewarded, because the game is as patient as it is exacting. It's one of a number of small missteps that keep The Surge from achieving true greatness. It's a solidly built game and has some truly inspired systems but, for all its smart design decisions, borrowed or otherwise, it still rings hollow. It's sure to find a decent following among the Souls hardcore as there's a lot here that's familiar for them to enjoy, but really these players have two fights on their hands - that against the enemies of The Surge, and that against the feeling The Surge isn't all it could have been. And that bloody, incessant song, of course."}