{"ref": "https://www.eurogamer.net/ho-rccars-ects02", "date": "3 Sep 2002", "game_name": "Reviews", "text": "The game's ten tracks vary from beaches and seaside castles to            military bases, and the focus here is on causing mayhem rather than            professional racing. Many of the courses are wide open, complete            with multiple routes and shortcuts, and races tend to devolve into            a mad dash from one checkpoint to the other, with cars flying in            all directions as you jostle for position and dodge obstacles.                        There's also plenty of interaction with the environment, and not            all of the obstacles standing in your way are stationary. Empty            cans be pushed around and traffic cones knocked over, sometimes            revealing hidden bonuses, but the real threat comes from the            track's full scale inhabitants. For example, tourists can be found            wandering along the ramparts of a fortress in one circuit, and if            you manage to run into one you'll get a big ~Hit!~ message on the            screen and the poor person you just ran into will then hop around            in pain for a few seconds. Get too close though and your intended            victim may try to kick you, costing you valuable time.                        It's not just people you have to worry about either. Racing along a            beach you might run the gauntlet of being mauled by a dog, which            snaps at your car as you drive past, while some tracks include road            sections where you have to dodge oncoming traffic that towers above            you like something out of Land Of The Giants. To help you avoid            these hazards, your car has been fitted with turbo boost and jump            functions. As you would expect, the boost gives you a short burst            of extra speed and takes several seconds to replenish before you            can use it again, while the jump allows you to hop over small            obstacles such as stones and stray cans.                    R.C. Cars is, in a word, fun. The action is fast and furious, and            the inclusion of outsized people and animals to avoid (or ram into            at full speed, if you fancy some bonus points) keeps you on your            toes. It looks good, plays good, and it should be out later this            year, assuming 1C and Creat can find an overseas publisher in time.            It's also coming to the PlayStation 2 some time next year, courtesy            of Metro3D, although for some reason the console version is being            called Smash Cars instead. Whatever the title though, it's well            worth a closer look."}