{"ref": "https://www.eurogamer.net/ho-splintercell-x", "date": "1 Sep 2002", "game_name": "Reviews", "text": "I'm about to state the obvious, but I need to get this off my chest - Splinter Cell looks stunning. Every single thing about the game is stunning, from the characters and their beautiful flowing animations, the design of the weapons and gadgets and the scenery right down to the way a piece of plastic curtain flows and refracts light when disturbed. Our time with the game at ECTS 2002 revealed exactly why we should be excited about yet another Tom Clancy license from Ubi Soft.            You probably already know that Splinter Cell won a Best of Show            award for Ubi Soft at this year's ECTS, and we can't stress enough            how well deserved that award was. There has been no other game to            catch our attention quite so pointedly, and no other game has            caused us to stand peering up at the screen with our mouths agape.            It really is a sight to behold as we take our protagonist, Sam            Fischer, sweeping through what appears to be a secure prison            facility, effortlessly bounding from one wall, then the other and            finally supporting himself with both legs at the ceiling of a            corridor in the relative safety of the shadows.                        Throughout the game there are a number of ways to approach each            problem using a variety of tools. My own favourite method of            approach was to suspend Sam in the shadows, switch on the            night-vision goggles and shoot out all the lights, plunging the            corridor into darkness so that you can drop to the ground and            initiate a silent takedown on the unsuspecting guards in safety. If            you fancy taking a more subtle approach, we were told that it is            entirely possible to progress through the whole game without            killing a single person, and this is a challenge that many will            relish.                        There are times when only one method will do, such as when your            mission calls for the interrogation of a key character. Stepping            silently up behind our target, we were able to tap the A button,            get him in a chokehold and put a gun to his head. Subsequent            pressing of A questioned the subject further until you gained all            of the necessary information. A pull of the control pad trigger at            this point delivered a pistol whip to the back of his head, and our            hostage slumped to the ground.                    There is a vast amount of functionality of this kind squeezed onto            the Xbox pad, and at first the controls can seem fiddly to master.            Extended play reveals that this complexity is a necessary evil            though - it is, after all, a complex game. Sam Fischer has an array            of gadgets and weapons to utilise, and they're all brilliantly            implemented. Sidling up to a locked door in the shadows, we had a            peek through our inventory and picked the fibre optic camera. A            quick tug on the trigger button and Sam slipped the camera under            the door, our perspective switching to a light enhanced view of the            room, which we could rotate with the right analogue stick. We could            barely stifle our chuckles of delight.                        The camera helped us to identify a threat behind the door. We then            used a small tool that appeared to blow the lock off the door,            enabling us to slip in and issue a swift dispatch with ease.            Whatever he's doing though, Sam conducts all of his operations in a            slickly animated manner, stalking about rooms and corridors in the            shadows with complete silence. The brilliant motion effects don't            stop at Sam, either - they extend from the game's other characters            right down to pieces of paper caught in the breeze and birds            flapping about in a tree outside the window, moonlight casting            their shadows onto the floor.                        Detail is very much a factor in Splinter Cell, and this is obvious            right from the very start. For example, Sam could pick up a            discarded bottle if you so wished, tossing it to create a            distraction for the guards. Another example is the use of the            plastic sheet we mentioned earlier; you need to enter a morgue and            examine a body, but the cameras connected to the alarm system are            detecting your movement. Slipping behind the barely translucent            curtain and stepping slowly forwards, it covers you like a sheet            and spreads over your body to create a shield through which the            cameras can't detect you. The environments themselves are full of            minutiae, and are as much a tool to aid your progress as your            weapons and gadgets. Planning your approach properly and utilising            the darkness as a disguise has never been this important.                    It's not often that you get to see a game running for twenty            minutes and know that it's a killer app, but if only one game at            ECTS deserved that title, then Splinter Cell is it. If this had            been totally Xbox exclusive, we'd be confident enough to tell you            to buy the system purely for Splinter Cell. This game is important,            so miss its November arrival at your own cost - it's time for Solid            Snake to retire."}