{"ref": "https://www.eurogamer.net/r-tigerwoods2002-ps2", "date": "17 Aug 2002", "game_name": "Tiger Woods PGA Tour 2002", "text": "For some reason, whenever I explain to people that I've been            playing Tiger Woods PGA Tour 2002, they pat me on the shoulder and            say that I work too hard. It's difficult to convince them that it's            a stunningly good sports game. What's worse though is the lack of            opposition. Apart from a friend I somehow managed to indoctrinate            in the ways of the Woods, and of course my flatmate - ever the            victim of multiplayer testing torment - my reign is virtually            uncontested. Having played the game long enough, I'm even having            difficulty convincing the digital Tiger for a round. I think he's a            bit upset about being beaten by five holes the other night. It's            either that or shame over his Open performance. I'm sure you can            sympathise with my plight, but doubtless there are those of you            worrying about my mental health even now. The strange truth though            is that Tiger Woods PGA Tour 2002 is a great game, and you don't            have to be a golfer to appreciate it.                         The first thing that strikes you about the game is its curious            control system. Diving into the Tutorial section (which the game            cleverly requires you to do before it lets you swing a club by            yourself), you quickly learn that there's no three-tap power bar            nonsense to be found. Taking a shot is a question of aiming roughly            in the right direction, picking the right club and shot type for            the distance, adjusting aim for wind speed and height variance, and            then pulling the analogue stick back and waiting for your chosen            golfer to reach the top of his arch, before bringing the stick            forward in a smooth motion to dispatch the ball.                    Variables in this relatively complicated equation include tapping            L1 during your back swing to increase the strength behind the shot            (although this only works on drives as far as I can work out), and            holding a direction and tapping L2 at a certain rate to apply spin            when the ball is in mid-air. You don't want to hold the club at the            top of the back swing too long, by the way, or you lose momentum,            but naturally enough, if you want to play a less significant stroke            then you can simply pull the stick back to an appropriate distance            instead of yanking it the whole way. Sometimes you'll need to play            cautious or overzealous shots, but often preparing to take the shot            is far more important than actually playing it well - an action            which becomes reflexive before you know it.                         Of course, it's all change when you hit the greens. Putting is a            question of judging distance and direction, but you don't have to            worry about the wind, just the slope, and none of the speed or            momentum is lost in the absence of L1-tapping or pausing at the top            of the swing. The good thing is that the game offers you ~caddy            tips~, advice from your man with the clubs on how far left, right,            long or short you should play the shot, and most of the time he            gets it right. It's just a question of judging the distance by eye,            which can be tricky, but the balance is about right. After all,            it's more help than the pros get, but you still get the            satisfaction of potting a real outside chance at 40 feet.                    The game offers six courses upon which to test your newly found            mettle, some of which are based on real-life courses (these tend to            be quite boring) and some of which are borne of the creative            imaginations at EA, with more than just hills, rolling fairways and            interfering foliage. Pebble Beach is quite tough and the TPC at            Sawgrass is a bit greener with lots of tight holes on sloping            greens surrounded by bunkers, but fantasy courses like Tiger's            Dream 18 (unlocked hole by hole as you complete the main single            player game) can be a gargantuan struggle against fiendish design.            The Copperhead Canyon course, for example, is set atop rocky            mountains with clusters and outcroppings to dodge the ball between,            holes riddled with bunkers and the ever-present possibility of the            ball plummeting off the side. Chuck in some elevated greens and            plenty of water hazards and it's a real challenge.                         The courses are all drawn beautifully with plenty of detail,            although not a great deal of animation. You can kick up turf and            tees while playing a shot, but waterfalls are often static. The            best example of animation in the game is probably the water            breaking against the shores on the back nine of the Pebble Beach            course, but other than that it's quite a serene game without much            emphasis on making a living, breathing world. Apart from the            squirrels and deer, which pop up now and again looking like rejects            from a Disney film set against the beautifully realistic            environments. By contrast, the golfers themselves are almost            over-animated, with exaggerated reactions to their various shots -            play a drive into the short rough two feet from the edge of the            green and the podgy geezer in a Hawaiian shirt will smack his club            down on the turf in anger, but play a fairway shot twenty feet            ahead of the tee and he'll probably cheer along with the crowd.            Otherwise the presentation is uniformly excellent though, and the            commentary is another tenet of this, with an Irish chap and a            quiet, reserved American offering their thoughts on shots and            positions.                    Tiger Woods isn't just a matter of batting your way around courses            by yourself though. The Tiger Challenge mode offers some lonesome            tasks and scenarios (play all of the par-5 holes in as few shots as            possible, for example), but the real backbone of the game is a            series of 17 challenges leading up to a confrontation with Tiger            himself. A series of opponents come along and you have to defeat            them, playing to accrue as much prize money as you can. Your            golfer, who starts off very weak, gradually improves in stature as            you invest more prize money in his statistics, and it's a system            which works surprisingly well, allowing you to build up your            character gradually, picking away at different tasks one by one.            You can also amass Trophy Balls and various course records, which            the game keeps track of in a minute amount of memory, and even            recording a particularly good shot as a saved replay occupies only            17Kb of space, giving you the chance to build up a whole library of            them.                         As you defeat your various opponents, you unlock them for use in            the single player game and for multiplayer opponents. The game is            very much a multiplayer experience - you can have several players            head around the course with you, hot-swapping pads as necessary -            and due to the slow pace and social atmosphere it makes an            excellent game for post-pubbers, although you won't want to be            'drunk driving'.                    I was genuinely surprised to find myself enjoying Tiger Woods PGA            Tour 2002 as much as I did, and I don't plan to stop playing it any            time soon. There are some quirks here and there - it would be nice            to have an equivalent to something like The Open Championship to            compete in, for instance, and the camera can be a bit erratic at            times - but on the whole it's a pretty flawless experience, with a            single player challenge of considerable fortitude and a lot of            multiplayer longevity to boast about."}