{"ref": "https://www.eurogamer.net/ho-zelenhgorm", "date": "13 Aug 2002", "game_name": "Reviews", "text": "Your adventure begins in time honoured fashion with a dream            sequence which, like the rest of the game, uses a mixture of            computer rendered animation and live actors. Meanwhile a pair of            mysterious voices give you cryptic clues about your destiny and the            history of your world.                        You play the role of Arrikk Vaheirr, a young man who is shunned by            his superstitious neighbours on account of the fact that he is            left-handed. And has bushy eyebrows. So far as we can tell you live            in a small village vaguely reminiscent of medieval Japan, but long            ago your world was home to a more advanced civilization which fell            into ruin amidst scenes of blazing fires and people in garish            padded suits running around smashing up vases. It's at this point            that your brain may decide to leap out of your skull and ooze away            screaming in an attempt to save you from any further trauma. We            suggest that you ignore this minor inconvience and carry on            playing.                        Things only get more surreal as you delve into the game itself.            Arrikk wakes up from his disturbing dreams to find a giant ship            parked outside the back of his house. Needless to say his            neighbours take this as further evidence of his left-handed            witchcraft, and some of them will be decidely hostile towards you,            crossing their hands in front of them to ward you off like an evil            spirit. We've even spent a couple of nights locked in the stocks.            Luckily some of your friends and relatives are more forthcoming,            and gradually you will piece together your own background and start            to gather the items you need to uncover the mystery of the ship.                    The world of Zelenhgorm is built around a graphics engine similar            to that found in many of Cryo's recent adventure games. Each            location is pre-rendered, but you can rotate your view of the world            in any direction by moving the mouse, while short movies show the            transitions from one spot to the next. Look directly at something            of interest and the mouse cursor will appear, allowing you to            interact with objects, move to another area or talk to some of the            game's many odd characters.                        The result is an immersive if confusing experience, made even more            unusual by the use of FMV sequences and live actors dropped into            the digital worlds. Unfortunately the developers seem to have            invited all of their friends round to be filmed for the game,            because the quality of the acting is variable - some characters are            quite reasonable, others decidely wooden or over-acted. It doesn't            help that many of them speak with a noticeable Swedish accent, and            it's a little hard to take them seriously anyway thanks to the            heavy-handed make-up that has been applied to everyone in an            apparent attempt to make the Scandinavian cast look more oriental.            This only adds to the game's quaint charm though, as does the            dialogue, which is incredibly funny at times, although we're not            entirely convinced that this humour is all intentional.                        Zelenhgorm feels a bit like a low budget 1980's children's TV            series, but the sheer strangeness of the whole experience, the            freedom you are given to explore and examine the world and its            inhabitants, and a virtually incomprehensible plot to uncover all            combine to suck you in. I've no idea what's going on, but I want to            find out..."}