{"ref": "https://www.eurogamer.net/r-df-psx", "date": "10 Aug 2002", "game_name": "Delta Force : Urban Warfare", "text": "Before Delta Force: Urban Warfare landed on my doormat, I couldn't            remember the last time I'd even turned my PlayStation on. In fact,            I had to rummage about in the back of a cupboard to find it,            blowing away the dust like it was some wizened old book. I plugged            it into the TV, popped the disc in the drive, pressed the power            button and .. nothing happened. Obviously my PSX has given up the            ghost while its younger sibling was attracting all the attention.            Which is a shame, because Rebellion were willing to give it a            decent workout with their PlayStation exclusive Delta Force            shooter. And what a workout it is - the poor old thing hasn't seen            action like this for years.                         Luckily then a standby was available in the form of the PS2's            back-compatibility. It's obvious from the outset that Rebellion            have spent an astonishing amount of time optimising and            re-optimising the code behind Urban Warfare, as the first            engine-rendered cutscene details the start of the game's story. The            proceedings open with a drugs bust in Mexico by a Delta Force team            led by John Carter, our protagonist. Things all seem to be quite            straightforward until he witnesses his team wiped out in a ball of            flames; apparently someone knew they were coming.                         Cue our John going off on a lone gunman crusade against the            terrorist organisation who disposed of his pals, all the while            attempting to expose a mole in the CIA and find out exactly why all            this is going on. So what appears at first to be a perfect            opportunity to be a gritty narrative-driven stealth fest actually            boils down to a bog standard first person shooter with smatterings            of sneaking about here and there. Damn.                    It's easy to be completely disgusted by the ropey graphics and            character models at first, and I kept having to remind myself of            the hardware I was playing on (or would have been playing            on, had it worked). However, despite the obvious limitations            Rebellion have done a sterling job of constructing a fairly varied            and engrossing world with plenty of detail and atmosphere. They've            even gone so far as to have a decent stab at facial animation,            although their effort at lip-synching leaves a great deal to be            desired.                         It doesn't take long before you get used to the dodgy visuals            though, and once you actually get stuck into the action it's almost            as if the PS2 never happened. The progression of the game is            strictly linear and played on a mission-by-mission basis, and while            the variety is quite satisfying it's completely predictable across            the disappointingly slight twelve missions.                        Fairly well directed in-game cutscenes separate each level and            progress the story, and this is where some of the game's better            voice talent and excellent sound design gets a chance to really            shine. We start out with an ordinary assault on a warehouse in            Mexico, battling our way through a band of miscellaneous goons in            order to reach their boss and question him. This is the sort of            scenario that Urban Warfare is primarily composed of, deviating            occasionally into some sneaky infiltration missions and of course            the ubiquitous sniping section.                    It's unfortunate then that the stealth is so disappointingly            implemented. The fact that there are specific missions that force            you into using stealth tactics only serves to underline the lack of            options you have in your approach during most outings. Despite            allowing you the use of silenced pistols, throwing knives, heat            sensitive and night vision goggles, and giving you the ability to            blow up fuse boxes to plunge the environment into darkness, it's            rare that you'll be able to maintain any kind of silent combat for            more than five minutes before it's time to break out the Uzi.                         Controlling Carter is fairly intuitive and, as you would expect            from a console shooter, a decent amount of functionality has been            squeezed onto the controller. The left analogue stick takes care of            movement, the right does the aiming and R1 fires your weapon. L2            and R2 perform left and right-leaning for poking your nose round            corners, while a quick tap will cause Carter to leap to the side.            You can also adopt crouching and prone positions via a clumsy            combination of the triangle button and the left analogue stick. A            similar system is also put to use when you want to manually reload,            and these combinations can be an absolute pain to pull off in the            heat of battle.                         The controls even extend to the ability to drag bodies around with            the triangle button. It's clear that Rebellion are nodding towards            Metal Gear Solid at various points during Urban Warfare, and this            is perhaps the most obvious feature that could be a homage to            Kojima's masterpiece. Sadly though it's rarely useful, except when            you have to play with only a stungun and you are forced to            be careful.                    The entire game could have been a serious contender to MGS had the            approach been given more thought. For instance, the tanker section            that we were half expecting to be a fairly obvious reference to            Sons of Liberty turned out to be a quick ~pop in and kill all the            bad guys, make a half-hearted attempt at being quiet, steal some            papers and then leg it~ affair. And so it goes on for the rest of            the game.                         At this point you might be thinking that I didn't like the game,            but that's actually not quite true; Urban Warfare really isn't that            bad. The action is quite fun and the sneaking about can be tense            and utterly challenging, it's just that we've been so spoiled by            much better approaches to this formula played on much better            hardware that we just know the grass is greener on the other            side.                         While Delta Force: Urban Warfare isn't particularly successful at            what it tries to be, it's actually a very competent first            person shooter. It's also a great achievement on the aged            PlayStation, although I can't help but think that given more            powerful hardware and some more thought this could have been a far            more engrossing title."}