{"ref": "https://www.eurogamer.net/ho-starfoxadv-gc", "date": "6 Aug 2002", "game_name": "Reviews", "text": "Although I'll endeavour to keep the embarrassing revelations about            the game's younger days to a minimum, a little history would not go            amiss. Developed by veteran Nintendo second-party codeshop Rare,            the game is actually a combination of two separate projects; the            next sequel in the classic StarFox series of games, and an entirely            new franchise, Dinosaur Planet. Combine the two and you end up with            a mish-mash of hi-octane shoot'em'up levels, somewhat more cerebral            adventure levels, furry anthropomorphic characters and rather            mean-looking dinosaurs.                         In the hands of a less experienced developer, this sounds like a            recipe for disaster; however, all the evidence suggests that Rare            have applied their significant talents fully to StarFox Adventures,            and come up trumps. It's hard to tell how close to completion the            version we played was; many aspects of it appeared to be fully            polished and finished, although in places the graphics were a            little rough around the edges. Given that the game will be out            within the next few months, it's fair to assume that it is            feature-complete, with only a bit of polishing elbow-grease to be            applied before it's shrink wrapped and ready to be snatched into            the greasy palms of your filthy little paws.                    The game starts with a short cutscene of a new character, Krystal,            who is a purple-hued fox-girl dressed like something out of Arabian            Nights. This, clearly, is the love interest of the game - she's            even the right species for Fox - but she's not the stay-at-home            type, and the first section of the game involves flying her about            on the back of a friendly pterodactyl, answering a distress call of            unknown origin. Attacked by an unknown foe, our first taste of            gameplay involves shooting fireballs at a giant airship. Once the            defences of the ship are subdued, Krystal boards and wanders around            a bit, learning some of the control basics of the game in the            progress and acquiring a mysterious key before being confronted by            the evil General Scales (he's a lizard in a suit of armour with a            bad attitude, call it racial profiling if you like but I think it's            fair to say he's evil) and summarily thrown overboard after a brief            lecture in the geopolitics of Dinosaur Planet.                         Landing on the site of an ancient temple which has been attacked            by General Scales' forces, Krystal speaks to several of the            triceratops who had been guarding the temple, and learns more about            the plot of the game. It's here that the third person adventure            gameplay of the title really starts to take form, with Krystal            solving a variety of textbook third person puzzles, avoiding            obstacles, speaking to NPCs and so on. What isn't present is any            combat beyond throwing explosive barrels, since Krystal's staff was            dropped in the battle with Scales' ship - only to be picked up by            Fox later on.                         All this running around with Krystal, fun as it is, isn't what            people really want from a game with StarFox on the box though. It's            not long, then, before we leave the furry minx behind and are            greeted by a welcome sight - the Great Fox ploughing its way            through space, carrying with it the usual cast of diverse heroes -            Slippy, Peppy, Rob the Robot and of course, Fox himself. Missing            from the cast is Falco, although his very omission suggests that            he's likely to turn up sooner or later and play a rather major role            in the game. The Great Fox is on its way to Dinosaur Planet to            investigate the rather unsettling way in which the planet is            falling apart, threatening to damage the rest of the Lylat System            as it does so.                    From here, it's straight into some good old StarFox action - at            least for about two minutes. A depressingly short section sees you            flying an Arwing through a complex asteroid field on the way down            to the planet, collecting gold rings to disable the planetary            shields as you go. The handling of the Arwing is perfect, and the            graphics in this section are great, but ultimately it feels like            Lylat Wars with a lick of fresh paint; it's perhaps the realisation            that there's only so much you can do with an on-rails 3D shoot 'em            'up that prompted the decision to make these sections into a small            part of a larger game rather than a game in their own right.            Traditional StarFox fans need not worry; there's plenty more Arwing            piloting later in the game, but it serves as a snack between action            adventure sections for the most part by the looks of things.                         After all of this messing about - possibly as much as half an hour            of gameplay if it takes you a while to do the Krystal sections -            you're finally treated to a fantastic realtime cutscene of the            Arwing landing on Dinosaur Planet. Fox hops out, and after some            brief explanation, you're in control. The level of freedom here is            quite high; run around and talk to the various dinosaurs in your            area, find things to do and accomplish them, upgrade your combat            skills; however, there seems to be only one path through the game,            so while your level of freedom in the local area is high, the game            is ultimately very linear. This is no bad thing if the plot turns            out to be interesting, but high quality plots haven't exactly been            a feature of StarFox titles in the past, making this one of the            more worrying aspects of the game.                    Later sections of the game also include large-scale set pieces -            such as the famous sequence with Fox being chased down corridors by            a gigantic tyrannosaurus - which will certainly spice up the            gameplay. Rare are trying very hard to do justice to some of            Nintendo's greatest characters, and are obviously mindful that fans            of StarFox are likely to want far more than Banjo Kazooie with            shooting sections. Speaking of doing characters justice, it's worth            mentioning the voice acting briefly. In the version we saw, the            quality of voice acting ranged from acceptable to utterly            diabolical; the word after E3 was that Rare planned to bring the            acting back to the studio and get some decent voice actors on the            case, something which would certainly benefit the game immensely.                         One area of the game which is certain to attract equal measure of            adulation and criticism is the graphics. Rare has decided to go            with a system which renders fur in real-time for the game; a            sensible move given the characters in question, but one which is            somewhat patchy in its success rate; in places, the effect in            fantastic, but elsewhere it can simply look blurry, bringing back            memories of the N64. The effect is emphasised by the fact that the            developers have used it to render grass and other fur-like surfaces            as well as the skin of the characters; if you like the movement and            life it gives to a surface, then this seems an excellent move, but            if the blur and occasional moiré seen in the rendering as a            result annoys you, it may be a major black mark against the            otherwise utterly superb graphics of StarFox.                    StarFox Adventures: Dinosaur Planet is certainly shaping up to be a            very interesting game indeed. It suffers by comparison with the            rest of the Cube line-up - there are few developers in the world            who can shine when placed against the likes of Mario Sunshine and            Zelda - but is still an excellent prospect for the console, and its            pre-Christmas launch should be one of the high points for the Cube            this year. Whether it will be remembered in years to come as a            valuable asset to the StarFox franchise or a noble failure remains            to be seen; but for now, the signs are good and the third outing            for Fox and company is shaping up to be a worthwhile investment for            all Cube owners."}