{"ref": "https://www.eurogamer.net/qt-meninblack2-ps2", "date": "5 Aug 2002", "game_name": "Reviews", "text": "The Men In Black have returned this summer, but if you've seen the            trailers, you've seen most of the film's best bits. Likewise, if            there were a playable demo of the first level of Men In Black II:            Alien Escape, then I would be able to tell you the same thing about            the game. Infogrames' movie cash-in is just that, and it's a poor,            by-the-numbers cash-in, which reminds me of trash like Time Cop            from the 16-bit days. Back then you walked along left to right,            pasting down the fire button and ducking to avoid being shot. In            MIB2, you wander around in circles shooting aliens, upgrade your            weapons and then do the same thing again. This practice continues            for more than twenty levels, and it's twaddle.                         Agents Jay and Kay have been reborn in a digital guise with none            of their big-screen charisma, and instead of acting as covert            operatives seeking to further interstellar relations, they toil            about killing anything which dares to move with their MIB-issue            shiny weaponry. Locations are pretty tired, with our heroes            trudging through some docks, a nuclear silo of some description (a            description I was bored enough to click through), the streets of            New York and finally, an alien spaceship. You won't find much            change between these 'varied' locations though, and the gameplay            dynamic of locking on and using L1 and R1 to strafe around blasting            rarely changes. Both men can leap about like wannabe Lara Crofts,            rolling and backflipping with ease, and this is handy when it comes            to dispatching the game's bosses, but at virtually no point does            the experience border on ~entertaining~.                         Graphics are relatively good, although in many respects they could            quite happily live on the original PlayStation. The lighting            effects are quite special though, with lots of flashing, lasers,            plasma and gases rolling around your feet, but much like the rest            of the game, it tires very quickly. The aliens all look like their            big-screen counterparts, but without their impressive CG detail and            the film's high production values they resemble just about every            other in-game alien enemy you may have dealt with in the past. They            are also identical to one another in design and behaviour, which            merely adds to the monotony. What else is bad? Well, don't get me            started on the music or the sound effects.                    I suppose it doesn't take much to con the cinema-going public out            of their precious ticket money these days, and Infogrames must have            decided to play the same game with their customers. On the bright            side, there are few people likely to come racing out of the film to            buy this, and the rest of you can heed my words of warning: don't            buy this rubbish."}