{"ref": "https://www.eurogamer.net/qt-gtadvance2-gba", "date": "31 Jul 2002", "game_name": "Reviews", "text": "Password save systems were the bane of every 16-bit gamer's            existence, besmirching the reputation of a number of otherwise            truly respectable adventures throughout the ages. Thankfully the            advent of CD-based consoles and memory cards quickly and quietly            put this menace to bed, but the coming of the GameBoy Advance            helped it to manifest itself once again in the shape of 16-bit            ports and SNES-style games, and GT Advance was a prime example. The            good news is that the sequel has appeared in the West complete with            its Japanese battery backup save system. The bad news is that            recycling the same old game in a rally guise just won't work these            days, especially with V-Rally 3 on the market.                         GT Advance 2 is packed with content - 15 cars, 14 stages, 42            tracks and a whole seven game modes to string them all together,            including a handy link cable mode - but a number of bad design            decisions constrain it and conspire to spoil the experience. For            instance, the game offers you the option to tweak your car            settings, and yet the arcade approach negates this entirely. The            designers have included small hills and bumps, but the Mode 7            graphics engine is the same as the original's, and it all smacks of            scotch tape and botched solutions to a flat racing dynamic. And            while V-Rally 3's almost 3D courses are packed with polygonal            scenery and agreeable visuals, GT Advance 2's are not.                         There are some license tests to complete before you get into the            action, and these are a good way to get to grips with the game, but            while they take some time to complete, they are unfairly balanced            against the player. The requirements for the S Class for instance            are ludicrous, and having your whole run discounted just because            you slipped one tyre over the edge of the track is daft. Elsewhere,            the rest of the single player game is unadventurously designed, the            AI is a bit too consistent, and although the menus and presentation            is generally acceptable, weak engine noises pale in comparison to            those in V-Rally 3, and the music wouldn't be too amiss in an            elevator.                    GT Advance 2 singularly fails to introduce anything new to the            handheld racing genre, or even to its own burgeoning series. It's a            nicely made game in places, but graphics, sound and design aren't            up to the same quality as V-Rally 3 and the gameplay lacks the same            depth. It feels less like a new game than GT Advance with a proper            save system, and we wanted that last year, not now."}