{"ref": "https://www.eurogamer.net/qt-bof2-gba", "date": "30 Jul 2002", "game_name": "Reviews", "text": "For those of you who missed the Breath of Fire series during its            heyday on the Super Nintendo, Capcom's GameBoy Advance port of the            original may have seemed a little complex, elaborate, perhaps even            tedious. With random battles raining down like a monsoon, it drove            a number of my friends to distraction, despite my will for them to            enjoy it. Fortunately, as 16-bit veterans will recall, the second            in the series was a much sleeker adventure, offering a far more            agreeable range of characters, a more interesting plot and a total            of about 30 hours of enjoyable turn-based role-playing gameplay.            And fishing. Oh yes.                         Thankfully, BOFII does not require an intimate, or even casual            knowledge of its predecessor - it's a standalone adventure. As            usual, the game's star is named Ryu, and unlike the first game,            which threw plot at you by the barrel-load from the very outset, to            begin with he's your average ignorant RPG lead. The story is woven            for him creatively and at a manageable pace, as he walks along on            the low-res world map and through typical cartoony environments,            dispatching enemies in random turn-based battles, and gradually            learning about the White and Black Dragon Clans. He also gathers            friends around him until you have a nice selection of characters to            take into battle, and the variation in their fighting styles is            enough to place importance on party arrangement. Although random            battles still grate, the more experienced you become and the higher            the levels you reach, the less encounters previously explored areas            will throw up.                         BOFII has aged better than its predecessor, although it's still            quite a slog at times, and the lack of improvement for the new            handheld version is a bit irritating. Like the first GBA BOF, you            can trade items via link cable with other adventurers (if you can            find any), but elsewhere you can only pick a character name of up            to four letters and the graphics look more GBC than GBA. With            role-playing games like Golden Sun available on the system, this            pales in comparison. That said, as a tale of intrigue and as an RPG            it's a solid accomplishment, just as it was when it was first            released. The game is littered with wit and diversions, including            the aforementioned fishing game, which I spent more time playing            than I did adventuring back when SNES games were £60 a throw.                    If you enjoy heavy duty turn-based role-playing games along the            lines of the early 16-bit Final Fantasies, and the slight technical            inferiority doesn't put you off, Breath of Fire II is a thoroughly            enjoyable adventure which will take many hours to complete. In the            absence of too many RPGs in the West, this is perhaps the next best            thing to Golden Sun, and makes whiling away the muggy, humid hours            of a British summer all the more bearable."}