{"ref": "https://www.eurogamer.net/battlezone-vr-review", "date": "11 May 2017", "game_name": "Battlezone (VR)", "text": "Battlezone VR is not quite what I expected, and that's not because I didn't trust Rebellion to make a game that's simple, direct, scrappy and endlessly endearing. Battlezone VR is not quite what I expected because, as well as being a fast-paced blaster in which you knock about in tanks and pretend you're still basking in the vector glow of an arcade great, it's now also a roguelike.Battlezone now takes place on a procedurally-generated map made of a number of hexes. Far off from your starting point is your final objective, and to get there you move from tile to tile, triggering little battle arenas and steadily growing more powerful - while your opponent grows in power too. There are Supply tiles where you can change your loadout and buy new gadgets. There are probes that you can drop to get a sense of what awaits you in the no-man's land that lies ahead. There are hearts you can lose for being defeated in combat, and when they're all gone, so is the board you've been playing on. Wipe! Game over.This structure works, I think, because, like so much else in Battlezone VR, it's simple, direct, scrappy and endearing. It's not about discovery or exploration or even making choices: it's basically a way of shuffling and dealing a range of straightforward objectives that define the chunky, surprisingly spacious maps you're dropped into where the real action happens. Win over a few control towers and stop an enemy signal. Invade a base and then blow it to pieces. Destroy a convoy. This is nothing you won't have seen before, and that's the point. This is about feeling the cheery comfort of familiarity as you unleash hell - or at least heck - on your AI opponents.Working within a tight budget, by the looks of it, Rebellion has handled things very nicely, then. The interior of your tank is a wonder of retro-future technology, with thick display monitors connected with messy lengths of cable, while a huge round radar at the center brings back all the right memories of Elite. The windshield offers a generous view of the action, and for once I didn't feel particularly sick as my tank scudded over the surface of the geometric worlds I visited and razed. This is tank warfare, but it never feels particularly tanky. It's hover-tank warfare; in fact, you feel like you're in control of the puck in a game of air hockey, except this time the puck has a gun.A couple of guns, probably. The environments the battles play out in are crisp and sharp-edged, with simple colours and bright lines of light invoking the Vector aesthetic of the original game without being too self-consciously retro or abstract. These are worlds that are made to resound with artillery, and beyond the immediates of positioning and taking aim - taken care of, as it happens, with thumbsticks, while you use your head to look around - most of the tactical oomph of the game comes down to deciding on your tank type, your loadout, and the way you're going to manage the eccentricities of each weapon. Would you believe, when it comes to all these things, that it's nothing that you won't have seen before? A missile may be powerful, but it will be balanced with a lengthy lock-on during which you must maintain line-of-sight. A mortar-type affair will have to contend with a small clip and a long reload. Exotic weapons await, along with a range of other upgrades that you unlock or pay for with in-game earnings as you play, but this remains a very straightforward blaster, and it's all the better for it. The polygonal fireballs the game conjures convey a wonderful sense of impact, and if you're too trigger-happy you can use all of your best ammo and have to make do with an emergency gun that feels suitably feeble. The important things, in other words, are accounted for.Enemies come in tanks, in drones, in a range of other chunky shapes, and while they aren't blessed with brilliant AI, as they swarm on you they can still cause an awful lot of damage. I I suspect Battlezone VR works best if you're playing with friends, and a co-op team of four tanks is a wonderfully chummy thing to be a part of. Is it basic? Absolutely. But it's also colourful and heartfelt and, despite its fast pace, it didn't make me remotely sick. There are showier VR games out there, for sure, but this is a nice thing to return to once you've had your fill of gimmicks."}