{"ref": "https://www.eurogamer.net/r-gtconcept-ps2", "date": "24 Jul 2002", "game_name": "Gran Turismo Concept", "text": "Gran Turismo Concept 2002 Tokyo-Geneva is a bit of a turn-up for us            PAL gamers. Originally, GT developers Polyphony Digital had planned            to release a special version of their inimitable racing series in            Japan only, featuring stunning concept cars from the Tokyo Motor            Show 2001, rather like the branded demo versions it produces for a            handful of car manufacturers in the far east.                        Just recently though, Polyphony (or perhaps Sony) underwent a            change of heart and declared GT Concept bound for Europe, with a            collection of cars from our own beloved continent as well as some            Korean and American vehicles to be squashed in along the way. The            screenshots were stunning, and a stopgap was certainly welcome            while we waited for the true Gran Turismo 4 to emerge.                         Having polished the game off in a couple of days though, I'm            feeling a little jaded about the whole thing. This is a bite-sized,            arcade version of the GT we love. Sure, it has more than 80 cars,            most of which we'll never get a chance to see in the flesh, let            alone drive, and the 'Concept' moniker means you get to race things            like the infamous Toyota Pods, as well as western cars like the            Ford Concept GT40 and the Vauxhall VX220. Sadly it's a bit rough            around the edges and decidedly short-lived, and it isn't a patch on            GT3 in terms of challenge. So what went wrong? And at £25 or            thereabouts, is it still worth considering?                    First of all, Polyphony haven't made too many changes other than            the car roster for this PAL edition - even the main menu still has            ~Gran Turismo Concept 2001 Tokyo~ scrolling past in the background            - but it's a very nice PAL conversion, virtually borderless,            although it could have done with some 60Hz loving.                        Still, the graphics are a step up from GT3, with a lot of the            wrinkles ironed out, like the big, chunky, primary coloured            advertising hoardings and the sometimes lacklustre texturing. The            graphics still fall short of perfection in a few places - there are            no damage models and the cars don't pick up any dirt or dust,            emerging pristine from a rough rally session or a full-on            nose-to-nose collision - but the cars continue to look uniformly            great, and I still maintain that the faked reflections look nicer            than the real deal found in the Xbox's Project Gotham. And when            coupled with the incredible amount of trackside detail, the            stunning car models scream by in almost TV-quality replays. This is            certainly the prettiest racer I can remember.                         Unfortunately there are only five tracks in Concept, however            detailed they might be. Midfield Raceway, Tokyo R246, Swiss Alps,            Tahiti Maze and Autumn Ring can all be played in reverse and            represent a fairly decent amount of racing, but this isn't a patch            on the game's predecessors. After recycling most of GT2 for the            series' PS2 debut, the last thing we expected here was a tiny            complement of raceways.                    Concept is a lot easier than its predecessors too. The proper            license tests, which would demand that you learn how to drive a car            properly and not just how to twiddle the analogue stick at the            right moment, are gone, replaced by incredibly simple one-lap            versions with an optional pace car which turns the whole thing into            a glorified follow the leader exercise. More forgiving controls            mean that you can complete these to Bronze or Silver level without            really making too much effort - I had all the Silvers on my first            time through - and that it's perfectly possible to corner at high            speed and not end up facing the wrong way, pancaked against a wall.                         Which brings me onto the biggest omission, the Gran Turismo mode.            Instead of completing a lot of qualifying races and working your            way to the top of the racing ladder, GT Concept simply offers ten            Single Races (one for each track, forwards and backwards) in two            difficulty brackets, and these won't take you more than a weekend            to win. You unlock a new car for each license test and race, and            the Game Status page displays them all and also opens the door to            the odd added extra, like the Toyota Pod race, although after all            that hype it's just a little slalom with a controlled braking test            before the finish line - vaguely enjoyable, but pretty slow.                         Furthermore, the AI still isn't up to much. If you get ahead of            the pack they stand almost no chance of catching you. As long as            you don't lose time by sideswiping them you can easily pass rival            cars on a straight, whereas in GT3 you were struggling to keep            ahead of them for the first few hours, whatever their actual racing            abilities.                    Because it's been greatly simplified, GT Concept offers virtually            no longevity for the single player. You'll polish off everything            that's on offer in a few days if you even glanced at GT3, whereas            with the original it would take weeks or even months to finely hone            your skills and become proficient with a variety of high-speed            racers. If you can convince a friend to join in, the split-screen            multiplayer is a much smoother, more detailed experience, and as            with GT3, there's an i.Link mode for those with the means to make            use of it, but ultimately this is a racer low on content and high            on glamour.                         There are even a few question marks in the glamour department. The            enormous soundtrack which backed up GT3 had to be shoved aside at            times so that you could pay more attention to the game's sound            effects, but this arcade-centric edition could do with an improved            offering - instead, standout tracks include a trio from Feeder and            a couple from Grand Theft Audio, with the rest occupying the middle            of the road. It's also annoying that you can't adjust the relative            levels of the sound effects and music, because the sound effects            are too noisy to make out the music most of the time anyway.                    If you don't fancy getting your hands dirty with GT3, then you            might consider GT Concept - with its almost photo-realistic visuals            and collection of elite vehicles and track designs it makes for a            bloody good racer, touching on straight up tarmac battles and rally            racing in equal doses. Sadly though, this disappointingly simple            distraction will be swept aside in a matter of hours by GT            die-hards. And ironically, GT virgins might find better value in            the now cheaper GT3 and its arcade mode, which might just spur you            on to enjoying the full-blown Turismo.                         GT fans, this is a stop-gap, and a pretty minute one at that, so            make your mind up now if you think 25 quid is worth a weekend's            entertainment. Arcade racing nuts, this is for you, and at the            price it's a steal - just make sure first that you wouldn't prefer            GT3 in the long run, because if you think you might, you probably            will."}