{"ref": "https://www.eurogamer.net/r-spider-man-gba", "date": "6 Jul 2002", "game_name": "Spider-Man The Movie 2", "text": "Ah yes, big budget movie tie-in platformers. I'll spare you a line            from my collection of cash cow metaphors, but it's safe to say I            popped the Spider-Man: The Movie cartridge into my GBA with a            distinct, brooding cynicism about me. My reasoning? The GameBoy            Advance hardware is and has been proven to be the perfect excuse            for developers to revisit the 16-bit era's penchant for dodgy            platformers and movie cash-ins, and having seen the other console            versions of Spider-Man I harboured few illusions about this            handheld iteration.                         At first glance, Spider-Man on the GBA appears to be a perfect            case study of the above. Sideways scrolling paint-by-numbers            environments? Check. Chunky adversary sprites meandering aimlessly            back and forth? Check. Insipid boss battles that fail to extract            any skill from the player? Check. All the signs of a pathetically            translated license are there, so why is Spider-Man as charming as            it manages to be?                         There's just something about the game that removes the cynical            sneer from my face and replaces it with a relaxed smile. Much of            the game is standard platform fare and rarely deviates from being            completely ordinary, but in general Digital Eclipse have made a            really very decent stab at it. The handheld version of Spider-Man:            The Movie takes a somewhat different approach to the other console            versions; in that it's more of a nod in the direction of Spidey's            comic book exploits than anything else, and in that the developer            has thrown the elaborate storyline out of the window.                         Cartoon moments are scattered throughout the game as Spider-Man            uncovers a conspiracy against him conceived by the Green Goblin.            ~With great power comes great responsibility,~ our hero chirps,            employing enormous speech bubbles to relay his thoughts before            diving off the screen and into the action as his masked,            webslinging alter-ego. Another cute touch is the Batman-style            effects bubble that pop up when tackling adversaries - it's always            more fun to ~Pow!~ and ~Thwack!~ your foes than to just smack them            in the mouth and walk on by.                    The most striking thing about Spider-Man is the quality of the            hero's animation, as he swings gracefully through the air, latching            onto any surface he can reach and swooping about on his miraculous            silk line, and as he crawls along walls, and fights off the            attentions of thugs en masse. Unfortunately, the animation seems to            be the star of the show and can really get in the way at            inopportune moments. It takes too long to move from one animation            to the next, a process which can't be interrupted and leaves Spidey            hopelessly exposed to the legions of henchmen and their wimpy            pistols.                         The controls are at times unresponsive and finicky, and sometimes            just plain odd. For example, every so often Spidey has to sling a            web against a lamp post and then move round it like a ball on a            string collecting bonuses, but this is more of a fight against the            twitchy directional pad than an easy score. It's also irritating to            have Spidey stick onto every single surface, when often all you            really want to do is stand up straight and run along on-foot,            particularly during the second level set in the confines of a            derelict building. Level design is another cause for concern, with            foreground and background graphics blending into one another here            and there, confusing the hell out of the player - a real problem            during levels where time is more of a factor.                         Digital Eclipse has made an effort to provide the player with            regular incentive, but their attempts have generally come up short.            You can use the Select button to snap pictures of Spider-Man's            antics as you play, but the so-called reward is a handful of            digitised shots from the movie. You can swing around the streets in            pseudo-3D between levels, but these sections are too chuggy and            short-lived to be any fun. In effect, the developer has run up            against the limits of the hardware, not to mention the limits of            their own imaginations.                         To be fair, this is a heck of a lot better than its predecessor,            Mysterio's Menace, but it's still not quite there. As Digital            Eclipse will now have learnt, there's only so much fun you can            inject into an ageing formula, and apparently the GBA isn't            powerful enough to produce a proper 3D platformer. The bonus            sections here offer a little variety (even if they are a mite            lacklustre in practice), and the presentation is of a high            standard, in particular the short portion of digitised FMV at the            start of the game and the slick sprite animation throughout. 9/10            for effort then, but overall the game comes up short."}