{"ref": "https://www.eurogamer.net/r-gitaroo-ps2", "date": "29 Jun 2002", "game_name": "Gitaroo Man", "text": "These days, I sometimes wonder whether the health of the Japanese            economy rests solely on exporting rhythm-action games [oh yes? -            Ed]. The latest evidence in favour of this [convenient] notion is            Koei's Gitaroo Man, yet another bizarre button-bashing affair set            to the strains of excessively odd musical stylings. I won't beat            around the bush here - Gitaroo Man is stranger than coherent            sentences rolling off David Beckham's tongue on the same day as the            wedding of Mario and Bowser.                         The abject nonsense of the spectacle is only partially            acknowledged by still shots, and only with the epilepsy-inducing            graphics and wailing music right in front of you is it possible to            fully appreciate the sheer level of insanity on display. It's an            extremely endearing kind of insanity though, and from the perky            title sequence, through to the menus and into the game itself there            is bound to be something that brings a smile to your face.                         With the rendered introductory sequence and the sequences between            each level, the game attempts to form something resembling a plot,            and it goes a little bit like this: you assume the role of the            young (and bizarrely named) U-1, our dorky and unassuming hero. His            pet dog Puma decides that it's about time his master knew that he            was the last of the Gitaroo Men, a kind of guitar-wielding super            hero. Luckily from the perspective of the programmers, just as this            news is broken to little U-1, the evil Gravillian family sets their            sights on capturing all the guitars and taking over the world, and            so it's up to U-1 to take care of an array of deranged enemies and            defeat the Gravillians utilising his prowess with some, er...            gnarly licks. Or something.                    The gameplay is a slight deviation from the rudimentary Simon Says            button combinations seen in titles like Parappa the Rapper and            relies on a sense of melody and rhythm to a far greater extent. As            the battle commences, a blue line will trail its way across the            screen, with highlighted sections indicating where you should press            and hold the circle button, which in turn causes your guitar to            emit chords that weave themselves seamlessly into the music.                         The tricky part is that as notes bend and wave in the song, you            need to guide U-1's focus using the analogue stick and a sort of            ~field of vision~ indicator. Keeping your focus on the meandering            line whilst simultaneously pounding out a convincing rhythm can get            extremely stressful at times, especially as the game progresses and            demands some ridiculously complex button combos from you. Not            content with that, you also have to defend yourself and for U-1 to            defend against the enemy's melody, he needs to resort to button            bashing. Thankfully, the game doesn't rely on defence to an            irritating extent, merely a troubling one, and although some of the            tasks can seem practically impossible, it rarely strays from            offering steep challenges as opposed to descending into sheer            frustration.                         The presentation is of a generally high standard; the graphics are            heavily stylised and occasionally beautiful in their own completely            nuts way, and the cut-scenes are wonderfully produced and            childishly entertaining. Gitaroo Man is also musically competent,            thankfully, jumping to and from genres with reckless abandon, and            U-1's guitar parts blend into the tunes instead of perching on top            of them.                    Gitaroo Man is a genuinely impressive little title with something            fresh to offer fans of this rather niche market. As is usually the            case, longevity is an issue here with only eleven levels to rock            your way through, but the Versus mode is really quite a hoot when            you've got an hour or so to kill after the pub. It's not going to            be to everybody's tastes, but if you're a fan of Parappa and the            like then you could do a lot worse than to pick up this charming            example of rhythm-action."}