{"ref": "https://www.eurogamer.net/r-spider-man-x", "date": "18 Jun 2002", "game_name": "Spider-Man: The Movie", "text": "Spider-Man used to do whatever a spider can, but if Treyarch's            hotly anticipated Spider-Man: The Movie is anything to go by, our            old pal Spidey has opted to spend his latter days performing            tedious fighting moves on large groups of disorganised thugs in            warehouses, whilst one or two of them stand at the back taking pot            shots with a collection of pistols and machine guns. For those of            you with the film already behind them, Spider-Man: The Movie is a            journey packed with all of the nomenclature and none of the spirit.                         Spidey's outfit looks good, and his world looks good too. The            figure-hugging red suit with its black web motif and huge eyes is            sleek and resplendent with detail, although - as with the film -            Peter Parker begins by donning a pyjama-suit type arrangement of            red and blue cotton as he swings past shiny, reflective buildings            and through vast cityscapes. Spidey's animation is excellent            throughout, and we rarely tired looking at those inventive special            moves, nor his ongoing battles with the openly nefarious Green            Goblin in his same-as-the-film costume. The scenery and its level            of detail varies depending on distance, but it's much less            noticeable than you might imagine, and the mat of shuffling cars            and street furniture below provides a decent backdrop.                         Sadly though, interaction with said scenery is best described as            unforgiving. In the bottom right of your HUD sits your objective            compass and height meter, and the latter is a clue to the game's            limitations. Each aerial level is condensed into a sort of height            system, with objectives indicated on the height meter in blue and            your position in red, and as you might already have guessed, you            can't go above the top of the meter as it relates to the real world            (despite your swinging from an invisible ceiling) and you can't go            below it or you fall inexplicably into the traffic below and die.                    Swinging isn't the game's mainstay though, because for some reason            the energetic, hyper-pubescent maelstrom of discovery that followed            Peter Parker's infamous spider-bite is ignored entirely in favour            of jus' fightin'. The game is effectively one big tirade of            vengeance, eschewing the film's various other themes in favour of            emphasizing the pursuit of Uncle Ben's killer, and as such it is            dragged out and dragged out until the Green Goblin shows up and            starts causing trouble.                         A typical scene involves a big room full of aimless thugs. You            avoid them for as long as possible by crawling around the dark            recesses of the ceiling (the action is viewed from above and behind            at all times, with a transparent ceiling where necessary), until            stealth fails and everybody knows where you are. At which point,            you have to leap down and call upon some of your scrolling            beat-em-up style repertoire of special moves, which are collected            and not learnt. They are all outlined in the pause menu, as Bruce            Campbell will tell you in the tutorial voiceover (nice, but no Stan            Lee), and become available as you find partially hidden spider            symbols.                         However, due to the nature of the feeble AI which sees enemies            standing in groups with a couple off to the side using projectile            weapons, you spend most of the time hammering the A and B buttons            in rough unison to try and produce some of these moves, or just            wrapping the bad guys in webbing and beating them up one by one,            and the complex control system along with the combative Xbox pad            causes all sorts of difficulties, as do the imprecise jumping and            fighting mechanics. Whatever happened to Controller S by the way,            Microsoft?                    Once dispatched, enemies disappear comically making way for another            open door and another room of bad guys, or if you're lucky the            discovery of an overhead vent through which Spidey can zip between            rooms, turning on and off the usefully placed electric boxes which            control the bare electric cables impeding progress through the            vents. Hang on, why would air vents have loose electric cables? Oh            well. Levels continue to end abruptly and saving takes a peculiar            amount of time for a process involving just the hard disk, but then            what's one small problem amongst a hundred others?                         A handful of scripted events should help to alleviate some of the            disappointment, but unfortunately they do not, taking the shape            instead of a ludicrously speedy forklift truck ramming            through the then-flashing Spider-Man and similar unlikely            and extremely obvious cartoon/game clichés. Speaking of            clichés, if you press in the right thumbstick you can target            areas using your web and zip to them - useful in avoiding leaky gas            pipes but tired, boring, repetitive and done-done-so-very-done            elsewhere.                         Take a trip outside and things start to look up (which is just as            well, because as previously described looking down is a recipe for            disaster), but only for as long as it takes for the imprecise            control system to get the better of you. Slamming the Goblin into            the side of a skyscraper would be great if it didn't involve trying            to balance your use of left analogue stick for turning and moving            up and down, whilst centring the camera with the right thumbstick            and manoeuvring for height and speed using the right trigger.                    Other problems stem from flaws in the film's makeup, like the            game's poor imitation of the rather geeky young Maguire, and the            almost singularly anonymous Danny Elfman score, but Spider-Man: The            Movie makes enough of its own mistakes. I know I'm being harsh, but            to promise so much and then nip the possibilities and imagination            at the bud is almost worse than just completely failing to achieve            anything. The fact that Spider-Man begins entertainingly enough,            and that you discover its flaws gradually is almost the exact            opposite of the way many people found the movie, and it's almost            worth going to see the film again to cleanse yourself.                         Ardent fans might point out that Parker's passage of discovery in            the film starts out rugged and improves steadily until he's a            master of the Spidey art - like learning to toddle, then walk, then            run - but those same fans would have to accept that a game starring            an infantile Spider-Man with none of the big-screen emotion and            apparent altruism is a failed attempt, and when put alongside the            other intrinsic problems that dog the game draws a very weak            picture.                         If you haven't got the point yet, then this is one to pass on.            Fans of the comics will get more out of the original PSone version,            which is probably cheaper than the cost of going to see the film at            this point. For what it's worth, the Xbox version of Spider-Man:            The Movie is the best of the bunch, with sharper visuals and more            gloss and shine, but I would still urge those with the facility to            seek their Spidey-thrills elsewhere, because the free-spirited            arachnid's latest adventure is a pale shadow of its former self."}