{"ref": "https://www.eurogamer.net/r-nbacourtside2002-gc", "date": "28 May 2002", "game_name": "NBA Courtside 2002", "text": "Football, we understand. Any monkey in a green suit can tell you            whether or not the ball has crossed the goal line, and whether that            two-footed stud-platter you just served the right back was            legitimate or not - in fact we might even suggest employing monkeys            as a cost-cutting solution to FIFA's current financial problems -            but put that same monkey, or indeed your average European, on a            shiny wooden court with a bunch of seven foot men in vests and            shorts, and before long he won't know where he is, what he's doing            or what his name is.                         Basketball games are not all the same, whatever you may think, but            sometimes they take the best bits of other games and serve them up            better; if only football games could still do that. NBA Courtside            2002 offers you all the statistical authenticity of its            EA-developed rivals, a simulation of basketball frankly unmatched            by its main competitor, and at the same time introduces an arcade            mode to rival the almost brilliant NBA Street in terms of            'largeness'. It's like a big measured V-sign pointed in the general            direction of John Riccitiello and his cohorts at Electronic Arts.                         Coupling all of the above with a unique and rewarding control            system, some great graphics and wonderfully balanced AI, NBA            Courtside 2002 is so close to being the pinnacle. A few scant            remaining problems conspire to spoil the overall experience,            although frankly it's still great. If you like basketball and you            bought a Cube, this is the game to get. Want to know more? Keep            reading.                    NBA Courtside 2002 was released in Europe last Friday, three weeks            after the Cube itself stormed the charts, and as Nintendo are sadly            no longer best buddies with developer Leftfield, it is probably the            last Courtside game we'll see. So why is this one worth adding to            your collection?                         Well, it's comprehensive and diverse. That's what I like            about it. I may not care a jot whether it's statistically accurate,            nor whether the players resemble their real-life counterparts -            although it is and they do - but give me the option to build my own            basketball team from scratch, assigning attributes and giving them            all funky names and horrendously ugly mugs, and I'm happy. Give me            the opportunity to take them onto the practice court and check out            their moves, and I'm hooked. Let me throw them into the mix with            professional basketball teams, or take them out onto the streets to            compete in the ghetto with real backstreet ballers, and I can't get            enough. Or just let me pick any team I like and do the same with            them. You know it makes sense.                         There's also a unique and rewarding control system. How can it be            both? You'd think with a decade or so of experience EA might have            perfected that by now, and at first glance it doesn't seem all that            interesting or different. The left analogue stick handles the            movement, while the whopping great A button is your jump shot or            block, depending on the situation. The B button passes or steals,            the X and Y buttons produce some dainty tricks to outwit the            opposing defence, and the shoulder buttons (L, R and Z) get the            adrenaline pumping, enable you to crouch or back into a defender            and call for set plays. This is quite complex to begin with, but            you soon get the hang of it.                    To really do some damage though, you need to pay attention to the            other bits of the pad, and using buttons in combination. First of            all, if you clutch the adrenaline-boosting L button or one of the            trick buttons while you pass or shoot, you'll either toss it to the            furthest player up the field or execute a different move to the one            you would have done were you just giving A or B a tickle. If you            delve a little deeper and trot about the training court for a bit,            you'll also discover that the d-pad lets you set your offensive and            defensive positions on the field, too.                         But the real shocker is the C-stick. If you can get the hang of            it, you can use it to play the ball between players, and if you can            master the action of running one way while tricking and tossing the            ball in the other direction with the C-stick, you will outfox even            the most monolithic of defences. Not content with that, you can            also feign shots, pass, shoot and dunk the ball in countless            numbers of ways, and the animation is intricate enough to            illustrate whatever action you take from whatever position you're            in.                         Graphically the game is extremely impressive, although sometimes a            lack of animation can be a touch frustrating. I found myself            wincing whenever the ball went off the court and a player ran to            fetch it, only to twirl round on a turntable without his feet            moving, but overall the level of detail and number of different            animations makes for a very varied spectacle. Graphics form an            extremely important part of any sports simulation or arcade game -            they're the glue that holds the whole mess of sport, strategy and            occasionally balls-out excitement together - and the courts, the            photo-realistic blanket of spectators, the sight of players waiting            impatiently on the subs bench and watching the basket sway up and            down as a player hangs from it in jubilation is great. The ball has            realistic physics too, and the clear black lines can be seen            against the brown exterior as it spins in the air.                    Equally impressive is Leftfield's delivery in the sound department.            Trainers (or sneakers) make that incessant high-pitched squeak as            the players dart around, and the crowd roars in time with the            action. The ball thumps and squeaks, the net swooshes and the frame            balks as it takes another heavy blow. It's all good.                         Trying out everything in the options menu will take you an            eternity. All manner of fouls, outs, time violations and general            rules can be toggled on and off, and you can even change the way            the C-stick behaves. During a match you can change to any one of            six camera angles, you can adjust strategies and view statistics,            and you can make substitutions or watch an instant replay.                         Any game which takes this long to explain is obviously very            complicated, and for some that will be a problem. The endless hours            you can pour into the Season Play mode, and the time you can waste            on fine-tuning your side, honing your skills or just plain learning            the control system to begin with may get the better of you. This is            a long haul, like a basketball RPG with things to learn throughout            and intricacies to uncover. It's almost the Pro Evolution Soccer of            basketball games, but at times the AI is a little too easy to            overcome. And of course for some the 'thrill' of watching humongous            male athletes swooping down from the middle of the court to bury a            slam dunk will leave them unimpressed. However, many of those            people can happily turn to the game's arcade mode, which endows            players with over the top abilities and souped up stats, and lets            you take advantage of hot spots from which high-point-high-risk            shots can be attempted.                    There's so much depth to NBA Courtside 2002 that you could stick            some water on top and call it an ocean. In the few weeks we've had            it, the game has grown and grown in promise, and although            admittedly a slow starter, it delivers the goods comprehensively.            As for the gameplay dynamic, it's feels and plays like basketball,            and you can even take to the courts with four actual players if you            feel like it.                        If you like to touch up your ball instead of beating it with a            studded boot, and you want a suite of features which makes NBA Live            2002 look like an empty shell of a game, then Courtside should be            your first port of call."}