{"ref": "https://www.eurogamer.net/r-sledstorm-ps2", "date": "14 Apr 2002", "game_name": "Sled Storm", "text": "With a pedigree as prestigious as SSX Tricky, Sled Storm had my            expectations understandably high, but after a few moments with EA            Canada's latest snow-capped release it became obvious that the two            games share more than just a mutual developer. At the heart of Sled            Storm are the same underlying mechanics that made Tricky so            enjoyable, but unfortunately basing Sled Storm squarely on its            predecessor has diluted its impact. Elements could quite easily be            transplanted between the two, and the underlying sensation of            déjà vu is striking.                         Your options from the start are extremely thin on the ground, save            the requisites that you'd expect from what is essentially an arcade            racer. Championship. Quick race. Time Trial. Multiplayer. However,            the latter options are practically pointless without first            unlocking extra characters, sleds and tracks in the championship,            tasks familiar to anybody who spent more than a day with either of            BIG's previous releases.                         To begin with, you can pick from three of the game's eight riders,            each with varying agility and a handful of tricks available to            them, before mounting their least impressive sled. Making your            decision really isn't particularly tough at this stage, as each of            the riders are of similar talent and are bottom-of-the-barrel            material. It's actually the sled you should be more interested in,            in terms of performance...                    Starting off on the games only open track, I straight away noticed            how odd the sled felt. Instinctively I was expecting a smooth,            sweeping control of a snowboard, but this was of course replaced by            a clunky and fairly unresponsive machine. The sled feels suitably            weighty, and handles in a sluggish manner as you attempt to get the            thing up an impossibly steep slope.                         Any sense of speed isn't immediately apparent as you start the            race. Gradually, though, as you get the hang of the trick methods            and handling, the boost meter at the right of your HUD begins to            fill. Tracks are littered with objects to break and knock down with            your sled, such as the beacons marking the edge of a turn, and            doing so also helps fill your boost meter. When you've finally            accumulated a satisfying amount of boost, you can let her rip with            the square button, and then your sled really gets moving.                         One of the most satisfying feelings in the game is squeezing every            last drop of boost out of your sled as you career up a hill in a            suitably disorienting mess of motion blur and booster flame,            launching into the air as you reach the crest and pulling off a few            ridiculous stunts whilst maintaining control of your mechanical            beast. Reach for a combination of the shoulder and triangle buttons            off the back of any jump and you can pull off a trick, just as you            could in SSX and its successor, and like those games Sled Storm            makes the act of performing feats simple and effective.                    Once you're over the sludgy handling, and you can happily power            slide about the course pulling off the occasional trick from time            to time, you need to get to grips with actually winning a race, and            this is where the game takes a slight departure from SSX. Before            long it becomes obvious that the emphasis is less on insane            acrobatics and more on placing first, and having sidelined the            'tricky' aspect to an extent, EA Canada has also implemented some            criminal race balancing...                         Even if you happen to be doing particularly well, boosting way            ahead of the opposition with plenty of snow between you and them,            you can be sure that a single slip-up will ensure that an opponent            (or several) will be past you in a flash. Conversely, should you be            bouncing off rocks and obstacles and getting hurled off your sled            every few seconds, the rest of the pack will very obviously slow            down to allow you to catch up. One of the reasons SSX worked so            well was that falling behind was salvagable if you put the tricks            in, and thus Sled Storm's lazy approach to this particular problem            grates.                         Furthermore, the game never really becomes particularly            interesting or unpredictable. Rather than each of the riders            performing in a race on the basis of their own individual            statistics and performance, they perform on the basis of            yours. This renders progression through the championship a            somewhat shallow affair, and you can lose interest very quickly.                    If anything's going to make you want to continue through the game,            though, it's to see what kind of ridiculous stunts the track            designers have pulled later on in the game. Sled Storm is a great            looking title, and many of the tracks are a pleasure to look at, if            a pain to race through at times. Things start off sedately enough,            with a jaunt down a well-constructed spectator-friendly course, but            things soon degenerate into the ridiculous and occasionally            downright frustrating. The more inventive tracks see you racing            through surreal, cartoon environments with circus, Christmas and            Halloween influences which would be more suited to a game like            Toon Car.                         The more sensible tracks have some irritating quirks, like badly            placed directional indicators. On far more than one occasion did I            take a visual cue to go right or left, and end up careening            straight into a wall or a solid piece of scenery. At other times a            slight falter can send you off course so severely that you lose all            sense of direction, and even lose track of which way is up. And no,            I wasn't drunk. I wish I had been - I might have enjoyed it then.                         It's hard to recommend that you go out and spend your money on            Sled Storm. Certainly don't play it expecting something of SSX's            depth or calibre, although unfortunately it's obvious that EA            wanted this title to be just that. My advice is to rent it, and            have fun for the two days of play you're likely to get out of it.            What starts off to be a fun little arcade racer turns out to be a            sadly wasted opportunity in the wake of far superior alternatives.            Hopefully EA Canda's other 'BIG' game, FreekStyle, will take a            different approach.                        -        SSX reviewSSX reviewSSX Tricky reviewSSX Tricky review"}