{"ref": "https://www.eurogamer.net/r-jediknight2", "date": "11 Apr 2002", "game_name": "Star Wars Jedi Knight II: Jedi Outcast", "text": "The Empire might have been defeated, but several years after the            events of Return Of The Jedi remnants of its once formidable might            are still causing trouble for the New Republic. Which is where Kyle            Katarn comes in. The hero of the original Jedi Knight is now a            mercenary helping the Republic to mop up their enemies, having            relinquished the way of the Force and hung up his lightsaber.                        As a result you start Jedi Outcast with nothing but your trusty            blaster, only regaining your weapon of choice and force powers as            the game goes on. Sadly this makes for a rather lowkey opening, as            the guns lack grunt and (most importantly) don't feel like they            belong in the Star Wars universe. The Flechette Weapon, for            example, is almost identical to the Flak Cannon from Unreal, and            there's even a standard issue rocket launcher included. To make            matters worse, most of the weapons lack accuracy and have slow            moving shots, which makes it hard to hit the broadside of a barn at            long range, let alone a moving Storm Trooper.                        Things pick up somewhat when you finally get hold of the            lightsaber, but it's not all good news here either. Melee battles            tend to be rather random, especially when you're facing multiple            enemies. One lucky blow to the chest is enough to kill you            outright, and the fights are really too fast for you to attack and            defend effectively. It's more about instinct and dumb luck than            skill. Fighting gun-toting enemies, on the other hand, is far too            easy. Right from the start Kyle can deflect every single shot that            is fired at him with perfect accuracy and absolutely no player            input is required. All you have to do is sit back and watch as your            enemies are killed by their own reflected blaster shots. As long as            they stay in front of you and none of them are armed with a rocket            launcher or sniper rifle, you have nothing to be worried about.                    Unfortunately your enemies don't really show much initiative in            these fights, and often just stand there blasting away at you until            they kill themselves. The sole spark of intelligence comes when you            face a large number of Storm Troopers, as one of them will almost            always try to circle around behind you. This is incredibly            predictable though, especially as somebody will usually shout ~get            behind him~ first to warn you of what is about to happen.                        Even navigating the levels seems to be a struggle for your enemies,            and they are easily confused. Sometimes you will see them running            around in circles, bouncing up and down on each other's heads,            getting stuck on a sharp corner or deciding that if they crouch you            won't see them. There's something faintly ridiculous about the            sight of a Storm Trooper doubled up as if he has chronic arthritis            slowly edging his way across a platform. At other times soldiers            ignore you completely as you pick off their buddies a few meters            away, just because they have their back turned on you. I guess            wearing those big white helmets isn't very good for your hearing.            The AI has occasional trouble operating lifts as well, and doesn't            seem to have fully mastered the art of opening doors. Indeed, one            enemy I faced killed himself by bouncing grenades off a doorframe            into his own face.                        On the bright side, the Force powers which you gradually recover            over the course of the game are highly entertaining. There's            nothing more satisfying than pulling a Jedi mind trick on a hapless            Storm Trooper and then shoving him off a ledge into a bottomless            pit using the Force. Other useful little tricks include dragging            weapons out of your enemies' hands or using a Darth Vader style            Force grip to lift a soldier clear off the ground. Best of all            though is Force Speed, which mimics the bullet time effects of Max            Payne by slowing down the world around you by anything up to 50%            for several seconds, complete with a nifty little motion blur            effect on your character. This makes lightsaber duels much more            rewarding, as you can actually react to your enemy's attacks and            counter or dodge them far more effectively than is possible when            playing at full speed.                    It's not just the authentic feeling Force powers that lift Jedi            Knight II out of bargain bin land though. Raven have done a great            job of recreating the atmosphere of the original trilogy,            effectively capturing the visual style of Imperial facilities and            lifting music and sound effects from the films to produce a game            which (for the most part) looks, sounds and feels like Star Wars.                        Storm Troopers can be overheard chatting about their weapons and            previous postings, and there are guest appearances from Lando            Calrissian and Luke Skywalker. Sadly Mark Hamill wasn't available            to provide the voice acting, so Luke sounds almost nothing like his            big screen counterpart, but it's nice to see a few familiar faces            amongst the invented characters. You even get to remote control one            of those cute little maintenance robots that scoot around the floor            of the Death Star.                        The level design is more of a mixed bag though. Some locations            perfectly mimic the architecture and lighting of Star Wars, with            intricately modelled Storm Troopers and the tell-tale snap of            blaster fire helping to suck you in. Then you find yourself            crawling through a long narrow cave with ugly green lighting, lousy            texture alignment and dull headcrab substitutes crawling around all            over the place. There are interesting puzzles to tax your brain,            but also silly sections which involve bouncing around between            platforms or navigating the seemingly inevitable warehouse full of            crates. At other times it's not at all obvious what you should be            doing, because the way out is through a pitch black room or via a            tiny ventilation grate hidden in the ceiling. And then there's the            bizarre sensor array which can apparently only be reset by jumping            around between a grid of precarious rooms dangling over a            bottomless pit...                    Jedi Outcast's multiplayer support is also somewhat hit and miss,            with a variety of modes on offer. Naturally free-for-all and team            deathmatch are both included, but neither works particularly well.            All too often battles devolve into a group of players flailing            around with their lightsabers, and then end abruptly as some git            drops a rocket in the middle of your fight and kills you all            instantly.                        You can choose to challenge a foe to a duel in the middle of a            game, at which point your force powers are deactivated and nobody            else can harm you for the duration, leaving the two of you free to            battle it out with only your lightsabers. This tends to be rather            time consuming, but you do at least get healed back up to a hundred            health if you win. Not many people seem to indulge in duels though,            and not every server will support this feature.                        Capture The Flag works somewhat better and can be fairly            entertaining at times, but the real genius of Jedi Outcast's            multiplayer support is Duel mode, a Rocket Arena style            winner-stays-on game where two players battle it out mano-a-mano            while the rest of the server watches as spectators. With no            distractions, human opponents and a full array of Force powers to            choose from, these bouts can be far more amusing than saber battles            in the single player game or the ad hoc duels of the other            multiplayer modes. And with a variety of player models and settings            on offer, including a Cloud City cryo chamber, it just looks and            feels right.                    Jedi Outcast is a rather patchy game, with moments of genius let            down by a lack of consistency. The guns are derivative and rarely            used once you get hold of your lightsaber, the melee combat clumsy            and chaotic, the AI poor and some of the locations derivative and            poorly designed. This isn't the game we were looking for, but it's            certainly no Obi Wan.                        -        Jedi                    Knight II : HSE InspectionJedi                    Knight II : HSE InspectionJedi                    Knight II screenshotsJedi                    Knight II screenshotsStar                    Wars : Obi Wan reviewStar                    Wars : Obi Wan review"}