{"ref": "https://www.eurogamer.net/r-smw-gba", "date": "2 Apr 2002", "game_name": "Super Mario World : Super Mario Advance 2", "text": "Building up the GBA catalogue with rehashed 16-bit classics is par            for the course nowadays, but on the bright side it does mean that            from time to time we get something as exciting and enjoyable as            Super Mario World to sink our teeth into. The game still stands up            to 90% of GBA software and is the pinnacle of portable platforming            delight. If you haven't played the ten year old SNES original            recently, or found yourself slightly irked at the short-lived Super            Mario Advance, then this could be just the game you've been looking            for.                         What made the SNES version of the game so enjoyable was the sense            of non-linearity and the scope of Mario's adventure, not to mention            the large number of innovative and hardware-straining features            first put to work during the course of the game. Although Super            Mario World has none of its predecessor's impact and these days            counts as a fairly simple game, it's a timeless platformer on a par            with anything else currently available to handheld owners. The            token story elements, outlined via crude cutscenes at the beginning            of the game and after significant boss encounters, concerns the            plight of Princess Peach who has once again been kidnapped in the            plumbing protagonists' absence. Mario and Luigi are off adventuring            on Dinosaur Island, and once they learn of the Princess' abduction            it's up to them to put pay to the interminable Bowser and his            endless stream of henchmen, hench-turtles and hench-soforth,            rescuing trapped Yoshis along the way.                         Yoshi's inclusion eventually led to his own game (a pair of them,            in fact), but it was here that he first really made his name. By            hatching an egg (many of which are strewn around the game) players            can jump on the back of Yoshi and use his big stomping feet to            dispatch troublesome bad guys, or his tongue to slurp them up.            Gobbled up items and baddies can often be spat out as fireballs,            giving Yoshi riders a particular advantage over their enemies, and            secret Star Road levels give players the chance to uncover            different coloured Yoshis, some of which do much more than spit            fireballs…                    These days Super Mario World may seem a bit formulaic, but there            are enough things to do and items to collect along the way to keep            you coming back for weeks to uncover everything. By visiting the            game's hidden Switch Palaces, players can give substance to the            many block outlines seen during the game, allowing them to reap the            rewards inside by bashing them with Mario's head. And as usual,            mushrooms, flowers and feathers are available, capable of bestowing            powers upon Mario until he takes a hit. The SNES original also            introduced the idea of a stored item, which is kept in a box at the            top of the screen and can be used by pressing select.                         Although Super Mario World is fairly faithful to the original SNES            version, there are a few slight differences. The most obvious is            that Luigi joins Mario on his quest, although his inclusion merely            gives players an alternative character with superior jumping            ability and adds nothing crucial to the story. The cart also            remembers a lot more data than it did before, charting individual            level successes and such, while the difficulty level has been            cushioned a little, so that taking a hit when powered up with            flower or feather abilities reduces players to 'Super' status,            rather than a piddly and vulnerable shrunken Mario. Despite the            addition of Luigi and other minor changes, the presentation is            spotless and the tweaked game seems to be just as fluid as the            original.                         Getting past some of the more strenuous levels is truly an            achievement, and if you like to complete your games properly, Super            Mario World will provide quite an exhaustive challenge that will            keep you entertained for many hours. Things never get too            frustrating though, as the game can be saved after a switch palace,            boss character or at other selected areas along the way. This fits            the dynamic nicely, and thanks to the lives structure means that            players only end up playing the really tough bits once or twice at            a pinch.                         It would be nice to think that 2D side-scrolling platform games            have come a long way from the days of Super Mario World, but they            haven't really. The 3D platform game is still being exploited on            heftier platforms, but for handheld gamers this is the zenith.            Following in the footsteps of the first Super Mario Advance,            Nintendo have also tossed the multiplayer Mario Brothers shell game            into the package. As nice as it would be to see a proper            purpose-built Mario game on the GameBoy Advance, in its absence            Super Mario World is the best we could have hoped for. And very,            very enjoyable it is too.                        -        Super Mario World :                    Super Mario Advance 2 screenshotsSuper Mario World :                    Super Mario Advance 2 screenshotsThe Nintendo ShowThe Nintendo Show"}