{"ref": "https://www.eurogamer.net/r-projectgotham-x", "date": "25 Mar 2002", "game_name": "Project Gotham Racing (Xbox Classic)", "text": "Like the Xbox itself, the title Project Gotham comes from Bizarre            Creations' original codename for the project. In short, it's            nothing to do with Batman. Both titles stuck though, and so here I            am reviewing Project Gotham Racing on the Xbox. Silly names aside,            this is a remarkably good driving game built on the foundations of            the Dreamcast's lovable Metropolis Street Racer, and so apart from            being one of the console's most promising titles, it's also the            quasi-sequel to a game we all bought and cherished. It has a lot to            live up to.                         Fortunately for Bizarre and Microsoft, punters won't be            disappointed with the work that has gone into Project Gotham            Racing. The game offers several driving modes, several garages            worth of licensed vehicles and a series of circuits based on            London, Tokyo, San Francisco and New York. It does so in style too,            with a glitzy interface, painstakingly detailed graphics and a            richly diverse soundtrack of popular tunes from all over the world.                         After creating your own driver, with customisable name, license            plate text and helmet details, you can dive into the Quick Race            mode to get a grounding in what makes Project Gotham tick. At first            you can only race the four easiest tracks, fighting to beat off the            competition in a series of fairly simple races, before moving up to            the medium, hard and very hard difficulty levels, which do exactly            what they say on the tin. Although this and the Arcade Race mode            with its Kudos-based scoring system touch on the underlying reward            structure of the game though, it's not until players sample the            Kudos Challenge mode that it all becomes clear.                    Kudos, a system invented for MSR, awards points during the course            of a race for slides, overtaking, catching air and pulling off            other feats. Points and multipliers clock up depending on how many            tricks you can pull off in quick succession, and Kudos Challenge            consists of increasingly difficult driving events (from timed runs            and overtaking exercises to fastest laps and full-blown street            racing) demanding not only quick driving and prowess behind the            wheel, but the ability to string things together and beat the            target point scores to proceed. Medals are awarded based on score,            and increasing the difficulty of any given event will gain you a            larger bonus when you cross the finish line. If you're particularly            bad at any given task, you can always use your joker card to double            the final score…                         Each challenge level picks up one more event than the last, and            the difficulty level ramps up sharply regardless of your fiddling            with Kudos targets. For each event you can pick any car you have so            far unlocked, and a minimum of bronze is required on all events to            unlock the next challenge level. There are some thirteen levels,            including a hidden one to uncover, and by the time I got to the end            of my Kudos Challenge I had somewhere in the region of 80,000            points, tallied up by the game and kept track of in the bottom            corner of the menu screen. A message of intent directed at any            budding challengers straying into my lounge.                         The reward structure is based on more than just Kudos though,            dishing out extras for the amount of time spent with the game, the            distance driven and other stats, along with challenge, quick race            and arcade race level victories and ultra high scores. There are            more than 25 high performance licensed vehicles to unlock, from the            humble Mini to the roaring F50 and everything notable in-between.            The Porsche models were my favourite, and as the game progresses            and you accrue more time and accolades, nicer paintjobs, helmets            and other gimmicks open up. It's an engaging structure, with            something new to strive for seemingly around every corner.                    GT3 and Ridge Racer fans may find the game proper a bit of a shock            to the system at first, with tight handling and a heavy emphasis on            burning rubber and keeping speed up through turns whilst pulling            off comical manoeuvres in tight confines to score big. Bleeding off            the speed before a corner often isn't enough, and even if you do            get round intact, the temptation to latch onto that handbrake and            slide harder to score bigger is almost irresistible. Often each            corner is a matter of no Kudos, no win - Project Gotham is harsh.                         Graphically Project Gotham is one of the Xbox's flagship titles,            and you can see why. Each of the cities has been put together            beautifully with the help of thousands upon thousands of            photographs and day trips to the places in question. London really            does feel like London, and as you race through Marble Arch, down            back streets and even along Horseguards Parade, the game feels            extremely realistic and slick. The cars, equally authentic, reflect            every detail of the sun-drenched environments through which they            pelt, and although these reflections were a tad juddery for my            liking, it's a picturesque effect. It's not all sunny days and            picnics though, with rainstorms and foggy tracks causing particular            problems for me during my first week with the game.                         The textures throughout are superbly detailed and the effects            mesmerizing. The water-laden streets of Tokyo glisten as my blue            Focus Cosworth hurtles along, splashing and kicking up water at the            base of the tyres and sliding dramatically at the slightest            inclination. And although it lacks the startling heat haze effects            witnessed in Gran Turismo 3 A-Spec on the PlayStation 2, the sun            gleaming on the hot tarmac creates just the effect you would expect            to see, and driving in uptown Manhattan with the sun shining            through the buildings at one point is a sublime touch. Then it's            the little details that tie the whole thing together, like the            driver visibly reaching for the gear stick, and the dust clouds in            St. James' Park. Even the heads-up display looks good, although the            lack of easily accessible target information in the Kudos Challenge            races is a bit annoying. You can, of course, recap everything in a            delightfully simple replay mode, and the hard disk provides            practically infinite storage space if you like replays...                    Unlike the rest of the game, Project Gotham's so-called Time Attack            mode is a bit of an eye-sore, featuring only 17 hand-picked tracks            unlocked through the other game modes, with little to attract            players already familiar with the twisting city streets. Meanwhile            the game's multiplayer mode is absolutely diabolical thanks to the            close camera angles obscuring the view and unusually resistant            front bumper playing position.                         Furthermore, these days a big name racing game needs a soundtrack            to die for, and although Project Gotham delivers to a certain            extent, with plenty of recent chart tracks and a handful of older            tunes including songs from Gorillaz and the Stereo MCs, for every            song that sounds good there are three more that don't really fit.            Thankfully you can give the game whatever soundtrack you want to,            thanks to the Xbox's music-storing hard disk, and the in-game DJs            (borrowed from a major local radio station for each city) will even            introduce licensed music found on your hard disk. Fairly academic            unless you lower the default volume on the sound effects, mind.                         There are many hours of play to be extracted from Project Gotham,            but they may come at the expense of some tedium, repeating the same            tasks over and over and seeing the same pieces of each city in            different places making up slightly different tracks. Visual            effects quickly run dry and the game seems to lose its momentum,            not helped by the fact that it turns to stone almost a third of the            way through, stunting progression. Perseverance uncovers a plethora            of new vehicles and bits and pieces, and keeping a running Kudos            total lets you show all your friends how good you are with one            easy-to-remember detail, but it feels like there's something            missing…                    It would be nice to say Project Gotham is the best driving game            I've seen, but it isn't. With Rallisport Challenge available at            launch, it probably isn't even the best driving game on the Xbox,            but it is a damned fine one irrespective. Devotees of Metropolis            Street Racer will lap the game up interminably, and even a hardened            GT and Ridge Racer nut like myself found it hard not to be impaled            by this Dark Knight's sceptre of entertainment. Admittedly it's not            one hundred percent of everything we hoped for; visually, aurally            and in terms of gameplay. It's a bit too tough in places, but there            is plenty of variation, authenticity and charm to the game, and            anything that I can play for four hours straight without a break            deserves a glowing accolade.            UK release Date - available now                    -        Project                    Gotham Racing screenshotsProject                    Gotham Racing screenshots"}