{"ref": "https://www.eurogamer.net/r-rockmanager", "date": "16 Mar 2002", "game_name": "Rock Manager", "text": "Rock Manager is not a game that takes itself seriously. Over the            course of its eight scant missions you'll get to turn the tone deaf            daughter of a Russian mobster into a star, manage a pair of feuding            brothers who bear more than a passing resemblance to Oasis, take a            past their prime heavy metal band on one last world tour, and send            a scientifically manufactured pop band's sales into orbit            (literally) with a tune that sounds like a cross between a            Eurovision Song Contest entry and the Hamster Dance song.                        The first few missions ease you into the swing of things, starting            you off with access to only a few key buildings in your home town            of Rock City and introducing you to the basics of the game. Most            missions will begin with you taking control of an existing band or            singer, although you can hire and fire artists ranging from cheap            talentless punks to arrogant overpaid pop divas, each with their            own needs, tastes and talents .. or lack thereof. Your next task            will be to sign a licensing deal to get hold of a song (most of            Rock City's musicians can't write their own apparently) and then            head over to a studio to record it.                        This is where the real fun begins, as you find yourself faced with            a mixing desk which allows you to adjust the relative volumes of            your band members (or mute them entirely and replace them with            session musicians if they're really bad), pan them left and right            and add echo, flanger or phaser effects. Each part of a song (apart            from the vocals) has three variations to choose from as well,            allowing you to sometimes drastically change the sound of a song by            altering the drumbeat, bass riff, guitar style or keyboard backing.            As each musician will play a song in a slightly different style            anyway (forcing a heavy metal band to play a pop song is always            good for a laugh), the possibilities are almost endless.                    Once you've recorded your demo it's time to go round Rock City's            publishers and get a contract. Each company has different tastes,            and you soon realise that there's usually only one or two            publishers in town that will like the kind of music your band is            making, however good it is. Still, you do get some choice in the            matter and you can also decide on how you get your cash - high            royalty rates might pay off in longer missions if you have a            sure-fire hit on your hands, but accepting a lower percentage will            earn you a bigger advance, which can be valuable when it comes to            promoting your band.                        Handling (or simply bribing) the media is an important part of the            game, and you'll need to learn who you can buy off with expensive            gifts and who will take it as an insult to their journalistic            integrity. Press kits can be handed out to get air time on the            local radio station and earn reviews from the local newspaper and            magazine as well, but this isn't always a good idea if your band            sucks or one of the local hacks has taken a dislike to you.            Sometimes the press will even approach you, asking for an exclusive            interview or TV debate, which can be great publicity but can also            backfire if the writer decides to portray your band as lazy slobs            trying to screw over their fans for a bigger pay cheque.                        A safer bet is buying advertising space from the press or            sponsoring window displays and listening posts at the local record            store. In later missions you can also take advantage of Sergey's            shadowy services to fix the sales charts, spread scandalous gossip            about band members and hire bodyguards to keep the media and            overenthusiastic fans at a distance. Not all musicians (or record            labels for that matter) will approve of this kind of activity            though, which can cause problems.                    Another way of raising interest in your band (and earning some much            needed cash without resorting to a personal loan from Sergey that            could end up costing you an arm and a leg) is to organise a gig at            one of the city's watering holes. Again though, different venues            have different tastes in music, which means that you're often            limited to playing the same two clubs over and over again in any            particular mission.                        If your band gets really big you might even consider a world tour,            although this is rarely a sensible option. For starters you'll need            to have a lot of cash in the bank to pay for the travel expenses            and an extravagant stage design, which can include anything from            laser shows and walls of TV screens to giant lighting rigs and            smoke generators. You'll also need to be able to get several            thousands punters to part with their money at each gig along the            way to earn back the hefty booking fees for big overseas stadiums.                        Not to mention the fact that you could find yourself flying home            early if one of your musicians gets burnt out or pissed off            mid-tour and decides to pack it in. Your band will need to be in            top form, fully rested, loaded up with booze, and grinning from ear            to ear under a pile of presents the size of your speaker stacks to            survive a gruelling global tour and make it back to Rock City in            one piece.                    Keeping your band happy is one of the most time consuming and often            least satisfying parts of the job. The easiest way to do this is to            keep them pumped up with alcohol and shower them with gifts like            designer shades, leather trousers and games consoles. The effects            vary from musician to musician, but the overall approach is much            the same in almost every case.                        Some artists are more temperamental than others, and at times this            can be the sole focus of a mission, keeping the gobshite Gollander            brothers from beating each other up, for example, or protecting a            shy musician from the prying press long enough for him to finish            his album. In other missions it's merely a distraction, such as            stopping an annoying girlfriend from coming between members of a            heavy metal band in a rather obvious homage to Spinal Tap.                        But usually keeping your band happy is simply a case of keeping the            booze flowing, making sure their gigs are successful, and            occasionally throwing them a trinket or sending them off on            holiday. If things get out of hand you can always send them into            rehab for a few days to recover. It's at times like this that you            wish the developers had included an option to put your musicians on            an intravenous alcohol drip and save you the trouble of frantically            clicking on their portrait at the top of the screen every few days            to keep them bevvied up.                    And this is Rock Manager's biggest problem - the characters, songs            and scenarios are varied and the humour mostly spot on, but the            underlying gameplay is rather repetitive. Once you've mastered the            basics of the game it's easy to work your way through all eight            missions in two or three hours flat. The lack of any open-ended            sandbox mode for you to just mess around in limits the replay            value, and once you've finished the game all you can do is go back            and try to get a higher score, or monkey around forcing a group of            punks to play dance music. With a mid-range £20 price tag it's            not unreasonable, but like the manufactured pop bands it lampoons,            Rock Manager is fun but ultimately a little shallow and            short-lived.                        -        Rock                    Manager interviewRock                    Manager interview"}