{"ref": "https://www.eurogamer.net/dawn-of-war-3-review", "date": "28 Apr 2017", "game_name": "Dawn of War 3", "text": "There is great joy to be had in watching big things smash into each other. It's a fact. A prima facie truth, which Relic Entertainment's long awaited Warhammer 40,000 strategy sequel understands more than any other in its genre. Within minutes of my first multiplayer game in Dawn of War 3 - a feisty one-on-one against an old friend and fellow DoW veteran - I had their whole army, plus one of the most enormous units in the series' history, suspended in mid air and torn apart at the seams with one colossal beam of energy; a last-gasp trap I'd laid in one final, desperate defence. Quite the spectacle, even if my friend did have to 'suddenly leave' soon after.Dawn of War 3's delivery of these joyous moments, mind, is somewhat inconsistent. It often stumbles, from baffling swings in the competency of its AI opponents to curious missteps in presenting crucial information on units, resources, and interactions. Anyone versed in real-time strategy will likely lament the rigid nature of its online component, and if you've even poked a nose into the 40,000 community, you'll have a good idea of what they think about front-flipping Terminator armour.These are inevitable byproducts of developer Relic's audacious gamble on merging previously disparate games and genres into one. And it is a gamble, because like so many things, you need to risk a little to gain a lot - and, when it does all come together, Dawn of War 3 is exceptional. Like its own brilliantly realised race of Orks prove, clumsy execution matters not if your Morkanaut lands a hard enough punch. The appetite for revolution in Dawn of War games is omnipresent. Previous incarnations of the series' fanatical 40,000 universe have operated on entirely opposite ends of the spectrum. The first Dawn of War - and its superb expansions Winter Assault, Dark Crusade, and Soulstorm - took the more traditional RTS route of grand scale and total freedom for the player, through a range of modes on big, open, widely varying maps. Dawn of War 2 flipped it all on its head for small, squad-based micromanagement, running role-play elements of unit improvement, and a deeper dive into the tactical mechanics of cover, suppression, and active abilities.Unsurprisingly and quite justifiably then, Dawn of War 3 is an attempt at merging the strongest elements of the two. But there is a third factor in play here: the looming, ever-controversial influence of the MOBA - albeit in far less dramatic a fashion than many would have you believe.The reality is Dawn of War 3 still very much sits within the boundaries of real-time strategy. Base-building, resource management, and vast, varied armies are all present and accounted for, along with, crucially, a scope for significant variance in tactics. There's also a fully realised single-player campaign which is often brilliant. Equally as often however, particularly in its early stages, missions can feel a little flat. Still, the single-player story's setup is about as Dawn of War as it gets: three races - the aforementioned Orks, plus the wizened space-elves of the Eldar and the human, ultra-fanatical Space Marines - come together in a mutually violent search for the Spear of Khaine, an ominous MacGuffin found at the heart of the also-ominous wandering planet, Acheron.I sound more than a little disdainful here but really this inimitably entertaining schlock is exactly what Dawn of War and the wider 40,000 universe does best. The Orks, in particular, are an absolute delight to use, not just because of that race's whirlwind blitzkrieg of a playstyle, but the brilliant comic relief provided by their leader Gorgutz's frothing dialogue (and an impeccable performance from voice actor Nathan Constance).The campaign does a commendable job of warming you up to the quirks of its three factions. The Orks stand out yet again in that regard, largely because of a scrap mechanic that underpins their ability to both upgrade and occasionally construct units, and indeed main man Gorgutz's own active abilities: a go-go-gadget arm that taunts nearby enemies and draws Gorgutz to its location, even across gaps in terrain, and another which has Gorgutz spin said arm above his head, blocking all incoming ranged damage for a period of time and dishing out its own in a circle. The opportunities it enables - taunting a squad of Eldar Banshees away from your vulnerable ranged units at the last second, for instance, or jumping in front of your troops to block huge amounts of heavy bolter fire - are immensely satisfying.There are similar moments to be had with the franchise poster-boys the Space Marines, but the same, strangely, can't really be said of the Eldar. Despite occupying arguably a central role in the campaign's story, they suffer at the hands of an extremely steep learning curve, forgettable leader units and one mission in particular that features one of the most alarming spikes in difficulty I've ever seen.That said, once it ramps up and gives you access to the good stuff, Dawn of War 3's campaign works to a scorching crescendo. It's certainly a shame to see the addictive, globe-trotting conquest maps of the first Dawn of War fade as a single-player mode, and at times this particular campaign can feel a little like a lengthy introduction to multiplayer principles. But some potent, backs-against-the-wall moments, mission design that often forces you to deftly balance focus across multiple areas of battle - with a smart control system to facilitate it - and some quintessential Warhammer 40,000 tone is enough to make the campaign feel just about worthy in its own right.All of this, however, is secondary. Dawn of War 3 is a game that will live and die by its multiplayer. For better or worse, the competitive implications are at the root of every decision, woven into it the fabric of the game at every level, and ultimately it'll be those that dictate its longevity and influence in the years to come.A good job, then, that despite another surprising round of abandoned strategy tropes, it's in the colosseum of online battle that Dawn of War 3 puts in its most captivating performance.Venturing online, what you won't find is a huge variety of factions, a particularly large range of maps or, even, an ability to customise just about anything but the number of players in the game. The online segment is extraordinarily rigid for an RTS, to the point where it seems bizarre to even feature a 'Match Type' column when searching for games in the lobby browser seeing as beneath that title you'll only ever read one thing: Power Core.Dawn of War 3's singular mode is, on the face of it, a game of annihilation played out on a fairly run-of-the-mill type of map. Resource points at various locations, more valuable ones in the more strategically vulnerable spots, and bases at either end. The dreaded MOBA influence comes in a small tweak to that formula, by way of destructible shield generators, turrets, and power cores.Each team - matches are 1v1, 2v2, or 3v3, that's it - has one power core in their base, a couple of turrets further outside of it, and respective shield generators in front of them. The effect, as much as it alarms some of the more easily spooked in the community, is in fact a subtle one. Most of the game plays out as any traditional RTS face-off would: the early game is a typically fretful dance of micromanagement around the most contested resource points and areas of cover - these operate slightly differently again here, as capturable points which pop up a strong, projectile-blocking shield that only lets certain enemies pass, making them hugely demanding of tactical nuance themselves.As games progress, the emphasis will generally shift to your progress towards calling in Elites - perhaps the last elephant I've left lurking in the room until now. Elites function not so much as the MOBA champions to which they've been compared, but as any other leader, late-game, or special unit would in any other RTS. The difference here is that you select the three Elites you'd like to be available in a game before the match starts - in a similar vein to the Command Doctrines of Relic's own Company of Heroes 2 - and those are then called down in a range of theatrical entrances once you've earned enough Elite Points in-game from special resource points, another callback, this time to the Relic Points in the first Dawn of War. The functionality of Elites is set apart, however, by two things. First, that element of pre-match planning and choice is crucial. Different Elites cost different amounts - you may never get to the point where you could call in a 9-point Wraithknight, but skew yourself too heavily towards early game Elites and fail to capitalise on it, and you could be left overwhelmed by your opponent.Second, these Elites have active abilities - just the same as so many units in RTS always have - but they're mapped, deviously, to the QWER buttons (the ones used to control champions in MOBAs) that now populate the memory of the more 'modern' player. It's a simple trick - a sleight of hand even, seeing as you could always remap hotkeys anyway - but one that undeniably works in creating an air of accessibility, and an emphasis on using your actives as frequently and intelligently as possible.Come the late-game and, as you'd expect, it's time for the payoff from all that early squabbling and mid-game decision-making. Whether or not you've spent Elite Points on balance-tipping early Elites or saved them and 'teched' towards a late-game nuke of huge walkers like the Morkanaut or Imperial Knight - or faction abilities like my own use of the friendship-breaking Orbital Bombardment in that first game - will have a significant impact. What elevates this to such fantastic, hang-wringing intensity though is the fact that so often, like the very best strategy games, you'll have to discard your original tactics and adapt to what's been thrown at you by the enemy. Abandoning hope, in a split second decision, for the nine point walker unit you were counting on all game and gambling five on an easily-missed Orbital Bombardment instead is exactly the kind of anxiety-inducement I need from an RTS. I want my hopes and dreams shattered, my heart and soul put through the most heretical wringer as I shout at friends, frothing at the mouth and agonising over what to do next, how to respond to this traitorous xeno filth attacking my flanks. Yes, I can't help but lament the loss of those classic, arcadey, eight-player free-for-alls. And I do cast a wistful gaze at even Dawn of War 3's campaign maps, which look perfectly suited for just such a game. But in moments like this all of it is very much forgotten. There are still flaws, and they are significant. One is an inevitable teething pain of the switch to a greater dependency on abilities and effects: clear and accurate tooltips, in this brave new world of competitive influence, are surprisingly important. Dawn of War 3 falls flat on its face in that regard with near-absurd levels of vagueness. The closest you'll get is something like a ~25 per cent increase in resources generated~ from a point when you upgrade it - but exactly how quickly was it earning resources in the first place the God-Emperor only knows. It sounds a little ridiculous, but at the highest level the specifics of upgrades, and certain interactions, are essential. I still can't decipher, for example, why some Banshee Charges turn whole squads into red mist, and others seem to pass, ethereal, right through them. Such duels can decide the early game - and snowball the rest with it.In the same vein I cannot understand the quite significant input lag from both mouse clicks and button presses alike. There is a good, half-second beat between a command and a unit's response. To those with a competitive background this is borderline unacceptable, and whilst the strains on instant response aren't quite so intense in RTS games as they would be in other areas of the field, it absolutely bears mentioning in a game where a feature like the previous entries' gruesome, widely-adored kill animations are removed for the sake of appeasing competitive concerns. And yet, significant as I believe those points to be, the flowing, eerie, ruby locks of that powersliding Eldar Wraithknight still call out to me. I think of suffering at the hands of an enemy Eldar's 'blob' of mid-tiered Wraithguards all through the mid-game, and then mowing them down mercilessly with one active blast of my Imperial Knight in the late. I think of big Beauty the Morkanaut and the clumps of flailing Space Marines she drags flying through the air with her claw. And those concerns begin to fade. For every one of them, too, there's an equal and opposite positive to be found. Doctrines, much like Elites, are a smart addition that allows you tack-on three strategy-morphing modifications to your faction before a battle; the Army Painter returns with a more vast catalogue of designs than ever; the breadth of active abilities across units forces you to make smart, difficult decisions with your attention; and what about Relic's tremendous long-term support of its other recent RTS games, that continues even now?Dawn of War 3 is not going to be universally popular - that much is clear already - and nor is it, despite appearances, going to turn the entire genre of real-time strategy on its head. But like it or not, the clunking, lumbering hulk of Terminator Armor that strategy gaming has become is indeed beginning to creak at the joints. Relic has had the audacity to launch it into an unexpected frontflip, and what a glorious, inventive somersault of design Dawn of War 3 is, even if it doesn't completely stick the landing."}