{"ref": "https://www.eurogamer.net/r-darkarena-gba", "date": "3 Mar 2002", "game_name": "Dark Arena", "text": "Dark Arena is a questionable romp that never really threatens to            engulf DOOM with its vacuous gameplay. Dashing my hopes of a            handheld first person shooter renaissance, THQ's game is little            more than a scribble in da Vinci's notebook, which reads, ~Remember            to paint that Mona woman for the restraining order application~.            And that does evoke a soupçon of disappointment in this            writer.                         The scenario put before players is unremarkable, taking place in            your average secret genetic factory for man-made super-soldiers,            which is swarming with its mutated denizens and rampaging nasties,            all of man's own ill-considered making. As the last survivor of a            blundering rescue attempt, you have to fight your way to freedom.            Along the way players have to overcome twenty levels using a            combination of six different weapons, and success rewards them with            some prerendered FMV (of sorts). For dessert there's a four-player            deathmatch option, although this does require four copies of the            game, making it somewhat difficult to test on our lone review copy.                         One of the most irritating things about Dark Arena though - and            THQ GBA releases in general - is the persistent use of a password            facility to save games. Who knows what these passwords actually do            save apart from the level you've reached, but as your average            commuter will attest, jotting down a ten digit alphanumeric            password in the confines of your average locomotive is not as easy            as the developers seem to think.                    All of this could be forgiven if the game was as engaging as DOOM,            but it lacks the nostalgic attraction of its main competitor, and            it's technically inferior too. For instance, the graphics engine            used in Dark Arena may be versatile enough to power the developer's            former creation, Midway's Cruis'n Velocity, but it's not efficient            or powerful enough to deal with floor or ceiling textures, and the            faint mesh spread over both to mask their absence is feeble.                         The developer has also been extremely frugal with the game's            monsters, giving each of them a whole two frames of writhing agony            to signify their respective deaths. Furthermore, they have been            blessed with the artificial incompetence to stop still in the            middle of a frenzied attack and wait for you to pop them with a            bullet before resuming.                         Apart from anything, the GBA isn't able to keep up with the            exploits of the player and the demonic manspawn that hunt him.            Stride purposefully into a room 'packed' with three or more enemies            and the game will slow to a crawl, the engine unable to keep up as            they hurl projectiles at you. Another handy aspect of Dark Arena is            that the game often sacrifices these snail-threatening projectiles            in favour of rendering the enemies and their environment, meaning            that despite having three or more blasts of God-knows-what heading            for your frail figure, you can't actually see any of them.                    The gameplay itself, dogged as it is by slowdown, is not the worst            affected. It is my long-standing opinion that the things that            really define a first person shooter - that really stand out in the            memory of the player - are often entirely superfluous, and that's            the one thing that Dark Arena could really do with: stuffing.                         Beyond shooting at enemies, opening doors and firing your weapons,            the game offers nothing to remember. The developer has made no            attempts to surprise the player, simply offering room after room of            intensifying mutant mayhem. Monsters start to move faster as the            game progresses, but all this means is that one out of every two            encounters is resolved by your pounding the fire button until the            mass of incomprehensible pixels jammed up against your face            disintegrates and the game regains its composure.                         And ultimately, there was the odd place here where a bit of            stuffing was a reasonable expectation. Teleporters - the mainstay            of many an FPS - are just doorways to other parts of the level, and            travelling through them is completely uneventful and without            fanfare. Indeed, I actually managed to stumble through one            completely by accident at one point, and only realised what had            happened after doing a 360 spin confusedly searching for a            landmark...                    Dark Arena is also blessed with a number of points where players            get caught in the scenery. Backed into the corner of an abandoned            research lab brimming with baddies, I often found it necessary to            rock the player out of his hole. Couple this with the often            infuriating act of switching weapons mid-battle whilst having lumpy            pixels pressed up against your display and Dark Arena seems to            consist largely of feeling trapped. That may have been the            intention, but I doubt the execution was what they had in mind.                         The game's soundtrack and sound effects are also something of a            letdown. Let's be clear, one of the key factors in DOOM's lasting            success is its atmosphere. It may all be a simplistic Monster Maze,            but the player gasps for air, grunts and gurgles, and there is no            more satisfying sound effect than the impact of a rocket on a wall,            and none more copied than the sound of a metal door sliding into            and out of the wall. Dark Arena's array of sound effects is mundane            by comparison, and where id demonstrated their mastery of the midi            file soundtrack, Graphic State has only a lacklustre imitation.                         The game's saving grace could have been its multiplayer mode, but            unlike DOOM you're unlikely to find two or more people with a copy            for every square mile, and ultimately the game has none of the            graphical glitz or excitement of its competition. Nailing your best            friend in DOOM brings a tear to the eye. Doing so in Dark Arena            takes the eye to the watch, and oh, is that the time? I think I'll            go ram my head in a door.                    When DOOM was originally released on the GameBoy Advance, it set            the pace for any first person shooter choosing to follow its lead.            Ecks Vs. Sever found it difficult to compete, lacking the multiple            skill settings and animal attraction of DOOM, and now we have Dark            Arena, an above-average adventure through a substandard game world            relegated to the ranks of the infuriating by technological            dissonance and a password system from hell. I'm off to hunt some            imps.                        -                            Dark Arena screenshots                    Dark Arena screenshotsEcks                    Vs. Sever reviewEcks                    Vs. Sever reviewDOOM                    reviewDOOM                    review"}