{"ref": "https://www.eurogamer.net/r-boxingfever-gba", "date": "18 Feb 2002", "game_name": "Boxing Fever", "text": "One of the first GameBoy Advance games we got our hands on last            June was Ready 2 Rumble Boxing : Round 2 from Crawfish and Midway.            Unfortunately it was a lacklustre conversion and (ahem) lacked            punch. On the other hand, Digital Fiction's THQ-distributed Boxing            Fever is the closest thing we've seen to a decent handheld boxing            game, and short of a GBA version of Punch Out from Nintendo            themselves, the chances are it will remain as such.                         Boxing Fever is surprisingly good-looking, with much larger            fighters than Ready 2 Rumble Boxing, which was more like a beat 'em            up than anything. Characters take up the whole screen and the game            is viewed from the first person, with multiple layers of background            animation adding to the illusion of three dimensions. The            characters themselves are a bit bland, but the animation is a            sterling achievement.                         Originally published by Majesco in the States, Boxing Fever            features everything you might expect to find in a boxing title;            eight playable characters, two boss characters, championship and            practice modes and a link cable option for two players. Design-wise            it's extremely easy to pick up, with a no-frills control system            consisting of duck and block buttons as well as high and low            punches. This four-button system fits the GBA perfectly. Each            character also has a few special moves and super moves - charged            attacks that are really only applicable in the dying moments of the            match.                    Boxing Fever's ten fighters all have the same abilities, but some            are nimbler or stronger than others, and this coupled with the            above control system can result in some surprisingly strategic            boxing action. Pick a small fighter and you can throw more punches            without tiring, but anything you take on the chin will have a            bigger effect than it might on a larger frame. Conversely, heavy            hitters tire more easily. There are also a few all-rounders in            there, which is good news for beginners.                         The actual gameplay modes are a bit of a downer compared to the            rest of the premise. The so-called Championship mode is basically            just four separate levels available from the start. Using this            approach the developer could skimp on including a battery backup,            and plenty of interesting data - saveable statistics on the fights            and a progressive championship - are sacrificed in the name of            economy. In fact, Boxing Fever's only advanced feature is the            password system, which looks suspiciously similar to the atrocious            Advance GT system seen in the non-Jap versions of that game.            Eight-digit alphanumeric passwords - perfect for writing down on            the tube? No.                         Rescuing the package though is the link cable play. It's like            playing Punch Out against a real human - something never before            possible. Ready 2 Rumble Boxing failed spectacularly in its            attempts to achieve that. Although playing against the CPU AI is            relatively challenging, there's nothing quite like sitting a few            feet from someone you just nailed to the canvas with a sweeping            uppercut.                    Boxing Fever is just that, and it does a good, unsanctioned job of            carrying on as Punch Out's legacy. In fact, it's a better game.            Gone are the easily-toppled strategies of AI opponents, and in            their wake players can look forward to some extremely frenzied            fighting that really had me clawing for the ropes at times. And to            cap it all off there's a head to head mode. All right, the password            system and lack of any real single player structure doesn't do it            any favours, but it's still good solid fun for lone players, quirks            and eccentricities accepted. Makes a mockery of the modern            competition.                        -        Ready                    2 Rumble Boxing : Round 2 reviewReady                    2 Rumble Boxing : Round 2 review"}