{"ref": "https://www.eurogamer.net/r-drivengba", "date": "31 Jan 2002", "game_name": "Driven", "text": "The most surprising thing about Driven on the GameBoy Advance is            how much more entertaining it is than the utterly abysmal PS2            incarnation. If my memory serves me correctly this is the first            top-down racer to appear on the GBA and Crawfish have succeeded            admirably in bringing us a surprisingly enjoyable and, shock            horror, original little racer.                         The perspective actually isn't quite top-down, rather our            viewpoint of the action is isometric and somewhat reminiscent of            the bizarrely named Amiga game Skidmarks [stop sniggering at the            back there - Ed]. We haven't really seen many driving games make a            use of this angle and so it can take some getting used to,            particularly with the GBA's irritatingly dark screen. However, once            you're accustomed to the angle, the handling of the cars is            surprisingly well realised and the sense of speed is accomplished            superbly.                         In fact, playing Driven for the first time is an experience full            of surprises. For myself, it shouldered the burden of its PS2            brother and I was relatively shocked when I realised I was actually            having fun twisting the little CART cars around the tracks.            The game is stuffed with a nice collection of playing modes, with            single race, practice, multiplayer and story mode available from            the main menu.                    The story mode is obviously the main portion of the game, but I'm            not really sure whether or not it follows the storyline of the            Sylvester Stallone            movie the game is based on because, well, I haven't seen it.            However, there doesn't seem to be much of a plot as such (now            there's a surprise), you just take on the role of a few different            drivers and perform a variety of on-track tasks in order to prove            your worth in the racing circuit.                         The tasks you have to perform vary from, bizarrely, collecting            coins on the track whilst completing a lap in a certain time to            simply winning a head-to-head race with an archrival. The tasks and            locales are a refreshing diversion from the norm; I certainly            wasn't expecting to be racing through the streets of New York in a            CART car, sliding it under parked articulated trucks.                         The fresh approach doesn't stop at the scenarios either. There's a            novel addition to basic racing where your driver can enter the            ~zone~, meaning massively accelerated speeds, invulnerability and            improved handling. This state is achieved through careful handling            around the track during the race and is a good reward for putting            in extra effort. However, the hard work you put into getting to the            head of the pack can often be ruined in one fell swoop; taking too            much damage can result in your car being flung into the air without            warning and placed at the back of the pack. Since there's no damage            meter in your HUD this can often happen without warning and can            prove to be extremely frustrating, especially during the harder            races.                    Driven isn't an especially deep or involving game, but it is one            that provides a pleasant diversion every now and then. Even if you            can't be bothered with finishing the story, an occasional jaunt            around one of the tracks in practice mode is fun when you've got a            spare ten minutes or so. It's worth persevering with the game in            the long haul though, even if only to unlock the secret cars and            new tracks. Give it a shot if you haven't got your eye on anything            else."}