{"ref": "https://www.eurogamer.net/r-virtuatennis2-dc", "date": "28 Dec 2001", "game_name": "Virtua Tennis 2", "text": "If it weren't for 16-bit classics like Smash Tennis and Super            Tennis, the average quality of the tennis videogame genre would be            surprisingly low. Without Hitmaker's Dreamcast version of Virtua            Tennis though, it would probably have sunk right off the bottom of            the chart. Virtua Tennis 2 is a highly anticipated game, and it            comes at a time that new Dreamcast games are few and far between.            If it wants to sell, it has to impress fans of the original game            (i.e. a large percentage of Dreamcast owners out there), and with            this in mind Hitmaker have brought along improved visuals and a            larger selection of players, and they have tweaked the gameplay            mechanics too. Will VT2 leave a significant enough impression?                         The interface and main game options remain pretty much the same,            with tournament, exhibition and World Tour modes still providing            the bulk of the action. In tournament mode, you have to battle a            number of world-class tennis players to claim the crown of world            number one, whereas in exhibition mode you can just choose someone            to wallop a ball back and forth with in a best-of-three.                         World Tour has been changed slightly, this time including the            option to create your own player. Once you've chosen a suitable            appearance and given him some reasonable attributes, you play a            selection of mini-games, which improve your player's tennis            abilities, and you face increasingly difficult opponents as you            fight to break into the world tennis circuit. After a while you can            quality for and play in tournaments and grand slams, with huge cash            incentives and luxury doubles matches to look forward to. This is            all very well, however, but is more or less the same as the            original World Tour…                    The most noteworthy change at the beginning of the game is the            introduction of a large number of female tennis players, including            celebrities like the Williams sisters. Unfortunately you cannot            play cross-gender matches, but you do get the best of both worlds            as a result. The women's game requires a gentler approach, with a            certain deftness of touch absent from the men's game.                         Once you're on the court it's clear that Hitmaker have updated the            AI, with players now eyeing you up between points and picking out            your weaknesses early on. The control system has been sharpened,            with fewer sloppy reactions, and the court and proportions of the            players seem to have been tweaked. The players certainly don't have            as much diving about to do, and Hitmaker have added some amusing            overhead shots for those desperate base line bouncers. Practically            speaking, the control changes will annoy fans of the original for a            few minutes, but it's worth it.                         Finally we have the graphics and sound to touch upon briefly.            Virtua Tennis had some stunning graphics for a Dreamcast game, and            Hitmaker have determined to give them a nice spring clean instead            of scrapping the lot. Player animation and modelling is clearer,            and the lighting and court detail have been upped a bit. Of course,            the game also features a 60Hz mode and otherwise looks largely the            same as Virtua Tennis: jolly nice. Aurally we're talking about a            few swift tweaks here and there, with a new electronica soundtrack.            It works surprisingly well for something so obviously illfitting.                    As with its predecessor, it only takes a few minutes to get the            hang of Virtua Tennis 2, and if you don't own the original game you            must seek VT2 out. It's the best example of a tennis game we have.            It is a far cry from Virtua Tennis' worthy successor though,            unfortunately. Your own love for Virtua Tennis will command the            purchase decision in this case, but as an annual update I have to            give Virtua Tennis 2 a fairly harsh rating, because it's obviously            not just scotch tape and bits of string, but it's not even an            EA-level improvement.                        -        Virtua Tennis reviewVirtua Tennis review"}