{"ref": "https://www.eurogamer.net/r-thps3-ps2", "date": "13 Dec 2001", "game_name": "Tony Hawk's Pro Skater 3", "text": "Ah yes, our old friend Tony. It hasn't been long since the last            time we paid a visit to the realm of the King of Skating, yet            Neversoft seem perfectly able to knock these things out in            cookie-cutter fashion now. With Tony Hawk's third title in the            immensely popular Pro Skater series, his PS2 debut feels            like the license was custom-made for the platform.                         While the Tony Hawk's games are easily the most addictive,            playable skating games available to date, you'd be forgiven for            noting that the more recent releases have been fairly devoid of            innovation and rarely strayed from the formula established in the            first game. THPS3 is such an example of wheel re-invention, with            eight new levels (plus hidden bonuses) and obviously improved            graphics being the only immediately obvious differences.                         The main portion of the game is, of course, the career mode. This            takes place across the aforementioned eight levels spanning some            bizarre locales, including a steel works and a cruise liner. The            aim remains the same; complete as many tasks on the checklist as            possible in order to advance and unlock more levels. It's a simple            concept that has remained unchanged since the original, yet            Neversoft seem confident they can milk the idea to great effect.                    The variety of locations and the wonderfully imaginative level            design is what sets the Tony Hawk's series apart from all the other            pretenders to the crown, and the massive increase in power offered            by the PS2 has resulted in far larger and more intricately detailed            environments than ever before. The areas you find yourself skating            in are far more densely populated now, as well, making each level            feel more real. The player is also occasionally forced into a            skating competition. These come very early on and can bring utter            frustration as you struggle to finish third just to continue the            game. The judges seem to demand that you master a deeper level of            control which you just don't get the chance to develop at such an            early stage.                         The same skaters from the previous games appear here again and            each character has their own set of special skills, moves and            personal statistics. By the time you've played through much of the            game, it's entirely possible that the character will be practically            unrecognisable from their original skill set. This is thanks to a            decent level of character development; as you gain points through            level and goal completion, you're able to spend stat points on any            skill area you choose.                         You must rely on building and developing your skills throughout            the game to complete tasks such as impressing spectating girls or            other skaters, and gaining access to previously unreachable areas            by improving your character's statistics on other levels. This            lends the game a nice seamless feel, as opposed to a linear            progression, as you hop from level to level to complete the            checklists.                    A lot of effort has gone into creating a good deal of replayability            within THPS3, and once the career mode is done and dusted (which            admittedly won't take series veterans long), the level of            customisation features are impressive for a console game. First of            all we have the Create-A-Skater function, which offers a stupid            level of input into exactly how you would like your skater to look.            Dressing Tony up in an almost Barbie-like fashion sent me back to            my perhaps disturbed but joyful childhood.                         There's also a massive collection of different deck designs            scattered throughout the game for your to find and unlock in the            ~skate shop~ front-end. But the coup de grace of the game's            customising utilities has to be the skate park designer. This made            a debut appearance in THPS2, but the sheer scale of the            possibilities available to the player here is astounding. The            canvas is absolutely enormous and the construction of your dream            park couldn't be simpler. The more ludicrous the better -            loop-the-loop anyone?                         When you really dig deep though, there isn't a great deal new            here. It's certainly going to be an absolutely stunning play for            newcomers, but players used to what the series has to offer may            feel slightly cheated. The cosmetic changes, such as streaking            blood across the floor when your skater bails and vastly improved            level design possibilities are all very well and good, but you            can't help but wish for something more.                    A reminder of how little effort there has been in expanding the            playing modes is obvious in the multiplayer options. The exact same            split-screen action is on offer here as in THPS2, with the same            playing modes. Of course, it could be argued that the inclusion of            network play into the package is the excuse for the lack of            innovation here, yet anything on offer here is less than enticing.            There are two network-exclusive modes, neither of which are            particularly inspiring. Slap! is a simplistic version of chicken,            where each skater hurtles towards each other and the fastest skater            wins by knocking the other over. King of the Hill sets the players            fighting over a crown, and then seeing how long they can keep hold            of it.                         While Tony Hawk's Pro Skater 3 is a super game in its own right, I            can't help but feel it isn't a significant enough step forward for            the series. It's definitely unrivalled in speed, scale and sheer            excitement, but there's a lack of innovation that taints the            experience from start to finish. Don't rest on your laurels,            Neversoft."}