{"ref": "https://www.eurogamer.net/r-ghostrecon", "date": "6 Dec 2001", "game_name": "Ghost Recon", "text": "Ghost Recon is the latest in the series of Tom Clancy endorsed            tactical-action games which started with the pioneering Rainbow            Six. As such it's a rather touchy subject at the moment, and has            come under the scrutiny of the over-sensitive since the terrorist            attacks on America. Thankfully though it hasn't suffered the            ridiculous levels of censorship currently being forced on many new            releases.                        There is a story backing up the fifteen mission campaign, but as            usual this takes a back seat to the action. Apparently Russia has            fallen under the control of nationalistic leaders whose aim is to            reinstate the communist regime. First up on their agenda is the            capture of Georgia, and subsequently the Baltic states of Estonia,            Latvia and Lithuania. The escalating war naturally leads to a            conflict with the UN, and as a result you and your platoon of            ~Ghosts~ (you know, another band of elite covert fighting machines            trained in the arts of .. whatever) are sent in to whoop some            Russian booty and rescue the princess. Okay, maybe the princess            will come in the patch.                        So far, so familiar. But after the numerous Rainbow Six mission            packs, rehashes, and re-rehashes, we were anxious to see whether or            not Red Storm still had what it takes to excite and enthral, and if            they could come up with something worthy of our attention. We've            been spoiled over the last year or two with the likes of Operation            Flashpoint and SWAT3, and we were looking to Ghost Recon to provide            something new to grab our attention.                    The most obvious deviation from the Rainbow Six games is the            environment. It's only natural that comparisons are going to be            made to those games, but it's important to remember that Ghost            Recon's engine is completely new, and brings with it the ability to            render sprawling landscapes. Gone are the close quarters combat            scenarios of office blocks and museums, to be replaced with remote            towns and valleys and .. ahem .. assaults on terrorist hideouts in            hidden cave complexes.                        The whole game is graphically splendid, and particular loving            attention has been paid to creating some wonderfully animated and            skinned characters. The repertoire of animations, especially the            deaths, is impressive and blends practically seamlessly. And while            the landscapes themselves tend to be low on detail, the texturing            and objects create a superb hostile atmosphere. As the storm clouds            churn overhead, the tall evergreens sway, and the rain splatters            down around your team, you really do feel like you're up against            the elements as well as a few disgruntled Georgian rebels.                        There are gameplay changes as well. Presumably in an attempt to            make things more accessible to casual gamers, the planning phase of            the old Rainbow games is gone and has been replaced with simple            waypoint-placing on an in-game map. While the effort put into            attracting new players is laudable, it's actually far too            simple, and doesn't offer as much control over your platoon as you            would like. Indeed, the map is so simplistic that you're unaware of            any advantage the enemy might have as you send your troops out            across a landscape, only to lose them one by one to an enemy sniper            as they bumble across the landscape attempting to reach your            waypoint.                    What the game is lacking in true tactical elements, it certainly            makes up for in tense action and gritty realism though. Make no            mistake - Ghost Recon is as hard as nails from the outset, and            almost every single mission will require replaying until you get it            right.                        It's rare for you to get through a scenario without losing a            soldier, but those who do make it are rewarded by the interesting            ~combat points~ system. Similar to experience points in            role-playing games, these are awarded to any survivors after each            successful mission and can be spent on improving one of their            attributes. It's up to you whether you would rather have better            marksmen or more silent troops, and the system forces you to really            take care of your men.                        You will also need to be flexible, as mission briefings can often            be confusingly (and perhaps purposefully) vague. It's only when you            are halfway through a mission and a couple of Russian tanks are            spotted rolling towards your headquarters that you understand why            bringing a demolitions expert equipped with a rocket launcher was a            good idea. Another example of the game's set-pieces is when you see            a squad of retreating soldiers hot-foot it across a bridge as they            realise their assault on your position is going pear-shaped, only            for your team to pick the poor guys off as they flee without any            intervention from you. It's little moments like this which show the            effort which has gone into creating a believable scenario, as            opposed to the movie-set feel of Rainbow Six.                    The AI is usually sufficient to leave sniping, scouting or covering            fire roles to the computer should you want a little stealth action            or fancy taking on armoured vehicles with your trusty rockets, and            the different playing styles offer a pleasantly varied experience.                        It's a shame that the same couldn't be said about the environments.            Much of the action takes place in hilly woodland areas, and while            this makes for a nice diversion for this style of game, you begin            to yearn for some proper close-quarters combat. The few urban            settings available in the game are rather insipid feeling, with            buildings and props lacking essential details in order to maintain            the atmosphere resplendent throughout the rest of the game.                        On the other hand, the multiplayer functionality that seems vital            in the current gaming climate is well produced in Ghost Recon. The            variety of options might be unremarkable, with the standard            co-operative, teamplay and deathmatch modes available, but they            nicely compliment the single player experience. The dedicated maps            are splendid in appearance and design, and the netcode itself is            exemplary; the game is perfectly playable over a modem with barely            noticeable lag.                    Ghost Recon is a decent step for tactical shooters, but more to the            side than forwards. It relies far too much on a standard formula            throughout, without providing a large enough level of variation in            the missions. The complete reversal from indoor to outdoor action            is an impressive move to begin with, but you soon begin to want            more intimate contact with your adversaries. The atmosphere and            action (when there is any) is superlative however, and will provide            a decent couple of months gaming for fans of the genre."}