{"ref": "https://www.eurogamer.net/r-projeden-ps2", "date": "27 Nov 2001", "game_name": "Project Eden", "text": "Project Eden is a maze and you are the proverbial mouse. In fact,            you're four little proverbial mice, each of which has a particular            skill; be it the cyborg with his resistance to hazardous            environments, the technician, the computer expert or the leader            with his helpful security clearance. Your maze isn't whitewashed,            but decked out as a mysterious near-future cityscape with a            fetching Unreal-esque visual demeanour, and spots of pure darkness            that often disguise doors and archways when they shouldn't. The            maze isn't glass-topped - you control your mice from the            third-person in fact - but it does take advantage of several            unfortunate limitations in an attempt to frustrate you; for            instance your inability to jump, even over small distances.                         The late Douglas Adams taught us that mice are in fact singularly            the most intelligent species of animal on our planet, and I'm            willing to agree with him. However, I dare say they found this maze            stuff extremely insulting, so I am hereby proposing a truce. Given            our knowledge of their experience and fortitude and the fact that            they have yet to flee our planet, I would like to swap the            brain-depletingly tricky puzzles of Project Eden for the inside of            a whitewashed maze where even I may flourish. Or a padded cell.            (Or alternatively, you could get on with the bleedin' review.            -Ed)             Ah yes. Project Eden is a conversion of an extremely difficult PC            puzzle game featuring three upstanding young fellows and one            cyborg, and like so many other PC-to-PS2 conversions the gameplay            is completely misplaced for the platform, and on a lighter note            (chortle), as a result of the conversion the dark spots in the game            have become almost opaque. This introduces a major gameplay problem            not found on the PC in that the darker spots often mask doorways            and other vital parts of the solution to whichever indeterminable            problem you reckon you have probably been thrown at the time. The            world is peppered with doors you cannot enter, with the game's            approach on this one being to shoehorn one of your characters            through a particular door that does open, where he will find            some way to contribute to the solution.                    Your progress through the world is not entirely civil, on-screen or            off it. As you make your way past some of the more interesting            puzzles you really will start to wonder whether they are ingenious            or simply badly designed. At times it's touch and go, but it's the            old adventure game thing; once you've beaten a particular puzzle            you want nothing more than to see what's around the corner, effing            and blinding to all and sundry aside.                         Just as you're getting the hang of setting each of your characters            a particular task and creating that vital bridge to the next            scenario, you run into hostile aliens and have to wield your            group's pithy arsenal swiftly and accurately. None of your enemies            is particularly 'ard, but as fans of GTA3 and other third person            games will testify, along with the Core Design team themselves as            authors of the Tomb Raider series, nobody has a decent answer to            controlling the third person shooter precisely on a console.            As such, death is infrequent but still worth trying to avoid,            because your lost comrade has to come dashing up from the last            regeneration point, which is something of a chore.                         The control system is a mixed blessing. There is little doubt that            a third person perspective approach was necessary for the most            part, but there are some niggles within that, even aside from the            aforementioned combat problem. For example, the basic            follow-the-leader system is a bit crude and ineffective. You are            supposed to walk up to your chums so you can see them clearly, then            hit the 'follow' button. For the next minute you have to make sure            that the team is following you, because I've lost track of            the number of times I've been caught napping with one of them on            the other side of the level completely. Why not just have a follow            key that tells everyone to go meet the leader? On the AI front, at            least your four chaps don't get caught on scenery.                    I've hinted at the inconsistent level design before, but to give            you a proper sense of Project Eden I'm going to walk you through a            hypothetical puzzle. Let's say your overall objective is to open a            particular door, which is hydraulic. Often even this information is            lacking at first, but you get the idea, and you learn in stages.            You would first have your technician fix the cut hoses on the near            side. When that didn't change anything, your computer hacker would            scour the level for a console to control the environmental controls            and water controls. If this worked, the door would open and close            quickly because of a busted mechanism on the other side for keeping            it open, leaving you in the same position as you were. Then the            cyborg would look for a big heavy object to jam inside the door to            keep it from closing. While all this was going on, your group            leader would probably end up making himself useful sneaking one or            other of the cyborg and computer expert into their respective            positions using his security clearance.                         Of course, this sort of gameplay will be extremely familiar to            anybody who played Tomb Raider - flip a switch, move a block, stand            in a particular place and it all comes together - and it is            interesting to draw comparisons. If I had to choose between the two            games though, I would probably pick Tomb Raider, because of the way            the levels are suggestive. If you see something and it looks out of            place, it probably does something important. If you see a switch up            on a high wall, you can tell you're going to have a whole lot of            fun getting to it. It's not the most exciting or rewarding form of            puzzler, but every new sitting reveals something new, and the large            number of impressive hostiles to overcome adds to the drama.                    While I have the stomach for a game where you can sit down playing            for an hour or so without making one inch of headway, the console            demographic is very different to the PC one on the whole, and            having something new for the gamer every time he sits down on his            beanbag in the front room and pulls up a controller is almost a            prerequisite. Project Eden is going to have trouble doing that. Now            to be fair, it isn't so hard that you won't ever get over            some of the puzzles, it's just hard to a point beyond which a lot            of people will lose interest… The sad thing is, I reckon Core            Design have upped the puzzle difficulty and lowered the action            quota deliberately because that puts the game in direct opposition            to Tomb Raider, something they don't want to emulate with one of            their few non-Lara releases in recent years.                         That said you have to give them serious credit for Project Eden,            even if it is meant within the puzzle / adventure genre as an            antithesis to Tomb Raider. It's a remarkably good-looking game,            with intricately detailed character models (albeit lacking the            silky smooth animation of recent PS2 titles) and consistent texture            work, caught between some good-to-excellent cutscenes that take you            from place to place. Although the soundtrack is a bit feeble, the            voice acting (complete with British accents, cue wistful sigh) is            spot on, even if it's fairly rare for the protagonists to string            sentences together outside of a movie.                         If you have a penchant for games that test your grey matter,            Project Eden should definitely be on your shopping list this            Christmas, but do take note of what you're buying into. Project            Eden is an occasionally heartless and often extremely difficult            puzzle game built to keep you from finishing it, but one that            requires far more than your average adventure. Mensa ought to use            it to weed out applicants. I'm just glad I've finished reviewing it            - I think I need a lie down.                        -        Project                    Eden previewProject                    Eden previewProject                    Eden screenshotsProject                    Eden screenshots"}