{"ref": "https://www.eurogamer.net/r-aoe2-ps2", "date": "23 Nov 2001", "game_name": "Age of Empires II: The Age of Kings", "text": "In a bizarre turn of events, Microsoft's best-selling real-time            strategy game Age of Empires II has been released on the            PlayStation 2. Published by Konami to spare Bill and the boys the            indignity of having to kow-tow to Sony in person, the result is a            very faithful console port of the game, which is something of a            mixed blessing.                        The upside is that PS2 owners get the whole Age of Kings package            with only one obvious ommission. The best place to start is the            tutorial campaign based on the exploits of William Wallace, which            does an excellent job of teaching newcomers to the genre the basics            of combat, building and resource gathering. It also serves as a            refresher for more experienced players, and although controlling a            real-time strategy game with a joypad feels a little odd at first,            by the end of the tutorials it should be second nature. The only            real problem is the lack of grouping and other hotkeys, for which            you will need a USB keyboard.                        All five single player campaigns from the original game are also            included, putting you in the shoes of historical leaders ranging            from Joan of Arc to Genghis Khan and then setting you tasks such as            building up a settlement, defeating an enemy army or recovering            religious artifacts. Once you have exhausted these the random map            generator comes into play, offering a wide range of options for            setting up skirmish battles against the AI using any of the game's            thirteen civilizations. In fact, the only thing missing is online            support, although if you happen to have a spare PS2 lying around            you can play against a friend using an i-Link cable.                    The downside is that the game's interface was hardly a miracle of            efficient design even on the PC. Displayed on a TV set it occupies            almost half of the screen and looks appropriately big and clumsy,            while some of the text and icons can be hard to make out from a            distance. The larger buildings in particular still look fairly            impressive, but overall the graphics lack clarity and the            animations don't seem quite as smooth as they were in the original            version.                        Indeed, apart from the intuitive control system, very little effort            seems to have gone into fitting the game to the console's strengths            and weaknesses, from the ever-present tinny MIDI music to the way            the framerate sometimes starts to chug during large battles. These            slowdowns are especially disappointing when you consider that this            is a two year old PC game which was hardly cutting edge even back            then.                        Despite these flaws Age of Empires II remains an enjoyable if not            exactly groundbreaking game, and it is after all one of the few            true strategy games currently available on the PS2. Unfortunately            it looks rather dated, and doesn't offer anything more than the            (somewhat cheaper) PC version; so although it could be the perfect            present if you want to tempt a console-owning friend to the dark            side, given the flood of quality releases at the moment it's hard            to recommend otherwise."}