{"ref": "https://www.eurogamer.net/r-mm-aom", "date": "20 Nov 2001", "game_name": "Magic & Mayhem : The Art Of Magic", "text": "Your name is Aurax, and you are an alcoholic. As the game begins            you are recovering from the mother of all hangovers after            celebrating your coming of age, but things are about to get much            worse. First your sister reveals that she is a magician and that            you too have the power of magic, then skeletons attack your town            and slaughter your neighbours, and to cap it all an evil warlord            kidnaps your sister to turn her to the dark side.                        What starts off as a rescue attempt soon becomes an epic quest to            defeat the armies of chaos which are threatening your land as it            becomes obvious that the force .. sorry, magic is strong in you.            Sadly any impact that this might have had is marred by the game's            shoddy dialogue and flat emotionless voice acting, which is about            as exciting as Stephen Hawkings reading out a shopping list. The            only silver lining is the occasional moments of humour (intentional            or otherwise), such as the pair of evil wizards who sound uncannily            like Arnold Schwarzenegger and spout lines which make Conan The            Barbarian look like William Shakespeare.                        The game itself is a blend of real-time strategy and role-playing            elements and revolves around controlling ~places of power~. These            earn you the mana points which you need to cast spells and summon            creatures to fight for you, and as a result most battles tend to            devolve into grabbing as many of them as possible while chasing            down an enemy hero. There is some variation in mission objectives,            such as rescuing missing kids, taking part in a bar-room brawl or            recovering a magical item, but generally everything boils down to            finding and defeating one or more enemy wizards.                    Unfortunately this is often easier said than done. Maps can be            huge, and as Aurax and his heroic companions move with all the pace            of a geriatric snail, battles can be rather slow and longwinded.            Finding an enemy wizard is like looking for a needle in a haystack,            and usually your best hope is to work out which direction his            creatures are coming from and try to find your way back to him by            following the trail of dead spiders.                        What makes things really irritating though is that most of the            units move at much the same speed, and there is no way to stop a            determined enemy from marching straight past them. Sometimes you            can end up with your men trailing along in a line behind their            target, unable to catch or corner him. Even worse, the enemy wizard            often acts as though he is oblivious to the traffic jam forming            behind him, meandering aimlessly around the map before stopping to            capture a point of power and getting pulverised as your army            finally gets close enough to attack.                        These problems are only made worse by the appalling AI. The enemy            is utterly incompetent at times and your own men can be just as            problematic. Their behaviour varies drastically depending on their            species, and there is no way to adjust the aggression levels of            your units manually as you would in a true real time strategy game.            Some troops will wander off half way across the map looking for a            fight if you leave them to their own devices, while others will            ignore an elven archer peppering them with arrows from just a few            metres away. Throw in the pull of a nearby place of power and you            may even see schizoid units which move towards a foe only to            suddenly change their mind and walk away again, repeating this            until they wind up dead, having never landed a single blow on the            enemy.                    The Art of Magic is also let down by the atrocious balancing of the            single player campaign, which is less of a learning curve than a            rollercoaster. The first few missions introduce you to the basics            of the game gently, but after this all bets are off, with missions            varying wildly between ridiculously easy and bloody hard. It's            perhaps telling that the developers resorted to letting you change            the difficulty level at the beginning of each mission, as if they            realised what a mess they had made of it themselves.                        The game's fundamental AI and gameplay flaws serve to ruin the            campaign flow still further. I finished a few missions within a            couple of minutes because the enemy wizard inexplicably decided to            walk straight towards me, while other times you will be tearing            your hair out in frustration as a friendly hero who you were meant            to be protecting wanders into the middle of a gaggle of enemy            troops and gets himself killed. Meanwhile one of the game's few            stealth missions is ruined because the trolls who are chasing you            move at exactly the same speed as Aurax, so you can just wander            into their fortress, steal the magical item you are meant to            recover and walk out again without any of them ever managing to            catch you.                        The campaign is also supposed to be non-linear, and at a couple of            points you do get a choice of which mission to carry out next. In            reality though you are more or less locked to a single route            through the game, again thanks to the poor balancing of the            missions. Certainly the first time you are given a choice, if you            play through them in the ~wrong~ order it's almost impossible to            win even on the easiest difficulty setting, while the ~correct~            choice makes finishing them all a breeze.                    As you battle your way through the game you will gain experience,            which can be spent on increasing your health, mana capacity or the            number of creatures you can control at once. You will also find            magical talismans and ingredients which can be combined in your            portmanteau at the beginning of each mission to give you access to            a wide range of spells, from fireballs and tornadoes to the ability            to summon trolls, dragons, elves and pixies.                        There's certainly plenty of variety on offer, as each component            will produce a different effect depending on whether it's combined            with a chaos, lawful or neutral talisman. And depending on which            kind of magic you use the most, the cost of casting spells of            different alignments will change from one mission to the next. It's            a nice idea, and it's just a shame that the rest of the game can't            match it.                        The same could be said of the special effects, from the stunning            smoke trails of the fiery breath spell to the huge twister which            lifts creatures up into the air and throws them out across the map.            Sadly these overshadow the rest of the graphics, which are rather            mundane by comparison. Character models are particularly weak,            looking blocky and awkward up close.                    Art of Magic is bursting with novel ideas, but at the end of the            day these elements just fail to gel into a rewarding game. The            interface is a little clunky, the AI awful, the battles chaotic,            the graphics variable and the mission balancing all wrong. The            result is frustrating, as it's clear to see that this could have            been a great game. Must try harder.            Add                    a pageAdd                    a pageBack to                    featuresBack to                    features"}