{"ref": "https://www.eurogamer.net/r-codeoutbreak", "date": "6 Nov 2001", "game_name": "Codename Outbreak", "text": "Having breathed fresh life into the stagnant lungs of the real-time            strategy genre with the excellent Cossacks, Ukrainian developer GSC            Game World's next Herculean task was to create an innovative first            person shooter. And they almost succeeded...                        Codename Outbreak's plot borrows heavily from the likes of Puppet            Masters and Day of the Triffids, with a passing comet showering            parasitic aliens over the Earth. As is the way with such creatures,            they are soon infecting humans and trying to turn the world's            military into pod people. And naturally it's up to you to wipe them            out before we all end up like Donald Sutherland.                        Or rather, it's up to you and your squad of elite special forces            types. What sets Outbreak apart from other cliché-ridden            shooters is that you have a whole team of heroes at your disposal,            and you can take any two of them on a given mission. The orders you            can give your squad mate are fairly limited - follow me, stay here,            attack, hold fire - but you can switch between the two characters            at any point in a mission if one of them gets stuck. Sadly this is            one of the game's real weaknesses. While the AI generally does a            good job of following you, your squad mate sometimes gets stuck in            confined areas, ends up on the wrong side of a fence, or sits            sullenly at the bottom of a ladder refusing to follow you up it.            Obviously this can be frustrating, especially if you only notice            that your friend has got lost when you run into an enemy patrol and            there's nobody there to bail you out.                    Pathfinding flaws aside, the behaviour of your AI-controlled            sidekick is determined by a range of stats such as speed, accuracy            and reactions, and different missions should suit different            characters. In practice though you will want to use the same pair            of soldiers whenever possible, because their stats rise rapidly            throughout the single player campaign as they gain combat            experience. The only time substitutes come in handy is when one of            your men is badly wounded and hasn't fully recovered his hit points            by the time the next mission gets underway.                        Once you have selected which two men you will be taking into the            mission, you are given the chance to customise their equipment            load-out, selecting armour, weapon and ammunition for each. I say            weapon, because GSC have apparently taken their lead from a certain            shampoo manufacturer - why take a seperate rifle and grenade            launcher into combat when you can just Fire & Go? As you work            your way through the game's thirteen missions you will get access            to heavier and more sophisticated guns, wrapping everything a            budding action hero could want - machinegun, sniper rifle, shotgun,            rocket launcher and the rest - into a single weapon. All you need            to worry about is how much of each kind of ammunition you carry            into battle, although you can often replenish your stocks by            frisking the bodies of the alien-infested soldiers you kill along            the way.                        The last option you are given, and something else which sets            Codename Outbreak apart from most other first person shooters, is            whether to launch your attack by day or night. Although some of the            missions are fixed, most of the time you can decide whether to            sneak in under cover of darkness using the excellent night vision            goggles or to try your luck in broad daylight. It's a neat touch            which gives you a wider choice of strategies and adds to the replay            value.                    Once you are into your first mission it soon becomes obvious that            this is not just a Quake clone. Codename Outbreak lands somewhere            between a traditional run-and-gun shooter and the likes of Rogue            Spear and Operation Flashpoint, and you will often have to rely on            stealth to complete your missions rather than simply charging in,            guns blazing.                        Shooting while moving tends to be wildly inaccurate, and it pays to            stop and drop to your knees at the first sign of trouble, firing            off a couple of shots at a time instead of rattling through your            entire clip. You can also go ~prone~ to get the best stability for            sniping and to make it harder for your enemy to see you amongst the            undegrowth. There is even a neat camouflage net which automatically            appears over you when you lie down on the grass, making it even            harder for anyone to spot you.                        This isn't a hardcore military sim either though. Thanks to your            advanced body armour you can survive several direct hits from a            machinegun or sniper rifle on the medium difficulty level, and even            a rocket or grenade explosion isn't guaranteed to take you out            first time. Luckily killing your enemies is a little easier, and            one or two good clean head shots from your sniper rifle will            usually do the trick. The result is a nice balance of sci-fi action            and more realistic feeling combat and stealth.                    It's not all good news though. Codename Outbreak is sadly afflicted            by some nasty flaws which could really have used a couple more            months to iron out. The most obvious is the voice ~acting~ (and we            use that term in the loosest possible sense), which makes Plan 9            From Outer Space look like a masterpiece by comparison.                        Not only is the dialogue terrible and the translation often shoddy,            but it sounds suspiciously like GSC invited a few of their            English-speaking friends into their offices to record the voices,            as everyone has a Russian accent and speaks in a sleep-inducing            monotone. The result is actually rather funny, but we suspect it            wasn't supposed to be. It can also get irritating, because the            possessed soldiers only seem to have half a dozen stock phrases            which they repeat ad nauseam throughout every mission. ~Where are            they? Where are they shooting from? I see no-one.~                        The game engine also suffers from a lack of polish, with clipping            problems that only serve to make your squad mate's pathfinding            issues even worse. You can walk right through some apparently solid            objects, and in one mission I found a group of enemy soldiers            trapped underneath a building, with only their heads poking up            through the floor. At the other end of the spectrum, trying to get            past a disabled tank is like finding your way through a maze of            invisible walls. The graphics are uneven as well, with vast            outdoors terrain let down by blocky models and some dodgy            texturing. And when you reach the truly stunning tropical island in            the final mission, with its lush vegetation and towering cliffs,            you may start to wonder why most of the rest of the game looks            rather dull by comparison.                    Codename Outbreak had the potential to be a truly great first            person shooter, a science fiction answer to Operation Flashpoint.            Unfortunately thanks to AI flaws, clipping problems, awful voice            acting, repetitive sound effects and some rather lacklustre level            design in places, we are left with a game that falls far short of            its potential. It's still fun, but it could have been a lot better            given a few more months polishing."}