{"ref": "https://www.eurogamer.net/r-tooncar", "date": "4 Nov 2001", "game_name": "Toon Car", "text": "Usually the cunning idea lying behind a cutesy cartoon arcade racer            is the ability to present fun in its rawest form. Every gamer worth            their salt knows that the genre has been defined and championed by            Mario Kart, and few other games have come close to touching the            sheer entertainment offered by it. Apparently Akaei thought they            knew just how to inject this kind of hilarity into the PC with Toon            Car. Oh how wrong they were...                        Under no circumstances should a game ever feel like it's a chore to            play, yet Toon Car is like doing the washing up, ironing and            hoovering, all rolled into one sickly mess. It's apparent from the            very start that the proceedings could become extremely irritating            extremely quickly, simply from the mannerisms of the grating host            character. It's not often that you can form a grudge against a game            simply by accessing the preliminary menu screens, but here at least            Toon Car succeeds admirably.                        The game structure itself is exactly as you would expect from the            genre, with single race, practice, championship and multiplayer            modes on offer. However, in order to access even the first tiers of            the championship, you must first earn a licence. To pick this up,            you are presented with one of the game's tracks littered with giant            traffic cones, all of which you must knock over whilst completing            three laps within a time limit. This does little to prove your            proficiency within the race environment though, simply because it's            a completely different experience.                    And it's all downhill from there. Once you are finally granted            access to the championship you can choose one of the game's            uninspired cartoon characters, which you could be forgiven for not            caring less about, since none of them seem to have any merit over            the others. Then it's on to the racing.                        It's during the first race that the full impact of just how dull            this game really is hits home. Each race usually falls into a            pattern of beginning at the rear of the grid, steadily gaining            ground on the other racers before taking the lead by the end of the            first lap, then maintaining your position for another lap and a            half until you get shot in the back of the head and sent completely            off course moments before you cross the finish line. This utterly            hair-tearing sequence of events is apparently the game's attempt at            being cunning and fiendish. Unfortunately it's neither; it's just            plain shite.                        Various random power-ups are available during the race, many of            them spinning your car round and forcing you in the wrong            direction. They're not a fun way of causing your opponents            disadvantage, just irritating, much like the rest of the game. It's            not even as if Toon Car is a construction of style over substance.            It's not stylish, entertaining, funny, charming or even cute. The            graphics are utterly whimsical by the standards we have come to            expect, and have more in common with your average shareware            download than a professionally produced arcade racer. The sound is            also less than impressive, with characters yelping repetitively as            they race, while the music is a ~zany~ loop which is only            marginally more pleasant than perforating your eardrum with a power            drill.                    Toon Car is an unfortunate attempt at filling a market hole on the            PC, and it fails miserably. Quite how a game could be such an            extreme opposite of fun is astounding. I played on just to see if I            could squeeze any enjoyment out of it whatsoever, but I'm not            convinced Toon Car was made with any sense of what your average            games player wants. Let me assure you Akaei, it isn't this."}