{"ref": "https://www.eurogamer.net/r-weakestlink", "date": "24 Oct 2001", "game_name": "Reviews", "text": "The task of turning The Weakest Link into a computer game probably            seems like a relatively simple task at first. After all, it worked            for Who Wants To Be A Millionaire. But then you start to realise            that there is a lot more to it than that. There is the competition            between players, the scheming and rivalry, the rapidly increasing            tension as the number of players dwindles. Oh, and let's not forget            the ever-present game show host of doom, Anne Robinson.                        What surprises you when you first play Weakest Link is the amount            of effort that has been put into recreating the show as accurately            as possible. Instead of simply sticking the voice of the host into            the game and be done with it, the developers have created a 3D            interpretation of the entire Weakest Link studio, complete with            inanimate cardboard cut-out audience, swooping camera angles,            beaming lights and nervously fidgeting contestants.                        While it's certainly more impressive to have a fully 3D set as            opposed to a 2D graphical display interspersed with FMV, the            overall graphical quality is fairly mediocre. From the            low-resolution textures to the extremely low-poly studio set and            characters, it all appears very dated by today's aesthetic            standards. The blockhead human models are almost comical in fact,            and their animations do little to impress either. The same could be            said about the voice acting, with poorly impersonated regional            accents and phrases that become increasingly irritating the more            they are repeated.                    You start off by choosing from a set of 24 pre-defined contestants,            whose character portraits couldn't be more stereotypical if they            tried. For example, ~29 year old Tim is a nerdy, boring computer            programmer with an interest in trains and bird watching~.                        Playing on your own, you are pitched against six            computer-controlled contestants of varying intelligence, until you            get voted out as the weakest link or win the game. In multiplayer            the game plays exactly the same, except with up to seven human            players. I can't quite imagine having that many people crowded            around my PC for a game, but multiplayer is certainly more fun, as            you really feel like you're stabbing somebody in the back as you            vote them out of the game, whereas you couldn't care less about the            computer.                        The tension of the TV show is also recreated well, especially            towards the end of the game when you are up against one other            player in a sudden death scenario. Sadly though the main draw of            the game, the ~icy~ Anne Robinson, barely plays a role in creating            any of the tension when pitching in with her ~humiliating~            put-downs during the FMV sequences that pop up throughout the game.            In fact, it almost seems as if Robinson is there simply because she            has to be, as opposed to playing a major part in making the game            what it is.                    The feeling of being part of a game show and competing is achieved            to great effect in The Weakest Link though, despite the slightly            shoddy presentation. And with 100,000 questions up its sleeve, it            is definitely going to last a lot longer than Who Wants To Be A            Millionaire, despite the inability to expand the game for free. It            will be interesting to see which of these two games wins out this            Christmas. Neither is particularly remarkable, but if I had            to choose between them, I would probably choose The Weakest Link.                        -        Who                    Wants To Be A Millionaire : 2nd Edition reviewWho                    Wants To Be A Millionaire : 2nd Edition review"}