{"ref": "https://www.eurogamer.net/r-wwtbam2", "date": "21 Oct 2001", "game_name": "Who Wants To Be Millionaire 2", "text": "The seasonal rush to get games out in time for the Christmas            shopping period is once again about to kick off. Who Wants to Be A            Millionaire is back on the shelves in the midst of it to catch the            eyes of gullible parents searching for something the whole family            can enjoy on little Johnny's new PC. But is it just another cash in            on a tried (or should that be 'tired'?) and tested formula, in an            attempt to steal the limelight from the colossal Anne Robinson            bandwagon? Of course it is!                         Obviously, not a great deal has changed since the previous            incarnation of the home computer version of WWTBAM, and the            mechanics and playing methods remain exactly the same. The            interface has been given a lick of paint, and the graphics have            been sharpened up to offer a much slicker presentation than before.            In addition to this, all the FMV in the game has been remade to            include - hold onto your seats - a studio audience. That the            audience are as well animated as Morph after a day on the bottle            does nothing to either improve or lessen the experience.                         In fact, of all the changes made since the original version, the            only one that makes a notable difference is additional banter from            the lovable Chris Tarrant. This time we get to listen to his            adenoidal drone reading the questions to us, which helps lend a            greater air of authenticity to the game, but does little to aid our            already waning sanity.                    As far as the questions themselves go, the difficulty of each one            actually resembles the amount of money you're playing for this            time. Thanks to the new WWTBAM-equivalent of AI, the game also            remembers which questions Chris has asked you, so you don't get as            many repeats. There are still only 1000 questions though, and after            a few heavy bouts of playing you're likely to exhaust the game's            entire repertoire. Naturally this is the string attached to the            game - you can be sure there will be a full-priced third edition            come next Christmas and there's still no way of expanding the            question set.                         The ~multiplayer~ modes from the first edition remain intact, and            they're still just as pointless as ever, only serving to make the            questions run out faster. The only other real change of note is the            vastly improved loading times, and that really is about it. Oh, I            almost forgot, you get your own name written on the cheque at the            end of the game! How cool is that?! Sigh..                    No right-minded individual needs convincing how sick and wrong it            is to ask £30 for what is essentially a mission-pack for the            first edition, and especially when it offers so little more. I'm            sure it's going to sell well anyway, and Eidos know they're going            to get away with it. It's daylight robbery but while the cow's            there, they may as well milk it.                        -        Who Want                    To Be A Millionaire ReviewWho Want                    To Be A Millionaire Review"}