{"ref": "https://www.eurogamer.net/r-zelda-gbc", "date": "17 Oct 2001", "game_name": "The Legend of Zelda: Oracle of Ages, Oracle of Seasons", "text": "The GameBoy Color is on the way out, but it isn't going anywhere            without a fight. In a sense, releasing the latest title in the            Zelda series on GameBoy Color is a gamble for Nintendo, but on the            other hand it's also a perfectly logical manoeuvre. The Legend of            Zelda: Link's Awakening (or Zelda IV as it's generally regarded) is            one of the most popular GameBoy games of all time, and what better            way to keep GBC owners happy than to give them back what they love?            And of course, every GBC cart works on the GameBoy Advance, so            what's there to complain about?                         Not content with selling the game to both GBC and GBA owners            alike, Nintendo has also managed to flog it to each gamer twice            over. In a feat of marketing genius that would put Sophie Wessex in            a coma, Nintendo have shaped two brand new Zelda adventures out of            the remaining elements of the franchise, and both of them are            must-haves. Individually, Oracle of Seasons and Oracle of Ages are            tremendous RPGs, and if you play one to completion, you're rewarded            with codes to unlock secrets on the other one. In a sense, the two            are linked. Linked, get it?                         The two games share a lot of elements, but then that's hardly            surprising given that they were developed in tandem. Graphically            they are more or less the same, and both leave familiar (and            catchy) theme tunes ringing in your ears. One of the things they            don't share though is plot.                    Oracle of Seasons is about Link's time in the land of Holodrum. As            our mighty hero arrives, Onox, the General of Darkness kidnaps Din,            a cute little dancer friend of Link's who also happens to be the            legendary Oracle of Seasons. Onox uses the Oracle to change the            seasons at will, to amusing effect (although really it's all very            serious, ahem). Link can walk off a screen in Autumn and arrive on            another screen in Spring. There are certain environmental            implications depending on the season, too. For instance, early on            Link encounters a little boy. In the Spring, the boy can use a            puffing plant to jump up the side of an otherwise-unassailable            wall, but in the Winter the plant is no longer capable. Onox hopes            to throw Holodrum into chaos using the Oracle of Seasons as his            weapon. In the process, everything will wither and die, falling to            darkness. With Din imprisoned within a crystal atop the Temple of            Seasons, Link's mission is clear. Using the Rod of Seasons, Link            has to fight the seasonal changes and use the Rod to uncover new            areas.                         In Oracle of Ages, the story takes place in the mystical land of            Labrynna. The peaceful Oracle of Ages, Nayru, has been possessed by            the evil sorceress Veran, and using Nayru's powers to her advantage            she intends to go back in time and block out the sun, allowing            darkness and the inherent evil that comes with it to spread across            the land. Link has to fight the evil Veran through time tunnels            using his magic Harp. The map changes depending on the period of            time poor Link finds himself in.                         In both games, these geological changes can work to your            advantage, or work against you, just as they have done in many RPGs            beforehand including Zelda III on the SNES (although that was light            and dark worlds… anyway). The Harp and Rod both take a bit of            getting used to, but the better Link gets with them the more            valuable they become.                    Both games introduce a lot of new environments and items, and            reintroduce old friends from games past. A lot of enemies are back            too; if you're familiar with the original NES versions of Zelda you            will be wrapt with nostalgia by the end of it all.                         Zelda is as much about puzzle-solving as fighting though, and            there are a number of major Dungeons scattered through the two            games, packed with block-moving and other less obvious puzzles.            Both games are extremely well-paced, too. Puzzles can always be            overcome with a bit of lateral thinking, even if you find yourself            tearing your hair out for hours on end. Both games also feature a            number of sub-quests. Trading items with characters you meet can            often lead to new adventures and explosive weaponry. Upgrading your            sword - as with the original Zelda games - is of supreme            importance.                         One thing I would say about the games though is that neither is            terribly portable. You cannot simply dip into either for a few            minutes on the train or bus; unless you're on a plane or sat in an            armchair or something of the sort, the games are more or less            inaccessible. They have more in common with a good book than a            portable, instant-fix videogame, and some may construe that as a            bit of a problem. That said, both games are indispensable as far as            I'm concerned. You shouldn't buy just one, you should own both. I'd            recommend playing Seasons if you only buy one; it's easier to get            into.                    If you do buy both though, you're in for a treat. They are of            course completely addictive, and completing them over and over as            many of you will, yields a few surprises. For starters, the first            time you complete Ages, you get a password. Plug this into Seasons            and start afresh, and some special extra features will be unlocked.            You will suddenly see more non-player characters to interact with,            and some of them have cryptic passwords for you. Plug these into            Ages and this in turn unlocks interesting sub-quests for secret            weapons and more. As you go on, you get to take on extra boss            characters. Ultimately, you may even steal away to a secluded spot            for a few moments alone with a familiar face!                         Both of the new Zelda games are utterly engaging. There are no            better games on the GameBoy Color or GameBoy Advance yet, and as            I've said, in my opinion both games are indispensable. It took me            nearly a month to play both of them to death, and I get paid to            play them throughout the day. I'd estimate well over 24 hours of            full-on action per game and plenty more if you go back to check out            the bits you missed. Hey, Gaming 24:7. That'd make a good slogan!                         In short, entertainment unmatched by any other portable title,            ten-year-old Russian puzzle games be damned. And what a superb            advert for GameBoy Advance - if this is what Nintendo can do with            older their technology, imagine what GBA owners have to look            forward to. Roll on Zelda Advance."}