{"ref": "https://www.eurogamer.net/r-kohan", "date": "16 Oct 2001", "game_name": "Kohan: Immortal Sovereigns", "text": "In the last couple of years it seems that almost every new            real-time strategy game has boasted the inclusion of ~role-playing            elements~. Most of the time this simply meant that your army            included one or more hero characters who had an uncanny knack of            wandering into the middle of a battle and getting killed, resulting            in a ~game over~ screen.                        The latest attempt to marry the two genres is Kohan, which has been            available in the USA for several months now and is finally reaching            Europe this week. Instead of cobbling a basic experience system or            heroes onto an otherwise traditional strategy game though,            developers TimeGate have gone back to basics and come up with            something utterly unique, a fantasy strategy game which has more in            common with Heroes of Might & Magic than Warcraft.                        Instead of harvesting resources and constructing bases all over the            map, in Kohan you must fight for control over towns which are            scattered around the map, or use settlers to found your own in an            uninhabited area. Settlements start out as bare villages, but            facilities such as blacksmiths and city walls can be added to            increase the resources they produce, unlock more advanced units or            provide other bonuses. When you run out of slots for building you            can upgrade the settlement, allowing the growing town to house more            facilities and support more units, and the individual facilities            within a town can also be upgraded, with a choice of three upgrade            options usually available for each.                    The way in which your troops function is radically different as            well. Instead of running around individually, units are made up of            four front line troops, two support troops and a leader. This can            be either a standard captain or one of the eponymous immortal Kohan            warriors you will discover throughout the game. These heroes            provide bonuses for the troops under their command and can also            wade into the fight themselves, gaining experience throughout the            single player campaign. If one dies it's not the end of the world            either - because they are immortal you can simply stump up some            cash to re-awaken them from a magical amulet. They might lose            experience, but they are at least available again.                        There are only a few types of infantry and cavalry which can be            used as front line troops in a unit, but as you construct and            upgrade temples, libraries, garrisons and other facilities in a            town you will uncover a wide variety of wizards, clerics, archers            and other support troops. Different combinations will provide your            regiment with bonuses to their movement, morale, attack and defence            skills, as well as providing ranged attacks, healing magic and            other special abilities. Each of the game's five factions has its            own unique range of troop types as well, and when you take over one            of their towns you are able to build their units at that town,            making for a bewildering array of troops and almost limitless            possibilities for combining them into regiments.                        Not all of your soldiers are mobile either. Every settlement has            its own fixed garrison of militia which will rush out to defend the            town when an enemy strays too close. This leaves you free to use            the majority of your army for attacking the enemy instead of            defending your base, and although a strong and persistent attacker            can wipe out your militia easily enough, it will at least hold them            up long enough for you to rush in reinforcements. You can also use            special engineer units to construct outposts, which again contain            their own garrison of militia but can be built pretty much anywhere            on the map. These can be perfect for holding down a choke point            such as a narrow mountain pass, or to bolster the defences of a            nearby town.                    All of this comes at a price though. Every regiment you command,            every mine or outpost you build, and many of the facilities in your            towns have an upkeep cost. Unusually though, while the game            features five resources (gold, mana, stone, wood and iron), only            one of them is hoarded - gold. The others are simply shown as a            positive or negative number in your status bar, showing by how much            your production is exceeding or falling short of demand.                        If you don't produce enough of any particular resource the rate at            which you earn gold is reduced accordingly, but annoyingly if you            have a positive flow you don't gain anything from it. This does            make the game's resource system simpler, but it isn't a very            satisfactory way of handling things. Why can't I stockpile a            resource when my towns are producing too much, or adjust the rate            at which my markets and other facilities exchange them for gold to            cash in on any surplus?                        Combat is also a little odd. Because troops are arranged in fixed            regiments, each unit must be in one of the preset formations before            it can do anything. This looks great, especially with the ability            to group up to six regiments into a larger formation, but once you            enter battle any plans soon go to hell and you are left as a            helpless bystander. All you can do is order units to retreat if            things turn ugly, then wait for them to reform at the rally point            before moving them elsewhere. You can't give orders to a unit            unless its men are gathered around their banner, and this always            remains fixed regardless of where the individual soldiers roam            during a fight. So if your men go running off after a fleeing            enemy, you have to wait for them all to get back to their            regimental standard before you can move them anywhere else. While            this does make for a more involved tactical approach to combat, it            can be frustrating if you are used to the immediacy and            responsiveness of other real-time strategy games and expect your            men to do what they are told as soon as you give an order.                    Luckily the game includes a pair of excellent tutorial campaigns to            show you the ropes, one covering the basics all the way from            selecting and moving units on up, the other teaching those already            familiar with the real-time strategy genre some of Kohan's more            unusual features.                        Once you have got to grips with the interface and controls, it's            time to dive into something a little more involved. At the heart of            the game is a lengthy single player campaign which casts you as a            resurrected Kohan lord facing an ancient evil that overthrew your            kind centuries earlier. This is entertaining enough, but proved to            be a little slow paced and overly easy at times. The skirmish mode            shows the AI in a better light though. Having just completed the            campaign with little difficulty I was getting a bit complacent, and            the AI promptly pulverised me in the space of ten minutes. I won't            be making that mistake again...                        Where the game really shines though is in multiplayer. An in-game            server browser allows you to instantly find other players and chat            with them while you wait for a game to fill up, and even though            Kohan has yet to be released in Europe there are plenty of American            players already online. As in skirmish mode you have a choice of            using pre-designed or random maps, with a variety of options to            tinker with starting conditions, terrain types and so forth. Epic            team battles with four players on each side battling across massive            maps are surprisingly common and a lot of fun. It's much faster and            more furious than in single player, and you have the ability to            exchange technology, cities and money with your allies. The game            even comes with an easy-to-use editor which allows you to create            your own custom maps for online or offline play.                    Kohan is one of the most innovative real-time strategy games we            have come across in recent years, reinvigorating the genre with            features more usually found in turn-based titles. It's not perfect            - the resource system is a little odd and the lack of direct            control over units may prove an irritation for hardcore stategy            fans at first - but it does make a refreshing change from your            typical Command & Conquer clone. With an extensive story-led            camapign to ease you into the action, an accomplished skirmish mode            for solo players and excellent online support, it's well worth a            look."}