{"ref": "https://www.eurogamer.net/r-redfaction", "date": "4 Oct 2001", "game_name": "Red Faction", "text": "When we looked at the PlayStation 2 version of Red Faction in July,            our biggest concern was the control system. Playing a first person            shooter using a control pad has never been my cup of tea, and            wherever possible I have tried to avoid it. Another factor is            visual quality. As matters stand, comfortable though it is to sit            in front of my enormous television playing Generic Shooter 3 on my            latest console, invariably my PC upstairs turns out sharper, higher            resolution visuals with a control system friendlier to a veteran of            point and shoot PC releases.                         With Red Faction, the situation is no different, and besides the            obvious improvements in resolution, visual quality, framerate and            control, the PC version also boasts those much-needed online            multiplayer features. Will Volition's best game since Descent stand            up to PC-based first person shooters like Return to Castle            Wolfenstein this Christmas? There's only one way to find out...                         For those of you who are new to the game, the premise is that you            are Douglas Quaid in Total Recall under a different pseudonym.            There is no official connection between the Arnold Schwarzenegger            blockbuster and Volition's first person shooter, but there might as            well be. Your character Parker finds himself thrown into a deadly            revolt on our solar system's red planet, and with guidance from            members of the rebellious Red Faction you must overcome your mining            supervisors and escape from a world of hurt. Unlike said movie            though, Red Faction suffers from a problem familiar to Hollywood            directors and movie buffs; not knowing when to end. There are            several opportunities for closure in Red Faction, but the developer            chooses none of them, preferring to exhaust every single gameplay            and story mechanism first. The PC version is a straight copy of the            PS2, so fans of the original will find nothing new in the single            player game.                    Fans of the PlayStation 2 version may also be disappointed to learn            that the visuals in the PC version are nigh on identical to those            of the original. If it ain't broke don't fix it perhaps, but given            the power of graphics cards like the GeForce 3 and Radeon 8500,            there are plenty of opportunities for showing off. My main            criticism is that everything is remarkably angular, and there seems            little excuse for the lack of curves as the game runs well even on            my relatively old GeForce 2 GTS system.                        That said, what we had to start with was fairly impressive. The            mining sections are very brown, but the oft-repeated textures have            a habit of blending together into a believable chasm, while the            indoor areas are smartly dressed, with company insignia and Red            Faction spray-paint on many surfaces. The character models are also            rather good, although the facial animations seem like a step down            from the three year old Half-Life at times, and characters have a            stereotypical action game tendency to race at full pelt to a spot            not two feet from you, then stop dead and stand motionlessly            reciting their lines.                        Weapons are sometimes difficult to spot because they blend in with            the floor of the room or lurk behind the corpse from which they            fell, but when you find them the models and animations are            uniformly excellent. My only disappointment was that throughout the            game the weapon sound effects were rather timid. The one weapon            which seems lacking on all fronts is the default pistol which, like            the Quake 2 blaster; is completely useless and looks rather boring            to boot. Other weapons, like the shotgun and Uzi, are at least            exciting to use, and as you progress through the game you get to            the real meat. The Rocket Launcher can blast holes in the scenery,            while the Rail Driver can actually pierce several successive walls            like a hot needle through butter, and comes with a fully infrared            alternative firing mode which allows you to search for body heat in            nearby rooms.                    Which brings me to the subject of Geo-Mod. Geometric Modification            has gone nowhere since the PlayStation 2 version, but it still            serves to show off Volition's clever manipulation of the physics            engine. When you pick up the rocket launcher or explosive charges            you are given the ability to blow things up, and as with the PS2            version this is used to varying degrees throughout the game. In one            section you are faced with a locked door and a rocket launcher, and            blowing a hole in the wall next to it provides a handy alternative            to finding the key. In another section molten rock flows along an            aqueduct, and taking a chunk out of the underside will tip the            contents over anybody unlucky enough to be in the vicinity. So on,            and so forth.                        The problem with Red Faction single player though isn't that it's            repetitive, or that it has a weak array of weapons, or that its            visuals are poor, its controls awful, or any of those typical first            person shooter problems. In fact Red Faction is a good, by the            numbers action game with a few memorable moments and some welcome            additions, including driveable vehicles such as the mining drill            (again lifted from Total Recall) which looks menacing enough from            the outside and switches your view to a flickering green tinted            viewscreen from within.                        The problem with Red Faction is that the developers took a great            idea from an even greater film, changed a few names and numbers,            ripped out the body of the conspiracy and recoloured matters for            themselves. But instead of capitalizing on this they filled in the            gaps with plot devices stolen from Saturday morning cartoons - you            will cringe at some of the revelations you become privy to. Still,            as a single player you can expect a decent adventure with some            excellent gameplay, and you can have fun blasting holes in things            and railing unsuspecting guards through a wall fifty metres away.                    Multiplayer is an entirely different kettle of fish. The PC version            of Red Faction features three different multiplayer modes:            Deathmatch, Team Deathmatch and Capture the Flag. Deathmatch is the            most popular so far, and understandably so. With the huge array of            weapons on display and a fairly random cross-section of the gaming            community currently in possession of the game, numbers are            reasonably high but cohesion isn't, and most players just want to            shoot something without the added complication of a team objective.            The Deathmatch mode can be exceptional fun, as long as weapons            proliferate quickly; the default pistol is incredibly boring and            the constant pistol duels that players have to put up with for the            first five minutes of a round cause untold grief.                         Part of the problem there is that most of the levels are big and            complicated, and those that aren't just have peculiar layouts.            Quake-style duelling is more or less out of the question for the            moment, and with guns spread unevenly throughout each arena you            often have to fall back on the pistol you spawn with. A huge number            of amateur level designers are using the RED Editor which shipped            with the game to create their own multiplayer arenas, so this will            hopefully change in the near future, but in the meantime there are            only a few decent arenas. Another reason for disliking some of the            arenas is the number of doors. Okay, it's fun to sit there with a            Rail Driver and shoot people as they run through the doors, but            then it's equally fun to find a secluded place and use the Rail            Driver like the bad guys in Erazer did, bisecting nature with a            single flick of the trigger.                        The problem with doors is that they tend to hold you up because of            the lag. Latency is a big problem for Red Faction players at the            moment. With more than four people on a server the pings often leap            to about 300, at which point the doors become an irritation, as            does the Rail Driver. In fact, the only things stopping Red Faction            from being an excellent multiplayer game are the need for some            network code tweaking and a few smaller arenas.                    Red Faction is a solid first shooter with a few problems. Visually            it has been surpassed a hundred times over on the PC, thanks to its            striking angular surfaces and lack of impressive lighting effects,            and it's a shame that the Geo-Mod technology isn't as relevant to            your adventure as it perhaps could have been. With a bit of spit            and polish the multiplayer game could be Red Faction's saviour, but            if you're tempted to pick it up to try that out, I would wait for            the inevitable patch, or at least make sure you have access to a            well-stocked LAN.                        -        Red Faction PlayStation                    2 reviewRed Faction PlayStation                    2 review"}