{"ref": "https://www.eurogamer.net/r-anachronox", "date": "25 Sep 2001", "game_name": "Anachronox", "text": "Conceived by former id Software and 3D Realms designer Tom Hall,            Anachronox is an epic role-playing game inspired by classic console            game like Chrono Trigger and the Final Fantasy series, but rendered            entirely in real-time 3D on your PC, right down to the carefully            choreographed cutscenes.                    The story centers around Sylvester ~Sly~ Boots, a down-on-his-luck            private detective living in a mysterious city called Anachronox,            built by an extinct alien race and sitting at the heart of a vast            network of ~senders~ which can transport ships instantly across the            galaxy. The game begins with Sly being thrown through a window by            the local mob boss as a result of a bad debt, and things go rapidly            downhill from there. Planets explode, alien artifacts are            activated, and the very existence of the universe itself is at            stake.                    Gradually you will gather a rag-tag group of oddball characters to            help you in your increasingly important quest, including a sentient            robot, a maverick scientist and a depressed comic book super-hero.            Only three characters can work together at any one time, but you            have a pool of seven (including Sly himself) to draw on by the end            of the game. Understandably your choice is usually limited to some            extent, but all of the characters will get used at some point and            each has its own unique abilities which can prove useful both in            combat and for exploration and puzzle solving. The interaction            between the characters during cutscenes can also be highly            entertaining, while some of them have a tangled personal history to            uncover.                    The settings which you visit are as varied as the characters you            meet there, ranging from the make-shift multi-cultural chaos of            Anachronox to Sunder's scientific research labs and the inevitable            lava world of Hephaestus with its money-grabbing monks.                    All of this is handled by a heavily modified version of the Quake 2            engine, and despite the best efforts of Ion Storm's programmers the            result looks a little primitive at times. Imagination, excellent            level design, intricate texturing and bucket loads of atmosphere            make up for this usually, but a few locations are hideously ugly,            with huge slab-like polygons, dodgy backdrops and pixellated low            resolution textures. As most of these problem areas are towards the            end of the game it seems likely that the developers simply ran out            of time to polish things up.                    One area where the game's graphics can't be faulted though are the            special effects, which are in a league of their own. Even the most            basic attacks result in a pyrotechnic display worthy of a Jean            Michel Jarre concert, and the more powerful ~spells~ available            towards the end of the game are every bit as spectacular as those            seen in recent Final Fantasy titles. Gateways open to hideous alien            dimensions, unleashing spectral horrors that impale your enemies on            chains or fire off blinding shockwaves. Balls of fire rain down on            your characters and spin around them like a tornado before            converging on their body and exploding in a vast screen-burning            explosion. Sufferers of epilepsy and motion sickness should steer            well clear of this game.                    As in the console games that inspired it, combat in Anachronox is a            stylised affair with characters lining up facing each other and            taking it in turns to pummel the living daylights out of their            opponents with spectacular special abilities, weapons and spells.                    Each character has a different speed in combat, which governs how            frequently they can carry out actions. When the ring showing their            readiness is full, a character can choose to move, attack, cast a            spell, use an item or carry out a special attack. The latter drains            a seperate reserve known as ~bouge~ which builds up gradually            during a fight. All of this is neatly explained during training at            the appropriately named ~Whackmaster Jack's~ combat club near the            start of the game, and once you get to grips with the basics it's            far simpler than it may at first sound.                    Unfortunately at times combat can get rather repetitive. The            glorious special effects which accompany any attack are a little            long-winded, and once you've seen the same flashy ten second            sequence several times you may start to wish that there was a            shorter version to speed things up. And although there is a wide            range of monsters and bad guys to fight across the various worlds,            some locations rely too much on constant combat with the same            creatures over and over again. It doesn't help that you are often            forced to backtrack across levels you have already cleared, or that            the game sometimes respawns enemies that you killed half an hour            earlier when you return to an earlier map. It can all get rather            frustrating at times.                    What makes this doubly annoying is that Anachronox is one of the            least stable games I've played all year, even after installing the            ubiquitous patch. It has an annoying habit of hanging up while            auto-saving your position during map transitions, simply showing an            Anachronox logo without any explanation or error messages. Unless            you know how to get into debug mode there is no way to escape from            this ~title screen of death~ short of rebooting your computer.                    There is also no obvious way to skip most of the lengthy in-game            cutscenes, and coupled with the frequent crashing and save game            issues this can prove to be a real headache. This is especially            true during the game's grand finale, which features three boss            battles in a row interspersed with lengthy cutscenes, and no way of            saving your game or changing the equipment load-outs of your            characters in between. If you die or the game crashes you can't            even use the cheat codes to skip fights which you have already            beaten, because this leaves you stuck or hangs up the game            entirely. After some thirty hours of playing the game and with the            end quite literally in sight, I can't begin to describe how            frustrated I am at this point.                    Sadly bugs and design flaws like this are all too common in the            later stages of the game, where presumably less testing was done.            Pointless backtracking becomes increasingly common and combat loses            its edge. By the time I reached the game's final chapter fights            were more about attrition and patience than challenge and            experimentation, as I had amassed enough equipment to heal and            resurrect my characters ad nauseam, and developed special powers            and magical items capable of wiping out entire armies in a single            blow. Apart from the boss encounters there was little real            challenge, and the game drew to a close with a whimper rather than            a bang. Which is a shame, because the first half of the game is            incredibly enjoyable, and the rest could have been every bit as            good with a little more time.                    And that's the problem. Anachronox was in development at Ion            Storm's ill-fated Dallas office for four long years before finally            emerging earlier this summer, almost two years late and a few            million dollars over budget. A patch was available before the game            was even released in Europe, but as the team that created it was            kicked out the door right behind the game, the chances of any            significant support in future are faint to say the least. It also            seems highly unlikely that the planned second part of the game will            ever see the light of day, despite the fact that much of the            content for it is apparently already done.                    This leaves Anachronox as a flawed classic, with moments of true            genius marred by bugs and rough edges which could really have used            a few more months of polishing.                        -        Tom Hall                    interview (November 1999)                Tom Hall                    interview (November 1999)"}