{"ref": "https://www.eurogamer.net/r-megamanx5-psx", "date": "9 Aug 2001", "game_name": "Megaman X5", "text": "If ever a reminder was needed that the PlayStation has been            superseded, Mega Man X5 is it. A tired relic of a past era, X5 is            an example of how comfortable developer Capcom is with milking a            franchise beyond the point of no return. Virtually every game on            their release schedule is a sequel these days, for better or worse,            and almost without exception the new ones spawn sequel after sequel            after sequel.                         That's not to say a lot of them aren't good, but with over 20 Mega            Man titles doing virtually the same thing over and over, couldn't            we do with a rest?                         With the exception of Mega Man Legends, for the most part the            games consist of steering Mega Man or Zero through eight sets of            levels and defeating the boss at the end to gain a new power. By            that definition, X5 is standard fare. Levels can of course be            completed in any order, and you can simply say screw 'em and head            straight for the final levels if that rocks your boat. The point in            the earlier levels though is the special powers you pick up, which            are intrinsically important to the final stages.                         Mega Man games are generally quite challenging, but X5 is slightly            more difficult than any I've encountered in a while. You really            have to take the time to go out of your way and find armour            power-ups and health bonuses to get anywhere.                    Controls-wise, Mega Man X5 is nothing new. You use the D-pad rather            than the analog stick to move Mega Man or Zero along, usually from            left to right, and you have to avoid obstacles and kill the various            little monsters that stand in your way. Usually mechanical            abominations of some description, these blighters have fairly            standard firing patterns which can be defeated with some careful            jumping, firing and (new!) ducking. The trick is in avoiding them            when they all attack at once.                         Visually X5 is nothing particularly new, even for the PlayStation.            It's nicely drawn, with some fairly detailed character models. Mega            Man himself is decked out in his X-gear, which makes him look like            he has a weird sort of metallic shell around him. Zero likewise.                         The general animation of Mega Man and Zero is acceptable. They run            like they always have done and move fluidly, although perhaps they            hang in the air a little longer than I'd like. The enemies are            animated fine within their set movement/firing routines, and the            bosses likewise. That said, I wasn't particularly overwhelmed by            many of the X5 bosses. I thought they were a bit samey for the most            part. I have yet to find a boss as impressively overbearing as the            one featured in the final showdown of Marvel Vs. Capcom 2, which            stood towering over the building top you were fighting on, its            chest, head and forearms available to pummel you with. That was an            encounter and a half, and both games use similar parallax scrolling            engines so I don't see why Capcom have to so obviously confine            bosses in games like X5 to the space Mega Man can move in. It's            traditional, but that's no excuse any more.                    The level design is very ordinary, with long periods of left-right            run and jump action followed by a ladder then perhaps some wall            climbing. One of the benefits of Mega Man's X-suit is that he can            stick to walls then spring off them and stick again further up,            effectively adding a Y axis to his movement. Most of the puzzles            that test this skill consist of walls sliding together Star Wars            compactor style, and a manic scramble to escape the gap at the top.                         On the whole the interface and general presentation of X5 is as            good as usual. The cartoony graphics of the interface remind me of            one of those mock computer terminals in children's X-Men cartoons,            but it all moves nicely enough and it's very simple to just pick up            and play.                         The backgrounds too are very nicely defined, although a few more            layers of scrolling might have done something to aid the illusion            of depth. I can understand why Capcom shy away from this (classic            Mega Man design ethos, the need to differentiate between fore and            backgrounds), but I think there's room for some variation here.            Moving along and simply seeing a tapestry of doom in the background            is a bit boring after a while, and it does make the game's            locations feel a bit too similar to one another, even though            they're actually quite different.                    Experienced Mega Man fans won't find anything to shout about here;            it's just eight more bosses and some new final stages to overcome,            with the added bonus of a crouch key. The graphics, audio and            gameplay are almost identical to previous incarnations (put X4            alongside X5 and even a fan would have trouble distinguishing), and            although there are eight sets of levels that you can play any way            you like, the game feels pretty tired after only one or two. Add to            that the fact that you can play through the entire game without            reading a single window of dialogue and you have yourself a pretty            unexciting platformer.                         Don't get me wrong, there are people who will like Mega Man X5.            Fans of the series obviously can't get enough of it or they would            have given up on the whole thing by now. Regrettably though, I am            not a big Mega Man fan, for precisely the reasons that a lot of            people are. It's repetitive, it's unadventurous, and ultimately            I've done it all hundreds of times before, and even though X5            retails for a paltry £20, I'd rather play something new if            it's all the same, or Mega Man Legends 2, which is at least            something different."}