{"ref": "https://www.eurogamer.net/r-conflict", "date": "7 Jun 2001", "game_name": "Conflict Zone", "text": "While most real-time strategy games are set in some kind of bloody            total war, Conflict Zone is a very different beast. In 2010 the            International Corps for Peace (ICP) is struggling to keep warring            factions apart and rescue innocent civilians caught up in the            crossfire, while a shadowy organisation known as GHOST stirs up            trouble behind the scenes.                    Working for either the UN-style do-gooders or the corporate-run            terrorists, you will find yourself battling your way across the            deserts of North Africa, the mountains of Kashmir, the rice paddies            of south-east Asia and the remains of the Soviet Union. And while            there is still the usual array of ~build a base, destroy the enemy~            style missions found in any such strategy game, you will also be            called upon to sabotage chemical weapons factories, escort VIPs,            rescue prisoners, and defend your studio while television crews            arrive to interview survivors of a massacre.                    Which brings us to the game's main innovation. While every war            since Vietnam has essentially been run by and for the media,            Conflict Zone is the first real-time strategy game to try to mirror            this reality. As such the outcome of a battle depends not only on            out-fighting the enemy, but also on winning the war on the home            front. All but the most basic of units and buildings require a            certain approval rating, and the higher your popularity the more            advanced the troops you can construct. In the case of GHOST this            means filming your battles for the TV, with each hard-fought            victory broadcast live from your media center adding to your            popularity. For the ICP it means rescuing local people from the            warzone, locating and defusing mines, and generally being            sickeningly nice to everybody who isn't shooting at you.                    Needless to say this means that the GHOST campaign is a lot more            fun than the ICP one. There is nothing more annoying than garnering            enough popularity to allow your factories to start churning out            some powerful new weapon, only for a news report to flash up saying            that ~civilians are being targeted~, leading to an instant drop in            approval ratings. This is especially true thanks to the            vomit-inducing degree of moral outrage present in the female TV            presenter's voice as she catalogues each supposed failing of your            humanitarian campaign.                    It also doesn't help that whenever something goes wrong, you get            blamed for it. If GHOST shoots down one of your rescue helicopters            or blows up a refugee camp, you lose popularity. If you            don't rescue the civilians quickly enough, the media complains. If            the enemy herds a group of civilians into the midst of a battle or            chases them into a minefield, you get blamed if they die. If you            blow up an enemy recruitment camp, where the locals are brainwashed            into fighting for the terrorists, you get accused of destroying a            refugee camp. If one of your soldiers steps on a mine, you lose            popularity. Hell, if a GHOST soldier gets blown up by one of his            own mines, you still seem to end up taking the blame. Before long            you'll find yourself screaming at the monitor ~look, it wasn't my            fault~. Or maybe that's just me...                    It might be realistic (witness the Gulf War or Kosovo) and it was            certainly a brave attempt to try something radically different, but            I found it to be rather irritating in practice. It's all too easy            to lose the PR war through no real fault of your own, and once that            happens the game is as good as over. However low your popularity            is, you can always build more refugee camps and rescue helicopters,            but if the nearest town is swarming with enemy units that shoot you            down as soon as you try to help anybody there's not much you can do            about it. And you lose more popularity when the helicopter            explodes.                    Playing as GHOST on the other hand, public opinion is based            entirely on your performance in battle, assuming of course that you            have cameramen there when you win a fight. This means that your            popularity will generally keep rising throughout a mission unless            you really foul things up.                    The resource system is also different for the two factions. Both            sides get a number of Command Points each second which can then be            spent on new units and facilities, and both sides effectively            ~harvest~ civilians. But while the ICP gets a simple one-time cash            reward and a popularity boost for each civilian successfully            airlifted to their refugee camp, GHOST gets an increase to the rate            at which it earns Command Points, and your enlistment camp also            turns the civilian into a random infantry unit for free. On the            other hand, if the ICP loses battles its popularity isn't harmed            (as long as no civilians are harmed), while GHOST will earn less            and less money as it keeps losing battles. Sadly none of this seems            to noticeably effect your AI opponent though.                    The game's other main innovation is the commander system, which            helps take some of the micromanagement out of real-time strategy.            Up to four leaders are available to you by the end of a campaign,            each with its own personality and speciality. You can assign units            and resources to them and then order them to attack or defend a            location or to build up your base, with varying results. Attacks            tend to be little more coordinated than if you had simply selected            all the units, clicked on the destination and left them to it, but            commanders do make good use of terrain and chokepoints when            defending a base, covering all the entrances effectively and taking            advantage of any high ground. Their only failure is being too            static, and it's not unusual to see enemy troops breaking into your            base while a defending commander keeps his surviving soldiers            covering another entrance. As long as you don't expect too much            from them though, they can lift some of the burden of command from            your shoulders and leave you free to focus on overall strategy or a            different part of the battlefield.                    With or without the help of your commanders, you can control            upwards of two hundred units. You can even call in air raids in the            later stages of the game, which can prove devestating. Things tend            to slow down somewhat in the midst of a big battle, but the range            of units and buildings on offer is certainly generous, with            infantry, helicopter gunships, tanks, mobile artillery, jeeps,            anti-aircraft units, submarines, turrets, radar towers and commando            troops available. Not all units are created equal though - I've yet            to work out what grenadiers or soldiers are good for, apart from            acting as cheap cannon fodder and getting squished by tanks.                    Seeing hordes of infantry getting run over Carmaggedon-style or            reduced to their constituent parts by artillery fire isn't the only            source of amusement in the game. The developers have decided to            lighten the tone in the cutscenes, which are downright surreal and            lampoon everything from Dr Strangelove and Lawrence of Arabia to            The Matrix and Stargate, not to mention those classic Hamlet cigar            adverts. The ICP's introductory cinematic alone features a shark, a            herd of cattle, a disco dancing officer and a guitar-playing            rastafarian in the background, although not all at once we hasten            to add. The result is incredibly funny at times, but doesn't quite            gel with the rest of the game.                    It's all a bit hit and miss really. The interface is simple and            should be easy to use, except that it is unresponsive in the heat            of the action and suffers from annoying bugs and quirks. For            example, the unit grouping system unloads troop transporters when            you select them by hotkey, and soldiers stop dead in their tracks            whenever you add another unit to their group. The behaviour system            is more trouble than it's worth as well. In strict mode units do            exactly what you tell them to but don't show much initiative,            sitting still while artillery shells fall on your base nearby. In            aggressive mode though they will attack and chase any target            visible on the entire battlefield, completely ignoring your orders            as soon as they make contact with the enemy.                    Conflict Zone tried to do something different in what is normally a            highly derivative genre, but unfortunately the new features don't            work quite as well as they perhaps should have done, and the game            can't quite decide whether to play it for laughs or not. The single            player campaign is utterly linear, and the way the background story            is presented between missions via TV news reports is tedious and            disjointed. The difficulty settings don't seem to make much            difference either - the early missions are mostly straightforward,            but the second half of each campaign is incredibly difficult even            on ~easy~. The skirmish and multiplayer modes go some way towards            rescuing the game, with a wide range of maps and support for up to            eight human or AI players, but this could have been much, much            more.                    All in all a nice idea, but poorly implemented. We can only hope            that MASA or another company takes the innovations introduced in            Conflict Zone and does them the justice that they deserve. In the            meantime, ~public opinion is not in your favour - act with            caution~."}