{"ref": "https://www.eurogamer.net/r-moonproject", "date": "29 May 2001", "game_name": "Earth 2150 - The Moon Project", "text": "The Moon Project has had something of a troubled history.            Developers TopWare Interactive filed for insolvency in February,            just weeks after releasing the game in their native Germany, and            then US / UK distributor Mattel Interactive was taken over by            France's UbiSoft. But we've finally got our hands on review code            and the game should be available here in the UK within the next            month. So the question is, was it all worth the wait for            English-speaking countries?                    Rather than being a full sequel, The Moon Project recycles the game            engine and many of its units and buildings from Earth 2150, adding            new technologies and new campaigns for each of the factions. The            storyline runs alongside that of the original game rather than            continuing it, with the Lunar Corporation working on a top secret            military project. If you choose to help them you will be supporting            their research effort and protecting Project Sunlight, while as the            United Civilized States you must uncover what's going on up there            and put an end to it before the weapon becomes operational. Quite            how the Eurasian Dynasty fits into all this isn't clear - there is            a campaign for them, but from what we played it didn't seem to be            connected to the rest of the game.                    Most of the action takes place on the lunar surface though, a new            setting for Earth 2150 with some visually impressive but distinctly            colourless craters and mountain ranges to fight over. Unfortunately            one thing the moon lacks is atmosphere, although Topware seem to be            blissfully ignorant of conditions there. As a result, apart from            the lack of weather, colour and plants you won't notice any real            difference between the moon and the Earth below. Clouds of smoke            drift lazily out of factory chimneys into the vacuum and are blown            away by the non-existent wind, lighting conditions cycle every            twenty four hours, and gravity seems to be exactly the same as            well. Go to the back of the class.                    Topware have also chosen to ignore (or simply forgotten) the fact            that in space nobody can hear you scream, which is undoubtedly a            good thing. After all, battles would be pretty tame without the            fizzing of electro-cannons and the thundering explosions of            rockets.                    Scientific inaccuracies aside, the moon still tends to be a rather            dull and monotonous place thanks to the uniformly grey terrain,            which is something of a waste of the game's stunning 3D graphics            and easy-to-use free-roaming camera. Flashy weapons and new effects            like meteor showers and earthquakes help add some visual            stimulation, but all of this comes at a cost. Even on a Pentium III            600 with 192Mb of memory and a GeForce 2 graphics card things slow            down during large battles, and you will probably have to live            without some of the graphical bells and whistles if you want to            maintain a decent frame rate. Luckily there is a plentiful array of            options to tweak if you find your system lacking in grunt.                    On the musical side of things there are seperate soundtracks for            each of the three factions which fit their character perfectly,            from the bombastic Eurasian Dynasty orchestral pieces to the            grinding breakbeats and distorted guitars of the UCS. The music is            also context-sensitive, with spooky night-time tracks giving way to            rousing battle themes as your units stumble into an enemy base in            the darkness. In total there is over an hour of music, all            conveniently stored in WinAMP-friendly MP2 format. In fact, apart            from the typically repetitive unit acknowledgement voices, the only            real downside to the game's audio is that it just isn't loud            enough. Even after setting all the in-game options to maximum I            still had to crank up my amplifier to almost double the volume I            usually use. Maybe Topware did remember that sound doesn't carry in            a vacuum after all...                    This being a real-time strategy game, you might be expecting the            usual succession of base-building, resource gathering, unit            production and ass whomping. And you would be right. Like Earth            2150 though, The Moon Project does offer some level of innovation.                    The most obvious departure from other strategy games is that you            will have a fixed base throughout your campaigns to provide you            with new units, research new technologies and allow you to recycle            old vehicles. At the end of a mission you can often send any            survivors back to your main base to carry over to the next mission,            although annoyingly this isn't done automatically, and so you will            have to get all of your troops back to the landing site in one            piece and load them on to the transporter, shipping them back to            your main base fifteen at a time. You can also transfer your cash            between the mission and your main base or research center, although            again this is cumbersome as you can only transfer a measly 5000            credits at a time with your transporter. Luckily any remaining cash            you have on the battlefield at the end of a mission is            automatically transferred to your research center.                    There is a downside to this though, and that is that it can            completely ruin the campaigns if they aren't planned carefully            enough. The bad news is that, especially in the case of the new            Lunar Corp campaign, the Moon Project isn't very well thought out.            As a result you will find yourself with more cash than you can            possibly spend and a vast all-conquering army by the end of the            game, and the only difficulty comes when you reach a lone-wolf            mission which gives you a limited force and doesn't allow any            reinforcements or base building. I got away with over half a            million credits at the end of one mission half way through the            campaign, which was more than enough to research every remaining            technology.                    There are other problems with the campaign balance as well, and            again it is Lunar Corp that comes out on top. Unlike the other two            factions, Lunar Corps constructs buildings in orbit and has them            dropped down on to the surface of the moon to order, which is much            more convenient than needing vulnerable construction vehicles to do            all the work. Lunar Corp don't need to keep their buildings within            a certain distance of the nearest power source either, and their            construction facility can build all kinds of unit, while the other            factions need seperate factories for military and civilian craft.                    Lunar Corp also has access to some incredibly powerful weapons            right from the start of the game, while the UCS has a heavy mech            with a ridiculous number of hit points. The Eurasian Dynasty just            doesn't have anything to respond with, especially in the early            stages of the campaigns. As a result, the Lunar Corp campaign is            almost ludicrously easy as you build up a vast force of            electro-cannon wielding tanks, while the UCS campaign is most            charitably described as ~challenging~ and the Eurasian Dynasty            missions are simply too hard.                    On the bright side, unlike other real-time strategy games, Earth            2150 and The Moon Project allow you to create your own units by            combining different chassis types, weapons, shields and equipment            that you have researched, producing a vast range of possible            vehicles. This adds plenty of variety in terms of both gameplay and            graphics, although an annoying bug / feature in the design system            means that the computer keeps spitting out random and often            pointless designs of its own based on the latest and greatest            hardware, and however many times you delete these unwanted designs            it just keeps creating more of them. Irritating to say the least.                    The Moon Project sadly falls far short of its potential, and no            amount of eye candy and dynamic music can save it. The drab lunar            landscape which makes up much of the game is a poor substitute for            the rich snowfields and forests of Earth 2150, and poorly balanced            campaigns make the single player experience less satisfying than it            perhaps should have been. The game also seems to have lost            something in the translation, as many of the mission briefings and            in-game messages sound silly and a few just don't make any sense.                    Fans of the original may find enough to like here, especially with            the inclusion of an improved map editor and mission scripting            language, but is it worth the full-price tag for what is            essentially an overblown stand-alone mission pack? Something of a            downbeat end for Topware we're sorry to say...                        -        Earth                    2150 reviewEarth                    2150 reviewTopware                    goes underTopware                    goes under"}