{"ref": "https://www.eurogamer.net/r-gungriffonblaze-ps2", "date": "28 Apr 2001", "game_name": "Gun Griffon Blaze", "text": "Game Arts' Gungriffon Blaze is the sequel to a couple of Saturn            games I never played, but it has no trouble selling on its own            merits. It's a game about big stompy robots, but unlike Mech            Warrior's clunky 20 paces per minute behemoths, GB's ~AWGs~ can            cover ground at cheetah speeds and have no difficult swerving out            of the way of incoming rockets.                         Players of PS2 Unreal Tournament and TimeSplitters will have no            trouble getting used to the controls of GB's mechs. In familiar            style, the two analog sticks handle movement and aiming, while the            rest of the Dual Shock buttons are mapped to control strafing,            firing, weapon-switching and the like. Using the options menus            within the game, you can remap these as you like, so if your Unreal            Tournament configuration is slightly unusual, you can come up with            a suitably close approximation on the Dual Shock within a couple of            minutes.                         With controls settled upon, it's down to the action itself. Set at            the outset of the Third World War in 2015, you take the reigns of            the dreaded peace-making AWG mechs, sent into the warzone to save            civilians from the vicious forces that endanger their lives.            There's something about the USA and an alliance of south-eastern            states occupying Europe and Asia too, and a mass migration of the            populace to the East, but for heaven's sake this is a game about            great big stompy robots and explosions, not politics.                    The game offers six basic missions with multiple tasks, ranging            from seek and destroy to capture and hold. There's a lot of            strategy to Gungriffon Blaze, and this will doubtlessly endear it            to a number of mech fans who feel that Mech Warrior 4 didn't do            their genre much justice. Level design is quite clever and varied,            and the missions will often take you a lot of time to overcome, but            there is an over-dependence on wide-open spaces and not enough            Shogo-like inner city battles, which I feel are more entertaining.                         You can't knock GB's arsenal though. Your loadout isn't that            impressive to begin with - the homing missiles, normally a source            of immense enjoyment in games like Mech Warrior, take an absolute            age to lock onto anything. When you start picking up weapons            though, your outlook improves immeasurably. Lets take the shotgun            for example. A mech with a shotgun - sounds a bit useless right?            Not at all. If you pump cartridges of car-sized shrapnel into            anything it quickly gives up the ghost. Complementing your weaponry            are a number of alternate mech suits too, which turn up further            into the game.                         It all runs at an unimpeded 60 frames per second, but suffers            slightly in terms of visual quality as a result. The level of            texture detail is a bit below par, and the models look a bit like            badly painted miniatures at times, rather than battle-hardened            mechanoids. One of the mainstays of any mech game though is            explosions, and these are loud and acceptably flashy. The way the            mechs move is very human too, which is quite an achievement, and            the other vehicles in the game act sensibly as well. In fact, the            animation is generally of a high quality throughout,            although the designers clearly didn't blow up enough buildings            before they planned some of it.                    Other peculiars that deserve a mention in the presentation            department are the understated, yet memorable soundtrack, and the            inter-mech chatter of the various pilots in the field (which is            apparently a faithful port from the Japanese version, despite being            in English). Both add to the general atmosphere of the game, and            give the impression of an overall highly polished product.                         That said, there's always a 'but' with these things, and with            Gungriffon Blaze it's the fact that it's all over so soon. Don't            get me wrong, the game is of a perfectly acceptable length, but            it's just that you'll find yourself scrabbling through the thing            without a break and ultimately you'll wish there was more of the            same. The lack of any sort of multiplayer to keep things going puts            a slight dampener on things too.                         That's not to say that Gungriffon Blaze isn't an excellent game            though - it certainly is. It boasts a competent control system that            will be familiar to many, a well-rounded single player game and a            decent amount of game time. Our only complaint is that it's a bit            one-dimensional at times, and the lack of any sort of diversity            outside of the single player story mode is quite archaic for a            ~next generation~ PlayStation 2 title. Irrespective of that, anyone            with a few bob to spare and a penchant for exciting action titles            should give this a go - we look forward to the inevitable sequel."}