{"ref": "https://www.eurogamer.net/the-signal-from-tolva", "date": "10 Apr 2017", "game_name": "The Signal From Tölva", "text": "The Signal from Tölva is an open-world wasteland game of unusual profundity, its trash activating a set of cultural reference points that extend far beyond Mad Max-bred cliché. Sculpted by former Aardman Animations artist Olly Skillman-Wilson from concept pieces created by ex-Rockstar doodler Ian McQue, the game's titular planet is a wilderness of crash-landed starships and war machines, picked over by robot factions lured to the surface by a persistent, inexplicable whispering in the aether. Rendered using a desiccated industrial palette that is lent further texture by sporadic visual artefacts and interference, it's a superbly allusive stew - an arid yet evocative snapshot of a sci-fi universe dreamt up by lead designer Jim Rossignol and writer Cassandra Khaw. (Disclaimer: Jim is a founder of our sister site Rock, Paper, Shotgun and a former Eurogamer contributor, and Cassandra is a current contributor to the site.)At times the game taps into a mythic register, with enormous ~Architect~ and ~Librarian~ exoskeletons sprawling in death like the titans of Greek legend, their eye sockets and nostril passages rimmed with flaking paint. You'll come across chunks of synthetic vertebrae, stripped of circuitry, that recall the bones of dinosaurs; were it possible to dig beneath the soil, I imagine you'd discover vast, precision-engineered fossils. At other times, the game's landscape feels like a nod to 21st-century aircraft ~boneyards~ such as Arizona's Davis-Monthan Air Force Base, whose tenants include Cold War stealth bombers and outmoded Predator drones, or the scrapheap of Rassohka, where irradiated helicopters used during the Chernobyl 1986 nuclear disaster lie piecemeal and poisonous, tempting the hands of souvenir hunters. Tölva has its share of radioactive hotspots, their edges marked by flaring red striplights, though the quest here isn't for isotope-ridden mantelpiece trophies but for caches of information about the planet's origins: gristly half-revelations which pay into a wider examination of the nature of consciousness itself.Like any graveyard, Tölva has ghosts aplenty - in this case, the cybernetic kind. It casts you as an anonymous hustler with a faster-than-light hook-up, exploring the planet from afar by hacking into the brains of Surveyors - one of three robot factions battling for control of the surface. Surveyors are automatically constructed at allied bases, clumps of pale concrete that pre-date the game's events, or discovered at friendly radio beacons, and you can jump between them without penalty from the game's map screen. It's a way of justifying the concept of infinite respawns that is neatly, and nastily, entwined with the story's philosophical preoccupations - each Surveyor has a prominently displayed unique ID, and it's suggested that they are self-aware, but the fact that there's an endless supply encourages you to treat them as cannon fodder. By the end of the game, I had appropriated and discarded dozens of the poor creatures, burning through them like a dopamine junkie burning through rounds of Candy Crush Saga.Another incentive to be callous is the game's almost aggressively repetitive campaign structure, which sees you wresting bases and beacons from the pincers of Bandit and Zealot drones in order to reach and scan the sources of Tölva's mysterious transmission. Along the way, you'll also chase off the occasional scripted ambush in return for a permanent health regeneration boost, and gather scrap to spend on more powerful guns, beefier shielding and various area-of-effect abilities such as a fiery shockwave or an EMP blast that sabotages aiming protocols. You can mark targets on your HUD using your robot's zoom function, and recruit nearby Surveyors as followers care of an unlockable hacker pistol with a handicam-esque fold-out screen, ordering them about as a group by pointing and clicking. In theory, each robot faction is an autonomous entity, contesting bases and patrolling regions as the campaign wears on, but save for the odd spontaneous three-way firefight and a couple of notifications that a base had changed hands, this didn't make much impression on me during my playthrough. More compelling are Tölva's handful of underground bunker puzzles, each made up of deceptively snaking passages that feel like odes to the more eldritch breed of shooter mod, such as Action Half-Life's legendary 5am map. There are wodges of scrap to discover in their crevices, plus a few additional morsels of insight about the wider universe, but the appeal of these spaces is chiefly that you're trusted to master their key workings without explicit assistance.If these conundrums can be gripping, the action above ground is dealt with a lack of flourish that occasionally feels calculated, and occasionally like a reflection of the developer's relatively modest resources. Its principle virtue, either way, is that it encourages you to attend to nuances that video games typically bury. Where most open worlds throw distractions at you, fearful of losing your interest, Big Robot is content to let you trudge around uninterrupted, slowly losing yourself in the art and the heavy, plasticky rap of your drone's feet on rock. The game's audio is as delicately worked as its visual aesthetic, from the Alien-esque tweet and clatter of scanner read-outs, through the deep bass notes you'll hear inside certain fallen mechanisms, to the seeping, surging electronica of its score. If the game's spartan, downbeat design can be considered a strength, the strong element of grinding is harder to forgive. The gunplay keeps things lively at first - the game's beam and projectile weapons are nicely hefty lumps of sci-fi clobber, all looping wires and ribbed barrels, and there's a certain art to timing your overshield activation when the odds are against you. Which area-of-effect ability you bring to the fray also has a marked effect on strategy - amateur generals should roll with a healing aura, while craven sorts like myself may prefer the 360-degree hack attack that causes everybody to run away. But the battles don't really evolve in the course of the game, for all the incremental upgrades, and clearing bases becomes tedious, particularly once you're forced to scour previous regions for resources in order to unlock the means to overpower higher-level drones. You don't have to flip outposts - there's no percentage completion requirement - but finding your way past them involves legwork and no small amount of luck, with AI awareness range a little too hard to gauge.I'm tempted to blame The Signal from Tölva's less tractable elements in part on the fantasy of an alien world - a world that isn't merely unsympathetic to your presence but uninterested, regarding you as simply another piece of flotsam washed up on its shores, caught in machinations you haven't a hope of entirely comprehending. Where the likes of Mass Effect: Andromeda neither invites much curiosity nor rewards it, this is a landscape that must be worked at, a landscape that deserves study. If you come to it direct from a more comfortable breed of open world, the game's core components may feel as though they're operating at cross-purposes, the leaden process of base capture and scrap collection bogging down an otherwise fascinating exercise in virtual archaeology. For those who are willing to take their time, however, circling and probing each portentous piece of wreckage, Tölva is a place that will haunt you like few others."}