{"ref": "https://www.eurogamer.net/r-daytona2001-dc", "date": "19 Apr 2001", "game_name": "Daytona USA 2001", "text": "Any racing game, however esteemed its lineage, is going to have a            tough time breaking onto the Dreamcast. The genre is stiff with            competition from the likes of Metropolis Street Racer and F355            Challenge, leaving little room for intrusion. However Daytona USA            2001 managed it, we'll never know.                         Although I had my doubts about Sega's supposedly seminal arcade            racer coming to Dreamcast, I've been reassured by the sheer number            of things on offer. For instance, the game has eight tracks right            from the start, including the three original arcade tracks, two            tracks from Daytona CCE on the ill-fated Saturn, and three totally            original tracks. As with the original, these can be played as you            like - straight up, reverse, mirror, mirror reverse - with season,            Single Race, Time Attack and two player VS Battle modes. What's            more, every race can be saved to your VMU for analysis or            showboating later on.                         One of the biggest changes for Daytona USA 2001 is its online            play, although it does suffer due to poor guestimation on the            Dreamcast's part. Using something approaching Quake's pushlatency            variable, it predicts where your opponent is driving if the            connection is too slow to give exact data in time. However, by its            very nature Daytona is unpredictable, and the game gets it wrong            more often than not. In a way this removes a lot of the excitement            from proceedings - most of the fun in Daytona is cool, calculated            overtaking manoeuvres through oversteer into corners, something            rendered almost impossible by the positional inconsistencies.            Thankfully the framerate remains constant, as with the rest of the            game, and the graphics likewise, but the niggling latency issue            mars an otherwise excellent attempt to introduce an online racing            mode.                    The increase in framerate is nice, and the lack of pop-up is,            although we took it somewhat for granted, a relief. Reflective            effects have been added all over the shop to stress the Dreamcast's            PowerVR-based graphics chip, and even though you suffer a minor            drop in detail for split-screen two player, things still look            marvellous. It's not just your car that's detailed either; even            with four of the blighters blazing into a corner in your right wing            mirror, the level of detail is stunning, with virtually no slowdown            evident.                         The graphics are one thing though, but the gameplay is where it's            at. It's good news then, that Daytona delivers fast-paced, exciting            action that makes NASCAR look like driving school, taking real life            race tactics and physics into account. Drafting, for example - the            technique whereby a driver hovers in another's slipstream to become            more aerodynamic and manoeuvrable. Nevertheless, the game relies on            the unrealistic to provide a lot of its stimulation. There's            definitely something to be said for power sliding at 100mph into a            corner and exiting at 110, although diehard simulation fans will            rightfully spit on it. Then again this isn't really for them now,            is it?                         As a remake, the controls could have been tweaked a little to            prevent the delicacy of the analogue stick causing such violent            pileups, but this can actually be tweaked in the options menu, so            there is little to complain about here either.                    Daytona USA 2001 is a very enjoyable game, but what it really needs            is for Sega's online programmers to take on the server side of            things with a heavy hand, and try and eliminate some of the lag.            Nothing has changed since the American release over a month ago            unfortunately, and the teleporting cars issue is infuriating to the            point of distraction. The rest of the game just about makes up for            it, but Daytona USA 2001 was originally dubbed Network Edition, and            I wanted it for the online play more than anything. Perhaps it's on            account of the problems that this moniker was dropped - it's            certainly prevented me from recommending Daytona to any higher            degree.                         While I'm on the warpath, I might as well focus your attention on            the sound effects. Now, I like the sound effects for the most part,            but that damned menu sound is so repetitive and draining that I            really have to give it a sentence all of its own. This single sound            effect tarnishes an otherwise excellent menu system. Would you even            think that possible? It's absurd.                         Ultimately, Daytona looks thoroughly presentable, features some            stunning graphics and plays like a dream. The sporadic issues with            network play, though, are enough to make me think twice about            recommending it. There's a lot to unlock and fiddle with through            the single player options, and yes it's possible to play            split-screen two player anyway, but the network play options,            however evolutionary, are too frustrating in their current form."}