{"ref": "https://www.eurogamer.net/r-stuntgp", "date": "17 Apr 2001", "game_name": "Stunt GP", "text": "Stunt GP is very close to excellent, crossing the lure of remote            control cars with the brutal gameplay and addictiveness of a Team            17 title. For all its charm though, it's not without flaws. It's            easy enough to become proficient at race-winning, but pulling off            the necessary stunts along the way can force things beyond the            wrong side of easy.                         One thing we cannot possibly fault here is the visuals. Clean and            crisp, every inch of the track is pleasantly textured, and each car            shiny and well modelled. There are three different types: Wild            Wheels, Speed-demons and Aeroblasters, with 16 models in total.            Each is especially capable in one particular area, as the names            suggest. For instance, the Aeroblasters can perform some almighty            tricks in mid-air, but the Speed-demons are more at home on the            ground.                         There are 24 brilliantly designed tracks on offer. They start of            easy, with simple figure-of-eight routines, and become increasingly            complex, with loop the loops, transparent pit stop flyovers and            sloping corners. It's some of the most original track work I've            seen in any racer, let alone an R/C one for a long time.                         Points are obviously awarded for position at the outcome of the            race, but inter-race upgrades, which rapidly become a necessity,            are actually purchased with ~Aeromiles~, won by performing jumps            and tricks during the race. Aeromiles are important, but so is            winning the race, and it's creating equilibrium between the two            that's difficult.                         The tricks you can perform are somewhat limited, but ones that            accrue the most points like the Barrel Roll will take you a            considerable amount of time to perfect. Pulling out off-the-cuff            manoeuvres in the thick of a race will do you fine, and ultimately            you need to place highly above all else, so you have to act            sensibly and maintain momentum.                    One of the most annoying things about Stunt GP is unfortunately how            often you go off the track. Confining you to a certain amount of            space would be daft considering the aerial acrobats you are            expected to perform, but understeering into any corner at all will            send you into the bush, usually dropping you to the back of the            already tight field. Walking the stunt-rope so to speak is one of            your primary objectives, and putting the entire performance in            jeopardy should be a consideration when going for a big            jump, but the ease with which you come unstuck is still annoying.                         The field of six is rather despairing too, and the spread is            negligible, presumably to maintain the idea that you're in the            thick of the action. The AI isn't as daring as you have to be at            times, either, which can be maddening, and put you far, far off            behind the pack.                         The multiplayer options can really help to make up for all of            this, however. If you can get four players around a computer using            every available extremity for control, you will have a rip-roaring            time. Although it's nothing to rival the likes of Mario Kart, your            friends are likely to make more exciting competition than the            computer.                         If you get bored of juggling the racing variable, you can all but            strip it out in the stunt arena mode, which would be perfect were            it not for the crippling inclusion of a 90 second time limit.                    Stunt GP is so close to brilliance. It boasts a plush interface,            excellent track design, exciting multiplayer and a lot of nice            ideas, but things like the time limit in stunt mode, and the            difficulty level of the single player game keep it from attaining            classic status. And call me a cynic, but even though it separated            the tricks from the racing, I thought last year's Re-Volt did the            R/C thing with a touch more aplomb."}