{"ref": "https://www.eurogamer.net/r-summoner-ps2", "date": "5 Apr 2001", "game_name": "Summoner", "text": "Hype. I hate the word, but unfortunately there is no other way to            explain the fanfare surrounding the release of Summoner, because            good though it is, it can never escape the carniverous attentions            of the press.                         If you were expecting a typical console RPG, think again. Summoner            is a major departure, heavy laden with text and a deep, evolving            storyline. The game centres on a young lad called Joseph, who has            the power to summon ethereal demons to do his bidding.            Unfortunately he's denied himself the powers for a long time,            because as a child, while inexperienced, he accidentally            slaughtered his entire hometown. Which needless to say didn't go            down too well.                         The game is filled with bizarre plot twists surrounding the            progress of young Joseph and his three companions. The levels            system that controls your troupe's powers is one of the game's            strong points. You get to choose which of the character's skills is            improved as a result of your experience, and since only certain            characters can wield certain weapons and special abilities, it's            essential to afford each of them equal priority.                         The battle system borrows heavily from last year's Squaresoft            PlayStation smash hit Vagrant Story, using real-time and turn-based            combat allowing you to perform Chain Attacks by pulling your weapon            in various directions with the D-Pad as you strike. There is a            complex magical association between all living creatures, weapons            and such that becomes a key factor in how much damage your attacks            can do, as well. Think of it as Summoner's version of The Force.                    Obviously the game picks up once Joseph drops his vow and starts            summoning again. The beats Joseph pulls out of the ether are            monstrous allies in combat - you can opt to use them in battles as            a token fifth character, but the obedience of these creatures            depends on Joseph. In other words, if he gets knocked out the big            beast might reconsider who it's attacking.                         Visually Summoner is a work of art thanks to Volition's            implementation of full-scene anti-aliasing. After problems with the            technology last year many were sceptical of the developer's ability            to make Summoner live up to its billing, but whatever they've done            it looks spectacular with a smooth, unblemished 30 frames per            second and no discernible jagged edging.                         I don't personally think that Summoner is the most visually            impressive game on the PlayStation 2, but the quality of modelling,            environment and texturing is almost second to none throughout.            Thanks to the overly complicated graphical engine though, draw            distances are very disappointing. Characters also occasionally look            a bit blocky, although this has more to do with a lack of polygons            than a failure to apply anti-aliasing properly.                         Throughout the game, the only other engine or graphical issues we            encountered were the mildly depressing load times when entering a            new town or city, and occasional problems with clipping, where text            bubbles go through walls and the like. When in full flow though, we            had no concerns about framerate drops and the like, which appeared            minimal. By all accounts, this is a pretty decent PAL translation.                    Like most console RPGs one of Summoner's most devoted aspects is            its musical score. During the intense cinematic cut scenes it is a            roaring success, and supplements the game's style and execution            perfectly. The battle themes are top, and things are very            atmospheric thanks to the soundtrack.                         Character speech is also used during cut scenes, and the game            boasts some intelligent voice acting. The script-writing isn't            atrocious either, which is a good thing due to the large amounts of            text used, that's for sure.                         It's unsurprising that Volition chose not to voiceover the entire            game, because there really would have been too many bit parts to            play and words to say in general. The major concern we had with the            game as a whole was that occasionally there did seem to be too much            to say and too many people to consult with.                         For instance, while it's very true that in an average town people            would have a lot more to say to a group of mystical strangers than            ~There's something spooky going on in this town - mark my words,~            or a similar RPGism - having to speak to so very many people at            length can become quite tedious and detrimental to the general            experience of playing Summoner. On several occasions I simply            forgot who I had and hadn't spoken to (particularly between saves)            and had to wade through reams of text again to figure out where I            was going.                    All right, so ultimately Summoner is an accomplished RPG, with more            text than most to delve into. I don't like spoiling the storyline            by giving away massive hints during my appraisals, but I will say            that I found it occasionally mesmerizing, and for the most part            very exciting. There have been a lot of excellent console RPGs in            the last year or so, and Summoner does enough of its own thing to            be worth buying independently. It's hardly a killer app with which            to sell the PlayStation 2, but it definitely has a knack.                         At about 30 hours from start to completion with plenty of            diversions along the way, it offers a lot more gameplay than some            other early PS2 titles, and probably about the right amount for the            average console gamer in general. Titles that stretch into the 50s            and 60s are often just too long and drawn out for most to consider            playing, but 30 is a reasonable effort.                         It's not really fair to bash Summoner too much for its various            shortcomings, because although they restrict it from living up to            the cast moulded for it by a year of hype, they aren't damaging            enough to force gamers away. Having completed Summoner, I feel much            the better for it, and I think you will too. With Onimusha due to            hit within the month though, you could be forgiven for letting            Summoner pass you by."}