{"ref": "https://www.eurogamer.net/r-feareffect2-psx", "date": "27 Mar 2001", "game_name": "Fear Effect 2: Retro Helix", "text": "The original Fear Effect was popular with the sort of people who            bought Phantasmagoria, if I remember correctly. To us it was just            an average 3D adventure with snappy dialogue but too much gore,            questionable visuals and irritating controls.                         The sequel feels very much the same, except this time it's a            distinctly average 3D adventure with too much gore, far too much            cartoon cleavage, and constant and irrevocable depravity, which            will stay with you until such time as you can find something more            disturbing. Fear Effect 2: Retro Helix is, in other words, more of            the same, but with increased quantities of the things we didn't            like.                         The game comes on four discs, yet takes only 10 hours or so to            finish thanks to all the FMV. Occasional bouts of anime-inspired            action make it vaguely serviceable, and the controls have been            tuned to a Resident Evil style, but it's still just a            slightly-above-average adventure game. That said, fans of the            original will have no trouble enjoying it, with all its silly            puzzles, blood, guts and cleavage.                         To call the Resident Evil control scheme an upgrade, the first            must have been pretty awful, right? Right. If you delve into the            Options menu and switch from Classic to 3D controls, it's more like            Metal Gear Solid, but hardly enough of an improvement to keep you            alive for long. Movement is, as before, dodgy, with characters            arcing round in circles and swivelling on the spot like scarecrows            in the wind.                    Dying is a regular occurrence, even though the auto-aim/turn works            fairly well. The camera, controls, enemies and general positioning            all conspire to bathe you in crimson. The best way to actually stay            alive is to move erratically with the use of rolls and jumps, but            even so the gameplay is of the move-a-bit, die,            avoid-trap-move-a-bit, die, repeat style. Knowing this full well,            Kronos positioned the save points more forgivingly throughout the            game, instead of, say, making the game less of a Pitfall-wannabe.                    Now, Doom may have been about finding the Red, Blue and Yellow            keys, but Fear Effect 2 is about finding keys in every shade of            Red, Blue, Yellow, Green, Magenta, Gold, Silver, Purple etc, and            then in every conceivable shape too. By the end of the first disc            it's not hard to work out how every single puzzle will be solved            for the rest of the game. Puzzle is a bit of a strong word for them            actually, if you had a crowbar and a blowtorch the game would take            20 minutes.                    As usual, it's a silly way to do things, but the game is still            quite compelling. That, however, is sure as hell not because of the            content of the game. To put it mildly, Fear Effect 2 is not one for            the kids. I actually refused to play it when younger people were in            the room - I genuinely think this sort of content does not deserve            an audience.                    Presenting violence and sex in a game is an art that requires            careful manipulation of the subject matter, whereas Fear Effect 2            is just a gross depiction of the obscene. There are hideous things            on these four discs, stuff I'm not prepared to put down on paper,            even if some of my peers at rival websites might be. Look at it            this way, it's not as if it's a survival horror game - but it will            horrify you because it's tasteless in the extreme. It's the sort of            thing that gives gamers a bad name.                         To the game's credit, it uses some clever graphical techniques            which actually make the humble PlayStation look quite advanced.            Using FMV backgrounds and realtime 3D characters means that the            quality of the visuals is entirely dictated by the developers. So            the mood of the game is set by the software, not the hardware.            Kronos' approach has yet to be pinched by anybody else, but that's            probably more to do with Fear Effect's lack of popularity amongst            those who, well, aren't lunatics.                         Although occasionally drab, as you can see from the screenshots on            these pages, the game looks very pretty for the most part. It looks            even sharper than its predecessor, but disappointingly there is now            a little blip where the FMV world resets itself every three seconds            or so.                    The character animation is about as good as it can be for the            scarecrow-on-crack control system, and the general aesthetic of the            women in particular has clearly been laboured over. At times the            transition between realtime and pre-rendered scenes featuring these            characters is fairly seamless, so full marks to Kronos on that            point.                         Compared to something like Martian Gothic, Fear Effect 2: Retro            Helix is a very presentable game. Rarely troubled by load times and            seamless in its transition between realtime and FMV, the game makes            up for some of its depravity by feeling like quite a complete            package. Something a lot of PlayStation games fail to do. The            soundtrack may be a bit drab, but the cheesy script is comfortably            delivered through excellent voice acting.                         Anyway, to actually rate Fear Effect 2, I suppose I should offer a            description and let you make up your own mind. The rating you see            at the bottom of this piece is my own personal opinion based on its            contents, and I think it's the rating which the majority of our            readers should base their next trip to the games store on.                    Fear Effect 2: Retro Helix, when all is said and done, is a game            that offers repetitive find-the-key puzzling, inexplicable deaths            and an onslaught of disturbing and occasionally sickening visuals.            It is a very well presented adventure, and its graphics when not            focusing on the obscene are quite passable. The control system and            camera positioning often conspire to upset your progress, but the            challenge is such that you will probably stick with it to the end.                         On a personal note, I think Eidos ought to go back to making Tomb            Raider games, at least they aren't quite this depraved."}