{"ref": "https://www.eurogamer.net/r-ufc-dc", "date": "1 Mar 2001", "game_name": "Reviews", "text": "Ultimate Fighting Championship is a bit different to most beat 'em            ups, in that it's actually based on a real life martial arts            tournament (if you can call it that). The game feels rather like            the original Tekken (which more or less marks it for success right            off the bat), and captures with startling realism the effect you            get when you tell two human beings to kick the %$#! out of one            another, with very few limitations.                         The game kicks off in grand style to a pounding Megadeth anthem            with a glitzy opening video, and gets better from there on in. The            visuals are, as I've said, extraordinarily detailed - the faces are            actually modelled on their real-life counterparts, and offer a            practically faultless replica. At the opening of each bout, the            fighters approach the ring in spectacular style, WWF-style to            standing ovations and musical rip-roaring in the background. The            crowd that cheers them on is one of the most impressive visual            aspects of the game too - you can clearly see the spectators'            faces, what they're doing, hear their jeering and yelling - it's            incredibly atmospheric.                         After the exciting walk to the octagon where the battle takes            place, the fighters measure up to one another, before embarking            upon a furious rampage that can last anywhere from a matter of            seconds to a quarter of an hour. The fighters' bodies glisten with            sweat as they thump one another repeatedly, and as the fights wear            on, they pant and look noticeably more haggard than they did at the            start. Bruises start to manifest themselves, and blood splatters            all over the shop as teeth come loose and lips split.                    I said the game played similarly to Tekken; well that was a lie,            it's nigh on identical at times. There are a lot of tweaks to make            it more realistic, and since this is real-life fighting we're            talking about, the emphasis is more on the up-close-and-personal,            with holds and grapples being the order of the day. The learning            curve is pretty insignificant too, and with a bit of            manual-juggling you can be up, running and capable of some vicious            butchery within a few minutes. Jumping into the thick of things is            quite simple in itself, but the game is by no means easy for it.            You will have to fight hard to win bouts, and as you play more and            more it becomes obvious just how deep the game actually is - it            could take months of play before you have mastered each of the            games 3000 or so moves and variations.                         That's part and parcel of UFC's attraction, though. Every fighter            - and I do mean every - offers something new in the way of            technique. You'll spot just about every move or martial arts trick            you've seen come out of Hollywood, with punches, kicks, throws,            leg-breakers, submission holds and far, far more than I could ever            list here.                         For a game that's so heavily reliant on speed and purity of            execution, a control system that matches both of those qualities is            important, and surprise, surprise, players of UFC have just such a            system at their behest. Every button has a function or two in            certain situations, and the combination moves look just as hard to            pull off on-screen as they do on your pad! Before long though you            will have taught your fingers how to pull off the most bizarre of            bone-crunchers that are available to you, and crunch bones you most            certainly will in the process. Did they invent a sure-fire cure to            RSI yet?                    Well it's the spice of life, isn't it? UFC certainly thinks so.            Aside from the aforementioned Single Match mode, there are training            options so that newbies can get a good grounding against dummies            and test themselves in exhibition matches. Of course there is a            basic ~UFC~ mode, as well as a ~Championship Road~ option so that            you can compete for prizes and secret extras. Oh, and breaking away            slightly from the whole realism effect, the big boss man at the end            of the road is a seven foot monster of a man decked out in Silver,            called Ultiman, no less! He caught me by surprise and no mistake -            I thought the rest of the field were tough to dispense with, but            Ultiman is on another level entirely.                         UFC also sports a fully featured ~Career~ mode that lets you            invent your own fighter and pit him against the perils of the            Ultimate Fighting Championship. You can give him his own fighting            style, his own counters, everything, even his own voice! Depending            on your progress elsewhere, more options for customisation will be            offered as well.                         Although pretty exhaustive, I was a bit upset that I couldn't            alter the size or colour of my fighter. I was hoping to create some            sort of Incredible Hulk look-alike, but it wasn't to be. All sorts            of challenges are available for your fighter though, and this            particular mode certainly adds a lot to the game, and occupied me            for the bulk of my time with it.                    Making up the rest of the game are the rocking soundtrack, which we            hinted at near the start of the review, and of course the            multiplayer modes. Playing against your friends in all sorts of            tournament configurations (mostly through hot-seating) is extremely            good fun, and far more exciting than versus modes have become in            the likes of Street Fighter.                         If your neighbourhood boasts a tight circle of Dreamcast playing            friends like mine does, you will be plucking bits of shattered            skull out of your teeth for weeks! The sheer quantity of fighting            styles and options means that two friends can develop completely            alternative fighting approaches and still win, whereas in other            games players learn in parallel.                         Ultimately, UFC is the best fighting game I've had the pleasure of            playing this year, and yes, I do denounce titles like the            exceptional Street Fighter Alpha 3 and Dead or Alive 2 to make that            statement. It's often difficult to find reasons to recommend yet            another fighting title, but UFC is so different to anything else on            the market that it's not funny.                    Better than the original Tekken, more entertaining than the shelves            of fantasy fighters out there and a darn sight more approachable to            boot. Everything you could want in a fighting game on the            Dreamcast."}