{"ref": "https://www.eurogamer.net/r-oni", "date": "8 Feb 2001", "game_name": "Reviews", "text": "Oni is a peculiar one. It's driven by a powerful leading lady, it            has bags of class and it infuses Anime art into an action            adventure. Unfortunately though, Konoko is treading on uneven            ground. Her dashing good looks, human proportions and martial arts            supremacy aren't enough to carry Oni the whole way, and it seems            like the initial prognosis we made at ECTS last year was correct -            Oni is more underwhelming than it should be.                         The story is pretty average Anime fair too - Konoko is an agent            for the Tech Crimes Task Force and is up against pseudo-cyberpunk            Mafioso types, who frame her for a crime she did not commit, neatly            setting the whole world against her instead of just the Japanese            Mafia. Ouch.                         The word ~Oni~ itself means ~ghost~ or ~spectre~ and that's a fair            indication of how the game treats young Konoko, and how she has to            act if she wants to survive. Despite the spooky premise though (pun            intended), the already weak plot develops in ways that 10-year-old            children find clichéd when watching cartoons at 9am on a            Saturday morning, and it's flanked by animated cutscenes which vary            in quality.                         However most of the details of Konoko's plight are related to the            player via pop-ups at computer terminals, and in-game dialogue            sections. The scripted sequences are well set out, but despite the            dubbed voice-overs the characters' mouths remain stock and still.            Oh, and as for the voice acting; I hope someone, someday recognises            that nobody in the real world talks like this and sorts it            out. If this sort of tripe appears in the sequel God help            them, I'll go on a rampage. They could at least have put in            Japanese voices with subtitles - that would at least have created            some sort of likeable cultural crossfire.                    So the game has a rather feeble storyline to back it up - what            really makes the game enjoyable is the action sequences. From a            third person view, you control Konoko as she darts all over the            shop, legs and arms flailing as you hammer the controls and enemies            remain where they fall. The control system is fine mapped to either            keyboard or gamepad, which will be a relief to those handling the            PlayStation 2 version no doubt, and makes execution of Konoko's            arsenal of kicks and punches easy as pie.                         She is also capable of energy draining combination moves, where            she uses deadly kicks, punches, thrusts, flips and such; chained            together to exact maximum damage upon incoming hostiles. The            martial arts aren't exactly Jackie Chan, but the ~mainstreaming~            steps Bungie have taken are more to do with playability than the            abandonment of authenticity.                         Konoko isn't inhibited by her use of the martial arts either. If            those attacking her decide to try and use ranged and projectile            devices, once the fellows are dispatched she can quite happily pick            up their former weapons and put them to use against more of the            same. Konoko can only carry one weapon and the ammunition is pretty            limited, but those available offer a decent mix. Pistols, shotguns,            and bizarre laser-style weapons are collectable, and once you are            out of ammo the weapon doubles up as a useful object with which to            dash people's brains out. The sequence where I first realised the            implications of this advanced capability was hilarious. I first            shot a couple of guards, then in a last gasp attempt to take them            with me, I legged it up to them, jumped into the air and expecting            to clatter down in front of them, found myself clubbing their heads            in mid-air with the butt of my pistol. Marvellous!                    All this sparring and general mayhem brings me smartly to the            subject of challenge. Oni definitely has its moments, as four or            more opponents close in on your position, making effective use of            your arsenal imperative. The third person view helps you keep track            of all your attackers thanks to the extra peripheral vision, but            it's still very tooth and claw at times.                         Oni also boasts something of a first brainy henchmen. Unlike the            mobsters you may have seen in Hollywood, these guys possess their            own distinct fighting styles and tactical AI. They don't adapt            particularly well when you are swinging round a bloke's neck to            kick an approaching villain in the jaw, but on the whole they offer            varied opposition and rarely become a chore to dispatch - enough to            necessitate replaying of the middle and later stages of the game            plenty of times. There's certainly no harm in this, and the            console-style repetition is nothing Quake fans haven't been doing            for years.                         Replaying is definitely something of a necessity though, because            the gaps between saves in Oni are fundamentally too large. The            difficulty level fluctuates at times thanks to this, because            despite falling to desperately low levels of health, you may still            be some way from the next checkpoint. Frustrating.                    As for the length of the game as a whole, it's long enough, made up            of some 15 stages, each hosting several sub-objectives. The levels            are very large at times too, but not always terribly well designed,            with some rather shoddy texture work in areas. Japanese minimalism            may be popular, but untextured areas don't really achieve this! On            the whole though the graphics, while at times slumping a touch, do            maintain a reasonable level of consistency throughout. At times it            feels like you're a rat in a maze rather than a sophisticated            law-enforcement agent in a technically advanced nerve centre            though.                         The other side of the coin is the technical aspects of the game.            Control is simple and adjustable, but mouse sensitivity is not, and            feels far too sluggish. There is a distinct lack of options for the            PC gamer - the option of a higher-resolution texture set would have            been nice, for example. Although with the clipping the way it is            right now, I doubt that would have helped much. The absence of            multiplayer modes is rather ominous, too.                    On the whole, Oni is a mixed bag. It's very playable, with quite a            nice engine and a strong leading lady, but the storyline is a touch            frail, the game is severely limited by its lack of multiplayer and            the long gaps between save points make certain sections almost too            challenging.                         Hopefully Bungie will have a better idea of what they want to do            next time, and will be in a position to build on Konoko's strengths            instead of relying on them. Oni in its current state hits just a            bit wide of the target."}