{"ref": "https://www.eurogamer.net/r-prorally2001", "date": "16 Jan 2001", "game_name": "Reviews", "text": "One of Pro Rally 2001's biggest selling points is that it is at the            pinnacle of realism. Having watched the game in early form at ECTS            last year, we thought they might actually have a point, but having            played the thing we now firmly contest their claims. Ho-hum.                         The whole game is basically an exercise in tedium. Everything is            vaguely acceptable and very little stands out. For starters, the            Driving School that sets out to teach you how to play. It's a poor            copy of the same thing from Gran Turismo, and despite the years'            gap in between, it's much less fun. The tasks set are far too            difficult, with very little leeway. Hitting the time limits dead on            is about as close to overcoming them as you get. Not content with            that, if you take even the tiniest nick of damage you fail, despite            the fact that there is no mention of this in the manual or within            the game.                         When you eventually fail, there's no incentive to start again, and            thanks to the stodgy interface it isn't exactly an intuitive            process anyway. Several menus have to drone past before you can get            back into the action. It actually takes less effort to quit            the game and uninstall it than to get back into the action. Um.                    Even when the Driving School is behind you (you really won't miss            it), things don't get much better. As you will have learnt, the            handling and turning of the cars don't really fit the bill either.            Your ability to turn seems to depend on the direction the wind is            blowing that day, often proving easier when you are shifting gear.            If you launch yourself into a corner, despite your co-driver's            warning of its size and your pre-selection of gear, getting round            it is another matter entirely. The game seems permanently set on            shunting you offroad.                         Turning at high speeds under throttle is more or less impossible            (perhaps as a simulation of understeer at high speeds), but if you            coast along at high speeds you can turn on a sixpence. Hardly            realistic. The roads are incredibly narrow too, so on the average            hairpin (of which there is usually at least one per track), you are            very likely to come a cropper.                         The handling of the vehicle itself is tough to get the hang of            also. If you drift even marginally offroad at a slight turn, you            usually stop dead due to the incredibly unforgiving scenic            obstacles. Walls frequently have little snags embedded in them to            help stop you dead too, and don't catch your wing mirrors! That'll            bring you to a halt as well.                         The most depressing aspect of the turning problem is that you can            actually overcome it somewhat by opting for the overhead view. This            renders the game a poor Micro Machines V3 clone, but it's the only            reasonable way to repeatedly get round tight bends, and admittedly            the only way I passed Driving School.                    Another point to count against the game is the way its levels are            structured. Your co-driver points out every corner as you arrive at            it, and if you look closely, you discover that every corner neatly            fits one of his categories, be it easy, hard or in between. He also            mentions hairpins a few times a stage to boot. The good thing about            this from your perspective is that if he says it's an ~easy~ turn,            you know that it's about 15 degrees, and if it's a hard            turn, it's a right-angle. There is little or no variation. The sad            thing is of course that such uniformity is about as realistic as            Sun in February around here. Colin McRae is probably quaking in his            boots.                         The track design itself is tight and often unforgiving, but on the            whole fairly varied. The different surfaces of course make no            difference - be it stone or snow, you'll still take each corner as            it comes and in precisely the same manner. The huge selection of            cars available make no difference at all, they all handle in the            same way with minor discrepancies. Those are likely just bugs            anyway, and hardly noticeable when you're bouncing from side to            side of a supposedly crumbly stone bridge.                    As for the rest of the game, there is very little worthy of mention            in the positive category. I wouldn't call the graphics or sound            effects bad, just nothing new. I suppose the repetitive whine of            your engine sounds rather tinny, but when a game is this mundane            nit-picking isn't going to help anyone.                         The biggest problem from my perspective is that I have played more            or less every Rally game released this Winter, and everything else            does what Pro Rally 2001 does, only better. The handling in Colin            McRae 2.0 is much more impressive, the track design in Screamer 4x4            is a cut above this and even 4x4 Evolution can boast some more            interesting vehicles and track motifs. PR2K1's biggest problem is            that not only is it less than a sum of its parts, it's frustrating            as well.                         I mean, I've played it for long hours and tried hard to enjoy it,            but whenever I quit the game, I feel better for it! The bad            handling, lack of realism, awfully unfair Driving School system and            most of the other aspects just meld together into something I would            rather not be playing in my spare time. Two-player split-screen            consists of two huddled gamers hammering the keyboard in a vain            attempt to accelerate after hitting yet another concealed brick and            stopping dead. Madness.                    So in conclusion, what is there to commend about Pro Rally 2001?            Very little indeed is the unfortunate answer. The different            Championship modes are all roughly the same, the teaching element            is frustrating and badly planned, the handling and road-manners of            the cars are dreadful, and there are plenty of others games            available which do more of the same, only better. A shame, because            it looked good last year."}