{"ref": "https://www.eurogamer.net/dvd-insider", "date": "14 Jan 2001", "game_name": "Reviews", "text": "- Michael Mann            Producer - Michael Mann / Pieter Jan Brugge            Starring -                          Al Pacino                          Russell Crowe                          Christopher Plummer            Filmed - America, 1999            DVD by - Touchstone Home Video                    Ever year smoking kills around 120,000 people in the UK alone,            while those who survive spend £12 billion on cigarettes. And            yet until recently tobacco companies continued to deny the mounting            evidence that smoking was a lethal and addictive habit.                    That front of denial came crashing down when industry insider            Jeffrey Wigand revealed that the company he had worked for not only            knew that nicotine was addictive, but that they manipulated            chemicals present in cigarettes to make it more effective - ~we are            in the nicotine delivery business~. The admission helped to bring            about a mammoth court case which ended with tobacco companies            paying American state governments $246 billion to cover health care            costs for diseases caused by their products.                    It might seem a strange choice of topic for a big Hollywood film,            especially coming from writer / director Michael Mann, who is            better known for such gems as cult horror movie ~The Keep~ and            stunning criminal drama ~Heat~. But in a year of great movies ~The            Insider~ turned out to be one of the greatest, with            man-of-the-moment Russell Crowe (~Gladiator~, ~LA Confidential~)            earning a well-deserved Oscar nomination for his restrained but            powerful performance as Dr Wigand. Meanwhile Al Pacino launched            himself into the role of maverick ~60 Minutes~ producer Lowell            Bergman, the man who broke the story and encouraged Wigand to            testify against his former employers.                    The result is a moving dramatization of one man's struggle against            big business and the American legal system, with the tobacco            industry going to extraordinary lengths to discredit Wigand and            prevent him from telling his story to either the courts or CBS            News.                    At two and a half hours long it's something of a sprawling epic,            and there is little real action, just hour after hour of dialogue.            But after a rather slow start the film soon works up an impressive            head of steam, and the story will keep you gripped and surprised            right to the end. What makes it so involving is that Jeffrey Wigand            is an ordinary man under incredible stress, his family            disintegrating around him as he struggles to maintain his sanity in            the face of death threats, smear campaigns and legal injunctions.                    The film is also an eye-opening look into the mirky world of big            business and mass media, from the callous way in which the tobacco            companies manipulate their customers to the ethical dilemma which            the CBS team faces as Wigand's former employers threaten            potentially crippling legal action if they air the interview with            him. Which makes for a rather depressing indictment of the way in            which government, industry, the media and the legal system interact            in America...                    Michael Mann has gained something of a reputation over the last            decade from movies like ~Heat~ and ~Last Of The Mohicans~, and it's            a well deserved one. He has an excellent eye for detail and puts it            to great use in The Insider, with a mixture of long lingering            close-ups and intimate hand-held camera shots adding to the drama            and tension.                    There are some truly stunning sequences, most notably the scene in            which Wigand sits in silence as a mural on the wall of his hotel            room morphs seemlessly into a vision of his children playing in the            garden of his old home. Meanwhile looking out of the window he can            see the offices of the company that he used to work for, the only            lights in the building shining from the tenth floor, home of the            legal department which has turned his life upside down and            seperated him from his family.                    The icing on the cake is a haunting score from a team which            includes Graeme Revell (~The Crow~) and Lisa Gerrard (~Gladiator~).            The superb soundtrack also features Massive Attack's classic ~Safe            From Harm~, and the sinister ~Armenia~ from German industrial band            Einsturzende Neubauten, a song which also appeared in Heat and is            again used to great effect by Michael Mann and friends.                    The British Region 2 DVD is a high quality if rather spartan            affair. The film itself is presented in the original cinematic            2.35:1 aspect ratio, with near faultless sound and visual quality.                    Also included is a seven minute featurette including clips from the            film and a few behind the scenes shots. Probably the most            interesting part of this featurette though are brief interviews            with not only the cast and crew of the film, but also the real            people behind the story. Participants include Jeffrey Wigand,            Lowell Bergman, and even members of the Mississippi legal team            which heard Wigand's testimony against the tobacco companies. It's            a nice touch and reminds you that this is based on a true story.                    Sadly there is nothing else on offer though, not even a trailer.            All too many European distributors still seem to be labouring under            the misapprehension that interactive menus, scene access and            subtitles somehow class as ~special features~. No they don't. These            are standard features which every DVD should have. As far as it            goes then this is a great disc of a great movie, but it's something            of a disappointment that there is so little there beyond the film            itself.            Film - 9/10            Disc - 7/10            Availability -                            Amazon UK - £14.99                                    Amazon UK - £14.99                                    DVD Street - £18.99                                    DVD Street - £18.99                                    DVD World - £17.99                                    DVD World - £17.99                Note - All information is correct at time of writing, but            prices and availability may change. If you find any broken links or            other problems, please let            us know."}