{"ref": "https://www.eurogamer.net/r-arcadia-dc", "date": "9 Jan 2001", "game_name": "Reviews", "text": "Skies of Arcadia is, in many ways, something of a landmark title:            the first Dreamcast RPG to really shine and show what the            next-generation formats are capable of. Whilst titles like Soul            Calibur long ago relegated the Playstation to the bin as a            beat-em-up platform for discerning players, until very recently the            best RPGs were almost exclusively found on Sony's old grey box.                         Skies of Arcadia is set in a somewhat unique, Laputa-inspired            world, in which there is no ~solid ground~, only islands (some            larger than others) which float in the endless sky. This world is,            unusually, orbited by no less that five (arguably six) moons, each            of which takes the place of an element in the world of Arcadia,            conferring certain powers. Two of the three central characters are            air pirates, or, more specifically, ~Blue Rogues~ - the flying            equivalent of Robin Hood. These two, Vyse and Aika, are thrown into            a struggle to locate five crystals that control giant war machines            that could destroy the world by the arrival of the third - Fina, a            mysterious girl on a mission to prevent the coming destruction.                         Both the world and the characters are extremely well-defined, and            deep. By keeping the number of playable characters small the game            is able to devote a lot of time to their personalities, really            bringing them to life. This task is made easier by the graphics,            which are extremely detailed, and allow the characters to show a            wide range of expressions and emotions during cutscenes. The world            is also commendably large, and in a twist facilitated by the            setting, remarkably three-dimensional; you must frequently go both            over and under obstacles to progress. The skies are not in the            least bit empty, either, there are natural hazards such as floating            rocks(!) and vortices, as well as a myriad of other ships,            including traders, other pirates and suchlike.                    The world is so lovingly rendered that it is hard to resist the            urge to simply explore, and through some sort of devine intuition            the developers have anticipated this. All around the world are a            large number of ~discoveries~ - relics, creatures and suchlike            which can be located through cryptic clues or simply blind luck.            Some of these are critical to the plot, but most are simply there            waiting to be found. Once you have found one, you can then go and            sell the information on its location at the local Sailor's Guide            for a (potentially hefty) sum of cash - not to mention the fame you            gain for doing so…                         This is not as pointless as it sounds, as another neat idea            incorporated into the game is your ~swashbuckler~ ranking. This            goes up when you do ~heroic~ things, or make the right choices in            conversations, and goes down when you run away from fights or make            mistakes. This rating in turn affects how people will react to you,            and your ~title~. There's nothing quite like the ego-boost you get            from having a shopkeeper say ~Oh my! It's Vyse the Daring! It is an            honour to have you in my humble shop!~ rather than the more usual            4am petrol-station attendant attitude you get in most games.                         The graphics in Skies of Arcadia are nothing short of spectacular.            There is no FMV in the game, and all of the cutscenes are rendered            in real-time. This adds immeasurably to the sense of continuity in            the game, as the characters and environments look exactly the same            all the way through. It is also used to good effect in other areas            - for example, you can choose a logo for your ship later in the            game, and this is visible in all the cutscenes. In battles the            camera zooms around the combat area, and whilst wandering around it            assumes a rotatable Xenogears/Grandia-style angled view (a            first-person view can be selected for looking around). In fact, the            only gripes I have with the graphics are that the camera can be too            energetic at times. In some battles (particularly ship battles) it            swoops about so much that it can get confusing… not to            mention motion-sickness inducing!                    The sound is, unfortunately, an area where Skies of Arcadia does            not score quite so highly. The music is very good, and in places            excellent, but it never quite reaches the uniform brilliance of            games like Xenogears, Grandia or Chrono Cross. That said, however,            this is really a case of nit-picking - there is so little else to            criticise about this game that even very slight flaws need            mentioning. The sound effects are equally good, although somewhat            sparse in places. There is also some speech in the game; mainly for            special-attacks in battles, and the occasional word or two when the            characters get emotional. It is somewhat hard to judge the acting            quality when the characters have about 10 lines each in the entire            game, but it certainly never gets noticeably bad (with the possible            exception of the badly edited together samples on the ~Prophecy~            attack, but again I have been reduced to nit-picking).                         Any RPG lives or dies on two things - Combat and Plot. The combat            system in Skies of Arcadia is pretty generic; it is a strictly            turn-based system, with character initiative (or ~quick~ as the            game calls it) determining the order of moves within the turn.            Character can attack, use items or spells, and perform special            moves each turn. Spells and special moves use up ~Spirit Points~,            which are held in a party-wide pool, and are replenished by a            certain amount each turn (this can be increased by using the            ~focus~ command). This does add a certain twist to the available            strategies - often a good policy is to get physically weaker party            members to heal and boost the SP gauge so that your attacking            characters can do repeated specials.                         Taking the place of the normal fire/earth/wind/water element in            Skies of Arcadia is a more complex system based on the colours of            the five moons. Once moonstones of the appropriate colour are in            your possession, you may switch the colour of your weapons at any            point during battle, which in turn affects how much damage you do            to the enemy. This system certainly forces you to think carefully            about tactics in battle, although it can get somewhat annoying as            the rules for the colours are somewhat arbitrary - I found that            even after 45 hours of play I still had to keep the manual open in            front of me to tell which colours were effective against which            others.                    As well as the normal character battles, Skies of Arcadia also            features battles between airships. These work along roughly the            same lines as the normal battles, except that ship weapons are            used, and orders must be given in groups of four (one per party            member). Ship battles are in ways much more tactical, as it is            necessary to plan ahead and work out what the enemy will do in the            next set of moves. The variety of weapons available (some of which            have interesting effects like being able to fire over the course of            several turns) adds to this, although on the whole ships battles            are actually less interesting than normal ones, for two reasons;            firstly, they are too slow, with each turn taking up to 10 seconds            to complete (mainly due to long panning animations of the ships            circling each other), and secondly, once you get access to the            cheap ~complete kits~ which will fully repair your ship, the only            way you can lose a battle is through misjudging the moment when an            enemy will make a major strike.                         Another minor flaw Skies of Arcadia suffers from is that about a            third to half of the way into the game, it starts to get pretty            boring, with lots of similar-ish dungeons containing far too many            random encounters with small but annoying enemies (such as the sand            beetles which can't really hurt you but cast a spell that makes            your entire party miss their next turn!). Fortunately, the game            really picks up after that, not only reducing the frequency of            random encounters but also introducing some interesting gameplay            elements. You set up your own island base, start recruiting            crewmembers for your ship, and can even buy improvements for your            buildings and ~acquire~ pets! These diversions are a lot of fun,            and not only do all the people you can recruit have their own roles            (often helping you in battle) and personalities, but they aren't            forgotten in the ending either…                    All in all, Skies of Arcadia is a triumph for Sega. It shows not            only what the Dreamcast can do, but also that the likes of            SquareSoft have some serious competition in the RPG arena. There            are so many side quests and little extras in the game (like the VMU            minigame and Internet downloads) that I simply don't have time to            mention them all. There are some flaws, but nothing that ever gets            too annoying, and certainly not bad enough to prevent Skies of            Arcadia from being one of the best RPGs ever to be released."}