{"ref": "https://www.eurogamer.net/r-igi", "date": "5 Jan 2001", "game_name": "Reviews", "text": "Quite how long the realm of reality can be plundered and stuffed            into the first-person shooter genre in various guises is something            critics have been pondering over for a while now. The idea of            experiencing a game from the eyes of a pre-determined character            with a gun strapped to their chin is growing all the more stale,            and the quest for originality has been significantly dampened            throughout the course of only a couple of years. Of course, there            are a few innovators every so often that tend the break the mould            and set landmarks for all developers to aspire to; Half-Life, Thief            and Deus Ex are just a few such titles.                         So then, it would come as quite a great surprise to find that one            of the newest innovators of the genre happens to be a Norwegian            outfit called Innerloop, previously recognised for an acclaimed            flight-sim released three years ago called Joint Strike Fighter. On            first impressions, you'd be forgiven for mistaking IGI for yet            another bandwagon-jumping realism-fest, in the same vain as Rogue            Spear or Delta Force, yet Project IGI's success lies in its            subtleties.                         Project IGI's plot (IGI stands rather cheesily for ~I'm Going In~,            by the way) is set in the former Soviet Union where the game's            protagonist, David Jones - an ex-SAS soldier turned freelance            Allied governments operative - is tracking down Jach Priboi, the            man responsible for the theft of a nuclear device. As Jones finally            manages to hunt down Priboi, he learns of the buyer of the weapon            and what their plans are for it. Although the game takes a fairly            linear mission-by-mission approach, the unfolding storyline lends            the game a narrative credibility not usually associated with this            kind of structuring.                    The first thing any player will notice about Project IGI is the            sheer scale of the levels, clearly the result of its flight-sim            heritage - the playing field is literally vast and would take an            absolute age to find the edge of, if you were inclined to do so.            The foreboding sense of abandonment and isolation in a hostile            environment sets in from the very start of the game, and it doesn't            let up until the very last showdown. To the developer's credit, the            structures and buildings dropped in the middle of these huge            expanses are fabulously designed and serve to force claustrophobia            down your neck when appropriate - the blind panic induced when an            alarm is set off and you're stuck inside an installation is            wonderfully effective.                         Although the missions all take place in the wilderness away from            any discernible kind of civilization (as opposed to the mostly            urban scenarios which seems to be de rigeur for the genre), the            actual installations and scenery you come across varies to a            pleasant degree, from a burnt out village in a mountain range to a            sprawling train yard set in a deep valley. On the various occasions            where you may be roaming at a high-altitude - for example in a            sniper tower or atop a hill - you realise the true beauty of the            game… it almost brought a tear to my eye. Not really. But you            get the idea.                         Aiding your progress through most of these missions is an all-star            cast of weapons and intriguing gadgetry. Often you will start a            mission with a relatively small armoury composing of a machine gun,            pistol, knife, and perhaps a medipack, though you're likely to            pilfer extra weapons from the opposing forces and their weapons            caches during your mission. Accompanying the weapons are your            tactical aids in the form of an excellent pair of night-vision            enabled binoculars with an incredible range on them, and a            real-time GPS map, which utilises the game engine so you can zoom            in and spot guard patrol routes and possible entrances. IGI is one            of the rare occasions when such tools come in handy and are used            often, as planning and the casing of your objectives is heartily            recommended for success. Occasionally you can come across a            medipack, but instead of healing a set amount of health points            regardless of your current status, you can administer the healing            yourself via a syringe whenever you think it appropriate. This            keeps the realism and arcade sides of the game in a nicely balanced            harmony.                    Despite being a truly astounding game, it's only natural for it to            have its faults and when IGI trips up, it does it in a big way.            Perhaps the largest setback which would put the majority of the            paying public off is the omission of an in-game save feature, as            your progress is only recorded once a mission is complete. Now            personally, this only really poses itself as a problem in the later            stages of the game, where missions can become so large and complex            it is an immense chore to have to begin a mission again. Frequently            I would quit after one go just because I couldn't be bothered to            trace over my footsteps again - this was just on Easy mode as well!            A patch to insert at least a limited save feature would be most            welcome; even just two saves per game would serve as a bonus.                         The level design, although generally brilliant, falters here and            there because after the first couple of levels, you begin to            realise that a lot of buildings are pre-fabricated and literally            cut-and-pasted around the levels. Towards the end of the game,            going through apparently the same buildings over and over begins to            grate, and I can't honestly see how the developers could have been            so lazy.                         The AI, too, often leaves a little to be desired; for example you            have two guards standing side by side. You pop one fellow in the            back of the head and he drops to the ground with a yelp, yet his            buddy will happily stand there gazing into the distance for you to            remove the back of his skull as well. And the enemies don't react            terribly well to sound either; you can, for example, often get away            with firing an AK47 (a horrendously noisy weapon) in close            proximity without guards noticing.                    Whilst playing IGI, I was consistently aware of the fact that it            reminded me of something from gaming past… another truly            great game. My realisation of what this was only towards the end of            the game, when it suddenly dawned on me that I was basically            playing a fabulous PC rendition of the N64's GoldenEye, albeit with            bells on. All of a sudden it became clear, and not just in the game            mechanics - the sniping hunts in snow storms, the assaults through            underground tunnel systems, the picking off of scattering guards as            they sprint for the alarm switch - it all came flooding back. The            thing is, I don't ever recall Innerloop citing Rare's masterpiece            as an influence, but I'd find it extremely difficult to believe            that it isn't to be credited somewhere in IGI's creation.                         This thought led me to conclude what is undoubtedly Project IGI's            greatest faltering - its lack of multiplayer. Honestly, I believe            that the game's life could be extended a hundred-fold with the            ability to play others in what could have been a serious contender            to Counter-Strike's crown, and it is indeed a great shame that this            hasn't happened. It just stands as a dream for the already            burgeoning IGI community that perhaps a future patch could rectify            this frankly horrendous oversight.                    Project IGI is a must-have purchase for any action gaming fan, and            is a testament to what can still be done with the genre with the            proper amount of thought. However, the issue of longevity does come            into play with the omission of a multiplayer mode, and as such it's            far from what it so easily could have been."}