{"ref": "https://www.eurogamer.net/r-moho-pc", "date": "26 Dec 2000", "game_name": "Reviews", "text": "Far into                 the future life as we know it has ceased to be, and there are                 as many synthetic lifeforms as humans. The two races do not                 get along at all well either, and crime is all too                 commonplace. Law and order is still a requirement though, so                 at least you are safe in the knowledge that in the future you                 can still stop a Bobby on the street to ask for directions!                    To maintain the peace, special prison planets have been setup for            the synthetics, but we're not talking your standard barred windows,            bread and water supper type deal here. These places are gigantic            metallic tombs designed to keep the prisoners in, and never let            anyone out. The strongest of the synthetic lifeforms are selected            to compete in gladiatorial games, but this does not come easy, as            they have the lower half of their body cut away and replaced by a            sphere - it gives a whole new meaning to the term 'roll with the            punches'...                    MoHo has been developed by Lost Toys, a new team including former            members of famous British games company Bullfrog. The policy of            their new company is to bring playability and originality back to            the masses, focusing on fresh ideas rather than rehashing existing            trends. MoHo is certainly original, but does it have the beating            heart of rock solid gameplay too?         Your first task is to                 choose one of the five synthetics at your disposal, all of                 which have varying strength, speed, agility and stamina. Angel                 is perhaps the best character to begin with as she is by far                 the fastest, but once you start having to fight more in the                 later stages you will realise that strength is her weakness.                 Benny the mining droid is perhaps the most fun, because as he                 thumps his opponents he can stick in his drill for a                 devastating spin. The inclusion of only five characters is a                 little weak though, and it would have been nice to be able to                 select from a wider group, especially in the two-player mode                 where a more varied selection would have been welcome.                    Once you have selected your character you can then choose which            prison you are going to compete in. There are ten prisons to do            battle in, but only the first will be available in the beginning -            you have to complete a sufficient number of events to unlock the            others as you go along. There are a total of seven different            gladiatorial events to get stuck into as you make your way through            the game, and these increase in difficulty as you step up through            the prisons. Standing in your way are all manner of obstacles,            ranging from laser turrets hurling plasma at you every few seconds            to seemingly harmless pools of water which will short circuit your            droid should you decide to take a quick dip! It is not only static            objects you have to worry about either, with a lot of levels            including fellow inmates who are keen to impress those up on high            with their own fighting skills. As if that is not enough some of            the prison guards themselves have been stripped of their nether            regions and partake in the games too, making for much tougher            opposition.                    The one thing you will have to get to grips with straight away is            controlling the droids, which at first can be a frustrating            experience to say the least. The developers have employed a very            clever system, making you think ahead due to the momentum caused by            the sphere, and once you get the hang of how this all works it can            be immensely rewarding to go whizzing around in complete control of            your destination. At first though you may well be cursing and            willing to throw your joypad out of the window!                         Surprisingly the events which I found most enjoyable were the                 ones that did not involve any combat, namely ~Pursuit~ and                 ~Tag~, with a couple of really quite dreadful events                 (~Powerball~ and ~Race~) thrown in for good measure. ~Pursuit~                 is amazing fun and requires you to have complete control over                 your droid as you negotiate thin platforms and precarious                 jumps over water. The idea is to reach the end of the level                 before the time limit expires, but with the added twist of the                 level falling away into water behind you all the time.                    ~Race~ has to be the most annoying event by far, and has you racing            other inmates and/or guards around extremely dull circuits, with            the added pleasure of never being first off the starting blocks. By            the time you have got yourself up to full speed you very often find            that you are relying on the leader to mess up to stand any chance            of winning. Occasionally you get an initial burst of valuable            speed, but more often than not you are the last to get going.                    The event that has caused the most amount of psychopathic rage            though has to be ~King of the Hill~, where each player starts on            forty seconds and has to spend as long as possible at the top of            the level. The more droids on the 'hill' the slower your time            decreases, so this encourages you to thump, hit or barge your            opponents off the ledges. The rage occurs when you have clearly            spent longer on the hill than everyone else, but you are still not            being crowned as king! Definitely not what is supposed to happen,            and it can force tedious retries to win the event.         The world                 of MoHo is wonderfully colourful, full of lush landscape                 textures like metallic walls and organic mounds, and superb                 lighting effects such as laser bolts and leaping flames from                 turrets. Whenever your character lands heavily or a defeated                 opponent's sphere explodes, the impact produces a stunning                 shockwave which ripples like a raindrop in water - A truly                 amazing effect that has to be seen to be believed.                    Character designs are nice enough but are not exactly detailed, and            when rolling they look like one of those nutty speed-walkers you            used to see all the time on English streets. The lack of detail            means that combat can get a little confusing too, particularly when            there is more than one assailant, with your gladiator getting lost            in amongst the action.                    The audio is pretty poor, with the onlooking crowd sounding            extremely tinny and cheering even when you have only done the            simplest of tasks. There is not much else to comment on sound-wise,            with your characters making grunting noises when leaping and            landing, and the odd little spot effect here and there. Even combat            sounds dull when it should be a cacophony of metallic clangs and            clatter. The industrial styled music also becomes tiresome and            repetitive very quickly, and I was soon playing with just the            sparse audio. For a gladiatorial based set of tournaments it            doesn't half sound quiet; I have heard livelier amateur Sunday            league football games!         So yes, MoHo is definitely                 original, and it certainly plays very nicely once you get the                 hang of the controls, but unfortunately it all gets a little                 repetitive as the game wears on. With only seven different                 events, two of which are really rather poor, there is not                 enough variety to maintain your interest and keep you coming                 back. Add to this the inexcusably lousy audio and what chance                 the game had of shining is all but extinguished.                    The game would really suit online play down to the ground and I            could warm to the idea of clan based MoHo warfare, but it is rather            puzzling that it only includes a basic two-player mode. Perhaps if            internet play is bolted on at a later date I might just retrieve it            from the shelf, where it is no doubt going to reside from here on            in."}