{"ref": "https://www.eurogamer.net/dvd-galaxyquest", "date": "24 Dec 2000", "game_name": "Reviews", "text": "- Dean Parisot            Producer - Mark Johnson            Starring -                          Tim Allen                          Sigourney Weaver                          Alan Rickman                          Tony Shalhoub            Filmed - America, 1999            DVD by - DreamWorks Pictures                    During the early 1980s Commander Peter Quincy Taggart and his crew            voyaged amongst the stars in the NSEA Protector. Then their TV            series was cancelled, and the actors found themselves reduced to            making endless appearances at conventions, surrounded by fans            wanting to get autographs and ask obscure questions about the            series. ~These guys haven't had a real acting job for 20 years,            this is all they've got~.                    Until one day a group of aliens called Thermians turn up. With an            almost child-like innocence and no understanding of fiction, they            believe that the episodes of the Galaxy Quest TV show that they            have intercepted were in fact ~historical documents~. Their entire            society has been based around the ideals seen in Galaxy Quest, and            with a crisis looming they have come to find the great Commander            Taggart to save them. There is just one slight problem - Commander            Taggart is actually a washed up actor called Jason Nesmith, played            by Tim Allen.                    Nesmith is soon joined by the rest of his ~crew~ aboard the replica            of the Protector that the Thermians have constructed. British            classical actor Sir Alexander Dane (played by Alan Rickman) takes            on the role of Dr Lazarus, an alien with a purple prosthetic            head-piece whose most memorable line is ~by Grabthar's hammer, you            will be avenged~. Gwen DeMarco (Sigourney Weaver) is the            blond-haired bimbo Lieutenant Tawny Madison, whose only jobs are to            look sexy and repeat everything that the computer says, while Fred            Kwan (Tony Shalhoub) plays the ship's top engineer Tech Sergeant            Chen, and Tommy Webber (Daryl Mitchell) appears as the pilot            Laredo. Also along for the ride is Guy (Sam Rockwell), who played            Crewman Number 6 in episode 81.                    As you may have guessed by now, Galaxy Quest is a parody of Star            Trek, and as such certain truths are accepted. The captain must            always lose his shirt in a fight, every alien planet has an            Earth-like atmosphere, the good guys always win, and any crewman            who isn't a member of the regular cast may be killed at any moment.            As such Guy goes through most of the film in a permanent state of            paranoia; after all, ~I'm just crewman number 6, I'm the guy who            dies to prove the situation is serious~.                    The real moments of genius come when these rules are turned on            their heads though. The actors try to fit back into the roles that            they played twenty years ago, but the illusion is somewhat            undermined by the constant bickering that goes on between them, a            far cry from the clean-cut idealistic world of Galaxy Quest. And            this time they have a real ship at their command, with real lives            on the line. When an encounter with the evil alien warlord Sarris            turns into a fiasco (~there's a red thingy moving toward the green            thingy .. I think we're the green thingy~) even the egotistical            Nesmith begins to realise that the actors are in over their heads.                    Their only chance of survival is to repair the damage to the            Protector and defeat Sarris, but to do this they must work together            as a team and try to live up to their roles in Galaxy Quest.            Positive life-affirming stuff then, but with a healthy dose of            self-deprecating humour thrown in to keep you laughing throughout.                    While the clips of the Galaxy Quest TV show that you see are            suitably tacky, with true Star Trek style plyboard sets, dodgy            acting and cardboard special effects, the movie itself is a whole            different kettle of fish.                    The script is excellent and manages to be painfully close to the            bone yet essentially good-natured and respectful in its ribbing of            Star Trek, with some great throw-away humour and memorable            one-liners. The acting is perfect for the rather silly mood of the            film, and everybody seems to be having a great time, particularly            Sigourney Weaver, who positively throws herself into the role of            blond bombshell Tawny Madison - it's certainly a far cry from her            work on the rather more serious ~Alien~ movies...                    It's not just the actors that put in solid performances though -            the CGI special effects provided by Industrial Light & Magic            are little short of stunning, and the lumbering rock monster is            both ominous and ridiculous in equal measures. The movie also            features some of the most spectacular space scenes we have ever            seen on the big screen, ironically putting even the likes of ~Star            Trek Insurrection~ to shame.                    The Region 1 DVD is truly excellent, with near faultless sound and            picture quality, and some beautiful animated menus featuring a            mixture of footage from the film, CGI rendered scenes, and funny            little clips of the aliens goofing about.                    There is also an impressive collection of extra features. First up            is ~From The Cutting Room Floor~, a collection of seven extended            versions of scenes which were cut in the final movie, including an            amusing addition to the rock monster scene in which Alan Rickman's            character tries to use method acting skills to determine the            motivation of the creature. His conclusion? ~I must crush the thing            that makes the vibrations~. Other highlights include Fred Kwan            bluffing his way through a blizzard of techno-babble with the            Thermian engineering team, and Gwen DeMarco using her rather ample            ~assets~ to dispose of a pair of hostile aliens in the reactor            room.                    Also included are cast and crew biographies, theatrical trailers            for Galaxy Quest and other movies, and the production notes which            can also be found in the single spread booklet that comes with the            disc. There's even an amusing Thermian language audio track in full            Dolby 2.0, which mostly consists of ear-piercing squeaks and            croaks. No, really. Finally there is a short ~making of~ featurette            which includes interviews with some of the cast and crew and plenty            of fun behind the scenes shots.                    Overall a high quality feature-packed disc that makes the most of            one of last year's funniest movies. Well worth adding to your            collection, especially if you are at all familiar with Star Trek.            And let's face it, these days who isn't?            Film - 9/10            Disc - 9/10            Availability -                            Amazon.com - $16.19                                    Amazon.com - $16.19                                    Bigstar.com - $21.59                                    Bigstar.com - $21.59                                    Express.com - $21.59                                    Express.com - $21.59                Note - All information is correct at time of writing, but            prices and availability may change. If you find any broken links or            other problems, please let            us know."}