{"ref": "https://www.eurogamer.net/r-trc", "date": "14 Dec 2000", "game_name": "Reviews", "text": "With the arrival of yet another episode in the continuing            adventures of Lara Croft, the words ~flogging~, ~dead~ and ~horse~            spring to mind. In fact that is quite literally the case this time,            as the game starts with Lara missing and presumed dead in Egypt. If            only...                    As a group of mourners exchange tales of her adventures on a stormy            night, you find yourself playing through four new but totally            unrelated episodes, loosely linked by the stories of her friends.            The first sees you searching for artefacts amongst the ancient            ruins of Rome, the second takes you to a Russian nuclear submarine            searching for the spear of destiny, the third casts you as a            teenage Lara exploring a haunted Irish island, and the fourth finds            you in a highly exotic location, the like of which Lara has never            seen before - an office block.                    As usual the whole thing is held together by a mixture of excellent            rendered cinematics and rather half-hearted in-game cutscenes,            which are annoyingly impossible to skip. Lip synching for the            in-game scenes varies from mediocre to downright wrong, and there            is something of a ~Singing In The Rain~ moment in one exchange as            Lara speaks to a priest, his lips moving in time with her lines and            vice versa. Whoops.                    Each of the four episodes has its own focus, varying from            exploration and puzzle solving to stealth or simply gung-ho action.            For example, on the haunted island you are unarmed and there are            few enemies to face, with most of your time spent exploring the            ruins and clambering around on narrow ledges, while the nuclear            submarine levels are action-packed, filled with Uzi-wielding bad            guys to blast away at.                    Unfortunately the results are rather mixed. The island level comes            down to a lot of running around pulling levers and some rather            tricky jumping puzzles, with a few spectral monsters to give you a            nasty shock if you get careless. Meanwhile the submarine features            far too much crawling around in air ducts, and the levels are so            claustrophobic that the endless combat soon becomes dull and            repetitive; the music changes, an enemy springs out, you stand in a            narrow corridor blasting away at each other at point blank range,            and after a few seconds he dies. Repeat, ad nauseam.                    That's not to say that it's all bad though; in fact I found some of            the Roman levels rather enjoyable, if a little frustrating at            times. The locations are amongst the most impressive on offer in            the game, and open enough to allow you to move around during combat            without running into a wall every other step. The mixture of            puzzles and action is more along the lines of previous Tomb Raider            games, there are proper bosses to face off against, and even the            storyline seemed more involving than in the other episodes.                    Sadly Tomb Raider is very much a PlayStation game at heart though,            and no discernable effort has gone into making the most of the PC's            capabilities. There is still no support for the humble mouse, and            the controls are unwieldy at the best of times on a keyboard. Even            with a joypad it can be difficult to manoeuvre Lara accurately, and            all too often you find yourself staring in disbelief as she            plummets to her death for no good reason.                    To give you even more opportunity to fall from a great height,            Chronicles adds a couple of new moves for Lara, in the form of            walking along tightropes and swinging on ropes. Both are used            sparingly, and don't really add any new challenge to the game.            Other than that there are the usual rolling, crawling, climbing,            running and leaping moves we have all come to know and love. None            of these moves are particularly intuitive, especially using a            keyboard, and the controls seem to have been conciously designed to            be awkward and unresponsive.                    The biggest problem though is combat. Lara can only turn slowly and            is unable to strafe properly, resulting in fights that usually            devolve into standing in roughly the right place and holding down            the fire key until the enemy drops dead. If you are in an open area            you can bounce from side to side as you fire, at which point            enemies find it almost impossible to target you, while you can aim            perfectly even while cartwheeling in mid-air. It's an effective            strategy, but looks rather ridiculous.                    The lack of effort applied to the PC version of the game extends to            the graphics as well. Tomb Raider Chronicles marks Lara's fifth            outing, and the series has been looking increasingly tired of late.            Back in 1996 the original Tomb Raider looked fairly impressive, but            Ms Croft has aged poorly, going rather saggy in her old age, and            developing fine lines the likes of which no moisturising cream            known to man is able to cure.                    The characters are blocky and poorly textured, and AI is fairly            basic at the best of times. Staring at Lara's lumpy pixellated butt            soon becomes tiresome, and the poor third person camera doesn't            help matters either. To make things even worse, cinematic camera            angles are used in some key areas to give you a more dramatic view            of the action. This usually happens at the worst possible moment,            such as when you are trying to leap across a pool of bubbling lava.            It might look stylish, but when it makes the jump harder to judge            it soon becomes annoying.                    Textures and skins are low resolution and lacking in detail at            times, and the artists at Core still haven't quite worked out how            to make them meet at edges without leaving visible seams. The            limitations of the engine just make things worse, and the skies are            particularly awful; whoever was responsible should be strung up            from the nearest lamp post. Level design on the other hand is            amongst the most intricate we have seen in the Tomb Raider series            to date, although it still looks dated compared to .. well, pretty            much any other third person game released this year.                    If you think you can do better (and you will probably soon realise            that you can't), for the first time the game comes with an            easy-to-use level editor, supplied on a second disc along with            models, textures, and several playable levels from ~The Last            Revelation~ to mess around with. It's a little labour intensive,            and using it for a few minutes drives home just how primitive the            engine really is, but once you know what you're doing the endless            mouse clicking becomes second nature and running up a few basic            rooms is a straightforward task.                    Thankfully Lara's next outing will use a next generation 3D engine,            but Chronicles just serves to remind us that a major overhaul of            the engine was long overdue. This year has seen the release of            several competent third person shooters; Lara no longer has a            monopoly on the genre she helped to create, and while Core have            continued to focus their efforts on the ancient PlayStation, other            developers have followed in Lara's footsteps and pushed the genre            forward. Recent games such as ~Rune~ and ~FAKK2~ put the controls,            combat and graphics of the Tomb Raider series to shame, and by            comparison Tomb Raider Chronicles is rather bland.                    Of course, whatever we say it will still sell by the bucket-load,            and it's sure to appeal to fans of the series and testosterone            laden boys with poor eyesight (two demographic groups which overlap            to a remarkable degree). Some of the old charm is still there, but            it's starting to wear a bit thin after four years, and for those of            us with more refined tastes there are much better third person            games out there now."}