{"ref": "https://www.eurogamer.net/r-patriot-dvd", "date": "3 Dec 2000", "game_name": "Reviews", "text": "- Roland Emmerich            Producer - Dean Devlin            Starring -                         Mel Gibson                         Jason Isaacs                         Joely Richardson                         Heath Ledger            Rating - unknown            Filmed - South Carolina, 1999            DVD by - Columbia                    In another of his emotionally charged adventure films, Roland            Emmerich directs and Mel Gibson stars as family man Benjamin            Martin, who finds the peaceful world he lives in invaded by a war            with the English. After one of his sons is murdered at the hands of            a brutal English dragoon captain and the other is sentenced to            death, he finally loses his rag and chases down and slaughters 20            English soldiers escorting his son to execution, attacking with            rifles and a Cherokee Tomahawk, a remnant of his troubled past            which reveals itself gradually throughout the movie. Earning the            moniker ~Ghost~ he forms a militia group with a loan French            commandant and fights the cause of the independants in a troubled            time for the colonies of America.                         Gradually though as the truth about his past in the French /            Indian conflict becomes clear you see a different side of Martin,            whose brutality is equalled only by his love and devotion to            family. Despite overwhelming odds and the unshakable resolve of one            barbaric English captain, he protects them and leads the film            towards its exciting finale.                         Throughout The Patriot, emotions run high and the viewer becomes            very much endeared to the characters, whose lives are under            constant threat. The historical accuracy is a step up from Gibson's            last self-indulgent romp, Braveheart, but at times it's difficult            for the film to drag itself out of the latter's shadow. The level            of violence and bloodshedis certainly up there with Braveheart, and            in terms of shock value The Patriot's credentials are never in            doubt, but the story is obvious and at times rather weak.                    As anyone who saw Braveheart will testify, the only way it seems            that villains can be born in Gibson films is by wronging the man            himself, and whenever one of our scoundrel's plans to usurp Gibson            fails, there is always another house to burn with people inside it            or another family member to threaten. See Lethal Weapon, Braveheart            and others for potent examples - it's a vicious circle but it's            also rather tired.                         Nonetheless The Patriot is definitely worth watching. At 165            minutes it's another quite lengthy story but I never felt bored by            what was happening, although I did cringe occasionally as Martin's            idealistic son Gabriel did something clichéd and heroic. Also,            as with Braveheart there is a touch of sadness, but thanks to some            occasionally brilliant direction from Emmerich, the balance is just            about right to keep the audience happy, even if there are a few            shed tears.                         One of the other things that becomes very clear after a while is            that producer Dean Devlin knows his history. The tunics and outfits            in general are rugged and worn, just as you would expect such a            rebellion to be, and the beautiful representations of Georgetown            and the Martin residence in Carolina are stunning.                    The acting in general is no less impressive, with some brilliant            roles from Jason Isaacs, Joely Richardson and Gibson himself in            particular. Heath Ledger seemed somewhat weak cast in the role of            Gabriel, but he was believable enough, even if his character was            born of impractical beliefs. Another good casting was Star Trek            star Rene Auberjonois, who played the Reverend in the small town            where the Martins seek help for their militia. His lines in            particular were made all the more effective by his stern tone and            deeply engraved facial expression. When questioned about his            willingness to fight the cause, he coolly fires back that ~a            shepherd must tend his flock, and occasionally fight off the            wolves.~                         There are some great performances from lesser parts as well. One            of Martin's militia, a grisly war veteran with similar family            values to Martin himself, plays the part enthusiastically, and when            things go horribly wrong, the picture of distress on his face was            so natural that it affected me greatly. On the whole the direction,            production and cast are of solid credentials and do a marvellous            job.                    The disc itself contains a goldmine of features, including            meaningful commentary from director Emmerich and producer Devlin, a            small featurette on the visual effects (some of which are amazing),            a slightly longer feature called ~The Art of War~ which focuses on            the battlefield scenes, some Deleted Scenes with optional            commentary as well as photo galleries, production notes, conceptual            art and information on each of the actors. There's an awful lot            here to see and do beyond the film itself, and if you enjoy the            screenplay you will take a lot away from these 'superfluous'            facets.                         All things considered The Patriot makes wonderful watching for the            slightly older family, and although hardly as thought-provoking as            something like American Beauty, definitely keeps the brain ticking            over events. It may also teach you a thing or two about American            history and the times leading directly up to their independence,            although I wouldn't rely on it as study material! Unlike Braveheart            it doesn't make it all up, it takes key events and actually builds            a story around them, one that makes sense and keeps the heart            racing.                    The Patriot is another film from Mel Gibson that finds a popular            part of history and 'exposes' it. It moves very fast and tells a            powerful story, but at times the clichés are somewhat thick on            the ground. Still, with a pleasant cast, good direction and            impressive production it's one to watch on a cold Winter's evening            with the fire roaring and a bucket of adrenaline.            Film - 8/10            Disc - 8/10            Availability -                            Play247.com - £17.99 + P&P                                    Play247.com - £17.99 + P&P                            - All information is correct at time of writing, but prices and            availability may change. If you find any broken links or other            problems, please let us            know."}