{"ref": "https://www.eurogamer.net/r-trackfield-gbc", "date": "2 Dec 2000", "game_name": "Reviews", "text": "There are many arcade games from back in the day that can bring a            tear to the eye of the veteran gamer. Grown men have been lost for            days at a time, only to turn up huddled next to Pac-Man machines in            the local chippy making rapturous noises, as if reunited with a            long lost son, or slobbering clumsily on battered old Galaxian            cabinets, long forgotten to make way for endless light-gun shooters            and derivative sports games. Konami's sports title Track and Field            is certainly a game known to induce this sort of fitting. Frenzied            button bashing and expert timing was needed in the arcade, in fact            the wrist-crunching button action was so hardcore the cabinet            shipped without a joystick, adding a third button instead for            events where timing needed to take place. Many youths spent their            coveted ten pence pieces, in between cans of old style Shandy and            packets of Tudor Crisps (Steady on -Ed), on developing RSI            by guiding a little moustachioed man through a series of events, to            be rewarded with a hearty ~CONGRATULATION!~ (sic).                         But would it hold up today? Would the kids, with their class-A            drugs and WAP phones and the like, find a place in their hearts for            this update of a classic sports game? Or would it be like a retired            athlete, clinging to the limelight doing punditry for Eurosport or            advertising a phone book, ignored by all? Konami, ever the glutton            for punishment, decided to find out with its release of            International Track and Field on the little Gameboy Color.                    If any of you are old enough to remember the original, you will no            doubt remember that a vast array of events were available. Things            have changed somewhat this time, with my personal favourite            Weightlifting (with the most inventive use of oval sprites to            create moving arms, ever) being removed, among others. The new            lineup of events includes the 100m Sprint, Long Jump, Shot Put,            High Jump, 400m Race, 110m Hurdlers, Discus Throw, Pole Vault,            Javelin Throw, and finally the 1500m Race. All pretty much standard            athletic fare, but some have slightly different methods of            controls.                         The 100m Sprint is your average finger-snapping, tap the A and B            buttons alternatley to run faster style race. Maybe I'm getting            lame in my old age or something, but I was finding it very            difficult to rack up times of under 11 seconds, and I was usually            finishing 3rd or 4th. The thick GBC buttons don't really lend            themselves to this kind of sprinting action.                         Just as well the other events aren't totally focused around it.            The remainder of the non-running events include the button bashing,            although it isn't nearly as critical. The real test of skill in            events like Discus and Javelin, is pinpointing the trajectory angle            of the projectile. Getting the javelin to fly at 45 degrees, or            throwing the discus in an exact straight line for maximum length.            Nothing groundbreaking, just tap the D-pad to time your release.            It's fairly easy to master these events after the first few shots -            it would actually have been nice to have wind and weather play a            factor in any events, but either this didn't occur to the            developers or they were trying not to stray from the original's            purity, and the weather is always pristine                         The 400m and 1500m races differ slightly, thankfully not asking            you to tap A and B for 10 minutes non-stop. Instead, you use the            buttons to speed up and slow down your athlete. Once again, this is            ridiculously easy, with my little pixelated athlete coming in first            virtually every time, only seriously being challenged at the very            end of the race. A sharp contrast from the challenging sprints,            although since when was the 400m classed as an endurance race?            Piffle.                    The Hyper Mode offers a chance to play each event, with points            being scored in each, determined by the time, score, distance or            height attained in each event. This is all right, if you actually            care about beating the AI controlled athletes, and comparing your            best times. It's the most faithful to the arcade, except you cannot            be eliminated through getting a bad score. After a few shots in            this though, I was bored solid, playing through most of the events            as a chore, trying to get to the ~good~ ones.                         The Story Mode aids this somewhat. Taking a break from the basic            structure of the game, this mode allows you to take control of the            life of your athlete, training him in four disciplines of Speed,            Power, Throwing and Jumping, by determining training schedules            throughout the week, and attending practices on various weekends.            You can even take days off with your friends, and watch your Stress            level return to normality. Usually I'm a sucker for this kind of            thing, but there's too much menu-switching and number-crunching,            and the action takes too long to start. The very basic            ~role-playing~ aspects can be fun, too, but usually you'll find            yourself tapping the A button to skip through the embarrasing            dialog, as fast as you might during a 100m race.                         In addition to this, there's a Practice mode where any individual            event can be mastered (or otherwise), and new records set. A neat            feature is the Battery Backup, which not only saves the Story Mode            progress but also your records, so you don't lose them when you            switch off. This is a vital element of the game; the lack of a            battery backup is the main reason I hated those Game and Watch            Galleries for the Gameboy, I couldn't go back in and beat my own            score.                         Even if I'm too much of a weakling to break my 8 metre long jump            record, the VS Link mode allows you to play a friend through the            events. I didn't get a chance to test this out, but I can imagine            all it changes is that instead of coming 1st in all the            non-sprinting events, I could possibly come 2nd, and instead of            coming 4th in the Sprint, I could maybe come 3rd. To create your            own fun, I suppose, you could have mandatory urine tests before you            start playing, and weepy medal ceremonies when you throw your            Gameboy down after contracting arthritis of the wrists. Or            alternatively, you could just not bother.                    If there's one thing to be said for the game, it is the graphics            are a marked improvement on the arcade. I know, giving that the            game's from the dusty era of 1983 it may not sound much of an            acheivement, but the Story Mode graphics, menus, score tables and            backdrops are all well-defined and easily accessible. My main            complaint is the characters have lost their ~cartoony~ feel from            the original, instead becoming streamlined stick-beings. There's            even now the blasphemous option to select your own character to            play through each mode with, instead of always being Mr. Moustache            from the arcade game.                         If the visuals are tolerable, the sounds definitely are not. Music            that even Konami of the 80s would hesitate to use (not an            exaggeration), and that ridiculous rising-falling sound whenever            someone is jumping or throwing someone, a relic that really SHOULD            have died out in the 80s, really makes the game feel more like a            piece of Shareware than a polished product. Maybe I'm being tough            on the little GBC's capabilities here, but really, now, the music            is shambolic. The crowd noises I'm not even going to comment on,            because it might bring back a relapse of the frenzied buzzing in my            sleep, like a rabid bee stuck in my brain.                    It didn't need to be released. I'm sorry, but it's true. Hyper            Sports, featuring events such as Clay Pigeon Shooting, Archery, and            Horse Vaulting would have been much better suited to the Gameboy:            it's quirkier, and is more fun. It's an arcade game that would            work on the small screen. I just found myself bored at this,            after a few shots, with little desire to go back and improve on my            paltry records.                         There's many better sports games on the Gameboy: my personal            favourite being the various NBA Jam sequels. If you're a track and            field fan on the go, by all means pick it up. For the rest of us..            it's deeply average. Money to burn? Go for it. But it's no            medal-winning stuff."}