{"ref": "https://www.eurogamer.net/r-ctp2", "date": "25 Nov 2000", "game_name": "Reviews", "text": "All classic games are based on a simple concept, and the            multi-million selling ~Civilization~ franchise was no exception.            The classic turn-based strategy game started you off in 4000 BC            with a small group of primitive settlers, and then gave you the            next six thousand odd years to lead them to global domination by            whatever means necessary.                    Flash forward to 2000 AD, and while we haven't sent men to Alpha            Centauri or united the Earth under a benevolent dictatorship yet,            we have produced ~Call To Power II~, Activision's second take on            the Civilization theme. While they haven't used the C-word in the            title this time round, probably as a result of the complex legal            settlement reached between the various parties laying claim to the            name a couple of years back, this is clearly another unofficial            sequel to one of the most popular and downright addictive strategy            games ever made.                    It has the same addictive mixture of city management, exploration,            diplomacy, research and conquest that made Civilization such a hit,            but it's not just more of the same with prettier graphics. Call To            Power II builds on the new features of its predecessor (including,            appropriately enough, the ability to cripple your rivals with law            suits), and adds some new tricks of its own. The question is, are            the new features enough to make the game worth buying in its own            right?                    The first improvements you will see are to the interface, and a lot            of effort has gone into making the game more user-friendly.            Previous Civilization games were rather labour intensive and            daunting affairs, particularly as your empire expanded in the later            stages of the game. For example, you can now assign mayors to            govern cities for you, selecting from basic goals such as improving            your military strength or expanding the city.                    Even if you want to retain a more hands-on approach to govenment            though, the new build queue system means that controlling the            ever-increasing number of cities under your control is less of a            chore. You can even create and save your own custom build queues            for later use, although this is a little less helpful than it            should have been, as there is no way of limiting the listed units,            buildings and wonders to ones which you can currently construct,            meaning that you have to hunt through hundreds of items which you            may not even have access to yet to find the one you're looking for.                    Meanwhile a series of easy-to-navigate menu screens allow you to            oversee your empire. A City Management menu makes it easy to hop            between cities to adjust construction orders, labour allocation and            other details. Taxation, wages, food rations and other options can            be controlled from the Empire Management window. There's an Army            Management screen which you can use to quickly browse through all            of the units under your command, see if you have a well balanced            force, and eliminate any obsolete troop types with a couple of            mouse clicks. A Trade Management screen lets you set up new trade            routes, assuming you have the appropriate number of caravans of            course. Ruling the world has never been so easy!                    Dig a little deeper and you will find that two of the most            important parts of the game have also had an overhaul - diplomacy            and combat. More complex proposals can now be crafted using the            (you guessed it) Diplomacy Management menus, with a combination of            any two offers or demands possible.                    For example, you can offer to withdraw your troops from a hostile            country, but only if they hand over one of their cities to you, or            (rather topically) offer a country money to reduce their pollution            levels. You can even select the tone of the proposal, varying from            condescending through good willed to downright hostile. And if the            other country turns down your proposal you can threaten them,            although whether the politicians in The Hague could solve the            current impasse in the climate talks by threatening to invade            America if they don't reduce pollution is open to debate...                    Meanwhile combat has been given a face lift with the ability to            group up to a dozen units in a single army and move them around the            map en masse. When you clash with an enemy force a little window            pops up to show you the two sides facing each other, blasting away            until one has been annihilated or choses to retreat. As well as            bringing the battles to life, these scenes can also show you any            problems with the balance of your army, such as a lack of artillery            support or not enough heavy units to hold the front line.                    The combat system has also been rebalanced, to prevent those            annoying moments when a group of bushmen defeated a stealth bomber,            something which was all too common in previous Civilization games.            Primitive units rapidly become obsolete in Call To Power II, and            keeping your armed forces up to date is more important than ever if            you want to avoid defeat.                    Another new addition to the game is scenarios, which give you more            structured objectives than normal. Sadly these scenarios are one of            the few weakpoints of the game, and the limited nature of them            means that much of the game's depth and addictiveness is lost.                    The Magnificent Samurai scenario, inspired by Akira Kurosawa's film            ~The Seven Samurai~ removes all of the city management elements            from the game, and instead puts you in command of a ronin who            decides to help defend a village against bandits by assembling a            group of samurai. Unfortunately the dialogue and gameplay is            hilariously bad, and even the game's developers seem to have            realised this at some point. Bandits constantly appear out of thin            air and then proceed to attack you one at a time, allowing you to            wipe them out with ease, accompanied by messages like ~another day,            another ambush~.                    Rather more promising is a nuclear stand-off scenario, which gives            you just twelve turns to find a solution to the problem before the            two main nations nuke each other off the face of the Earth. The            game's only other scenario puts you in the role of Alexander The            Great and sets you the task of uniting the classical world under            his rule, from Spain to India. Unfortunately there are problems            with the scripting, and one of the mere handful of technological            advances which you can research actually replaces your warships            with a less powerful variety! On the bright side you are given a            few unique new units which can only be produced in certain areas of            the world, such as Indian elephant warriors. And if, like me, you            think you can do better, you can always use the in-game editor to            make your own missions...                    The only other real disappointments are the lack of animation in            your units and the unremarkable sound effects, which vary from            merely tacky to pretty damn poor.                    Apart from these niggles though, the game is little short of a            masterpiece, taking classic Civilization gameplay and adding even            more depth and variety to it. Improved menus and controls make it            rather less intimidating, and the open-ended nature of the game and            the massive range of units, buildings, technologies and strategies            on offer means this is one game that you can play time and time            again without ever repeating yourself. Highly recommended for            casual gamers and hardened Civilization addicts alike.                        -        Call To                    Power II previewCall To                    Power II previewCall To                    Power II screenshotsCall To                    Power II screenshots"}