{"ref": "https://www.eurogamer.net/r-dinocrisis2-psx", "date": "23 Nov 2000", "game_name": "Reviews", "text": "Ah, the humble PlayStation. By tomorrow it will be a mark on            history's wall, and what a mark. For all Sony's dilly-dallying            around with the PSOne, everybody knows that it's pretty much            finished, and a lot of people will be sad to see it go. But of            course, the death knell isn't sounding for its gaming catalogue            just yet. Thanks to the advanced graphical options available to            gamers using PSX games on the next-generation Sony PlayStation 2,            we should see some interesting improvements. And Dino Crisis 2, it            seems, is one.                         Playing DC2, a game we've been awaiting for quite some time now            with baited breath, is something of a let-down at first.            Graphically the PlayStation is behind the times, and the jagged            lines around the models accentuate them against the pre-rendered            backdrops. The underground cave areas of the game are appalling            bad, and a perfect example of this at its worst. The stark contrast            between the nicely modelled dinosaurs and the cheesy cartoon-like            lava backdrops is jaw dropping; you wonder how they can get away            with it. For the rest of the game things do look almost passable,            but this technique clearly doesn't work if your characters don't            share common characteristics with their surroundings, and your            background artists are having a snooze.                         This is something of a shame, because as far as PlayStation games            go, Dino Crisis 2 is quite an achievement, releasing the survival            horror genre from its slow, plodding temperament and acquiring a            sort of furious, panicky disposition. The game, set a year after            the arrest and imprisonment of time-hole-dinosaur-unleashing Dr.            Kirk, focuses on another experiment gone wrong, this time at the            behest of the very government that sent you to mop up after Kirk.            Logically Regina, lead character from the first game, is chosen to            head off to Edward City, the unfortunate victim of this tragedy,            along with two members of the TRAT (Tactical Reconnoitering and            Acquisition Team), Dylan Morton and David Folk. Crucial research            data must be recovered, and a mystery uncovered.                    Taking on alternate roles of Dylan (machete expert) and Regina            (stun gun authority), the game is played from many different camera            angles, presumably to try and create a cinematic feel. Thanks to            the ageing hardware of the PSX though, a lot of the time you stand            out as a creature of meticulous detail against backgrounds of            varying quality, which puts pay to Capcom's cinematic intentions.            Plug Dino Crisis 2 into a PlayStation 2 though and enable the            texture smoothing option, and you're plunged into a completely            different world. Even the load times seem markedly shorter using            the new console, so if you're buying a PS2 this game would do well            as an experiment of the machine's retrospective capabilities.                         For those of you who don't know, unlike Resident Evil, which leans            heavily toward the adventure side of things, Dino Crisis has you            ducking and diving whenever you step outside, vanquishing dinosaurs            off the face of the Earth. It's hardly surprising these things            became extinct, the amount of them that pour forwards through time            only to be dispatched by your hand…                         The action-packed outside sections are broken up by plot-advancing            discoveries of facilities like the Military Research site, a            Missile Silo and others, and there are a munificent amount of save            game locations along the way. It has to be said that although games            like Quake that encourage you to save and save often are addictive            in a certain way, there's nothing quite like the experience of            discovering something new and literally battling for your life,            attempting to escape the tortuous hordes of rampaging dinosaurs            long enough to save your progress. It puts all other objectives            into perspective.                    Thanks to last year's Resident Evil 3, the action is a lot easier            to deal with as well. The original Resident Evil titles were almost            impossible to get the hang of, and it seemed like half of the            challenge was making the most of controls that were clearly not            intended for use in violent, fast-paced situations.                    In a game like Dino Crisis where pin-point accuracy is important,            the new system introduced by Resident Evil 3 is a god-send. You can            spin, slide, duck, dive, rotate, fire and perform a multitude of            other actions at the touch of a couple of buttons. After the heat            of a few battles wears off, you will have no trouble dealing with            several dinosaurs at once, and the level design allows you to            anticipate attacks quite clearly several seconds before they occur,            which makes a nice change from running blindly into an ambush as so            often occurred in the original.                         Rather peculiarly, another game that Dino Crisis 2 borrows from            heavily is none other than Street Fighter. By escaping the jaws of            dino-aggressors, racking up combos and other specialist kills, you            earn Extinct Points, which can be converted into more weapons and            other accessories at save points. Weapons like Anti-Tank Rifles,            Chainmines, Heavy Machine Guns and Rocket Launchers rapidly become            available, and in proportion to the challenge you are facing. This            is no mean feat, since the challenge is at times insurmountable.            The dinos attack in packs from land, sea and air, and you will face            Raptors, T-Rexes, those annoying little spitty creatures from            Jurassic Park, and even groups of Pteranodons. There are more than            ten types of dinosaur involved, but at times of extreme action it            can seem like a lot more.                    Capcom aren't content to just let you run around erratically            getting slaughtered by the repetitive hordes either. The action can            involve fleeing a couple of berserk triceratops, or an escape from            a nest of Allosauruses. There can't be more than a smattering of            these little sub-adventures included throughout the game, but they            add enough spice to proceedings to keep you occupied.                         All things considered, this is actually a very well-rounded action            game. And with some quite catchy techno and jungle rhythms keeping            the action going, as well as superb voice acting amongst the            humans, and some distinctive roars for each of the dinos, the            quality of the aural element is never in doubt either.                         As far as sequels go, Dino Crisis 2 does what the recently            released Driver 2 couldn't manage, by improving an already seminal            adventure with bigger weapons, more action, better controls and            improved visuals, although on the PlayStation's limited hardware            the improvement isn't much to get excited about. Nevertheless it's            excellent fun; mindless action games of this ilk are somewhat rare            these days amidst so many wannabe Half-Lifes.                    Dino Crisis 2 offers a release from the confines of a genre growing            stale with age. At times its visuals should be called into            question, but on the whole it's a sparkle in the PlayStation's            disappearing tail. No doubt it will sell a lot of PSOne's over the            Christmas period, too.            Release Date - Friday 24th November 2000"}