{"ref": "https://www.eurogamer.net/r-swat3ee", "date": "17 Nov 2000", "game_name": "Reviews", "text": "It doesn't matter who started it, and it doesn't matter who is the            king of the hill at the moment, but what does matter is how            astonishingly fast the tactical action genre has moved forward in            the past couple of years. What began as a relatively niche market            with the likes of Novalogic's Delta Force has now wrapped its            camo-clad fingers around the gaming world, and it isn't going to            let go for the foreseeable future.                    Earlier this year, Sierra recognised that they had a market hole to            fill, and released the third addition to their popular yet somewhat            lacklustre SWAT series of games. Unlike it's predecessors SWAT3 was            a first person shooter, and proved to be a surprise hit. Creeping            up behind the likes of Delta Force and Rainbow Six, it dealt them a            swift blow to the back of the neck and ran off with the crown as            one of the most immersive and brilliantly constructed tactical            titles yet.                    As is usually the case with this type of game, the structure is            mission based, although SWAT3 does offer a vague story to tie it            all together. Set in 2005 during the build up to ~Global Peace            Day~, representatives from every nation of the world have converged            in Los Angeles of all places to witness the signing of the United            Nations Nuclear Abolishment Treaty. It's your job as an LAPD SWAT            officer to do your best to enforce order throughout the city during            this time. The missions you get involved in rarely have anything            much to do with this storyline, but who am I to argue?                    Those of you who remember SWAT3 may be a little confused at the            moment as to why we are reviewing a game which is over six months            old, and indeed what the ~Elite Edition~ tacked on the end of its            title might mean.                    Well, such was the demand from the dedicated SWAT fan base for a            multiplayer mode in SWAT3 that the development team went straight            to work on addressing this deficiency, eventually forming the idea            into a small add-on pack for the original game. This won't now see            the light of day as a seperate product, but Elite Edition is simply            SWAT3 bundled with the multiplayer support and all of the other            additions from that planned add-on.                    The single player campaign is more or less the same as it always            was, but for the benefit of those of you who haven't yet            experienced the game, it is similar to the Rainbow Six series in            feel. As the element leader of a SWAT team, at the start of a            mission you are given a choice of team members and equipment, but            it appears that the extensive armoury is just there to satiate            American gun nuts, because the default weaponry is usually ample.            Avoiding complex planning routines like that of Rogue Spear is a            smart move, as here you just need to pick your preferred entry            point and whether or not you want to go in all guns blazing (which            is usually not very advisable), allowing the player to simply get            on with the perp-nabbing.                    The missions themselves are pleasantly varied, from an assault on a            sniper in a run-down Hicksville cottage to searching for bombs in a            grotty subway while their timers tick away. The Elite Edition            add-on also gives you a further five missions to play with, my            favourite being the gorgeous Chang's Theatre setting, which            features a lovingly modelled cinema.                    The first thing that strikes you is that SWAT3 is a great looking            game, far surpassing anything we've seen from the Red Storm            (Rainbow Six) team to date. Not beautiful in the rolling hills and            green pastures kind of way, but in the intricately detailed gritty            suburban realism kind of way, with wonderfully modelled rooms and            buildings of supreme quality... The level designers and texture            artists have gone to town beyond anything I've seen before.                    It isn't just the graphics which are realistic though. In the            top-left of your HUD is a menu with which you can issue orders to            your team, such as telling them to search specific rooms. Want to            open that locked door? You can't just bust through and kill            whatever is on the other side. Put away your gun, get out your lock            pick, pick the lock, get out your little mirror tool and use it to            peek around the corners for any potential hostility, and then            slowly creep in, not making a sound.                    If you spot a criminal, you can't just shoot on sight and hope that            he drops; you have to call for compliance, perhaps popping off a            couple of warning shots and maybe, just maybe, he will drop to his            knees with his hands in the air so you can arrest him. Yes, you            even have to put handcuffs on him. In a frenzied firefight things            can get incredibly panicky as you try and enforce law ~by the            book~, as opposed to simply mowing the scumbags down while the            bullets ricochet off walls dangerously close to your face.                    Of course, the make-or-break feature of this edition is the new            multiplayer support. Online or over a network, you can play a            choice of either deathmatch or co-operative play, simply by            registering for WON.net (eurgh) and picking a server using the            in-game browser.                    Deathmatch mode plays pretty much as you would expect, a            free-for-all battle for the most frags with the addition of a few            AI controlled opponents just to add to the numbers. These play so            well you can hardly discern between humans an AI. The only problem            with the deathmatch play is that there is very little strategy            involved, and one player with a good connection can sit behind a            box in a room and pick off everybody who comes past. This is not            where SWAT3 multiplayer holds its strength, it's in the co-op mode            where things get really interesting.                    Co-op is exactly like the single player game, except you play with            human team members against AI terrorists. It's really quite            surprising how much having human teammates adds to the game, and            the only improvement I could think of would be to have human            terrorists as well. However, as detailed and wonderful as the            levels and missions are, it still can't come close to the instant            gratification and simplistic gameplay offered by Counter-Strike -            the only real competition for SWAT3's multiplayer mode.                    The netcode in SWAT is surprisingly good though, and I managed to            host a game on a 56k modem with the other players reporting only            very minor lag, which is a testament to the amount of work Sierra            has put into expanding the game.                    Elite Edition is a worthy addition to any tactical action fan's            collection, unless of course you own the original SWAT3 already. If            that's the case, hop over to the            SWAT3 website and you can            download the additional portions in Elite Edition for free!                    With the inclusion of a Software Development Kit in the package,            the door is also wide open for user modifications and new missions            for the game, which should extend SWAT3's life for the foreseeable            future. I couldn't recommend your acquisition of this game any            more."}