{"ref": "https://www.eurogamer.net/r-blairwitch2-pc", "date": "16 Nov 2000", "game_name": "Reviews", "text": "After Terminal Reality's extremely polished Rustin Parr offering            only a couple of weeks ago, I had high hopes for the second in the            series, The Legend of Coffin Rock, but after playing through the            entire game in a solid afternoon I feel rather let down.                         Unlike its predecessor, Coffin Rock has been developed by Human            Head Studios, a third party employed to help speed along production            of the Blair Witch games. Unfortunately, the whole experience seems            to suffer as a result, leaving a sour taste in your mouth.                         If you remember, Rustin Parr was lovingly termed an extension of            Nocturne, the engine upon which the game was based. Like Nocturne,            it used the mythical Spookhouse organisation, giving you control of            a couple of central characters and asking you to investigate the            original Blair Witch mystery. In Coffin Rock, the American Civil            War has just ended, and you take on the role of a dazed and            confused army veteran stumbling around the woods having lost your            memory. A little girl named Robin Weaver finds you and takes you            back to her Grandmother, who tends to your wounds and dubs you            Lazarus.                         However instead of bidding a fond farewell to your newfound            friends and starting a new life for yourself, you are pressed into            helping locate young Robin, who has gone missing in the woods            despite implicit instructions to stay away. Just before you set off            to help find her, you suffer a flashback, which opens up a            Pandora's box of spooky imagery from your life before. Picking up            whatever weapons you can, you scurry off into the woods with the            townspeople of Bukettsville.                    And so the flashbacks continue as you progress through the game.            Unfortunately for you the player though, the quality of the game            rapidly slips downhill. Although I was a little disappointed not to            find myself controlling the now-familiar Spookhouse fellows, the            strong start to Coffin Rock had set a rather pleasant tone, but            once you start playing the game in earnest, it becomes quite clear            that it's little more than a puzzling romp through a forest. And it            really is over in an instant.                         The problems start off quite small, with the way Lazarus' cape            flaps around regardless of where he is as though some temporal wind            were responsible, and they increase in their irritability until you            come up against things like unsurpassable scenery and other easily            rectifiable bugs. The scenery issue is presumably down to Human            Head's unfamiliarity with the technology and occurs in several            places where you find yourself stuck against a bush, but it's a            little bug that could have been quashed effortlessly with a little            more time.                         And with a little more time presumably the game could have been            padded out a little more. Rather like Nocturne's four episodes,            each of the individual Blair Witch games is very short in standard            terms, and would have been so much better cobbled together into one            volume rather than three separate ones..                    It becomes obvious fairly quickly that the flashbacks Lazarus            experiences are used whenever the plot comes up against a dead end.            So if you've been fighting monsters for a while (with your            devilishly efficient military skills that you are supposed to have            forgotten, ho-hum) and you see no further means of progression, the            chances are you're about to keel over and experience another flash            of your memory returning to you. Retrograde amnesia is unusual but            the way in which your memories return to you has never been so            timely!                         Occasionally there is the odd camera angle which proves a little            difficult to get a good view from, and this is made all the more            difficult with the rather clumsy collision detection I mentioned            just now. I dare say if this were engine creators' Terminal            Reality's game these little eccentricities would be ironed out, but            it was not to be.                         Although Human Head seem to have suffered at the hands of the            technology, they certainly know a thing or two about building up an            atmosphere. The trees quiver as if alive to your presence            (technically they probably are, mind) and the whole scene is            dramatically decked out in shades of blue and grey. It's the            eeriest incarnation of the Blair Witch woods yet seen as far as I'm            concerned.                    Of course, the atmosphere is created not only by the sights but            also the sounds, and it's in this department that aside from some            cheesy dialogue things are really impressive. The sound effects            have been sampled brilliantly and have you treading gingerly by the            time you hit the woods proper. By the time a monster of some            description finally graces your screen you're already jumpy and            nervous, and the clattering of stones and crunch of leaves as it            leaps out is nothing compared to the yelp of fear as you leap out            of your skin!                         The whole experience will be no stranger to Nocturne fans (note            the pun, series followers!), but if you are a fan, it will also be            overly in the flicker of an eyelid. In total, the £20 took            five measly hours to complete from start to finish. The save            anywhere option just makes things simpler, and if you use it as            nervously as I did, it removes a little of the tension at those            really exciting moments. The fact that the so-called puzzles barely            impede your progress for a second doesn't help matters.                    Although it looks like Rustin Parr and uses the same technology,            there's none of the flair and precision of its big brother, and            it's decidedly shorter, which isn't great since Rustin Parr was            over too quickly to start with. If you enjoyed Nocturne and Rustin            Parr and are just itching to get something along the same line it            may suffice, but ultimately it's a flash in the pan. Lets hope the            third Blair Witch title bares a little more fruit."}