{"ref": "https://www.eurogamer.net/r-pg3", "date": "21 Oct 2000", "game_name": "Reviews", "text": "It's several years now since the original ~Panzer General~            blitzkrieged its way on to the PC gaming scene, opening up the            turn-based wargame to a whole new audience. Previously the domain            of the hardcore gamer and table-top generals, wargames had never            been so sexy.                    But then came the inevitable flood of sequels and shoddy tie-ins,            including everything from the reasonably good ~Allied General~ and            ~Panzer General II~ through to cringe inducing tripe like ~Fantasy            General~. The franchise seemed to have lost its way, and the ever            growing real-time strategy genre was beginning to make Panzer            General look dated and downright pedestrian. SSI's answer was to            make the jump into 3D with the aptly named ~Panzer General 3D~,            with mixed results.                    And so we come to ~Panzer General III : Scorched Earth~, which            takes the old but still effective Panzer General 3D engine and            shows it some new tricks in the form of atmospheric fog, rain and            snow effects, whilst transplanting the action to the eastern front.            Although American and British units are included for the            multiplayer component of the game, the single player campaigns are            all based around the desperate battles between Nazi Germany and            Soviet Russia, taking you from Germany's drive into Poland in 1939            through to the fall of Berlin in 1945.                    At the heart of the game then are two Soviet and two German            campaigns for the single player, which allow you to take on the            roles of legendary generals of the period such as Guderain and            Zhukov. These include anything from half a dozen up to eighteen            battles to fight, depending on which general you choose to fight            as, and which route you take through their campaign.                    Yes, one of the greatest features of the original Panzer General is            back, and in style. The game features a full ~branching scenario            system~ which gives it an unprecedented amount of replay value.            Your success in each mission has a direct influence on your future            progress through the game, and scoring a ~Major Victory~ by            completing your objectives ahead of schedule is vital to ultimately            win the war. And even after a battle is over you are almost always            given a choice of at least two or three possibilities for your next            mission.                    The end result is that although each of the four campaigns are a            manageable length, you will be encouraged to come back and play            through them over and over again, as each time they will play out            differently, allowing you to see battles which were skipped over            the last time you played the game, or taking you down an entirely            seperate branch of the campaign if you are more or less successful            than on your last attempt.                    The only problem is that the missions themselves are rather            repetitive. The back of the box boasts of ~new victory conditions~            which ~allow for a greater variety of battles~, but at the end of            the day almost all of them boil down to ~take objectives A, B and C            within so many turns~. Sometimes you will also be asked to exit a            certain number of units from a certain road on the far side of the            map, but this is hardly an exciting step forward. The most common            new objective is to destroy certain marked enemy units within the            time limit, but this can become plain annoying when you have routed            the enemy army, and are left frantically searching the entire map            for the last one or two units which you have been told to            eliminate, and which are almost inevitably hidden under a bush            somewhere.                    The entire war is an endless succession of offensives and            counter-offensives, with the occasional strategic withdrawal to            break the monotony. Even these are just offensives in reverse            though, tasking you with exiting a certain number of units from the            far end of the map, and involving fighting your way through enemy            lines but (get this!) heading in the wrong direction. I still            haven't found a single truly defensive mission in the entire game,            and even the few stand-alone missions provided can only be fought            from a single perspective, which is always that of the attacker.                    Battles begin at your headquarters, where you can see a parade            ground with a line of officers waiting for assignment, a tent full            of equipment, and two smaller tents which contain various other            options, allowing you to dismiss officers, clear your roster, save            the game, and view your campaign history.                    Your first task is to customise your army by moving leaders in and            out of your roster and assigning them to a specific unit type from            the equipment tent, whether that is a Tiger tank or conscripted            infantry. Each leader belongs to one of eight classes - infantry,            tank, anti-tank, air defence, recon, artillery, fighter or bomber -            and ideally you should try to match a leader with the appropriate            type of unit. You can, for example, put an anti-tank officer in            charge of a bomber unit if you are short on leaders of the right            type, but they will not be as effective.                    Once you have decided which combination of units and officers you            want to use it's off to the deployment phase, in which you place            your units on the map in any of the highlighted hexes, and then the            battle begins. Controlling your army is a simple case of point and            click. Select one of your units with a single mouse click and            coloured hexes will show you any available targets they can fire at            and locations they can move to. Another click on one of those            highlighted hexes will perform the appropriate action, accompanied            by a short animation as your truck or tank trundles over the 3D            battlefield's rolling hills, or your unit opens fire on an enemy.                    Additional actions are selected by clicking on icons in the            interface bar along the bottom of the screen, allowing you to            instantly select another unit from your army to move next, or to            assign special orders such as setting artillery to provide            defensive fire for surrounding units, telling a bomber unit to fly            in the clouds to avoid detection, or resupplying ammunition. It's            all very easy to get to grips with, but mastering combined arms            tactics and all of the intricacies and quirks of the Panzer General            rules will take you some time. You will also have to take care of            both units and officers, as the best equipment is often in short            supply, and experienced leaders can carry out more actions in a            single turn as they are promoted throughout the game.                    Sadly, although the game itself is fun to play and offers a vast            number of battles to fight and strategies to try out, it does have            some major flaws, from the basic rules of the game through to a            lack of adequate beta testing.                    Perhaps the most annoying aspect of the game is the ~refit~ rule,            which allows any unit not adjacent to an enemy to replace any men            it has lost, although it cannot carry out any other activity during            that turn. What this means in practice is that unless you            completely destroy an enemy unit in a single round, it may skulk            away and reappear a couple of turns later fully repaired. Not            particularly realistic, and not particularly fun either.                    Even worse, sometimes units will automatically retreat a single hex            if they suffer heavy losses in combat, and unless you have the            necessary actions left to follow them they can then simply refit            themselves during the enemy's turn, and you will have to start            wearing them down all over again in the next turn. Needless to say            this can become highly irritating.                    The vast number of battles included in the game has caused some            problems as well, and it looks like not all of them have been            properly tested before the game was released. Descriptions are            missing for a few of the battles, at least one mission suddenly            ends with a ~Loss~ screen at seemingly random intervals, and even            more bizarrely some missions crash back to Windows when you move            your cursor over a particular hex on the battlefield. In at least            one case this hex of death was right next to a major objective, and            proved to be something of a nuisance...                    Mission balancing is also somewhat askew in places, with some of            the battles ridiculously easy if you use a different approach to            the one the designers anticipated. This is particularly common in            missions where you must exit a certain number of units from a road            at the far end of the map, as simply bypassing towns and using fast            moving units allows you to complete many of these missions within            just three or four turns with minimal losses.                    Despite its flaws though, Panzer General III is probably the best            entry in the series since the original. The welcome return of a            massively branching campaign structure, along with dozens of            battles to fight, units to deploy, and officers to lead them gives            an almost unlimited amount of replay value for the lone wargamer.            There are also a small number of stand-alone missions, including a            fascinating ~what if~ scenario which sees Soviet Russia invading            the Reich in 1940.                    The AI puts up a fair fight in most cases, but if you want tougher            opposition up to four people can play over a LAN or the internet,            although sadly the old ~play by e-mail~ option is now gone. A            battle generator can be used to create new scenarios for            multiplayer battles, but unfortunately can't be used to create new            single player missions. You can even lead British and American            armies as well as the Germans and Russians in multiplayer, allowing            you to see what would have happened if Patton had had his way and            rolled right on towards Moscow after the Nazis were defeated.                    At the end of the day Panzer General III provides you with plenty            to keep you busy until the next installment in the series rolls            out, and if you can look past the occasional (though admittedly            serious) bug and the relative lack of variety in mission            objectives, it's well worth a look for hardened wargamers and            newcomers to the genre alike."}