{"ref": "https://www.eurogamer.net/r-spiderman-psx", "date": "19 Oct 2000", "game_name": "Reviews", "text": "Think of all the things you would class as necessary for inclusion            in a Spider-Man game. For me there's web-slinging, henchmen, bank            heists, the Daily Bugle and J.J. Jameson, Dr. Octopus and all of            the rest of his villainous entourage, Venom, Scorpion and the other            famous enemies and above all a classic wrongly-accused plot            centring around poor old Spidey. Well this game has all that and            more.                         The main menu offers you plenty of options; you can start the            single player game, mess around with various setup options, enter            the ~Special~ menu (for cheat insertion, selecting previously            completed levels, credits and changing Spidey's outfit), take part            against the clock in various special tasks or train, with help from            the game. Last but not least, you can view the Gallery (a            wonderfully superfluous feature allowing you to peruse all of the            cutscenes, comics collected, game covers and character models -            with voiceover bio's from Stan Lee!)                         The single player game is obviously the main focus of the action,            and this plot-driven Spider-Man adventure is where you'll rack up            the most time. The story is that Dr. Otto Octavius' speech at the            Science Expo is interrupted and his latest technological invention            stolen, by Spider-Man! Except not, because Peter Parker is busy            reporting on the event from the floor. This impostor isn't the only            thing out of place at the Expo; Parker runs into Eddie Brock,            better known as the human half of the symbiotic Venom! Something is            definitely amiss in NYC, and Spidey has to get to the bottom of it.                    But just as he's racing into action, he discovers from Black Cat            that the New York City Bank is being heisted by the Jade Syndicate,            and sets off to usurp their efforts! The early control system is            easy to master, and there are usefully placed question marks which            when pushed prompt Black Cat to appear and give Spidey a tip on how            to overcome the current situation or how to use one of his            abilities. Leaping from building to building is a simple matter of            taking a leap of faith then holding down R2 to swing until you're            over the next rooftop.                         The Bank Heist is an easy scenario to overcome, basically being a            matter of dispatching the crooks and preventing them from executing            the hostages. If they manage to cap one of the reluctant guests,            it's back to the start of the current section. This is quite easy            to prevent as there's usually only one guard in a position to kill            anyone and a bit of creative crawling on the roof can put you in a            position to deal with him, before removing his friend. The more            difficult sections put you at the disposal of two or more captors            with hostages milling around and only so much web to sling, but            with a couple of retries the method becomes obvious.                         Interestingly, unlike many games of this ilk where you are forced            to replay each and every section until you've learnt the correct            way to deal with it, in Spider-Man you often find yourself in a            position and due to your experiences earlier know exactly how to            deal with it. With a little intuition and careful use of your            arsenal of kicks, punches, throws and web-balls, you can take out            henchmen without losing any health or hostages.                    The level design is very well done on the whole, especially            considering the developers' need to take the third dimension into            account. Spider-Man's ability to crawl on walls and the ceiling is            very important and the levels make good use of this, often            requiring you to think laterally and look up or down and not just            left or right for a solution to your problem.                         However this does lead me to one criticism I have with the game as            a whole. Although the controls aren't too difficult to deal with,            at times the third dimension and the way the camera moves around            you makes it hard to understand which direction the game is            regarding as ~forward~. This isn't too big a deal, but precision            control is difficult.. and it would have been nice to make use of            it.                         On the plus side, it's an absolute treat for fans of the comic or            cartoon. Although you are definitely in a Spidey adventure, at the            beginning of every level you are still given an exclusive            Spider-Man comic cover to represent the adventure and a voiceover            from creator Stan Lee explaining the situation! As well as this,            throughout the game you collect Spider-Man comics; some are obvious            to behold whilst others require a good bit of exploration. Having            completed the game I found I had to crawl back through it with my            eyes on the scenery to uncover the rest, and this certainly added a            decent amount of longevity to proceedings for me.                    What most impressed me about Spider-Man though was not any one            single factor, but just how complete a game it actually was.            Graphically it's about as good as the PlayStation is ever going to            get, with a wide breadth of indoor and outdoor textures and a lot            of high-quality character models, and in terms of gameplay, while            the controls are slightly flawed there's just so much to do and            see, and plenty of sub-objectives to keep you interested. For fans            of the series, too, there are enough fan-specific elements such as            the Stan Lee voiceovers and comic book covers, not to mention the            character descriptions to keep you occupied for weeks.                         The story is hardly original but that doesn't really matter, as in            a sense you are playing out a comic book, and as much as it's about            story it's about recognition of characters and scenarios and the            opportunity to control your hero's path, which Spider-Man offers in            bulk. It's hardly just running in a straight line to the end of the            level either, there are sections where you have to scale the sides            of buildings while avoiding the crosshairs of police snipers, or            rocket launchers, and even levels where you're fighting bad guys on            the top of the NYC subway trains to save Mary Jane! My personal            favourite comes early on, when you've busted in to the upper floors            of the Daily Bugle to save Jameson from Scorpion, and instead of            thanking you, he yells ~Spider-Man? I asked for the Police and I            get this!~ Sublime.                    The game really does the Spider-Man dynasty justice; lets just hope            the lineage continues in quality with the forthcoming PS2 version.            If you own a PlayStation though, don't be daft, get out there and            buy this, now."}