{"ref": "https://www.eurogamer.net/r-thps2-psx", "date": "16 Oct 2000", "game_name": "Reviews", "text": "When Tony Hawk finally reaches the end of his prime, and decides            it's time to hang up his knee-pads and decks in exchange for a            comfy sofa and some of those really warm-looking tartan slippers,            he'll get the chance to sit and reflect on exactly how much of a            legend he truly is. Mr. Hawk is truly the god of baggy-trousered            self-inflicted injury at the expense of skurfing around on wooden            planks, and is surely The One, looked up to by thousands of slacker            15 year-olds the world over (well… at least looked up to by            those little gits with Limp Bizkit t-shirts whizzing round my shins            whilst I go about my business down the town).                         Not only has Tony managed to influence wannabe skaters everywhere,            but he also managed to (with the help of Neversoft, natch)            infiltrate the videogames industry in a supremely stylish and            surprising manner, starring and advising in one of the most            outstandingly playable and addictive games of the last decade.            Obviously not content with appearing in a digital form with his            mates in one millennium, he's popped back in this one to show off            his elite skateboarding skills once more.                         On first impressions, THPS2 proves to be pretty much standard            fare. I was really very concerned as to exactly how Neversoft were            going to revive the formula that made the original so damned fun            without treading the exact same path. Playing for a while on the            free skate mode (with only one level open to me at the start of the            game to practise on, which is a bit stingy really, isn't it?) I got            the idea that although marginally improved graphically and audibly            - blood is spilled, boards fly, skaters fall over far more            impressively, and the general spot sound effects are wonderfully            realistic - not a lot had changed in the basic gameplay stakes.            This wasn't a good start, to be honest.                    Hopping back to the menu screen, I chose to start my career as a            self-styled skater, as opposed to one of the pre-defined            pro-circuit dudes. Once I had managed to find worryingly similar            clothing in the range to what I was wearing at the time, I chose my            skaters stats, which contribute to your player's adeptness at            certain skills and trickery, and once I was happy, I proceeded to            start the game.                         Whilst the first level loaded, I was shown an almost daunting list            of tasks to fulfil in order to gain cash for progression onto the            later stages in the game. Tasks range from bog-standard high-score            acquisition to the collection of a set number of locale-relevant            icons (pilots badges for the aircraft hangar level, hall passes for            the school level… you get the idea). In fact… a great            deal of the game relies on this old-skool gaming idea of icon            collection, and I would've expected Neversoft, in the their            apparent infinite wisdom, to come up with something a little more            interesting to spend you time on.                         Much fun is garnered, however, from trying to locate secret areas            housing mission-critical objectives, and the complete freedom the            player has truly enhances the experience as opposed to the so-far            lacklustre offerings from the opposition.                    And so all is well, right? We get to skate and grind it up and            stuff, yeah? Man? Well… it's not as simple as that. On the            surface, Neversoft appear to have delivered merely an update to            last years smash hit, with apparently hardly any real U.S.P….            until you discover what's inside the wrapper… yes kids, we've            got a level editor on our hands. A level editor!             In a stroke of forethought unmatched by the great majority of            console developers, Neversoft have not only created some of the            most wonderfully detailed architecture for you to grind your way            around in-game, but they're also going to let you construct your            own knee-grazing factory! Furthermore is the fact that it            works, and so, so brilliantly as well. Use of the editor is            so simple it's almost too much so. You're given a blank canvas and            the option of a setting, like a warehouse or a park, then a huge            array of different pieces, which you cycle through using the            shoulder buttons. Complex bowl, half-pipe and rail constructions            are really astoundingly simple to build, and are playable almost            immediately at any stage of completion.                         To say that the ability to build your own levels adds to the            longevity is an overwhelming overstatement, and it's just a shame            that the PSX doesn't have online capabilities for the swapping and            downloading of levels, but not to fear, because the levels are very            economic with memory card real-estate.                    Where Tony Hawk's Pro Skater went wrong, the sequel more than makes            up for its shortcomings. Levels are varied and unashamedly fun,            sound effects are spot-on, graphically the PlayStation is pushed to            its limit, and finding the limit of the secrets and moves on offer            here will keep you playing for months. Add to this the infinite            possibilities of expansion with the level editor, and the            emphatically fun multiplayer modes, and you have a game that is            more than worthy of your money, even if you own the original.                         In some respects, the THPS formula may have lost some of its            sparkle and shine, but Neversoft have made a sterling attempt to            re-emphasising and reviving a game that scarcely put a foot wrong            in the first place.                    This is a beautiful, wonderful, and absolutely life-conquering            beast of a game… it's the supreme champion of extreme sports            gaming, and I just hope that Neversoft don't ruin it by attempting            a further update, because I'm absolutely certain they're simply not            going to be able to follow this up. Enjoy your slippers, Tony; this            is something to tell the grandkids about."}