{"ref": "https://www.eurogamer.net/r-eliteforce-pc", "date": "14 Oct 2000", "game_name": "Reviews", "text": "The Star Trek Voyager series has become a firm favourite with the            Trek fans I know, who have mostly been bred exclusively on the            BBC's Next Generation episodes up until now. Who knows quite what            the attraction is; perhaps it's the abandonment of the Federation            star system security blanket for a more perilous and unpredictable            storyline, or perhaps it's the desirability of a larynjectomised            Starship captain. Or maybe it's just Borg outcast 7 of 9 and her            tight spandex outfit. Actually, I fear it's the latter.                         But whatever your inclination toward Voyager, you cannot fail to            enjoy Elite Force. It's sublime, one of the best single player            first person shooters I've played since Half Life. It's a mite            short, but what you get is so entertaining it's ultimately            forgivable.                         According to the prologue, you are Ensign Munro, be it Alexander            of Alexandria (depending purely upon your gender-bending            preference), second in commend of Voyager's elite Hazard Team,            which has been formed at the behest of Tuvok to help deal with the            most dangerous of missions. Your job is to deal with hazardous away            missions and attempts to board the ship.                         The game is very much like an episode of Voyager. You start out in            the thick of the action aboard a Borg cube fighting to save your            fellow Hazard Team members, and at a suitable turning point in the            action the introductory sequence kicks in, just as though you were            in an episode of the series. Of course, the swab of credits            smattered around the opening are changed subtly to reflect the            game's creators..                    All of Voyager's namechecked crew are present, including Captain            Janeway, Chakotay, Tuvok, Ensign Kim, Tom Paris, 7 of 9, Nelix and            the Doctor along with the usual array of red shirts. All take up            their regular roles on the ship, although unfortunately only a few            if any have their original voice actors. This wouldn't be such big            a deal, but certain characters are very different as a result,            particularly sofa-Trekkers' fave 7 of 9, who seems to have suffered            an involuntary sex change. Another disappointment is Vulcan            super-cool security chap Tuvok, whose usually cunning linguistic            repertoire is done no justice here. I don't know what it was, but a            lot of the lines seemed uncharacteristic.                         The characters do actually look very well done in the beautiful            Quake III engine, and you can see why a certain female character            emerges as Munro's love interest, right down to the way her thighs            quiver as she adjusts something on a tricorder. Ahem.                         When you stop admiring the female player models, you wake up to            find yourself a spectator on the bridge during an attack by an            unresponsive ship, and watch carefully as Janeway gives the order            to fire on it in defence. Its destruction triggers an            isodimensional shift that leaves your heavily damaged ship in a            starship graveyard, held motionless by a dampening field. Repairs            get underway, but scavengers from a nearby ship decide to take the            opportunity to loot you for supplies! The first of your missions is            to dissuade them, which you do with remarkable pizzazz.                         From then on, you have to find a way to escape from your starry            prison cell by making contact with other races and seeking a            peaceful accord. Each mission is laid out for you in the Hazard            Team briefing theatre with Tuvok and Chakotay, before tooling up            and transporting out - the use of the transporter to move between            missions is very adroit, and is a good example of Raven using the            Star Trek universe to their advantage.                    The away missions vary in structure and intensity. Some of the            early ones involve little more than a controlled use of your            weaponry. With frequent health and weapon recharge points littered            all over the place the general slog through the enemy-infested            confines of one early level became very tedious. Thankfully things            open up thereafter with some impressive stealth sections like the            Scavengers mothership (a bizarre collection of different races,            including classic Klingons and Federation crews from the Kirk era            no doubt) and some truly intense battles on Borg cubes and            elsewhere.                         Disregarding completely a lot of the ageing concepts of single            player FPS titles, Elite Force is consistently exciting, and like a            good book the pace and tone of the action varies and the player's            emotional attachment to the characters is very strong.                         One advantage Elite Force does have over a book is the atmosphere            created by its soundtrack. The melodious tingling that accompanies            the creepy missions and the clattering thunder that flanks your            Borg infiltrations is truly inspirational. It ebbs and flows with            the mood of the adventure, too. If you've lost crew members after            an unsuccessful away mission and morale is low, the music is            downbeat and sad, whereas if spirits are riding high, the music            echoes the sentiment.                    Just as with the music, your crew very much contribute to the mood            of the game. If things haven't gone well, you'll hear them abruptly            pause conversations as you reel into the mess hall, shutting you            out, and will exchange glares with you as you pass. The AI of your            marooned brethren aboard Voyager is very well scripted, although at            times it does come apart. Having witnessed the disastrous failure            of the ~buddy system~ in Ion Storm's Daikatana, Raven have decided            that the best approach is to have your crewmates follow you by            default, with heavy scripting. It works surprisingly well, with            none of the caught-on-corners idiocy that dogs many other, similar            titles.                         The only time that the crew comes slightly a cropper is when            trundling around the ship on their daily business. The relaxed            stroll seen on Star Trek is present, but unfortunately, if you have            two crew members walking directly toward one another, they tend to            start walking back and forward horizontally across the deck trying            to pass one another. The sort of comedy normally reserved for busy            city subways on a Friday evening ensues, and not until you butt in            do the two part (shouting at you to get out of their way to boot).                         Regrettably it's not the only flaw that Elite Force has to put up            with. The multiplayer mode (launched through a separate executable)            is quite clever in execution, using the Federation Holodeck to            simulate all sorts of locations, but the gameplay is very slow and            unexciting, even with several players on each team. Although there            are CTF, Deathmatch and Team DM options (the moniker ~Holomatch~ is            used to denote what you and I know as Deathmatch), there really            isn't enough fast paced action and the whole thing smacks of an            afterthought.                         With a little work the multiplay could be fantastic, but Raven's            naïve belief that giving everyone the same weapons wouldn't            spoil proceedings has been disproved. An emphasis on co-operative            multiplay would have been more exciting. Ah well.                    Although it has its flaws and takes little more than a couple of            days to complete, Elite Force is still an exceptionally enjoyable            first person shooter and should not be discounted on the basis of            its length. If you fancy a new first person adventure and already            own Deus Ex, this is the game to buy."}