{"ref": "https://www.eurogamer.net/r-asusa7v", "date": "6 Oct 2000", "game_name": "Reviews", "text": "- ASUSPrice - £125                    Although you may not appreciate it when you shop around Dell, Tiny            and the like, the motherboard upon which your PC is based is            intrinsically important to the future upgrade paths available to            you, and its overall performance. For instance, in times past I've            watched a friend buy high-performance memory and plug it into his            machine, only to discover that his bottom-of-the-range motherboard            doesn't support its lower latencies.                    With the new            Athlon            Thunderbirds now available in a new Socket A form packaging,            many of you may finally dust off the cobwebs and decide to upgrade            the old PC, and who can blame you? But if you intend to upgrade            your PC without fully replacing it, you'll need to consider which            motherboard you opt for quite carefully.                    ASUS are well known for their reliable, glitzy and often            feature-packed motherboards, and the A7V is no exception. It's            noticeably larger than some motherboards, although it should fit            into any ATX case. In terms of features it sports the new VIA KT133            chipset with a heatsink to cool it, an AGPro50 slot with full AGP            4x support, 5 PCI slots (3 of them full length), and even an AMR            slot. This lesser-known acronym stands for ~Audio Modem Riser~, and            it can be used for small modems and other devices, as the board            includes all of the necessary codecs with which to operate one,            reducing the necessary size of the card significantly.                    Alongside the usual couple of ATA/66 compatible hard-drive headers,            there are also two high performance ATA/100 headers. Although many            hard-drives are still incapable of bursting at 66Mb/s to fully            utilize ATA/66, in the future we may come across drives which burst            faster and even stress the included ATA/100 support.                    One of the only downsides to the A7V compared to the ABit KT7-RAID,            its main competitor, is the lack of IDE RAID support. Although it's            an oft-debated point, many people will inform you that RAID stands            for ~Redundant Array of Inexpensive Disks~, and it allows you            (using two identical hard drives) to theoretically double the speed            of your operating system by making efficient use of the space and            speed of both drives. The KT7-RAID motherboard was the first            implementation of this technique using IDE as opposed to SCSI,            where it is commonplace. Although the A7V does not have built-in            RAID support, we do not feel that this is as important as            some people make out, as few people actually use RAID currently. It            does bear mentioning though.                    The board can also handle three 168pin memory DIMMs, so if you can            get hold of good quality 512Mb modules you could run up to a            theoretical maximum of 1.5Gb of memory in here, although many will            stick to the more conventional 128Mb or 256Mb. There's none of your            RAMBUS/MTH nonsense to be found on the KT133 boards, this is proper            SDRAM, and can be run at 66Mhz, 100Mhz, 133Mhz, or any integer in            between by way of the front side bus tweaking.                    Speaking of the front side bus, older Athlons using the KX133            chipset were mooted as having a front side bus of 200Mhz. There was            a lot of confusion surrounding it, but basically instead of simply            registering on the up side of the memory clock cycle, the KX133            used both the up and down sides, doubling the memory bandwidth            throughput and allowing an effective bus speed of 200Mhz.            Thankfully this feature is also retained for new Athlons in the            Socket A form factor.                    As usual ASUS doesn't disappoint in this department either. The A7V            includes an extra back panel allowing a further three USB ports,            bringing the total available to users to five. There's even room            for two more with the appropriate back panel peripheral.                    Overclockers will also be pleased with the A7V. Although again it            slips up in the battle against ABit somewhat, it does have the edge            in terms of breadth of options. Fundamentally the KT7-RAID from            ABit has the upperhand - there's no dithering around with jumpers,            the BIOS can handle all the front side bus and multiplier tweaking            you need (if you have performed the procedure to unlock your Athlon            that is), but unfortunately it's rather light on its FSB options.            There are a few, but not to the degree of intricacy seen on the            A7V, which features options from 95 to 145 in very regular steps,            allowing for any one of a hundred variations.                    In terms of the multiplier, you will have to resort to dip switches            on the motherboard itself to alter this (and the same goes for the            core voltage). To be fair though, if you're installing a            motherboard and CPU are you really going to be that phased by            having to adjust some switches which are clearly explained both on            the board itself and in the manual? I think not. My only crux with            the A7V in terms of overclocking is its core voltages - you can't            set it above 1.85v, which while comfortable enough for most CPUs            may not be sufficient for overclocked models that require just that            little extra juice. Knowing ASUS though, this will be updated in a            BIOS upgrade.                    Speaking of which, the BIOS itself is of the Award Medallion            variety, and includes all of the options that you could want.            Setting up my system using this was a breeze.                    I've now been using the A7V for about a week, and it hasn't given            me any trouble yet. In fact during that whole time I haven't had            one freeze or lock up, which was rather more than a frequent            occurrence with my KT7-RAID I'm sad to say. In terms of performance            there really isn't much to differentiate the A7V from its            competitors, so it comes down to features and price.                    And that's where the A7V really bites down hard. For a performance            board from a reputable manufacturer, the price is very reasonable.            The KT7-RAID retails for some £150 when inclusive of VAT, yet            I picked this up for £25 less. At the end of the day the price            is very important, and this competitive approach makes the A7V the            cheapest of the top performers, and that's quite a feat.                    Ultimately if you need a Socket A motherboard and want something            that will last you the distance there's little to choose between            the A7V and its closest competitor the KT7-RAID. The latter's            eponymous hard drive array feature will decide it for some people,            but for others there's the rock solid stability and reputation of            ASUS, as well as the slightly lower price. Either way it's a good            decision."}