{"ref": "https://www.eurogamer.net/r-rayman2-psx", "date": "3 Oct 2000", "game_name": "Reviews", "text": "What has got no arms, no legs, a            big nose and wears white gloves? Give up? Doh, it's Rayman of            course, and the little guy is back in an all new 3D adventure. It            is nearly a year since the PC release of Rayman 2, and I was            beginning to jut my lower lip in depression at the prospect of it            never hitting the PlayStation.                    Fear not though, Rayman 2 is here on the PSX, and is every bit as            fun, good-looking and downright addictive as it's PC and Dreamcast            counterparts. From 2D platforming to a full 3D environment, Rayman            has come a long way. I had a fear that the switch of environments            would take away some of the charm of the 2D world I had become            accustomed to, a fear that was to be short-lived.                    Rayman once again is the world's only hope, as an evil group of            pirates invade the planet, sapping all the energy from the land as            they go. Rayman begins life locked in a cell at the mercy of the            Robo-pirates, with no magic powers and fading hope. Enter Globox,            Rayman's best friend, who is thrown unceremoniously into the same            cell. Globox hides within his big mouth a gift - Rayman's magic            glove. With jubilance they set about escaping the cell and so            begins the adventure.         For the            uninitiated amongst you (where have you been?) Rayman 2 is a            3-dimensional platform game in the mould of Mario 64. That may make            it sound unoriginal and not worth the cutesy landscapes it is set            on, however, the game is so jam packed full of playability that            whether or not it has all been done before does not even enter the            equation.                    The action is viewed from a third person perspective, with the            ability to sweep the camera to Rayman's left or right to view his            surroundings better. You do have a freelook option accessed by            pressing L1 and R1 simultaneously, but this is a tad cumbersome,            and you find that some jumps are a matter of guess work rather than            judgement. Thankfully this is not something that happens too often.                    Rayman is able to somersault, climb, fly, slide, bounce and even            swing his way around the colourful environments. His ability to fly            comes by virtue of twin quiffs of hair, which he uses as            propellors, though these only serve to slow down a decent rather            than truly fly! Of course the world is not without nasties, and you            will need a weapon of some description. This is where the famous            Rayman glove comes in, firing out energy bolts, damaging any            hapless soul that happens to get in the way. As you rediscover your            lost powers throughout the game, the glove will become ever more            powerful.                    Before embarking on the more difficult levels, you will play            through a couple of simple introductory missions. These not only            introduce you to your fairy friend Ly, but also act as a perfect            tutorial for Rayman's many abilities. Golden squares are dotted            about in the tutorial and throughout the game. When Rayman walks on            one of these Ly pops up and she will divulge some useful            information to you.         Life gets more            difficult once you meet the rather cute Teensies, who have a tough            job deciding who exactly is King of their tribe, and comically            fight amongst themselves! They will eventually transport you to the            Hall of Doors, which is where the game truly begins, and is the            main gateway to all of the levels.                    Throughout every level there are coloured bee-like objects called            Lums. Red lums replenish a small portion of your energy, green lums            will force the game to restart you from the exact spot of            collection, pink lums provide magical swinging abilities and blue            lums provide oxygen when underwater. The most important lums of all            though are the yellow variety. You need to collect as many of these            as you can muster; they will be required as payment to the Teensies            to progress through the gates to later levels.                    If you reach the gates and do not have enough lums, you will have            to revisit previously completed levels to hunt for any you missed!            So it is well worth your while collecting every single one you see,            just to be sure. You will also notice little squeaks for help            emitting from small cages. Fire at these and you release a friend            who will increase your health capacity by way of thanks. At the end            of levels, you may find a Teensie trapped in a cage .. Release him            and he will open up a vortex back to the Hall of Doors, preceded by            a Russian dance of celebration. Hilarious stuff.         The cartoon world of            Rayman 2 is a pleasure to romp around, with the emphasis clearly on            humour. I don't think anyone can fail to laugh at Globox's            rain-dance, or when Rayman rides what look like fuel injected            hermit crabs! The character models and surroundings are solid and            lavished with radiant colours, really pushing the PSX to the limit.                    Rayman himself is beautifully animated, from his bouncing strut to            the deft somersaults as he jumps. Leave Rayman for too long and he            will grab his torso using it as a basketball out of boredom! It is            neat touches like these that keep you coming back for more. Story            sequences using the in-game graphics engine play from time to time,            and apart from being displayed in an overly narrow window, are good            fun to watch and help the story along nicely.                    Music plays a big part in the game, with songs suiting locations            perfectly. The ~Cave of Bad Dreams~ level for example has a really            spooky theme playing throughout, while the initial tutorial level            music has a magical edge to it.                    Spot effects are excellent, ranging from the strange noise made by            the floating bombs to the huff and puff as Rayman carries            something. The voice acting is also good, though the dialogue is a            little staggered at times.         If you are to have            any platform game in your PSX collection, you have got to            have this one. It has all the ingredients you need and more            besides. Excellent graphics and sound, coupled with smooth controls            make this an absolute pleasure to play. Levels are nicely varied,            and the humour from start to finish is a joy to behold.                    One word of warning though, make sure you keep in contact with the            outside world, this game could well have you tied to your TV for            weeks to come! And if your arms and legs start disappearing,            consult a doctor immediately!"}