{"ref": "https://www.eurogamer.net/r-bwrp-pc", "date": "1 Oct 2000", "game_name": "Reviews", "text": "The ~Rustin Parr~ part of the game's title refers to the man at the            centre of the concern, whose background you'll no doubt recall if            you've seen the attrocious (and thankfully unattached) film. Rustin            Parr was a reclusive fellow living away in the hills, and after a            year of voices in his head and visions of an old lady he became            powerless to resist the impulsions planted in his head. Unable to            stop himself, he drove into town and found the nearest child he            could, took him back to his dusty mansion in the hills and strapped            him down in the basement. He collected many more children, and            violently tortured and slaughtered them all, except one, whom he            forced to watch. When all this was done, he freed the boy and            strolled into town, saying that he was ~finished~. The voices            suddenly went away.                         If you base your decision to play Rustin Parr on the recent film            then you've made a mistake. The game in itself is a fantastic            adaptation of the Blair Witch mythos and has nothing to do with a            few teenagers in the woods with a wobbly camera. As Doc Holliday,            you have to head into backwater Burkittsville on the edge of the            woods to investigate for the SpookHouse, and inevitably your            adventure takes you as close to the Blair Witch as anyone can            humanly get.                         BW is very cinematic, right from the off. For those of you who            didn't play Nocturne (and this is a standalone game so it's not            required), it's played from a third person perspective and as you            navigate around the world the camera moves to various fixed            positions for ease of motion. You run or walk around, pick stuff            up, raise and lower your weapons to face enemies and chat to            non-player characters. Cutscenes all take place in-game, but that's            not a concern since graphically the game is very pleasant. There            are scant few areas where I felt playing the game became difficult            due to the camera either, but some people dislike this style of            play. The game can be controlled by various methods, through            combinations of the keyboard, mouse and gamepad, but I had a few            problems with some of them, particularly the point-and-click mode,            which flat out didn't work properly. Clicking on a switch on the            wall (no matter how I tried it) didn't work..                    The pace is quite slow at times, but the atmosphere is painted            thickly (rather unlike the film, which is frankly pants).            You start out with the usual mission briefing at Spookhouse            headquarters before heading off to Berkittsville. Unlike other            games where you'd simply head off to the woods and kill some stuff,            Blair Witch invites you to investigate the town and its occupants.            You book into the local hotel and make a report on your early            findings, before heading off to the diner and meeting some of the            locals.                         These story-building areas are very descriptive, helping to            educate you on the legend's history. You also meet vital characters            who clue you up on the happenings, and treat you sympathetically            thanks to your cover story - that you're a mother whose daughter            has been abducted - perhaps also by Rustin Parr.                         Your investigatory partner The Stranger is surprisingly reluctant            and displeased by the notion of investigating the Blair Witch, the            culpability for which you put down to his inability to ~shoot            anything~ on a mission such as this. Of course, with The Stranger            absent, you discover a lot more than he did and the mysterious            legend slowly unravels around you..                         The in-game antics are sumptuously detailed and interspersed with            cutscenes to advance the plot, as well as some genuinely startling            moments of tense excitement. The first spectral entity I ran across            was quite a shock, and surprisingly believable, thanks to the            incredible capabilities of the Nocturne engine, which still            harbours effects and visuals most other game designers are still            struggling to implement. With full scene anti-aliasing, the            real-time backgrounds and game world is utterly breathtaking.. I            honestly thought it was a pre-rendered world until I discovered            that my torch was casting real-time shadows!                    Although Nocturne and Rustin Parr share an engine in common, Parr            got the better hand with many subtle improvements and bug fixes.            The much hyped flowing capes of the original return, but this time            they seem to avoid clipping into trees and the like so often.            Another area which has received much needed attention is facial            animation, which was absent from Nocturne. Doc Holliday, Stranger            and his pals all have lip-synced mouths, which while far from            perfect are definitely plausible and frequently spot on.                         One of my biggest problems with Nocturne was its system            requirements, which placed the game frankly rather ahead of its            time. Average systems of around 400Mhz with a decent graphics card            and 128Mb RAM should do fine, but anything below will be quite            choppy. On my Thunderbird gaming rig things went swimmingly, with            only a couple of frames dropped throughout the entire game.                         If anything Rustin Parr performs a little better than Nocturne did            on an equivocal system, although I'd put that down to improved            camera angles. A lot of the time in Nocturne the player was forced            right up against the camera, making it very difficult to engage the            enemy and keeping the polycount very high. While there were still a            few awkward positions in Parr, on the whole thing were vastly            improved, and I certainly never found myself racing back to a            comfortable camera position as I had done in Nocturne.. The angles            are much less exasperating, and the camera tends to change            perspectives with higher frequency, meaning you never end up            charging blindly into a horde of zombies.                    Sadly, there is one big crux as far as Rustin Parr goes, and that's            longevity. Like a film or book with a twist in the tail and an            engrossing story-line, you can happily read it again and the odd            bit here or there will make more sense, but you'll never get quite            the same level of enjoyment out of it as you did before. Add to            this the fact that Rustin Parr is over in what seems like an            instant and you have cause for some alarm.                         Choosing Doc Holliday as a main character was a very smart move on            the part of TRI, I'd say. Not because of the female angle - she's            no Lara Croft lads - but primarily because she provides such an            interesting contrast to The Stranger. His no holds barred gorefest            missions in Nocturne were intense and very gripping, but the            woman's touch just wasn't there with some of his female            counterparts, like Svetlana the half-Vampire.                         For example, unlike Stranger who charged into everything with his            guns drawn, Holliday backs off, plots her course with a compass and            hand-drawn map and carefully studies what she sees. Exploring the            woods in Blair Witch is much easier than it was in Germany in the            original game, and as such you get hit by the full, eery impact of            the experience rather than a bunch of marauding werewolves coming            out of an area you thought you'd been over. Considering some of the            new visual effects (like a layer of fallen leaves building up on            certain areas as you stroll through them), the map is an absolute            godsend. Without it the passage through the Blair Witch woods would            be frought with difficulty and more frustrating than            adrenaline-pumping.                    Blair Witch : Rustin Parr is a fun game, and one that will appeal            to anyone who enjoys survival horror. I'm not saying it's for            everyone. Opinions on Nocturne were highly polarized and there's no            evidence to suggest Rustin Parr will be any different, but even            though it's over and done with in a flash, it's still definitely            worth checking out if you fancy a decent romp, and a darn sight            better than those questionable Resident Evil PC conversions to            boot!            Addendum - Since this review we've spoken to Terminal            Reality and discovered that the game is being given an MSRP of            $19.99 in the US, and presumably £19.99 over here. While we            still feel that the game was a little short, this lower price makes            it a much more viable option, and as such we ammend the scoreline            up from 8/10 to 9/10 to reflect this."}