{"ref": "https://www.eurogamer.net/xmen-gbc", "date": "21 Sep 2000", "game_name": "Reviews", "text": "Released as a forerunner to both the highly anticipated PSX version            and of course the equally anticipated film, X-Men : Mutant Academy            on the GameBoy Color was always going to be a cash-in. Activision            must have sat there, realised the money to be had from such a            venture and thrown it at the nearest development farm, which just            so happened to be Crawfish.                         The thing is, this shouldn't have been such a big loss, since            Crawfish are a fairly well respected GameBoy developer, capable of            making decent beat-em-ups out of concepts like this. But sadly            despite their credentials this game is tatty, unadventurous and            bloody easy to finish. In fact you can get the whole way through by            simply using the A button, something of a limitation I think it            must be said.                         If you delve a little deeper, you discover that the charm and            popularity of the X-Men series are totally alien to designers            Crawfish, and the game is a real clanger. None of the charisma of            the series' characters is carried over, and the sprites look fuzzy            and blurred. What the heck happened here?                    To begin the post-mortem, I would like to draw your attention to            the game's ~vital stats~, which look perfectly within order.            There are 11 mutants for you to control (plus a couple of hidden            ones which need to be unlocked), Training, Story and Battle modes            and multiplayer support via the link cable.                         Your favourite mutants are all present, with Wolverine (complete            with the eponymous Adamantium Claws), Gambit and co. all out in            force. The fighters all have basic punch (or claw) and kick moves,            and a ~Rage~ move which is intended to be activated by a stab of            both the A and B buttons together. Bizarrely this is not the case,            in fact I was hard pressed to put this move into operation on so            many occasions that I just gave up after a while and went back to            laboriously slugging away with the A button alone.                         The classic ~best of three~ fighting formula is back, but I never            actually got to the stage where I needed a third more than twice,            such is the terrible AI of your enemies (even though there are            settings for this anything less than the highest just stands there            and occasionally punches the air). Trap your enemy in an            inescapable corner and pound the A button again and it'll soon be            over.                         Of course, Crawfish were responsible for the sublime Street            Fighter Alpha GameBoy rendition, which is what makes Mutant Academy            all the more puzzling. Why is it so terrible? Didn't they think to            test this? Perhaps they did but had to ship it anyway. Bah.                    I certainly remember my training, but it was pointless as the            special moves I learnt by trial and error (because obviously the            flimsy excuse for a manual couldn't possibly list them) pale in            comparison to the ~punch enemy into corner, punch repeatedly until            end of round~ tactic which can be employed no matter what the            circumstance.                         The variety and ingenuity of the special moves seen in Alpha is of            course lacking here. The closest thing you get is the ~Rage~ move.            The only raging thing about it is the fury with which you have to            mash the buttons in order to produce one. None of Alpha's good            points seem to have made it across. There's no combo system            either..                         Story Mode is similarly pointless. I was slightly bemused by the            lack of a story for starters. Text-screens which advance the plot            (supposedly) appeared twice throughout the entire game. Once            during the ladder, and once at the end once I'd defeated Apocalypse            and Phoenix, the game's two bosses. Both characters were then            available as secret characters but of course neither made much            difference to the game.                    One of Mutant Academy's only redeeming features is its Link Cable            support, which finally brings the a GameBoy fighting game into line            with the superior brand of action seen on the Neo Geo Pocket Color            in just about every fighting game released for it. Obviously SNK            Vs. Capcom and its ilk vehemently fart all over Mutant Academy, but            this is the first time it's been employed in a GameBoy fighter and            that's worthy of some note.                         Sadly the gameplay is also worthy of note, but totally for the            wrong reasons. Even with two very similar players the outcome is            based on whoever got the first punch in. It's mindless and totally            ridiculous. The game needed to be held back and play tested            severely, at the moment there's no balance to the proceedings.                         Street Fighter Alpha and basically all of the NGPC beat-em-ups            just destroy X-Men. The gameplay is atrocious, the Story Mode is            falsely advertised and the multiplayer is boring. Even the sounds            are sub-standard. For the most part the blows sound appropriately            beefy when landed, but thanks to the tinny soundtrack and monotony            of hearing the punch sound effect over and over again, I've pretty            much given up on them.                    Sadly, I've now pretty much given up on the whole game altogether.            It's the first fighting title to have put the link cable to use and            that deserves what little credit I'm prepared to give Mutant            Academy, but to be brutally honest, it's the poorest excuse for a            film license I've seen in a long time. Lets just hope the PSX            version is a tad better."}