{"ref": "https://www.eurogamer.net/r-croc-gbc", "date": "15 Sep 2000", "game_name": "Reviews", "text": "Platform games have gone all funny. I'm not talking about your Lara            Crofts and your Mario 64s, I'm instead referring to the proper            two-dimensional side-scrolling platformers of yore, whose            programmers were sadly only in possession of one-track minds. The            most variation on the good old Super Mario franchise we ever saw            back then was the idea of a world map in between levels, and pipes            that actually transported you elsewhere on the same map.            Sickeningly simplistic, yet appallingly addictive seemed to be the            order of the day. Quite how we've managed to go from one extreme to            the other in the space of a decade is up for debate.                         And so we come to Croc, for the GameBoy Color. Croc on the            PlayStation and Saturn was one of the few early answers to the            life-disrupting Mario 64. It was very entertaining and presented a            character with charm and personality, far much more so than others            games of the time like Spyro the Dragon or Crash Bandicoot, which            simply attempted to mimic Mario, and failed unreservedly. Croc was            a cuddly green crocodile, and there was no knocking him.                         Which is why it troubles me so that the most inexcusable            desecration of his character has occurred! It's still Croc, but his            charisma has gone AWOL! Not to mention the controls are.. shall we            say less than eloquent, and for all its 30 environments, magic            carpets and cable cars it's actually dreadfully dull! So what went            wrong?                         Unfortunately Croc gets off on the wrong foot in his new            side-scrolling world (new to him anyway) by having a disappointing            control quirk; he jumps twice as fast as he moves forward. This is            another example (to pull out my introduction again) of the platform            genre shooting from one extreme to another - back in the NES and            GameBoy monochrome days we used to have games where the character            moved twice as fast as he jumped.                    If you make the mistake of hitting the button a few more times than            necessary he leaps all over the place like the Energizer Bunny on            crack. The attack button does likewise; little Croc's bicycle kick            tail poke moves him forward quite a way with each attack, meaning            that should you lose control of his leaping you will die, quite            easily.                         Being innovative is a prerequisite in the GameBoy platforming            genre (which is hardly under-populated now is it?), but there's            little in terms of effectual puzzles or innovation to keep the            player happy here, it's just a dull plod from left to right for a            number of levels. Every once in a while the game degenerates            further into a gatekey-finding exercise, a style of gameplay I            despise even more than plodding from left to right! In a sense it's            worse to be distinctly average at this lark, since then people            start asking why so many new and entertaining innovations are            missing from the mix. Read our            Rayman review            from a couple of months back and you'll find out about a            real 21st Century platform game.                         Visually Croc is just about as average as you could expect judging            from the rest of the game. The character sprite our poor little            reptilian friend is portrayed as is woefully inexpressive, and            lacks the charisma of his 32-bit brother. He slides and he swims in            Croc GBC, that's your lot.                         Croc's rhythmic accompaniment is par for the course and as such            nothing to write home about, with little amongst the smattering of            sound effects worthy of note either.                    While other games require an audience of many hours, we went            through Croc within a couple of afternoons. The level of            interaction with your surroundings is minimal, the occupants of            your game world seem to be dim-witted and incapable of calculated            attacks, preferring instead to enlist the age-old tactic of walking            very slowly towards the enemy, and the plodding, unexciting nature            of the gameplay should have been left way behind at the beginning            of the 90s where it was safe amidst the hordes. At present this be            left well alone and forgotten about until the sequel, at which            point we can deny all knowledge of it and welcome home a decent            pocket incarnation of Croc from Argonaut, who are very good game            designers and presumably just need a prod in the right direction.            Consider this the aforementioned prod."}