{"ref": "https://www.eurogamer.net/r-gp3", "date": "10 Sep 2000", "game_name": "Reviews", "text": "I think it was about three years ago that I first discovered the            dominatrix that was Grand Prix 2. Geoff Crammond's seminal Formula            One racing simulation still stands strong today, although            graphically it's been on the falling edge since 3D card evolution            started speeding up in the middle of 1998. Back in the day it was            all you could do to try and prise me away from Monza and            Silverstone, and the game was so versatile that despite winning            season after season and getting my lap times down to inhumanly low            numbers I kept on playing, chugging away on my P233 until my eyes            bled. Well not literally, I did have some limits.                         As such I've been quietly awaiting Grand Prix 3's arrival with            baited breath. Could Crammond really win us all over again, would I            be able to put up with the 1998 track data, would the new graphics            engine put me off? Thankfully, after an eternity of waiting the            time has arrived to assess the alluring pseudo-sequel for real, and            it has to be said, Geoff has done a simply stunning job of it.                         The ease of use is unheard of - I loaded her up on my uber gaming            rig and the game immediately proposed to decide upon the optimal            graphics settings for me to be going on with. I could alter these            at my discretion if I so wished, but having now tested the game on            several PCs I've come to the conclusion that it hits the spot with            a very small margin of error.                    Graphically Grand Prix 3 is a very impressive beast. The new OpenGL            options look beautiful and really show where a lot of the            development time has been spent. The cars and tracks look like an            extension of GP2, insomuch as they are at the pinnacle of available            graphics technology, again. Each car has been lovingly recreated in            line with the 1998 data Geoff Crammond and his team were supplied            with. Any physical alterations to the chassis since then have not            been included - in a way this is the key to GP3's success; once the            data was selected no alterations or updates were made to it, and as            a result this is the most perfect depiction of the 1998 Grand Prix            season ever seen. EA Sports and co. can go take a running jump            methinks.                         Imagine what Formula 1 looks like on the telly. It looks and            sounds like that, with two flaws. The cars are intricately            detailed, right down to the LCD screen on your steering wheel            (which controls your driver aids and keeps you up to date on            position, number of laps and other important data) and the            trackside bits of bumper and other victims of your swerving antics.            As for the audio, well what can I say? The engine revs, the brakes            screech, the tyres burn and the cars clunk as they crash and burn            into one another. It's a Formula 1 race, and with the volume up and            a decent sound card you will not be disappointed in the slightest.                         It does have its flaws though as mentioned; firstly the pit crew            and track staff are all sprites and look very out of place. I can            appreciate why this step was taken but I would at least have hoped            for the option to have 3D character models. Bah. The other issue is            with the rain. For the most part the weather effects are very            agreeable (and important; you had better learn to take them into            account), with fog and smoke from crashes and the like, but the            rain looks rather disappointing.                         Thankfully though there is only one British Grand Prix, so you            don't have to see it too often. That was a joke incidentally. Oh            shut up.                    Your initial menu screen offers ~Quickrace~ and ~Main Menu~            options, the latter opening up a wealth of new opportunities, but            for the sake of simplicity (and getting into the thick of the            action as quickly as possible), I opted for Quickrace mode.                         Instead of Damon Hill it was David Coulthard I trundled out onto            Monza with for the first time in my lush new surroundings. The            impact of GP3's new visuals is nothing short of breath taking.                         Taking off down the track is easy enough as by default you have            all of your driver aids in play, basically meaning that it's just a            job of steering when required and not getting too crazy with the            accelerator. After a few races you gradually grow away from the            need to be guided and want to make use of the gears and other dials            yourself. The whole system is very clever, in that it can be made            to cater for the needs of the old or new gamer, based simply on            wherever your level of skill falls. As a veteran arriving from            Grand Prix 2 I knew where I was most comfortable and because the            system for controlling aids has remained the same I was able to            deploy them as necessary.                    The rough curbs and bits of debris on the track accentuate the            bumps and grinds in GP3 very well, and the manoeuvrability of the            vehicle genuinely decreases with speed, as logic would dictate.            Hurling your car around like a madman is rather painless with the            entire complement of driver aids on but as you get better it            becomes more important to respect the other cars on the track. If            you nudge one of them, the chances are you might end up in the            gravel trap as well, and that certainly isn't going to help your            cause. Of course, in the context of a real race, if you cause too            much havoc you can be black-flagged..                         Speaking of which, it's about time we took a look at the game            proper. Backtracking a bit you can select ~Main Menu~ from the            opening options, which opens up a whole new kettle of fish. The            first stop has to be the Driver Select screen, where one quick name            alteration is called for.. the enigmatic John Newhouse becomes            Jacques Viellenueve, whose name and image copyright prevent him            being used at all. If you like, you can rename the various drivers            to friends and relations before taking part, it makes no nevermind            to me. I decided for the purposes of testing the crashing physics            previously to adopt the persona of our friendly German chum Michael            Schumacher, but I'll go back to good old Damon Hill in his Jordan            for the time being.                         The menus are easily navigated for what it's worth, and there is            no shortage of options, with all sorts of car tuning and such            available to the budding Formula 1 mechanic in the Workshop area.                    Taking part in a full Formula 1 season in child's play; simply            choose your driver and select ~Championship Season~ from the Race            Types menu. Then you can choose Free Practice, Qualifying or just            dive into the Australian Grand Prix proper. From thenceforth you            are expected to fend for yourself in the cutthroat Formula 1 arena,            by adopting whatever idiosyncratic tactics you believe are            appropriate. The main objective in Grand Prix 3 is of course to            complete a GP season and win using as few driving aids as possible            (no mean feat it must be said, and yes you can attribute the lack            of screenshots showing this daring victory to the fact that I've            only finished half of the races).                         Flicking briefly through the manual for some tips reveals a ~Grand            Prix Veterans Section~ full of tips on how to get the most out of            your F1 car. One of the key tips (which has remained from the days            of GP and GP2) is that you need to concentrate on being quick, not            going fast. The distinction is that being ~quick~ involves the            controlled application of speed around a race circuit. There's            plenty of chat about how tyres work, weight transfer and balance            (over and understeering), the traction circle and other            information, such as the best way to handle wet weather situations.            The manual and guide together is so comprehensive that it fills up            over 150 pages, and it's all well worth reading. One of the great            things is that it's very relevant to your race - if you know the            advantages of oversteer versus understeer you are better equipped            to handle some of the more difficult turns. Reading the manual is            hardly a chore either; it's packed full of interesting and in-depth            F1 information.                    As you can see, Grand Prix 3 is so utterly complete that comparing            it to consumer racing titles like F1 2000 from EA is pointless.            This is on another level entirely; another plane if you will. F1            2000 doesn't let you alter tortion-beam suspension for instance,            does it? It doesn't let you change the length between this screw            and the next one. It doesn't allow you to take a perfectly good            Formula 1 racing car, read the manual for a few days and            second-guess the mechanics on the setup.                         In the years between GP2 and now there have been pretenders, and            it was about time Mr. Crammond dealt the deathblow to those            wannabes. He's done just that - Grand Prix 3 is the best game I've            played all year."}