{"ref": "https://www.eurogamer.net/r-leadtekmx", "date": "31 Aug 2000", "game_name": "Reviews", "text": "- LeadtekPrice - £135         Ever            since NVIDIA defied the 3dfx revolution and blew us away with the            TNT2, it has been something of a two horse race to the top, and the            top don't come cheap - the latest and greatest 3D Prophet II GTS            costs nigh on £300!                    At the speed the industry is moving, the previous graphics            generation isn't particularly outdated but already the so-called            lower-end models such as the GeForce SDR are being yanked off            shelves and relegated to a dusty cupboard, despite their continued            usefulness. As such, gaming has become an expensive business, and            keeping up with the latest evolutions is financial suicide. The            masses have been crying out for a cheaper option.                    Thankfully that void has now been filled by the GeForce 2 MX            chipset from NVIDIA. Fundamentally it is the same core as the            GeForce 2 GTS, and the only notable difference between this card            and its big brother (bigger by £150) is that it has only two            rendering pipelines instead of four. Logic therefore dictates that            it should sit comfortably at around the same mark as the GeForce            DDR, but with all the same features as the GeForce 2 chipset, and a            price tag that won't break the bank.                    The card we are looking at today is the Leadtek WinFast GeForce 2            MX, which at the time of purchase was seemingly the only MX card            available in the UK, via            OverClockers UK. You            can now also pick up GeForce 2 MX cards from other manufacturers            such as Hercules (Guillemot) from all the usual retailers, and as            with the GeForce 2 GTS cards, they all perform to within a few            marks of one another, and as such price is bound to be the main            deciding factor.         Despite the            economical nature of the GeForce 2 MX chipset, there are some            notable anomalies that bear mention. For starters, the chipset can            handle 64-bit SDR / DDR memory, but the only 128-bit memory it can            use is SDR. This is a hellish limitation - just imagine a GeForce 2            GTS using only SDR memory.                    The WinFast is a 128-bit SDR board, although we might see 64-bit            DDR versions later on. And despite the packaging's insistence to            the contrary, the memory is clocked at a mere 166Mhz, the same as            the old GeForce SDR. Oh deary me. The core clock speed, on the            other hand, is at about 175Mhz, compared to 200Mhz of the GeForce 2            GTS and 120Mhz for the original GeForce 256.                    It can push 700Mtexels/sec, which outperforms both the Voodoo5 and            GeForce 256 on paper, but the lack of additional rendering            pipelines limits the real usefulness of this. And in terms of            memory bandwidth it pales in comparison to the rest of the herd,            although like the GTS it is based on a 0.18-micron wafer.                    Ultimately we are looking at a card with a fill rate that is about            50% better than the original SDR GeForce, but crippled by the same            limited memory bandwidth. In terms of real-world performance the            card seems to do about 80% of the job the GTS does with hardware            T&L, and at the price it is certainly reasonable.                    The GeForce MX chipset also has support for TwinView, which is            similar to the Dual-Head technology used in the G400 series from            Matrox, allowing you to use two monitors with a single graphics            card.                    Unfortunately the Leadtek card doesn't take advantage of this            feature, but as the latest drivers from NVIDIA now fully support            TwinView, a card which does is bound to be in the offing. Digital            Vibrance Control (or DVC) is another optional extra which isn't            supported by the Leadtek card, although some other MX-based cards            have this option for use with LCD display panels and the like.                    For a card that is supposedly a budget solution, the Leadtek            WinFast card included quite a few freebies, including a            WinFast-branded copy of WinDVD and some other funky licensed            utilities. Installing the card, as with most AGP graphics cards,            was simple and it fitted snugly into its slot. Visually it is quite            a small graphics solution, with a surprising amount of the sand-ish            coloured PCB left blank, occupied only by the Leadtek logo and            information.                    Once fitted, I booted up and glimpsed the video BIOS, which counts            up the VRAM visually and tries to make itself look impressive.            Unphased by this technical showmanship, I waited for Windows to pop            up and installed the drivers from the Leadtek CD.                    The card was benchmarked against a GeForce DDR, with both cards            tested on a Pentium III-800E system with 128Mb RAM, using Windows            98 and the out-of-the-box drivers rather than NVIDIA's latest            Detonator drivers.                    The popular 3D Mark benchmarking utility showed that the GeForce 2            MX card fell short of the GeForce DDR, with the older card scoring            6932 while the MX scored 6512. I personally find 3D Mark to be            rather too arbitrary these days though, and as such prefer to rely            on the latest games to actually measure real-world performance.            Quake III and its ~demo001.dm3~ timedemo test does the trick            admirably.                    As you can see from these Quake III benchmarks, the MX is holding            its own fairly well at low resolutions, but as the amount of data            needing to be crunched increases its performance falls off            dramatically. At 1024x768 at 32-bit colour (my personal favourite            setting) it can't even muster 40 frames per second, whereas the DDR            GeForce is clocking about 65. The upper echelons are just            unobtainable due to memory bandwidth limitations, causing the MX to            fall flat on its face. As the mass-consumer version of the GeForce            2 GTS it at least needed to beat off the previous year's            competition, and it patently does not.                    I did briefly explore the possibility of overclocking this card,            but even with the memory bandwidth increased to some 210Mhz, the            framerate hardly dithered from its original output.                    The GeForce 2 MX chipset has undoubted appeal with its TwinView            technology and DVC support, and as an all-round budget chipset it            offers a lot of options that its big brother the GTS lacks.            Unfortunately, neither of these features is supported by the            Leadtek card.                    Performance-wise, it can't beat off the GeForce DDR, and as you            increase your resolution and colour depth its memory bandwidth            limitations come to the fore. But with the GeForce DDR still about            £50 more expensive, and the latest GeForce 2 GTS and Voodoo 5            cards on another planet completely, the Leadtek card may just fill            the gap if you are looking for a cheap but fairly capable graphics            card.                    PCI versions are also forthcoming, so if you are stuck in the dark            ages and hanging on to your original setup the GeForce MX could be            just what you were looking for. At the end of the day though, if            you are a hardcore gamer with lots of cash to spend, buy a GeForce            2 GTS - you won't need much else for a long time anyway, and the MX            won't satisfy for long."}