{"ref": "https://www.eurogamer.net/r-icewind", "date": "19 Aug 2000", "game_name": "Reviews", "text": "It's been a long and                 arduous wait for the horde of PC role-players eagerly awaiting                 a sequel to the classic Baldur's Gate, but now some relief can                 be had in the form of Icewind Dale.                    Based on the Infinity Engine which drove Baldur's Gate, and            developed by Black Isle Studios, the brains behind the critically            acclaimed ~Planescape Torment~, like its forebears Icewind Dale is            based on the hugely popular Advanced Dungeons and Dragons Second            Edition game rules, with the computer taking over the laborious            task of Games Master and looking after all of the dice rolling for            you.                    The game's setting and plot have been faithfully re-created from            the popular Forgotten Realms campaign set, and based on the            original Icewind Dale AD&D adventure modules and accompanying            novels by Robert Salvatore. Icewind Dale itself is a frozen and            unforgiving land in the north of the Forgotten Realms, cut off from            the rest of the world by a foreboding mountain range known as the            Spine of the World.                    Your party has travelled to these parts in search of adventure and,            in the spirit of many good adventures, begins in a tavern in the            town of Easthaven. After several small introductory quests, your            intrepid band of adventurers soon move on to more hostile regions            in their journey through the Dale. Each of the six large chapters            in the game are introduced with stylish cut-scenes, accompanied            with a quality narration and a truly epic musical score that            greatly enhances the atmosphere of the game.         Unlike in                 Baldur's Gate and Planescape Torment, where you controlled a                 single main character and other people joined your party as                 you progressed through the game, here you must create all of                 the required members of the party at the start of the game,                 and have full control over each of them from the beginning.                    This initial creation process, involving selection of class, race,            skills and alignment, as well as much dice rolling for stats, is            fairly lengthy, and can be a drag when you are dying to just get            stuck into the game. Each of your party members can also be            customised with a wide choice of clothing and hair colour, and a            stylish portrait selected from a pretty comprehensive range of            choices. More artistic players can even import their own creations            into the game.                    These initial decisions are extremely important however, as Icewind            Dale is very heavy with combat, and building a well balanced party            is essential for a successful adventure. Bad decisions at this            stage can be rectified later by dropping a party member and            recreating them, but the newcomer will then have to start off as a            level one weakling, and will probably be as much use as a third leg            to your more advanced and experienced characters.                    Pre-rolled characters can be selected for people finding this whole            process rather daunting, but it's far more satisfying to build your            own group - your team is a pretty weak bunch initially, but            watching them grow from green adventurers to extensively equipped            monster destroying machines is extremely compelling.         While                 there are plenty of quests and tasks that drive the plot along                 and keep your party busy, most of the game is spent battling                 your way through dungeons and picking fights with the                 residents. These battles are fought in real time, but to be                 really successful you will need to make heavy use of the pause                 button. This gives you time to issue orders, select spells, or                 move a wounded character to safety, making skirmishes quite                 strategically involved.                    The style of combat changes significantly as your team advances            through the game. Early on your characters are pathetically weak            and ill-equipped, and so can take very little damage, making ranged            weapons and fast retreats the best course of action. But as your            party advances through the levels, your spell casters become            magical powerhouses, dishing out massive damage, with your fighters            acting like tanks, with strong armour and lots of hit points, to            keep monsters away from your damage dealing mages. The engine copes            perfectly with this change, and it keeps the combat fresh and            tactically interesting.                    One oddity though is that the monsters don't heal when your party            withdraws and rests, so you can break off, heal up, then dive back            in and pick up where you left off, which is a little unrealistic.            Another problem is the penalty for death, which means a trip to a            priest and a reduction in your resurrected character's            constitution, so that you end up saving the game before a fight and            then reloading as soon as someone falls.         Fans                 of previous Infinity Engine games, such as Baldur's Gate or                 Planescape Torment, will find the point and click interface                 instantly familiar. Your characters are directed about the                 screen with the mouse, with a single click on an enemy                 initiating attacks, and spells selected by clicking on the                 appropriate icon at the bottom of the screen.                    It's not a perfect system - selecting characters and destinations            can be a bit clumsy, and your party often gets confused about which            route to take around certain objects, but its limitations are            easily dealt with, and it doesn't hinder the game significantly.                    While the Infinity Engine hasn't received many new features for            Icewind Dale, there are a few significant improvements that make a            real difference. Most notable is a subtle option to grant maximum            hit points each time a character levels, which negates the            necessity to save the game before levelling up to counter a bad            upgrading dice roll.                    Black Isle Studios have also added greatly to the range of enemies            that you encounter, especially with larger foes like Trolls,            Cyclopses and Ice Giants, which look suitably huge as they stomp            towards your relatively short bunch of adventurers.                    Apart from these changes, nothing visually or operationally is            significantly different from the original Baldur's Gate though. The            game still runs at 640x480, and your characters are still fairly            small and not particularly intricate or detailed. The backdrops are            impressive however, and the large number of dungeons, crypts and            vaults to explore gives a fantastic variety to the visuals.         Icewind Dale isn't an                 earth-shatteringly original game, but the overall package is                 so skilfully crafted that this doesn't matter one iota. The                 combat intensive dungeon romping is fantastic fun, and                 recreates the table top AD&D experience like no other game                 before it.                    Character progression is perfectly balanced, so that battles are            challenging without being too easy or frustratingly hard. The            storyline is a paint by numbers fantasy affair, but really only            serves to link the dungeons and battles together as your party            dives onward, hacking and slashing their way through the land.                    Cleverly the plot always applies itself to the enemies you are            fighting in a way not often displayed by role playing games.            Skeletons have been placed in a crypt to defend their master's            soul, giants are throwing themselves at you to defend their allies,            and this makes things far more interesting than enemies placed in            dungeons simply to get in your way and give you something to chop            away at.                    Baldur's Gate 2 will have to be pretty special to better Icewind            Dale, and role-players have never had it so good.                        -        Baldur's                    Gate II previewBaldur's                    Gate II previewPlanescape                    Torment reviewPlanescape                    Torment review"}