{"ref": "https://www.eurogamer.net/fm3-psx", "date": "29 Jul 2000", "game_name": "Reviews", "text": "Explaining how a tactical RPG works without it            sounding dull is not an easy job. By its nature the game requires            hit points, action points, attack types, defence bonuses,            upgrades… still here? FM3 has this in droves and introduces            it gently step by step through the first few missions in a manner            that leaves you considering the possibilities the game holds rather            than the TV Guide.                         The game is played out on a series of terrains occupied by your            crew, their opponents, and any obstacles the game sees fit to            inject. Set in a typical Japanese future this can be anything from            skyscraper filled cityscapes to dark claustrophobic underground            bases, all displayed in rotatable isometric 3D. During the missions            you progress by making your move and any consequently possible            attack character by character with the enemy then getting a chance.            Movement is handled in chess like fashion, affected by each            Wanzer's characteristics.                         In this we find the strategic core of the game. As characters            progress through the story they gain points for the wanton            devastation they wreak on opponents, these boosting their own            skills as well as providing greater resources for the Wanzers they            pilot. Wanzers are built from individual components for the body,            left and right arms and legs and during battle are randomly            attacked and degraded by fighting. From this it doesn't take a            genius to work out that different body part combinations and            weapons can radically affect a Wanzer's combat style. In the heat            of battle the trick of course is to get the balance right.         One of the most important elements of any RPG is            the story behind it. Front Mission impresses in this department            painting a rich tapestry as it takes your crew around location            after location in the Asiatic, picking up new members along the way            and entwining their histories in the ongoing battle. Developments            are played out using a combination of realtime 3D for action and            static location images overlaid with character graphics for the            weightier conversational moments. It also features impressive (if            sporadic) pre-rendered cut sequences displaying Square's trademark            cinematic style.                         The game does suffer though from the usual fate reserved for            Japanese translations. The dialogue is definitely B-movie grade and            even the most poignant moments can become comical. Sudden emotional            swings and incomprehensible plot twists are prevalent throughout,            denying you any real emotional attachment to Kazuki and his            friends. Irrelevant vignettes designed to round the edges of team            members also plague the middle chapters. Its not uncommon to find            20-30 minutes of dialogue slipped in between battles on topics of            no importance before the momentum eventually gathers toward a            suitably epic finale.         Graphically Front Mission 3 isn't an award            winner, but the Wanzers look good and excellent use of the camera            gives a real sense of scale. Human figures walk and talk beneath            the feet of the towering mecha and can even come up against them on            the field of battle. During combat the overhead landscape view            switches from displaying the opposing sides as sprites to close-ups            in full 3D on the battleground itself, in the case of long distance            attacks giving a split screen showing both parties. The Wanzers            react well to attack with sparks and electrical discharges adding            to the sense of evil satisfaction you feel watching a limb blown            clean off an opponent.                         Topping that are nicely chunky sound effects. The Wanzers stomp            about with real weight and gunshots and explosions sound as they            should do, accompanied by the whirring of gyros and pistons. A            varied soundtrack compliments the action, but it's uninspired by            Square's standards. There's enough music in the game for it not to            become noticeably repetitive, but the synthetic orchestra strings            are easily forgettable.                         A curious addition to all this, almost as if it came as an            afterthought to an already fulfilling game, is a virtual            'internet', explorable at will. Characters can send and receive            email seemingly to no end other than the furthering of their            backgrounds and chatting to people in the bars dotted through the            game reveals password after password to a surprising number of            websites. Ultimately though this section of the game appears            superfluous rather than creating the sense of realism it intends            to. As with real life on a slow connection, waiting for the site to            load from the disc is enough to limit casual browsing.         It can only be the more dynamic visuals that            settled Square on using Front Mission 3 as a launch title for this            type of game in Europe. Its much-praised elder, Final Fantasy            Tactics, (released to date in Japan and America) doesn't boast huge            mecha but does have a more engrossing system for character            development. Time spent tuning Wanzer parts during the earlier            stages of the game is rewarding in battle, but once you've            established a multipurpose squad of machines the only real            expansion to look forward to is the next stamina or weapon upgrade.                         That said, the game does have a curiously addictive quality. The            sequences depicting Wanzer attacks never grow stale and outwitting            opponents through the 70 missions it offers is an enjoyable waste            of the fifty hours it takes. Offering great value for obsessives a            second path through the game with different battles and a different            perspective doubles that. With a little more attention to the            ability to specialise your crew and a more integral use of the            network facility Front Mission 3 would be a true classic as opposed            to the very good game that it is. As a taster perhaps to something            multiplayer in future using the real internet, the 'network' shows            where the series may lead on the Playstation 2.                         If you've avoided tactical RPGs or been put off by previous            lighter offerings such as Vandal Hearts this is an excellent            opportunity to re-evaluate mouse free strategy gaming. Front            Mission's slow pace will not suit all, but without the need to sit            hunched over a PC it does get you thinking tactically from the sofa            with gloriously explosive results.                        - Out Now"}