{"ref": "https://www.eurogamer.net/r-f1wgp", "date": "27 Jul 2000", "game_name": "Reviews", "text": "A heat                 haze shimmers above the dry tarmac. The faces of the team                 members in the pits tell a thousand stories - anxiety,                 excitement, adrenaline pumping fast, and a sweat forming on                 the brow.                    They have done all they can for you the driver. The car has been            tweaked and tuned, with testing proving beyond a doubt that the            performance is much improved. It's all down to you now; the race is            in your hands. Nerves jangle, and a strange feeling of doom comes            over you. The feeling is gone in an instant, returning instead to            full focus to the task ahead.                    One red light blinks, and all the twenty-two cars rev in a            deafening crescendo. All five lights are now beaming down on you,            and you take a moment to recap your tactics.                    The lights disappear... The talking is over, it's time to prove to            the world that you are the new king of Formula One.         Of all                 the genres, I suppose that motor racing games are one of the                 hardest to do anything different with. The problem is that you                 already know what to expect before the game is out of the                 cellophane.                    You can guarantee that you will find seventeen tracks, and that all            will be accurate renditions of the real life F1 circuits. You will            also expect to find the full list of drivers and constructors in            there too. So what exactly moves us to keep buying these games? For            a lot of people, a big love for the sport will be the main            motivator. For others it's the gradual improvement in the look and            control of the games.                    F1 World Grand Prix certainly has looks on its side, starting            impressively with the intro video, although the quality of the            racing action depicted in it does make you wish that the game            itself looked as good. But that's not to say the in-game graphics            are bad by any means.                    From a neat if slightly over complicated menu system you can delve            straight into a full season or a single race. After selecting your            difficulty level, you get to choose both the constructor and the            driver you wish to represent. You may also choose your own name if            you so desire.                    F1WGP features all seventeen tracks, constructors and drivers from            the 1999 season. Why 1999 you may ask? Simply because choosing the            1999 season means that you have a complete season's data ready to            go. And you can relive Damon Hill's harrowing time with the Arrows            team once again!                    A mention should be made here of the tremendous replay system as            well. This little baby records your entire race, which can            then be saved to disk, reviewed at your leisure, but best of all ..            get this, you can actually take control of the car at any point            during the replay! This has so much potential, like learning how to            take nasty corners correctly, or seeing how a change of style might            have won you the race rather than losing it.         To get                 the most out of this game I strongly recommend that you plug                 in the Thrustmaster steering wheel you got bundled free with                 your PC! Seriously though, using a wheel is obviously the best                 way to appreciate the game fully.                    Before the main race itself you can practice on the circuit, attend            the qualifying session, and even have a pre-race warm-up. All of            these steps are optional, and you can go straight into the race if            you so wish, although you will be slung into a random place on the            grid if you do.                    A word of warning with regards to qualifying - regardless of the            difficulty level, you will find it stupidly hard to match the other            cars' times. You very often find yourself beaming with delight at a            particularly well taken lap, only to see that you are way down the            pecking order!                    The cars handle very nicely, with braking, acceleration and            steering all very responsive. Sometimes the braking can be a little            too sensitive, coming to an almost complete stop with the slightest            of key pressure. In the main though, what you ask the car to do, it            does.                    Cornering can sometimes feel a little arcade like, with cars            smoothly taking corners at high speed where you really ought to            have spun off. In fact, as a whole F1WGP feels like it is torn            between being a true simulation and a raw arcade game, regardless            of whether you are in the simulation or arcade mode of play.         The whole look and presentation of F1WGP is top notch. Every            track has been faithfully recreated, with the inclusion of a lot            more surrounding detail than most other F1 games. A couple of            examples of noteworthy scenery are the splendid ferris wheel of            Japan, and the excellent city backdrop of Brazil.                    The cars themselves look terrific, all emblazoned with the relevant            sponsors and team colours. All the action can be viewed from a            variety of different camera angles, the in-helmet camera being an            original inclusion. Another nice touch is the mounted wing mirrors,            which show strikingly good detail of what is going on behind you.            Whether you will have the time to appreciate such extravagance is            another thing.                    Perhaps the neatest of touches though has to be the curbs. Don't            laugh okay, I'm being serious! The curbs start out nice and clean            with their alternate red and white stripes, but as the race goes on            they become more and more blackened by tyre marks from cars running            over them. Completely useless really, but authentic all the same.            Weather effects like rain are also nicely done, causing realistic            visibility problems as the cars in front slice through the surface            water.                    Sound in general is a little disappointing, with the car not quite            getting that irritating wasp-like quality you would expect. The            other cars however sound fantastic as they swoosh past you, and            there are nice touches like the Doppler effect as cars pass you in            the pits.                    Crashes sound pretty unspectacular. Where you would expect to hear            a loud crack of bodywork and shower of gravel, you get a simple            thud and a slight rustle. Okay so the aim isn't to be off the track            anyway, but I at least want to wince when I crash!         At the end of the                 day, does the world really need another Formula One game? With                 Geoff Crammond's Grand Prix 3 just days away from release, and                 the already established F1 2000 from EA Sports, you would                 think another title would be overkill.                    However, what F1WGP gives you is a nice blend of arcade and sim,            which in my mind would be perfect for the uninitiated amongst you            and die-hards alike. The split screen two-player option is also a            bonus, and works extremely well. There is a noticeable dip in            performance, but it's not enough to render the game unplayable.            Also worth noting is that if your graphics card supports T&L            technology you will benefit from effects such as heat haze.                    In F1WGP you have a pretty cool racer on your hands. I only hope            that with all the buzz and excitement surrounding Grand Prix 3, it            doesn't just get swept under the carpet and forgotten.                        Try before you buy! Download the                        F1 World Grand Prix demo (66Mb)"}