{"ref": "https://www.eurogamer.net/kiss", "date": "22 Jul 2000", "game_name": "Reviews", "text": "Games based on old rock bands are generally pretty awful                 - Iron Maiden's ~Ed Hunter~ and Queen's ~The Eye~ spring to                 mind .. unbidden, like some hideous waking nightmare that you                 are unable to shake from your memory.                    The good news is that Nightmare Child is based on the ~KISS :            Psycho Circus~ comic book series by Todd McFarlane Productions (of            Spawn fame), rather than the band itself. You must take on the role            of avatars for the four Elders - the Starbearer, The Beast King,            The Celestial and The Demon.                    Guided by the blind gypsy fortune teller Madame Raven, each of the            avatars must fight their way through their own corrupted Realm to            the Psycho Circus itself, and then on to the twisted dimension of            the Nightmare Child for a final showdown between good and evil.            Along the way they will find the Elders' armour, assembling it            piece by piece until they look just like the comic book            representations of Gene Simmons and friends.                    The game begins in the ruined remains of The Roadhouse, a bar where            you were supposed to play a gig. But then the world ended, hideous            creatures appeared, and you were selected to be avatars for four            immortal beings. Mom said there would be days like this...         Madame Raven appears at the beginning of each new section of            the game, doing her best Mystic Meg impression as she gazes blindly            into her crystal ball and explains what you must achieve,            accompanied by a short fly-through of the level.                    Then it's straight into the action, which starts off fairly gently            to ease you into the game, but soon escalates to a Doom-like            intensity that hasn't been seen in a first person shooter for            years. Hordes of monsters leap out of dark corners, drop from the            ceiling, pour out of holes in the wall, and are generated from            spawners, leading to some real trouser-browning moments.                    The creatures are as twisted as readers of the comic book would            expect. Small clawed creatures scuttle around slashing at your            knees, towering giants smash heavy weights on the ground to produce            shockwaves, and the fat lady doesn't sing (although she does lead            an aerobics class in one level), but instead rips out pieces of her            own intestines to lob at passers-by.                    The ~arachniclown~ is made up of a metallic spider, with the upper            body of a manic clown that fires lightning bolts at you. ~Gasbags~            float around in the air spitting poison at you - shoot one and it            will either explode, or whizz chaotically around the room like a            punctured balloon.                    And to combat these monstrosities you have a suitably bizarre and            over-the-top arsenal. A rusty shrapnel thrower replaces the            traditional shotgun, a whip acts as a powerful weapon as well as a            grappling hook, and exploding jack-in-a-boxes stand in for            landmines. The game's equivalent of the rocket launcher fires            glowing blue balls of energy which explode into an impressive            looking vortex, and can be skimmed along floors with a little            practice.                    Each of the avatars also has two unique weapons - one melee and one            ranged. For example, the Demon can find a mighty axe to swipe at            his enemies with, and a dragon which perches on his shoulder and            breathes fire. The ultimate flamethrower?         All of this frantic action is                 handled by a modified version of the Lithtech 1.5 engine. It                 might not be as sophisticated as the better known Quake 3 or                 Unreal engines, but developers Third Law have certainly put it                 to good use.                    Settings vary from gloomy medieval looking churches and graveyards            to vast hellish factories and the ~morbid mansion~, a stately home            complete with paintings of KISS hanging on the walls. Each of the            four avatars ends up at the psycho circus itself, which has to be            one of the most colourful locations I've ever seen in a first            person shooter, with a blinding array of bright tents, stalls and            banners making a refreshing change from the usual drab and dimly            lit tunnels.                    The real beauty of the game though is that however many monsters            there are on screen at once, the engine manages to keep it all            moving along at a playable frame rate. Add in the colourful            locations, severed limbs flying around, blood arcing gracefully            through the air, and over-the-top weapons effects going off all            around you, and you have a real treat for the eyes.                    The game is also a real treat for the ears, with DirectMusic            support allowing context sensitive music. As the action heats up            the music morphs into faster and more frantic forms, helping to            keep the blood pumping as you fight off the heaving masses of            monsters that the game throws at you.                    KISS fans will be happy to hear that there are jukeboxes scattered            throughout the game which you can activate to listen to well-known            KISS songs, which are often a perfect accompaniment for the            slaughter around you. KISS haters will be even happier to learn            that you can also blow up the jukeboxes to stop the infernal            racket...         As befits the KISS                 license, Nightmare Child is a decidely old school affair,                 harking back to classic games like the original Quake. The                 weapons seem strangely familiar beneath all that make-up, and                 the action is intense and in-your-face, with hordes of                 monsters the likes of which haven't been seen since the days                 of Duke Nukem and Doom.                    The focus on action and wholesale slaughter makes a welcome change            from the new wave of realistic and ~intelligent~ shooters, and the            return to single player mayhem makes it stand out from the more            visceral Unreal Tournaments and Quake 3 Arenas of the gaming world.            It's real back-to-your-roots stuff which is sure to bring a smile            to the face of more experienced (or should that just be old?)            gamers such as myself who still remember the thrill of playing the            original shareware release of Doom for the first time.                    And yet at the same time Third Law have managed to build the game            around an entertaining if slightly cheesy plot, complete with a            series of excellent in-game cutscenes to push the storyline along,            and to introduce new settings and monsters. There are even            console-style end of chapter bosses and puzzle-based battles, where            you will need more than an itchy trigger finger to succeed.         At heart                 Nightmare Child is a rather linear find-the-switch,                 open-the-door, blast-some-more-monsters kind of first person                 shooter, with the emphasis on fast paced action, complete with                 arcade-style health bars for your enemies and end of level                 score sheets.                    But somehow Third Law have managed to take the best elements of old            fashioned pure action shooters and build on them to make something            that is entertaining and nostalgic for us old fogeys, while still            managing to stand up against the rather higher standards of modern            games when it comes to plot and gameplay.                    A highly promising debut for Third Law which is well worth a look            for action fans, whether or not you like KISS."}