{"ref": "https://www.eurogamer.net/croc2", "date": "4 Jul 2000", "game_name": "Reviews", "text": "There seems to be a growing number of console to                 PC conversions happening these days, and Croc 2 is the latest                 of this gaggle of games. And so now it's time for us to find                 out why over a million Playstation owners got in a fuss about                 their very own Mario 64 clone...                    Croc 2 is basically a 3D platformer, but with Argonaut Software,            the British uber-coders behind the Star Fox series, doing the            duties rather than Nintendo. It's more or less standard fare as far            as storyline and basic design are concerned - Croc must help the            Gobbo tribesmen, spread across four Gobbo villages, to defeat the            evil Baron Dante, Croc's nemesis from the first title who was            brought back to life by his minions, the Dantinis.                    The game features ten levels in each of the four villages, which            can be accessed in any order, reducing linearity and boredom. It            also features a merchant called Swap Meet Pete, with whom Croc can            exchange crystals for various items to help him in his quest.         Most of these levels are based around Croc's                 core abilities of running, jumping and slapping nasties with                 his butt (Oof!) and his tail (ker-splat!), as well as basic                 puzzle solving, such as finding keys and treasure chests.                    But, like any game worth its salt, there are a number of twists and            original ideas to Croc 2. Some levels include special objectives,            including one of my favourites in which Croc must roll along atop a            giant snowman's head to reunite it with its decapitated body.                    There are many other variations, such as a mine cart level, a            go-kart and speedboat race, and Croc can even get airborne with the            aid of a hang-glider or hot air balloon. These are spaced well            across the 40 levels, so every third or fourth level features a            nice change.                    And of course no platform game would be complete without its            bosses. After completing all ten stages of a village, Croc must            defeat that village's boss. This can be far from easy, and for a            game aimed at children I was surprised at the difficulty of some of            the levels. However, perseverance will see you through to the end            of the game, where the final boss is a tough nut to crack!         Despite all these things though, some of the                 levels felt a little bare, and can be something of a chore to                 complete. Like a console game, it's not one for extended                 playing, but rather for quick one hour blasts whenever the                 mood takes you.                    To their credit, Fox Interactive have recognised this and tried to            add some spice to the proceedings by introducing the OmniPlay            feature. This involves ~splitting~ the controls between two devices            for dual-player fun - for example, someone can control Croc's feet            by using the arrow keys while the other carries out his array of            moves with a joypad.                    While this sounds like a lot of fun in theory, it would take a hell            of a lot of practice to carry out most of the levels with two            people. To test this, my brother and I split the controls thusly,            and let's just say the co-operation wasn't exactly perfect. I still            have the bruises to prove it. However, kudos to Fox for at least            trying to include a multiplayer element.         As you would expect for a game primarily aimed                 at the younger sector of the market, the graphics are bright,                 bold and bouncy. Croc is clearly defined, as are all of his                 allies and the various nasties, lending a cartoony feel to the                 scene.                    With a 3D accelerator the whole game looks great - smooth polygons            and no noticeable drop in frame rate, even with all 16.7 million            colours. Play it with the Argonaut software renderer though and you            will find things look much grimmer. Laughably poor transparency            effects, slow, jerky movement and a lack of contrast are just some            of the disadvantages you will face.                    However, nowadays the vast majority of the games-playing public has            a 3D card of some sort, and Argonaut can be excused for their            less-than-enthusiastic approach to the software users. And apart            from this oversight, presentation is fairly good the whole way            through the game. Clear, concise menu systems are a breath of fresh            compared to the cluttered systems utilised by other titles in the            genre.                    A console style saved game ~slots~ feature is also in place, much            simpler than typing in big alphanumeric save titles. The whole game            basically bears the hallmarks of a console title which, in essence,            it is. Even the sound effects and music have a bouncy console feel            to them, and I especially like Swap Meet Pete's insane babblings as            you peruse his wares.         I was about to say one million Playstation                 owners can't be wrong, but they're the ones who keep buying                 Tomb Raider games, so the validity of this statement is                 perhaps debatable!                    But although Croc 2 is not going to set the world alight, if you            have a child or a younger sibling, or are indeed yourself looking            for a nice arcade style game to while away some of those summer            days, you could certainly do a lot worse on the PC."}