{"ref": "https://www.eurogamer.net/euro2000", "date": "7 Jun 2000", "game_name": "Reviews", "text": "- EA SportsSystem Requirements -                          Pentium 166 or equivalent                          16Mb RAM                          50Mb Hard Drive space                          4x CD-Rom drive         EA Sports are a bizarre company, with their philosophy of ~If            it's in the game, it's in the game .. but only if we can fit it in            this year.~ They have got into the disorderly habit of releasing            new games annually to cater for just about every sport under the            sun.                    On top of this annual output, they also release games that deal            with specific tournaments. For instance, in 1998 they released            ~FIFA 98~ as expected, but then followed it up with ~Road To World            Cup 98~, which was a smidgeon better but nothing to get excited            about, and then ~World Cup 98~, which was commonly regarded as            their best football game to date. If you were a loyal EA Sports            fan, you would now have spent over £100 on that little lot.            Have these idiots never heard of patches and expansion packs?                    In 1998, that might have been acceptable behaviour, because they            were genuinely improving the games with every new release. ~FIFA            99~ was even better when it was released in late 1998 (I won't even            go into it) and today ~FIFA 2000~ is regarded as the best football            game on the market, so you would have expected that their latest            release, which coincides with this summer's European tournament,            would push back the boundaries even further.                    You would be wrong though, and you would be spending another            £35 to find that out.         Euro 2000 is a great game - I can't say I don't play it avidly            - but it's a horizontal release. In other words, it's not even            progressive; it's just FIFA 2000 with some bits tacked on the end            and a couple of alterations.                    I suppose the most sensible option at this point is to go over            what's new. It's a perfect representation of this summer's            tournament; with each of the teams taking part accurately depicted,            and each of the grounds in Holland where the games will be taking            place included.                    But despite this accuracy, the stadiums are unimpressive. Firstly,            they're not grand enough. This is an international tournament,            almost of World Cup proportions, but this could just as easily be            Rushden Diamonds vs Wimbledon rather than England vs Germany...                    The crowd lining the stadiums takes a backward step too. In FIFA            2000 the crowd weren't all that realistic; they jumped up and down            in an almost comic manner, but they did the job and I thought they            were passable. The only way to describe the crowd in Euro 2000 is            to liken them to the fuzzy effect you get watching television on            Channel 5. They are neither realistic nor unrealistic, just ..            broken.                    The game features Friendly, Euro 2000, Challenge, Golden Goal and            Training modes. The Friendly option is a great way to have a quick            and simple kickabout to get used to the game before moving on to            the more involving full Euro 2000 mode, with qualifiers and all.            The Golden Goal mode is similar, with a sort of ~survival of the            fittest~ element. On hard skill settings you have to make            adrenalin-pumping decisions, either throwing all your weight into            an attack to try and bully the ball over the line, or by playing it            safe and maintaining a solid wall of defenders. You can't have            both.                    My favourite mode in FIFA titles (and this is a FIFA title            in all but name) is the Training mode, as you can turn off fouls            and such. If you want some fun, punt the ball up the field to the            opposing keeper, rush in and knock him down, then deposit the ball            in the net in comic fashion. I never tire of this, sad though it            may sound!         What I get very tired of though is the almost                 heretical devotion to 3dfx that EA Sports exhibit. In this age                 of graphics-card-diversity, the fact that the game performs                 like an absolute dog on anything not equipped by a 3dfx card                 is unacceptable.                    It was ~Ultima : Ascension~, another EA title, that gave me cause            to bring this up previously; I will not re-install my Voodoo 2 into            this machine just to play your bloody software, EA. I own a machine            that I regard as being in tip-top condition - a Pentium III 800E            with a GeForce DDR graphics card, backed up by 256Mb RAM. That            should be far more than just sufficient, especially when your            packaging points out support for my graphics chipset. In fact, your            website extols its virtues!                    The audio saves Euro 2000 from invoking the upper echelons of my            wrath though. I'm a self confessed Des Lynam and John Motson fanboy            when it comes to football coverage, and even though the ramblings            of my favourite footie presenter and commentator are interspersed            by the feverish voice of Mark Lawrenceson and the grey-haired            glitter of Gary Lineker, I'm impressed by the diversity and variety            of their banter, even if I do get rather annoyed by the sampling            Des has been subjected to. ~We're here today for the game between            .. GERMANY and .. ENGLAND~ he says in the computer's staccato            jumbling of his samples.                    Bah, you can't win them all.         If you've already played FIFA 2000 you can                 probably skip this next section, as you will already be                 familiar with how Euro 2000 plays. For the benefit of those of                 you haven't, however...                    The individual player movement and animation is a drastic            improvement over previous examples in the genre, and EA's            inimitable style of game remains. You basically side-foot and            swerve every movement of the ball off the ground, and on the floor            things remain straight. Rather like David Beckham's approach,            except applied to everyone on the pitch rather than just the            man himself. Using a friendly combination of keys, you can            sprint, pass, play a through ball, pass in the air, shield or            shoot.                    Unlike previous FIFA titles your shots are basically instant, and            you have no control over the velocity - a big mistake in my            book. One of the reasons the relatively under-rated ~FA Premier            League STARS~ remained on my hard-drive was the control you had            over the power of your shot.                    Gameplay is fluent, but often frustrating as your players become            fatigued quickly (this is optional, but set to ~on~ by default),            and it's very easy to lose the ball to an opponent, but devilishly            hard to regain it. If you like to feel in control of your game, you            will be aggravated by Euro 2000 for a few days while you grasp the            basics and proceed to the higher skill settings, but it's only on            the highest ~World Class~ setting that things become more            involving, and at that point the computer cheats more often than            not.                    Anyway, new to Euro 2000 is the ability for overhead kicks to be            hit into the ground (new to me anyway), and by the looks of things            strong directional air passes using the default ~pass~ button are            now possible. Controlling midfield aerial battles is no less            distressing, but winning the ball on the floor remains relatively            simple if you harrang the opponent in question enough.         So what's the big problem? A few new bits here and there,                 a bit of gloss with an improved 3D menu system for the summer                 tournament, and a lot of fun to be had by all!                    Absolutely .. but in essence you're paying another £35 for the            same game that you bought before Christmas, except with new players            and stadia, and the same inherent problems. The graphics API            situation remains unsolved, the crowds look worse, and the gameplay            remains a tad uninvolving. It's just not right for EA Sports to            shovel another title on to the gaming table without actually making            any progress. I feel used and abused when I play this game, which            is not very often now.                    As you can probably tell, I'm no stranger to football games, and            aside from Quake 3, the games I regularly play are Euro 2000 and FA            Premier League STARS on the PC, and Sega Worldwide Soccer 2000 and            Virtua Striker 2 on the Dreamcast. I've developed a passion for the            sport in a cyber sense, and I've got the connoisseur's taste for it            now, but unless someone puts a cap on this reprocessed EA Sports            tat I'm going to have to pick up sticks and move to another format            again.                    Either that or I'll buy a second-hand Amiga and play Sensi again.            Not such a bad idea that..."}