{"ref": "https://www.eurogamer.net/dogsofwar", "date": "3 Jun 2000", "game_name": "Reviews", "text": "There he is. Craig                 Charles, ~star of TV's Red Dwarf~, looking all curmudgeonly on                 the back of the ~Dogs of War~ box. He's smiling .. no, he's                 grinning at me. Does he know something I don't?                    Previously entitled Warmonkeys (which is by far a more impressive            title), Dogs of War is a new contender in the 3D real time strategy            battle. The genre is already starting to look rather cramped, and            it would take something mighty special to stand out from the            meandering crowd.                    Set 160 years into the future, the game is set on the small            Earth-colonised planet of Primus IV, where a colony of miners set            up Earth's first outposts. After a successful landing, the            colonists were attacked by the planet's indigenous life, the Mantai            (a sort of cross between dinosaurs and ~Starship Troopers~ style            bugs). But their requests for help were ignored by Earth's forces,            who were instead concentrating on running the newer, more            successful colonies elsewhere.                    The miners learned to fend for themselves until they discovered a            radioactive alloy called SL-18, which allowed them to build strong            armoured weapons and vehicles, helping them to drive back the            Mantai into the inhospitable areas of the planet. Of course, when            the news got to Earth, interest in Primus IV, the colonists, and in            particular SL-18, grew tremendously, and Earth became increasingly            reliant in the exported alloy.                    Eventually, the colonists grew tired of their treatment and managed            to gain control of the planet's communication systems, and            construct an exporting system for themselves. The new Earth Emperor            retaliated by dispatching warships to the planet in order to regain            control. With the money garnered from the export of SL-18, the            miners managed to acquire the help of a sympathetic rebel mercenary            force, called the Warmonkeys, in order to help them fight against            the Earth's Imperial Order.                    As you can tell, it's not exactly the best story in the world, and            it doesn't bode well for what's to come...         On the surface of things, the game is                 beautifully rendered and fairly original. You can manually                 control and rotate the camera to any position you desire to                 get a handle on the action below, and the introductions to                 each mission swoop and rotate the camera over the impressively                 and beautifully textured landscapes.                    The control system is pretty standard-fare for this kind of game            (albeit with a slightly confusing interface, which appears to be            particularly over-complex until you get used to it), but the            inclusion of direct control offers a breath of fresh air.                    What direct control enables you to do is select any member of your            force, be it a soldier on foot or an air-based craft, and control            them in any way you wish using the cursor keys for movement. You            can also see from the unit's perspective in the control console,            which facilitates sniping with the appropriate units.                    With that kind of level of control, you could expect a heady mix of            real time strategy and Quake-style action, Battlezone II style. But            what is actually delivered is a paltry slop of uninspired            point-and-clicking, and clumsy stumbling into enemies and dying.                    Some missions require that you directly control one unit on foot in            order to infiltrate a base, apparently in a stealthy fashion. This            is clearly a mind-numbingly frustrating task to achieve, as you are            forced to navigate from a third-person view, but you can only see            what you are doing in the tiny window in the corner of your screen.            And there's no strafe control. If you are going to include a            feature like this, at least think about it properly...         The missions themselves can appear at first to                 be quite pleasantly varied, and they certainly allow for some                 visually pleasing battles, with ensuing explosions, fireworks                 and missile trails all looking rather pretty.                    The engine also sports a line-of-sight feature, meaning that            instead of blacking out parts of the map until your units discover            them, instead you just can't see enemies until your units are            within sight of them. This means that you can send out recon craft            for discovering areas of enemy activity and patrol routes to plan            your strategy.                    This is a fairly nice touch, but it also has its faults - you can            be trying to snipe in third person mode and be perfectly able to            see your target, but for some unknown reason your man will refuse            to take a shot at him unless you are standing on top of the hill in            full-view of every other enemy within a square mile.                    The targeting system is also suspect. When trying to follow a            trooper across the horizon I took a shot which startled him. He            began to run, but the target remained in place and wouldn't move            until I deselected him as my target and then relocated him. The            game is full of little ~features~ like this which make it something            of a chore to play, especially if you are on a time limit to            achieve a goal.         The AI leaves a fair bit to be desired as well.                 Often units don't respond to your commands at all, and if they                 do they frequently end up doing the wrong thing and die for                 it.                    For example, I directed one of my snipers to simply travel down the            side of the hill that he was picking off enemy units from the top            of, but instead he decided to take a stroll directly into the            middle of a cluster of enemy tanks.                    Another mission involved following a convoy of enemy tanks to            destroy them before they reached their base. I sent two appropriate            units out to follow and destroy them, but once they were in range            they stopped dead and started shunting against each other and            jostling for position to fire at the tanks, whilst the convoy            proceeded to ride home. This was indeed not a Good Thing.         What disappoints me so much about this game is                 the way in which it tries so hard to be an engaging, original                 and humorous, but ends up failing dismally on all counts by                 being frustrating, predictable and utterly unfunny.                    Craig Charles only lends a certain feeling of amateurishness to the            game, particularly so in the mediocre tutorial mission, which helps            in no way to improve your skills for the full game, and only serves            as a vehicle for Mr. Charles' pay cheque.                    I feel sorry for Silicon Dreams, as this title obviously had a lot            of potential. If they were to produce another game with the same            level of graphical detail, but subtracted the pointless voice            ~acting~ license, thought out a gritty atmospheric plot line, and            followed it through with gripping, frenetic battle sequences            without the artificial feeling of this game's highly linear            missions, then I am sure they would have a winner on their hands.                    Better luck next time."}