{"ref": "https://www.eurogamer.net/f12k-psx", "date": "1 Jun 2000", "game_name": "Reviews", "text": "Playstation            Developer:EA SportsPublisher:EA Sports One of                 my ambitions in life is to get inside a Formula 1 car and take                 it for a spin around Silverstone.                    The fulfilment of this dream hasn't happened as of yet. So what            does a speed freak like myself do instead?                    Well I can always try and notch 130mph out of my Honda Accord on            the M25. This would risk both my license and the distinct            possibility of causing a big pile-up.                    Instead, I have to content myself with computer simulations.            Problem with F1 games in the past is that they've never quite            captured the speed and adrenaline rush that GP racing should            induce.                    Does F1 2000 get the heart pumping? Read on.         If                 there's one thing I can't stand, it's a GP simulation                 featuring made up names and car manufacturers. Thankfully F1                 2000 isn't cursed with such an irritant.                    All the driver and manufacturer names from this year's championship            are included. Whether you want to be at the helm of Ferrari's much            improved car, or try and improve Jacques Villeneuve's luck in the            BAR; the decision is yours.                    The first thing that will strike you is the sheer attention to            detail that has been crammed into the game. As you'd expect, all            the 17 circuits are included, with every twist and turn accounted            for.                    Before each race, cars can be adjusted to your own custom            specification. Race strategies can also be planned out. Are you a            one-stop kinda racer, or you going to risk a three-stop strategy?            You have complete control.         From the                 main menu you have a few choices. You can leap straight into a                 'Quick Race', with your choice of track and driver. You can                 even customise the starting grid, rather than beginning the                 race at the back! I recommend you have a quick spin around a                 couple of the tracks to get used to the speed and controls of                 the game. A steering wheel setup would probably be best too,                 but it is perfectly playable on a pad.                    The 'Time Trial' option allows you set up a timed lap based            competition. Choose your own three-letter player name, the lap            begins with your car at full pelt approaching the finishing line.            The object is to complete the lap in as quick a time as possible.            When the lap is complete, your time is registered for the next            person to come along to try and better.                    Next up is the 'Weekend' mode. This allows you to simulate a full            Grand Prix weekend, on any track of your choosing. The mode            features practice, qualifying and race sessions, but without the            stress of a full season tournament.                    Finally, you have 'Championship' mode. This is the full monty so to            speak. This mode is really only for the die-hard fans of Grand            Prix. By default a lot of the damage and penalty options are off.            This is fine, but you won't get the most out of the game. I            recommend you set all damage to on, allow the warning flags, set            the game to hard or expert if you really are a glutton for            punishment, and prepare yourself for a rather splendid experience.         Too many                 GP games look good, but the cars glide around corners rather                 than pitch. F1 2000's cars handle superbly, taking corners                 realistically, with accurate portrayal of suspension. As                 mentioned previously, the game is probably best played with a                 steering wheel setup, as sometimes the braking and                 acceleration can be a tad on the sluggish side on the pad. On                 the whole though, the cars brake hard when you want them too,                 and accelerate out of bends perfectly.                    As in the real sport, it's very easy to spin off with the slightest            of misjudged corners or braking. Once off track, care has to be            taken not to simply wheelspin your way into further trouble.            There's a superb feeling to be close to winning a race, knowing            that your next move could well be fatal. With the 'fault' option            set to on, it can also be worrying that your engine could blow at            any given time. Certainly makes your palms sweat anyway, especially            if you've opted for a full race set over 50 plus laps!                    What about the opposition though? Well, on normal skill mode, you            will find you're lapping them twice in a race. Unless you're into            easy victories, you'll soon be switching to the harder difficulty.            This is where you realise how good the game is. The contention for            corners is brilliantly depicted. When you nip in front at a corner,            don't be surprised to see the computer-controlled cars almost            angrily try to cut you up on the other side.                    Aggression is one aspect of the game, but another is etiquette. An            example of this is when you are coming to lap the tail-enders; they            will wait for a suitable opportunity and move over so you can pass            with ease. Be warned though, just like the real thing you'll get            the odd stubborn driver who simply won't get out of the way. With            the second and third placed cars breathing down your neck, this can            make for some rather exciting moments.         Graphically F1 2000 is splendid. All the                 cars have the relevant advertising logos on them, and look                 superb when sat on the starting grid. There are even heat                 waves coming from the back of the engines! Similarly all the                 tracks are faithfully rendered, with advertising boards                 whizzing past and the stands full to the brim with adoring                 fans.                    All of this goes on at a rate of knots, and you'll be surprised at            how fast the game actually plays. Of course the benchmark for a GP            graphics engine is to have a full race on the Monaco circuit. With            all it's buildings, hills, and of course the famous ship quay, not            to mention the cars themselves; it's a lot for the engine to            handle. But cope with it, it does!                    Sound wise the game is a bit of a let down. The sound of the car            engine is accurate enough, but when you're in the pits, there's no            huge sound of cars souring past. For me a GP game has to be noisy.            It's a noisy sport. However, when you are out on the track with all            the other cars, the cacophony of noise is very well done. Passing            through the tunnel on Monaco is also well represented with the            engine noise echoing as it should.                    There's a nice selection of music tracks that play throughout the            menu options. As you'd expect though, there isn't any in-game            music. What is also sadly lacking is any form of commentary. Apart            from Jim Rosenthal introducing each Championship or Weekend race,            there's no other commentary whatsoever. The only voice you'll hear            throughout the race is your team in the pits, who'll inform you of            such things like how far behind you are from the car in front, or            to request you come into the pits.                    Where's Murray Walker? Where's Martin Brundle? Not in F1 2000            unfortunately.         F1 2000                 certainly gives you a realistic and challenging game of                 Formula One racing. With all the realism settings switched on,                 and a full or half set of laps per race, it's enough to please                 this ardent GP fan.                    The game plays smoothly and at an astonishing speed, with rarely            any dip in frame-rate to note. Even on the processor crushing            Monaco circuit, the game's engine handles things amicably. Cars            handle with satisfying realism, pitching around corners, rather            than gliding. Sometimes braking and acceleration can be a little            sluggish. This can be a tough break at the beginning of a race            where you need decent acceleration to take advantage of a pole            position.                    There are two big areas that let the game down though. As            mentioned, the lack of commentary is disappointing. The simple            calls from your team in the pits, and the sound of the engine,            really aren't enough. I want to hear Murray losing control of his            emotions as you spin off the track, and hear Brundle bore you to            tears with statistics about a particular corner on the track.                    The second and rather huge failing of the game is the split-screen            two player mode. In short, it's unplayable. Even on the less            graphics intensive circuits like Interlagos, the game plods along            at a frustrating crawl. You are left with the 'Time Trial' option,            where you simply try to beat each other's times. This soon gets            boring though. You really need to be able to thrash it out against            each other.                    With all the attention to detail, I find it hard to believe that            these things have been skipped over. That said, it's a superb            single player experience, which will have you commandeering the            television for weeks.                        - Out Now"}