{"ref": "https://www.eurogamer.net/sof", "date": "23 May 2000", "game_name": "Reviews", "text": "Deathmatch oriented games like Quake 3 Arena and Unreal                 Tournament are all well and good, but I am a sucker for a good                 single player romp. So it is with wide-eyed glee that I                 received Soldier of Fortune into my grubby mitts!                    You play John Mullins, a 'consultant' who has been drafted in by            the US government to do the chores that they can't! John is            actually a real-life 'consultant', and was directly involved with            the production of the game. Your mission is simple - track down            four stolen nukes, and eliminate the terrorists that were            responsible for the theft before they can do some serious damage.                    A lone Soldier of Fortune, you will have to be at your most cunning            just to survive. The safety of the world is in your hands .. don't            screw up now!         Soldier of Fortune                 is based on a heavily modified version of the engine that                 powered Quake 2, and those of you who are familiar with the                 workings of that game will be instantly at home with SoF.                    SoF's menu system is very smart looking, and the whole interface            assembles itself before your eyes, in a cool mechanical fashion.            Individual icons depict the various options, and moving your mouse            over them causes a text description to pop up.                    An in-game movie sequence introduces you to the game, before you            are dumped at the mouth of a subway .. which is where the slaughter            begins. Terrorists have taken control of the subway, and are            killing innocent people for the kick of it. Along with your            companion Aaron ~Hawk~ Parsons, you must take the subway back and            eliminate the enemy threat in the first of the ten missions that            make up the game.                    Complete this and you will meet secret operative Sam Gladstone, a            friend from your service days. He runs an innocent looking            bookshop, which hides within an underground mission base. Here you            will be briefed, load up with weaponry, and get hints on your up            and coming missions.                    Once you have read the mission brief, you go to the deployment            screen. Here is where you will select your weapons and combat            items. You are limited in how much artillery you can carry, but are            given recommendations to aid your choice.         To aid you in                 your quest you have a choice of twelve weapons and seven other                 combat items to arm yourself with.                    By default you always carry the ~Pig Sticker~, a standard issue            combat knife which can be great for sneaking up on the enemy with,            or can be thrown at them in secondary mode. Usually this gives an            instant kill, but get ready to switch to something with more bite            if not!                    As you progress through the game, new weapons will be unearthed.            You will be particularly happy once you pick up the ~M202A2 Flash~            rocket launcher. This is always a weapon of choice in any first            person shooter, and SoF's version is a cut above the rest. I found            the weapon I utilised most though was the ~Eagle Eye~ sniper rifle.                    Additionally you can equip yourself with flash packs, grenades, and            plastic explosives. The balance of the weaponry is just right, with            all the guns and items having their own use in different            situations. Some weapons also have a secondary mode - the            flamethrower can also fire a flame grenade for example.                    Another nice touch is the ability to look round the corner. This            allows you to enter sniper mode, and take out the opposition before            they even see you. Another neat thing about this is that if your            holding a weapon in your right hand, and look round a corner to the            left, John will automatically switch the weapon to that side so            that you can shoot.         The                 animation is absolutely stunning, with each enemy having over                 200 motion-captured animations, providing the most realistic                 body movement possible with a variety of death-throes to view.                    Each enemy has 26 different hit locations, allowing you to            accurately target a specific area of the body to take your enemy            down, and it's great to just sit and watch the animations. An            innocent victim may have just got a stray shot to the ankle; he            will then proceed to drag his injured leg behind him as he attempts            to flee. Also amusing is seeing an enemy lose his or her weapon,            and crouch with arms upraised grovelling for their life.                    This depiction of violence in the game isn't for the faint of            heart, with dismemberment being the order of the day. Thankfully            all the gore can be toned down or even switched off completely, if            sprays of blood and severed limbs are not your cup of tea.                    The violence does have you wondering whether you should be playing            this game though. Indeed, you have to question your own ethics when            you quite gleefully blow apart an already fallen soldier, just for            him having the cheek to shoot back at you! If you thought Kingpin            was too violent, then I'm afraid SoF isn't for you...         Raven                 have managed to stretch the Quake 2 engine to the limits.                 Background graphics sit nicely with the action in the                 foreground and, particularly in the case of the Iraq levels,                 look superb.                    The locations are varied but all of excellent quality - from the            cold and icy Siberian levels through to the New York locations.            Effects such as fogging and smoke are excellently done as well,            giving items such as the flame-thrower a realistic look. You may            wish to lower the detail within the game though - I found that even            at 640x480 with default settings the game would slow down in            places.                    The music in SoF is typical dramatic military style, suiting the            mood of the game perfectly, and pumping along with the action.            Never once did I think of turning it off.                    Sound effects are also good, and you will soon be getting            complaints from the neighbours! The weapon effects sound brilliant,            giving all the guns their own individual character. The shotgun            punches out with ludicrous bass, the Talon magnum .44 makes a            monstrous noise, and the Heavy Machine Gun actually caused my empty            mug to vibrate on my desk!                    Yes, sitting outside you could be forgiven for thinking that World            War 3 had broken out in the house of DNM.         It's not                 tremendously original, and it's certainly not the best looking                 first person shooter on the market now, but there is still a                 mountain of fun to be had with Soldier of Fortune.                    There were times where due to lack of health, I was forced into            playing more stealthily, and these moments also happened to be the            most enjoyable. Heart pumping, sneaking round an office building,            knowing that the next move could be my last. Awesome!                    Due mainly to the pretty poor AI though, I found the game to be            pretty easy to beat, even on the harder settings. That's where            multiplayer mode comes in, with straight deathmatch, capture the            flag, assassin, arsenal and team deathmatch modes all included ~out            of the box~. Once tweaked, SoF plays just as well online as Quake 2            does, and it's one hell of a ride.                    Soldier of Fortune is a welcome return to the story driven single            player first person shooter. Just don't take it too seriously eh?                        -                            Jake Simpson of Raven interviewed                    Jake Simpson of Raven interviewed                    Marcus Whitlock of Raven interviewed                    Marcus Whitlock of Raven interviewed            Try before you buy! Download the            Soldier of            Fortune demo (95Mb)."}