{"ref": "https://www.eurogamer.net/rctycoon", "date": "18 May 2000", "game_name": "Reviews", "text": "Rollercoasters,                 essentially, are a curious concept. We go to the little ticket                 box (or if its a pay-at-the-gate theme park, join a queue that                 disappears into the horizon and quite possibly crosses a few                 international time zones), pay an extortionate sum, stand in a                 queue, caged into columns like cattle, then eventually, you                 reach the station, dozens of people bundle off the train and                 disappear out of sight (~Exit the train to your right!~), and                 with a sense of joy and adventure we step onto the train, and                 anticipate what will follow.                    Smooth, fast loops, hurtling drops into psychadelically lit            tunnels, and waterfalls and lasers dancing on every slow uphill            section. Sounds like fun. Immense fun.                    However, what invariably does follow is between 30 seconds            and 3 minutes of being hurtled around corners and loops of varying            intensity, and if you aren't the exact height of 5'11~, you will            find your head and back being battered off the various lumps on the            seat. Then you jerk to a stop back at the station where you            arrived, step off feeling jaded and slightly cheated, and feel            obliged, nay, forced to part with £3.99 for a Souvenir            Photo and/or key-ring from the little shed next door, becase it's a            ~once in a lifetime oppurtunity.~.                    And the theme park makes money from this, because they know we'll            all go on them. We need rollercoasters because we're weak.         Which is why, with some                 glee, I inserted the Rollercoaster Tycoon CD into my drive and                 launched it...                    To give me my own chance to create the next RattleSnake or Space            Mountain beater, something that the customers would love so much            that they would offer themselves up to my park to be slaves, or at            least to purchase an ~I went to Nacho Land and all I got was this            stupid mug~ collector's souvenir. Joy!                    The game is a fantastic piece of work. Several non-coaster rides            are available, including old favourites like merry-go-rounds,            haunted houses, and swinging ships, as well as more modern rides            such as the Launched Ascent Ride (more commonly known as the            PlayStation Ride if you've been to Blackpool). Then there are            water-based rides such as slides and rapids, and go-karts and            mini-cars, and so many other rides I can't be bothered listing them            all...                    You have the freedom to tailor these rides to levels of detail that            border on the trivial, such as the colours of the rails and the            maximum waiting time at the station. But some of these options            prove very important. For example, on some varieties of            rollercoasters (and yes, there are different kinds - inverted            metal, wooden wildmouse, steel mini etc), there are different            launch methods, including the traditional ~kick-start~, the powered            launch (up to 60mph at the start, combine it with a sheer drop for            an extremely intense ride!), and the intimidatingly named but            frankly useless ~Reverse-Incline Powered Launch Mode~.                    And you can actually ~theme~ your park. For example, in the second            mission, Dynamite Dunes, I produced a park with three zones, using            Roman, Egyptian and USA Mining scenery and objects. These can be            researched and placed all over your park, along with trees,            fountains, statues, benches, lamps and litter bins.         Of course, you have                 to ensure that your rides are safe, which is where the test                 mode comes in.                    You see, when I first got the game, I spent around 10 minutes            building a steel coaster, and itching to see the little people            hurtling round on it. I opened the ride and the park just to see            what happened. Big mistake. I had produced a hump near the middle            of the circuit, but unfortunately the train wasn't going fast            enough at the time to clear it, so it simply rolled back down the            hill. Into the path of the next oncoming train. An explosion            followed, and several people saw their vital organs splattering off            in the other direction, as they flew through the air. Not good...                    Of course, as well as making a really thriling coaster, you must            make sure the people aren't too scared to board it. There are three            main coaster ratings - Nausea, Excitement, and Intensity. You have            to ensure your intensity remains between 4 and 6, the Nausea around            2 to 4, and the excitement as high as you can get it!                    And lots of things contribute to this, not just loops and corners.            For example, a coaster over water is more exciting than a coaster            over ground. Coasters going over and under other riders will prove            exciting too. And, of course, speed, duration and turns contribute,            as well as the complex lateral and vertical G-force.         The shops and staff are                 the most disappointing aspect of this otehrwise superb game.                 The staff system is near-identical to the one employed in                 Theme Park, including Handymen, Mechanics, Security Guards and                 Entertainers.                    The main difference is that you can assign jobs to people now.            Handymen in Theme Park, no matter what the state your paths were            in, tended to walk on to the grass and begin mowing. Thankfully, in            Rollercoaster Tycoon you can turn this option off on individual            Handymen, as well as being able to assign ~beats~ to all of the            staff, ensuring every area is well covered.                    Little thought has been given to the shops either, despite the fact            that they are integral to your park's progress. The usual spiel of            placing food and drink, toilets, and souvenir stalls is in place            here, like in Theme Park. However, Information Desks are an            original idea, selling maps, pointing out directions, and providing            umbrellas if it rains.                    Your guests are fickle folk too, who on occaision don't spend            anything in your park and leave after a scant look around, although            if you have placed rides and buildings well, they should look after            themselves. You can follow their thoughts and spending, and even            lift them up and move them to new locations! I tend to punish angry            guests by making a pit in the middle of a lake with the superb            landscaper tool, and dropping them in. [Um .. is that legal? - Ed]         Rollercoaster Tycoon is extremely                 impressive. This one is great for strategy fans, SimCity                 lovers, and anyone hoping to produce the next Disneyland.                 Great work from Sawyer and the team.                    And when you have finished with the original game, why not check            out the website            which, especially for a non-multiplayer game, is extremely good.            You can download new track designs for every kind of coaster and            track ride, made by the game's creator, Chris Sawyer, and even            upload and download custom rides made by other people. Fantastic."}