{"ref": "https://www.eurogamer.net/fireteam", "date": "9 May 2000", "game_name": "Reviews", "text": "- CryoSystem Requirements -                          Pentium 166 or equivalent                          32Mb RAM                          4x CD-Rom drive                          Full duplex sound card                          28.8K modem         FireTeam is a multiplayer only title,            putting the emphasis on getting people to play together in teams.            Playing on your own isn't really possible, and certainly isn't a            good idea if you want a good game.                    The game comes with four basic play modes -        Base Tag: Protect your own base stations while                    destroying your rivals' station(s)                Base Tag: Protect your own base stations while                    destroying your rivals' station(s)                Capture The Flag: Capture and hold the flags on the                    map. Hold more flags for more time to win                Capture The Flag: Capture and hold the flags on the                    map. Hold more flags for more time to win                Gunball: A kind of American football with guns - get                    the ball into the opposition endzone to score                Gunball: A kind of American football with guns - get                    the ball into the opposition endzone to score                Team Deathmatch: Deathmatch with a twist. Kills in                    the first phase generate generate life tokens, these are                    then spent as extra lives in the final phase                Team Deathmatch: Deathmatch with a twist. Kills in                    the first phase generate generate life tokens, these are                    then spent as extra lives in the final phase                            While this isn't a huge list of game types, they are all quite            enjoyable, and certainly the atmosphere generated by playing with            your other team members makes the experience all the more fun.         Since Fireteam is designed for internet play and is aimed at            all types of connection, Cryo have obviously had to work hard on            their net code to ensure good results.                    When the game was shown at British computer games trade show ECTS            last year, there were connection problems from the company's stand,            which didn't bode too well. Thankfully they seem to have worked            them all out.                    The game will initially require you to register your game on their            website, at which point you create your player profile. This can            then be tracked and logged on their game servers so that your stats            are available for all the world to see. Teams also have their            performances logged and available to view, which means that you can            check out the quality of the opposition in advance!                    Once you are signed up, the client can be started. This connects            you to the game server, and presents you with a window from which            you can see what's going on and chat to other players. The usual            join or create game options exist, as does an indication of your            ping in the form of a traffic light system. Green is good, orange            implies you might experience some lag (which I didn't), and red            indicates that it just isn't worth trying...         Once a game is agreed upon by all            the respective players it can be started. The game will then run            and connect to the client to determine what it should be doing.                    Once the game has started, a very special feature of Fireteam kicks            in .. full duplex real-time voice communication. Voice comms            software for games has been around a while, and products like            BattleField Communicator and Roger Wilco have done a great deal to            make real-time voice comms a definite possibility. In fact Shadow            Factor (the company behind BattleField Communicator) have been            bought out by Microsoft, who will use their technology in DirectX            8.                    Cryo have done a great job with their own voice software for            Fireteam, and even with my 56k modem the quality was good and            didn't really impact on the speed of the game. Thoughtfully Cryo            have also included a headset in the box with the game, to ensure            that anyone playing Fireteam can talk to their team-mates.         Seeing that Fireteam is designed with            lower minimum system specs in mind, the level of graphical            intensity is quite low.                    The game features an isometric view of the world, which does make            life a little more interesting when you walk behind something, but            in the main this viewpoint is okay. It does make it a little            difficult to aim your character, which is why the mouse is used in            a point and click style to target and shoot your enemies.                    Detail wise the levels aren't bad, and the regeneration pods look            relatively cool. It is perhaps a little disappointing to find a            game that won't really tax your expensive new Pentium III and            GeForce rig, but the focus is more on gameplay than graphics, and            on the gameplay front Fireteam is more than successful.                    Sound is another slight disappointment, as there is no use of any            3D positional audio. In an isometric world it might have been            useful to identify where sounds are coming from relative to the            player, but unfortunately you're just going to have to have your            wits about you.                    Fireteam was extremely fun to play, even as a newbie, and I would            certainly recommend that you check it out if you fancy some team            based action without having to resort to the domain of the first            person shooter. It's also worth trying if you don't have a high end            PC and super fast net connection, as Fireteam isn't too demanding            on the hardware front.                    One of the greatest things about the game though is the sense of            community. When you start off your status is listed as new, and            instead of taking flak from more experienced players, they actually            help you! I didn't read the manual, which isn't the best idea, and            so I didn't know how to join in the fun. Thanks to the other            players, I was still playing in no time.                    Fireteam is great fun, and a definite case of gameplay over            graphics. With low system requirements and only needing a 56k modem            to achieve results, Cryo have certainly done a good job. Fireteam            is one to check out if you fancy something different.            Release Date - available now"}