{"ref": "https://www.eurogamer.net/wormspinball-psx", "date": "5 May 2000", "game_name": "Reviews", "text": "Playstation            Developer:Team 17Publisher:InfogramesPrice: £34.99         I think of                 pinball, and I think of misspent youth! Even with the advent                 of newer and more complex arcade machines, I would still head                 for the pinball section. Particular favourites are the Harley                 Davidson and Addams Family tables.                    Pinball's transition to the home computer was inevitable. I always            remember a simplistic game called 'Video Pinball' on the ZX            Spectrum, which had me locked in my room for hours. The Commodore            Amiga's 'Pinball Dreams' was perhaps the best pinballer of all            time.        Epic's Pinball was my first            PC silver ball experience, and one that I still have a fondness            for. The Robot level is the best of the bunch, and I now have a            hi-score table which is stupidly hard to get on!                    Worms Pinball, is yet another title in the Worms series. I'm not a            great admirer of the strategy games, but give me a pair of flippers            and I'm happy!                    Does Worms Pinball light up the million, or should it really shoot            again? Read on.         Worms Pinball has                 two tables for you to test your reflexes out on. The first one                 is 'Worms', a tribute to the strategy series itself. The other                 is called World Rally Fever (WRF).                    Before starting a game, you have a number of options available to            you. Under the 'options' menu you can change audio, display and            controller settings. Here is where you also set up from 1 to a            possible 4 player game.                    Within this screen you can also change 'Tournament' on or off. This            mode will even out the awards given to each person in a multiplayer            game. This way no-one gets an unfair advantage. Personally I think            if you're a demon of the silver ball, then you should be awarded as            such.                    Loading and saving settings are also done here, and you can also            view the current hi-scores. These are automatically saved to any            available memory card. Remember those arcade days of getting the            top score, only for the machine to be powered off overnight? Come            back the next day, and everything's back to default! Aargh!                    Not any more!                         Once you've set everything up to how you want it to be, it's                 on with the game. Hitting 'Play' will give you a choice of the                 two tables. It is here where you can change your viewpoint.                    I found the default view to be very off-putting. It's fine when the            ball is in the lower half, but the LED panel at the top of the            table obscures your view. A lot of guess work and sharp reactions            are involved in guessing when and where the ball is going to drop            back down.                    There are four different viewing angles. I found the top down view            to be the best for overall viewing of the table, but the worst for            judging speed and direction. The next option down I found to be            perfect though. Slightly angled, with the top of the table in full            view.                    Once in the game, you will notice that the LED display is a little            hard to make out. The default setting really is quite hard to            distinguish. Have no fear though, as hitting the 'Select' button            will bring the in-game options up. One of these is the opacity            setting for the LED display. Change this to low, medium or high. I            recommend high!                    If things aren't going too well, you can also restart the level            from this option screen too.         One of the keys to the success of a pinballing game is of                 course its realism. Ball movement within Worms Pinball is very                 well done. Important things like ball momentum increasing the                 further down it trickles are catered for nicely.                    The flippers also respond realistically. A gentle click will ping            the ball lazily upwards. A hard click will whack the ball for all            it's worth. When the ball is hit hard up a U-turn ramp, it really            does fly back down. This requires some lightening quick reflexes.                    As with a real-life game, the ball can drift to certain points, and            come to rest. This is where the game's nudge feature come into            play. A nudge can be performed upwards, or from left to right. Be            careful of doing this though, as excessive nudging will cause the            dreaded 'tilt' to occur, and flipper use then becomes void.                    The ball itself reflects nicely as it passes over lights, giving            the impression that it is truly three-dimensional. It hasn't been            lightly done either. Careful viewing of the base of the ball will            show you reflected detail wherever it goes. A nice touch.                    Worms Pinball, like every other pinball game to date still doesn't            do one thing though. There's never a time where the ball actually            leaps about, or hits the inside of the glass. Okay, so that would            be over-the-top realism, but it would be pretty cool.         The most                 obvious attractions of a pinball table are the lighting, sound                 and layout design. No amount of flashing colours can disguise                 a poorly thought out table layout.                    The tables play nicely, I can happily report. Both have a wide            variety of different bonus missions and skill shot rewards. A            favourite on the Worms table is the 'Super Sheep Video Mode', where            you have to guide a flying sheep (!!) across a landscape bombing            enemy worms. All nicely portrayed on the LED panel.                    Tables are full of bright colours and flashing lights, but            everything has been designed to be easy to spot and target. Full            marks for the table design. The WRF table has an added bonus of            more audio assistance than the Worms table too.                    Indeed, the sound is perhaps the most accurate I've heard. The            music for WRF is superbly cheesy, and the announcer is your typical            loud-mouthed racing commentator. Music for the Worms table is            tongue-in-cheek war style. It sticks in your mind for ages.                    The high-pitched 'oh dear' as you lose a ball, and 'bye bye' as you            lose completely, are guaranteed to annoy you on the Worms table            though.         Worms Pinball is definitely an entertaining                 game of pinball, that both looks and sounds like a pinball                 machine should. A huge amount of effort has been made to make                 the game as realistic as possible.                    There is however one big and score affecting flaw, which is simply            the lack of additional tables. There's no denying the quality of            the two tables you get, but at £34.99 I expect a little more            for my money. The game could really benefit from an additional five            or six tables.                    I don't know, maybe there's a way to unlock a hidden table or            something. It's tempting to knock the game's box on the side of the            table, see if maybe another CD drops out!                    Despite excellent overall design, the two tables just won't be            enough to keep you interested in it for long. This unfortunately            confines the game to the occasionally played part of your            collection.                    - Out Now"}