{"ref": "https://www.eurogamer.net/revolt-dc", "date": "18 Apr 2000", "game_name": "Reviews", "text": "Graphically Re-Volt is very impressive. I played the PC version to            death last year and the Dreamcast is a wonderfully complete            conversion. The sense of scale is very precise and your            surroundings feel as though they are the right shape and size.            Unlike other titles of its ilk, the cars don't look out of place            due to their size imbalance. You couldn't mistake them for real            cars, they're definitely R/C. The radio aerial flaps in the wind            and they zoom around with the remarkable acceleration found in real            R/C engines.                         As the cars swish and swoosh through the various environments,            they reflect perfectly on the buffed up wooden floor and project            slight shadows on the way. The lighting is pre-rendered, and the            graphics are hardly Soul Calibur, but Re-Volt is still one of the            better looking Dreamcast titles.         Controlling Re-Volt is an uphill battle at first.            The cars accelerate to full speed very quickly and make it hard to            get ahold of. After a while you get used to the movement and            steering, which is very tight. If you turn to the left slightly, it            turns you on a sixpence very quickly. You have to get used to the            eccentuated steering in order to play Re-Volt with any flare.                         It becomes very clear that the game's controls are deliberately            so, in order to accurately simulate R/C racing. So you can forgive            the learning curve, and besides, once you've overcome the initial            confusion at the tight steering and acceleration, you're right at            home.                         You can control your little cars with either the Analog or D-Pad.            While the Analog gives more precise turning control, the D-Pad is            just as good and you don't have a propensity to accidentally lurch            in the wrong direction. The B button on the pad flicks between the            three different views, X flips your car over should you find            yourself upside down, and the Y button puts you back in the right            direction should you find yourself off the course or unable to            right yourself.                         All the cars have slightly different driving characteristics. Some            are 4-Wheel-Drive, some front, some rear. They all handle with            minute differences, so it pays to pick a single car and learn it            first, then gradually move yourself onto the more advanced vehicles            as you progress.                         Collisions stop your car dead, but the acceleration prevents it            from becoming too much of a hassle. Jumps and landings are handled            very well and the cars bounce and move with speed and physics that            feel appropriate to R/C cars. That's another thing - the physics            are dead on. If you jump off a ramp, you arch and fall in a            realistic manner.         There are several elements of Re-Volt that make            it hard to win at. Firstly the controls, as I've explained, but            also the AI. The cars don't race a perfect race, which is often a            problem in games of this sort, but beating them consistently is            still no mean feat. You'll never pull away so far that you can't be            caught up and overthrown easily. The game balances this out though,            because even if you make plenty of mistakes, you can still win a            race through clever use of the power ups that litter the track.                         Yes! Power-ups! The saving grace of so many a title. Re-Volt has            more than its fair share of power-ups, and unlike            Rollcage,            these are more fairly balanced. Water-bombs, fireworks and the like            can be employed to beat off the computer-controlled racers and hold            them up for a few seconds.                         Even the weapons are appropriate to the setting - you don't fire            machine guns and bazookas at your opponents, you use basketballs            and water-bombs! The only unusual aspects of your arsenal are the            nitro-boost power-up that propells you forward at breakneck speeds            and the ~Tag your it!~ power-up, which places a fuse ticking down            upon you - in order to avoid it blowing you up and slowing you            down, you have to pass it on to someone else, by making contact            with their ride.                    The single player game features single race, championship, time            trial and practice modes. Single race allows you to race any car            that you've uncovered on any track that you've raced on.            Championship allows you to race in any of four cup competitions;            bronze, silver, gold and platinum, to uncover more tracks and cars.            Time trial allows you to try and set high scores and practice            allows you to... practice.                         Another enjoyable option is the Stunt Arena. It's a big, well,            arena with jumps and tricks to complete, and 20 stars to uncover.            Some stars can't be uncovered without the use of more advanced            vehicles and you'll need to learn some new tricks in order to            finish up the rest. This certainly adds something to the game and            it will keep you occupied for hours and hours. The satisfaction you            get from reaching some of the more advanced stars is immeasurable.                         For multiplayer the game offers up to four-player action in battle            tag and racing modes. The frame rate stays remarkably constant,            although in four-player mode there is a fair bit of pop-up,            although that's somewhat understandable.         Re-Volt boasts a lot of replay value. I spent            inumerable hours completing the PC version and felt right at home            again on the Dreamcast. With 5 different single play modes,            including 4 cups and the stunt arena, the game is full of action.            There's even a track editor to create and save your own arenas to            the memory cards. This has to be a first for console games - I            can't remember the last time that a console game included its own            level editing facilities.                         Interface-wise, the game is second to none. The menus are viewed            from within a toy shop, with car selection taking place by            literally choosing cars out of boxes. The tracks are viewed on an            Overhead Projector-like setup and selected via the gamepad.                         As with so much in life, there are flaws. There's a steep learning            curve to contend with, and the frame rate can often drop to            unacceptable levels. The usually rock-hard AI is useless on            user-created tracks, because the AI is specially routed for each            original track. If you make extra tracks, you'd best save them for            multiplayer games with your pals.                    Crazy Taxi is out now, with and Grand Theft Auto 2 is on the            horizon, the Dreamcast will soon be swimming in gimmick-racers.            Luckily for you, the buyer, Re-Volt is unique in its appeal and            surprisingly addictive, and doesn't simply trade off a gimmick. If            you like the idea of R/C racing and don't mind a bit of unrealism,            take a look, you won't regret it!                        - Out Now"}