{"ref": "https://www.eurogamer.net/gt2-psx", "date": "14 Apr 2000", "game_name": "Reviews", "text": "If you're thinking                 that GT2 is going to be a vastly different game to it's                 predecessor, you'll be sadly mistaken. Basically, it's more of                 the same, with the onus firmly on not fixing that which isn't                 broken.                         One of the main differences between the two is the sheer volume of            cars available for selection. Whereas GT gave you something like            250 cars, GT2 gives you a whopping 600! The sheer variety of makes            and models is incredible, with a total of 33 manufacturers            included. 19 of these are European, an area decidedly lacking in            GT.                         GT2 also has a bigger assortment of tracks to hurtle round. There            are 20 normal, and 6 dirt tracks. The dirt tracks really are a            great addition to the road based tracks we're used to. You will            need to choose the proper wheel type for rallying, or just to look            cool in replays! This is done from the wheel selection screen,            another new feature. A total of nine wheel manufacturers are            present.                         The most notable of the game improvements though, has to be the            inclusion of car damage. Collisions and scrapes now have a knock-on            effect to your vehicle's performance. This means you can no longer            simply rush a corner, knocking the other cars out of the way. Darn!         As with the first                 game, GT2 comes in two flavours. The full Gran Turismo mode,                 or Arcade mode. The modes come on separate discs, ensuring no                 annoying disc swapping occurs.                         Gran Turismo mode is the full works. You start life with a measly            sum of money with which to buy your first car with. Make sure you            don't buy anything too powerful, as this will prevent you from            entering some of the preliminary competitions. You require to have            won all GT2's competitions to complete the game.                         Like the first game you have to take a number of driving tests,            which then allow you to enter certain competitions. The higher the            prestige of the tournament, the higher class of license required.            You will also need more powerful cars for the later more difficult            tourneys. Don't upgrade and all you will see is their taillights            vanishing into the distance!                         As you win competitions, so you win more money and occasionally            new cars too. You could splash out on a new set of wheels to pose            around in, or with some cars you can buy spoilers and body kits.                         As mentioned, damage has been incorporated into GT2, and adds a            certain element of risk to everything. It isn't as bad as it seems            though, with the ability to ram your car into a siding at 120mph            merely denting your car. It's designed to hinder your progress            rather than scupper it. I think I'd prefer a little more realism            myself, but it's not a spoiler.         This mode is                 designed for two sets of people. On the one hand, it's for the                 people that really can't be bothered with the complexities of                 the GT mode. On the other, we have the drunken lad's night in                 brigade, purely interested in split-screen maximum                 blur-o-vision!                         You have a huge selection of cars to choose from the beginning. It            really is best to be playing this with two players, if not just for            the quality arguments it produces!                         Choose the track you want to play, and you're away. In two-player            mode, the screen is split horizontally into two. This system works            perfectly. It also provides much amusement when you realise half            way round the track that you've been looking at the wrong half of            the screen!                         You also get to race the dirt tracks. These are fantastic, with            your specially equipped rally cars hurtling around. The handling of            the cars, like with all the tracks, is appropriate, and can provide            some really nail-biting races. Although not the main focus of the            game, the rally sections are far better than most dedicated rally            games out there.         Graphically GT2 is                 identical to its brother. In other words, it still looks                 fantastic! Scenery whizzes by with wonderful realism, looking                 solid and giving the game great depth. The cars themselves                 look superb, with light reflecting off the bodywork and                 windows realistically. All this helps with the heart pumping                 illusion of speed.                         The cars are instantly recognisable; a testament to the sheer            man-hours that it must've taken to incorporate all of these makes            and models. The game looks superb in-game, but wait until you see            the replays - These look like mini-films, and you quite often find            yourself watching them, even if you failed to win the race!                         The sound department hasn't been neglected either. An unbelievable            100 European cars were recorded by the developers at the UK's            Donington Race track. This gives you a superb array of engine            audio, further enhancing the already terrific feeling of being            there. You can almost smell the fumes! Actually, you can if you            scratch the GT mode disc label. Yes, obsessive though it sounds,            they have introduced a scratch and sniff CD!                         Finally, we have the music. For me, this is the one big let down.            The songs on GT grooved and kicked ass, whereas the selection for            GT2 seem to lack that bit of punch. A nice set of tunes for sure,            but not the foot stomping stuff I was expecting.         The purists out                 there will be scoffing down at how similar this game is to the                 original. For me though, giving us more of the same is a very                 good thing. With the splendid variety of cars and tracks to                 select from, this almost makes the sequel worthwhile in                 itself.                         The deciding factor is rather more down to the gameplay underneath            the bonnet so to speak. There's nothing currently around to top the            sheer adrenaline rush GT2 gives you, be it in GT mode or competing            in Arcade mode with a friend. The cars all handle realistically,            and differently, taking a lot of varying skills to succeed.                         There's hours of play time in this monster, stop reading this and            get driving!                        - Out Now"}