{"ref": "https://www.eurogamer.net/dualstrike", "date": "20 Jan 2000", "game_name": "Reviews", "text": "- MicrosoftPrice - about £40        System Requirements -                          P166 or equivalent                          Spare USB port                          16Mb RAM                          10 Mb Hard Drive space                          Microsoft Windows 98         Gamepads            and joysticks have become compulsory tools for the true gamer, with            a joystick or gamepad for almost every genre. But there has been a            shortage of gamepads designed for first-person shooters .. until            now.                    Microsoft has released a new gamepad in their ~SideWinder~ series,            specially designed for first person shooters and action-adventure            games. As with most Microsoft gamepads, this one is very well            designed, comfortable to hold, and extremely easy to install.                    Plug the gamepad into your USB port, restart your computer, and            just run the CD that comes along with the gamepad. Be sure to have            the Windows 98 CD available during the install, because this            gamepad requires a few files from it.                    After that you're all set to go. Of course, you have to calibrate            and configure it first, but you'll do that in a jiff...                    I consider myself a veteran gamer, and especially with first person            shooters.                    Because of this, I have become very attached to playing with the            keyboard and mouse combination. I have tried out a bunch of            joysticks and gamepads which promised to replace the mouse and            keyboard, but unfortunately none of them did. Usually I am            sceptical towards controllers designed specially for first person            shooters, but I decided to give Microsoft's Dual Strike a try.                    It's a very comfortable device which fits right into your hands            (like a glove), and basically there is a button for everything you            will ever need in a first-person shooter. The Dual Strike's unique            feature though is that the right side can be twisted around. In            theory this enchances precision movements like aiming and firing,            while the left hand controls agility and movements like running and            sidestepping.                    The Dual Strike comes with it's own configuration tool called            SideWinder Central, which places itself in the system tray and is            easy to reach. Included with SideWinder Central are 20 pre-defined            game schemes for your favorite games.After I had installed the pad            I was eager to try it out, so I loaded up a few of my favourite            games...                    The gamepad was horrible in this game at first, as it was very            difficult to configure. No Quake 3 scheme comes with this gamepad,            so I chose the Quake II scheme, which proved to be impossible to            steer.                    I decided to try out the ~Unreal~ scheme instead, and suddenly it            was a whole different feeling, and much easier to steer. It was            completely different from my usual mouse / keyboard combination and            felt rather ~unfamiliar~, but after I had played for an hour I            learned to play with it, and even managed to pull off some advanced            tricks.                    After I played Quake 3 for a couple of hours I decided to fire up            Unreal Tournament and try the gamepad out with that.                    Although movement went pretty smoothly it was impossible to aim            with the gamepad. It was pointless to use weapons such as the            sniper rifle with it, because by the time you have taken aim your            opponent has already killed you.                    I was interested to try out the gamepad with a third person game            too, so I loaded up Mucky Foot's third person action-adventure            game, Urban Chaos.                    The ~Unreal~ scheme wasn't too good in this game, and I couldn't            find any other scheme which worked any better. I couldn't configure            the game properly either, as there were a couple of buttons which I            couldn't bind.                    I had to play with the default settings (which were pretty lousy),            but I didn't have too many problems with movement, combat etc.            After a while it was comfortable to use the gamepad for this game,            and despite the configuration problems combat was fairly easy.                    With a comfortable and beautiful design, the Dual Strike is one of            the better gamepads around. But it is still very hard to use in            some first person shooters, such as Unreal Tournament, especially            when it comes to aiming.                    Unfortunately, I found it too hard to play with this gamepad, no            doubt because I've played with the mouse and keyboard for way too            long to change. If you're new to the first person shooter genre            though, I certainly recommend that you try this gamepad out.                        -                            Dual Strike competition                    Dual Strike competition"}