{"ref": "https://www.eurogamer.net/resident-evil-7-biohazard-review-7", "date": "23 Jan 2017", "game_name": "Resident Evil 7: Biohazard", "text": "Two decades since players first stepped over the threshold of the Spencer mansion, Resident Evil has rediscovered the peculiar thrill of opening a door. Among the original game's most distinctive flourishes are its unearthly, cutaway room transitions: doors gliding through darkness, their jaws creaking open to engulf you. Resident Evil 7 draws on vastly different design traditions - many of which it sadly struggles to build on in any significant sense - but at least to begin with, its doors give off a comparably eerie vibe. You'll nose against them tentatively, feeling for the chink of a lock, the pickled paintwork glistening under your flashlight in a way series creator Shinji Mikami could only have dreamed of back in 1996. You'll nudge them ajar and pause, ears pricked for a reaction, eye trained on a sliver of mantelpiece or desktop. If you're making use of the game's slightly ramshackle but quite impressive PlayStation VR support, you might physically crane your neck around the frame. Then - after checking your ammunition and, perhaps, reshuffling the weapons you have mapped to the D-pad - you'll sag forward into the room, angling to place your back to a wall as you scan its invariably grim contents: the fizz of a CRT screen in a corner, flyblown pans of meat, the frayed aurora of a bloodstain. Encountering nobody, you'll spin on your heel to appraise the corridor you've just left. Nope, no obvious signs of malicious intent. Returning your attention to the room, you'll take another few steps forward and slowly breathe out. Then the door will swing shut behind you with the gentlest of clicks, and you'll throw the controller at the ceiling.Resident Evil 7 is, in its way, as much a grab-bag of influences and themes as the would-be series capstone, Resident Evil 6, a game that set out to merge every form Resident Evil has taken over the years into one, ungainly whole. The first-person perspective and lumbering character movement evoke F.E.A.R. and Condemned (narrative designer Richard Pearsey's credits include two of the former's expansion packs), while the dreadfully greasy and emaciated art direction calls to mind the Amnesia series and Resi's ancient rival, Silent Hill. Resident Evil 4's crowded encounters are a distant memory, but there are shades of its frenzied risk management in combat - you can target the limbs of certain enemies to stall their attacks, or aim for the head (or whatever most resembles a head) in the hope of a swift, ammunition-conserving finish.Where the sixth game couldn't decide which of its strands to prioritise, however, the seventh has one unifying goal: to revive something of the original's haunted house, that baroque labyrinth of statue puzzles and blind corners which was among the first videogame environments to really play with the possibilities of a 3D plane. In this regard, Capcom is onto a winner. Resident Evil 7's setting is the Spencer mansion with a hearty dash of Southern Comfort, a dilapidated manor sweltering in the haze of backwater Louisiana. It's a delightfully textured backdrop, with its peeling wallpaper, rickety balconies and corridors laced with rot and memorabilia, but the key draw is that it's a single, believably joined-up environment that encloses the majority of the game's 12-hour plot. That's a recipe for intrigue and suspense, whereas Resident Evil 6's scattershot global tour was merely a recipe for confusion. Resident Evil 7's PlayStation VR support is imperfect, but quietly gripping. The game's heavy-footed character movement and preference for smaller-scale, one-on-one encounters help it stave off the disorientation and queasiness that often go hand-in-hand with VR - I was able to play for around 40 minutes without experiencing any serious discomfort, using a combination of head-tracking and the ability to shift the camera by fixed increments using the right analog stick. The environments and lighting also scrub up very nicely indeed in VR, at the cost of some noticeable pixelation. There are a few awkward bits, however. The game spun my perspective 180 degrees a couple of times for no obvious reason, and the sense of immersion is hilariously sabotaged by the fact that your character doesn't have a visible body - just a pair of floating forearms. Moreover, you can actually lean sideways out of your character's invisible flesh during certain scripted tussles, which is at least a nice way of distancing yourself when the action gets too intense. Appreciate the gesture, Jack, but I'm going to let my buddy Frodo Baggins handle this one. Unintended hilarity aside, if you're looking for a proper campaign-length demonstration of PSVR's capabilities, this is a reasonably solid pick.There are a couple of chapters that take you beyond the grounds of the Baker estate, but for the most part you'll be exploring the mansion itself - a two-storey pile with a sizeable basement - and a few smaller outbuildings, including the guest-house from the game's Beginning Hour demo. The story sees eminently forgettable lead Ethan travelling to the mansion following a message from his wife, the rather more charismatic Mia, who has been missing for several years. On arrival he soon makes the acquaintance of the Bakers themselves, a family of undead bumpkins who spend their days abducting people and somehow transforming them into various flavours of mutant monstrosity. Jack Baker, the dad, is an implacable and seemingly unkillable butcher. Marguerite, his wife, is a screeching harridan with a retinue of oversized insects. Their son Lucas is a twitchy amateur inventor who'd rather trap you in a maze of laser tripwires than tangle with you in person - Resident Evil 7's take on the popular motif of the malevolent game designer. And then there's Evelyn, the obligatory spooky little girl, whose origins are the plot's biggest revelations.While they spend plenty of time off-screen, the Bakers are never far from your thoughts. As with the Nemesis of Resident Evil 3, there's the continual threat - heightened by a wealth of sinister ambient noise - of one or other family member dropping in on you as you comb rooms for the emblem keys and object puzzle pieces you need to access the mansion's darker recesses. Jack in particular is an unrelenting foe, smashing through layouts with scant regard for his own property. Another cause of ongoing tension is our old friend, the Resident Evil inventory, which has a way of filling up just before you stumble on a quest item, though you can make space by dropping items in gear boxes for later recovery. The game's stripped-down crafting system adds to the pressure - it sees you mixing sachets of chemical fluid with various raw materials, and you'll always have more of the latter than the former, which creates some pleasant quandaries. Is it worth topping up your supply of grenade launcher rounds, or should you hedge your bets and craft another healing spray?Perhaps Resident Evil 7's most intriguing quality is how it plays around with the idea of retracing your steps. For starters, it deploys the classic Metroid tactic of surrounding you from the get-go with doors you can't yet open or rewards (including that eternally coveted prize, the shotgun) you can't quite reach - a straightforward incentive to backtrack that helps entrench the mansion's crumbling layout in your mind. On top of this, you'll find the odd cunningly oblique photograph of a room furnishing that hides a treasure (such as the adrenaline shots that permanently increase your maximum health), which encourages you to attend to the fine details of every interior, however grisly. There are also a few flashback sequences, triggered by playing back VHS cassettes, in which you explore locations through the eyes of another character, hours, days and, in one case, years before. Entertaining in themselves - there's a ghastly episode that casts you as a man trapped in one of Lucas's inventions, tarnished a little by an obvious designer's kludge to ensure you don't accidentally break the puzzle - these flashbacks create a fun balance of predictability and unease when you return to the present. It's impossible to know how much of what you've just seen on-tape corresponds to what actually lies in the shadows ahead.If Resident Evil 7 is a return to form for the series in terms of environment design, and a pleasantly atmospheric exercise after the chaos of the past few outings, it never quite matures into a terrific horror game. There's a dispiriting reliance on scripted jump-scares - at one point, I actually caught the game spawning one of the Bakers around a corner - but what this needs, above all, is a higher class of monster. The Bakers may daunt when not in view, but they're too conspicuously mashed together from genre staples to seriously unsettle when they are, and the eventual boss fights vary in quality. One of the better ones sees you hurrying through a ruined house, grabbing ammunition from shelves while your adversary clambers around the exterior, bursting through boarded-up windows to snatch at your ankles. The boss spawns smaller threats if left undisturbed for too long, so at some point you'll have to grit your teeth and muscle in. Less impressively, there's a battle in the mansion's fetid underbelly which involves using the environment to stagger your opponent, before venturing into melee range. It's at this point that Ethan's sluggish handling stops being a source of agreeable stress, and starts being plain old annoying, as you strain to line up objects correctly and feel your way around your enemy's defences. The Bakers aside, there are three types of enemy in Resident Evil 7, collectively known as the Molded: fungal bipeds crowned with lamprey-like teeth, agile quadrupeds who can be dangerously easy to lose in the undergrowth, and waddling bullet-sponges who explode when they die. As far as zombie variants go, they're more than usually revolting, but the revulsion is skin-deep - especially during the story's final third, when you should have firepower to spare. It doesn't exactly add to the sense of peril that the game's block feature is so effective on normal difficulty, the highest setting available when you first play the game; Ethan's forearms are sturdy enough to withstand blows that look like they should tear you in half.Simultaneously Capcom's most inspired and its most counterproductive decision with regard to Resident Evil 7 was to release one of its locations as a demo, updated in the months before launch with side areas, new conundrums and new terrors. In the process, it has created a rival and, in some respects, a more adventurous version of the title - a sort of potted horror game-as-service that, like Konami's much-mourned Silent Hills teaser PT, embraces the notion that one and the same place can be an object of perpetual dread, providing it's not quite the same place each time. Via its VHS cassette flashbacks, Resident Evil 7 does toy with the concept of locations that mutate, and its conclusion does take you back to square one in an intriguing way, though the final battle is more whimper than bang. But at heart it's a fairly pedestrian species of bogeyman - a series of peekaboo jolts and serviceable gun battles strewn across a sumptuous, cohesive environment, constructed with no shortage of craft but not a whole lot of real imagination. Those doors may unnerve at first glance, but once you've acclimatised to Resident Evil 7's tactics, it seldom gives you much reason to be afraid of what lurks beyond."}