{"ref": "https://www.eurogamer.net/gravity-rush-2-review", "date": "10 Jan 2017", "game_name": "Gravity Rush 2", "text": "The storms take more than they give in Gravity Rush. Huge sky-filling sci-fi storms, fringed in purple light, descending to wrench away entire districts of the floating cities where this open-world series likes to play out. Occasionally, these storms deposit a few monsters to deal with, bulbous hot-glass beasts that skitter and flap and have glowing weak spots that crack beautifully under the impact of a flying kick. And now, in Gravity Rush 2 they sometimes drop off something else, too: a photograph. A photograph from another player.Gravity Rush 2's embraced asynchronous multiplayer in some interesting ways. There's a suite of challenge missions in which you can compete against ghosts, and there are mining loot runs in which you face poor odds for rich rewards. But my favourite element - it's very nearly my favourite thing in the entire game - comes down to the photographs taken from other players and dropped off by the storm every now and then.This is Treasure Hunt, and it's wonderfully simple stuff. Every once in a while you'll be notified that you have received a photograph from the storm, or maybe you'll see the ghost of another player on the streets around you and move in to investigate. The photograph will generally show a treasure chest located somewhere within the game's busy urban landscapes; if you accept the challenge you'll be deposited in the appropriate neighbourhood and tasked with tracking this treasure chest down. In a game that's heavily reliant on waypoint markers, you're suddenly without them, so you have to work the old-fashioned way, by comparing your surroundings to the surroundings in the photograph.Is that the right building? How do I get the traffic light to hang at the right angle? Where would I need to be standing to see that railing casting a shadow under the bridge? Eventually, you track down the treasure chest and net yourself a few talismans or what-have-you. That bit's surprisingly unimportant. Instead - and this is where it gets clever - you realise it's now your job to keep the treasure hunt going. So you've found the chest because of a photo some stranger snapped of it. That means you get to snap a photo of your own, and upload it to the storm for someone else to find. What kind of photo do you want to take? Do you want to make things easy, or do you want to make things difficult?The genius of Treasure Hunt is that it never has to ask you these questions. It's implicit in the challenge itself - an understanding of the player, and within that, a trust of the player to figure things out for themselves. This holds true, rather beautifully, for the rest of Gravity Rush 2, as it did for the quirky Vita game that preceded it. This is a game that trusts you to find the fun in it, and the fun lies as much in the basic systems as it does in the missions and challenges you're offered throughout the lengthy campaign. It's a game concerned with the pleasures of movement around a large, complex space. The combat's fine, the story's fine, the structure of things arranged for you to do is fine, but it's this movement that elevates everything, and the designers know that. They know that if you enjoy the thrill of swooping around, falling into the sky and then plunging back up towards the sidewalk, breaking at the very last second to hover inches from the paving stones, then they've done their job.This may explain why, at times, the design team offers the most gentle of iterations. Gravity Rush 2 continues the story of a girl named Kat and her cat, named Dusty, who can alter gravity at will, turning the sides of buildings into paths and walking over the undersides of bridges. Kat needs these skills as she's a novice superhero of sorts - less novice this time around, perhaps - who is tasked with protecting the floating metropolis around her from those glassy creatures from the void and, increasingly, the machinations of her fellow citizens.So while a good chunk of Gravity Rush 2 plays out in fresh locations, they feel, mechanically, very much like the locations from the first game. One floating city is a lot like another, even if Gravity Rush 2's attempt is far more colourful and teeming with pedestrians. The pedestrians! Seriously, this game has the best crowds since Jet Set Radio Future, colourful dandies and wayward flaneurs, taking in the sights and ever-eager to be caught up in the middle of one of Kat's impromptu battles against invaders. The battles are pretty familiar, too, although you're fighting off against mechs and soldiers as often as weird netherworld beasts this time around, while Kat's ability to draw nearby street furniture into an energy field around her and then fling it at foes has been made both clearer to understand and more satisfying to use. If anything, it's now a bit overpowered compared to her regular high-kick combos .Where these landscapes come into their own, however, isn't in the fighting or the on-foot exploration (which makes Gravity Rush 2's sleepy opening hour even more of a confusing choice since it robs you of your powers and drops you into a rather bland mining colony, only letting you out once you've engaged in prolonged hand-to-hand combat). Where they come into their own is when you're in the air, shifting gravity to plummet into the sky and fling yourself out to the horizon as you dash from one catastrophe to another. Again, the tweaks are small but precise: you're granted a lot more gravity energy, meaning that you can race across vast distances without needing to top up now. Character development, meanwhile, based on cashing in the pink crystals you encounter, is now almost entirely focused on your combat abilities: health and your ability to float in the air are generally left to stage-managed level-up moments. Drawing both strands together is a new selection of Gravity Styles - Jupiter Style that makes you very weighty and Lunar Style that makes you very light, both of which flare your traversal and your offensive abilities in different directions. Jupiter allows you to smash through objects while you slide across the ground, for example. Lunar allows you to gust yourself forward across empty space in a smooth, headlong spring.If you love all this, exploring the limits of your new abilities and the way that you can chain them together to get the most out of the environment, you might not be as bothered about some of the game's least fleshed-out elements. You might not be bothered about the way that the cities you explore can feel a bit inert despite the teeming crowds and the generous scattering of mission and side-mission prompts. You might not be bothered that the plot, while focusing in on social inequality and questions of authority in a way that feels particularly timely, loses its way in the middle act. And you might not be bothered by the way that the missions, while mixing things up energetically, still struggle to raise themselves above a muddle of checkpoint-following, combat, boss fights and - at their worst - poorly-implemented stealth. Deep down there is still a slight sense here of a game that gives you an amazing suite of powers but doesn't know what to do with them.Or maybe, as I suggested earlier, it simply trusts you to find the fun. And, as with the first Gravity Rush, I really did. I found it in my exploration of that vast new city (which turns out to be far less than the entirety of the game's real estate), in photo-mode which allows you to take snaps of the places you've been, to share them and even rate the snaps of other players. I found it in the new talisman system, that allows you to boost your skills in interesting ways through the addition of gems - and which ultimately allows you to combine and reconfigure gems until the whole thing becomes a bit dizzying. I found it in the sheer delight in art and music that Gravity Rush 2 represents, samba and Gipsy violins fighting over the soundtrack as Toulouse Lautrec, Gaudi and Moebius wrestle for control of the cityscapes - all while the lurid pinks and greens of old Prog rock covers dictate the stranger landscapes that lurk beneath them.Kat's always been endearingly clumsy as protagonists go - in contrast to her super-ally Raven she's a headlong mess of hair, legs, scarf, flapping awkwardly through the sky and colliding with the ground in a shower of grit. It's the kind of inelegance that most games don't bother to try and capture, and it gives the Gravity Rush series a great deal of their likability and character. At times that clumsiness might reach a deeper level, perhaps, as one mission blends with the next in a muddle of places to go, bosses to fight, but I'm always willing to let that slide, as I am the terrible stealth sections, and the occasional struggle with the motion-control implementation that sees you aiming, in mid-air, with both thumbsticks and the accelerometer inside the Dualshock 4. Gravity Rush seemed like an oddity on Vita, but then, the entire Vita was an oddity, wasn't it? On the radio friendly unit shifter that is the PS4, however, Gravity Rush 2 still seems wonderfully unlikely and out of place. What a strange delight."}