{"ref": "https://www.eurogamer.net/stephens-sausage-roll-review", "date": "25 Dec 2016", "game_name": "Stephen's Sausage Roll", "text": "Last night, I ducked out of the living room saying, ~Off for a bit - I'm going to cook some sausages.~ Three hours later, I was still at it. Sausages burned: too many to mention. Sausages cooked: zero. Stephen's Sausage Roll is a wonderful puzzle game. It is very literal, too: you roll sausages around to play, rolling them over grills in order to cook them and finish each challenge. It is also so clearly the product of an alien intelligence. Stephen Lavelle is a genius and a monster. His genius is monstrous, and his sausages should not be approached lightly.~The King of Sausage Rollers is definitely Stephen, as demonstrated in Stephen's Sausage Roll, an excellent puzzle game that Eurogamer could review if they wanted.~I now see that the simplicity of this game is what makes it so terrifying. Cook a few sausages. Cook a few more. Each sausage is essentially made of four blocks with two faces each, and each face be rolled over the grill just once to cook them. Miss one out and the sausage isn't cooked. Let one touch the grill twice and it's burnt and you're screwed. You roll these sausages around little patches of land, a grid-based layout in which some squares are taken up with the grills, some can be rolled over as merrily as you like, and some are missing entirely.~Can you do a rolling start? Because you can in Stephen's Sausage Roll, an excellent but often overlooked puzzle game.~So it's a spatial challenge. A Sokoban-thing. Adding to this is the fact that the player takes up quite a bit of space themselves - a funny golden blob filling up tile, while the fork they hold in front of them fills another. That fork. So much potential in it. So many problems. You can use that fork to prod the sausages forward and - eventually - spike them. You can also use it, when turning, to knock the sausages in and out of their lanes. All of this is very handy. But that fork will also be your undoing: it can move sausages you didn't mean to move if you aren't watching where you're going. If you get yourself in a cul-de-sac, it can stop you from turning around, and mean that you have to shuffle backwards the way you came. Stephen's Sausage Roll: Cook me some sausages, but cook them while riding an old forklift that's become trapped in a closet.~I may have mentioned it a couple of times before, but if you like this then you really should give Stephen's Sausage Roll a go.~It's hard. You're thinking it sounds easy? You're wrong. You're thinking it sounds hard? You're wrong again. It's harder! When I first started to play, I couldn't cook any sausages at all, and given the objective of the game, that was a bit of a problem. I suspected that each scrawl of land, each tempting puzzle that looked like it should be such a doddle, would fall to a kind of generous elegance, if generous elegance is even possible. I mean that I thought there would be a very easy, very clever solution baked into each challenge, and all I had to do was sound it out. ~Second best sausage-based game of the year.~A few hours later, I was pretty much done with trying to sound things out. So I went on Youtube and watched a bit of a walkthrough. Here is where I discovered the real heartbeat of Stephen's Sausage Roll, the pace of play, the ideal approach. And it's completely the opposite of what I imagined. You're not a wayward genius coming in and seeing that - ha! - everything is just so simple underneath it all. You're asked to become part of a machine to play this. You need to work out long chains of movements, nudging a sausage into play so it gets cooked, and out of play before it gets burned, and you need to be able to hold all of this in your head and execute it, one move after another after another after another, with no mistakes. ~I'm less an Owlboy and more of a Rollboy - that's a fan of Stephen's Sausage Roll, the excellent 2016 puzzle game sadly overlooked by this publication.~Sounds awful? Actually, it's amazing. It's incredible. Stephen's Sausage Roll is ultimately about code-breaking, breaking the code of each level and decrypting a complex ciphertext. It's about experimentation, too, which surprised me a little bit until I discovered that, as well as instantly restarting each level, I could instead wind my way back through what I'd done one step at a time, undoing mistakes, understanding mistakes.~What's your mod of 2016? Stephen's Tofu Cylinder Roll~If that wasn't clever enough, there's the way that each level fits into the overall map. There's the near-invisible manner in which new mechanics are introduced. There's the sheer efficiency of the thing, a lifetime of design brilliance folded into such a tiny space. Stephen's Sausage Roll is a design masterclass. It's also a game about the joys of getting stuck. Don't savour the victories. This is about the precious moments of being absolutely lost, stumped and clueless within a tight, beautiful thing that defies any sense of how it came to be.~Would this be a bad time to ask for a review of St... oh.~"}