{"ref": "https://www.eurogamer.net/space-hulk-deathwing-review", "date": "19 Dec 2016", "game_name": "Reviews", "text": "I can't see it much myself, but Deathwing is supposed to be Warhammer 40k's take on Left 4 Dead. Sure its multiplayer game is co-op only (and its campaign fed by AI bots), with you and up to three others up against relentless hordes of skittering horrors, but Left 4 Dead's clever narrative framework, its dynamic stage direction and cast of sarcastic characters are hard to make out in Deathwing's grim darkness of the far future. What you get is more of a glorified survival mode stretched thin over nine large levels, with you and your Terminator Space Marine buddies under regular assault by waves of Alien-inspired creatures as you stomp a steady path from one distant objective to the next.If that all sounds underwhelming and rather tedious, don't be put off just yet. There are plenty of reasons to be cagey over the current state of Deathwing, but the game's lack of Left 4 Dead DNA isn't one of them. In actual fact Deathwing's flimsy structure and plasterboard systems can, to a degree, be seen as a virtue; you can almost see the influence of the original board game underneath the first-person shooter design. Not enough to have compromised the action too much, but just hints here and there (to reassure the faithful) that developer Streum On Studio hold the source material in suitably high regard. As in, they properly get that 40k is more than just Lord of the Rings in space, or, in the case of Space Hulk, James Cameron's Aliens rampaging through the Mines of Moria.An example are the spawn points and ~blips~ that are highlighted on the in-game map, from which the Genestealer hordes commence their attacks. Conventional design wisdom might suggest not revealing such things to the player, especially when doing so highlights the fact that they can't be taken out. But then a knowledge of where the enemy might spring from, and that it will never stop coming for you was always integral to the original game. In Deathwing, as implicit in the ancient text of the first edition Space Hulk rulebook, you have to keep moving forward lest your incomparable space knights become overwhelmed by the demon swarm.Deathwing draws inspiration from deeper sources than dioramas of carefully assembled flock and figurines, from the Black Library for its fiction to decades of 40k-themed gothic architecture glimpsed from box art, dust jackets, flourishes in rulebooks and the pages of White Dwarf. There are other aspects of the game worth shouting about too - which I'll get to in a moment - but they all boil down to one thing: authenticity. From the gruff mission preamble to the iconic weapons and through every groaning bulkhead of the space hulk itself, Deathwing is dripping with 40k credibility. It's literally coming out of the goddamn walls.The infested hulk to which your squad is sent to investigate and purge is the ultimate source of Deathwing's appeal - so much so that I can't recall a more faithful environment for any Games Workshop-endorsed title in all my years of playing them (and I remember Tower of Despair, so I've played a few). Essentially a tangle of dead ships fused together in the timeless malignancy of the Immaterium, space hulks are malevolent contortions of metal and stone; reminiscent in parts of the claustrophobic corridors of sunken U-boats, in others as vast dilapidated cathedrals, but at all times uniformly oppressive with failing lights, groaning metal and the constant threat of ambush from any and all directions.I'm not going to claim Deathwing is the best 40k game of all time, because the best should appeal to more than just those that get what space Warhammer is all about. It is the one with the most rigorous backdrop, though. A shame, then, that as a tactical shooter Deathwing is far less impressive. Superficially, everything is present and correct, from the lurching mech-like movement of the Terminator-suited Marines to the heft of their venerated weapons, but the extent of the gameplay is undeniably limited, with you leading your troops from point A to point B, with one eye looking out for red wedges on the minimap and one ear listening out for the telltale hiss of incoming attack. When an attack comes, it's very often glorious: weapons burn hot, the corridor erupts and the body parts - torsos, claws, heads - pile up as each whole falls under a hail of lead and plasma. The problem with each attack is that there's only one way to really deal with them; fire everything you've got, reload and fire again until the deck is awash with deboned Xenos cadavers. You can switch loadouts up to three or four times per level, but can only effectively carry one weapon, often with a power weapon for close encounters. That's how Terminators conduct their business of course - no flimsy sidearms for them - but aside from knowing when best to order your Apothecary to administer a health boost to avoid an unpleasant restart, there really isn't much else to master. I mean, there are Psyker abilities to unlock  and you can order your AI wingmen to take up defensive positions, but there's little point in bothering: the tactical interface is a faff and using it doesn't provide any noticeable advantage anyway, so why bother. Deathwing isn't an easy game, certainly not at the outset when the Genestealer horde is relentless and your standard Storm Bolter less than effective at keeping it at bay, but as new weapons become unlocked and the game's workings reveal themselves through repetition, even when a new variety of 'Stealer takes to the field the balance has already shifted in favour of the player, undermining the initial challenge and bringing on a sense that you're doing the same thing over and over. Time your heals correctly and acquire the right mix of weapons (I can wholeheartedly recommend Lightning Claws for Brother Barachiel, the Storm Bolter / Narthecium combo for Brother Nahum and a Flamer for yourself) and you can tank an entire map quite easily.It doesn't help in holding firm the game's early tension that mission objectives often seem to have been arbitrarily placed at the extremities of the map to drag the game out and inflict the maximum amount of ambushes on the player as possible, perhaps because that's the only trick the game has up its sleeve.It's a fine trick though and is what Space Hulk is all about, after all - a looped homage of all Aliens' combat scenes, played again and again. Framing the action are typically sententious monologues, while the carnage during each encounter is brutal and relentless, and which is only amplified by the backdrops. But when it becomes second nature to know how the game ticks, the challenge becomes less about desperate survival and more wondering instead what new toy or ability will be unlocked next. At the very least a little weapon rebalancing would seem to be in order.    More of an immediate concern than the transparent gameplay are some widely-reported performance issues. For some reason I've not been plagued by too many problems, but then I'm a forgiving sort anyway (as those of us that used to load games from tape often are) - but I've experienced more than a few crashes to desktop when trying to join a multiplayer match and been inconvenienced in others when players have failed to materialise beside me. There are also considerable optimisation issues in both single and co-op games, with frame rates taking a tumble even during quiet moments between the action, suggestive that there are some memory holes that need plugging. There are less critical issues too, mission objectives failing to update, for example, plus a few annoyances such as turret hacking being a chore rather than an option, and switching out from the in-game map irritating when it should be a breeze. In other words there are too many technical issues exacerbated by minor niggles that combine to suggest, that for most people, holding fire on a purchase is probably for the best.Clearly not a wholehearted recommendation for shooter aficionados then, but as a lifelong fan of Space Hulk who's been eagerly awaiting a 40k shooter that plays to the strengths of the lore rather than tries to fit the lore into the standard shooter template, I'd probably ignore my own advice and buy the game anyway. At the very least Deathwing deserves to go on your wishlist and an occasional eye kept on developments to see where Streum On takes its efforts over the coming few weeks. If performance can't be stabilised and gameplay rebalanced reasonably quickly, Deathwing is in considerable danger of being deserted.Then it really will be left for dead."}