{"ref": "https://www.eurogamer.net/the-last-guardian-review", "date": "5 Dec 2016", "game_name": "The Last Guardian", "text": "The worst moments are sometimes the greatest moments. For 20 minutes last Wednesday I stood by an expanse of cold water, in an ancient hall that had become home to a vast, lapping pool, and I tried to get my companion, a three-storey motley of house cat, pigeon, and other assorted wildlife, to dive to the bottom, battling the swift waters that I couldn't face, and taking me along for the ride. For 20 minutes my companion would not do as I asked. You know that part in a game where you understand what you have to get to happen to solve a puzzle, but you can't make the puzzle pieces behave? I was stuck inside that part - except, while those parts are traditionally maddening, this time it was anything but.Genuinely: it was fascinating to watch the face, the body language, the shifting Baba Yaga chicken feet of that beast I was travelling with as it struggled to understand what I was asking of it - and then struggled to decide if it was in the mood to help anyway. This wasn't an instance in which the game was too clumsy to bring its pieces to bear effectively. It was something else entirely, something much rarer. It was an instance in which I had to try to properly engage with another creature, as wilful, playful, and easily distracted as I am. Commands came together with body language, orders with their interpretation, and the true puzzle didn't lie at the bottom of the pool, because it was right up on the surface all along. The true puzzle was: what is this animal thinking?Actually, it was probably more like 30 minutes.Anyway, this is The Last Guardian: long delayed, sometimes pseudo-cancelled, shifting between platforms, glimpsed in brief, unconvincing snatches of action at trade shows many moons apart. Oh yes, and heir to two of the most fondly remembered games of the last 20 years, as well. Ico and Shadow of the Colossus aren't just classics - they're classics that do a very specific thing. They hint at a world rich in stories and emotion and human meaning, while delivering taut, ingenious, melancholic adventures that hum with classy restraint.These are games that seem on the brink of saying so much, but in fact leave you endlessly desperate to know more. In one, you escape a vast crumbling citadel while protecting a ghostly companion. In the other, you ride out on a wilful horse to do battle with huge, mournful monsters made of stone and moss. How to bring all these elements together harmoniously in the final game of the series - the biggest, the most openly emotional game of the series - while also avoiding the pitfalls of a development that appeared, at times, to have gone seriously awry? How to do all that without saying too much, without saying too little, without taking down not one game, but the sweet, sonorous memories of two others as well?On paper, it's all about the convergence of themes. In The Last Guardian you're escaping a crumbling citadel again, but the roles have changed. Those huge, mournful monsters? One of them is now your protector, a point made almost tart when combat, if you want to call it that, flips Ico's formula on its head to marvellously strange effect. In Ico, sooty, shifting enemies would advance for your ghostly friend, and drag her away if you didn't knock them aside quickly enough. In The Last Guardian, you're in the ghost's role, cast as an innocent little boy while clanking suits of reanimated armour try to carry you off from that beast who will knock them to pieces when asked, but will also have to be soothed back to a childish calm afterwards. You used to protect people; now you need protection yourself. You used to kill monsters; now you depend on one.The Last Guardian does a lot with this simple set-up: boy and beast, thrown together for unknown reasons and trying to escape their immediate surroundings. Take combat again. A few design twists and the developers are able to ring a surprising amount of variation from such simple pieces: separating you and the beast, dropping you into situations that encourage stealth, or that hint at survival horror, or that even invoke the you-do-that-while-I-do-this double-team intricacy of Brothers. (I didn't make this last connection myself, but my colleague James Bartholomeou, watching over my shoulder, did.)Traversal, meanwhile, which you'll spend most of your time engaged in, benefits from vast environments and a wonderfully organic approach to the moment-to-moment design. To put it another way, The Last Guardian certainly has sequences that play with a specific mechanic, twisting it back and forth before turning it inside out, but it never feels as artificial and as bloodless as that. Its territories refuse to break down into levels, or even set-pieces. Instead, you're just exploring somewhere strange and disarming, a failed civilisation that has left behind sad half-broken machinery and palaces of rattling wind-chime stones suspended over bright depths. From one instant to the next you might be climbing walls and leaping between gaps, or you might be trying to get a vast door open or ascend a tumbledown staircase, but the ingenuity of the puzzles you face in these situations always emerges naturally from the world. These are designers who like to hide their presence, and sometimes even poke through the fantasy to point towards a more recognisably domestic landscape. (One of the game's great challenges is uncannily similar to the experience of trying to coax a cat down from a wardrobe.)That cat! That wardrobe! The Last Guardian's a platforming classic, vertiginous and imaginative, and while at times it feels like Core-era Tomb Raider, Lara Croft never had such fascinating - and convincing -  company. The beast - boy or girl, I could never be sure - is an absolute revelation, a moving platform in its own right, one that you can leap onto and off of at the press of a single button, working your way up and down the tail, around the bow of the back legs, across the spine and over the head. Sometimes, the beast will help you across gaps, stretching out to make a bridge. At others, you simply cling tight to its shifting feathers as it leaps from one unlikely precipice to the next, bounding across a landscape that is itching to collapse beneath you both in enormously satisfying ways, gravel and stone falling in slow motion while wood bends and splits and iron cables sing through the air. At times, your movement can be a bit sticky when leaping from one object to another or lowering yourself from a ledge - and the controls are intriguingly weird, mapping jump and descend to the upper and lower face buttons respectively, which makes physical sense but is surprisingly tough to get to grips with - yet the animation (scrabbling, fretful, childish) means any inherent clumsiness ends up feeling like character, like two inexperienced travellers who have been suddenly called upon to act heroically.I would say that the relationship that develops between the boy and the beast enhances all of this - the platforming, the puzzles, even the combat. In truth, though, it's the other way around. The relationship is the true core of this game, starting with the opening moment, in which you tend the beast's injuries and remove its shackles, all while keeping a safe distance from a wild and spooked creature who just happens to be the size of a small house. From there, the mechanics of the adventure, and the playfulness of its design, seem largely in place to facilitate a growing bond.The beast must be patched up after combat - no menus or abstraction, you must clamber over the fur and feathers, tugging spears from the flesh - and you also learn the best way to sooth the beast and stop it from being a danger to you. The beast must be fed regularly, and sometimes requires food to be repositioned just so before they can latch onto it and crunch it down. Even when you're afforded more control - when you move from merely scampering over the beast and hanging on for dear life to directing its actions, telling it where to go and what to do - it still feels primarily like character development rather than a growing list of player abilities. The controls for giving the beast instructions are pretty simple, but there is a wonderful cognitive delay as the beast takes it all in. And then there's the beast's inherent willfulness: you have to read that huge face it has, with its vast wet eyes, often rendered glossy black, with its camelish snout and gently flaring nostrils. You have to study its brows - I have genuinely never had to do this in a game before - to try and understand why it is not doing the thing that you are asking of it. This is the meat of the game (although, granted, the scrambling across ancient rooftops while the ground collapses beneath you is pretty nice too). This is the stuff that The Last Guardian does that no other game I can remember has done so effectively. It gives you a companion who, for once, can pretty much look after themselves. Then it forces you to understand how to make that companion look after you as well.Tellingly, the game's best mechanics all tie into this aspect of the beast, into this idea that it has its own mind filled with its own associations, and so you had better get a theory of that mind up and running as soon as possible. One of many ideas introduced, thoroughly explored, and then tossed aside for the next gimmick, for example, is that the beast has been trained to stay away from a certain symbol scattered around the world. Your job is to then separate from the beast whenever they freeze, terrified, at the sight of this symbol, and quickly find a way to remove the symbol from its path, often by climbing something extremely tall and rickety and doing frighteningly physical things with heavy locks and levers. All the while, though, you are hoping that your companion doesn't completely lose it, and you are also, perhaps, wondering what happened to build this terror in the first place. This is the lore of this world, really, but it is delivered in a brilliantly direct and human manner, without the elbowed intrusion of diary entries and audio logs, but through the anxiety of a creature so big that its own fear is frightening.There is so much of this kind of thing, and so many other little moments that bring your companion to life in unexpectedly tender ways. Given that the beast is a mish-mash of recognisable animal parts, scrambled together in a bizarre manner, it is so odd to discover that the end result feels so entirely convincing. The beast scratches at doors that it can't open, and in that action you briefly forget how large or fantastical it is, and you don't think of animation cycles and blending, but of the way that real creatures deal with their frustrations. At one point, I was trying to climb a chain, and I discovered that I was almost being shaken off it by the beast who was batting at the other end of the metal links in a manner I've seen my own cats do a thousand times before with a bit of ribbon or string. If you're a cat person, you're particularly lucky here, in fact: the beast's most strongly defining characteristics are all feline, from the way it contracts its body and wiggles its bottom before a leap, to the lean and lanky Oklahoma-dustbowl sag that all cats have to their shoulder blades. A wonder of animation and AI smoke-and-mirrors, the beast in The Last Guardian is primarily a masterpiece of observation.Built around such an astonishing central relationship, The Last Guardian's handful of annoyances don't seem terribly annoying anymore. It can occasionally grate to deal with the game's wayward camera in tight spaces - or sometimes in not-tight places. The designers like certain sequences so much that they find an excuse to recreate them a few too many times. The lengthy campaign's final third is a little drawn out and sees a sudden over-reliance on combat that threatens to bring the frame-rate, which is never that great at the best of times, down to single figures. Then there are bugs, annoying graphical glitches like the boy's tendency to get stuck running on the spot, or a checkpoint-restarting moment in which the beast suddenly found itself walking on water rather than diving beneath it. I'll forgive all of that to spend time with a game that makes me think about so many interesting things so regularly.And you know what I didn't think about all that much in the end? Ico and Shadow of the Colossus. The DNA is visible everywhere, of course, from the bleached stones and the whistling winds to the broken cages littered about and the way that the boy clings to the beast's hide as the world rushes past around him. But while there are plenty of secret nods to the other parts of this informal trilogy for those that are eager to see them, what's far more satisfying is that The Last Guardian is confident enough to pursue its own story, and to prioritise an internal coherence over Wiki-padding minutiae.Does The Last Guardian live up to its lineage? Does it do its forebears proud? It does so much more. It is bold enough to step away from their hints and their mysteries and explore its own kind of wonder."}