{"ref": "https://www.eurogamer.net/icarus-1-review", "date": "23 Nov 2016", "game_name": "Reviews", "text": "Perhaps you've seen a movie called Cargo? No, Jason Statham isn't in it. It's a dystopian sci-fi film from Switzerland that was a Netflix mainstay for years, concerning the crew of a space freighter and a potentially dangerous cargo that needed delivering to a distant station. Of course the movie description and thumbnail DVD cover had you believe Cargo was yet another attempt to clone Alien. Thankfully over the course of two hours the film revealed itself to be nothing of the sort and was all the better for being more of an indie thriller in space: a little bit of action here and and some tedium there, that together - thanks to an intelligent premise and some evocative set design - ended up being far more enjoyable than it's on-screen blurb was able to let on. A bit like ICARUS.1 in many ways.     Set across five acts that clock in at around 20 to 30 minutes each, while the length of ICARUS.1 may be comparable with Cargo, the premise is not. Electrolyte's game puts you in the first-person helmet view of space engineer Sam (ably accompanied by AI David, who we never get to see, but can assume isn't just a phantom voice), who's been sent to investigate the titular ICARUS.1, a resource-collecting vessel whose crew has long been declared missing and the ship abandoned for reasons unknown. First order of things, of course, is to get aboard the Icarus, which is easier said than done given that space engineers rarely enjoy a smooth transition to abandoned mining facilities - just ask Isaac Clarke. Predictably you just about make it, starting off your adventure sifting through the wreckage of your shuttle with a klaxon shrieking in your ear and very little in the way of any instruction on how to proceed, what to look out for or what may be waiting for you around the next corner.Thankfully it turns out that even without such basic things as a map, objectives, waypoint markers or much in the way of reliable overhead lighting, moving ever onward into the bowels of the Icarus is rarely a concern, for as one door closes behind you - and conveniently they always do - there is always one up ahead. And if it's locked - needing to be powered up, say - the necessary switches, removable screw panels or items of equipment to unblock your advance are in precisely the right quantities nearby.ICARUS.1 you quickly understand is a game of relatively few puzzles, all of them blindingly simple. If you see fire billowing into the corridor ahead, just try pulling on the Gas Valve lever behind you. Door won't open? They'll be a keycard in one of the lockers you just walked past. Scissor lift needs a power cell so you can jump to that platform above? There's a battery in the next room.You have an inventory into which fuses and keycards (and little else) fits, but you don't get to hoard anything from level to level, let alone between sections. Consequently when you find a solution (battery, keycard, etc) before encountering the problem, you know precisely what's coming up next. Although this undermines the puzzles somewhat, it isn't nearly as frustrating as you think it's going to be. In fact it all makes for a refreshing change of pace, a walking simulator with just enough zip about it to propel it to where fans of more involved games are likely to be tempted to try it.The game is not without inconsistencies that work against the plot and highlight the limitations of the game design; the incongruous spike traps, the ubiquity of out-of-order vending machines and crates that flag up loot that you can't actually amass or do anything with. Then there are flares, the only item you really get to ~use~ in the game, that really have no use at all.Of course, as you might expect, there are plenty of logs to be found, hinting at the state of mind of the ship's crew as their fate aboard the Icarus becomes hermetically sealed. Indeed it's the Icarus that's the star feature of the game, not because the ship is an obvious antagonist, but because the vague noises and deep shadows that constantly surround you mean you can never be sure who or what you're up against. Best of all though is that the whole ship, from it's Nostromo-inspired bridge to its Valley Forge-decked crew quarters, is a full-on stylised tribute to 1970s sci-fi, with nods to Space: 1999 and 2001: A Space Odyssey, as well as Silent Running and Alien. You only wish there could be more life to it; a Huey, Dewey and Louie crashing about, or some impractically-collared garments hanging in wardrobes; the kind of details that made Alien:Isolation's interiors so compelling regardless of the fact you were being stalked by a razor-faced killerAn odd combination of Dead Space and Dear Esther, ICARUS.1 isn't particularly challenging to play through or exciting to conclude, but it does offer a premise and a pace to enjoy it that never feels that it has to rely on the obvious survival/horror tropes, preferring instead to evoke the spirit of classic science fiction, from a time before all astronauts were armed and the mysteries of the universe could be solved with a blaster. It's a shame however that ICARUS.1 didn't take it's ideas further, expand on it's puzzles and make something more of its meagre inventory, because while what there is provides for a pleasing two-hour diversion, it's not one that warrants a repeat viewing."}