{"ref": "https://www.eurogamer.net/balan-wonderworld-review-an-archaic-throwback-as-clumsy-as-it-is-enjoyable", "date": "13 Apr 2021", "game_name": "Balan Wonderworld", "text": "Maybe it's simply a case of being careful of what you wish for. Balan Wonderworld is a curious time capsule, a 3D platformer that's full of the exuberance, colour and straight-up weirdness of a beloved and bygone period frequently yearned for, and all from the very people that helped define that same era. Imagine the team behind Sonic Adventure had a crack at their own Mario Odyssey, that late 90s exuberance finding itself into a maximalist journey that throws a hundred different ideas at the player, and you've pretty much got Balan Wonderworld down pat. If you've an honest recollection of how Sonic Adventure played, you'll also have a pretty good idea of how horrifying, fascinating, frustrating and occasionally brilliant this can be.Balan Wonderworld marks the grand return of Yuji Naka (an impeccably stylish dev, I was lucky enough to meet him once and was impressed how his socks, tie and pocket square all matched, a fact that might have been unremarkable were they not all a searingly bright orange). Here the Sonic the Hedgehog programmer is reunited with the designer of Sega's mascot Naoto Ohshima - a man who can also boast Nights into Dreams, Burning Rangers, and perhaps most appropriately this time out Blinx: The Time Sweeper on his CV. The two are together for the first time since 1998's Sonic Adventure, a pairing that promises a certain type of game that Balan Wonderworld certainly delivers on. This is a platformer that feels like it's been lifted from a different time altogether, the traces of 90s Sonic Team evident from the fundamentals up. Like Nights into Dreams, you're one of two children ushered into a fantastical theatrical world by an unsettlingly proportioned character, though the atmosphere  this time out is tipped more firmly into nightmare territory: Balan is a freaky, horrifying thing, his grin a thing of dumb menace. Like Nights into Dreams there's also a tug of melancholy beneath the strangeness, each of the 12 worlds themed around a different character's inner turmoil, all underpinned by Ryo Yamazaki's wistful score.Which explains why it's almost entirely unexplainable, not that Balan Wonderworld goes out of its way to ever give a proper account of itself: there are lavish, wordless CG interludes from Visual Works and some semblance of a plot, but like most games of its kind it defies easy description. How else to excuse the creatures locked in a lifeless dance like furries in a trance that vanish inexplicably in and out of sight, or the 50-foot high people that overlook levels and fix you with a glassy, gormless stare. Like Nights into Dreams, it is deliciously, giddily strange. Like Nights into Dreams it's also an exceptionally clunky thing to play, though if Naka and Ohshima's 1996 Saturn outing eventually soared beyond those problems thanks to its love of perpetual motion then Balan Wonderworld struggles to break free of them, in part down to the size of its ambition.  At the heart of this particular 3D platformer is a fine idea familiar from Mario Odyssey - there are some 80 costumes to unlock across the 12 worlds, each one of them granting you a new ability, each new ability possibly opening up new areas to explore in past levels. A fine idea indeed, albeit one that does become slightly unstuck in practice. The execution is as strange as anything else you'll find in Balan Wonderworld. Abilities are unlocked by picking up icons, which themselves must be unlocked by keys that are typically lying within sight of the icon. Each world has its own particular set of costumes, though you've got a loadout of three you can hold at any one time, with new abilities you pick up with a full loadout shunting out old ones. Oh, and you're also able to edit your loadout at any particular checkpoint and dip into the entire wardrobe you've unlocked so far, although Balan Wonderworld won't tell you this at any point and it's a fundamental feature you'll have to discover yourself. Just as you'll have to figure out for yourself exactly what's going on in the hub world, where you tend to flower patches to attract little fluffy Tims in Balan Wonderworld's mirror of a Chao Garden (answers on a postcard if you do figure it out yourself, please - I'm still completely baffled). It's an enigmatic brand of complexity that sits at odds with the otherwise simplistic approach taken by Balan Wonderworld. In keeping with the stripped back approach of classic Sonic Team games, this is a strictly one button affair, though that button is pushed into doing all sorts of fantastical things thanks to the various costumes on offer. Maybe it'll lock on to a target and have you drilling diagonally across the screen in one of the costumes that seems like a wry reference to Aero the Acro-Bat - maybe it'll have you puffing up a sheep's wool to float through airstreams, or maybe it'll have you teleporting through thin walls in order to access hidden treats. Discovering new costumes is one of Balan Wonderworld's key delights, and one that doesn't let up throughout its 15 or so hours - a fairly generous runtime for a platformer like this, bolstered by the amount of backtracking required to collect the hidden statues you need to unlock later stages. It's a clumsy kind of backtracking, though, thanks to the fiddliness of how using Balan Wonderworld's costumes works - but on the flipside, it's a game where the sense of possibility only opens up over time, and whether deliberate or not it's refusal to explain itself conjures an air of enjoyable enigma. It's old-fashioned that way, as it's old-fashioned in so many other ways. Levels are clumsily thrown together, with lethal falls and crags you can just about land on for some illicit exploration. Throw those 80 different abilities at it all and Balan Wonderworld's a game that feels like it's constantly about to come apart at the seams, its clunky platforming, simplified one-hit combat and three-hit boss battles all jostling together for what's an ungainly package. And yet for all that, I kind of adore Balan Wonderworld, to a degree that's surprised me. Maybe it's just come along at the right time, when I needed a colourful comfort blanket of a thing, a nostalgia strip as strange and insubstantial as watching a YouTube compilation of 90s TV adverts. Maybe it's because my expectations were low - Sonic Adventure has always been the game where the scales fell away from my eyes when it comes to Sega's mascot, and to Sonic Team, and I can't say I've ever enjoyed too much of the series since. Or maybe it's just because this is how games used to be, and sometimes it's comforting to slip into a 90s netherworld, and back into the old ways. When games were often clunky, unexplained, awkward and often downright frustrating. Balan Wonderworld is all those things, an almost too exacting facsimile of a type of second tier 90s platformer that never quite achieved greatness, even if it's fascinating all the same."}