{"ref": "https://www.eurogamer.net/owlboy-review", "date": "7 Nov 2016", "game_name": "Owlboy", "text": "Owlboy's greatest achievement is how it has managed to stay relevant. Against the deluge of retro-inspired sidescrolling platformers that have been thrown at us over the past several years, Owlboy doesn't just stand head and shoulders above its competition - it's an outstanding example of how the genre can, and should, be done. Development started back in 2007, and while there are no obvious reasons as to why it took so long to reach full release - beyond its small development team and multiple iterations - it has done so looking and feeling remarkably polished. You wonder how Owlboy might have fared had it released into a world pre-Braid and the likes. Nonetheless, in 2016 it's still a fine accomplishment.Owlboy's charm is tied to its lead character Otus, as well as the host of friends and foes that pop in and out of this capricious coming of age tale. Few games have captured such wonderfully expressive body language and stirring facial expressions through pixel art, and as Otus is explicitly identified as a mute protagonist his silent interactions inevitably become all the more precious. As an owl in training, Otus spends much of his time trying to win the respect of his elders however but can't seem to do anything right in their eyes in the game's earliest stages. A typical tale of trial and tribulation unfolds that sees Otus dotting back and forth between dungeons and villages to further his ten-hour story and win over those who judge him along the way. Well-worn genre stereotypes do exist - something first embodied by Otus' hard-shelled domineering professor and mentor Asio - however they all fit snugly in this world. The latter's scalding of our seemingly misunderstood hero in the game's opening scene leaves Otus with his head bowed, sweat running from his brow and twiddling his thumbs. I fell in love with him there and then. Otus' first encounter with overexcitable best mate Geddy just moments later, though, allows Owlboy to confidently tease its wide-ranging emotive repertoire inside its first ten minutes, while also serving to introduce the value of its central mechanic: flight. Double tapping jump in Owlboy sends Otus skyward but - unlike the vast majority of games which include the ability to fly - he's able to soar freely without being governed by stamina metres or restrictive timers. Being given the opportunity to circle the skies without hindrance is one of Owlboy's defining features. It's so simple yet so, so enjoyable - particularly when you whisk Geddy off his feet and cart him around as a 'gunner' within the game's enemy-ridden caves and dungeons. Early on, Geddy is your sole companion, his hand cannon laying waste to enemies and clearing the way of path-blocking rubble. New companions join the cause as the story unfolds - many of whom boast area-specific abilities, which in turn lends the game a Metroidvania feel at times.       One example of such intuitive teamwork occurs in the opening dungeon when Otus and Geddy become separated. Otus eventually uncovers a teleporting device and thereafter transports Geddy to various locations in order to access otherwise unreachable and inaccessible locations. For the most part, the puzzles require some degree of cooperation, and each cavern's learning curve is evenly paced meaning the game affords you plenty of time to learn each new skill in turn. As in Zelda, each tomb/dungeon/cave is rounded off by an end-of-zone boss that often requires the use of whichever skill you've mastered en route. One conundrum makes great use of Otus' unlimited flight stamina by demanding he push, pull and squeeze water from steam clouds in order to access keys from rainwater ducts. You're asked to weave between steam geysers while haphazardly juggling concrete plugs and a frayed temperament as you figure out where the heck you're was required to push and pull and fill next. Like any puzzle worth its salt, the eureka moments outweigh the struggle.  Owlboy's music is truly fantastic - a fittingly artful complement to its animations. In recent years, few games have had me heartily reciting its zones' themes days after playing in the same way Owlboy has, which is testament to its stellar sounds. Against the slew of 8-bit chiptune-flaunting retro-likes the indie sphere has been populated with lately, Owlboy's orchestrated music feels up-scale and cultured.   As does so much of Owlboy. Nine years seems like an inordinate amount of time to recreate a style that was perhaps mastered in the 90s, yet this degree of iteration, reiteration and perfection to be found here speaks volumes of the care and time D-Pad Studio has taken.At its heart, Owlboy is a throwback and reimagining of a genre gone by, yet it feels like a game you might've already played - one you're returning to with fond memories. That's no coincidence, and it speaks volumes of what D-Pad Studios has achieved. Owlboy is a modern day retro classic."}