{"ref": "https://www.eurogamer.net/slayer-shock-review", "date": "31 Oct 2016", "game_name": "Reviews", "text": "David Pittman knows how to make a good hub. The arcane library at the heart of his game Eldritch is one of my favourite examples ever: a wonderful ramble of books and wood panelling and off-kilter geometry that continues to reward exploration. Now Slayer Shock is here and, although the hub it comes with is small and fairly basic, there's still something delightfully evocative about it. It's a campus coffee shop, lit up bright despite the late hour, doors locked against the horde. Here is a place to lounge around and plot the next sneak attack in a guerilla war waged between slacker heroes and a gaggle of dandy vampires who seem intent on taking over the town. There's nothing to discover really, but it doesn't matter. I have always struggled to leave a coffee shop without dawdling a little.Slayer Shock is a chummy spin on Buffy the Vampire Slayer, and the coffee shop is the place where you buy new abilities, choose which research strand to kick off, and equip the weapons and other bits of loot you've uncovered. As with the rest of the game, it has a programmer-art feel to it - in both Eldritch and NeonStruct, Pittman managed to make his blocky graphics feel like a genuine aesthetic, and that doesn't quite hold true here - but the choices you're faced with are interesting nonetheless. Head out with a stake or a holy water water pistol (or both)? Carry extra healing bandages or splurge on the ability to move silently? Learn a boss vampire's weakness, or just find out where it's hiding and take your chances in combat regardless? It all benefits from a very tight loop: everything you buy is paid for with dust earned by completing missions and killing elite vampires. Kill vampires to get better at killing vampires. Onwards and upwards. I like that.The core of the game takes place outside the coffee shop, mind. Each evening you choose between a selection of locations in which vampires have been up to their vampiric tricks. (There is strategy involved in the choice, as each location has a sort of vampire heat level that will go up if left unattended for too long, and will eventually see you losing the area entirely.) Boots on the ground, the places themselves range from farms with fields full of pixelated corn to college grounds, train stations, and rundown neighborhoods, all built from simple blocky objects that are procedurally scrambled. Also scrambled are a simple range of mission types: rescue a set number of townsfolk, knock off a set number of elites, steal stuff from crates - there's a lock-picking mini-game - or just patrol the environment, which means racing across the map to activate a distant marker and then racing back to the start. All of these missions are excuses to throw you into the mix with the prowling undead, and all of them benefit from the no-nonsense combat that has you picking between a range of weapons - swords, those holy water pistols, nail guns -  and learning how to tackle a range of different foes - the big guy with a huge health bar, the floating one who explodes when she dies, the minions who do little damage but can swarm you if you're not careful. Stealth is encouraged, because roaming vampires will hunt you down if you make too much noise or step into the light for too long. Oddly, there doesn't seem to be any UI to support your sense of how hidden you are, but I didn't really mind too much. Playing on the higher difficulties, which for once is genuinely where the game comes alive, you learn to be extra paranoid about movement through open spaces anyway. Combat, which is very straightforward - whack them with whatever you have to chip away at the health bar and stun them for a brief period - should come with a cost, and it does.Over time deeper rhythms start to emerge. Each night's mission becomes an episode in a series, and each series sees you hunting down a specific baddy vampire - or group of baddies - and finishing them off. Afterwards, a new series begins, with any upgrades and weapons carried over, and you're after another specific baddy. Eventually, you get to reset everything: you lose your weapons and upgrades, and you meet a new gang in the coffee shop. In return for your loss, you get Legacy Points that you can spend on really exotic elements, such as a limited ability to blend in with vampires for an evening. Yet more strategy.Deeper eccentricities start to emerge, too, and this is, in truth, a winningly eccentric game. Along with the episodes idea comes a pencilled-in sort of group dynamic, which sees the people you hang out with in the coffee shop forging relationships and falling out as you go about your vampire-annihilating work. It doesn't seem to add up to much in real terms - the guy who sells you weapons might move to a different table if he breaks up with whoever grants you new power-ups - but I couldn't help falling for it slightly, thin as it is. From the jangly guitar music to the basic art, Slayer Shock is clearly a game made predominantly by one person, and that, ultimately, explains a lot of what I like about it. It's sketchy in places, and too basic in others, but you get a genuine sense of a designer exploring their own interests and following their own instincts. No compromises, except on budget - and I'll take that, thanks."}