{"ref": "https://www.eurogamer.net/titanfall-2-review", "date": "28 Oct 2016", "game_name": "Titanfall 2", "text": "Respawn is still a relatively new studio, but its legacy can be found in the modern first person shooter in all its forms - from Medal of Honor to Modern Warfare and then, finally, to Titanfall. There's a through line there that's clear to see when you embark on Titanfall 2's brief but sumptuous campaign. The heritage of a studio that effectively created the cinematic shooter, that married that with spectacle and storytelling in Modern Warfare, and now has been afforded the opportunity to build an FPS campaign around the rarest of things in this genre - ideas.For five or so hours, Respawn assaults you with concepts, with gameplay systems and with strokes of design ingenuity, never relenting until you hit the end credits. And then it's done. A close friend of mine, having finished the single-player, described it as a mic-drop (a line so good I was furious I hadn't thought of it myself) - it's Respawn's statement on what it is capable of as a studio, and just how far the first-person shooter campaign has been going in recent years.So what exactly are you doing in this five-hour stretch of glorious action, then? Well, it's no surprise to find out that you'll be doing a lot of shooting, a lot of wall-running, and, yes, a fair amount of Titan-hopping, but these merely form the foundation of Titanfall 2; they all serve to prop up the high-minded ideas that sideswipe you like an errant left hook from a flailing giant robot. To actually go into detail about the specific gameplay tricks and one-shot gimmicks that Titanfall 2 employs would be doing an injustice to anyone looking forward to ploughing through the game, but the one constant that ran through my mind as I played was 'this is like a Nintendo game'. Or, should that be, a Nintendo game developed by the hands and minds behind Call Of Duty at its finest.Like the best Mario games, Titanfall 2 picks a trick, themes an entire level around it, and then drops it the second it threatens to become overfamiliar. And just like Mario, it's all backed up by those rock-solid fundamentals that mean when you are just in firefights, or are asked to navigate a chasm using wall-running, everything feels nigh-on flawless. The raw mechanics of Titanfall 2's shooting, and the combination of Pilot and Titan gameplay and the scale changes that leads to would be enough to sustain a serviceable campaign, but clearly Respawn isn't interested in being simply serviceable. There's some of Half Life 2's DNA here - not necessarily in how it feels in the hand, but in the variety of environments, playstyles and even the connections you make with the other characters. In particular, between you (the so-dull-the-name-has-to-be-deliberate Jack Cooper), and your Half Life 2 DOG by another name, BT.Much of the prerelease talk about Titanfall 2's campaign focused on the relationship between Pilot and titan, which sounded pretty weird at the time. By leaning on all the right buddy-movie tropes, though, and executing each one with panache and - crucially - brevity, Titanfall 2's succeeds in making you care about a twenty-foot robot more than I've cared about almost any action game character in recent times. Nothing in the story is original - it's all seasoned tropes used effectively - but how rare is it to play through a first-person shooter where you actually know what's happening, let alone one where you give a damn. And just like that, it's over, leaving you wanting more, craving another level or a new idea. As a standalone it would be criminally short, but when attached to Titanfall 2's tweaked, deepened and enlarged multiplayer, it's pretty much perfect. The raw combat is reminiscent of Halo - darting in and out of the action - surviving by the skin of your teeth as you manipulate the battlefield with skill and nous, but it's the levels themselves that will go on to be talked about for years. Make no mistake - as short as it is - Titanfall 2's campaign is a benchmark, and quite feasibly the best single-player FPS since Modern Warfare 2 (although this year's Doom might have something to say about that). After all that, it's still a justifiable question to ask if Titanfall 2 even needed a campaign at all - certainly its predecessor managed just fine without one. I've already spoken at length about Titanfall 2's multiplayer in my impressions piece, but it's a relief to say that the experience translates superbly to console (having only previously played on a PC-LAN), and on launch day at least there are no discernable server problems or lag. Considering most fans of mech warfare will be spending their time battling online, it's also reassuring to delve a little deeper into the customisation options and see that Respawn has gone some way to addressing the main criticism of Titanfall - the lack of build options.While there aren't hundreds of guns and perks, the base set of weapons and add-ons has increased significantly, meaning there are plenty of new ways to craft a build for your Pilot, and despite the new titan classes coming pre-built with certain weapons and abilities, there are still enough ways to tweak them so they feel different to use. With guns now featuring their own level, you can unlock new perks and sites, giving you a reason to stick with one, or move on to another when bored, and there are more specialised abilities and add-ons for your Pilot that gradually unlock through level and in-game currency. Even during these foetal hours of Titanfall 2's multiplayer, the journey from Level 1 to Generation 2 (Titanfall's prestige equivalent) feels like a much more rewarding and pliable one.It's the action on the battlefield that really cements Titanfall 2's status as a best-in-class online FPS. That rush of clearing out a few grunts, capping a couple of enemy pilots, earning your Titan, calling it in while waiting for your health to regen then wall-running and leaping into the space where your giant metallic pal slams into the ground, seamlessly being yanked aboard, then terrorising the ant-like soldiers below... that's Titanfall. It's truly unlike anything else you can feel in a competitive shooter, and Respawn has only amped up that rush. No other shooter feels this compelling. No other shooter fires me up like Titanfall 2. Exploring the nuances of the multiplayer is where Titanfall 2 will show its legs as an online entity. During the period I had to play for my impressions piece, I barely used the grappling hook, instead concentrating on Sonar Blade (fire a ninja star, and it highlights enemies where it lands) and old favourite Stim (speed and health regen boost). A few hours spent experimenting with the grappling hook shows how useful it can be for negotiating the environment, zipping out of hotzones, and latching onto Titans. Also, the new burn-card replacements, Boosts, see the likes of Map Hack and the trusty Auto Pistol return as score streak rewards, meaning their flow into the battle is more controlled, but also potentially damaging to balance - like any multiplayer game, time is the only true test.It will be time very well spent, though. With the uncomfortable release window, sandwiched as it is between Battlefield 1 and Infinite Warfare, Titanfall 2 stands out. Here's hoping it finds an audience, too - it's just too good not to. This is benchmark stuff - a campaign that will be talked about for years, and multiplayer so compelling that it makes the competition feel clunky and staid in comparison.Your Titan is ready."}