{"ref": "https://www.eurogamer.net/paper-mario-color-splash-review", "date": "11 Oct 2016", "game_name": "Paper Mario: Color Splash", "text": "This isn't so much a sequel to the 2012's Paper Mario: Sticker Star as it is a do-over with a fresh lick of paint - and that's likely to leave some Nintendo fans as mad as a sack of Wigglers. To many observers Sticker Star was the weak link in the Paper Mario chain - a flimsy effort that saw the series distance itself from its RPG origins in favour of a more action-heavy, and strategy-light, approach. But Sticker Star's attempt to pare back the series for handheld play seemed a good idea on, ahem, paper. Instead of taking place in an interconnected world, Sticker Star snipped itself into a series of self-contained stages, breaking up playing sessions into manageable chunks. Even bigger cuts were made to the battle system, with XP, levelling-up and other JRPG trappings banished to the shredder in favour of a simplified system involving one-time use battle cards that you'd literally peel off the side of walls as you went along.These changes brought as much grief as reward, and many hoped the Wii U entry would turn the page back to the more traditional N64/GameCube offerings. Instead, Intelligent Systems has opted to iron (or more appropriately, hammer) out the wrinkles in Sticker Star's template, with mixed results.Color Splash is a new game with a new story, but hold it and Sticker Star side-by-side and you can easily make out the tracing paper lines. Instead of looking for six Royal Stickers, Mario now finds himself on the hunt for six Paint Stars. (See? Totally different.) These Stars are needed to bring colour back to Prism Island, a Delfino-alike resort being menaced by a cabal of thirsty Shy Guys with straws, who are literally sucking the colour out of anything - and anyone - in their path.A new game warrants a new sidekick, so it's back to Claire's Accessories with Kersti, Sticker Star's hipster-loathing crown, and in with Huey (Hue-y, geddit?) - a cantankerous paint tin whose mood flip-flops with every passing line of dialogue. Huey's main contribution to the storyline, bar comic relief, is to infuse Paper Mario's trusty hammer with the power of paint - allowing him to restore colour to faded-out walls and Toads alike.This isn't as joyful as it might be; you rarely feel the same satisfying sense of restoring vibrancy to a monochrome land that you get in, say, Okami. Instead it's more akin to going around straightening picture frames, as you scuttle around  plastering gaps in the scenery with paint. It's not particularly entertaining or engaging to do so, but although each level keeps track of the percentage of gaps you've coloured in, mercifully it doesn't require you to 100 per cent them. Colouring in as you go is a good idea however, as it's an easy way to scoop up coins and battle cards, the latter of which are always in short supply.None of which is to say Color Splash is an ugly game. Like Yoshi's Woolly World before it, Color Splash uses the Wii U's extra heft to add an obscene level of detail to a simple visual style, leading to some of the most realistic corrugated cardboard I've ever seen in a game. The detail adds depth to this charming world of papercraft pipes and pokeys, giving scenes a dioramic quality that makes you want to pick them up like a snowglobe and look at them from every angle.But while the visuals are sharp, the dialogue is uncharacteristically blunt by Paper Mario's lofty standards. In a way, it's hardly surprising. This is a series born of parody, its one-liners bouncing off the farce of an RPG attempting to craft an overblown narrative from a world of mute characters with no back story. But that premise can only stretch so far, and five games in you get the sense the writers are uncrumpling the paper at the bottom of their waste-paper basket. ~The Sun is angry today~, says a burnt Toad at one point. ~You know a thing about angry suns, don't you?~ Er, zing! Genuinely funny lines and set-pieces are still to be found, but all too often it falls back on the lazy humour of recognition.If Paper Mario has been robbed of its RPG-ness  in part to avoid cannibalising the its sister Mario & Luigi series, then it's also been robbed of much of its raison d'être in the process. While Mario & Luigi is free to explore new comedic horizons - from time machines to Bowser's intestinal tract - Paper Mario is left to trade on the tired kind of paper jokes you can find in any old crummy review. In the process, its jokes often fall - wait for it! - flat.Flat, too, is an accurate description of the battle system, which fails to completely address one of Sticker Star's most glaring faults - a lack of incentive to actually battle. Getting into scraps all too often drains you of your precious battle cards - while defeated enemies will drop replacement cards and coins (which can be used to 'spin' for more cards in-battle, in a process that takes just /a little/ too long), you rarely claw back what you expended, and in any case it's often as bountiful to crack on with your painting duties. One resource that can only be obtained through fisticuffs are paint hammers, which gradually increase the maximum amount of paint you can hold, which can then be used to 'paint' black and white battle cards to buff their stats. But paint is such a plentiful resource outside of battle - and has such negligible effects during battle - that you're rarely found wanting. The balance between the game's three currencies seems completely off, and you sense a more on-point Intelligent Systems might have found a way to whittle the currencies down to two.Similarly, some very un-Nintendo design choices emerge during play. For instance, Kamek pops up every now and then to impose conditions during battle - like removing all but six of your cards. Fair enough, but other times you'll find your cards flipped or randomised, forcing you to play them blind, almost guaranteeing you'll waste a rare or valuable card you've been saving for a rainy day. It's the modern-day equivalent of those dreadful old Amiga games that used to reverse your controls.Then there are the end-of-level bosses, who are equipped with a one-hit kill move that can only be avoided if you have a special 'Thing' item in your card set. Another returning element from Sticker Star, 'Things' are 3D items from the real world that, for reasons never satisfactorily explained, find themselves in Paper Mario's world - from fans to fire extinguishers. Once found, they can be 'wrung' into 2D cards, and used as a devastating Summon-level attack. Although it's wise to keep them in your pocket until they're needed, or you'll need to source a replacement.Fortunately, this is one area where Color Splash improves over its predecessor. Whereas Sticker Star would have you backtrack aimlessly for a replica, here they can be purchased by paying a visit to 'The Wringer', a shady Toad who speaks only in third person, and has seen maybe one too many gangland films. Color Splash goes to commendable lengths to ensure you always know where to go and what to do next.Such user-friendliness is welcome, as Color Splash is at its best when it drops the flawed battles and bored comedy and sets you free to explore and puzzle-solve within its beautiful papercraft world. Shorn of its RPG depth and with the best zingers long since told, visual splendour and paper-themed tricky is really all Paper Mario has left to distinguish itself from the crowd. If the series is due a further reprint on NX,  let's hope Intelligent Systems use the earlier editions as their template, because this scrumptious and unique 2D series is beginning to look increasingly one-dimensional."}