{"ref": "https://www.eurogamer.net/deus-ex-mankind-divided-review", "date": "24 Aug 2016", "game_name": "Deus Ex: Mankind Divided", "text": "Adam Jensen - my own, custom-upgraded version of Adam Jensen, at least - is a man who can launch exploding katanas from his wrists, sweat bulletproof gel and disarm laser tripwires with a Jedi Masterly wave of the hand. In the course of 35 hours of play and a couple dozen Praxis point upgrades, I have used the character's cyborg arsenal to obliterate cops in exosuits, sweet-talk rabid cult leaders, glide unseen through gangster safehouses and shoot EMP grenades out of the air in slow motion. But Jensen's most dependable ability, and the augmentation that perhaps sums up the slightly elusive sophistication of Deus Ex: Mankind Divided, is also one of the most boring on paper. I speak of smart vision, a retinal aug that boils the game's environments down to their interactive components and hazards, laying the geography bare as a textureless and translucent VR construct. It's a trick you're almost certainly familiar with from other stealth-oriented games, including 2011's Deus Ex: Human Revolution. And as in many other games, it's a trick that somewhat undermines the art direction, letting you cut through heaps of evocative, storied detailing - the brutalist corporate sculptures that adorn the sinister Palisade Bank, or the crates of fruit and circuitboards that line the corridors of Golem City - at the touch of a button. But if smart vision is a well-worn mechanic, and expressive of an old tension between the stories such worlds seek to tell and what you actually do in them, the narrative also charges the act of peeling away visual noise with unusual import. Because most people in the Deus Ex universe aren't as fortunate as Adam Jensen. Most people have to see the world for what it is.Mankind Divided is set in the midst of a global backlash against the mechanically augmented, following an outbreak of remotely-triggered mass psychosis at the conclusion of the previous game. Jensen is now an Interpol agent based in Prague, running down terrorists and levelling himself up while pursuing a private vendetta against the Illuminati, a fat cat collective who want to bring the transhuman generation to heel. In that context, using smart vision - an ability you must choose to unlock, after your augs are accidentally reset, Metroid-style, to factory default early in the game - comes to feel like a sort of class betrayal, a distancing of yourself from the suffering of fellow cyborgs. It purges the game's bustling dystopia of the believably recreated exploitation and oppression other locals have no choice but to witness.Thanks to smart vision, you no longer see the enforcers crushing skulls against riot vans at intersections, the blood on the cobblestones. You see ventilation ducts you can access to sneak behind a cluster of viewcones on your radar, terminals you can crack to assume control of an automated turret, walls you can breach to avoid a gas pocket or pool of electrified water. You don't see the threatening graffiti, the holoscreens that blare ceaselessly about ~augmented terrorism~, the cheery ads for antidepressants or the fetishising of prosthetic limbs in the city's red light district - just shapes and surfaces, colour-coded for tactical gain. The ramifications of this filtering are addressed obliquely in one of the later side missions, when a cop declares that she can justify dragging augmented citizens from their homes because she perceives them to be ~historical outliers~, abstractions thrown under the wheels of progress, rather than sentient beings. There is, it turns out, an app for this, and it's built right into Jensen's cranium.Deus Ex: Mankind Divided is, then, a game with things to say about the politics and technology of perception, and it occasionally says those things through Jensen's very toolset. It is, however, often content to be something more comfortable and less subtle - a pulsing cyberpunk conspiracy thriller that transports you from the sand-trapped decadence of a crumbling Dubai to a base drilled into the belly of a glacier.  Once you're done with Mankind Divided's main story, you might want to check out the online-only Breach mode, a set of arcade challenge maps dolled up to look like Tron movie sets. Held together by a grating but not entirely dissatisfying sidestory about hackers breaking into the Palisade Bank, it's a chance for the game's level designers to experiment without constraint. Breach mode ports over the bulk of weapons, augs and hazards from the campaign, but adds leaderboards, randomised reward packs and optional map modifiers. It also has an intriguing progression curve - the Palisade AI alters the odds over time to counter your playstyle. If the components of Deus Ex appeal, Breach is a pleasing bonus offering.There's nothing inherently objectionable about this setup, of course, and there's certainly nothing wrong with a more responsive, freeform take on Human Revolution's mix of hacking, acrobatics, gunplay and stealth, which puts much more emphasis on verticality and doles out seismic new ~Overclock~ augmentations to boot. But there's an intelligence to Mankind Divided's backdrop, a depth of insight that the twist-driven plot never really unearths, for all the cutscene moralising about human rights and tyranny, and there are times when the writing veers from passably sharp into woefully clumsy. Step forward exhibit A, that headline-baiting riff on the Black Lives Matter movement, which is thankfully confined to a couple of smaller moments. The script's efforts to examine real-life bigotry through the lens of a fictional crackdown on cyborgs are, on the whole, rather unconvincing. The writers treat aug oppression as a one-size-fits-all cipher for every kind of discrimination, turning a mostly deaf ear to older prejudices that would surely persist alongside anti-aug bias. They also dance frustratingly around some of the more fascinating dynamics of the so-called cyborg renaissance - exactly how implants are sold and paid for, or the difference between people who choose to have their bodies modified and those who have this thrust upon them by circumstance. To top things off, Mankind Divided's main plot feels oddly incomplete. I came away feeling like I'd got my money's worth in terms of hours, but various key threads are left hanging and Jensen never actually tangles with the real villains of the piece, only their proxies.Still, the journey is worth undertaking for the many delightful smaller journeys you'll make along the way. If Mankind Divided's cultural insights are muddled and bitten-off, it has the finest mission design of any narrative-heavy open world game in recent memory. None of the quests feel bolted-on, none of them seem bloated or insubstantial, and they all weave around each other beautifully throughout the impressively straggly layouts, which extend high above and far beneath ground level. Chasing down a particular thread, like the quest to help a rag-tag Marxist newspaper wrest power from the unctuous Picus Network, might see you stumbling on another as you probe the surprisingly populous recesses of Prague's sewers. Raising a garage door after tracking down a password might create a route to something else, assuming you've unlocked the augmentations that allow you to exploit it.There have been larger locations than those of Mankind Divided, but few peers entwine their offerings so engagingly, and few are as saturated with lovingly crafted distractions - the forlorn remnants of a basement theatre, an apartment that's given over to cat photos in a way that sets your teeth on edge. This sense of comprehensiveness also applies to how the side stories mature and knit together as you proceed through the main storyline, which includes three or four extended away missions that cancel any secondary quests you've yet to complete. A few of the supposedly Tough Decisions feel watery - at one point, I was presented with three dialogue responses that were basically identical - but others have repercussions that kick in at unexpected intervals, and the consequence is a world that grows alongside you.While stealthy exploration and hacking are encouraged inasmuch as you'll learn more about the backstory that way, the quests also do a fantastic job of accommodating a range of playstyles. Aggressive souls will find Eidos Montreal's odd but engrossing blend of third and first-person combat to be much enhanced, though still quite unwieldy next to a true-blue shooter: Jensen is much nimbler around cover, able to auto-run to a waypoint like the agents of Tom Clancy's The Division, and you can now tweak gun stats using collectible scrap, in addition to attaching scopes, silencers and the like. Sneakier adventurers, meanwhile, will relish the ability to execute a corner beatdown without stepping into view or leaving a corpse out in the open. Many of the scenario building blocks are, admittedly, recycled from Human Revolution - every building you'll visit is riddled with ventilation ducts, NPCs are partial to musing about hidden goodies in pocket secretaries, and every other email contains a password or keycode. But Mankind Divided applies these ideas much more confidently and extravagantly, and the aforesaid Overclock augmentations add sparkle to the package. The spectre of Arkane's Dishonored looms large over this aspect of the game: the new Icarus Dash is a cyberpunk Blink, allowing you to zip between second storey balconies and body-slam hapless goons, while the corridor-clearing PEPS launcher is a nod to Corvo's Windblast. If Eidos Montreal has borrowed a few tricks from Arkane, however, it has done so with style, and these ideas find a new lease of life as part of the Human Revolution toolset.The biggest fly in the ointment is that you're still dependent on consumables to power your augmentations, though the system is much more forgiving in Mankind Divided. Jensen's energy bar self-replenishes, but using an active aug will shorten it permanently till you restore the bar using a biocell. I'd rather they did away with the need for consumables entirely, as scraping them together feels like tiresome busywork and takes up precious inventory room, but it's certainly an improvement. The same sentiment applies to Mankind Divided's token handful of boss battles, which are a decent advance on the outsourced attrition fests of Human Revolution but far from best in class. You can go about them any number of ways - placing mines at chokepoints, obliterating the vicinity with a grenade launcher or perhaps ~cheating~ by way of a story item - but none of these clashes stick in the memory.Mankind Divided is a smart, handsome and weighty addition to the stealth-action genre, an oily, ornate hunk of cyber-noir adventuring whose elegance and flexibility shine through its mechanical flaws and occasionally hasty writing. And there are those times when it threatens to be something more - times when it ventures out of its lavishly accoutred comfort zone, just a little, and manages to say something intriguing and provocative about how societies operate. My standout moment came not during a blistering firefight, or while ~recruiting~ security 'bots to the cause, but during one of my frequent trips on Prague's metro rail. Segregation is in force here, with augs required to exit through the right turnstile and stand at the far end of the platform. It's a toothless measure in practice, as ignoring the signs will at worst earn you a nasty remark from a ~natural~, but the twist of the knife is that the game's HUD is complicit, always inviting you to use the departure board at the end of the platform. As a practised gamer, accustomed to going along with the HUD unquestioningly, it took me a while to realise that the interface was effectively discriminating against my character. More of that kind of thing, and Mankind Divided might have been a breakthrough. As things stand, it only continues the revolution."}