{"ref": "https://www.eurogamer.net/mighty-no-9-review", "date": "20 Jun 2016", "game_name": "Reviews", "text": "The nine are, it turns out, extraordinary bastards. Each one of these robots-gone-rogue is taller, quicker and better equipped than Beck, the meek and mannerly rescue bot tasked with saving humanity from his furious relatives. Take Pyro, a mechanical monkey that sets himself on fire before dashing toward you in search of a deadly embrace. Manage to evade his murderous advances while nicking away at his health bar with your pea-shooter pistol and, midway through the fight, he transforms into an even more powerful form. Now, if he manages to grab you, you will die in a single, inescapable squeeze, regardless of how well you've managed to protect your own health bar up to that point. It's leg-poundingly unfair, and establishes the pattern for each of the nine fights that run along this game's crotchety spine. Even before he left his erstwhile employer, Capcom, Mighty No. 9's creator, Keiji Inafune, was championing progressive development practises, arguing that Japan's diminished video game industry is the result of conservatism and creative stagnation. His rhetoric maybe forward-facing (he was, admittedly, responsible for a slew of cross-cultural collaborations between Capcom and other studios around the world) but Mighty No. 9 is firmly rooted in past traditions. It's there in the unexpected insta-kills that, should he brush against the mere suggestion of pink electricity, send Beck back to the nearest checkpoint. It's there in Beck's design, self-plagiarism of Infaune's best-known character, Mega Man, complete with slick helmet and fat boots. It's there in the clutch of lives that, once depleted, force a restart of the entire level, with nothing but a smidgen of muscle memory to show for your time investment. It's there in the overblown voice-acting. And it's there in the nine, each one an end of level boss whom Beck must restore to virtue, each one an extraordinary bastard.Not everything is an anachronism. Mighty No. 9, in an unusual moment of synchronicity, employs a similar mechanic to that seen in the recent Doom. Once they've been struck a few times every enemy enters a stunned state, complete with a dizzied animation. As this point, you can dash into them in order to finish the job and collect a deposit of 'xel', which is used to replenish your health bar. As in Doom, this simple one-two suckerpunch of an interaction is both intuitive and satisfying. Mighty No. 9's designers go further still: when fighting boss characters you are forced to dash into them in order to 'bank' the damage you've dealt up to that point. Fail to do so and their health bar will slowly restore. Mega Man veterans, those to whom Inafune directly appealed with the Kickstarter campaign that helped fund the game, will immediately settle into its familiar rhythm and structure. Each of the 11 stages, which take place in a series of mundanely titled industrial locales ('oil platform', 'water works bureau', 'radio tower' and so on) follow the same blueprint: a side-scrolling platformer, in which you can either engage with, or snip past enemies; a foreshadowing encounter with the stage's boss; further platform wrangling then, finally, the climactic battle. As the game's name implies, the boss fights are the true mettle tests. Each requires mastery of Beck's controls - the ability to dash with precision; a Street Fighter player's awareness of spacing in order to dodge bouncing projectiles; arch dexterity and reactions. The result is one of the toughest video games yet made (even on the deceitfully titled 'normal' mode; 'Hard', 'Hyper' and 'Maniac' await the prodigies) and, as your performance on each stage is ranked, arguably the hardest S-rank in video games.All but the final stage is open for play right from the off, as if the developers acknowledge the scale of the challenge, and want to allow those unable to skip roadblocks. Your chances are improved, however, by completing the preceding one first, as when you defeat a boss, they join your team and grant Beck access to a new elemental form. Defeat Pyro, for example, and you'll be able to curl up into a ball of flame and deflect the ice attacks of the enemies in the next stage. Defeat Cyro, boss of this frozen domain, and you win a gun that can be used to freeze enemies. Countershade, the eighth boss, can turn invisible. There is, however, no explanation of each of these abilities or how best to use them. As the level structure is entirely open, the designers don't know whether or not you will have unlocked specific abilities by the time you reach certain areas, and so cannot design levels or even set-pieces around newly acquired skills. In this way, the design feels disparate, rather than focused and gives the game an unfinished, or at least, disharmonious feel. There are no such shortcomings in the supporting material, however. An EX mode presents scores of training challenges, each one played against the clock, in which you must race to the finish line, defeat all of the bots within the time-limit and so on.  Despite its anachronistic design philosophy, Mighty No. 9 is a game peculiarly suited for today. It's a game for the YouTube screamers, those players who are set up to capture and monetise their frustration while playing a game on camera. And it's a game for YouTube virtuosos, those players able to capture and monetise their extreme talent on camera. For those who aren't being paid to play, Mighty No. 9 is a fascinating, often slick video game. It's arguably Keiji Inafune's best work to date, but for the vast majority of players, it may prove too gruelling to justify its more ordinary pay-offs."}