{"ref": "https://www.eurogamer.net/sherlock-holmes-and-the-devils-daughter-review", "date": "7 Jun 2016", "game_name": "Sherlock Holmes: The Devil's Daughter", "text": "The trick to Arthur Conan Doyle's original Sherlock Holmes stories is that they aren't, strictly speaking, ~Sherlock Holmes stories~, but stories about Sherlock Holmes, written by the esteemed Dr John Watson. Baker Street's most eminent physician might exist in a state of hapless befuddlement but without his disarming narration, these tales of mystery and conspiracy wouldn't be nearly as affecting. Holmes may do the actual detecting, but it's Watson who, as both spectator and accomplice, builds suspense throughout the case, mirrors the reader's awe at each masterstroke of deduction, and creates sympathy for the chilly, obsessive, self-destructive personality at the story's core. In Frogware's enjoyable but undercooked Sherlock Holmes and the Devil's Daughter, poor old Watson is just another sidekick, banished from the stage for entire episodes, who serves mostly to provide covering fire during rickety action sequences or cough up the odd piece of medical trivia. The removal (as in Frogware's previous Sherlock titles) of the old framing narrative was perhaps advisable, given that point-and-click adventure games are about solving things and Watson's role as narrator was, basically, to marvel that things have been solved, but something vital has been sacrificed nonetheless.In a sense, though, these are still stories that revolve around a symbiotic partnership, between the bleak, supernaturally attuned perspective of Sherlock and an everyman interlocutor. It's just that Watson is now you, the player - another useful idiot who can be relied upon to carry out tedious but essential donkeywork such as clicking objects in the right order or shoving crates around. You'll also be called upon to pick a conclusion once all of an episode's clues have been harvested, but it's a choice of which script thread you want to follow, which rabbit you want Sherlock to pull from the hat, rather than what you actually make of the evidence itself.Buried in Holmes's airy, luxuriant Baker Street apartment - the game's hub, where you'll match clues to archive records, don questionable disguises and do a little chemical analysis - there's a completed chessgame, the white king lying forlornly on its side. Whenever I passed that chessboard it reminded me that I was labouring towards a number of forgone conclusions, that Holmes was waiting for me to catch up. Technically, of course, you are Sherlock Holmes in the game, but Frogware often teleports you into the shoes of another character for the sake of a cinematic interlude or an environmental puzzle, and the great detective's ~inner monologue~ creates more of a master-student relationship, castigating the player when you arrange objects incorrectly or try to move on before you're supposed to. This was especially aggravating during the first episode, when I'd worked out that I needed to visit a certain pub in Whitechapel only for Holmes to pompously declare ~I'm not thirsty right now~ as I tried to enter. It transpired that there was a single, throwaway clue I hadn't clicked on in the previous area - a clue that added more or less nothing to my reading of events but which the game rigidly required me to uncover. All of The Devil's Daughter's crime scenes are constructed according to this archaic, tick-box formula, but the UI keeps annoyance at arm's length most of the time - interaction icons turn green when you've learned everything about an object, and there's usually a story beat once you've scoured a room from top to bottom.Having to follow a script doesn't need to be a chore, providing the script is (a) fun, and (b) reasonably well-hidden, and to Frogware's credit, the Devil's Daughter often manages to make you feel like a tremendous smarty-pants even as it tacitly orders you to jump through hoops. The last of the game's four cases (together spanning about five episodes and around 15 hours of play) opens with Holmes peeling back the layers of a suspicious traffic accident - first helping Watson rescue the victims, then working out the order of collisions and explosions from witness testimonies, then rounding up a few suspects. It's a nicely sustained piece of old-fashioned sleuthing, thanks in no small part to some well-researched period art direction. The use of Ubisoft-brand Magic Vision modes - one lets you visualise a chain of events, the other flags up subtle details - feels clunky and contrived, and not everything you're asked to process seems worthy of note: determining that a person is angry by panning up to their angry expression and clicking the word ~angry~ doesn't strike me as one of history's greatest forensic breakthroughs. But there's depth, nuance and ambiguity enough to fire the imagination. Better yet are the deduction-with-a-capital-D sequences, where you join together clues in the darkness of Holmes' cerebral cortex, creating synaptic spider diagrams that eventually lead to a conviction. It's possible to reach a conclusion quickly in each episode on the basis of limited evidence, but you're always kept guessing: the cast might be a caricatured, easy-to-read and cheesily acted bunch, but there are usually at least two people who seem just as likely to be the perp, and Frogware doesn't always reveal whether you've actually bagged the right man.My decisions often came down to scanning documents for some telltale change of tone, some hint of malicious intent that might tip the balance of probability by a hair. The second and third cases are probably the best, in this respect - in particular, I spent ages pondering the agenda of Orson Wilde, an American actor who is studying for the part of Sherlock in a play (which, amongst other things, enables some overdue undermining of the Holmes persona). Outlandish to a parodic degree, Wilde has a habit of turning up when it's least convenient. Is he an absurd, bumbling fool, acting the fool or some mixture of the two? I'm still not sure I know the answer.The Devil's Daughter is something of a variety piece - both in that it makes room for stealth, block puzzles, lock-picking, spot-the-difference and lawn bowling amongst other distractions, and in that these activities vary from passable to awful. The block puzzles are ghastly - at once simplistic and, thanks to a sluggishly animated transition, laborious - and the omnipresent option to skip puzzles completely says everything about the developer's confidence in its own creations. But the speed with which Frogware throws you from one subgame to the next keeps you from fixating on the rough spots, just, and the overall package has a weird nostalgic allure to it. Remember when QTEs were novel, even exciting? This is a compilation from that era.There's a similarly jumbled-together feel to the overarching plot, which hinges on Holmes' relationship with his adopted child, Katelyn, and comes to the fore in the final episode. It incorporates the events of the four cases - you'll find notes about long-term outcomes stuck to the apartment furnishings on the point of a knife, and your decisions are reflected in dialogue - but a suspenseful build-up runs out of steam after the story plunges into mysticism, and the ending is melodramatic fluff. It seeks to provide catharsis for a character who has always held himself aloof from such easy consolations.The Devil's Daughter is a moderately engaging piece of detective fiction which should grip console players looking for an alternative to Telltale's output (the competition is stiffer on PC), but it does seem to rest on some fundamental misapprehensions. Frogware has captured the texture of Conan Doyle's universe, that mix of Gothic dread and icy rationality, but I feel the developer is still working out that the point of Sherlock Holmes is that he's inaccessible - kept at a distance by the very habits of mind that make him so fascinating. Hence, the importance of Dr Watson as an intermediary, dropped between reader and subject like a lens. Ultimately, a game that tries too hard to get inside Sherlock's mind runs the risk of not being a Sherlock story at all."}