{"ref": "https://www.eurogamer.net/the-warcraft-movie-is-too-faithful-by-half", "date": "30 May 2016", "game_name": "World of Warcraft", "text": "The point at which we should have known that the decade-in-the-making Warcraft film (released in the UK today) wasn't going to work out was when its title was extended to Warcraft: The Beginning. Everything misguided about this production can be read into the two words after that colon. The producers' hubris in taking a future franchise as a fait accompli. This film's unsatisfying status as a set-up, rather than a main event. An admission to fans of World of Warcraft that this wouldn't quite be their Azeroth: the film turns the clock back a generation to tell, roughly, the story of the 1994 strategy game Warcraft: Orcs & Humans, and is more focused, but much reduced in scope from WOW's vivid tableau of squabbling races.A couple of years ago, Jon Hamblin visited the set of the Warcraft movie for Eurogamer and interviewed director Duncan Jones and members of the cast and production staff. Then we had to sit on it for 18 months, because film PR is really weird.Above all, that subtitle suggests that the film's director and co-writer Duncan Jones - the talented director of sci-fi nuggets Moon and Source Code - has set out to begin an ascent of the mountain of lore created by Blizzard's head writer Chris Metzen and his team over the course of 20 years, and that this task has overwhelmed what should have been his primary goal: giving  life to the anarchic pop-fantasy universe still loved and inhabited by millions of players worldwide. In World of Warcraft, it's the place that matters, not the story - something perhaps even Blizzard itself doesn't fully understand.Still, it's such an earnest effort, so clearly made with love, that its failure to break ranks with the long line of dreadful movie adaptations of great video games is almost tragic. Warcraft's chief failing is not a lack of respect for the source material, but an excess of it.It's not a good film: dry, garbled, plot-heavy and charm-free, with a seriously anticlimactic ending and strained production design that doesn't manage to resolve the games' outlandish look into a coherent mix of CGI and live action. It will probably baffle anyone with no knowledge at all of Warcraft. It's not a total bust, though. The script has a greater sense of narrative purpose than many recent blockbusters you could name (the last two Hunger Games, for starters). And, intentionally or not, it stumbles on an interesting parable in its sympathetic treatment of the outwardly gruesome orcs: they are zealous but desperate fugitives of an uninhabitable world, trying to claw their way to safe harbour on the humans' green and pleasant land.For a Warcraft fan, there are pleasures to be had in seeing this world on the big screen, too. Much is made of grandiose aerial shots of storied locations like the city of Stormwind and the magical fortress of Karazhan, but I preferred the brief in-jokes - a Murloc here, a Polymorph there - and the potent, neon crackle of the magic effects. Best of all are the orcs themselves, savage, proud, bigger than life and fearsome in battle. The performance capture used to create them is very good, and the orcish cast - notably Toby Kebbell as the noble chieftain Durotan - are more sympathetic and engaging than their live-action counterparts. Back in 2011, I wrote this profile of Chris Metzen, Blizzard's head writer - a man whose office is filled with Marvel and Blizzard figurines. His influence looms large over the Warcraft film.When Jones tries to create Azeroth in front of an actual camera, everything falls apart. The sets look cheap, the costumes look silly and the actors are terrible. The cast would be considered underpowered for cable TV these days: Dominic Cooper is a stuffed breastplate as King Llane Wrynn; Travis Fimmel as the roguish Anduin Lothar and Ben Foster as the comically intense wizard Medivh do all their acting with their hair; Paula Patton is inept in the thankless role of Garona, a half-orc who falls in with the humans and is lumbered with an undignified romantic subplot. (Glenn Close makes an uncredited, seconds-long cameo that makes no sense whatsoever.) To be fair to the cast, the film - which, in its jittery early stages especially, shows signs of having been ruthlessly trimmed of any scenes deemed inessential to the plot - gives them no room at all to build character, charisma or chemistry with each other.Up against the orcs, it's no contest, especially since the monsters look much more at home against the luridly fake backdrops than the people do. Adapting Blizzard's art was always going to be this film's hardest task, considering the studio's love of low detail, high colour and extreme, exaggerated silhouettes. Jones and his production team walk that halfway back towards realism, going for high detail and a more muted colour palette. It works well enough in the foreground, but somewhere in the middle distance the image tends to dissolve into a muddy, unreadable mess.None of this does the film as much harm as its fatal lack of humour. Laughs are few and the mood is of great portent: the touchstones seem to be the grandiosity of Peter Jackson's Tolkien films, a sanitised version of Game of Thrones' brutal politicking, and a soap-operatic indulgence of tragic irony that's all Metzen's. The latter, at least, hits home and feels at home, but where is Warcraft's wackiness, its crude humour, its cartoonish excess, its self-deprecating chutzpah? Where is its carefree trampling of the borders between genres: between high fantasy, steampunk, Gothic horror and bubblegum sci-fi? Either on the cutting room floor, or never present in the first place.Metzen's hand hangs heavy over this film. Reading between the lines of a troubled development that has discarded several directors, including Sam Raimi, and scripts, including one set much closer to World of Warcraft in the timeline, you can sense the persistent stubbornness of a games studio so determined that justice be done to its baby that it has inadvertently got in the way of the craft of movie-making. It's said this earlier storyline was chosen to make it easier for audiences to grasp the concept that the big green monsters weren't all bad guys, which makes a degree of sense. But I wouldn't be surprised if it was also because Metzen wanted his story to be started from the beginning and done just as he wrote it - which, to a remarkable degree, it has been. Combine that with modern Hollywood's obsession with putting the franchise cart before the storytelling horse, and you have what amounts to the most expensive lore wiki ever made; a film whose ending will have no impact for anyone who doesn't know who or what Thrall is; and a story whose greatest moments all lie in sequels that will, in all likelihood, never get made."}