{"ref": "https://www.eurogamer.net/the-witcher-3-blood-and-wine-review", "date": "26 May 2016", "game_name": "The Witcher 3: Wild Hunt", "text": "The most endearing thing about the knights of old is not their chivalry, their boldness or their devotion to beauty. Rather, it's how enthusiastically they use those three qualities to justify behaving like total idiots. Take Sir Lancelot in Chrétien De Troyes' The Knight of the Cart, for instance. In one passage, Lancelot watches from the highest window of a tower as the queen rides past, gazing ~attentively and with pleasure at her.~ Then, ~when he could no longer see her, he wanted to throw himself from the window and shatter his body on the ground below.~ He tries it too, just like that; the anguish of having a pretty lady break his line of sight is enough for this valiant knight to throw a whopping, potentially fatal tantrum. It delights me to say that the knights of Toussaint, the new region on offer in The Witcher 3: Blood and Wine, are no less sincere. Or stupid. In the second and final expansion for The Witcher 3, Geralt is whisked off to an opulent region of bold knights and boastful deeds; one that might just be the most beautiful open world ever seen in a video game. The Temeria of The Witcher 3: Wild Hunt was often a grave and unforgiving place where pockets of colour fought for their place in the world. Toussaint, meanwhile, is all bravado; a rich colour palette bursts from every corner, the armour is frilly and pompous, and the city guards issue warnings in rhyming couplets for crying out loud. The vibrant, almost garish campness of Toussaint forms a pleasing contrast with Temeria that's only improved by the addition of the surly, unkempt Geralt of Rivia. From the moment the first dandyish knights sashay into view, it's clear CD Projekt Red is determined to have a bit of fun in its final outing with The Witcher - indeed, Geralt is such a predictably salty counterpoint to all this pomp and bluster that Blood and Wine's opening section feels like one long, knowing wink. One of the first things Geralt does in this new adventure is find a handkerchief monogrammed DLC, and that's just the beginning; he kills a giant, attends a gladiatorial battle in a tournament arena and is gifted his very own vineyard, all in little over an hour. But, while Blood and Wine's setting is rich and playful and more than a little silly (the most popular expletive in the region appears to be 'bumbotch', if you were wondering), that's not to say it's all a frippery. Blood and Wine's main story is a bloody, foreboding yarn to rival the most memorable questlines of Wild Hunt. A very large, very important contract has Geralt doing some of his best sleuthing, even if the mechanics comprising said detective work are nothing new. It's possible to go on a frankly bizarre tangent in the latter portions of the main questline - something I predict will prove divisive among fans - but all in all the core story is exceptionally well paced, keeping clear of the drudgery that weighed down certain aspects of the base game. A few of the side quests, meanwhile, are fripperies, and they're all the better for it. While Wild Hunt certainly had its moments of levity, most of its side quests were grim cautionary tales of one stripe or another. Blood and Wine's secondary missions strike an altogether lighter tone, with frequent forays into the ridiculous. The business of Witching can still prove every bit as grisly in Beauclair as in Novigrad, but it can also send one off to find the stolen testicles of a famous statue. The sheer unpredictability of these quests helps make Blood and Wine feel as much like a holiday for Geralt as the next chapter in a long and harrowing career.Pinched coinpurses aside, Blood and Wine is an impressive expansion because it manages to innovate despite having the unenviable task of closing out a game that's already over a hundred hours long. A lot of that sense of innovation stems from sticking Geralt in such a different setting, naturally, but it also stems from some welcome gameplay additions - of which the extended mutations system is the star. Aimed specifically at high level players with character points to burn, Geralt can pour extra points (and mutagens) into researching a fistful of enhanced mutations, each lending a different - and devastating - edge in combat. These abilities are very deliberately bombastic, verging on the absurd: one gives you a sky-high damage bonus based on how many enemies you're facing at the start of a fight, for instance, but then hobbles your damage stats based on how many of those enemies are still standing thirty seconds later. Another - my personal favourite - turns the Aard sign into a blast that freezes any enemy it doesn't knock over while exploding any it does. It's effective enough against groups of smaller enemies to feel borderline overpowered, but making bandits explode with a flick of the wrist is too much fun to consider passing up. As with runesmithing in Hearts of Stone, Blood and Wine is very keen to offer up these new abilities straight away. A quest leading to the new mutations is available from the very start, with the same going for the new sets of witcher gear. Witcher gear can now be dyed, by the way, but don't go in expecting to have Geralt dressed head-to-toe in hot pink. All of the colours are quite tastefully chosen, so you'll have a hard time making Geralt look completely ridiculous. Believe me, I tried. New mutations and tastefully dyed witcher gear can both be tested on the new additions (or reintroductions) to the bestiary; a lineup of about twenty monsters including scurvers, archespores and barghests. CD Projekt Red has made no secret of its intent to disrupt player habits in Blood and Wine and, for the most part, these new enemies do just that. Quite a few fights forced me to break from my traditional method of quen-roll-aard-slash-hack-repeat which, again, is quite impressive after hundreds of fights in the main game. Hanses also do a good job of bringing something new to non-monster encounters; these are large, fortified bandit camps swarming with enemies. Each Hanse is a fun challenge if only thanks to the sheer number of combatants. They may not be the most groundbreaking addition to feature in Blood and Wine, but they're welcome all the same. One of the stranger additions - and sadly Blood and Wine's most disappointing aspect - is Geralt's vineyard, which is meant to form a base of operations for Sir of Rivia during his time in Toussaint. As the apologetic (and excellently named) majordomo Barnabas Basil-Foulty explains on arrival, Corvo Bianco is in need of a little sprucing up. Unfortunately, while they do provide a perk or two - increased stamina for Roach from the stables, a vitality boost from buying a new bed - the renovations made available to Geralt are pretty few in number. Affording each and every one right off the bat isn't likely to be an issue for anyone who's finished the main game, making short work of an otherwise promising mechanic. Even getting the game to roll you a new character specifically for Blood and Wine nets you more than enough cash to bankroll the entire renovation.The lack of upgrades on offer may be disappointing, but the vineyard is nonetheless a great tone setter for Blood and Wine. It creates the sense that Geralt's time as a Witcher (and our time with Geralt) is drawing to a close; that there may soon come a time when he puts down the sword and adopts a quieter lifestyle. It's a tone that resonates throughout the expansion, maintaining a sense of poignancy and reflection in a region of pomp and excess.  All in all, Blood and Wine is a fitting swansong for The Witcher 3. It's a playful goodbye, but also a testament to what made the series so good in the first place. It brings a vibrant new perspective to the world of The Witcher while remaining true to the gritty, medieval P.I gameplay that made it great in the first place. It's an emotional yet mirthful fairytale; one every Witcher fan ought to experience."}