{"ref": "https://www.eurogamer.net/raiden-5-review", "date": "16 May 2016", "game_name": "Raiden V", "text": "Editor's note: To mark the EU release of Raiden 5 on Xbox One, we're republishing our original import review of the game, which first appeared on the site this March.For 20 years the trend in shmups has been to pack the screen with as many bullets as possible, but Raiden likes to play things a little differently. This, after all, is a series that helped shape the modern scrolling shooter as we understand it today, so why should it follow even the most protracted fashion in its form? Like R-Type and Gradius, Raiden has been around long enough to know bullet count alone as a 2D shooter status symbol is a meaningless metric.\u2028Raiden 5, the first new series entry in nine years, is absolute in its commitment to the traditional shooter form. What that means is relatively low numbers of bullets on-screen at a given time, stripped back scoring mechanisms, and a dose of the hard military sci-fi theme that dominated the emergence of the genre at a time scrolling playfields were becoming a norm.\u2028Don't be fooled, though, as developer Moss has crafted a demanding arcade experience with plenty of nuance - albeit one yet to see release on a cabinet. This is a game that feels no shame in demeaning the skill of its players, and with a mere scattering of bullets Raiden 5 can back you into a corner in a fraction of the time commonly seen in Cave's iconic output.\u2028Before going any further, though, it's worth covering the practicalities. After all, Raiden 5 is a Japanese-only release, and Xbox One exclusive. It's entirely region free, however, and while there exists a bounty of solely Japanese flavour text for the oddity that is the player who turns to shmups for narrative, all the fundamentals needed to play the game are in English. \u2028With such pragmatic concerns out the way, the great news for fans of the form is that Raiden 5 feels absolutely like a Raiden should. After a couple of less than gentle starter levels, it lunges out the gate at a furious speed. Aimed enemy shots and sudden, narrow bullet streams from fixed points demand an extremely confident, high-energy play-style, where leaping between rapid sweeping ship movements and static straight shooting delivers breath-catching pacing, and a rate of play that's too rare in the genre that conceived artificial slowdown.\u2028A version of the superb Flashshot scoring system that sung in Raiden 3 and 4 returns, distilling risk-reward gameplay into something raw. The sooner enemies are downed, the higher a multiplier applied to their given score climbs. Scoring well typically demands point blanking and plenty of time spent in the top half of the screen, where taking a hit is far more likely. There's also a combo meter reasonably comparable to that made famous by genre heavyweight Dodonpachi, meaning the more enemies you dispatch in quick succession, the higher the maximum score multiplier for each enemy climbs, to a limit of x6.0. It's a system that engenders bold, pedal-to-the-metal play, and to be guided by it is to enjoy a hugely exhilarating experience.Where stage design and aesthetics are concerned, meanwhile, everything will be tremendously familiar to Raiden veterans. From the theme of each level to a list of set pieces established in the first release in 1990, all the Raiden tropes sit obediently in their place. That ultimately means an experience that is both delightfully familiar and wide open to criticism for its lack of innovation.\u2028There are plenty of gameplay changes, though, from understated tweaks to mechanics to wild changes that are likely to prove particularly divisive within the most hardcore 2D shooter audience. Raiden 5 is a game that, despite an otherwise rigid obedience to the arcade-forged, credit-based shmup framework, replaces lives with a health bar. It works rather well, but that hiss you hear? That's genre devotees muttering 'Euroshmup' under their breath; a derisive term applied to 2D shooters of any geography that err from the design conventions that have long-served Japan's game centres.\u2028More problematic are the changes to the weapons system. There are still three core weapons denoted by colour; a wide, weak red spread, a powerful blue needlepoint laser, and the infamous purple 'toothpaste' shot; an eccentric looping beam of light with erratic homing capabilities. A single pick-up that changes colour between the three every few seconds lets you power-up your weapon and change firepower choice. But where previous games gave you ample opportunities to switch weapon for particular sections, here the gaps between power-ups are so infrequent, it's invariably a risk to move away from the all-rounder wide shot, as you might be stuck with the sporadically advantageous blue laser for long sections where it is grossly unsuited. Add to that the fact that your secondary missile weapon is selected before you start - rather than being available to change mid-game as seen in previous Raidens - and a significant strategic element has almost entirely vanished.\u2028And then there's Raiden's damp squib innovation; the Cheer system. The idea is that as you tackle the game, other real players' simultaneous progress flashes up in the corner of your screen. A stab of the 'Cheer' button part fills a bar that lets you unleash a special attack, and presumably sends a message of encouragement to your contemporary. Read 'presumably', because in 14 hours of connected play, and despite dishing out Cheers like they were promo tat at E3, this player did not receive a single 'Cheer'. So either the system isn't working, or I totally repelled every Raiden 5 player globally.\u2028Along with occasional and mostly jarring zooms to and from the playing field during gamplay, many will baulk at the fact this is a single-player only game. That wouldn't typically be a problem in the genre; many hardcore shmups' scoring and gameplay systems become so overcrowded in two-player mode that any multiplayer setting is largely a novelty. Except that for years Raiden has excelled in offering 'Double Play' mode, where one user controls two ships simultaneously for a combined score. Raiden is rare in supporting the play-style made famous by those bewildering Ikaruga videos, and it always excelled in doing so. But with no two-player setting, there's no capacity for Double Play. For the few that care, that is a true shame.\u2028Raiden 5 is also almost an hour in length through its eight stages; making it somewhat drawn out when the form favours shorter gameplay sessions. Still, in spite of a catalogue of flaws, rough round the edges visuals and a confused approach to innovation while respecting its heritage, Raiden 5 is immensely rewarding to experience. It feels every bit like a Raiden should, and provides a platform for a gameplay style rather distinct in a genre boxed in by its own conventions.\u2028Moss' latest is neither a convenient entry point for newcomers to 2D shooters, or obedient to the expectations of shmup devotees. But Raiden 5 is exciting, demanding and constantly rewards those that give it their time, taking players on a journey where skill and ability increase with every credit.\u2028This just isn't a shmup for everyone. It's not even a shmup for every genre obsessive. But for players willing to try something different, it can prove superb. That's a hard sell for an import title, but give it time, and you might find yourself longing for more 2D shooters that dare turn a blind eye to the prevailing taste for bullet hell."}