{"ref": "https://www.eurogamer.net/call-of-the-sea-review-eerie-puzzles-in-paradise", "date": "5 Mar 2021", "game_name": "Call of the Sea", "text": "One game really leapt out at me during the Xbox Series X showcase earlier this year, leapt out like a big wet fish. It was Call of the Sea. I'd never heard of it and never heard of the developer. But even among all the other blockbusters it stood out. And once I'd seen it, I couldn't stop thinking about it.It was partly the setting: a vintage, 1930s exploration mission to a dazzling tropical island, where colours burned brighter than life. Literal red sun baked the sands, literal green shone luminously from pools. It was a cartoon exaggeration of paradise. But it was also the tone. Here was a non-violent and eerie game about a lone female on a voyage to find her husband, whose expedition hadn't returned from the island. An island that appeared to be calling to her. Who was she, Norah Everhart, and what happened to her husband? And what was waiting for her there?The prospect seemed magical. I know now, having played Call of the Sea: it is.It surprised me how much of an adventure game Call of the Sea is. The game is broken into chapters, and each of these takes place in a self-contained area of the island, which you cannot leave until you solve a handful of major puzzles there. Since this is a game, these puzzles often focus on opening a door of some kind, but not always.Solving puzzles involves combing the area for clues, until you have all you need to tackle the conundrum at hand. Clues can take many forms, but usually a fair few are gleaned from the detritus left by your husband's expedition. You always seem to be one step behind him. So you nose through photographs, letters, notes and drawings for anything which can tell you how his team managed to proceed. You have one crucial tool to aid you in all of this: your journal. This both serves as a place for Norah to record events, and as a quick reference dump for clues. It's tremendously handy. Not only will Norah automatically record the vital clues you find, she'll also often elaborate on them, providing the spark you need to solve the puzzle.The puzzles themselves usually center around some kind of contraption, often those invented by your husband in order to overcome a hurdle in the island. Therefore, solving the puzzle will involve both working out how your husband's contraption works, and understanding the puzzle he was trying to solve. It can be taxing work. There's always enough space left for your brain to have to make the leap between clues and answer. Sometimes the answers are obvious, other times, more obscured. I'm a bit embarrassed to say two puzzles collectively took me about four hours to solve, if not a bit more. Both were in the same chapter, though different areas of it. I had everything I needed to solve the puzzles but no matter how much I looked at them I couldn't see the answers. It's a bit like doing a Magic Eye puzzle: you stare and stare and stare in the hope something will magically materialise. When it does, it will seem obvious, but when it doesn't, it's just impenetrable noise. In one of the puzzles, understanding did magically materialise, but in the other, it did not. I still don't know why that lucky turn of the dial opened the door but I'm bloody glad it did.There can be frustration then - although I should point out that those two particular puzzles were outliers, and none of the others stumped me like that. But from frustration comes a fluffy kind of elation when you do get through. And to be honest, in a game gated solely by puzzles, I'd prefer it this way around. Yes, it leads to walking back around areas wondering if you've missed something, but I can't think of nicer areas to walk back around. And in your thoroughness, you allow time for the story, and for a deeper appreciation of the environments around you.The template wears thin eventually. However varied the environments may look, and the puzzles within them may seem, they all boil down to putting things in the right sequence in order to unlock some kind of door. I believe Out of the Blue has done all it can with the systems available in its game, it's just that there aren't that many elements here, and the resulting effect is a kind of weariness and deflated anticipation for what's to come - because you're fairly certain what it will be. Especially when you've spent a good chunk of time solving a puzzle beforehand.It's something a game like Uncharted - a very similar kind of game - gets around by having combat and traversal mixed in. In this way, Uncharted can go from puzzle to shootout to monkeying around and give each component time to refresh and breathe. It's not the same here.But though that puts strain on the core, I'm glad Call of the Sea doesn't do those other things. Having no combat calms everything down and makes more sense contextually with who you are in Call of the Sea. Likewise, traversal. This a lady who has used a cane and been in bed with a mystery illness for most of her life - why would she be swinging around like a monkey now?Call of the Sea can't dazzle with sheer cash and work-hours the way Uncharted does, or build to quite the same spectacle. And you don't have to look too closely to see where compromises have been made, or to hear them (I know it's petty but I wish the beautiful score had been performed by live musicians rather than a music program), though I should say Cissy Jones brings a touch of class to voicing Norah Everhart. Which isn't to say it's not beautiful, by the way. It's a kaleidoscope of colour and vibrancy, and seeing the island open before you, in more and more miraculous ways, will almost certainly elicit a few wows.But instead Call of the Sea dazzles by being different. A bigger game would never be this weird. A bigger game would never tell a story of love and self-discovery in this way, and do it without resorting to violence, and, though it pains me to say it, tell it about a woman. It's that independence which made Call of the Sea stand out during the Xbox Series X showcase and what makes it stand out now."}