{"ref": "https://www.eurogamer.net/project-x-zone-2-review", "date": "7 Mar 2016", "game_name": "Project X Zone 2", "text": "It's hard to describe Project X Zone 2 without using the phrase ~fan service.~ Because that's exactly what it is. A decadent celebration of crossovers, rife with in-jokes, sometimes inappropriate humour, and the kind of quasi-innocent and often contentious sauciness that permeates many anime. As a game, it's a relatively light offering, mashing the feel of strategy RPGs with side-scrolling beat 'em ups. But it's fun in the same way that pizza is great: a terrific indulgence that works so long as you like cheese.And seriously, Project X Zone 2 is gorgeously, unabashedly cheesy, completely aware its own irreverence, and the fact that it was never intended to become a meaningful magnum opus, but a platform for joyous silliness. If you've ever wanted to see Goro Majima cheerily talking up Phoenix Wright to Tekken's Heihachi Mishima, or characters mulling over how Chrom and Lucina could be father and daughter, you'll get it all here. There is, of course, a plot here but it's thin. Trans-dimensional beings are causing havoc as are a medley of portals, and the only way all of this can be stopped is if the heroes (and anti-heroes) from various worlds join forces to overcome what is likely a force of tremendous evil. That's what you start with. And Project X Zone 2 takes it time to meander towards its inevitable conclusion, frequently taking detours into the realms ~what-if~s and ~hey, wouldn't it be cool?~ When played in short bursts, it's perfect. The localisation team has done an incredible job at presenting the hilarity of the premise, even if their jokes occasionally raise an eyebrow. It's because of this that I hesitate to say that there's a lack of pacing. The slow burn feels incredibly deliberate. Consequently, if you're looking for a tightly written narrative, you're not going to find it here. Project X Zone 2 suffers mildly from overcrowding. The video game experience is finite. Variables like budgetary constraints and the team's mental factors are all factors that plays into the length of the game. If Project X Zone 2 could be transformed into a ten-year extravaganza, things would be different. There would be space to have all the characters contribute meaningful quips, without making it all seem slightly breathless. But it's enough and so, we're left occasionally feeling overwhelmed by the rush of faces. (At least, I was.)But let's move on to more technical concerns. The bulk of your time Project X Zone 2 will be spent in battle. There was two components to it, essentially. Before your characters can dive into action, you must maneuver through a tile-based map in an effort to optimize positioning. Your parties can flank enemies and alternately, be flanked by adversaries, meaning that you may want to consider where you leave them after their turns, especially as you progress through the game. Additionally, the playing board is also riddled with obstacles and objects to collect. Regardless of what you decide in the overmap, however, it eventually comes down to actual combat. And here, Project X Zone 2 shines. Teams are comprised of two members, mostly from the same series. Occasionally, they're seeded with ~solo~ characters, who aren't so much active presences as they are special moves incarnate, manifesting with all the splendor of Goku gone super saiyan. Having said that, I'm still undecided as to how I feel about the battle system at large. Instead of simply watching two oppositional forces interact as is often the case with turn-based RPGs, you take an active role in how a conflict plays out. Attacks are carried out through button combos. Nothing complicated, of course. Nothing like the intricate sequences common in Tekken or Street Fighter, and certainly nowhere near as numerous. But certain sensibilities carry through. Chain attacks for maximum bonuses. Juggle enemies to keep them off-guard. Use specials sparingly and with great intent. It's also possible to call in assistance from allies, namely those adjacent to your active force and it's quite rad to see a four-on-one break loose.Similarly interesting is the fact that XP is an expendable resource in the game, and not just in the ordinary sense. Mirage Cancel, which lets you interrupt your own attack animations, costs XP. Certain special attacks cost XP. (Or was it SP? One of the two. I can never remember which is which.) You're going to have to juggle your immediate needs with the long-term growth of the character, and that's genuinely cool. As you progress through the game and things unlock, you'll also have to negotiate the vagaries of customisation. Exactly what do you want your roster to do? The skill system allows you to enhance your characters with unique abilities and bonuses, which may turn a ho-hum entourage to a killing force. Throw in the right set of equipment and you'll be set for the game's bosses, all of whom seem to pack a punch.I'm also going to break for a moment to lament about two things. The first is likely the most subjective. Project X Zone 2 drags in parts, perhaps because there are just so many characters involved that finding screentime for all of them can be difficult, to say the least. That impression of sluggishness could also be attributed to the fact that combat occasionally feels like button-mashing, particularly in regards to cannon fodder. More than once, I found myself tapping away irritably as I tried to clear my way to the bosses, who are infinitely more entertaining to butt heads with.And now, for the second thing. The graphics. The quality of the visuals is amazingly incohesive. Project X Zone 2 is most impressive in motion, with combat being this hyperactive explosion of over-the-top moves and fluid animations. However, the character portraits left me wanting. It's not bad, per se. I've seen worse. But the coloring is flat and the proportions always seem slightly off, resulting in a slightly disjointed sense of aesthetics. Still, it works. And the game as a whole works.  I'll admit that some of its allure was lost upon me. I love Phoenix Wright. I love Resident Evil. And I have nothing but nice things to say about Mega Man, Street Fighter, Fire Emblem, Yakuza. But I've never played Resonance of Fate (sorry). I only vaguely enjoyed .hack, preferring other anime of its time. Sakura Wars made no impact on my life. So, when the characters emerged, I went ~Huh!~ and chuckled through their escapades, aware that someone else would have squee-ed instead. The point I'm trying to make here, if that wasn't already amply obvious, is that Project X Zone 2 needs you to enjoy all these other games to make it a great time.But you wouldn't be reading this if that thought didn't excite you, would you?"}