{"ref": "https://www.eurogamer.net/plants-vs-zombies-garden-warfare-2-review", "date": "24 Feb 2016", "game_name": "Plants vs. Zombies Garden Warfare 2", "text": "Does everyone talk to themselves when they're playing games, or is it just me? I'm not just chatting rubbish about the weather or the state of the economy you understand - I just like to consistently reaffirm my own opinions about whatever it is I'm currently thumbing through. It's probably a dangerous character fault that has developed over a decade of reviewing games, but I'm ok with it. My inner monologue sounds a little like Mark Kermode passionately explaining something to a slightly bored Simon Mayo. In both Garden Warfares, this inner voice said the same thing at pretty much the same time. About 45 minutes in, three or four matches deep, it said 'hold on, this really is very good, isn't it? No, it really is good'. And it's strange that it came as a surprise this second time around, because PopCap already proved itself to be a high calibre purveyor of horticultural battle. Now, in Garden Warfare 2 everything, as its own tagline says, is bigger, better... bigger!' This is now a 12 on 12 shooter, playing out across 12 maps (how very imperial), with the action taking place over a smattering of familiar modes. Vanquish and Vanquish Confirmed are standard Team Deathmatch, and Kill Confirmed. Gnome Bomb is essentially Search And Destroy, where both teams have to find little explosive gnomes,carry them to the enemy's base and protect them while they count down to their explosive demise. Suburbination is Domination - three points to capture and hold - and welcome mat just lets new players jump in and play with each other while they learn the ropes. Or picket fences.Again, the star mode is Garden Warfare's map-spanning combination of Rush and Conquest, now rebranded Turf Takeover, as it encompasses its predecessor Gardens and Graveyards as well as Herbal Assault, where you now play as the plants looking to crush the zombies. This is where Garden Warfare 2's character classes really come into play. On the smaller modes, the characters with the most killing power tend to crush everything in their path. In Turf Takeover, though, you have to be more tactical. Essentially, it's a game about pushing back an enemy frontline until you can reach their base, and taking that base over. If you're the plants, then even attempting to capture a point without a health-buffing sunflower in your crew is suicide. And you'll need a couple of Kernel Corns to drop air support on the enemy while you're in close. Don't forget about those Cacti and their long-range spikes, either. There's a lot to think about.Part of the joy of Garden Warfare 2 actually comes from experimenting with those classes. There's a lot less pressure here than in a typical online shooter - perhaps it's the bright and breezy visual treatment (it's absolutely gorgeous by the way, and silky smooth at 60fps) - but death doesn't feel like you're letting your teammates down, and even losing isn't that deflating. You're still earning plenty of coins to spend in the sticker shop to unlock new amusing customisation options. Every character has three abilities each, all governed by a generous cooldown. Mastering when and how to use these is often the difference between winning and losing, and in Turf Takeover only the team that knows how to manage the battlefield with their abilities will win.There are six character classes per side initially, from the familiar zombie scientist and football-playing All Star to the new cyborg orange known as Citron, but unlock enough stickers and you can have a roster or over 30 characters. New versions of each class can be pieced together with stickers, with new costumes, new weapons and even new abilities ready to be played with. There's always something to work towards in Garden Warfare 2 - something other shooters like Star Wars Battlefront and even the mighty Titanfall struggled with.Before we delve into the surprisingly deep selection of modes that stretch beyond multiplayer, though, a warning. As it stands, there is a real balance issue with Garden Warfare 2, and if it isn't addressed, it makes the game impossible to recommend. The Rose is grossly overpowered - she can move faster than most, has a devastating main attack and very powerful abilities. There's even an ice version that can literally freeze an enemy completely for a few seconds, leaving it completely incapable of defending itself.In fact, the plants feel overpowered in general. They have ways to attack from the sky, underground and straight-ahead that the zombies just can't match, and I can barely remember winning a match in any of the modes with the zombies. It's a big problem, but it is one that can - and should - be fixed. Even a slight nerf to the Rose's main weapon would help a lot. So tread cautiously - this is still a very, very fine shooter constructed out of the shiniest and loveliest of chunky, loveable blocks, but it's also absolutely infuriating in its current state (or hilariously enjoyable if you're playing as The Rose). These issues don't really affect the rest of the game, of course. Garden Ops, the horde mode equivalent that most closely resembles 'classic' PvZ, returns in expanded form, with large boss enemies breaking up the waves and more 'tower defence' style options available, again found in sticker packs (all of which are only paid for with in-game currency, by the way) and the ability to, once again, play as the zombies. Decent stuff, and a nice break from the carnage of multiplayer.Nicer still is the Backyard Battleground. In its simplest state, it's a hub to access your various multiplayer options and character customisations, as well as an open area with endless bot battles popping up all over the place, so you can run in and shoot stuff until you get bored. Dig a little deeper, though, and Backyard Battleground starts to reveal some neat little secrets. There are tonnes of little shortcuts and hidden areas to find, either filled with treasure chests, different gameplay ideas or just silly gags. A football pitch presented by Pea A Sports? Yeah, that'll do nicely. Backyard Battleground even hosts a campaign of sorts. Quest givers offer up simple fetch jobs or instanced versions of Garden Ops, and completing them gets you the stars you need to unlock treasure chests. It's not exactly The Last Of Us but it's an entertaining way to take you through the game's various modes, all with a few gags and some fine looting. Enough to justify the price point? It's a tough call. If you remember correctly, the original Garden Warfare launched at a budget price, whereas its sequel is a full fat affair. Price is a relative issue, of course, but it's fair to say PopCap has done its utmost to turn Garden Warfare 2 into a package that feels complete and 'premium'.So, it's just that thorny little issue of balance, then. While this isn't quite in the upper echelon of shooters, it's certainly better than most - a deeper, more satisfying and consistently entertaining game than Star Wars Battlefront even - and with a few fixes it will keep an audience happy for a long time to come. They really need to do something about that Rose, though."}