{"ref": "https://www.eurogamer.net/unravel-review", "date": "8 Feb 2016", "game_name": "Unravel", "text": "A promising but, in the end, disposable cousin of Media Molecule's LittleBigPlanet, Unravel is built around the idea that love is literally a thread - a spool of shimmering red yarn that usefully doubles as a grappling line. Your task as the game's adorable (if vaguely demonic-looking) doll protagonist is to save a lonely old woman from despair by effectively stitching her memories back together - dragging that thread from one side of each level to the other, while searching for tiny knitted emblems that symbolise catharsis and acceptance. Once collected, these emblems are added to the old lady's scrapbook in the parlour that serves as Unravel's hub, restoring the photos within plus a few wistful sentences of exposition. The moral is that while cherishing the past is important, at some point you have to let go - hardly an original theme even within the world of platform games, and sadly, all developer Coldwood Interactive really does is string the idea out for five to 10 hours or so.Being made of wool himself, Yarny has some unusual capabilities. He can lasso highlighted objects to swing from them or drag them around, and tether things to each other to create bouncy tightropes or hold moving structures in place. The catch is that there's only so much yarn to work with, and Yarny unravels as he moves, fibre spilling out behind him like a loop of intestine. Jog too far and he'll waste away to a feeble skeleton, obliging you to search for a yarn ball to replenish the stock before you can proceed. It's a touching little commentary on how we grind ourselves down in times of stress, and might have been the basis for some excellent puzzles in the bargain, but the game never quite manages the feat.Unravel won a lot of praise on its E3 2015 debut for its gentle pastoral ambience, which certainly stood out amid the pyrotechnics of EA's presser. Up close, though, the tone is somewhat cloying and affected, for all the beauty of individual assets and effects. This is one of those games that wears its heart on its sleeve like an expensive, shiny bauble, to be waved under the player's nose at every opportunity. It begins and ends with an earnest letter of thanks from the development team - a polite form of emotional blackmail, I can't help but feel - and the environments are largely the stuff of glossy conservation magazines, all golden leafpiles, retro gardening memorabilia and soft-focus sunsets. The soundtrack, needless to say, features quite a lot of acoustic guitar. It's a shame that the broad strokes of Unravel stick in the throat, because certain nicely captured details suggest that the team is capable of a more subtle performance. Yarny's body language changes as the story goes on, for example, from wide-eyed and jaunty in the early sections to cowed and hopeless in the final third.The sugary tone would be easier to stomach, perhaps, if the puzzles were more gripping, but Unravel is ultimately a competent genre piece with a few quirky flourishes. The idea of being limited in your movements and actions by the amount of yarn available has, I think, real potential, and there are a few scenarios that make a serious go of it. One sees you struggling up through a series of tunnels, running out of thread just short of the exit until you drag certain props around to create handholds and thus, a more direct and efficient route. I'd love to play a game's worth of such conundrums. Elsewhere, you'll tether the line to a heavy door and wrap it around a platform to create a rudimentary pulley, a neat puzzling gambit that craves expansion into something properly tortuous. But this is, unfortunately, as knotty as Unravel gets.Most of the time, the game contents itself with more generic activities - swinging along a series of grapple points, weighing see-saw structures down and working your way past various oddly psychotic animals. Unravel is firmly on the side of Mother Nature as a story - there's a chapter set in a toxic waste site which accompanies some preaching about the evils of profit motives - but as lovable as he is, Mother Nature really has it in for Yarny. You can look forward to magpies who'll carry you off when you venture out of cover, crabs who must be tricked into cages before they smash you against the floor, and gophers who'll chase you through warrens, tumbling into pits in their eagerness to bite your head off. That's in addition to lethal terrain hazards such as crumbling surfaces, exposed electrical circuits, rock slides and thundering pistons. Unravel is hardly Super Meat Boy, but it'll kill you more often than the cheery packaging suggests.Each level has its share of unique dynamics that alter the tempo slightly, though none of them has a genuinely transformative effect. A chapter set in the depth of winter features snowballs that grow larger when rolled, and branches that spring back when you brush away the drifts, flinging Yarny into the air. While exploring the beach you'll have to worry about waves sweeping in from the background as you barrel along the underside of a footbridge. Then it's off to the boglands, where there are sluice gates to open, rafts to drag from one pool to the next, and clouds of bugs who'll stop you throwing yarn until you swat them away.The experience is never awkward, though I had an annoying time with the final level thanks to a blizzard that made it hard to work out what I was attached to. Coldwood has nailed the handling, with only a couple of fiddly sections where the controls feel loose, and that's no minor feat for a platformer that's as dependent on real-time physics as this one. But none of it sinks into your brain like, say, last year's Ori and the Blind Forest, or the unutterably great Mushroom 11, which not only reinvents how you move in a game but elaborates on the concept brilliantly as the campaign unfolds. Unravel's challenges don't develop in this way; instead, they become routine. I grew so used to the prop-based puzzles, in particular, that I'd grab hold of objects absent-mindedly before I knew what they were for.If all you want from Unravel is a restful play with some decent production values, then many of the above complaints can be ignored. Yarny himself is a delight to witness in motion, a comic yet tenacious sprite tottering through an increasingly unfriendly world, and the yarn mechanics are satisfying to consider, even if your mastery of them is never seriously tested. But if you're after rigour and structure rather than sentimental overtones and a cuddly lead, this is money for old rope."}