{"ref": "https://www.eurogamer.net/not-a-hero-review", "date": "4 Feb 2016", "game_name": "Not A Hero", "text": "Not a Hero is released on PlayStation 4 this week. Here's our review of the PC game, first published on 14th May 2015.All of the action in Not a Hero is precipitated by Bunnylord, an anthropomorphised purple rabbit that wants to win elections by fighting crime. Well, by your fighting crime on his behalf anyway, with 'fighting crime' meaning 'kill every single criminal you see anywhere.' Bunnylord lives in a world of absolutes and, as his agent, so do you.Not a Hero is a game about shooting criminals in the face. It's a 2D shooter on two planes: characters move and shoot in the forefront, and take cover in the background. The style is an oblique projection, so the environments give an impression of depth but are never visually confusing about which plane the moving parts are on.Such clarity and precision are the hallmarks of what on the surface looks like a blood-soaked murderthon. Not A Hero certainly is the latter, but the system underpinning it is about speed and finesse - tapping A on a 360 pad moves into cover, X shoots, and Y is for special weapons. Interactive busywork like setting bombs and picking up ammo is smartly automated with a proximity timer, concentrating everything down to these three core options which, 95% of the time, are really only two.A small pool of rechargeable health is another well thought-through mechanic: this allows you to survive bad decisions with quick-thinking, and escape when things go badly, but disappears instantly under any kind of sustained fire. A single shot never means death in Not A Hero but, when you make bad moves, many more than that will be incoming.Not a Hero is all about first learning and then trying to dance through the staccato rhythms   of its gunfights. Enemies can be shot when peeping or running out from cover, with close positions leading to critical one-shots, and can also be tripped for a temporary stun and execution. What to do in any situation is obvious, with a bit of thought - but Not A Hero has a brilliant mix of on-the-fly throwdowns and encounters you can plan for. The levels soon start taking advantage of this too, encouraging several explorative attempts to find secret routes and effective entrance points, before you try to bring the house down.The structure could be described as perfect for speedrunning, with each level having one main objective and three subsidiary objectives that dictate a certain 'perfect' run. But with no disrespect to speedrunning, the term doesn't suggest what is much more important: style. High scores and time trials are all well and good, but what matters when you're playing the thing is whether it looks and feels great.Not a Hero nails it, not least thanks to a winning cast of Lahndaners and regional types that kicks off with Danny Dyer and goes uphill from there. My two favourites are Mike, a pissed-off Geordie that moves like the wind while swearing like a... well, a Geordie, and the Spanish Jesus who slides around like Rey Mysterio, pirouetting through executions while spouting a fine line in terrible innuendo. A special word too for Clive, a perfectly syrupy Roger Moore type, who is so well-realised he could be in a (very violent) Bond game and you wouldn't blink.The characters are lovingly-realised, their cod-accented exclamations flying through the air at every encounter, with bespoke animations and skills that gives each an individual pace through the levels. Valley girl Samantha flitters between cover, unleashing devastating fire when standing still but missing shots when moving. Jesus dances through goons and leaves only corpses, but in a tight spot you'll find hipsway makes him anything but a reliable shot. All move different, shoot different, and feel different. The default Danny Dyer called Steve is, amongst this various company, fine-tuned to perfection - a true death machine in the right hands, who feels simply gorgeous to hurtle around these deathtraps.The through-line from developer Roll7's previous game OlliOlli is in walking that tightrope of perfectly-linked moves, catching yourself after wobbles, and after enough practice nailing it. Not a Hero amps this up, of course, with the constant threat of a messy death and the flip between anticipation and frantic execution - which is why when you start to get good the intensity can touch euphoria. Crackling through corridors in-between bursts of gunfire, making split-second shots that explode heads like eggs, upending isolated goons and executing them in a blink then en route to the next target before the death animations cease. Whatever your preferred term is for the state of flow, where a game absorbs your attention completely and the controls gain an instinctive, predictive, reflexive quality - Not a Hero has it. There are three stereotypical gangster environments to blast through: the Eastern Europeans, the pot-peddling sarf London boys, and an Asian bunch that cross yakuza and ninjas. The first set of levels concentrate on drilling the mechanics home, compact and snappy buildings that compensate for the inevitable slew of restarts, because Not a Hero seriously backloads the challenge. You'll race through the first two-thirds in short order, and then comes the wall. The spike in difficulty is inevitable and justified, however, because this is when the levels start to stitch everything you've learned together, sprawling a little and offering up set-piece encounter after encounter.This is also why they're frustrating - in such a fast-paced moment-to-moment game, losing your last few minutes of play to one misjudgement is brutal. It does force a purity of focus from the player, a serious mindset, where your intentions switch from looking fabulous to operating like a professional - clearing out the lower levels like clockwork, setting traps for later visitors, and working out how best to manage any limited special weapons. As is always the way with this kind of thing you die ninety-nine times - and then, on turn one-hundred, fly through perfectly without taking a single shot, no survivors, and clench your fist in the real world. That's the payoff for the frustration. And in a nutshell that's the game.Despite the sheer adrenalin of getting it right, Not a Hero still left me with ambiguous feelings about just how good it is. The controls are precise, the flurry of combat can be amazing, and yet during those ninety-nine failed attempts you'll get the creeping sense that you're learning to dance in a straitjacket. This is the less attractive side of the game's structure - because your objectives are fixed, there is always an optimum route. So you end up with this curious mix of a freewheeling, well-engineered combat system in environments that restrict it to pre-defined paths and encounters. The fact combat can play out so differently excuses Not a Hero's linearity, naturally, but things don't play out so differently that it ever quite breaks free of the shackles. Perhaps the problem is longevity. We have this odd expectation that any game should be able to survive multiple playthroughs, and Not a Hero's structure suggests it is one of these replay max offerings. I'm not so sure I'll keep going back. But when one playthrough lasts a few evenings and is great, that doesn't seem to matter so much.One final thing, which it saddens me to mention - Not a Hero is extremely unstable at launch on PC, and frequently crashes to desktop. Doubtless this will be patched imminently, but it's a problem at the moment.   Not a Hero isn't perfect, but it does enough to confirm that Roll7 is a developer to watch. This is a game where the design principles shine through in every second of the action, foregrounded by a winning combination of clever visual tricks and slick production values. At times everything comes together and this is a delicious, feedback-heavy and flowing system - at others you'll be chewing the analogue stick in anger. Bunnylord, in other words, is a candidate with flaws. But still worth your support."}