{"ref": "https://www.eurogamer.net/darkest-dungeon-review", "date": "25 Jan 2016", "game_name": "Darkest Dungeon", "text": "I was feeling pretty good during my first few hours of Darkest Dungeon - until I met The Collector, anyway. Not good good, of course. More specifically, you could say I was feeling terrible. But if you're only feeling terrible in Darkest Dungeon, you're actually feeling pretty good: one guy in my adventuring party had rabies, another had become paranoid, a third was edging towards something that would turn out to be masochism of some stripe. Still, we'd been at it for four or five rooms, so what do you expect? Only rabies? Only a little masochism? What's the problem?I didn't expect The Collector: a tall fellow in a trenchcoat, with some kind of cage around his head. The head, by the way, was a flaking skull, and under the trenchcoat? More skulls. Still, this was okay, until I saw his HP: 70/70. Even that was still pretty okay, until he started summoning floating spine-type things, with heads that matched the heads of my own team. Oh: The Collector. Got it. Also: got killed. All of us. A mega-wipe. And here's the thing: The Collector is not a boss. There's a decent list of bosses in Darkest Dungeon, and The Collector is not on it. This is presumably because The Collector does not have what it takes to be a boss. He doesn't make the cut. The Collector, with his head that is a skull, with his body that is also skulls, is just too reasonable.Oppressive, cruel and exhilarating, Darkest Dungeon is one of the most beautifully designed games I've seen in a while. And the beauty of the design is everywhere, from the art direction and atmosphere, which inks this dungeon-diving semi-roguelike in the blotchy, heavy-lined stylings of a House of Usher horror comic, to the smallest facets of the mechanics, like the way that hunger is a sort of randomised tax, foisted on you when you least expect it, or the manner in which the ever-decreasing light when you're out adventuring means that you can't catch a breath between encounters without sacrificing a few of the torches you've hopefully remembered to bring with you. (Actually, it's even more beautiful than that: low light increases danger but also ups the rewards, tempting you towards trouble.) Some of the fine detailing will have come from the game's relatively lengthy spell in early access, but not all of it. Red Hook Studios, whose logo is a grasping Cthulhian tentacle, has a rare gift for malice. A gift that, like The Collector, you must be born with.And while it's true that, at every stage of the early access development, Darkest Dungeon got meaner and more imaginative in its barbarity, it's a pretty villainous thing even in its most basic incarnation. An ancient country house sits on top of a terrible secret, and it's your job to explore the ruins that lie beneath, sending crocodile teams of four heroes slinking out into the darkness where they can loot treasure, spring hideous traps, read disturbing books from sagging shelves and engage in crunchy turn-based battles.The twist is that your team's mental health counts for as much as their physical health - that those disturbing books you encounter can do more damage, in the correct situations, than a pig-man's corrosive vomit. The more you linger in the abyss, the more that stress eats away at your heroes, with each psychic collapse bringing about unexpected behaviour - a strike or a pass in battle that you didn't request, for example. Alongside afflictions, you'll also pick up new quirks from time to time, which amount to modifiers, really, bestowing a weakness to a certain enemy type, say, or an inability to land blows when the light gets too low.Even without all this, battles would give you more than enough to think about. Take the unusually imaginative classes - Occultists, Lepers, the Abomination who can shift between Jekyll and Hyde forms at great inconvenience to his friends -  each of them bringing their own attacks and perks, and each of them ensuring that you need to factor in a specific preference for where the hero stands in your row of heroes, and which position in the row of enemies it will be able to attack. Take the fallen bodies of your foes, which remain in situ (until you waste attacks on removing them), creating blockages, and sometimes allowing for devastating reanimations. Placement is crucial, in other words, and real tactics come into play once you realise that your favourite lunge, say, reshuffles the pack a little too much, or that the weak baddie at the back who you'd been leaving for last can't do much damage, but can bring your team out of alignment and leave you gaping and unable to attack at all.On top of all that - and on top of bleeding and blighting, which strip your heroes of health turn-by-turn unless dealt with efficiently - on top of all that, you have the stress system, slowly building up with every misfortune and every dimming of the torch until a personal cataclysm sends a hero to the brink. What do they find at the brink? Sometimes masochism, paranoia, or selfishness, each with their own penalties. Sometimes something more virtuous: they rise to the occasion and become emboldened. But not very often. You would not choose to risk it, just as, after a while, you may choose not to risk opening the game's treasure chests, which may contain loot, or may contain a disease or something worse. (If H. P. Lovecraft had been a game designer and a parent, and had spent an afternoon in the park fretting over what his kid was likely to pick up and put in his mouth, he might have conceived of Darkest Dungeon.)Stress and its afflictions also bring a strategic side of things into play. Between diving into dungeons, which are 2D affairs, their horrors and traps split between hallways and rooms, procedurally scrambled and carved up into different areas and a handful of repeating quest types, you return to the hamlet. Here you can collect new heroes from the stagecoach, buy and trade trinkets that can be equipped for stat boosts, and do lots of other standard RPG stuff like level up skills and armour and unlock new attacks. But you can also treat your heroes, at church, or at the bar, locking them away for a mission - often at considerable cost - in the hope that a little gambling, or a little flagellation, will lower their stress. Or you can pack them away to the sanitarium to remove some of the quirks and diseases they have picked up the last time they ventured out - or to lock in others that actually improve them as a character.These simple choices, enlivened through kinks that may see one hero unable to do anything other than gamble, while another simply must drink to soothe their ills, come together with permadeath and a character roster that inevitably leaves something to chance as it chucks new heroes at you, each with their own starting quirks, to create fascinating personnel problems for you to solve. It's insane to venture off into the darkness without an occultist or another kind of healer, but the last time you ventured off, your occultist went insane and is now out for a turn as a result. How about tanking with the abomination to make up for it? But your religious heroes absolutely won't party with him. Ditto, I think, the lepers. Equally, long missions require an overnight camp, during which specific hero skills kick in to heal or buff. But what if your best heroes have lame camping skills? What then?This is merely the start of it. These are problems you'll encounter long before you hit the veteran quests that can undo you with truly alarming speed. Darkest Dungeon offers the best kind of complexity, I think. A handful of disarmingly simple systems braid your ambitions, compulsions and fears into a noose, and it is you who ultimately places it around your own neck. Take one final example: you need gold and other resources to heal your heroes and upgrade your town, but traps mean that looting is dangerous. So, however, is not looting, because your heroes are going to need help. Help with all those psychological problems they may have picked up through looting.Despite all this, Darkest Dungeon could so easily be a cold exercise in design. Thankfully, its presentation, its dark wit and its love of grot and gills and grime, elevates it to the realm of something really special. The 2D art is wonderfully unstinting when it comes to the rugged, bruised, and hollow-eyed men and women you lead through these dank, crumbling ossuaries, while the animation, although simple, breaks things down into a weighty and bone-crushing series of heroic lunges and miserable cringes. The bosses are as disgusting in the flesh as they are cruel in their tactics, and very best of all is the narrator, mocking, undermining, luring you into overconfidence and then berating you for it in the kind of gloriously ornate language that Lovecraft himself loved to scratch onto the page. The narrator is a reminder that you, ultimately, are the chaotic element here, the element that turns a fair game into an unfair one, the element that can't resist trying out the final dungeon area with a hopelessly under-leveled party, and must therefore reap the consequences.Consider Lovecraft. No, consider the anglerfish, that Lovecraftian nightmare of the deep with its sickly glowing lightbulb luring you in before the wretched face becomes visible. The tiny, melted eyes, the cruel underbite, and the thatch, not of hair, but of teeth. This is Darkest Dungeon, even before the fish people turn up and are troublingly untroubled by bleeding. This is a game that's horrid in a way that means that you can't look away, a game of exhaustion and luridness and of terrible things happening in an awful, awful place. In other words, it's just lovely."}