{"ref": "https://www.eurogamer.net/aviary-attorney-review", "date": "21 Jan 2016", "game_name": "Aviary Attorney", "text": "Monsieur Grenwee, businessman and dinner party guest, has been murdered. The daughter of Grenwee's business partner, herself a guest at the party, was found standing over the corpse with blood on her hands. A photograph provides an alibi for every other guest at the time of the murder. It seems like a pretty open-and-shut case but you, incisive defence lawyer that you are, have your doubts. This also might be a good time to mention that the deceased is a frog, the accused is a cat and you are a falcon in a suit. Got that? Good. Now go interrogate that lion smoking a cigar.Such is Aviary Attorney, a gorgeous adventure game set in 19th Century Paris featuring the illustrations of renowned cartoonist J. J. Grandville. Cast in the mold of Shu Takumi's Phoenix Wright series, it follows JayJay Falcon, defence attorney (and bird of prey) and his dim-witted assistant Sparrowson as they try to make a name for themselves in the justice system of King Louis Philippe's France. Unfortunately, neither bird is particularly gifted in the field of law; they're renowned for being bungling idiots, in fact. It falls to you to guide JayJay and Sparrowson as they probe each case before defending their client in court. You build said case by combing through crime scenes and interrogating the people (animals) involved, gathering pieces of evidence to call on while cross-examining the prosecution's witnesses. Cross-examination is where you get to show off just what a clever and diligent falcon you are. Presented with a number of questions you can ask each witness and often a written transcript of their testimony, you need to pick which assertions to unpick and which to let stand. You can back up your claims by producing evidence from JayJay's evidence briefcase, letting all the puzzle pieces you spent time collecting slot into place with tremendous fanfare and murmurs of approval from the jury. Not every case, however, is guaranteed to leave you smugly preening yourself. As you prepare for each of Aviary Attorney's cases, you stop in at multiple locations across Paris. This can prove time consuming; at certain points you can visit only one location per day. As the game progresses, the number of places where you can try to further your investigation increases vastly; with only so many days before the trial begins, you must manage your time wisely or risk missing a vital piece of evidence. Going into a trial having collected everything is a tremendous feeling. Each successive blow to the prosecution builds more and more momentum until you're finally rewarded with a Not Guilty verdict, leaving you feeling very clever indeed. Going in unprepared, however, is a dreadful experience, promoting a genuine sense of unease as JayJay flounders, attempting to stall the case and buy himself more time. Failure is a very real option in these cases and Aviary Attorney is not shy about punishing you for handling the trial poorly. Mechanically the game's puzzles are very satisfying, if fairly easy, but they're only part of what makes Aviary Attorney great. It is undeniably beautiful. The illustrations of J. J. Grandville are delightful in their own right, but the subtle use of animation brings them to life in such a way that fleshes out their characters - and punctuates the action - with admirable potency. On a couple of occasions, the story necessitates the use of original illustration; unfortunately these tend to stick out, lacking some of the artistry which makes Grandville's originals so compelling, but for the most part they aren't too intrusive.The artwork is supported by the music of Camille Saint-Saëns, composer of such works as Danse Macabre or, as it is perhaps better known, the intro music from Jonathan Creek. Saint-Saën's music provides a sense of whimsical fun, with different themes complementing the ebb and flow of the action, making the soundtrack a real presence throughout. Hearing Theme From The Bit Where You Properly Decimate The Prosecution's Argument (not the real title, I imagine) becomes a thrill in its own right, spurring you on in the pursuit of justice. When I played a demo of Aviary Attorney at EGX Rezzed last year I was very much taken with the writing, so it's pleasing to find the level of quality is consistent throughout the finished article. The dialogue between JayJay, Sparrowson and the vibrant cast of supporting characters is written with poise and wit, making for laugh-out-loud moments and genuinely exciting revelations both. The story, too, has far greater scope than the quaint premise would initially suggest. With the world of Aviary Attorney being so fun to inhabit, it would have been very straightforward to develop a series of standalone cases and call it a day. Instead, the story's four acts snowball quickly into a foreboding tale of murder, betrayal, espionage and revolution. The three possible endings are drastically different, each casting a new light on the main characters as they ruminate on exactly what justice means.  One of these endings is definitely weaker than the others but, nonetheless, Aviary Attorney's story is surprisingly ambitious and achieves its aims with aplomb. To make my closing remarks, your honour, Aviary Attorney is a delightful game. I would have liked to tackle just one more case before the story really began to gather momentum, but that's mainly due to the world of JayJay Falcon being so much fun to inhabit. Wonderfully stylish and delightfully silly, it's probably the best game about a bird with a law degree you'll play this year."}