{"ref": "https://www.eurogamer.net/heroes-of-the-storm-review", "date": "20 Jan 2016", "game_name": "Heroes of the Storm", "text": "There are games you don't have time for, and games you make time for. Then there's the kind of game Blizzard makes, which becomes a routine. Millions of World of Warcraft players, past and present, could speak for hours of their travels in Azeroth. Starcraft players act like it's a religion. Hearthstone's disarming charm hides a monster that Daily Quests you into coy submission and devours half-hour chunks over and again.Add Heroes of the Storm to the list. Since gaining beta access around six months ago, Heroes of the Storm has become a part of my day. At lunchtime I play a few matches with a chum, at night I find time for more, and in-between I keep an eye on the subreddit and forums and YouTube. A lot of games feel brilliant for a week or two, and then afterwards you'll never touch them again. I can't stop playing Heroes of the Storm.When any game cuts into your Monster Hunting and Counter-Striking, it's time to pay attention. Before we get onto the higher-level design of Heroes of the Storm, it's worth pausing over how good Blizzard is at the basic elements of a competitive game, such as hitting something. The heroes here are beefy 3D models that, pirouetted through clicks and lashing out with buttons, positively slam into enemy minions and heroes. Even the basic attacks have a heft distinct from whatever the current stats are, along with booming bespoke sound effects, and innumerable visual flourishes.The controls are so simple that in other hands they may have been boring: movement and basic attacks are right-clicks, while hero abilities are triggered by the QWE keys (initially) and left-clicks. But the connection between command-and-response is instantaneous, satisfying, and varied in smart ways across the roster. Part of it is the heroes' physical presence, their ability to body-block in close encounters and hem-in unlucky opponents. Part is the clear but impactful effects, celebrating individual blows with their own thooms and booms. And the biggest part is that each character's individual abilities and talents make them unique. The abilities are one of the keys to understanding Heroes of the Storm's approach to a genre that has, to mix metaphors, hit both a design peak and a dead-end. League of Legends and Dota 2, for all their differences, are essentially the end of that kind of MOBA - their detail and complexity such that, for competitors, there's simply no point trying to make them again. The basic structure of Heroes of the Storm comes from the MOBA genre: two teams of five heroes face off across a map split into a small number of lanes, minion waves march across the lanes, and defensive structures for both teams defend 'their' half of the map. That much is shared, but everything else is a fresh start. A big difference is that XP, gathered by killing enemy minions, heroes and fortifications, is shared among the team rather than gathered individually. At a stroke this stops any one player falling behind and becoming a liability, while also encouraging the team to co-ordinate their lane coverage (miss a minion wave and that XP is lost). It also allows Blizzard to tier the levelling system in such a way that, while it's easy to gain a slight advantage, it's hard to snowball to an unfair one. You'll have the odd one-sided match, for sure, but in general Heroes of the Storm does a great job of allowing teams to gain advantages while keeping them within touching distance.The flashpoints in this are 'talents' - either extra abilities or buffs to a hero's existing kit - which are a multiple-choice option interspersed in between your character levels. The middle talent, unlocked at level 10, allows each hero to choose one of two 'heroics,' amazing special moves with long cooldowns that can do tonnes of damage, alter the battlefield in some way, put out some mega-heals, and so on. This levelling structure is how Heroes of the Storm wrings so much out of every hero. Each choice typically involves four options, with many linked to a specific ability. So you can build for one part of your arsenal to grow in power enormously over the game, spread a little love everywhere, or go for situational bonuses like the structure-repairing MULE.Take Valla, an incarnation of Diablo's demon hunter class and in the game's terminology an 'assassin' hero - meaning she's a damage-focused hero. Valla has three abilities: hungering arrow, a single shot that bounces to other targets; multishot, an area of effect arc of fire; and vault, which lets her dodge in any direction. During matches you can build Valla for maximum burst damage with the hungering arrow, enabling you to power down isolated targets in a flash, by picking a combination of talents that buff the ability and reset the cooldown (eventually twice.) Or maybe you fancy area of effect damage, and so improve multishot with range and grenades before adding a slow effect on enemies hit and eventually - the coup de grace - a big buff to any damage dealt to slowed targets. In other situations you can build around Valla's standard ranged attack, making her a nightmare source of DPS skirting the edge of teamfights. Or there's leeching talents, so basic high damage constantly supplemented by self-healing. Then you get to her two Heroic abilities, one of which adds a stun to your armoury with mega-damage, the other offering enormous sustained area of effect teamfight damage, and you're never quite sure what to do.This is a fabulous thing. Not every character is as well-rounded as Valla, and there are a few that feel like one-trick ponies. But among the many characters I enjoy playing as there are always interesting choices to make - and the more familiar you get with a character, the easier you find it to begin tailoring talents to the exact composition and situation. This means a given team of five heroes can, over different matches, operate as a different kind of team - and knowing what you'll face is not just a question of knowing the characters, but being wary of how they're powering up.  The way talents force an interesting choice every few minutes flows beautifully into the larger structure of a Heroes of the Storm match, part of the momentum that piles laning on top of objectives on top of levelling, a merry-go-round of things to do that never stops. Each map is dotted with mercenary camps, which spawn shortly after the match starts and can then be fought and 'captured' by either team, re-spawning them as allied minions. These are minor aids to your pushing power, easily killed by enemy heroes, but capable of pushing through defences if left unchecked - so a simple mechanic granted strategic depth by timing. The maps are themed around their objectives, which vary from possessing a big Dragon Knight and whacking down forts to giving a cod-Irish dwarf doubloons so he bombards your foes. These objectives have been widely described as gimmicks, but this mischaracterises their role. Each map's objective, whatever the details, is designed to pull the teams together at certain intervals during the match, and the fast-paced rhythm of Heroes of the Storm owes a lot to this organising principle. Each objective is also carefully matched to the size of the map it's on, with smaller maps like Haunted Mines forcing teams to battle intently for big consequences, while larger maps have objectives where the consequences are either delayed or diffuse. All of this momentum is in the service of an overarching goal: each match of Heroes of the Storm, on average, lasts 15 to 20 minutes. This is a great length for competitive play, long enough to contain swings and comebacks, but short enough that you rarely end up bored or frustrated. Despite the odd stomping, most matches of Heroes of the Storm remain winnable for either team until a very advanced stage, with the potential for huge comebacks and decisive late-game teamfights engaging both teams to the utmost. The effect of packing so much into such a short timespan is that Heroes of the Storm has no filler. There comes a point when you have to hold your hands up and just admit Blizzard's designers understand how to layer simple interactions in order to create a complex and rewarding structure. The company's games contain some industry equivalent of monosodium glutamate, intricate systems built from countless reward loops that fill your brain with moreish chemical joy. Put like that it almost sounds sinister, like this was made by a committee of scientists in lab conditions. Really it's been made by people who understand the joy of play and, much more crucially, that it's not just about the numbers. In the end it doesn't matter that Heroes of the Storm has 37 heroes, and the competition has hundreds. It doesn't matter that it has more maps, or no items, or shorter games. It doesn't even matter how many players it has. All that matters is it's more fun.To stay on top of all the latest developments in the game, take a look at our dedicated Heroes of the Storm channel at MetaBomb."}