{"ref": "https://www.eurogamer.net/hardware-rivals-review", "date": "7 Jan 2016", "game_name": "Hardware: Rivals", "text": "Out there somewhere is a warehouse home to all the forgotten follies that once followed in the wake of unloved hardware, where EyeToy: Groove shares shelf space with Kinect Adventures (its name, most likely, is CEX.) It's where you'd find Hardware: Online Arena, an early companion for the PlayStation 2's network adaptor and, when it launched in 2002, one of the console's very first online games. For some reason that's hard to parse, it's now the subject of a reboot in the shape of PlayStation 4 exclusive Hardware: Rivals. Maybe it's something to do with the recent vogue for knockabout multiplayers, and the runaway success of Psyonix' Rocket League last year. Hardware: Rivals, developed by a new internal team within Sony Computer Entertainment on Unreal Engine 4, certainly looks towards Rocket League's lurid energy, even if it struggles to match that game's anarchy and inventiveness. Perhaps it's more to do with a certain strand of nostalgia: it's highly unlikely you'll remember Hardware: Online Arena, but Hardware: Rivals isn't fussy about the specifics. Instead this is a modest return to a brand of multiplayer that you're unlikely to have seen since last checking your Hotmail account. Hardware: Rivals puts forward a particularly soft form of vehicular combat: think Twisted Metal swapping its spiky-shouldered leather jacket for a purple fleece, or the original PlayStation's Rogue Trip taking its vacation in a low rent design agency rather than Middle America. It's approachable even if it is slightly anonymous, its flat colours and cartoon cars washing over you without every establishing much of an identity for themselves. Go in expecting any of the personality and panache of Rocket League and you'll be disappointed. The vehicles - there's a mere four of them, split evenly between leaden tanks and jeeps you'd hardly call responsive - have little personality, sliding through levels with little friction or feedback. The weapons - there's a primary cannon and a selection of specials that can be picked up across each stage - likewise feel flat, a predictable grab-bag of fizzing plasma and homing missiles. The modes available won't surprise you, with domination, solo and team deathmatch as well as elimination, and currently nothing else besides. Even the maps themselves - bizarrely faithful to those that featured in the 2002 original - are easily forgettable, their moderate expanse a little too rangy for the slim numbers each multiplayer match hosts. A sense of lethargy grips Hardware: Rivals, from the stiffness of its vehicles to its reluctance to come up with any ideas of its own, and it's a lethargy that can be contagious. Power through that, though, and there is something else, even if it shines somewhat dimly. In its slim return to a more innocent style of multiplayer shooting there's some fun to be had. There's a certain asymmetry to the jeeps versus tanks match-up that can be entertaining, the smaller vehicles running energetic rings around their rivals as they skirt between bouts of mortar fire. There's something, too, in memorising where the weapon icons spawn, and in the brief panic that ensues when a stage's special is triggered - an airstrike you escape from by diving underground, or a surge of electricity that sends players searching for higher ground. Leaderboard-regulated challenges that are ticked off throughout multiplayer also help tie together the lulls between skirmishes as you seek to jump further off a certain ramp, or negotiate a concert complex that little bit faster. They're small diversions that lose their sheen after a couple of hours, though, and Hardware: Rivals looks destined to emulate its predecessor in a way its creators may have hoped against. Mere days into its life and it's hard to imagine Hardware: Rivals will be remembered beyond its free trial on PlayStation Plus, let alone any further. Unremarkable, indistinct and only occasionally enjoyable, Hardware: Rivals is a wilfully simple game that can too often let its idleness get the better of it."}