{"ref": "https://www.eurogamer.net/olija-review-a-brisk-adventure-with-a-harpoon", "date": "16 Feb 2021", "game_name": "Reviews", "text": "There is something great about a really good cinematic fall. Have you seen Welcome to the Jungle? I'm pretty sure this film, starring The Rock, Rosario Dawson and Seann William Scott, is largely forgettable. In truth, outside of a fondness for the leads, I have largely forgotten it myself. But man, it has a really brilliant fall in it - downhill, the jungle, obv, and falling and falling and falling. Not just falling - not just empty space. A bit of texture to it. Oof and ouch, one surface and then another. Gravity is the star here, and editing is the special effect to bring out the best in the star. They could cut it together in a TV Burp loop and I would watch it forever. So painful, and yet nobody is really injured. Perfect. Olija has a really good fall. It's towards the end of this short adventure: a rickety elevator collapses and then you fall down, down, down. And it has a bit of texture to it. Olija gains a considerable amount of its charm, if you ask me, from the fact that this action-platformer is also a flip-screen action-platformer. This gives it some of the flavour of flip-screen classics like Another World, or even Zelda, that first game famously inspired by Miyamoto messing around with his desk drawers, imagining a different garden within each one. Flip-screen games, more than any other kind of game, feel like they're giving you a complete universe in a bottle: in the blinking transitions from one place to the next a vast alchemy occurs. So anyway, in Olija, when you fall, you fall from one screen to the next, landing on a surface that then crumbles, and then down, down, miss the spikes, down, down, down.I should add quickly, Olija is not a comedy. In fact its air of brooding, ambiguous nobility, its stoicism, its pixelated seriousness, is one of the many things I really love about it. But that fall is part of a wider trend in the game. This is a platforming and combat game, but it has plenty of time for other things. It will throw in a stealth section, or a delicate puzzle involving a rose and a vase. It has sections where people just give up the keys that you would normally expect to win from a boss, and that you often do have to win from a boss. And it has that fall: crunch. Pacing! A cinematic sense of ebb and of flow. It makes for a dynamic adventure that is always ready to surprise. Something hand-crafted, something personal and intricate. It was no surprise to learn that this game was largely the work of one developer.Four paragraphs in and I should probably mention the harpoon. Olija casts you as a shipwrecked sailor named Faraday lost in a mysterious and deadly land. It's a compact but intricate 2D affair, and early on you get hold of a harpoon that aids in your adventures. The harpoon - I love it when this happens - turns out to be a proper video game tool. It aids in traversal and combat, and actually encourages you to knot the two together. In traversal it allows you to grapple to specific points in the environment, often indicated by an inhuman eye that would be the size of a basketball, lobbing the harpoon and then teleporting to it in a blurred dash. You can also stick it to certain walls and jump onto it, and then jump, unstick it, and loft it further. It's no Celeste: lock-on and lovely animation cover up a slight awkwardness. Though maybe the awkwardness is intentional, since a harpoon seems to be a long, ungainly thing in the first place. There is a lovely hollow clank in place, come to think of it, just for when it accidentally falls to the ground. This harpoon has its own wilfulness, its own character. It is always useful, but it is also always more than merely useful.In combat, well, the harpoon is a harpoon. You can lob it into people and then teleport to them and give them an additional shoeing. You can also lob it into people and then summon it back to you and lob it again. Combat tends to chuck you in against a variety of foes, and often invokes a world of impedimenta as crates and explosives and explosive crates are rattled around and accidentally spiked with the harpoon. The idea is to be swift through the air and teleport often. Enemies, whatever their gimmick, always feel like a wall collided with, this hard-stop feeling conjured by animation and sound and transmitted magically into the thumbs on the controller - video game witchcraft. Olija is frequently a game about moving through space and attacking these walls once you hit them. Smashing.Bosses are present, as are puzzles, some of which involve another brilliant item that arrives late and gives you additional teleporting options. There are secondary-weapons and health upgrades and hats that do magical things and offer magical perks. Electricity eventually enters proceedings - you are called Faraday after all - and it is good fun for both physical brainteasers and x-ray-shocked stuns in combat. Olija is a short but busy adventure and one that rarely repeats itself.But lifting everything is the presentation, that kind of ragged pixel-art that tries to capture the rough edges of real life, and that chooses not to cartoonishly abstract but rather explore the limits, perhaps, of visual perception. Faraday has a blank grey expanse for a face and white dabs for hands, but you see him from a distance, a distance at which people are often composed of jittery brush strokes and blankness whatever the renderer. The individual screens, meanwhile, are equally happy representing combat arenas or little Emmental pockets of holes and tunnels - forget cheese, in fact, because there is a sense that the game's islands are bored and whittled and channeled by water, like ancient submerged rocks or driftwood. Testify. The art style is able to capture the gleam and flash of precious metal, and also Turner's skies, at one point, peachy mists with dramatic, melancholic shapes looming beyond. Between missions, which offer connected, opportunity-rich spaces that manage to also be fairly forgiving on the memory when backtracking, you return to a settlement that gradually grows and fills with people you have rescued. It's a place to upgrade things, sure, but it's also just a wonderful glimpse at industry, ragged survivors lashing bits of wood together and building towards something.I thought of Another World at first - the flip-screens, the elegance rung from the ragged pixels, even the dark little oil monsters with their horrid teeth that pop up when things get slow. But the more I played the more I realised Olija was taking me deeper, further back. The first blank-faced protagonist I knew moved through his own flip-screen world, a world of gymnastic swiftness and violence, a world where everything was ambiguous, writable, part of a story that only grew in the player's mind. Impossible Mission was my first love in games, a C64 masterpiece that emerged so early in home computers and yet had this terrifying assurance. It made everything difficult look simple. And even though its story was filled with intriguing gaps, those gaps worked with the player to create a perfectly depicted world.Olija is nothing like that - far more of a brawler, an upgrader, a blend of voices. But it's also, somehow, just like that. A game built of bold ideas lavished with the proper attention. I love that fall, for sure, and I love that harpoon,  but what really sticks in the mind is a puzzley moment deep into the adventure, in which I guide a burst of electricity through a series of relays and realise, as I work, that the spark of lightning I am working with picks up speed at each separate part of the journey. This is beauty. It's craft and a love of detail that speaks to focus and care. A feel for how things should work."}