{"ref": "https://www.eurogamer.net/assassins-creed-syndicate-jack-the-ripper-dlc-review", "date": "22 Dec 2015", "game_name": "Assassin's Creed Syndicate", "text": "Ubisoft's announcement that it would adapt the murders of Jack the Ripper into a rip-roaring epilogue for Assassin's Creed Syndicate rose some eyebrows. How would the developer handle the gruesome murders? Would you play as Jack during them? After Syndicate's solid main storyline and well-written cast of characters, it was a risky swansong to take on. For other franchise fans, it was an extremely attractive prospect. Assassin's Creed devotees have been asking for Jack the Ripper since the series' earliest entries, and when Syndicate's main campaign was set in Victorian London some 20 years earlier, many saw it as a missed opportunity. Ubisoft has instead decided to save this unhappy tale for an add-on all of its own, billed as the highlight of Syndicate's season pass.Jack the Ripper's story stretches over some 10 missions, although it is initially disappointing to see that there are no new districts added to London's map. As is to be expected, the missions are largely situated in Whitechapel, where the Ripper's murders took place: an already well-trod locale in the main game. Both this district and the City of London are populated with new activities, but the rest of London is locked off. The DLC's geography is almost identical, then, albeit with a new dusting of Victorian snow and Ubisoft collectibles, the latter unlocking more information on the Assassin's Creed storyline (such as what happened in the modern day after Syndicate's all-guns-blazing finale). Thankfully, an early feeling of repetition is broken up by some later excursions outside of London: to a Cotswolds manor house, a Great Expectations-esque marsh in the Thames estuary, and a final, more familiar location where the story culminates. The missions which explore these fresh areas are the highlights, although there is much to enjoy throughout, as the story reintroduces an older Evie Frye as its protagonist - well voiced again by Victoria Atkin, in another throaty performance - alongside the increasingly desperate Inspector Frederick Abberline.Over a century on, detailed descriptions of the Ripper's crimes are still shocking, although the game thankfully does not dredge up the investigation's photographic evidence. The events of his murder spree are for the most part handled with appropriate care, and the story benefits from Evie's more mature presence. Assassin's Creed has always been a series about stabbing historical figures in the throat and watching as your target gurgles up exposition through a gallon of claret, but these are also games about secret organisations, an ancient Precursor race and silly sci-fi MacGuffins. The real Jack the Ripper has now achieved a mythical status similar to some of the series' other fictionalised characters, but his brand of brutality is noticeably different from the usual pantomime villains of Assassin's Creed.It's potentially jarring, but Ubisoft tempers this somewhat through Evie Frye, who remains one of the series' best protagonists. Better written and ultimately more human than her brother - and now middle-aged, but no less athletic - Ubisoft has you experience the Ripper's campaign of fear through her eyes, mature in years as well as in demeanour. One thing especially worthy of praise is how Evie and the expansion in general treat the subject of sex workers, who reappear in the Assassin's Creed series after a deliberate leave of absence.Earlier Assassin's Creed games allowed you to hire ~courtesans~ or prostitutes to distract guards. It is a mechanic which resurfaces here, albeit in a story which treats sex workers in a far more mature manner. The story of Jack the Ripper could not be told without their inclusion, of course, but Ubisoft goes to some length to ensure their appearances in the game amount to more than simple victims. A raft of side missions highlight the inescapable dangers of sex work at the time, but do not involve Evie trying to convince those involved to stop their trade. Instead, these missions are about aiding those whom society has deemed ~Fallen Women~, and stopping exploitation where it occurs. One set of missions sees you parading abusive clients through crowds in order to shame them. Another sees you tracking down sex workers who have been kidnapped. There are still shades of women as objects to be rescued, but there is nothing but support for those involved, who almost always had no other option.Mechanically, there's nothing in Jack the Ripper which reinvents the Assassin's Creed formula, although an additional set of tools allows you to scare enemies through the use of a hallucinogenic powder. There are ~fear bombs~ which spit it out amid sparks, spikes to impale enemies to the ground, and a new heavy takedown move where Evie shakes the hallucinogen around enemies like salt from a shaker. Enemies now have a fear meter with three levels. Fill this up and your foes will simply turn and flee. It's a pretty promising package, then - except for a few missions when the story becomes a rather different animal. (For anyone super sensitive to spoilers, it may be worth skipping the next paragraph, although the DLC begins with an example of what I'm about to describe). Jack the Ripper is undoubtedly the antagonist of the add-on, but there are several occasions when you are forced away from Evie to play as the Ripper himself. These serve little purpose other than to show the similarities in the techniques he uses compared to Evie's or, sometimes, to briefly see a location prior or after to Evie's own visit. Playing as the Ripper does nothing for the story, nor to answer any of those raised eyebrows - especially when the first thing you are asked to do on loading the add-on is to walk Jack through a street to brutally and repeatedly stab an unsuspecting copper. Amazingly, Assassin's Creed still clings to its traditional 'you must not kill civilians' mentality, even when playing as Jack; you are told he did not kill random people to avoid messing up his plans.An exploration of the Ripper's psyche would not necessarily be a bad thing, but there is little to no motivation or reasoning given for his actions. The interludes where you clomp about in his boots and brutalise the right civilians - but not others - do not heighten the disgust felt when reading the very real descriptions of his murder scenes. It is just a distraction from the add-on's main story and main character, and all in all, something of a misstep.These moments aside, Jack the Ripper is another well-rounded if slightly slender addition to the Assassin's Creed canon: good fun in its new locations, rather familiar otherwise, but dignified by its treatment of some difficult subject matter. It is most comparable to Assassin's Creed 4: Black Flag's Freedom Cry expansion, which also suffered from a few unpolished moments, but also explored themes other major games would not stray anywhere near."}