{"ref": "https://www.eurogamer.net/bigfest-review", "date": "11 Dec 2015", "game_name": "BigFest", "text": "The story goes that one evening David Lee Roth walked backstage, plunged his hand into a bowl of M&Ms, drew out a brown one and freaked the hell out. Van Halen's rider specified that, among many other things, the band must be provided with a supply of chocolates in the band's dressing room. Article 126 in the contract, however, complicated matters. It read: 'There will be no brown M&Ms in the backstage area, upon pain of forfeiture of the show, with full compensation.' The clause was slotted between numerous technical speciﬁcations. After Roth wrecked the dressing room, the M&M clause gained notoriety as the perfect example of unreasonable, pernickety rock star demands. In fact, it was a shibboleth. If Roth saw a brown M&M then he knew the venue hadn't bothered to read the contract carefully. It followed that they had likely also failed to notice a host of other, more important practical requirements.In BigFest, perhaps the last first party Sony title for the company's under-appreciated handheld, you must contend with many more demands than merely picking out certain types of sweet. In your role as a festival organiser, you must not only book and cater to the bands, but also ensure the safety and entertainment of your guests. That means hiring roadies, installing lights and speakers, booking catering vans, organising toilets and even emptying the bins. You'll need to kick-out trouble-makers, sell relevant merchandise, clear trees and debris and keep one eye on the charts and another on the wellbeing of your visitors (directing, for example, people with sniffling colds to the hot chocolate tent). Big Fest combines the customer service tinkering of Theme Park with the social features of Farmville. The result is unfamiliar.You start with scrubland, a basic generator, stage and sewage system. From these small beginnings you must find some appropriately sized acts to play (hire a megastar in these formative days and they will pull out in horror when they see the size of the crowd) and slowly reinvest your profits into improving your facilities. Almost every aspect of your festival can be upgraded. Do up a trailer and you gain a new roadie. The more roadies you have on staff the more jobs you can take on around the site simultaneously. Upgrade the mixing desk and you can increase your decibel output. Upgrade the generator and you can add new hardware, such as lights and additional speakers. Upgrade your sewage works and you can improve the toilet and shower facilities. Upgrade the stage, the epicentre of the operation, and the number of facilities you can build increases exponentially. BigFest starts slowly, forcing you to think carefully as the money trickles in about what to buy next. Soon enough, however, you establish a healthy economy, making money from your various food, drink and merchandise stalls and reinvesting with gusto. Your guests, however, will do their best to interrupt your best-laid plans. As the crowd accumulates, so do their demands, as illustrated by a gathering sea of attention-tugging icons. Tap one and the individual will tell you all about their specific complaint, about how, for example, you're only selling hot drinks but they want an energy drink, or about how they want ice-cream, even thought it's raining and night-time. In the early stages of the game, you only have licenses for a couple of food and drink stalls so, frustratingly, you'll have to demolish one to make way for another. As there's a wait time for every demolition and construction, it's no swift task to swap your facilities. There's also no way to adjust prices, or revenue splits, a dumbing own of the business sim template that undermines the operation.Not everyone comes to the festival with the best intentions. You'll have to contend with streakers, who upset festivalgoers with their nudity, Moochers, who upset people with their stench, and, later, vampires and werewolves who upset people with their murdering. You must also remain vigilant for hooligans, who set fire to your bins, and thieves, who plunder your guests' tents looking for cash. In each case, a simple tap on the aggressor will remove them from the festival (and, in the case of the occult-ish visitors, net you a significant dollop of cash). Fail to expel them, however, and your well-behaved guests will file out of the festival in disgust or fear. Soon enough this pruning becomes tiresomely repetitive, especially as it's easy to accidentally tap on the tree under which they're hiding.Festivalgoers aren't the only ones to send you off on ceaseless errands. The acts you book will often make demands from the comfort of their tour buses, which are parked at the back of the venue. Sometimes these are last-minute riders: sandwiches with the crusts cut off or a weird demand that you tuck them into bed that night. Here you need only hand over the necessary money to meet the demand. You can always turn down the request, but doing so will often dampen the band's spirits, causing them to create less 'vibe' with the crowd and therefore damage your reputation. In some cases, the band may pull out of performing altogether. At other times bands will cause chaos a few minutes before they take to the stage by losing crucial equipment somewhere in the venue's grounds. You must scour the grass for, say, a lost guitar. Find and tap on the object and it'll be returned, the drama over. Lastly, acts will routinely request that you swell the crowd's numbers by hiring a promoter. You usually have three options to pick between, of various costs and competences. Again, it's too simple and repetitive to hold your attention after the first few times. You can choose the acts for each event you hold. You need to book acts of appropriate fame for the various slots on the billing, ensuring that the most popular band is always the headliner. After each event you have the opportunity to scour the charts, in order to pick out the up and coming bands. The more you book certain acts, the better you relationship with them becomes, and there are numerous bands and tracks that can be downloaded into the game, perhaps with more coming in future. A social aspect is layered on top of the repetitive rhythm of event management as it's possible to visit other players' festivals. Once there, you can cause trouble, using unlocked items, or, in some cases pick up unique installations, which you can then place in your own grounds. BigFest should be applauded for finding a fruitful, largely unexplored theme. But regretfully, the game falls short of much older examples of the genre. Its contemporary, connected features add only breadth, not complexity or nuance. As such, BigFest is an interesting experiment, loosely enjoyable and a useful primer to the genre for younger players. But, in festival parlance, it's unlikely you'll come back next year, or even next week, for that matter."}