{"ref": "https://www.eurogamer.net/animal-crossing-amiibo-festival-review", "date": "26 Nov 2015", "game_name": "Animal Crossing: Amiibo Festival", "text": "How strange that a game where the happiest player wins should have made so many people so very angry. Only it's not really strange at all, is it? It's hard to think of another publisher whose games are so regularly resented for simply existing, but such is the way with Nintendo. If Nintendo doesn't release exactly what its fans want, boy does the internet make sure it knows. Like Metroid Prime: Federation Force, Amiibo Festival has attracted a disproportionate amount of vitriol for what it isn't rather than what it is. It's not a proper Animal Crossing game, therefore it has no right to be released. That's an unreasonable attitude but - as you might have guessed from the big red circle above - that doesn't make Amiibo Festival a good game. The fact that it isn't much cop has nothing to do with it not being the Wii U equivalent to New Leaf, as everyone had apparently hoped. It is a sedate, amiable and frankly dull board game that passes the time without doing anything interesting, beyond the occasional inventive use of Amiibo.The real reason Amiibo Festival suffers is because it's an underdeveloped stopgap. The concept of an Animal Crossing-themed board game certainly isn't a terrible one, and I'm sure there's more mileage in the idea than developer Nd Cube has been able to explore in what I sense was a limited amount of development time. Director Aya Kyogoku (who also helmed New Leaf) has been admirably frank in admitting that the game was conceived as little more than a delivery device for Animal Crossing Amiibo - but I'm sure that when the idea was floated, it was more ambitious than the finished game has turned out to be.The pitch is Mario Party without the mini-games. You travel around a single game board over the period of an in-game month that, by the end, begins to feel like it's running in real-time. As in Mario Party 10, you place your Amiibo figures on the GamePad and lift them off to roll the dice - a detached, abstract process that lacks the tactile satisfaction of shaking the Wii remote, let alone Crimson Shroud's masterful use of the circle pad to roll the dice around your virtual palms. Each space on the board contains a cute little animated vignette, presented as a diary entry, in which you'll gain or lose bells and happy points. Once a month is up, or the timer you've set runs out, and the cash has been converted (one happy point per 1000 bells), the happiest player is declared the victor. It's a very simple design, spiced up a little by the arrival of events and visitors. At least, that's the idea. Whether it's Shrunk, the unfunniest 'comedian' since Dapper Laughs, or Phineas, the philanthropic badge merchant, the visitors' effects on the game are distinctly underwhelming. Often, you'll merely earn cards that allow you to move a given number of spaces or receive a boost to your tally of happy points or bells. Only Sow Joan's stalk market lends a strategic wrinkle: once you've spent big on turnips, you'll hope desperately for an announcement of fluctuating figures to give you a chance of making a tidy profit before Saturday rolls around and you're forced to sell the remainder.At first, the wrapping holds tedium at bay. The animations are often funny or sweet - who knew KK Slider had a blog, never mind one that earns him referral fees from sales of books he's recommended? - and if you own any of the Happy Home Designer Amiibo cards, you can decorate the board with house exteriors that match the ones you've decorated in the 3DS game. You can bring villagers into the game, too: I enjoyed watching Sterling and Clay having a good old chinwag on a nearby bench. But it soon becomes apparent that there aren't enough unique events, while many simply insert different characters into the same skits, with no attempt to change the dialogue. In a series that's all about the little details, that's especially disappointing.  In light of the painfully scrawny Mario Tennis: Ultra Smash, it's a symptom of a wider problem: it's another example of Nintendo settling for less to fill a gap. Outside the main game, you've got a selection of asides that redefine the notion of filler. A game where you drop characters through a field of coloured balloons onto a moving island is essentially Monkey Target meets pachinko, only without a quantum of the enjoyment that pairing would suggest. Fruit Path is so bewilderingly limited and awful that it would be generous to suggest it had been conceived and coded during someone's lunch break. There's a card battling game that simply doesn't work unless you ask the other players to close their eyes, and a whack-a-mole variant that, astonishingly, would be among the better activities if the NFC reader were a bit more responsive. There are almost two saving graces. One is a surprisingly challenging quiz that invites you to buzz in by placing a card when the spotlight is on your chosen character - the twist being that, as you study the possible responses on the GamePad screen, you might not notice the light has shifted on the TV. Try to answer when it isn't your turn and you'll miss a go.Then there's Island Escape, a briefly absorbing puzzle-strategy where three animals must collaborate to - well, guess. You've got a week to find the three logs and sail needed to build your raft, and must combine your animals' various abilities to survive. Some might be better at fending off centipedes and snakes obstructing your progress; some can see further and sense nearby items; others can swim to more distant shores, allowing you to pitch your tent in more advantageous positions. But you'll have to forage enough food rations to keep them all alive for the week, forcing you to take detours to shake palm trees, to shoo away bees to steal honey, or to fashion fishing rods from twine and twigs. As with the quiz, it's a fine idea that is predictably underdeveloped and blighted by repetition.The same goes for Amiibo Festival as a whole. It's hard to hate - but investing in a boring board game where extra counters cost thirteen quid is sure to leave you short of both bells and happy points."}