{"ref": "https://www.eurogamer.net/hard-west-review", "date": "19 Nov 2015", "game_name": "Hard West", "text": "From start to finish, the Gunfight at the OK Corral lasted 30 seconds which, incidentally, is about how long it takes to grasp the concept of Hard West. CreativeForge Games has produced a turn-based strategy game with a dark, supernatural story set in the wild west. Think XCOM, but with cowboys (howdy, commander). The reasons why it's an interesting game, however, require a more detailed explanation. Hard West is deeply ambitious; it boasts a few mechanics that could prop up a game like this on their own. Combined, they make for a refreshing take on the genre that - in spite of its faults - is rather special. We'll start, as all good westerns do, with a bit of story.Hard West's campaign is split into eight separate chapters or scenarios; each one centred around a particular character. These scenarios (each one of which can be completed comfortably in one sitting) often intertwine, allowing you to explore the same story from both sides. In one instance, the person you just spent a whole chapter controlling becomes the elusive figure your new character is hell-bent on killing. It's an interesting approach that keeps the campaign from feeling like one long slog, and it offers up a good deal of mission variety. While the obligatory gunfights play out in turn-based missions, much of the narrative substance comes from wandering and role-playing your way across the game map (this portion of the game is the equivalent of base building in XCOM). Exploring locations on the map will help you acquire new items, new posse members and, crucially, advance the story. How you fare in this text-based adventure determines what shape you enter your next combat mission in - the choices you make impact on your finances, your health and, in some cases, even your sanity.This section of the game gives a surprising amount of narrative heft to Hard West, making it one of the more memorable stories I've encountered in a turn-based game. It's a pity, then, that it's hampered so badly by an over-emphasis on conciseness. Consider this passage: ~Solomon locked himself in the workshop for an entire day. He built a mining drill to extract the meteor from the crater. He also built an insanity gauge, so that whenever he visited a location, he could observe the gauge to check that area's Madness level.~While the desire to avoid swamping the player with a wall of text is understandable, that's an awful amount to absorb in just three sentences. Too often story beats like these feel so rushed as to seem amateurish. By contrast the game's narrator, death, is fantastic. The understated voice acting punctuates the game's tragedy-laden story brilliantly. In narrating key moments during combat missions, it also spoon-feeds you some tactical information from time to time. These are always worth exploring; not only do they give you an advantage in combat, but they pad out the story in ways that make the missions memorable, rather than just another gunfight next to some tumbledown buildings. The combat missions in Hard West are solidly executed and will be familiar fare for anyone who's played a turn-based strategy game before. Where Hard West's combat gets interesting, though, is in the card system. Eschewing skill trees and class systems, all of Hard West's special abilities are tied in to playing cards that can be assigned to any character. Characters have between three and five slots available, allowing you to play around with different character builds before beginning each combat mission. Equipping shadow salve and shadow cloak, for instance, means you not only regenerate health when out of direct sunlight, but you're also completely invisible to enemies. These cards allow for a tremendous amount of character flexibility, opening up a vast range of tactical options. It's just a shame that your card stash resets at the start of each scenario - the abilities are so much fun to play around with that it would have been nice not to have to unlock them all again each time. Hard West is also interesting in that it doesn't rely on random dice rolls to determine whether an attack hits or not; instead, you have the luck system. Every combatant in Hard West has a luck stat. When a shot is fired, the percentage chance to hit is compared to the number of luck points the target has left. If the luck value is higher the shot goes wide, however the target loses luck points to cover the cost. Conversely, if the bullet connects, that character gains luck points back, making them harder to hit next time. It's a slightly more open-faced approach that encourages a more aggressive playstyle. For instance, if an enemy is in full cover and you only have a 20 per cent chance to hit, it's still worth taking that shot. You'll either do some damage or whittle away some of their luck, making the next shot more likely to connect. Wyatt Earp once said ~in a gunfight... you need to take your time in a hurry~. I couldn't have put it better myself.Using a character to soften up targets like this while sending someone round on a flanking manoeuvre is immensely satisfying and helps reduce the amount of chin-scratching that so often occurs with turn-based strategy games. It also, bizarrely, sometimes has you hoping one of your characters gets shot.  The thing is, the majority of special abilities in Hard West are powered by luck - some requiring a whopping 75 points to activate. While you can use consumables to boost your luck, the easiest way to fill the meter is to get shot. Hoping someone would wing one of my characters so I could use their shriek ability and deal 3 damage to every enemy in sight was a strange feeling, but in some ways that's the essence of Hard West's combat. It's a more ragged take on turn-based strategy; taking lumps is a central part of the experience. Hard West is a game about falling down six times and getting up seven.While the combat for the most part in Hard West is really enjoyable, there's one major drawback in that your enemies don't trigger when discovered for the first time. While in games like XCOM they'll dash to cover when revealed, Hard West's cowpokes remain perfectly still. As a result, it's remarkably easy to move forward into cover and, in doing so, flank an enemy you didn't even know was there. After that, it's simply a matter of turning around and killing them outright (if you still have an action point left) or wincing as your character gets plugged on the enemy turn. Making kills this way feels like failing upwards or playing dirty. I could make a hackneyed reference to 'gettin' the drop on a varmint' at this point, but frankly these moments don't feel like the actions of a slick gunslinger. They feel more like robbing yourself of an interesting tactical challenge. There is, however, an element to Hard West in which you can legitimately get the drop on your enemy. In a fisftul of missions, you start out in the setup phase, whereby the enemy hasn't been alerted to your presence yet. You're free to position your shooters to your heart's content before slapping leather, though straying into an enemy's cone of vision will cause them to become suspicious and eventually attack. This phase can make all the difference at the start of a combat, letting you level the playing field in a way that doesn't feel like cheesing - mostly because each mission with a setup phase tends to be crawling with bad guys. Despite its limitations, then, Hard West is a game that punches well above expectations. Its developers took some bold design decisions that, for the most part, really pay off. It's occasionally clunky and frequently exploitable, but it's also genuinely memorable. CreativeForge Games may not be the best writers in the business, but they sure as hell ain't no snake oil salesmen."}