{"ref": "https://www.eurogamer.net/driveclub-bikes-review", "date": "9 Nov 2015", "game_name": "DriveClub", "text": "Half the wheels twice the thrills, right? Anyone who's been watching the merry go round of this year's MotoGP season will tell you as much, and it's not just been about the errant seagulls being nutted to death or the feuds at the head of the field that have descended into Road Rash madness. Compared to the relative anonymity of the automobile, there's something more raw and more human about seeing someone contorting themselves and the laws of physics in the pursuit of speed. Bikes, quite simply, are fun.Funny, then, that they haven't made for the best bedfellows with video games, and for years it's been Milestone and Milestone alone that have pursued the discipline, with the likes of the enjoyable Ride and the officially licensed MotoGP series providing adequate results. The surprise announcement of DriveClub Bikes (well, actually, shouldn't that be RideClub now) is the most high profile take on two wheels in some time. This expansion for Evolution's PlayStation 4 exclusive racer works, and it does a little more besides too.DriveClub Bikes functions as either a standalone or an expansion, and is slim or generous depending on which angle you're coming at it from. As an expansion, you're getting 12 bikes picked from a slim pool - there's a firm emphasis on sports bikes, with plenty of panache but not much in the way of variety in the selection - and an all-new tour that folds in DriveClub's existing locations. If you're coming completely fresh to this as a standalone, you're getting a broad and persuasive look at how Evolution's once troubled racer has blossomed into something fairly special.Indeed, for both parties, what makes this expansion so fascinating is how it brings into focus what DriveClub does so well. First there's the sense of speed, a feeling amplified by the aggressive steeds that are the new stars. The rawness of these rides helps sell that, too; in contrast to the more refined exhaust notes of a Merc or BMW, here we're treated to the hellish rasp of Yamahas and Ducatis. When it comes to getting your heartbeat from a standing start to rattling your ribcage, there are few other games out there that can compare.DriveClub Bikes is keen to show you some of Evolution's neatest tricks, too, with many of the events taking place in dynamic, changing conditions; rain-slicked Scottish roads drying out under a bucolic morning sun, or a Chilean evening descending from delicious twilight to complete darkness. Adapting to these conditions becomes just as much a handful as adapting to the new behaviours introduced by the bikes.It's here, too, that Evolution's affinity with approachable, meaty handling models comes to the fore. There's a lighter, more forgiving touch at play here than elsewhere in DriveClub, and while the stabilisers are most definitely off you can still feel a guiding hand that's careful to ensure you never topple off the bike. Highsiders and lowsiders are out, effectively, which encourages you to take the bikes to extremes - something which, thanks to objectives throughout the events that can be brutally tough, is actively encouraged.At its best - whether that's hot-lapping or scrambling your way to the front of a jostling field - DriveClub Bikes can feel pretty phenomenal, its bikes a brilliant blend of pace, twitchiness and precision, and it's amazing how well the existing locations acquit themselves with their new denizens. Cambers that were once swallowed up by the P-Zero Pirellis on a Ferrari F12 come alive when attacked with a Ducati Desmosedici, and in the wilds of DriveClub's public highways you can see echoes of the public roads that are at the heart of bike racing: scraping knees on kerbing and grazing your helmet on some barbed wire fencing, it's enough to make you feel like those hairy knuckled heroes such as John McGuinness or Joey Dunlop.So DriveClub Bikes is a very pleasant surprise, another fascinating chapter in the exceptional turnaround of Evolution's game. Don't expect it to change any of the fundamentals - multiplayer races are still overly aggressive, and the progression system still feels stunted and dumb - but do expect to see the work of a developer that's now firing on all cylinders. I can't wait to see what they do next."}