{"ref": "https://www.eurogamer.net/cibele-review", "date": "6 Nov 2015", "game_name": "Cibele", "text": "Cibele explores a place well trodden by literature, but often neglected in video games: the coming of age story about first love. A staple in English lit with titles like Alice Munro's How I Met My Husband and F. Scott Fitzgerald's Winter Dreams, few games explore this murky, confounding experience. And so it is that Nina Freeman's supposedly autobiographical retelling of her first romantic dalliance is a video game about a boy she once met through a video game.If it sounds too meta, rest assured that this is not The Beginner's Guide, another recent indie autobiography. Freeman's tale is far more straightforward: boy meets girl. Girl likes boy. Lots of texting and panty pics are sent. It's a true modern romanceSet in 2009, when Freeman was 19, Cibele is split up into three roughly 30-minute acts. Each begins with the player exploring files on Nina's computer. (For purposes of discussion, I'll refer to the in-game character as Nina and the developer as Freeman.) These consist of profile bios, pics, poems, drawings, homework assignments and text messages. Then you jump into a fictitious MMO called Valtameri and play some co-op with your crush, a boy named Blake.Valtameri itself is little more than an interactive screensaver where you simply click on enemies and wait for you and Blake to whittle down their health. There's no game-over status, power-ups, or anything of the sort. It's more like listening to a radio play where you need to click on things to progress the plot. Each foray into Valtameri is mercifully brief at about 15 minutes each, but even these excursions drag on a longer than they need to.But Cibele isn't a conventional video game. Cibele is instead more of a guided tour through Freeman's formative years. Using multimedia to capture a snapshot of the different modes of communication available to today's youth, Freeman fills her arsenal with audio dialogue, chat messages, photographs, and even some live-action video where the 20-something developer plays her teenage self. It's an interesting notion that sets the younger generation apart from anything that's come before. Now, more than ever before, relationships leave a substantial digital footprint. We don't just have diary entries, drawings and the rare photo to capture our feelings at a certain point in time, but through social media like Facebook, Instagram, Twitter, Snapchat, and even our text logs there's a surplus of often embarrassing remnants capturing details both large and small about our lives at any given time. With more and more people meeting through media rather than the meatspace, it's only fitting that Freeman tells her tale through a game.Freeman daringly lays much of her past bare, though it's worth noting that this is creative non-fiction rather than a documentary. Freeman plays herself, while Blake is played by an actor (actually two actors; one in voice, the other in dialogue-less videos). Even if this is a reenactment of her youth, it's still a boldly personal move that's easy to admire. Unfortunately, Freeman's execution doesn't connect with me as much as it's intended to. Much of this is due to the fact that Blake comes across as a rather miserable sort. Upon his first introduction he complains about how he loathes most of the people he plays with, but enjoys organising them and yelling at them when they mess up. His narcissistic tendencies are apparent from the off and his hot/cold flirtation style of extreme praise oscillating with emotional distance keeps the characters' chemistry from sizzling in the way needed to pull me along on Freeman's journey.Their primary connection seems to stem from the fact that they both see themselves as outsiders, but it's for very different reasons. Nina's social foibles emanate from the fact that she's shy, but we see enough of her texts and chat logs to ascertain that people generally like her and she actually has a pretty active social life. Blake, however, seems like a loner because he's a miserly snob. It seems like Nina's attraction to Blake is founded on three principles: a.) He's hawt. b.) He thinks she's hawt. And c.) She's hungry for some lovin'. (It's revealed in the opening minutes that she's a virgin, an important detail.) When you're still a teenager and your romantic life is primarily still an unexplored flurry of daydreams, this confusing concoction of attraction, attention and hormones is a potent enough cocktail to get one's mind racing. But to an older audience it's overly awkward when Blake spouts lines like ~You're way better than other girls~ about her performance in-game.Part of this, I think, is that the characters talk too much around their connection. So much of their dialogue is focused on sending each other pictures, talking about how sexy they find one another, and waffling around if and when they're going to meet in person. It's difficult to take their relationship seriously when they've not gone on a single date yet, and their chatting doesn't dive deep enough into what makes them so special to each other. It makes Cibele's mid-section a slog as the pair obviously want to meet each other but are too shy to make the plunge. A third act digs into their anxieties further, but it feels like too little too late. Romance is a tricky thing for video games to get right. If you make an NPC love you regardless of your actions it feels cheap and pandering. But if there's a way to lose their affections by not saying the right thing or choosing the wrong action, then it suggests the connection wasn't as strong as we thought. It's a catch 22. Freeman avoids these pitfalls by removing choices entirely and letting the player click along to her prescribed program. In this way, Cibele isn't much different from a linear Naughty Dog game like The Last of Us, which, for my money, has among gaming's most captivating character drama. While Cibele's look at young love fails to recreate the chemistry of films like Before Sunrise or Moonrise Kingdom, it does capture the courting process of a new generation. Video games can be a useful bonding activity. Some people have even attributed their relationships to playing games like Fingle and Borderlands together in their early stages. It's a shame, then, that her Cibele is let down by being too short, too vague, and suffering from some weak voice acting.But even if Freeman's premiere commercial effort doesn't knock it out of the park, it sets the stage for future autobiographical games to come. Cibele is a clumsy game about a clumsy relationship. It's a noble effort that doesn't totally work, but then again, first times rarely do."}