{"ref": "https://www.eurogamer.net/wwe-2k16-review", "date": "5 Nov 2015", "game_name": "WWE 2K16", "text": "When you think about it, a wrestling game represents something of a unique proposition for a developer. For the most part, it's a sports sim: the performers can be motion captured and the action digitally recreated just as you would with a football or basketball game.But professional wrestling isn't a sport. Those punches aren't connecting, the barbed wire has caps on and, let's face it, the People's Elbow really doesn't look like it would hurt that much. Unlike, say, FIFA, a WWE game shouldn't strive to be a true representation of its source material. Enjoying wrestling involves a leap of faith, and, more than anything, it's this gap between the real and the imagined which makes creating a compelling wrestling game so difficult.It's fair to say then that, in recent years, the WWE2K series has failed to rise to this challenge. The joint efforts of developers Yuke's and Visual Concepts have been universally poorly received and, somewhat tragically, the genre has been sidelined. Whereas once every console owner would have a Smackdown! or WCW vs NWO in their collection, the titles seem to be released now strictly for members of the IWC.I'm pleased to report that WWE2K16 bucks this trend. By finding that sweet spot between ~sports~ and ~entertainment~ the developers have managed to create what, for my money, feels like the best wrestling game experience for at least eight years. Not since the 1-2-3 Kid beat Razor Ramon has there been such an unlikely turnaround.So how have they managed it? The answer is - excuse the pun - quite hard to pin down.For starters, it would have been very difficult for 2K16 not to represent some improvement from last year's iteration. 2K15 was the series' first next-gen release and had clearly been rushed due to struggles with the transition. Sparring was buggy and felt frustratingly unresponsive at times, and it seemed like huge amounts of content had been lopped out of the game at the last minute. The roster was too small and the game modes you've come to expect from the franchise were either truncated or missing entirely.2K16 largely puts that right, with an expanded, richer MyCareer mode, a huge selection of wrestlers to choose from - albeit limited when it comes to Divas - and a fully featured create-a-wrestler suite. Taking a personalised Superstar from the little leagues of NXT right up to the Championship Belt is one of the most enjoyable sports game career mode experiences around, and while it may not reach the heights of Smackdown: Here Comes the Pain, 2K16's variety of matches, rivalries and PPVs - all as you level up and customise your grappler - makes for a hugely compelling timesink.The 2K Showcase also returns, and this time charts the career of cover star Steve Austin. Although not new to the series, its a wonderful feature and one that should truly delight hardcore fans. With its clever use of archive footage and the enlisting of Jim Ross and Jerry Lawler to provide the commentary, the mode is a celebration of everything that's great about professional wrestling - the pageantry, the over-the-top drama, and above all, the nostalgia.What about the changes that really matter, though - those within the ring? You'd assume that with the Terminator as a DLC playable character - surely one of the strangest cross-promotional tie-ins of recent years - 2K16 was taking a step back towards the genre's arcadey roots. In fact, the opposite is true, with new or refined simulation elements making every fight much more cerebral than lapsed fans might expect.For the first time tactics and resource management plays a major part in how you navigate a match. Reversals - overpowered in recent years - are now finite, meaning it's sometimes best to absorb a few blows early on knowing that a well-timed flick of R2 could turn the match on its head as your health bar runs down.Depending on which wrestler you're playing as, you'll have different amounts of reversals to use up, lending more variety to gameplay than I can remember in the genre. While it's frustrating to lose in a bout you've been dominating, on the other hand it's hugely satisfying to win thanks to one you've stored up. If wrestling is about anything, it's dramatic changes of fortune like these - regardless of who's been pummelling who for the last 15 minutes.Meanwhile a new Working Holds system - similar to Chain Grappling - offers you a chance to rebuild stamina mid-match, just like the real performers do, while the pinfall system has also been tweaked. To beat stronger opponents, especially when you start off a new MyCareer game, you'll have to master all of these new features and make the most of every trick up your sleeve.The one bugbear I did have with the new gameplay systems was with submissions, which involves another of 2K's quick-time event minigames - this time one in which you must use your right thumb-stick to chase or avoid a pointer around the circumference of a small circle (yes, it's just as strange as it sounds). The switch from left trigger, to control your wrestler, to right, to move the target, is counterintuitive, and time and again I've lost matches simply by pressing the wrong stick. Even when you use the correct side, the fact that to win a submission you have to ~chase~ your opponent, but to break out of one you have to avoid them, is too simply too hard to get your head around in a split second.Collision detection has been tightened up, with fewer frustrating moments where your character grabs at thin air or simply refuses to get back into the ring and an overall better flow to the action. The main difficulties I encountered involved tagging in and out and, while frustrating, problems like these have dogged the series for years. We can but hope 2K17 irons out a few more of these forgiveable - but potentially game-spoiling - kinks.What's harder to forgive is some of the flaws in the presentation of the game. While a great effort has been made to model some Superstars and their entrances, the quality is hugely uneven, with some particularly ropey-looking Divas rather letting the side down. Commentary, too, could be better, particularly if you're come expect the standards that EA Sports are setting each year. It doesn't take long to become tired of hearing the same stock phrases, particularly if you're feuding with one character and end up playing them several matches in a row.The loading times are also a source of frustration. 20 to 30 second delays might be understandable in an open-world RPG, but not when switching between modes in a sports sim. This slowness also seem to impact online, where matchmaking takes an age and a recurrent lag means anything but the most basic match seems impossible. Although not something you'd typically associate with wrestling games, online play is an area of huge untapped potential. But perhaps more something for 2K to look at once the core gameplay has been nailed down.So while a marked improvement on recent years, does 2K16 offer enough to push the genre back into the mainstream? On balance, probably not. WWE's popularity is at an all-time low and it will take a more polished release with fewer eccentricities to lure those who have no interest in its real-life incarnation. For the rest of us, though, it represents something hugely welcome, something that last year would have seemed like a leap of faith in itself - a wrestling game worth playing that doesn't involve using an emulator or hunting for an N64 on eBay."}