{"ref": "https://www.eurogamer.net/werewolf-the-apocalypse-earthblood-review", "date": "4 Feb 2021", "game_name": "In Werewolf: The Apocalypse - Earthblood", "text": "Every mission always seems to end in the same way.I creep in, stealth-style, and take cover behind the outrageously convenient waist-high panelled fence. A quick burst of Penumbra Vision - just another name for that oh-so-common video game mechanic that lets you see through walls and solid objects - shows me there's five - no, wait, eight! - enemies between the exit and I. For a couple of minutes, I sweep around the perimeter, executing a couple of stealthy takedowns, until someone, somehow, spots me from the other side of the room, tickling not only his spider-sense but that of every other soldier in here with me, too. Some big dude with an unfeasibly enormous gun stomps over to where I'm hiding, smashes down the fence I was crouched behind, and what do you know, it's fight time. Eventually, you - that's Cahal, who looks like he plays drums for a Motorhead tribute act in his spare time  - will look around and realise the room that was once filled with fencing and boxes and several living, breathing people is now entirely empty save for a handful of twisted corpses and oceans of spilt blood. You jog to the door, press the button and step through, automatically move into a crouched position, ear-wig on the nearby soldiers, and the same thing happens all over again.To be fair, fighting in Werewolf: The Apocalypse - Earthblood - quite a title, eh? - rarely feels unsatisfying. It's bombastic and bloody and brutal, but while the stealth sequences see you creep about the place as an interminably forgettable old white dude, the fight sequences, as perhaps intimated by the name of the game, are a little different. The moment things get hairy - no pun intended - he'll transform into a gigantic, bloodthirsty werewolf and the ensuing battle - which is always accompanied by a scream of rock music and a throbbing drumbeat - is frantic, and usually fun. Kick the final corpse to the ground and Cahal will transform back into his humanoid form, helpfully denoting the fight, for now at least, is over.Stylistically - even mechanically - it feels like something of a love letter to the older action games us old-timers grew up with. It takes its cues and inspiration from old-school Metal Gear Solid and the first couple of Resident Evil games, from the set-pieces and creature design to the score. Towards the end, though, the homage teeters dangerously close to pure rip-off, with the final act taking place on an oil rig that's strikingly similar to Metal Gear's Big Shell, complete with a handy vent system for Snak- I mean Cahal - to wiggle through. But while Snake was pretty adept at getting past enemies unspotted, Cahal's ventures aren't quite as successful, inevitably because the odds seem ever stacked against him. There are always so many enemies rammed into each area that even with their dreadful AI and a handful of crossbow bolts (you'll learn not to rely on them; you'll never have enough), you're probably going to end up getting your claws out before you reach the other side. I'm not complaining about that exactly, but though perfectly perfunctory, the combat will begin to feel very samey, very quickly. Every room is configured in a vague approximation of the one that came before it, with fencing and stacked boxes and oil drums, and the same thugs and soldiers stomping around the place. Occasionally, you'll breach an office with a conveniently unlocked PC with which you can toggle electronic doors, turrets, and cameras on or off. It's a neat mechanic, particularly paired with the ability to sabotage the entryways through which reinforcements enter. But this is essentially it for the full duration of the game, ad infinitum, with a handful of fairly unremarkable boss battles thrown in for good measure.Because so much of the game is dedicated to combat, it stands to reason that there are several tricks and special moves to change things up. There are two metered combat devices; Rage, which enables you to pull off various special attacks that can be unlocked by collecting spirit points and advancing your skill tree, and Frenzy, which essentially boosts Cahal's strength and stamina for a limited period. The former is generated by light/heavy attacks, takedowns, combos, or via whiskey bottles secreted around the place, while the latter builds up during a scrap. Frenzy is pretty useful, particularly if you're taking on a boss, but beyond Rage's helpful self-heal ability, all the other offensive tricks seem to do essentially the same thing.It's not even as if the story carries it, either. Just another reimagining of the David versus Goliath tale - or Werewolf versus Big Corpo, in this case - the story is stuffed with plenty of explosions and untimely deaths and agonisingly shallow character archetypes (and one dreadful stereotype of a native woman that potentially falls just on the wrong side of racist), as well as quite a bit about the fragility of each Garou/werewolf and their ability to balance their humanity without giving in to The Rage. And while there's a little space given to the lore of the tabletop RPG on which the game is based, it's not nearly enough; too many of Werewolf: The Apocalypse's more supernatural elements go unexplained entirely. Furthermore, the in-game world is absolutely tiny, which means there's zero opportunity for organic exploration; a shame, really, as having a bigger world to explore would help balance the repetitive combat. Sadly, the hub world of your Caern - your pack and its human allies - is curiously empty and always suspiciously close to the enemy's numerous camps.There's more, but none of it particularly impressive. A prison in which no-one ever moves about and man-sized air vents are left open all over the place. Atypical discussion prompts that ask you to select a direction of travel rather than actual words of dialogue. A lacklustre story and characters that are so superficial, it's hard to forge any emotional connections with any of them.  I completed a full 96 per cent of Werewolf: The Apocalypse - Earthblood before I encountered technical issues. Finishing off one particular enemy triggered a crash and sent me back to the dashboard, and every time you reboot, the game helpfully tells you how much you've completed. It was a maddening sequence, but I got through it in the end not by killing him, but by Roaring him off the narrow oil rig platform (and trying not to follow him over the side, which I did do... several times). Though full of ideas, Werewolf: The Apocalypse - Earthblood leans too heavily on games that have come before it and doesn't quite have the courage to expand its own innovations. Yes, I played to completion without complaint, and yes it's a bloody, good romp at times, but that doesn't mean it's a particularly novel or memorable one."}