{"ref": "https://www.eurogamer.net/kingdom-review", "date": "21 Oct 2015", "game_name": "Kingdom", "text": "It's easy to describe what Kingdom is, and yet it's probably best not to. This abstruse pixel-art game from two-man outfit Noio and Licorice uses familiar genres in obvious ways, and I could easily slap them on as labels. But if I did I'd ruin the enigma,  because working out what Kingdom is and what you're supposed to do is the entire point. Campaigns fail and you must start again, but you do so armed with a bit more knowledge than before, and a deeper understanding of the game you're playing. Each thwarted campaign is discrete, and yet mentally they're all connected, all layers of a learning experience that together represent a whole. Other games treat failure as an obstruction to progress, but in Kingdom, a game with no manual and that offers no easy explanations, trial and error are the only way to extract its secrets.I've been playing for 12 hours now. I feverishly restarted campaigns in the hope I would discover and achieve the game's win condition and solve Kingdom's ultimate mystery for myself. But in the end I couldn't and I had to cheat: I had to ask the publisher what it was. Be assured, a win condition exists. Annoyingly I was closer to it a handful of hours ago, but it's there, coaxing me back in again, willing me to have one more shot at it.To say I don't understand all of Kingdom isn't to say the game is complicated, because it isn't. Its beauty lies in its simplicity. Your King or Queen rides a horse left or right on the screen, and drops coins. Those coins either convince a person to join your cause, or they pay for structures to be built at certain spots. Kingdom begins by guiding you through building a small base with two stake-in-the-ground walls, and puts a hammer and/or a bow in the hands of your few followers. Then comes night, and with it a few enemies you'll easily slay. The following morning, you're rewarded with a chest of coins. From there, it's about survival. Kingdom sets you off into the world with nothing more than the words 'build, expand, defend.' How things work and what you need to do you'll have to figure out for yourself. How do you earn coins? How do you expand? How best to defend? Simple questions that come with many answers. What Kingdom does so well is keep it all manageable and understandable. You'll soon know what things to do but you'll endlessly debate when to do them, and where. Will your builders reach an area in time? Do you have to collect more money from the other side of you kingdom? Will you have time to do it all before dark? Timing becomes key.The other thing Kingdom does, and while it's not particularly pleasant it's absolutely essential, is really mess you up. It'll send a stampede of enemies against you that even the best defences can't withstand. Is it random, or is there a tell in the moon? The stampedes inevitably leave a path of destruction in their wake that you must clear up - if you survive them, that is. But here Kingdom is kind, and gently encourages you to have another go. Your people aren't generally killed but either drop their tools or weapons, or become neutral wanderers who need buying again. So all is not lost. But something inevitably is. ~Nothing lasts...~ is the game's motto, and I believe it speaks specifically to these stampedes. They're a constant, unpredictable spanner in the works.If (or more realistically when) you die, you're told how long you survived for and you're prompted to start again. There's frustration in silly mistakes that cost your hour-in-the-making kingdom, and there's sometimes weariness in building it all back up again. But it's all wrapped up in so friendly a package - a largely peaceful game that looks like a pixellated fairytale, adorned with sweet, tinkling music - that Kingdom's arm is soon around your shoulder and leading you back in. I documented my thoughts, theories and revelations while I played Kingdom and it's funny looking back at them now, and seeing the things I didn't then know. ~It's odd,~ begins one observation, ~it's all a bit like having insurance.~ Another, taken from the run I got arguably closest to the win condition on, reads: ~F*** me! When you do, be ready!~ It's those small moments of revelation, and of hard-won understanding, that make it all feel worthwhile.Kingdom skilfully pitches a powerful discover-it-yourself idea at just the right level, neither too frustrating nor too easy. It may always feel slightly unfair, as if the chaos is greater than your orderly systems, but from that challenge comes the vital will to overcome, and the desire to wipe the board clean and start again.  ~A solitary Queen carries the crown to a new land...~ The game leads me in again. This time, I know, will be the one."}