{"ref": "https://www.eurogamer.net/armikrog-review", "date": "6 Oct 2015", "game_name": "Armikrog", "text": "It's the wasted potential that hurts the most. Armikrog begins with a catchy song, a gorgeous claymation planet, and a hero facing off against a wonderfully designed monster with a tongue so long that its mouth comes fitted with a winch. It's imaginative! Beautifully made! Exciting! Creative! Lots of other enthusiastic exclamation marks! You may have seen it already. All of this was in the Kickstarter pitch video, which not too surprisingly helped the developers raise a cool million dollars.The Armikrog we eventually got - the whole tedious thing - consists of walking around an almost entirely empty fortress, solving incredibly turgid logic puzzles, and often doing so in near-silence because the background music seems to decide at random when it's going to put in an appearance. Four minutes of crowd-funded optimism leads to about four hours of sub-Myst level dreck.Not only is this one of the dullest adventure games in ages, it's also the kind that makes you question if anyone involved has ever even played one - including its spiritual predecessor, The Neverhood. It's almost impressive how poor it is as an experience, with only very occasional moments where the clay backgrounds are used as interesting scenery instead of just simple rooms full of random floopydoop, or a place to put floating sigils needed for the main puzzles.There aren't any real characters to chat to either, you can't look at anything, and you can't touch anything that's not directly part of a puzzle. You don't even have an inventory screen, never mind a reason to care about Tommynaut's adventure through a world that is occasionally very pretty, but more often feels as though solid blocks of clay were slapped down here and there.That's the most surprising part, really. Normally a game like this at least has a well of creative potential to draw from, and memorable moments worth thinking back and smiling on. The Neverhood certainly did, and while it wasn't an amazing game all told, it at least felt unique and made good use of its clay to create something that felt original and involving. Much can be forgiven in exchange for a beautiful world, for memorable moments, for the chance to step into a creative wonderland, and play around with ideas and delicious tactile impossibilities.But no. What stands out about Armikrog is how happy it is to sit on its laurels and only get up occasionally to shuffle uncomfortably around. It's not a world, just a gauntlet of uninspired puzzles so short and padded with backtracking that it barely qualifies as a prologue. It has a story, but it's one so poorly told as to be completely forgotten about for most of the game. It has a hero, but he couldn't be more forgettable if his special power was amnesia. The villain barely bothers to show up.Armikrog features Mystery Science Theatre 3000's Mike Nelson and cartoon legend Rob Paulsen voicing the main characters, yet it fails at giving either the occasional funny line. Additionally, Nelson's dialogue sounds like it was recorded in a cupboard as a way of passing the time while cooking a hard-boiled egg - with a script this short, you could record a sequel and it'd still be soggy.Nothing is good enough here, really. There's not a single puzzle that can be called truly great from start to finish, and the majority of them amount to exercises in either backtracking, repeating something you've already done, or sometimes just plain clicking randomly. This stuff wouldn't be so bad if you were encouraged to click and explore the environment, piecing together the rules as you went.Instead, Armikrog simply ignores anything that you're not meant to use at this very moment in time. It's so picky that if you have Tommynaut try to click on a button that companion Beak-Beak is supposed to press, literally nothing happens. No ~Nope~, no ~Hey, let me try it instead, boss.~ Nothing. Nada. This isn't even close to meeting modern adventure standards, coming as it does in the wake of games like Machinarium and The Dream Machine.From the perspective of the meagre soundtrack, there's nothing on a par with Neverhood composer Terry Taylor's past stuff - Little Bonus Room, for example, or the utterly crazy Neverhood theme in all of its babbling insanity. The closest you'll come to this sort of quality is when you reach a hidden room built to list a handful of high-tier Kickstarter backers, and even then the whole thing comes across as more of a tiresome obligation, now grudgingly fulfilled. At $500 per name, you have to at least hope the people listed enjoy the muddy, 160kbps music that's on offer.Despite release delays, Armikrog still feels like a beta. The original launch was a mess, and while I didn't experience any major problems following the first patch, it's still full of annoyances such as sounds mysteriously cutting out, or finding yourself stuck on repeated animations. Other players have reported more serious complaints though, such as Tommynaut having items he shouldn't, or becoming trapped in rooms. In short, beware, and save often. There's more than enough backtracking in the game, and having to do even more of it isn't exactly going to improve your mood.For the best experience though, you may as well avoid Armikrog altogether. Boring and bland, it's a dismal failure as an adventure game, and neither a worthy Neverhood sequel after all these years of waiting, nor a game worth bothering with on its own unambitious terms. Strange. You'd think a company working in clay would know better than most when a game is half-baked."}