{"ref": "https://www.eurogamer.net/death-ray-manta-se-review", "date": "30 Sep 2015", "game_name": "Reviews", "text": "If everything had gone according to plan with Geometry Wars Retro Evolved, it would have ended up a shadow of its final glory. For all the myriad spawn patterns the game draws upon, each enemy type can be relied upon to provide a fleeting moment of transparency on arrival, during which time the player can make contact and survive the encounter. Every enemy type except the snakes, that is. They appear fully formed and deadly, and the most delicate of dances is required to escape from within their collective clutches.It's a bug for all intents and purposes, but crucially one that prevents players from simply hugging the walls as they travel in an endless circuit, dealing only with the dangers directly ahead, and remaining largely oblivious to the greater density of accumulated enemies trailing behind in a homogenous blob. Instead, the protective walls that enclose the arena become a source of danger themselves, forcing high level players to explore the centre to a much greater degree, and give themselves space to escape from the writhing, circling snakes whenever they appear.Pretty much everything that matters in Death Ray Manta happens right there in the middle of the screen too, but the danger is everywhere, from the host of digital creatures that crawl around the vicinity of your vessel, to the missiles and bullets that float from sources unseen at the sides of the screen. Unlike most twin-stick shooters, where there's a slick dependability to the controls, DRM is only ever as grudgingly responsive as it needs to be and is at first agonisingly treacle-ish to play. At first you'll glide helplessly into a wall of bullets you saw too late to correct for, but once you've acclimatised yourself to the stickier pace, you'll come to love the nightmarish quality that it lends the game.That's not the only thing that makes DRM feel so refreshing either. The game itself presents something of a puzzle too, and from the very start the goals and behaviours of each of its elements are wonderfully opaque, and surprisingly rich for a game of this type. You can't, for example, shoot the enemies that race around the edge of the screen - preventing that same wall-hugging drudgery - but you'll only discover this shortly after your bullets have evaporated into the wall behind them. You advance to the next stage by killing the last of each level's destructible enemies - but it will take a little while before you connect this progression system with your own fumbled frenzy of bullets.Then there's the special gem that's hidden on each stage, the existence and purpose of which isn't even clear at first. Tucked away on every screen - sometimes within sight, sometimes just obscured - is a digital jewel. You have just a fraction of a second at the start of each level to decide whether or not to bolt towards it - throwing fire wherever it's needed to ensure your own survival - and grab it before it vanishes for good. Do so, and you'll double the score you receive for finishing the level. Die on the way though and it's back to the very beginning. It'll make a fool or a hero out of you, and it's deliciously risky to find out which one.Even the space within which you move has got it in for you. In this spruced-up edition of the 2012 original, there's a mesmerising cacophony of glowing bricks and brittle creatures scattered all around, and they confuse and delight in equal measures. Neon trails are as gorgeous to savour as they are deadly to enjoy, and you'll often find yourself breaking the genre's golden rule of never looking back as you bob and weave your way head-first into an unseen obstacle. Put simply, everything that doesn't actually kill you in Death Ray Manta seems designed to distract you from something that would rather like to.The twin-stick heritage of the game is apparent enough, but there are flashes of other games to be found here as well. There's the gritted-teeth desperation of a Super Meat Boy dash to the finishing line, for example, and it's hard not to recall the catastrophic risk and reward system so central to Spelunky. DRM presents you with just a single life to progress through its increasingly tricky levels, and it's a game so terrifyingly absorbing in its intensity that it was at least half an hour before I even realised the levels themselves were sequentially repeating on each attempt.Beyond the influences of other games and other genres there's a sprinkling of yesteryear to be discovered as you advance through the game too. The Galaga-esque turrets which race around the edge of the screen appear very early on, and are an obvious enough nod to gaming's heritage, but it's impossible not to grin at the sudden playfulness of later levels, where Frogger's vicious red racing cars turn up to streak left, right, up and down in the fashion of Geometry Wars' terrifying arrow waves.You can easily overdo this sort of playing to the retro gallery, but there's an admirable restraint in the way DRM goes about its business here - even taking into account the syrupy-thick, melodramatic synth track which bobs along like an 80s film celebrating its own fist-pumping freeze-frame finale. If you're of a certain age, Death Ray Manta feels rather like the last turtle down of video games, but it never tries too hard to win you over.When it all comes together, DRM hits the heights that all of the truly great twin-stick shooters reach. As you master each stage of the game, and commit all of the jewel locations and enemy movement patterns to muscle-memory, it becomes nothing less than an exhibition event where you push yourself to finish everything faster, smarter and more efficiently than ever before. This is, sadly, also a source of one of the game's very few shortcomings.Although the predictable nature of each level lends the game its satisfying sense of executional flair, it's this same single-life, back-to-the-beginning approach that takes a little of the shine off things once the exhilarating early days are behind you. You want to know what other ghosts of gaming past might show up in later levels, but it simply takes too long to climb back up towards your last high  water mark of competence, so that you can tackle a section that actually challenges you. Motivation to do so fades fast.I don't think I mind too much though. I'm used to games challenging me, frustrating me, entertaining me, making me think, and making me work for my rewards, but it took an accidental Saturday afternoon in the company of Death Ray Manta to make me realise that it's been far too long since a game made me feel unconditionally happy, and fortunate to live in a time of such fascinating toys."}