{"ref": "https://www.eurogamer.net/animal-crossing-happy-home-designer-review", "date": "23 Sep 2015", "game_name": "Animal Crossing: Happy Home Designer", "text": "Creativity - or, more specifically, the art of making stuff - has been a common thread running through Nintendo's gaming output in 2015. Kirby and Yoshi celebrated the aesthetic joys of craftsmanship on Wii U, with their worlds of lumpen clay and wool, while the advent of Splatoon's chaotic ink fights saw Nintendo subtly shifting focus, moving the tools of (in this case, riotously messy) creation directly into players' hands.It's there they've mostly stayed, with Art Academy: Atelier, Super Mario Maker and now Animal Crossing: Happy Home Designer all foregrounding the act of making stuff until it becomes the whole game. At first glance, this treatment might seem like a dramatic shift for Animal Crossing - with Happy Home Designer trading twee life-sim trappings for interior design - but, really, it's a logical progression for a series that's ultimately always been about self-expression.Nintendo's Animal Crossing games task you with taking ownership of the world around you. They invite you to spend days planting flowers and plopping down pavements, to manipulate the emotions of your neighbours in shameful displays of bullying until you've created a carefully cleansed utopia, to amass cupboards of pricey bric-a-brac and waste countless hours arranging them just so.Happy Home Designer, of course, is unusually single-minded in its focus. It's certainly familiar in a lot of ways - a relentlessly cheerful, folksy package, filled with the kind of warm-hearted flourishes that define Animal Crossing - but it reduces the core series' expansive roster of activities down to just one. There's no fishing, no shopping, no digging and no free-form exploration of any kind. Instead, as the newest employee of Nook's Homes, it's your sole duty to sate the desires of the game's anthropomorphic townsfolk by hoisting your stylus, rifling through furnishings and assembling their dream homes.After your first few introductory jobs, you'll be set loose in New Town - an expandable, customisable hub of quaint coffee shops, cafes and other public amenities (which, despite superficial similarities to Animal Crossing's open world, is really little more than an elaborate facade) - and it's here that you'll stumble upon an ever-changing procession of animal clients, all eager to exploit your services. Find a brief that you like (~I want to be surrounded by traditional zen decorations~, for instance, or ~Make a scary home for telling ghost stories~) and you're ready to begin the game proper, summoning your unwavering good taste and flair for detail in order to create the perfect home.Much like Super Mario Maker, the core component of Happy Home Designer is essentially a glorified level editor. That's not to be dismissive of the game's expansive toolset, mind; Happy Home Designer is a wonderfully tactile affair - flexible, approachable and intuitive enough to enable anyone to unleash their inner Laurence Llewelyn-Bowen. Creating the perfect home is simply a matter of browsing the game's vast catalogue of loosely-themed furniture and furnishings, then dragging, prodding and positioning items into place using a simple, grid-based touch interface - all while the results of your labour appear on the upper screen in lovingly rendered 3D.Surprisingly (or perhaps not, depending how cynical you are), HappyHome Designer's use of the new Animal Crossing amiibo cards isremarkably non-intrusive. Indeed, if you can ignore the relativelyunassuming amiibo phone plonked inside Nook's Homes, it's easy toforget about amiibo cards entirely.If you do fancy dabbling in Nintendo's latest collectible line,however, then the phone lets you to tap an amiibo card on your 3DS andsummon the Animal Crossing character depicted on it into the game.Most characters will eventually turn up in your town anyway, but anumber can only be accessed via special cards. There are 17 of theseunique characters in total (including Tom Nook, Tortimer, Resetti andKapp'n) and you'll find one randomly included in every card pack.Once a character has been summoned, you're able to access their smallselection of unique items, customise their homes, invite them over tohang out in previously completed houses and assign them to variousroles within one of your public amenities (for example, as a waiter ora customer in your restaurant). As such, you're not missing out on anymajor functionality if you choose give amiibo cards a miss, but youmight be tempted to delve in if your favourite character features inthe special line-up. It might sound basic, but Nintendo has build an impressively complete package around the game's singular central premise. Far from being the stripped-back, amiibo-card-pushing cash-in that many feared, Happy Home Designer is generous with its tools, slowly expanding its initial focus on furniture-shifting to include almost everything a budding interior designer might need. Eventually, you're able to customise floor plans (and ceiling fixtures, lamp fittings, windows, curtains and doors), design your own fabric and wallpaper, snap photos and even tinker around with ambient sound. You're not stuck indoors either; building exteriors are customisable and you can even indulge in some (admittedly rudimentary) landscape gardening.New toys and trimmings are added to your inventory with each new client request and, as your toolkit deepens, its easy to get lost in Happy Home Designer's genteel rhythms, carefully tweaking and refining your designs simply to satisfy your own creative desires. Before you know it, you'll be pondering the aesthetic implications of a chaise lounge, obsessively heightening the dilapidated ambience of your haunted house, or toppling into existential despair as you debate adding another sofa to your project - just in case the entirely fictional Kabuki might want more than two friends around for tea.At this point, it's worth underlining the fact that progress through the game is entirely shaped by you. Beyond a few very loose requirements per project (namely the starting theme and a handful of items that you'll be asked to include) Happy Home Designer gives you little to no direction. What's more, it remains resolutely non-judgemental throughout; there's zero penalty for straying from your brief and even your most ramshackle designs are likely to be met with giddy whoops of approval from your clients.It's absolutely the right approach to take, of course; a more restrictive, goal-orientated structure would stifle creativity, and it would be near-impossible to introduce any meaningful scoring system given the arbitrary nature of taste. However, if you're the kind of person that needs strictly-defined parameters in order to gain a sense of meaningful progression, then much of the game's charms are likely to be lost on you.That said, Nintendo has made some concessions here. A day one update introduces the Happy Home Network - a suite of online features enabling you to upload your designs for review by other humans. Creations can be rated using a simple set of criteria - and, similarly to Super Mario Maker's online toolset, popular homes float to the top of the pile while less successful designs slowly fade into obscurity. There are even regular, themed challenges, enabling players to battle it out for design supremacy - all of which goes some way to mitigating the rather blasé demands of offline mode.Still, that doesn't change the fact that Happy Home Designer is largely a one-note endeavour - and a game that never really deviates from, or escalates, the genteel design meanderings at its core. As such, you're not going to get much out of it if you simply loathe the idea of interior design, and it's equally unlikely to inspire if you're not creatively-driven enough to set-up your own challenges and goals. Really, you'll know already if Happy Home Designer's leisurely brand of self-expression appeals to you. And if it does, have at it - go paint the town red (or mauve, or blue)."}