{"ref": "https://www.eurogamer.net/the-bbcs-grand-theft-auto-drama-was-weird-and-meaningless", "date": "16 Sep 2015", "game_name": "Reviews", "text": "If one thing sums up the pointlessness of The Gamechangers, it's the announcer who spoke up over the end credits following its broadcast. ~If you're interested in coding...~ they said, launching into a promotion for the BBC's admirable Make It Digital season.The problem is that the preceding 90 minutes, while ostensibly telling the story of how Grand Theft Auto became the world's fastest selling entertainment product, have shown absolutely no interest in the act of game creation whatsoever. If you were to use this film as your inspiration, you'd be forgiven for thinking that Grand Theft Auto: San Andreas was simply willed into life by Sam Houser standing in his New York office. The fact that Houser is played by Harry Potter's Daniel Radcliffe makes the process seem even more magical. ~We need a new game engine!~ he declares, and in the very next scene a new game engine has appeared. He might as well have cried ~Rendarium Gamiosa!~That's a little unfair on Radcliffe, a personable actor who does his best with the painfully thin material the script gives him. Picking up immediately after the launch of GTA Vice City, the film follows Rockstar through the rushed development of San Andreas, and the subsequent censorship battles brought about by legal zealot Jack Thompson.Yet as Rockstar chief Sam Houser, Radcliffe is playing an avatar with less depth and character than CJ, the digital protagonist and ~adaptable hero~ who starred in San Andreas. Houser rarely, if ever, gives interviews and Rockstar itself not only refused to cooperate with the BBC's film, it's suing them for using GTA assets in the production. This means that there's inevitably a large hole where the heart of the story should be. Court documents will only take a screenplay so far, and where a better film would at least give Houser some light and shade, some relatable motivation, The Gamechangers has nothing to say.Instead, Houser is portrayed as a British man with a beard prone to wearing his own branded clothing and pontificating about the need to have ~full sex~ in games. He argues passionately for games that are taken as seriously as film or music, but we get no sense of why this important to him. He has no life beyond the game, no history, no drive, no arc to follow. Instead, he takes constant inspiration from a poster of Hollywood producer Don Simpson, and that's supposedly enough to invest us in his vision.Sam Houser at least gets enough screen time to make an impression. He's surrounded by a trio of friends-slash-colleagues whose function is never entirely clear. There's his brother, Dan Houser (played by Ian Keir Attard), and the only reason we know he's Sam's brother is because Sam calls him ~little brother~ on camera at the start. There's also Terry Donovan (Mark Weinman) and Jamie King (Joe Dempsie). They apparently play a crucial role in making GTA, but what precisely that entails is never explained. In the world of The Gamechangers they exist so that Sam Houser has someone to voice his thoughts aloud to.In what is perhaps the film's nadir, Houser and his posse venture into Compton to research San Andreas. They apparently chose to dress like East 17's backup dancers, and encounter a car full of gangbangers. It's already clear where this is going and, sure enough, once the menacing Bloods discover that these pasty white Brits are the guys who make Grand Theft Auto, they become the best of friends and offer to show them around the 'hood. Not only is the scene toe-curling in its content and presentation, but it informs absolutely nothing in the story.This lack of substance is amplified by a script that is painfully written, full of stilted dialogue and awkward conversations where characters speak at each other in fully formed soundbites. One of the very first lines spoken by Sam Houser, as he elaborates on his ideas for Vice City's follow-up, is ~we have to take it to the next level~ Who knows, maybe the real Sam Houser really does speak in terrible clichés, but as presented in the film it's just one example of many where characters talk in self-explanatory bullet points rather than like real human beings interacting with each other.If you tuned in expecting to learn something about how Grand Theft Auto was made, you'll have come away disappointed. Apart from one hilariously trite montage of long-haired men staring at screens, the actual creative process is ignored. That's understandable, up to a point, as game production is a long, iterative and utterly non-visual process. What is unforgivable is the way the film, made by BBC Scotland and supposedly championing British creativity in the digital industry, deliberately obscures the fact that the GTA games are made in Scotland.Edinburgh is mentioned a few times, but is portrayed as an abstract and mythical place where Rockstar's top men occasionally fly to, or fly back from. What happens there is never explained. DMA Design is never mentioned and, apart from some posters glimpsed briefly in the background, everything before GTA 3 might as well be an urban legend. If you were to watch this film without knowing the industry, you'd assume that Grand Theft Auto is made in New York and sprang into existence solely from the brain of Sam Houser.Somewhat ironically, the character with the most interesting story is Jack Thompson, the Christian lawyer who waged war on Grand Theft Auto and violent video games in general. He's technically the bad guy of the story, from Houser's point of view, but as played by Bill Paxton he's far more intriguing than Houser and his identikit entourage. He has a purpose, a calling, and while it's one driven by pious self-belief and overbearing ego, it at least gives him a narrative arc to follow. He has a family, whose lives are impacted by his crusade. He's also the underdog of the tale, a pugnacious lawyer from the suburbs of Miami going up against (from his perspective) a bunch of rich New York douchebags with an army of courtroom pitbulls. In another film, a more daring film, he'd make for a fascinating flawed hero.Sadly, with the film trying to cram in as much as possible into 90 minutes, Thompson's story gets reduced to a series of vignettes that move his side of the tale forward in clumsy jumps. His supposed nemesis-style relationship with Houser feels overcooked, since they never meet - apart from a hilariously cheesy ~passing in a crowd~ scene that serves no purpose. Another scene where the two Google Image Search each other at the same time is similarly amusing in its heavy-handedness.Thompson's fall from grace is as poorly sketched as everything else in the film. He goes from concerned citizen to ranting zealot with no apparent instigation, and the events that led him to be disbarred are hurried through in a flurry of drab courtroom scenes that make it look like his worst offence was writing a letter. A whole film about Thompson, starring Paxton, would probably have been great. As it is, we get a highlight reel chopped up and stitched into Rockstar's parallel storyline, without ever offering any insight into those parallels.The end of the film simply ties up all its previous mistakes with a bow. San Andreas is a hit, and Rockstar escapes censure for both the alleged GTA copycat killings and the Hot Coffee scandal. Thompson is disbarred, but Hilary Clinton phones him up and says she's passing legislation to keep children safe from violent games. So he sort of wins as well.Then, presumably having no idea of how to actually finish this shapeless story, the film shows Sam Houser walk out into New York traffic and carjack someone. As he does so, the cars, buildings and pedestrians all turn into computer graphics - just like the game - and he speeds off into his digital playground to live happily ever after. It's not just that the graphics used are so painfully bad - this, presumably, is the part where Rockstar's lawsuit hit the film hardest - but that it's such a weird and meaningless kiss-off.But then ~weird and meaningless~ seems like a pretty good description of The Gamechangers in general. It feels like something that got made because the BBC wanted a drama for its Make It Digital season, somebody suggested Grand Theft Auto as a subject, but nobody stopped to think if there was a coherent story there that could be told.The Gamechangers has nothing interesting to say about the making of Grand Theft Auto, offers no insight into the people who made it, and skims through the cultural conflicts it provoked with all the depth of a half-remembered Wikipedia summary. I suspect the reason Rockstar wanted nothing to do with it had less to do with any legal controversy, and more to do with how silly and lame the whole thing is."}