{"ref": "https://www.eurogamer.net/super-mario-maker-review", "date": "14 Sep 2015", "game_name": "Super Mario Maker", "text": "UPDATE: Upon official launch, Super Mario Maker's had its old unlock system, which saw new parts arriving over the first nine days of play, patched out in favour of an approach that lets you get to the good stuff far more swiftly. Because of this, we've updated our review, removing a paragraph that covered the old system, and adding a sidebar that tackles the new one.What lies beyond the first pipe in World 1-2? Don't pretend you have not asked this question - if you are of a certain age, that is, and of a certain disposition. The first pipe in 1-2 is a taunt, the greatest taunt in all of games. And, come to think of it, when it comes to 1-2, what's the deal with Mario?Super Mario is all about the player's control. But when 1-2 first loads in the original Super Mario Bros., Mario is already walking and there is nothing you can do about it. You have no control at all, and even 30 years after the fact, this is still enormously irritating. Mario pads into the first pipe he sees like he's on rails, and then you're underground and - oh! - now you're in control again. But what about back up there? What wonders lay beyond the pipe that you could not help but head into? This question used to drive my sister and me mad. All of one summer was basically devoted to exploring it. Much of the year beyond, too. We felt there must be a way to wrest back control, to break Mario out of his hypnosis, to jump the pipe and explore the expanse of 1-2 that lay above ground, just out of reach. This degree of devotion, this degree of investment, probably explains why Super Mario Maker is not just a level editor from the people who make Super Mario games. In Super Mario games, the levels are not just levels.But, yes, this definitely is a level editor from the people who make Super Mario games. And it's interesting stuff, too. Mario has split a little over the last few hardware generations, and it's tempting, at first, to see Super Mario Maker as a continuation of the New Super Mario line. You know, the 2D one. In truth, though, I think this 2D level builder is actually the final expression of the 3D games. And, man, those 3D games have been getting weird. Since Galaxy kicked players free of the earth itself, creating levels in which courses were flung into eccentric orbits, broken down, crumpled up, and scattered around the cosmos, there's been a sense that Mario's makers have built outwards as far as they can go, only to hit their own invisible walls. Platform games in which there is often no platform to jump from. Platform games in which your most playful relationship involves exploring zany extremes of gravity, of inertia. What could follow that? Testify! After Galaxy came Galaxy 2, a straight sequel, which seemed like sacrilege, yet which turned out to be anything but straight (and was still comfortably sacrilegious). Galaxy 2 doubled down on the madness of the first Galaxy game to delirious effect. It dismantled the tangible universe around Mario until there was nothing left. Its last levels tend to be sparse in the extreme: the man who jumps is forced to explore a landscape in which jumping is no longer an option at all. Where next?And from the outer limits back to the toy store. In recent years 3D Land and 3D World retreated into luxurious gimmickry: scattershot playgrounds of plastic and felt in which ideas are squished together and then discarded. Forget the very concept of lands and of worlds, because these games offered Mario levels as a procession of capsule toys, dropping down the chute one after another, chunky and disposable and rattling with surprises. The only thing that never changed was that each one taught you something new - and you never noticed the lesson.This is the lineage Super Mario Maker belongs to. After construction, after demolition, after a mad fugue of sugary novelties, Nintendo is handing it all over. You know Mario? it asks. Have at him. Here he is in many of his forms. See what you can do with him.It is a beautiful level editor. A graph paper grid allows for precision placement of landscape and enemies, and you can switch between creating and playing more or less instantaneously. You need to as well, since nothing shows up bad game design like another human trying to work through it. Who knew! It turns out that debugging and iteration makes for one of the best multiplayer games in years: grueling and exhilarating and often maddening.You can switch between different styles, too - Super Mario 3, Super Mario World, Super Mario U - each of them updating Mario's moveset accordingly as he develops the ability to pick up Koopa shells, to wall-jump, and to pound through the ground. History takes flight as you start to understand how the man is the jump, and how the jump has evolved and slowly redrawn the boundaries of his world. Then you can switch between themes, and a certain ret-conning has been allowed for here. You can lay out a level's geometry in vanilla Super Mario Bros. 1, say, and then switch it to Ghost House Super Mario World, or even Ghost House Super Mario Bros. 1 - and the game will instantly accommodate you, even though there was no ghost house in Super Mario Bros. 1. It's fascinating to see the equivalences the game draws. Stick Yoshi back into the first game and he turns into a Goomba Shoe. I will never look at him quite the same way again.As the mention of Goomba Shoes suggests, there is range and complexity, but they are handled with an effortlessness that few other editors can allow for. Partly this is the clarity of Nintendo's thinking: the unfussiness of its UI and the thrifty brilliance of its feedback. If you want to make a Goomba fly - or if you want to make a coin, a block, a Bowser fly - you just drag wings from a menu and attach them, or pull them away to drop everything back down to the ground. Partly, though, the ease with which you'll settle in here is down to lineage, an unfair advantage that was probably born back in childhood - yours, not nintendo's.Simply put, the level editor gets away with complexity because if you're excited about Super Mario Maker then you probably already know how all this stuff works. Chuck a Koopa into a level, and you know what it's going to do when you switch from create to play mode. Same for Chain Chomps, Bob-Ombs, platforms that float, platforms that move on tracks. Because you know that Question Blocks frequently contain coins, you know that you can probably just drag coins onto the blocks in the level editor in order to load them. You know that some Question Blocks contain multiple coins, too, so if you drag more than one coin onto a block it will guess your intent and load it with a dozen or so. Super Mario Maker's clever in storing its clutter - you can swap between different hotbars of placeable items so as to free up screen space, while the icon for setting the level countdown timer also allows access to the scroll-speed options - but it gets away with hiding a lot of stuff from you because you already instinctively know how it will operate and can probably guess what you should do to make it happen.Super Mario Maker originally unlocked content over a nine day period, which was a rather ponderous way of handling things when the basic level editor is so elegant and self-explanatory. Since the game has been released, however, Nintendo's patched the nine-day wait out. Here's Darren Calvert from Nintendo Life to explain how the new version works.~Following feedback, Nintendo released version 1.01 patch on day one to remove some of the frustrations. Rather than waiting a day, you can now bring the delivery truck in in 15 minute intervals. Just lay down hundreds and thousands of blocks and be sure to use every new item and theme you are given to keep the deliveries running smoothly. You'll have all the course building items within around two hours rather than nine days if you keep laying down those blocks.~Nintendo's also made dozens of tiny Mario levels of its own, each one focusing on a single idea taken to its logical conclusion. You can play through these in groups of eight, tinkering with them and learning from them as you go, even if their elegance, their coherency, and their simplicity makes them hard targets to aim for. There are sample levels, too, which introduce the new elements you have to play with after every unlock. And then, of course, there are the levels everyone else is making. This is where Super Mario Maker gets really interesting, in fact. It's easy to upload levels, although you must first prove they can be completed, and it's easy to find other people's levels to play, either browsing popular, featured or recent levels or levels by highly-rated creators and any creators you're following. The best way to discover stuff, though, is by playing through random groups of levels in the 100 Mario Challenge.And it's when you dive into this that you'll really come to appreciate Nintendo's work over the last 30 years. There's a degree of curation in place, in that the lowest-rated levels will slowly be removed, and you can swipe your way out of the absolute stinkers if you're really struggling with them, but on test servers at least, there's already a lot of middling Mario to go around. And middling Mario is always something of a rarity.This is an issue with all user-generated content, of course, but its early post-release days, Super Mario Maker must also contend with the fact that the ease with which you can upload and share a level is almost matched by the ease of making them. I remember playing a lot of decent LittleBigPlanet levels, for example, and I think that happy outcome is probably related in part to the sheer flexibility of the tools, but in the main to the fact that I barely made any levels at all myself, because the complexity of the toolkit inadvertently kept people like me from completing on our awful plans and foisting them on everyone else. Here, though, I've suddenly found that Nintendo's got my back. I can publish and be damned. Super Mario Maker has lowered the barriers, and that's allowed me to unwittingly lower the quality bar for everyone.This is a tiny price to pay - and a familiar price to pay - for anything that allow this degree of creativity, though. And it's hardly all bad anyway: already there's lots of brilliant stuff poking through everywhere. Much of the very best is obviously born of a game which places so many possibilities within reach. Browsing the 100 Mario Challenge, day after day, I've seen so many ideas worth pinching: trampolines stuck on the other side of a flagpole so that Mario exits with a series of victory hops, stairs made of goombas, stairs made of trampolines, each one bouncing away until the end of time. There's a physics-driven rigour to Mario's world that allows you to clip its pieces together in strange but convincing ways. It's a fantasy land, but it makes sense. How much sense? It's no wonder that the best in the community are already making machines as much as levels, intricate Mario circuitry in which Koopas play the roles of electrons and ping along makeshift wires to hit Question Block gates and switches. Nintendo's even helping out at this altitude, painting in a quiet layer of orchestration as it times the jumps of enemies and scatters light across brickwork in step with the music. The core audience will do amazing things and the meta will evolve briskly, but I suspect Nintendo's editor will be able to keep up the pace.And even I have learned a little over the few weeks I've been tinkering. It's fun just to play with the bits and pieces here: I spent a happy afternoon tinkering with a cannon that fires squid, and another creating a maze that a warp pipe then pumped full of Goombas. I've learned that you can do so much to change a level just by slicing away at the time limit, and I've learned the alchemy that comes from watching players wrestling with something stupid you've done and using their intuition to fix it. I've sticker-bombed bad designs with sound effects and graphical effects until the whole thing has the wretched over-worked cheeriness of a Moonpig card, and I've at least approached an understanding that, on a basic level, so much of low-level game design is about herding players and making sure they can actually see the things they're meant to see in order to progress. One of the least likely beneficiaries of Super Mario Maker is second-rate developers, in fact, since the world will suddenly have a greater degree of empathy - a hard won understanding of the difficulty journey involved even when you're making something bad.Speaking of understanding, going online exposed a truth I had never really considered before. Namely, that it is not particularly difficult to make a Mario level that is extremely tough on the player, or to make one that leaves the designer feeling clever. The greater trick, however, and the same trick that Mario's own custodians are so elegant at reimagining, is to make a level that leaves the player feeling tested but triumphant - one in which the player, rather than the designer is having all the fun, and is left with a warm glow of achievement. There are some things that Super Mario Maker cannot do, in other words: it can teach most people to turn out a functional Mario level - and, yes, some are already creating truly ingenious levels - but it cannot lift most of us up to the heights at which Nintendo's own teams operate. Or, to put it in a language that Super Mario Maker truly appreciates, you can arrive at World 1-1 from memory, but it's much harder to arrive at it through the innate understanding of human impulses that constructed that famous invisible tutorial within its first few blocks: a game that could wordlessly tell you that some mushrooms are bad, but that some mushrooms are good, and that the world is there to be interacted with, and frequently demolished.And somewhere along the way, Super Mario Maker solved a 30 year old mystery. A mystery to me and my sister, anyway, although I'm more than willing to believe you cracked it ages ago. It's a mystery about World 1-2, that world in which we always asked: what's beyond the pipe? We never asked: why is Mario on rails? But now I understand - or at least I understand why I might have put him on rails if I was in charge. The whole thing's a tutorial, and a strangely graceless one for a Nintendo game. The start of World 1-2 is a message to the player that reads: Hey, you can go down pipes. Watch.By the time of Super Mario 3, Nintendo clearly trusted its players a lot more. It never forced you to watch anything: you were always playing. Mario 3 might start a level with a pipe, but rather than put you on rails it would just block off all other routes, safe in the knowledge that even if you didn't know how pipes worked around here, you would work it out sooner or later, and the lesson would stick because you had been in charge of the whole thought process. The start of World 1-2 is a failure then, the only truly bad moment I can think of in any Mario game - the only real moment that breaks the only real rule: the rule that states that Mario is all about the player's control. Super Mario Maker doesn't break that rule. If anything, it reinforces it. As it does so, it renders the old games fresh again and makes me understand for the first time how complex even their simplest parts truly are. And it makes me think - just for an awful second - the thrilling, impossible, almost blasphemous thought: that this could be a decent way to conclude things. We have been given the keys to the Mushroom Kingdom here, and so wouldn't it be strangely fitting if this is how the plumber chose to say goodbye?No. Instead, let's return to the question that always comes up when a Mario game is finished: Where next?"}