{"ref": "https://www.eurogamer.net/dragon-age-inquisition-trespasser-review", "date": "14 Sep 2015", "game_name": "Dragon Age: Inquisition", "text": "Endings are difficult - but then, BioWare already knows this. After the mess of Mass Effect 3, the developer played things safe with the finale of Dragon Age Inquisition. That guy you were trying to stop for pretty much the whole game? Well, you stopped him. There was a boss fight, you won, you got cheered home. Everything was tied up pretty neatly - except, of course, for that post-credits stinger.It's worth noting that while this review will avoid spoiling the major story beats of Trespasser itself, it would be impossible to talk about the add-on without discussing the main game's ending. Trespasser is a proper epilogue to Inquisition's story, BioWare's final send off to this chapter of the series' narrative, and you are required to have finished the main game's campaign in order to even begin the DLC.Trespasser picks up the story some two years after the main game's end. This gap in time allows for your followers to have found new places in Dragon Age's post-Corypheus world, and many of their roles will depend on the choices you made during Inquisition itself. Who takes on the role of the Pope-like Divine, for example, and who makes an appearance at all depends upon the characters that you chose to keep around in your own playthrough. The fact that Trespasser is separated from the main game time-wise (you have to agree to leave Skyhold behind and abandon any open quests when you are ready to start) allows BioWare to tell a story exploring the aftermath of its traditional 'save the world' ending trope, and to do so with plenty of narrative freedom. The final fate of many characters - as well as the Inquisition itself - is decided by your actions. And, in some cases, characters can get very definitive endings. BioWare has made no secret of the fact that Trespasser also - finally - includes the return of Solas, your strangely knowledgeable elf companion who left your party at the end of Inquisition. The game's post-credits scene revealed Solas' true identity to be the feared ancient god Fen'Harel, otherwise known as the Dread Wolf, who had been actually been following a secret and altogether fairly questionable agenda behind your back for the entire game. Fans have been waiting for more answers ever since, and their absence in previous add-ons (set during the main game) has been something of bugbear. Solas' presence in Trespasser is largely that of the agent behind its events, which see the Inquisition dealing with a surprise invasion by the horned Qunari. At the same time, the Inquisition must also attend a political summit designed to neuter or disband the organisation now it has served its original world-saving purpose. Two years is enough time that the gratitude of Dragon Age's world powers has now waned, to be replaced instead by suspicion and distrust. And while the Inquisition you founded was built on noble intentions, Trespasser forces you to consider the consequences of having an all-powerful organisation hanging around that could become manipulated and used for other means.Trespasser's final plot thread centres on the Inquisitor themselves, who has now lived with the magical power they were accidentally granted for some time. Sadly for them, it turns out that having huge amounts of magical energy implanted in your hand does not boost your life expectancy. This, and all of the other story threads, are woven together into a satisfying story seeped in Dragon Age lore. And, before it's all over, BioWare even manages to set up where the series could continue in the future.Moving the Inquisitor away from Skyhold means that you now have a temporary base of operations in the grounds of Orlais' Winter Palace, the site of the aforementioned political summit. It is here that you will return between story missions, and where all of your followers will be too so you can go catch up. Just like in Citadel, Mass Effect 3's final DLC, Trespasser treats fans to many new moments with the characters they have grown fond of. Each of your followers and advisors have new scenes with the Inquisitor, several fan-favourite minor characters return and - of course - you can continue to progress your Inquisitor's romance plotline, if that is your thing.The missions themselves see the Inquisitor negotiating the Escher-like world of the Crossroads, a mix of broken worlds first glimpsed in the main game through the mysterious  Eluvian mirror. There are plenty of Qunari to fight, several tough boss challenges to beat and a new armoury of weapons and gear to acquire. And, whether you buy Trespasser or not, BioWare has added a wardrobe of new clothes for wearing while off-duty, along with a handy method of saving gear for use in a fresh Inquisition playthrough - essentially unlocking a New Game Plus.Endings are difficult, but Trespasser shows that BioWare can get them right. The DLC is allowed to tell its own tale while better rounding off Inquisition's own, and at the same time set up story threads for the future. It acts as a fitting farewell to its cast of characters but also a prologue to where the Dragon Age world may head next. Following something as assured as Trespasser, the next Dragon Age game is now a much more enticing prospect."}