{"ref": "https://www.eurogamer.net/satellite-reign-review", "date": "4 Sep 2015", "game_name": "Satellite Reign", "text": "The future will be imperfect. All great science fiction shows this, from the ever-widening wealth disparities of Neal Stephenson, through the anthropological miscommunications of Ursula Le Guin to the consumerist, drug-addled dystopias of Philip K. Dick. Technology won't fix all our problems, change won't always be positive and progress is a subjective concept. Tomorrow won't be easy.Satellite Reign knows this. It also reflects this well. All too well. Its sodden, cyberpunk streets are tracked by world-weary citizens struggling to get by in a world controlled by corporations, patrolled by paramilitaries. Life is cheap, crime is common and one of those ever-growing causes of crime is you. With your four-person squad of hackers and assassins, you take on The Man, whether in the form of global banking or the military-industrial complex.In many ways it's beautiful in its vision. Neon depravity is a rare splash of colour across a greying world whose people cloak themselves in bizarre future fashions, while deadly drones patrol the streets. The first bars of music and the bleak cityscape  call to mind the influence of Ridley Scott's Blade Runner while, at first glance, Satellite Reign also invites many comparisons to Syndicate, Bullfrog's classic take on cyberpunk.Instead, the game is in many ways a mix of Grand Theft Auto and Metal Gear Solid. It tries to simulate a living city, bustling with people and traffic, criss-crossed by busy streets and forgotten alleyways, where stealth and patience often offer the greatest rewards. There are opportunities aplenty in this town, from banks that can be robbed to military bases that can be raided for prototypes. Either can be a subtle, secret success or can end with running gun battles through streets of terrified civilians. So much is forbidden, but so little is off limits.Not everything works, either, and that's not just because this is a vision of things so feared. There are times when this is a beautiful, exciting and satisfying game. There are also times when it very much is not.As it opens, Satellite Reign feels so sure of itself, so authoritative in its depiction of a failed future. Your agents sneak from cover to cover, ducking out of sight of cameras, hacking security terminals or silently assassinating guards. Technologies are stolen, research is funded and the four agents, each a distinct specialist, learn the first of a broad set of new abilities. The city itself also broadens, being unlocked, zone by zone, much like in GTA. It's an ever-growing playground for agents as they complete missions drip-fed by a plot that slowly, gradually teases more directions and more possibilities.It's not long before the first awkward gunfight happens. A camera catches movement or a patrol finds its prey. Agents can slip into cover at the click of a button, peeping out to exchange fire, but many of the game's early weapons are so lacking in lethality that these exchanges are slow battles of attrition, agents and their enemies emptying dozens of rounds into each other and health bars visibly ticking up between hits. Sure, early fights might want to be forgiving, but sometimes they're a slog, mundane rather than exciting. This can still be a problem as the game progresses, as later enhancements or skills can turn agents into even greater bullet sponges.Sometimes, a greater challenge comes from just trying to reign those agents in. Pathfinding problems plague both friends and enemies, who can struggle with the games gigantic security doors, with actually taking cover, even with seeing what's right next to them. Agents sneaking up behind their opponents to administer a quick and silent killing shot may disengage and suddenly walk away, while enemies can sometimes fail to spot agents even when surrounded in a firefight. Sometimes, leading your team has you controlling efficient agents with remarkable skills. Other times, they've decided that an appropriate response to their reality is going insane. It's like herding cats, but really stupid cats that you hate and wish had never existed.Even without these irregularities, things can and do go wrong for those who fight The Man, but death is not the end. Again, much like in GTA, the penalties for failure are relatively light. Satellite Reign depicts a world where cloning promises eternal life, meaning dead agents respawn after a short time at certain checkpoints and may even have a chance to return to and continue a fight. In time, the stats of clones gradually degrade, but it's a moment's work to hijack another human being and add new flesh to your collection, something that means your roster is always changing, but also that failure is less a thing of consequence and more a matter of wasted time.Change also comes from the gradual enhancement of agents, both in skills and bionics, though some of these are much more useful than others. Vital is the World Scan, which transforms everything into a glorious, wireframe wonderland within which everything can be analysed. Equally as valuable is the ability to cloak, or to hack more complex systems, but less exciting are skills that give minor boosts to health or damage dealt. This is a future where an ocular implant gives an almighty 7% accuracy boost.In time, it becomes apparent that this slick and shiny vision can be as shallow as its puddles. While the game's city is certainly alive, there's not a great deal that happens there. The many cameras and security checkpoints can be hacked or sometimes outright sabotaged but, ultimately, the manipulation of most devices serves only to turn them off for a short while, nothing more. Similarly, while the city may seem open and inviting, full of missions to try, it's usually best to follow the specific directions of the plot as it unfolds for a smooth and less stressful experience. The inconsistency of the AI can make some outlying missions either ridiculously easy or incredibly hard.But success in this cynical cityscape is still a fine thing. Guard patrols are irregular, often feeling organic and much less regimented than in many other stealth games, so executing a well-timed dash , disabling a series of cameras in the nick of time or combining agent abilities in just the right way is tense and exciting. Even when things go sour and the big guns come out, flanking and clever use of cover can beat the odds.Then another excursion is the complete opposite. A clumsy agent misbehaves and a camera alerts guards, who alert more guards, who spawn in a never-ending stream of goons. Or who don't, because it turned out that what should be a suicidal last dash through massed enemy ranks caused them all scuttle off and search somewhere else, in an act of comedic, slapstick incompetence.Satellite Reign also has a few other tiny but quite irritating aspects which, like persistent itches, never cease to niggle. The isometric perspective, while giving many fine views of its damp dystopia, can also make judging lines of sight difficult. Sometimes the mini-map shows enemy units that aren't really there. Certain pulsing sound effects can be mind-numbing. Then there's the dashing.When time is of the essence, agents can dash, yet their stamina will only last for the time it takes to cross a street or two. Bizarrely, this same stamina also powers many of their other abilities, making running a sometimes fatal decision, even when teams of guards are merrily charging forward. It gives the impression that agents are more arthritic than they are athletic. Sure, like most things in the game, this stamina can be boosted, but not by a great deal. And occasionally, when told to dash, agents will hesitate like rabbits in headlights.Perhaps the game's biggest problem is that new missions nevertheless feel routine, particularly when they send you back to the same locations. There's another hack to open another gate or disable a camera, a few more dashes in the dark and a short two-dimensional maze to navigate, all often made or broken by inconsistent AI. A few times I simply left the game running to build up funds from hacked cash machines, bribing my way past some missions rather than once again raiding a facility I'd already entered three times.Satellite Reign is attractive and stylish, but it's not as smart as it first looks, sporting a glorious sheen that gradually fades. It's also one of the most frustratingly inconsistent games that I have played in a long time. It can be interesting, it can be exciting, but it's not quite enough. It's certainly not the future I want, nor a present that I particularly enjoy."}