{"ref": "https://www.eurogamer.net/devils-third-review-0", "date": "27 Aug 2015", "game_name": "Devil's Third", "text": "A game can be a mediocrity but, when it is developed by talent, that can seem like tragedy. The history of Devil's Third always suggested a difficult project, the most painful stats being six years and three different engines. The debut of Valhalla Game Studios, founded in 2009 by Tomonobu Itagaki and other members of Team Ninja, has been so delayed it may well double as a wake. Devil's Third is an ambitious concept, aiming to blend third-person melee combat and movement with regular transitions to first-person shooting. This combination is not unheard of, but because third-person and first-person combat design are such distinct beasts it almost never works. It is a tantalising goal, however, and Devil's Third won't be the last to grasp in this direction. Grasping is all it really manages. The switch between the standard third-person setup into first-person eschews flashiness in favour of a near-instant lurch, a discordance only emphasised by the incredibly low-resolution textures you often end up facing. This is just the tip of the iceberg.Shooting is the most unrefined aspect of Devil's Third's combat, which is bizarre given its importance. The default horizontal/vertical sensitivities are absolutely hopeless, so you dial them up a bit until they're more comfortable. Then you're hit with an enormous deadzone that makes precision aiming of weapons like sniper rifles almost impossible. The first-person side of Devil's Third feels like a botch-job which the player has to try and fix. Even when you've wrangled something acceptable out of the options menu, even when you're able to aim in the right general direction, Devil's Third is a bad shooting game. The enemies run out, take up fixed positions (with heads and limbs clearly visible and poppable even when they're in cover), and then unleash withering hails of fire in the player's direction. As your shots hammer home, with not-unimpressive impact SFX, enemies simply absorb them until their health expires and then explode in various amusingly-detailed ways.What's bizarre is that the third-person side of Devil's Third is almost good, and could have gone a long way to making this a more enjoyable game, but over the nine sizeable levels the player is constantly forced into first-person. I'd hazard that Vanquish made a big impression on Itagaki, because the pace of third-person and the basic movement capabilities suggest that Devil's Third is looking to create a similar kind of 'anti' cover shooter: one where you can move smoothly from firing in cover to launching a melee assault some distance away. But the rhythm of Vanquish is never captured here, because the incoming fire in later levels is so withering that it's nearly impossible to close with large groups - even charging at two or three is risking death. So you have to whittle large groups down in the bad first-person mode, before picking off the stragglers. It didn't have to be like this - certain arenas are built with routes that allow the player to close distance, but most are just empty space and boxes. This is so annoying because the melee combat is the only redeeming feature in Devil's Third, though it never threatens to be worthy of the Ninja Gaiden heritage. Itagaki's principles for combat design are simple controls and complex possibilities - the supremely capable Ryu Hayabusa has two attack buttons, a projectile, a jump, a guard, and everything else is timing and context. In Ninja Gaiden this led to a gorgeously intricate and complex move-set that, to experienced players, comes to operate at close to the speed of thought. The same basics apply to Ivan, the bemuscled star of Devil's Third, who has a light and heavy attack, a jump, and a guard. At the start of the game the player acquires a bent pipe, which is soon followed by machetes, swords, sledgehammers, and various other hardware - the idea being that each weapon has different move-sets. But Ivan is no Ryu Hayabusa, not even close. His animation strings are much shorter, with most enemies killed in two hits, and the combos peter out rather limply against enemies that can take more punishment. Ninja Gaiden 2's instant kill attacks, a brilliant system whereby enemies missing a limb could be finished swiftly, has a misshapen heir in Ivan's cavalcade of context-sensitive finishers that eviscerate foes while the camera spams around at 'cinematic' angles (cheers for that one, Rocksteady.) What's missing is not so much complexity as precision. Ivan homes in on enemies, meaning you often attack in unexpected directions, and the majority can be taken out by simple mashing. So what fluidity there is in the short combos is constantly cut short by execution moves and, outside of certain bosses, sustained combat simply isn't possible.The tougher melee foes can block, and even get in the odd shot, but simple dodges leave them wide open - some have unblockable attacks that punish mashing, but they're rarely-used. In addition to this Devil's Third has a recharging health system, which is fairly fast, and a good fit for the shooting sections but far too easy to exploit in melee combat - if you're close to death just dodging for a few seconds sees Ivan back to full health.Despite all this the melee side of Devil's Third is where the gratification is - barrelling into a group of baddies and smashing them around is good clean fun. The bosses, who can go toe-to-toe with Ivan for longer spells, hint at a better game lost somewhere - an extended fight against Grundla Saha, who ruthlessly punishes Ivan for using guns, is the first time the player has to fight with any subtlety, and is all the better for it. And yet even here the seams show. This boss has a dropkick attack where the hitbox extends to behind his head - so you can dodge the attack perfectly, and end up nearly dying because of it. Hitboxes like that speak to a sloppiness of approach, as well as a troubled development. Which is no consolation to the player who has to tolerate it. As you progress it becomes clear that Devil's Third is a game where the ambition far exceeded what was realistic, with set-piece after set-piece piling on, most of which have bespoke control schemes and challenges, and almost none of which are any good. There is just no understanding here that the first and most important part of making a good shooter game is getting the controls right, and so everything Devil's Third layers atop them is built on quicksand.That includes the multiplayer side, which otherwise might have had a chance of redeeming the package. It features a surprising amount of structural depth, including an overarching 'clan' theme that lets you customise a base to defend in the main Siege mode, alongside an equipment economy that lets the player choose the unlocks. Even the more standard modes are creative, including deathmatch staples next to chicken-chasing and propaganda bombs. Multiplayer is by far the best part of Devil's Third because, despite all the flaws, it's so much more enjoyable to use this system against enemies that fight intelligently. Here's where you can catch glimpses of what the game should be creating all the time: a three-man brawl mowed down by a sneaky gunner, a sniper's head sliced off in a sweeping parkour run, an escape flipping into an ambush. Part of this is that other players have to use the same clunky controls you do, and so it's fairly easy to dash around unpunished - often into melee range. The brutal move-sets make much more sense here, and the finishing moves are removed completely so you never lose control of the character. Any close encounter also has a delicious urgency to it - because you know that brawling players are sitting ducks. The fact that this mode is so fully-featured and thought-through makes it rather a melancholy achievement. Multiplayer is the best part of this game by a long way but, like the rest, is undone by the shooting controls and technical blemishes. The effort behind the structure is all-too-clear, but an online community can't be sustained by a core experience as shoddy as Devil's Third offers. And I mean shoddy. Devil's Third has unimpressive visuals, which would be fine if detail had been sacrificed for solid performance, but this is a constant frame-dropper in outdoor areas and anywhere with a lot of explosions. The clipping is terrible too, which is especially obvious during the execution moves. Beyond this it gets more amusing: sometimes an enemy model's position is off during finishers, and you watch Ivan brutally beating thin air while a guy convulses a few metres away. Even with such technical problems Devil's Third is hard to hate. This is mainly because it clearly aims to be a gaming B-movie (Ivan is basically Vin Diesel) as well as something of a tribute to the simpler action titles of days gone by. Here's a typical cutscene after exploding a boss. This lack of pretension serves Devil's Third well, and almost makes its comic pile-up of goons and set-pieces bearable. But there is no mistaking what you're playing, and that is a bad game. Devil's Third comes from creators of pedigree. The Itagaki-directed Ninja Gaidens are the only third-person combat games that can go toe-to-toe with the best of Capcom and Platinum Games, offering something different but equally intense and rewarding. They are, if you're a fan of the genre, milestone titles. Despite a decent stab at multiplayer, however, Devil's Third isn't even average. The game represents at least six years of development, but over that time the concept has been mangled. It is no accident that Tecmo's Team Ninja hasn't managed a good game since the 2008 departure of Itagaki and others. But Devil's Third makes you wonder where the talent went."}