{"ref": "https://www.eurogamer.net/sinclair-zx-spectrum-vega-review", "date": "21 Aug 2015", "game_name": "Reviews", "text": "Back in 2012, when retro gamers were celebrating the 30th anniversary of the Sinclair ZX Spectrum, if you'd told me that just three years later we'd be seeing not one but two new hardware launches claiming to carry on the Speccy name, I wouldn't have believed you.Yet here we are. I'm holding a Sinclair ZX Spectrum Vega, the crowdfunded plug-and-play gaming device produced with the involvement of Sir Clive Sinclair himself. Even the box, with its black cardboard sleeve and rainbow corner flash, has been designed to mimic that of the original 48k home computer. I can feel the nostalgia juices rising, but also a wave of scepticism. Is this a genuine new Sinclair product, or a cleverly packaged emulator, ruthlessly designed to tweak my middle-aged yearning?Inside is the Vega itself. It's important to note that the Vega is a handheld device, and has nothing to do with the Recreated ZX Spectrum Bluetooth keyboard from Elite Systems, which also launches in a few weeks. With two ~new~ Spectrum products competing for attention, it seems many are confused as to which is which - or even if they're the same thing.The Vega is a small, flat rectangular controller, not a full keyboard. It's about the size of a four-finger Kit Kat, should you want a scientific measurement. Modelled to look a bit like the iconic 48k Spectrum, it has directional buttons to the left, and a variety of inputs to the right. These, too, are modelled after the famous rubber keys, right down to the markings. F is for FIRE, S is for SELECT, and everything else, confusingly, is basically meaningless in this context.The main four buttons are positioned rather strangely, in a 2x2 square pattern rather than the more traditional diamond layout used by most joypad controllers. Beneath those buttons are four tiny buttons marked A, B, C and M. The first three are used to expand the input options for games with more complex controls, the M button calls up a menu, for use in-game, from where you can save your progress in a snapshot style, and also access the virtual keyboard.This option was a late addition to the Vega design, brought about by fans who were disappointed at the use of a console joypad design for a computer which was always either joystick or keyboard based. In particular, those who wanted to replay the Speccy's vast archive of text adventures felt the four button system essentially made a huge swathe of the platform's best titles unplayable on the Vega.It's not a virtual keyboard in the traditional sense, where you guide a cursor to each key. Instead, the alphabet - and numerals and symbols - are all segmented into chunks. You flip between these with the d-pad, with letters mapped to the four main input buttons. It's a clever solution, and quite slick once you've got used to it. It's still fairly laborious though, and entering strings of words for an adventure is still a grind. Some sort of predictive text option would have been nice, especially given how many adventure games use the same core parser: GET, LOOK, USE and so on.As an actual piece of hardware, the Vega does not impress. It's light and feels cheap. The input buttons are stiff, and the odd button placement does it no favours in games that require more than just moving, jumping and shooting. More troubling is how many corners have clearly been cut. Two long and rather ugly wires trail from the Vega. One is a standard AV input which plugs directly into the basic Video In and left/right audio sockets on your TV. There's no HDMI, and if you even want to run it through SCART, you'll need to supply your own connector.This is also true of the power, since your only option out of the box is a USB cable. The idea is that this plugs into the USB socket on your TV - assuming your TV has one - or else you'll need to borrow a phone charger or find some other USB port to draw power from. The absence of even a simple plug really makes this feel like a bargain basement offering. This wouldn't be too much of a problem if the Vega retailed for around thirty quid, like other plug-and-play TV game devices, but when the asking price is £100 requiring the customer to dig around for spare parts is very cheeky.This cost-cutting impacts the performance of the device itself. Most TV USB sockets aren't designed as power outlets, so the Vega can struggle to draw enough juice from them, resulting in distorted output. Even when attached to a reliable power source, the image quality on a modern flatscreen leaves a lot to be desired. Fuzziness and flickers are common, while the main menu screen - as stark and basic as the device itself - suffers from subtle ghosting when run through a modern flatscreen. Your best bet, ironically, is to plug it into an old CRT telly, if you still have one.While it may not impress much at a technical level, the Vega at least compensates in terms of sheer volume of content. ~One thousand pre-loaded classic games~ boasts the box, and while the number of bona fide classics in that number is inevitably small in reality, there are some genuine greats included. Horace Goes Skiing, Wheelie and the double whammy of Skool Daze and Back to Skool are highlights - though the latter two, with their complex control systems, suffer for the Vega's crude inputs. More impressively, the early Ultimate Play The Game titles are included, after being refused distribution for decades. Admittedly, it's somewhat less exciting given how many of them also appear - in a more attractive form - in the Rare Replay compilation, but it's still a big tick in the plus column for Speccy fans.The Spectrum always suffered from a surplus of chaff, so the amount of filler shouldn't come as too much of a disappointment. It maybe would have done the Vega more favours to aim lower than 1,000 games and get the quality to quantity ratio more balanced, but most will be buying the device for their own emulation needs, not for the pre-loaded selection. A Micro SD Card slot on the underside allows for Spectrum games downloaded from sites such as World of Spectrum to be played on the device, and also enables firmware updates in the future.Adding new games is simple and painless. Just load the files on a card, stick it in the slot and the Vega automatically offers up a separate menu with all the titles, sorted into alphabetical order for your convenience. The only downside is that any titles you add yourself won't have control schemes already stored on the device, so you'll need to define them yourself if the game allows key bindings to be changed. The default inputs map to those of an old Kempston joystick, so selecting that option also works for most games.As a basic functional emulator, the Vega does what it needs to do, though a little more finesse certainly wouldn't have gone amiss. The main problem is the combination of the unambitious build coupled with the steep price. £100 can get you a brand new last generation console, so to be charged that much for a retro device with a single low quality video output and no wall plug is a pretty big ask for the casual fan looking for an impulsive nostalgia fix. At the same time, more dedicated fans of the Spectrum can spend the same money and get a Raspberry Pi for each member of the family or a refurbished original Spectrum with all its leads, a tape recorder and a healthy selection of games on original cassettes.Yet I can't deny that the idea of having the ZX Spectrum as a commercial entity in 2015 is enticing, and bringing it back as a handheld that plugs straight into the TV and offers instant access to beloved games is a compelling notion, even if it flies in the face of the ~let's get coding~ ethos of the original computer. The Vega comes frustratingly close to delivering something special, and at a third of the price it would make perfect sense. In its current form, however, it is simply too expensive in cost and too cheap in design to really justify its existence."}