{"ref": "https://www.eurogamer.net/dragon-age-inquisition-the-descent-review", "date": "14 Aug 2015", "game_name": "Dragon Age: Inquisition", "text": "So, dwarves. Dragon Age's subterranean dwellers were largely absent from Inquisition's main storyline - which sort of makes sense, since it was about fixing a big old crack in the sky. Instead, the underground race are centre stage in The Descent, BioWare's new DLC that is comprosed entirely of a sprawling six-floor dungeon, designed to appeal to and tax even the hardiest of Dragon Age players. Where Jaws of Hakkon, Inquisition's first story add-on, focused on a large and varied new area that housed multiple story threads, The Descent narrows BioWare's focus to a single destination and story goal. Something or someone is causing huge earthquakes in the ancient dwarven network of Deep Roads and unleashing hordes of Darkspawn in the process - hordes which someone needs to go squash. Your job is to be that person, investigate the quakes and eventually beat up whatever horrible demon is causing them.And so, for the first half of the DLC at least, that's what you do. Your Inquisitor teams up with two new characters, plucky stone shaper Valta and gruff Legion of the Dead commander Lieutenant Renn, who guide you and bicker with each other as your party ventures ever deeper underground. If the gruff tones of Renn sound familiar, that's because the character is voiced by Metal Gear veteran David Hayter, barely concealing his gravelly drawl as Snake. Your regular followers are also along for the ride in a backseat role - they will occasionally chip in with their own dialogue during a couple of key scenes, but you get the feeling this was recorded back alongside Hakkon to ensure they didn't stay entirely silent.Dragon Age aficionados will appreciate a long-awaited return to the Deep Roads setting and the reappearance of many, many Darkspawn enemies from previous games. Expect to battle never-ending amounts of genlocks, hurlocks, shrieks, emissaries and ogres, all of which will repeatedly punch you off cliffs into the abyss. The Descent is the first DLC to leave behind the game's PlayStation 3 and Xbox 360 versions, and it feels like the enemy count has been upped as a result. This is a good a place as any to note that The Descent has been designed to fit into your Dragon Age playthrough at pretty much any point (its questline can be activated any time after reaching Skyhold). Make your way through its dungeon at a lower level and you will find that floors slowly ramp up in difficulty as you progress. In this scenario, BioWare expects you to tackle the content slowly over the course of your playthrough, returning to continue the DLC's story whenever you find you are strong enough. But as will likely be the case for the majority of players, I explored The Descent via a post-game save and at a very high level. In this scenario, enemies were scaled up to the strength of my all-powerful Inquisitor from start to finish. The rest of my party also began a level lower, so fights were often a slog until my followers had levelled up too. Because of this, it is difficult to put a firm number on how long the DLC lasts, since it may depend wildly on your play style, difficulty setting and starting level. For me, the sheer number of enemies with huge amounts of health meant that I had to drop the difficulty down to progress in any kind of timely manner. As it was, a certain fight that marked the DLC's mid-point probably added at least an hour to my playtime alone. On the upside, dealing with ogres who can grab and hold your party members, dodging some seriously powerful ranged snipers and doing all of this while negotiating tight surroundings and perilous drops was all a welcome challenge. On the downside, there were only so many times that I could be ambushed in the Deep Roads' rather drab and repetitive surroundings before fatigue began to set in.Which is why, after that mid-point battle, it was a welcome surprise to see the DLC head down a rather different path. BioWare has kept The Descent's second act entirely under wraps - and I won't spoil it here - but it's fair to say that while you continue to explore the dungeon further, everything has an entirely different feel from then on out. What follows leads to some major lore additions for the Dragon Age universe, the implications of which are already being chewed over on the Dragon Age Reddit and forums. BioWare has previously used DLC to set up story threads for the series' future, and it will be intriguing to see what - if anything - from The Descent is expanded upon further.After the main plotline concludes there is still more to do. A version of the Inquisition's war table is available for the Deep Roads so you to send out scouts and spend Power on expanding the dungeon even further, unlocking new routes and rooms full of high level loot and rewards. There are, thankfully, no more shards to collect, but there are a number of other items to track down that will add to the amount of lore you can unlock. Back when I reviewed Hakkon I remember concluding that it was a memorable if not essential extra journey into the rich world of Dragon Age: Inquisition, and on finishing The Descent I am left feeling much the same. Series fans will enjoy revisiting some of the franchise's origins and likely also enjoy airing their views on the latest major lore additions. For more casual Inquisition players (and those still wandering around in The Witcher 3), The Descent is probably a more considered purchase. For me, it was a worthwhile distraction while I wait for the third (and likely final) Inquisition campaign add-on, which is expected to round off Inquisition for good and finally provide answers to the main story's epilogue."}