{"name": "Assassins Creed III Remastered", "ref": "https://gaming-age.com/2019/10/assassins-creed-iii-remastered-review-for-nintendo-switch-ps4-xbox-one/", "text": "You know, as long ago as 2012 seems  for a refresher, Obama was still in his first term, Gangnam Style was a massive hit, and some people lost their minds over the Mayan calendar  Assassins Creed III Remastered may just be the thing that really drives home for me how long ago it was.It just feels old. And bloated, and creaky, and all kinds of other adjectives that explain why a game that was received so well on its initial release has clearly not aged that well in the eyes of many people.Its not that Assassins Creed III Remastered is bad, necessarily. Its got everything youd expect from an early-ish Assassins Creed, right down to the framing story with Desmond Miles. Its just that theres so, so much of it. You spend hours and hours playing through the preamble, before the game even fully opens up, which makes it feel like the game is spending forever holding your hand and teaching you mechanics that are all pretty familiar by now. While a lot of it may have felt somewhat fresh seven years ago (did it, though?), it definitely doesnt today.Which, in turn, means the game lives and dies by its story  and, again, even if it all felt like a neat little bow on Miles story arc at the time, you have to go through a lot of unnecessary chaff to get there in the first place. Obviously, your mileage will vary with that if you were deeply invested in a plot from nearly a decade ago, but as someone who played the AC games but was never a diehard fan, it all feels like a lot of fluff. Like, you could probably have gotten an entire game out of the exploits of Haytham Kenway, but here it just serves as a very heavy appetizer for an even heavier main course.That said, the game mostly runs okay, even when youre just playing in handheld mode. I wouldnt say that Assassins Creed III Remastered is going to be the best-looking game youve ever seen or anything, but it does the job. Youll have to deal with the occasional hiccup here and there  the horizon suddenly popping onto the screen, or slowdown when the game is saving  but, for the most part, youre getting what youd expect from a massive open-world game. From that perspective, it worked well enough.Personally, though, it felt like the bonus game here, Assassins Creed III: Liberation worked much better. And, I mean, it should: the game was originally designed for the Vita, and its smaller scale works in its favour here. Neither the plot nor the world feel overstuffed, and you arent forced to sit through hour after hour of introduction before you get to the main story. Theres a bit of it, sure, but nowhere near to the same extent as in ACIII. Maybe its just my natural inclination towards all things Vita, but where I found the main Assassins Creed game in this double-pack to be a bit of a slog, Liberation felt like a nice return to a game I enjoyed years ago.", "date": "October 19, 2019", "grade": "B"}