{"name": "Style Savvy: Fashion Forward", "ref": "https://gaming-age.com/2016/09/style-savvy-fashion-forward-review-nintendo-3ds/", "text": "Without having played the first Style Savvy game, Fashion Forward was my introduction to the series.  Im not the most fashionable person myself, but knowing that games like The Sims and Animal Crossing have taken hold of me, it felt like a safe bet that a lifestyle sim might be up my alley.  Or down it, across the street, and around the corner at the hip new boutique in town.Honestly, Im not sure where to start with Style Savvy: Fashion Forward.  Lets just go with the beginning, where in the game youre transported to the world of Beaumonde  City  a mecca of style.Players are quickly ushered into the role of Boutique Management by Sophie, who gives brief instructions on how to find and suggest clothes for customers, then hands over the keys to the shop on The Avenue  aka Main St.  Within moments, the game gets players into the swing of things  mingling with potential customers to drum up business, and then conduct sales within the store.Selling clothes is actually an easy task.  Customers tend to have requests that arent too complicated, and a sorting feature allows players to avoid any confusion in their recommendations by filtering for keywords, types, and brand (among other things).  Find Yolande a striped inner?  No problem, sort by stripes and pick an inner layer thats within her budget.  Probably colorful, she seems to have a lively thing going on.This isnt a slight at Style Savvy, as it quickly becomes apparent that the game isnt trying to test players mettle in negotiation  but rather let them enjoy an incredibly laid back lifestyle sim.  If we want to get gameplay basic, its groundwork is an inventory management simulator, but thats oversimplifying a game that smartly prefers charm to challenge.  And anyway, isnt managing inventory a large part of running a boutique?Its not all work and no play, however, as Beaumonde City is broken up into areas for players to explore.  Navigating is a breeze, as players can visit subsections of the city (such as The Avenue) with locales ranging from leisure to lifestyle.  This is also where story beats will play out, characters will be introduced, and various activities will appear for players to take part in.Early on, for instance, players meet Callum, a fellow standing outside a cafe.  Hes excited about some new coffee beans hes roasted, and invites players to have a cup.  An intermittent scene plays as our avatar enjoys her drink, and then bids Callum farewell.  Talking to characters on the street will later reveal they admire that Callum has been looking after a dog he found in the park nearby, a location where players can also visit Holly, a girl who specializes in herbal teas.Small interactions and scenes accumulate nicely in a way that gives the city a sense of character beyond calling it stylish.  Characters seem to know of and interact with each other in a way that eases players into new mechanics and opportunities (such as styling hair) with a sense of progression in both gameplay and also story.Its this extra step that puts Style Savvy: Fashion Forward above other casual sims.  Even those with light story elements dont seem to be as coherent as Fashion Forward.  This is really appreciated, and probably goes a long way to holding players attention beyond the loop of selling clothes and restocking your shop.In fact, shopkeeping is just scratching the surface of Fashion Forwards activities.  Aside from the aforementioned hair styling, theres fashion design, makeup, and modeling, but one of my favorite distractions was the Dollhouse.  Given simple rooms and furniture, players can decorate rooms in a miniature dollhouse which represents a larger one in town which rooms can be rented out.  I really enjoyed collecting furniture and featuring it, mostly due to the diorama look of the dollhouse.Ironically, I didnt care for Animal Crossing: Happy Home Designer, but it suffered a lack of variety which is not the case with Fashion Forward.  Rather, redecorating was a necessary distraction to displaying styles on customers, and became a highlight in this game.  Although it is fun being fashionable.I wish there was more to do in the apartment than change clothes, but that could have to do with wanting more to do in the town generally.  I love the art style of Fashion Forward, or at least the European look of it.  Everything is so cozy that I yearned for more leisure activity or vignettes.  In my mind, there are clear ways that Style Savvy can still grow, such as giving locations to relax, maybe allowing the player to choose between reading, taking a nap, having a bite to eat, and following it with some sort of charisma bonus when working in the boutique or other discipline.The opportunities that feel missed to me may not even occur to Fashion Forwards target audience, however, as theres enough here to keep casual players engaged for a good while.  Its systems are basic, yes, but they are also consistent and reliable.", "date": "September 13, 2016", "grade": "B+"}