{"name": "Hue", "ref": "https://gaming-age.com/2016/09/hue-review-ps4-xbox-one-pc/", "text": "Its such a great feeling to discover a game you knew nothing about and simply fall in love with it once you give it a chance. This doesnt happen often in todays world of gaming. Hue, a narrative puzzle game from developer Fiddlesticks took me by surprise and Im glad it did. I just happened to be checking out the PSN store for the new releases because sometimes indie titles come out that I may not get press releases for. This was the case with Hue.At first glance, it looked to take inspiration from several games in the genre that I happened to love. Games like Braid, Limbo, Teslagrad, and Inside. I watched the trailer and knew I needed to play it. The moment I started the game, I hear the start screen music, which was a piano piece that sounded like it was inspired by Kingdom Hearts theme Dearly Beloved which is a piece that is very near and dear to my heart. So far Hue had successfully won me over by the visuals and the score.Now it was time to play the game. You begin controlling the main character Hue, walking down a simple path with everything in black and white. Then you are treated to some narrative from your mother explaining the world and essentially the premise of the game. The puzzle mechanic is so simple yet one of the most innovative in 2016. You gain the ability to add color to the background which changes items in the world and helps you make your way through each of the complex levels.One thing that makes the game work so well is how a simple design can be done in such a unique and memorable way. I found myself highly impressed by the different challenges the later puzzles gave me. My readers know Im not a patient person and get easily frustrated when playing difficult games. When playing Hue, I found the progression extremely rewarding and when I died, it made me want to just get better.Its not always a positive experience when you play a game that has taken inspiration from so many different games, yet Fiddlesticks found a way to marry everything in a fantastic original experience. There is even a bit of Metroidvania influence in there because you have many locations early on with obstacles utilizing colors I still havent found. Fiddlestick did one other thing that I thought was awesome.", "date": "September 9, 2016", "grade": "A"}