{"name": "Bears Cant Drift!?", "ref": "https://gaming-age.com/2016/09/bears-cant-drift-review-ps4/", "text": "Squint your eyes and tilt your head at just the right angle when looking at Bears Cant Drift!?, and youll be able to see the makings of a decent kart racer. The titular bears control their karts pretty well. The tracks are varied, and exist in vibrant, colourful, and, most importantly, diverse worlds. It has the usual modes any kart racer needs to succeed (race, obviously, and time trials), plus one to set it apart (a neat spin on combat that asks you to pick up as much food as possible). On the whole, its not devoid of charm.Unfortunately, look at Bears Cant Drift!? straight on, and its problems become a little more apparent. Take those bears, for example: while theyre undeniably cute, they have zero personality. Your bear, in particular, is a plain brown bear, and it gets kind of dull after awhile to see the same brown blob in the middle of the screen the whole game. This lack of personality extends to the karts as well. Like the bears, they have zero distinguishing features, and theres no option to customize them or give them anything in the way of a personality.Or, at least, I dont think there is. See, one of Bears Cant Drift!?s lesser faults is that it does a really lousy job of explaining itself. If youre ever played any kind of racer before  kart or otherwise  youll be able to figure out the basics, but once you get beyond that, youre on your own. I still have no idea what one of the power-ups does, for example; I know that picking up a gecko-type creature makes swirls appear around your kart, but I have no idea what theyre doing. Likewise, while your bear can drift, it feels like theres more to it than meets the eye: drift for any extended length of time and youll start to kick up red (then blue) sparksbut despite my best efforts, I still havent figured out why those sparks appear.Even worse, I cant figure out how to change the difficulty. I know there are three different entrances featuring bears of differing friendliness that I suspect correlate to Easy/Medium/Hard, but the Easy and Medium entrances both ultimately lead to the same place, while the Hard entrance doesnt seem to lead anywhere. On a similar note, you earn stars for winning races, except for the life of me I cant tell how those stars correlate to your performance.Bears Cant Draft!? gets most confusing, though, when it comes to its tracks. Yes, the good news is that theyre colourful and theyre varied. The thing is, theyre also very long, and dont come with any minimaps that help you figure out where you are in relation to the courses themselves or the other racers. Considering that some tracks take several minutes per lap and dont have much in the way of signage  they dont even let you know when youre going backwards, in fact  and you can see why they can occasionally feel a little frustrating.Having said all that, I dont think Bears Cant Drift!? is hopelessly irredeemable. It has more than its share of flaws, to be sure, but pretty much all of those flaws are things that, hopefully, can be fixed with a few patches. Moreover, once those patches are implemented, as I said, I can see the game turning into a pretty decent kart racer.", "date": "September 9, 2016", "grade": "C-"}