{"name": "OlliOlli: Switch Stance", "ref": "https://gaming-age.com/2019/08/olliolli-switch-stance-review-for-nintendo-switch/", "text": "OlliOlli: Switch Stance comes at a nice time for me. After all, as much as I loved both OlliOlli and its sequel back when they first came out, Id be lying if I said that Id given either of them much thought at any point in the past several years. Getting a chance to play them again (albeit on a different system) offers a good chance to see whether they live up to my very fond memories.Unsurprisingly, they do. I remember them both as being fairly challenging, super-addictive endless skating games (which is to say, like an endless runner, but on a skateboard), andwell, thats exactly what they are. Both OlliOlli and OlliOlli 2 are the kinds of games that are easy enough to pick up, but that require some impressive thumb dexterity if you want to master them at any kind of higher level. That was true when they first released, and its just as true now that the games are on the Switch.That said  and as a long-term resident of Vita Island, it pains me to admit this  the game works much better with even the slightly larger thumbsticks the Switch offers. I never played the game after it got ported from the Vita to pretty much every other platform under the sun, so you can understand my surprise to learn that all the moves are significantly easier to pull off when youve got a larger controller to work with. It doesnt make the game a breeze or anything, but it does mean that the game doesnt feel nearly as impossible as it did when I last played it. (I imagine everyone who played the game on PS4, PS3, and Xbox One already knew this.)Of course, as great as OlliOlli: Switch Stance is, because its already been ported everywhere else, theres the question of whether its worth checking out again now, a couple of years after the fact. And on the one hand, its hard to say that the answer to that question is yes. Theres nothing new about this version, so if you had your fill of OlliOlli and OlliOlli 2 when they first came out, theres nothing here thats going to bring you back in.On the other hand, though, both of those games were top-notch when they were originally released, and that describes them just as well today. OlliOlli: Switch Stance isnt going to make you rethink anything you thought about them first time around  but if you thought they were great games back then, this package will serve as a nice reminder that theyre every bit as good as you may remember.", "date": "August 15, 2019", "grade": "A-"}