{"name": "Resident Evil 4", "ref": "https://gaming-age.com/2016/09/resident-evil-4-review-ps4-xbox-one/", "text": "Resident Evil 4 takes me back to a time when getting pumped for the new Capcom titles still happened. Its also easily one of the top three favorite games in the series by many, including myself. I think Ive purchased every single release with the exception of the Zeebo release.So why revisit the game again? I think to see if it stands the test of time with all that has changed, especially with Resident Evil games. RE4 was first released in 2005 as an exclusive on the Nintendo Gamecube. It introduced the first real evolution to the controls and removal of traditional zombies. Change like this isnt usually a welcome one, especially with popular franchises like RE.However, Capcom outdid themselves and created a game that changed the series in several fundamental ways. So how does it fair in todays world with games like Evil Within, and sadly Resident Evil 6? Again, keep in mind this is a re-release and not an HD remake of any kind. There isnt anything new, just some higher resolution character models and textures. With that said, at first I wasnt enjoying the first 30 minutes or so because I was trying to get re-familiar with the controls.Then I realized the control scheme is defaulted to a more modern layout with a focus on the triggers for shooting. I didnt remember playing RE4 like that so I checked the controls and youre able to use the original scheme that utilizes the triggers but still uses the face buttons to shoot. RE4 is one of those games where the controls were perfect for it and would most likely not work elsewhere.Visually, the release looks a lot like the latest PC version which was dubbed the Ultimate HD Edition. The character models are sharper as are most of the environments. I dont remember being able to walk through so many trees in the original but that was a long time ago. The new release also includes all the previous content, including the Separate Ways epilogue that was originally a PS2 exclusive, which lets you play as Ada Wong for five extra chapters.", "date": "September 1, 2016", "grade": "A"}