{"name": "Gal*Gun: Double Peace", "ref": "https://gaming-age.com/2016/08/galgun-double-peace-review-ps4-ps-vita/", "text": "On the surface, Gal*Gun: Double Peace seems like its tailor-made for the Vita. I mean, its a pervy Japanese game in which you fight off underage schoolgirls by firing ecstasy shots at them, you can refine your shot with a scope that also allows you to see through the girls clothing , and you occasionally trigger rubbing minigames that end with said girls looking red-faced, limp, and exhausted. If you were to come up with a description for a stereotypical Vita game, itd probably read a lot like that. In fact, I was so sure that Gal*Gun would be better on the Vita, I went out and bought the game for Sonys handheld after enjoying it on PS4 far more than I thought would be possible.This was a mistake. And pretty much all of it comes down to controls and missed opportunities.See, Gal*Gun is a rail shooter. And maybe its just me, but Id have thought that thered be no better match for a rail shooter than a touchscreen. Unfortunately, the developers didnt think that way, as evidenced by the fact that those minigames are the only time you get to use the Vitas touchscreen. That means youre stuck using the Vitas thumbsticks for levels that are surprisingly demanding in terms of precision  and, as much as I love my Vita, I dont think I could claim theyre built for precision. The fun factor goes way up when youre aiming and shooting with a proper controller and a much larger screen.And that, in turn, is part of why Gal*Gun is so much better on PS4. Even though the game is identical in pretty much every respect, it just plays more smoothly there than it does on the Vita. The only difference between the two versions, as far as I could tell, is that youre using the DualShock 4s touchpad for those minigames instead of the touchscreen  and quite honestly, it feels exponentially less weird to be sliding your fingers around on that than it does to be physically rubbing the screen.Which, perhaps, speaks to the broader reason of why this game seems better on PS4 than it does on the Vita: the ickiness factor goes way down when youre playing the game in the privacy of your home, rather than out in public where people can see you (and give you dirty looks, and think you belong on some kind of watchlist somewhere). Im not saying people should be ashamed of liking what they like, but at the same timewell, did you read the part about the orgasm minigames?Besides, playing Gal*Gun in private, where youre not frantically fast-forwarding through the text to avoid something disturbing popping up on screen, gives you a chance to see that this game does have a sense of humour about what it is. Im not saying it removes the perv factor entirely, but it at least lessens it to the point where I cracked a smile a few times as the game acknowledged the absurdity of its premise of angel shoots guy with a lifetimes supply of love arrows, and he only has one day to find his true love or be doomed forever.(Also  and this is something I cant believe Im writing  the game deserves credit for the simple fact that jiggle physics arent included. Gal*Gun may be salaciously stupid, but at least its not Senran Kagura-levels of stupid.)", "date": "August 31, 2016", "grade": "B-"}