{"name": "God Eater Resurrection", "ref": "https://gaming-age.com/2016/08/god-eater-resurrection-review-ps-vita-ps4/", "text": "God Eater Resurrection may have come out fairly recently, but dont mistake it for being a new game. After all, its basically a remake of a 2011 PSP game, Gods Eater Burst. Whats more, its a remake of a PSP game that didnt exactly blow people away the first time around, that most people remember  to the extent they remember it at all  as a Monster Hunter clone.Honestly, thats still a pretty fair assessment. The broad strokes here havent changed all that much. Anyone whos played Monster Hunter  or Toukiden, or Freedom Wars, or Soul Sacrifice, or Ragnarok Odyssey, or any of the myriad other imitators that have come out over the last several years  will know what to expect here. You have a team of fighters/archetypes, and you need to rescue your village/city/world from the brink of destruction by defeating all kinds of monsters. There are minor differences here and there, but really, if youve even played one monster hunting game, youll know whats in store here.Just because its been done before, however, doesnt mean that God Eater Resurrection doesnt do anything worthwhile. For one thing, it looks a lot better than many of its ilk. You might not expect a remade PSP game to look all that great on the Vita, but it holds up pretty well. In contrast to some of those titles I mentioned in the last paragraph, GREs world never fades into muddy brown colours. Im not saying that itll dazzle you with the most amazing graphics youve ever seen or anything, but you wont offend your eyes, either.Likewise, the gameplay is pretty solid. Yes, the ultimate goal is exactly the same as what youll find in Monster Sacrifice Wars  go to area X, kill everything in sight, gather items, repeat  but its clear that GRE was designed with gaming on the go in mind. Many of the levels can be beaten in under five minutes, and on the rare occasion you cant, the goals are still simple enough that youre not likely to be at risk of putting the game aside, coming back, and forgetting what it was you were doing. You hack, you slash, you shoot your oversized gun, and then you return back to the hub world and pick up your next mission. Its enjoyable simple.I should here acknowledge that God Eater Resurrection does, in fact, have a story. I couldnt tell you what it is, beyond a bunch of students fighting to save the world for their own disparate reasons, but apparently the games lore is deep enough that it could inspire an anime of the same name. If you dont feel like paying attention, though, you dont have to worry about missing too much.", "date": "August 10, 2016", "grade": "B"}