{"name": "Marvel Ultimate Alliance Bundle", "ref": "https://gaming-age.com/2016/08/marvel-ultimate-alliance-bundle-review-ps4-xbox-one/", "text": "-Activision provided the Marvel Ultimate Alliance Bundle for this review-If youve read a few of my reviews, you should be able to tell that Im a pretty big Marvel fan. Comics, cartoons, movies, games, toys I buy into almost everything they put out. 2006s Marvel Ultimate Alliance and 2009s Marvel Ultimate Alliance 2 are two of my favorite titles from the past console generation. Marvel Ultimate Alliance 2 is almost my all time favorite Marvel game as well (narrowly losing out to Spider-Man: Shattered Dimensions). Ever since I finished Ultimate Alliance 2, Ive been waiting for a third title in the series with an even deeper roster of playable heroes and villains. Unfortunately my wait must continue, but in my opinion these current gen ports show that Activision and/or Marvel are trying to gauge popularity, and that could lead to a brand new title. At least, thats what I hope, despite these titles and some other Activision ports just looking like lazy cash-ins (Prototype collection and upcoming Transformers: Fall of Cybertron).As Im sure you may have seen, these ports are not receiving favorable word of mouth. From missing DLC, missing achievements, and UI/technical glitches, it hasnt been a smooth rerelease (and that isnt even close to the issue the ports have received on the PC). But there is some light at the end of the tunnel since Activision has come out to say they intend to fix the problems. Patching the game and adding in the previously excluded DLC (for free) is a good start, and it shows that Marvel and Activision are listening (or that if you make a big enough stink, something will get done). I played the bundle on the PS4 and besides immediately noticing that the DLC for Ultimate Alliance 1 was not included, I didnt notice any of the problems people were reporting.The bundle is billed as having graphical enhancements, and that should be taken with a grain of salt. The only noticeable improvement are the character models. They look smoother and shinier than the original releases. On the other hand, a lot of the level designs and the gameplay elements dont hold up to the test of time (more problematic in Ultimate Alliance 1), but this isnt a major issue. If you like these titles prior, you will still get a kick out of returning to the franchise. If you are brand new to the series, depending on your love for Marvel, you might be able to get passed the last gen look and feel. The cut scenes are an issue I just cant look past, though. The cut scenes in both games look horribly dated and theres no reason why they couldnt have redone these scenes. Capcom, who love to port titles and cash in on previous releases (the 28th rerelease of Resident Evil 4 is coming later this month), usually even remasters the cut scenes on their ports.", "date": "August 9, 2016", "grade": "C+"}