{"name": "Summertime Madness", "ref": "https://gaming-age.com/2022/08/summertime-madness-review-for-nintendo-switch-playstation-xbox-pc/", "text": "Im not going to lie: not only did I play Summertime Madness on its easiest setting, I also used a walkthrough to get through significant chunks of it. Given that its a puzzle game where, on normal difficulty, time and speed are of the essence, I arguably didnt get the full experience as intended by its developers.That said, I think the only reason I enjoyed it as much as I did was because I made it easier on myself. I still remember how much I hated The Witness because of its seemingly (at least to me) impenetrable logic, so it made sense for me to play Summertime Madness in a way that would make me more likely to enjoy it. Though Im not sure if enjoy is necessarily the right verb to describe Summertime Madness. The game is set in Prague 1945, as the bombs are raining down near the end of World War II and the main character, a painter, is offered a chance by a mysterious stranger to disappear into one of his paintings. Once he gets in there, each of his paintings has been transformed into worlds full of puzzles, and he finds himself facing the prospect of being trapped for eternity unless he can escape within a set amount of time.In other words, its a game thats tense by design. Even if you play it on easy, as I did, it still regularly reminds you that the clock is ticking, and that adds a sense of urgency to everything you do. Even the easiest puzzles (say, looking for matching symbols) are still set in worlds designed to confuse you, like a funhouse where the layout changes every time you walk through a door, which means that youre constantly backtracking and trying to figure out a way forward.Despite these challenges, its hard not to be impressed by how nice Summertime Madness environments are. Theyre meant to be worlds set inside paintings, and they generally look nice enough to be paintings come to life. In particular, theres a level set in a painting called Neo Prague, where the city changes  and looks drastically different  from day to night, and both are gorgeous. Summertime Madness doesnt last long, and it can easily be finished in under two hours. But its also not the sort of game that needs to go on forever, either. Its a challenging, engaging puzzle with enough plot to last through its runtime, and thats enough to make it well worth a look.", "date": "August 10, 2022", "grade": "A-"}