{"name": "10 Second Ninja X", "ref": "https://gaming-age.com/2016/08/10-second-ninja-x-review-ps4-ps-vita-xbox-one/", "text": "The key thing to know about 10 Second Ninja X is that it doesnt have a difficulty curve so much as it has a difficulty Everest. Its not the kind of game in which youre given a few levels to get the hang of things or build up your confidence. No, here you get a brief tutorial in which you learn how to jump/kick/fire throwing stars, leading into a short scene that lays out the games plot (which, it should be noted, borrows rather liberally from the first Sonic the Hedgehog), and then youre on your own, cut loose into a game that wants to kill your hopes and dreams.As its title implies, 10 Second Ninja X gives you 10 seconds to beat each of its levels. But if you come anywhere close to using all of those 10 seconds, youre sunk. Realistically, you need to get through each level  destroy all the robots and avoid all pitfalls and obstacles  in a fraction of that time. Heres how intense it is: if you want to earn three stars on the very first level, you need to beat it in under 3 seconds.In other words, this game isnt for people who like to take their time. That, however, leads to an important question: does 10 Second Ninja X give you the tools you need to beat each level in a couple of seconds, so that you can earn enough stars to unlock additional worlds?Im having a hard time answering that. As someone who usually likes to play platformers at my own pace, twitch platformers like VVVVVV or Super Meat Boy tend to be a little out of my wheelhouse. And seeing as 10 Second Ninja X is kind of like those games on steroids  because even they gave you one or two levels in order to get used to the pace of the game  you can imagine just how much I suck at it (answer: pretty badly). There are few things as disheartening as flying through a level flawlessly, your feet barely touching the ground, only to discover that you need to knock several seconds off your time if you want to earn more than one star. And if you want to earn all three stars from a given level, you better be able to move so quickly that the level is practically over at the very same moment it begins. Based on my experience, the game doesnt offer tight enough controls to pull all that offbut my experience is very likely different from whats intended, which means youll probably want to take it with a few (or several) grains of salt if youre the kind of person who enjoys sadistic difficulty in their games.", "date": "August 3, 2016", "grade": "B"}