{"name": "Lumo", "ref": "https://gaming-age.com/2016/08/lumo-review-ps4-ps-vita-xbox-one/", "text": "If youve ever wanted to know exactly how important good controls are to a game (not that this was ever in doubt for most people), you only have to look at Lumo. Right at the games outset, youre given a choice of three different control schemes. If you pick the wrong scheme, the game becomes almost unplayable, as youll be destined to walk into walls and jump to your doom every step of the way.Pick the right one, however, and youll have set yourself up for a fun retro experience. There arent too many games nowadays that look to the likes of Q-Bert or Knight Lore  or even Sonic 3D Blast  for inspiration, but as an isometric platformer, thats exactly what Lumo does. Room after room puzzles, weird little characters, 2.5D graphics  really, everything about it will strike a nostalgic chord for anyone who ever played any of those old, pioneering titles.Then again, I barely touched them, and that didnt prevent me from enjoying Lumo. It undoubtedly helped that, while it draws inspiration from those older games, it doesnt require a thorough knowledge of them in order to succeed here. Really, as long as youre able to think things through in a logical, holistic manner, youll be able to get by. It also helps if youre at least a little prone to going off on sideways explorations  in Lumo, thats the key to discovering some cute little secrets.And I do mean cute. For a game where your character is constantly at risk of getting impaled on spikes, drowning in acid, or getting burnt to a crisp, Lumo really knows how to keep things adorable. Maybe its the soft, dream-like music, maybe its the fact the main character looks like (s)hes wearing a little raincoat and hat, maybe its the way you simply pop out of existence the second you die (rather than the game lingering on your fresh corpse for a few moments): whatever the reason, this is a challenging platformer than isnt constantly trying to remind you of how hardcore it is.", "date": "August 1, 2016", "grade": "B+"}