{"name": "FRU", "ref": "https://gaming-age.com/2016/07/fru-review-xbox-one/", "text": "So if I told you right now that you could go onto your Xbox One and play a game that was equal parts Super Mario and trippy dream state, would you believe me? Would you believe this fantastic bit of gaming was only available on the Kinect and required you to move and contort your body to complete the platforming puzzles? I wouldnt believe me. I would be digging out my torches and pitchfork that I keep handy for occasions like this and furiously searching for my address to teach my deceitful self a lesson. If this describes your feelings, I will ask you to stay your disbelief until the end of this review, then go purchase Through Games recently released puzzle platformer, FRU.FRU starts off with minimal explanation. You see a little girl in a weird fox mask standing there and a silhouette of some handsome guy (or gal) in the middle of this strange world. There is an outline of an Xbox controller showing you that both the left and right joysticks move the little girl on screen in the direction you want her to go. You take off running and move off the right side of the screen. Congratulations, you have just completed level one. The game instantly moves to the next screen/level where you are met with a dilemma. There is ground on the left, ground on the right, but no ground in the middle. You are an astute gamer and know from the previous level that you need to get the little girl from the left to the right, but how? As you pace the room searching for your answer you notice something, the area inside your silhouette is different than the area outside. When you position yourself over the gap, it turns into a solid bridge that the little girl can cross over. Welcome to the puzzles of FRU.The initial few levels are quite simple, teaching you the mechanics and showing you how you need to move your body to effectively navigate the game-space. The game doesnt hold your hand for long and you are soon standing and contorting your body like a world class yoga instructor trying to get this little girl from point A to point B. The game is divided up into four chapters, with each chapter introducing a new gameplay element. Chapter one shows you how to use your body to reveal the solutions to puzzles, chapter two introduces a water element, with three and four introducing their own little twists that I will not spoil for you. The game consists of a total of 110 levels, or screens that must be navigated to win. Total runtime on this is roughly 2-3 hours depending on how flexible you are. For a $15 dollar tag, I feel that this is more than reasonable, as the replay value is actually pretty high, with achievements to incentivize you to faster and faster run-throughs.Graphically the game is exactly what I would want from something like this, simple and not overbearing, but beautiful and interesting enough to keep your attention. Deep blue backdrops are accented by vibrant yellow torches and lush green foliage. The little girl stands out on the screen and is easy to track through the moving and puzzle solving, which is a definite plus. FRU has a beautiful, calming soundtrack that plays in the background, never really coming to the forefront but always a noticeable addition bringing a sense of ambiance to what you are doing.", "date": "July 26, 2016", "grade": "A-"}