{"name": "Hazel Sky", "ref": "https://gaming-age.com/2022/08/hazel-sky-review-for-nintendo-switch-ps4-xbox-one/", "text": "Its never a good sign when the more you play a game, the more you hate it. That probably goes double for a short game. Take, for example, Hazel Sky: all it took was two and a half hours for me to go from intrigued based on the games brief inclusion in Nintendos December 2020 Indie Direct to absolutely loathing it. It takeswhatever the opposite of skill would be, I guess, to generate that kind of strong emotion in such a short amount of time.But seriously, this game is terrible in every way. Whether were talking major aspects of the game or simply minor little details, everything about it is awful.For starters, the camera is abysmal. Its impossible to get a good view of what youre doing here, and even the slightest nudge of the thumbstick will send the camera wildly out of control. Just about the only time it sticks in one place, naturally, is when its stuck behind an object. That means you get great views of walls and trees, but seldom on your character. Somehow, playing around with the sensitivity makes things worse, since you can either have it swing wildly around, or swing your perspective so wildly it makes you queasy. There were also several points where the camera simply swung around into the other side of the world, so you could see nothing but endless blue and white  but not where you were going or what you were doing, which is obviously kind of an issue.The controls are equally awful. Your character, a teenage boy named Shane, moves stiffly and clumsily, whether hes lurching about on land, awkwardly jumping from one platform to another, or failing miserably at walking underwater. Thankfully, theres not too much platforming, and the underwater bits are limited to one level, but every moment you have to spend helping Shane get from Point A to Point B is painfully slow, even when hes trying to run.And speaking of moving, heres another obnoxious design decision: Shane is frequently interrupted on his walkie-talkie by a girl named Erin, who, like Shane, is training to be an engineer for their floating city (more on that in a moment). While the game will tell you when she wants to talk, you can only speak if youre moving around. If you stop, so does the dialogue. On top of that, you cant do any other actions while youre speaking, so youre forced to walk around aimlessly just to listen to their dull prattling back and forth  since if you dont, nothing else can move forward.Its those scenes that really underline two of Hazel Skys other issues. First, the voice acting is terrible. I dont know if the problem is the script or the voice actors, but the combination of the two felt stilted and unnatural.Secondly, the plot feels like youre on the edge of something much more interesting. As mentioned, the story is built around a teen named Shane whos been sent to train to be an engineer on a series of islands where his ancestors have also been sent. His goal is to return to his floating city, which seems to be under attack, given all the explosions that you see happening in the distance. While on those islands, he frequently stumbles across their dead bodies.Theres a lot of potential there, but unfortunately Hazel Sky never really gets into any of that. Instead, you get Shane and Erin talking about what they want to do in the future. While Ive always had a soft spot for stories about characters on the peripheries of something bigger  only so many main characters can be The Chosen One, after all  in this case, its hard to care about any of it.Or maybe its just hard to care because the game is so poorly designed and so frustrating. Whether youre falling through the world, or having a needed object vanish out of your hands (which happened to me with alarming regularity), or merely just fighting with the camera, Hazel Sky is chock full of terrible decisions.", "date": "August 9, 2022", "grade": "D"}