{"name": "Carmageddon: Max Damage", "ref": "https://gaming-age.com/2016/07/carmageddon-max-damage-review-xbox-one-ps4-pc/", "text": "Lets take a walk down memory lane. Its 1997, you just picked up Carmageddon for the PC and you are sitting down thrashing fellow drivers and pedestrians are exploding in little fountains of gore. The graphics are good, but the gameplay is fantastic, a classic arcade driver with over the top violence and insane stunts that fit the needs of the masses at the time. Now here we are in 2016 getting the crowdfunded sequel, Carmageddon: Max Damage, a game that would have been perfect in 2004. Allow me to elaborate.First, let me address the graphics. Grand Theft Auto 5 this is not, the game looks like its running on an engine from a decade ago. The environments, the people, the cars, all of it is very last gen. The physics in the game are over the top, but not in the good way you would want in a game like this. The soundtrack follows suit, trying to pull the nostalgic feelings out through music but falling quite short. A games graphics can be overlooked if they arent quite to taste if there are other redeeming elements to the gameplay/story that show where the time and effort were put in, but this game lacks such redeeming qualities.The gameplay itself is adequate, even fun at times. Driving though the city and launching old ladies with their walkers into oblivion is no doubt an enjoyable experience, but it cannot be the basis upon which a game is built. The game is amusing and enjoyable for the first hour then drops off as you repeat the same actions over and over. The power ups lose their Wow after multiple uses and the game is plagued with bugs and glitches  clipping through walls, the ground and other cars to name a few. Had Carmageddon: Max Damage come out a decade ago, it would have been a good sequel, but the games premise has lost its luster in an age where mods and expansions for games like Grand Theft Auto 5 let you do the same basic things but in a way that is far superior.The highest point of the game is without a doubt the vehicle selection. With over 30 customizable cars to choose from you can truly set yourself apart from everyone else with your selection of mobile pedestrian crusher. Your vehicle choice will have a strong influence on how you complete your missions. With an offensive, heavy vehicle you will go after opposing drivers. A light, defensive vehicle will be your choice for completing the race laps. And a light offensive, nimble bladed vehicle is ideal for slaughtering pedestrians. The game is able to recreate a modicum of the originals luster through these choices, but ultimately falls flat.", "date": "July 18, 2016", "grade": "C-"}