{"name": "Monster Hunter Generations", "ref": "https://gaming-age.com/2016/07/monster-hunter-generations-review-3ds/", "text": "Ready to drop a good 100+ hours into a video game this summer? Look no further than Monster Hunter Generations, hitting the 3DS this Friday. As much as Ive loved the Monster Hunter series in the past, Im continuously impressed by how each subsequent release draws me in even more, and Generations is no exception. Its extremely well-made, with awesome monster encounters, interesting zone variations, tons of craftable gear, and a few unique spins on the typical Monster Hunter formula.The base Monster Hunter experience remains largely unchanged in Generations. Youll pick a hunter from a handful of customization options, and work your way through a number of quests handed out at four different villages. These quests will run the gamut from simple fetch and gathering quests, to the more challenging (and fun) hunt quests. Defeating or capturing monsters will net you resources necessary for crafting new weapons and cool looking armor sets, which then allow you to progress onto harder quests and encounters against even tougher (and often larger) monsters.Monster Hunter Generations features 14 different weapon types, all selectable from the beginning of the game. Returning favorites like the Lance, Bowgun, and Hammer are present, along with the more recent additions like the Insect Glaive from Monster Hunter 4. Palicoes also return, allowing you to outfit them in their own armor sets and even take them on quests, both offline and off. Palicoes can also go on quests all by their lonesome, and Monster Hunter Generations allows you to control your feline friends directly, with their own quest chains to uncover, a first for the series.Another fairly big addition in Monster Hunter Generations is the inclusion of Hunter Styles and Hunter Arts. There are four Hunter Styles to pick from which sort of mold your hunter to your desired play style. If youre a Monster Hunter vet, you can opt to pick the Adept style, which allows for special counter attacks when you successfully pull-off a last-minute counter or dodge. Theres also the Aerial Style, which adds a small jump function to your hunters abilities, giving you more airborne attacks to mount and land blows on enemies. There are even new-player friendly styles, like Guild and Striker, which allow you to equip more Hunter Arts than the other two styles.Hunter Arts, in turn, provide additional skills to your hunters arsenal. These range from special dodges to weapon specific attacks, which are triggered by filling gauges, typically after attacking monsters. Theres a pretty good mix of defensive and offensive skills, with more options unlocking the further into the game you get. These provide a neat change to the more rigid movesets the game is typically known for, giving even veteran players something new to master and make use of.Like Monster Hunter 4, online play returns with Monster Hunter Generations, and works extremely well. While the overall player base has been smaller prior to release, I still havent had much issues joining or hosting lobbies. And based on my experience with the launch of Monster Hunter 4 Ultimate, I doubt well see much in the way of connection issues when the game comes out on the 15th.", "date": "July 12, 2016", "grade": "A"}