{"name": "Frane: Dragons Odyssey", "ref": "https://gaming-age.com/2019/08/frane-dragons-odyssey-review-for-ps-vita-ps4-xbox-one-switch/", "text": "Ive played enough KEMCO RPGs that I was pretty sure I knew what was in store for me with Frane: Dragons Odyssey before I even played it. Retro graphics, retro music, retro gameplay, all presented in the most generic-but-competent way possible. Thats been the case for the ten or so other RPGs Ive played from that publisher, and I wasnt expecting them to try something new now.Turns out, my expectations were only partially right. Frane: Dragons Odyssey is, unquestionably, yet another RPG that owes its existence to the genre circa its NES and SNES days. Its got the sprite graphics, the basic music  if you were to picture an old-school RPG in your head, youd probably picture something like this game.Unfortunately, Frane: Dragons Odyssey doesnt play like one of those games, and thats where the problems begin. For starters, simply moving around is a massive pain. Getting your character to walk around the small little villages and dungeons is tedious beyond belief, since they move at a plodding pace. Im not saying that everyone should be zooming around like Sonic or anything, but seeing as I almost fell asleep watching the characters move across the screen, they could at least move a little faster. (And I know that they can, too, because the main character has a special attack that sees him flying across the screen at an enjoyably rapid speed.)The combat, though, is even worse. While Ive never enjoyed turn-based combat, it at least works  which is a lot more than can be said for what theyve replaced it with for Frane: Dragons Odyssey. Its a weird mish-mash of hack and slash (with the attack for one of the characters consisting entirely of ineffectual slashing) and magic (your secondary character shoots off magic bombs, for lack of a better description), and it feels both completely weightless and mostly ineffectual. You just kind of wander around, spamming both buttons and hoping you hit enemies enough to make them vanish, while enemies also wander about in place, mostly unconcerned with your presence. They respawn constantly, too, so it doesnt matter how many times you clear out a particular hallway, theyll still come right back.The game also takes the surprising tack of making players figure everything out for themselves. While Im not necessarily opposed to a game going against the genres standard approach of explaining every little thing in mind-numbing detail, it still feels like a bit of an oversight to, say, not tell you which buttons you use for combat, or how to assign items to slots. True, its mostly buried deep inside the settings menu, but it wouldve been just as easy to have a quick onscreen graphic for those kinds of things.Its unfortunate that Frane: Dragons Odyssey actively sabotages itself, because otherwise it would have had the potential of being one of the better KEMCO games. The story is bonkers right from the get-go, with Zeus telling a couple of human-looking dragons to go rescue an angel, and from there it does a good job of being kind of interesting, even if not particularly coherent.But, ultimately, none of that matters when the game is such a dull slog to play. As much as Ive complained before about how generic KEMCO RPGs can be, at least it could be said that they were competent. If the alternative is something as bad as Frane: Dragons Odyssey, then Ill take the generic option every day of the week.", "date": "August 9, 2019", "grade": "D+"}