{"name": "Republique", "ref": "https://gaming-age.com/2016/06/republique-review-ps4/", "text": "If youre a cynical sort of person, you might only see Republique as a collection of influences. The art deco-inspired designs, the unseen voice guiding you through the world, the widespread use of propaganda: all of that is pure Bioshock. Likewise, youll probably see Metal Gear Solid in every corner you sneak around and every guard you pickpocket. You may even be tempted to draw a line between this games techno-paranoia and that of Watch Dogs, but youll want to avoid that link, seeing as Republiques first episode came out on iOS about five months earlier than Aiden Pearces adventures were unleashed on the world. That said, its certainly appropriate to say that both games mine a similar vein of distrust of technology and surveillance that has been around since at least 1984 (the book, not the year).If you choose to see Republique that way, and only that way, I certainly cant say that youre wrong. I mean, all of those influences are unavoidably present; theres really no getting around the fact this game isnt hugely original. However, even if Republique doesnt break much  or any  new ground, I dont think that means you need to avoid it entirely. After all, if youre going to steal, you may as well steal from the best (and again, were not including Watch Dogs in the best category).Thats not to say, of course, that Republique comes anywhere close to matching the heights of its antecedents. While the mysterious facility that main character Hope is trying to escape echoes Bioshocks claustrophobic undersea city, it never quite feels as fully realized; all the lines are a little too sharp, and all the colours are a little too muted. Similarly, if youre a fan of stealth youll feel like a sneaking god the first several times you tiptoe past oblivious guards, but that feeling of superiority will fade pretty quickly when you realize how stupid the AI tends to be.The good news is that even if Republique doesnt do anything as well as its influences, it doesnt do anything poorly, either. Considering it got its start as a mobile game, it looks pretty impressive  far better than many of its peers that were originally conceived of as PS4 games, in fact. By showing all the action through security cameras, camcorders and smartphone cameras, the game has a built-in excuse for everything looking a little fuzzy, and it adds to the charm.And besides that, Republique deserves credit for being a mobile game that made the leap to consoles without sucking. I mean, Final Fantasy Type-0 HD was a bit of a bust, Toukiden: Kiwami was better experienced on the Vita, and Table Top Racing was just plain awful. For Republique to seem like a natural fit for PS4 and PC is kind of a small miracle.", "date": "June 20, 2016", "grade": "B"}