{"name": "Dual Brain Complete Edition", "ref": "https://gaming-age.com/2022/08/dual-brain-complete-edition-review-for-nintendo-switch/", "text": "If all you want out of a puzzle game is quantity, Dual Brain Complete Edition may be right up your alley. Its a collection of about thirty minigames, some of which were released in monthly installments back in 2019-2020 in three different Dual Brain games, and some of which are new to this edition.In other words, theres a lot to do here. You can add, you can test your spatial reasoning, you can test your memory, you can count things  and then, after youve done all those things, you can check the online leaderboards to see how you compare with other players around the world.Unfortunately, the problem is that quantity doesnt necessarily equal quality. And while there are a lot of minigames in Dual Brain Complete Edition, that doesnt necessarily make them all worthwhile. I mean, just in the math section, you have no less than five games that are basic addition  and then there are even more addition games in other sections. Likewise, there are only so many ways you can match colours and shapes before they start to feel same-y. So, yes, there are a lot of minigames here, but theres something to be said for variety.It also doesnt help that the presentation looks identical for all the minigames. All the action takes place inside a rectangle in the middle of the screen, giving the game a vaguely Tetris-like feel, at least in terms of visuals. The controls dont vary much between the games, either  most of them boil down to flicking the thumbsticks in one direction or another, while you keep one eye on a timer that you can add seconds to with the shoulder button. (And, unfortunately, even though the game seems like it wouldve been tailor-made for touch controls, you cant use those here.)As I said up top, if all you want is lots of content, then Dual Brain Complete Edition will deliver. But if you want the content to be fun or engaging, then it feels a little lacking.", "date": "August 4, 2022", "grade": "C"}