{"name": "Fire Emblem: Three Houses", "ref": "https://gaming-age.com/2019/08/fire-emblem-three-houses-review-for-nintendo-switch/", "text": "If youre like me then you might have skipped the Fire Emblem games on 3DS just waiting for another console one and if youre also like me then you probably hoped Fire Emblem Three Houses was going to be a solid entry for the series. And well its not just a solid entry but maybe one of the best strategy games around!The game this time is for one a very deep and enjoyable experience which takes place in a monastery that students attend to learn the art of fighting. You will play as a rookie professor who is immediately offered a job after saving some students in a chance encounter and from here the story takes off. And lets just say well leave it at that because there are many things that should be left as surprises but also because the game has three different stories! This is because when you begin your job as a professor you are also paired up with one of three noble teens who are all from different backgrounds and all have their own things to work through.And once you choose a house then things really get going. So it should be said that each campaign can last over 60 hours and with replay value like that it is easy to find hundreds of hours in Three Houses once you factor in replay value. And you just might do this because unless youve made up your mind before starting you will find each house has a lot to offer and choosing just one is a big commitment! But you can later recruit people from other houses to join your class so not all is lost if you want to try out students who dont belong to your class.But the core of Fire Emblem is alive and well here on the battlefield. Well with one noteworthy change that they got rid of the weapon triangle but you wont miss it. You can also try out different cameras that will let you go up close into a third person gameplay if you want that but I just used the tried and true tiles.The battles are where you will do the most leveling up as you trade blows with your enemies. Whats different now is that you will also spend a lot of time running around the Garreg Mach Monastery doing activities to raise your professor level and also getting to know your students and other staff. Support levels are here from the 3DS games and I really like how it gives me a chance to see who my party members are on and off the battlefield. It can also change how you look at the students and lead to just preferring some over others or putting in some extra work to make sure a student isnt left behind because you know how hard theyre trying.It also helps that theres a lot going on with the monastery and it can be overwhelming at first but the game does a good job of helping you get familiar with the day-to-day routine of teaching and battling or running around finding all the lost items everyone keeps misplacing! And if this sounds tedious then you will be happy to know it never feels necessary to spend all your time here but is more added variety and chances to strengthen skills for benefits on the battlefield.Each of the days you have for free time can be spent in the monastery or battle or just resting so you will have to be strategic about how your time is spent. And if youre not sure what to do then you can go online to see what other players did and just follow their lead. The game also uses online functionality to show where others died in battle like Dark Souls but unlike Dark Souls this is not just a warning sign but you can get extra perks from putting a unit on these tiles like experience of an item. And sometimes doing so will also lead to your doom so be careful not to repeat another gamers mistake!There is so much to talk about with the game that its almost best to say that if you love the classic Fire Emblem strategy combat then among the campaign and side missions youll find a very fun and good challenge here. And if you want something extra on top of it then the monastery and other activities will give you a lot of opportunities to really explore the game outside of its main story. The surprising thing is that all the monastery stuff doesnt feel forced and actually fits very well into how this game was made.And it plays great too! I cant tell you why but something about moving units around in battles feels very responsive and quick. You could even say the same thing about the entire game as a whole because while there is a lot going on it also feels like every inch of gameplay is so polished that you could slip and break something without being careful! And yes thats a dad joke but its also true because from all the menus and interactions between students and battle and the monastery the game is very well balanced.If I had to complain about anything it would be that the game is a little unattractive to look at and I would have liked a pixel look at least on the battles. Well or just anything different because every other Nintendo game on Switch is getting rebooted and stylized and just outshines this. Its not that its ugly but it doesnt jump off the screen like Breath of the Wild and just looks kind of boring especially when your characters face never changes expressions and just looks blank. It just looks less impressive in the 3D visuals but it also makes me nostalgic for Dreamcast and PS2 games and think of that what you will! But the menus and calendar art and character portraits are very pretty so its just half unattractive.The music on the other hand is very good and many will be happy to find that the game is not only fully voice acted but also lets you choose between Japanese or English audio! These are good performances too and add a lot to the game so its good to see they put in the full effort here.But the game is huge and if it wasnt so addictive that could be a bad thing. That means youre going to have a good time for a long time and thats never a bad thing unless you have boring things to keep pulling you away in real life. But its very easy to see that the team wanted to make a Fire Emblem game that would redefine what the series has been without changing the strategy parts and the result is something very special. If you ever had any interest in the series then Fire Emblem Three Houses is one you must play!", "date": "August 7, 2019", "grade": "A+"}