{"name": "XEL", "ref": "https://gaming-age.com/2022/08/xel-review-for-nintendo-switch-pc/", "text": "I try my best to avoid getting too excited for games, but I was kind of hyped for XEL. Its reveal trailer gave off a strong Zelda vibe with all the lush, verdant scenery, while the space aspect added in a hint of Jak and Daxter or Ratchet and Clank. On top of that, the developer diary made it clear that theyd put a lot of effort into channeling their influences into the game. Given all that, I was cautiously optimistic that the finished product would be something special. This should be a lesson to me to never raise my expectations or pay any attention to early trailers. XEL is awful.It starts out so promisingly, too. It has a nice opening cutscene that lays on the above comparisons even more, and makes you feel like youre about to experience something special. Maybe a little generic in the story department  the game is about an amnesiac space traveler  but promising nonetheless.Unfortunately, it all falls apart the moment you take control of your character. Far from being the gorgeous-looking 3D action game of the opening cutscene, youre actually playing the game from a top-down isometric point of view. Not only that, the camera is zoomed way, way, waaaaay out, so your character  and everything else on the screen  are tiny little figures scurrying about. Its impossible to see anything with any level of detail. On top of that, you cant control the camera, which means that if you walk behind any of the many buildings that populate XELs world, you cant see where youre going. Usually this isnt too big an issue, but if you happen to get stuck on something, youll just be pressing buttons and moving your thumbstick, hoping something will share you loose. This awful camera work also means you cant really explore your environments  wander anywhere other than the path the game wants you to take, and you could very easily get stuck somewhere.Mind you, its just as easy to get stuck if you can see exactly where you are. For no apparent reason, there are all kinds of spots  near boxes, near enemies, in the middle of fields  where your character will just freeze in place. You can be walking, you can be hacking your sword, you can be doing whatever: you never know when youll get stuck. You also dont know when the game will decide to free you, which is especially bad if youre stuck near a ledge and the game decides to launch you off that ledge to your death. Those arent the only glitches in the game. XEL also suffers from some of the worst pop-in Ive ever seen in a game. Its very common to enter an area, and see half of it missing  just completely not there at all, and a solid colour in its place. The game remembers youre there after a few seconds every time, but youd think that rendering environments is a pretty basic part of making a game. (I mean, I have no technical knowledge, so maybe Im wrong  but as I said, I cant think of any games that suffer from pop-in to quite the same extent.XELs other big problem is that it really doesnt want to hold your hand. While I get that some games enjoy making players discover things on their own, here it feels like the game just expects everyone will know it as well as the developers do. Its fine to drop players into a world without much context, but telling them to go to a place without any kind of hint as to where that place might be can be a little frustrating. This also ties back into the everything is ant-sized problem  when everything on the screen is so tiny, its really hard to tell the difference between a key and a microchip, especially when theyre the same size, colour and shape. Maybe Im being too hard on XELs developers. After all, their game is a labour of love, and as I wrote above its clear that they put a lot of effort into an homage to their favourite games. And, at times  like in those cutscenes  you can see the beginnings of a great game.But XEL isnt a great game. Its not even a mediocre game. Its a half-finished mess that shouldnt have been released in this state.", "date": "August 2, 2022", "grade": "D"}