{"name": "Alienation", "ref": "https://gaming-age.com/2016/05/alienation-review-ps4/", "text": "Alienation is the latest top-down twin-stick shooter from Resogun and Dead Nation developer Housemarque, and was recently released on PSN for PS4 last week. While the game is certainly an action-focused twin-stick shooter in the vein of other Housemarque releases, its also a bit more akin to loot-based action games like Diablo III. So much so that Alienation has really managed to hook me in over the past week, and has sort of become my go-to game even though I havent finished other major, AAA releases that have come out recently.Seriously, its that good. Alienation is a great looking title, with some fantastic visual effects and a whole lot of enemies that swarm onto the screen at multiple points. Theres a solid number of levels with sharp looking urban, jungle, and snow environments spread across the decently paced campaign. Theres 4 player online co-op which works damn near flawlessly, along with a healthy dose of loot to pick-up, levels to earn, and unique configurations based on items you can slot into the gear you equip.The action is often frantic in Alienation, and while the game can be a little difficult at times, theres three difficulty options present, so you can generally scale things back a bit. Those of you that enjoy a challenge are also rewarded for playing on the tougher difficulties, with increased chances for better loot depending on which option you can select. Difficulty can be changed with each stage, so youre never stuck on one option. Also, for the more masochistic player, theres a Hardcore mode that features permadeath.Alienation features three classes, which could honestly be a bit more distinct in my opinion, since there are some shared skills between all three. Each class does have a different primary weapon however, along with three distinct skills that you can pour skill points into with each level up. The classes consist of Tank, Saboteur, and Bio Specialist, filling the typical class roles of defender, healer, and stealth seen in other RPGs. Unfortunately theres not a lot in the way of visual customization, the characters are all armored up via exo suits, but you can switch between a decent number of colors for some player variety.For weapon loadouts, every class has a primary, secondary, and heavy weapon, along with some type of grenade, which varies between cluster grenades, remote grenades, boomerangs, and mines. Weapons have limited ammo, and grenade variants work off of a cool down. Every weapon type feels pretty distinct, and come in a variety of rarities, ranging from common to Legendary. Theres certainly a noticeable difference when it comes to rarity as well, and items labeled rare or Legendary feel special when encountered, and generally come with additional unique properties.", "date": "May 3, 2016", "grade": "A-"}