{"name": "Swapquest", "ref": "https://gaming-age.com/2016/05/swapquest-review-ps-vita/", "text": "I have two complaints about Swapquest. Im telling you right now that theyre contradictory at heart, so when you reach the third paragraph of this review and that realization hits youwell, all I can say is that Im aware of the contradiction too. Contradictory though they may be, however, Im going to mention both because I think theres merit to both.On the one hand, the game feels like it drags along at an interminably slow pace. Your chosen hero or heroine meanders along in no particular hurry as you set out the path in front of them. No matter how close he or she gets to the evil thingy chasing them at the bottom of the screen, no matter where you need them to get on the map, no matter what button you press thats theoretically supposed to speed things up: I constantly felt as if I was spending my time with this game waiting for my character to get from Point A to Point B.Yet somehow, despite this incredibly slow pace, Swapquest still feels too rushed for its own good. It gives you a bunch of objectives at the beginning of each level, but then makes you choose between achieving those objectives and finishing the level. Most of the time it feels like your options are a) slowly walk in a straight line towards the goal, or b) slowly walk all over the screen in the hopes that you might be able to tick one or two items off the level checklist, with the understanding that if you dont also finish the level, the achievements are for naught. Maybe Im just not motivated enough, but if I have to choose a shorter boring level and a longer boring level, Ill almost always go with the shorter choice. Thats the dilemma presented here, and it regularly felt like the game was waylaid by self-defeating level design.This is unfortunate, because the concept underlying Swapquest feels like it couldve been a lot of fun with just a little tweak or two here and there. In fact, to me the change seems obvious: ditch the chasing aspect, and focus on the swapping. I know that there needs to be some kind of motivating factor present, but in this case, it felt like what the developers went for ended up changing the entire focus of the game.", "date": "May 3, 2016", "grade": "C+"}