{"name": "Star Fox Zero", "ref": "https://gaming-age.com/2016/04/star-fox-zero-review-wii-u/", "text": "Can you believe its been over ten years since the last Star Fox game graced a home console? Fans of F-Zero are nodding yes, but in the years since Star Fox Assault came out on GameCube, there have been two more portable iterations: Star Fox Command and Star Fox 64 3D. Its exciting to see Nintendo return to the Wii U with Star Fox Zero, headed up by legendary Mr. Miyamoto and the fine developers at Platinum Games. Nintendos insistence that the Wii Us GamePad could be utilized in new an innovative ways led to this games complex controls, the antithesis of what Miyamotos known for over his vast career. Still, I had remained hopeful that everyone involved with the project would come up with a fast-paced arcade shootem up like those so prevalent in past generations. What theyve done is create a game that I want so desperately to fall in love with, but the frustrating control scheme puts a damper on the experience.At its core, Star Fox Zero is just what fans have been clamoring for. Its got the same branching pathways that lead to different levels. Its got a scoring system that allows players to replay levels over and over again to try and beat their prior bests. The game is filled with banter between the four heroic pilots and the stages are often filled to the brim with enemy formations, environmental obstacles, and massive boss encounters. In this sense the game delivers what I was hoping for in a sequel.The games underlying structure is pretty much unchanged from prior games in the series. In fact, some may come away unimpressed by how much it mimics Star Fox 64. Some of the levels are almost copied directly from that fantastic game. I guess if youre going to copy and paste it might as well be from the best one in the franchise. Thats not to say there arent differences, because there definitely are.One of the biggest is the addition of more vehicle types. Youve got your tried and true Arwing that flies around gracefully and is still probably the best vehicle in the game. The Walker is the chicken-like transformation that allows you to tackle problems on-foot. The Landmaster tank returns and can even hover for a brief period to access new areas and dodge enemy attacks. Then theres the Gyrowing, which is a slow moving drone-like craft that is usually used to infiltrate indoor facilities. You can drop a tethered robot down to activate switches and to find items. All of the vehicles bring variety to the game, but some are more fun to use than others. The Arwing and Landmaster are the most dynamic in the game and offer up some fun gameplay mechanics. The Walker is by far the most difficult vehicle to really come to grips with, especially when you want to properly turn and strafe. Surprisingly I really enjoyed flying the Gyrowing around and it makes excellent use of the GamePads second screen as you can see through the eyes of the robot you drop down. There is another vehicle that can be unlocked, but I wont spoil that for anyone.Lets address Star Fox Zeros biggest problem: its reliance on the GamePads second screen. Mr. Miyamoto went on record saying he really wanted to create a game that utilized all of the GamePads functions. This game does just that. Pretty much all of the buttons can be used for one thing or another, the gyros are used to move the targeting reticule, and the second screen is used for the in-cockpit view. The biggest disconnect is the games reliance on mandating the use of the second screen. It requires the player to constantly shift attention from the television to the controller and back again. During standard flying missions the viewpoint on the TV is the same as its always been, with the camera behind the vehicle. The problem is its very difficult to aim and successfully shoot down enemies simply by looking at the television because the game doesnt allow you the precision required to do so. Instead, its designed for you to glance down at the GamePads screen for better aiming and enemy destruction.To make it even more frustrating, the gyro controls are used to actually aim your shots. In the chaos of looking between two different screens and trying to maneuver your vehicle out of harms way, the reticule will often drift off of center and youll be forced to recalibrate with the press of a button before continuing the fight. This not only took me completely out of the game experience on several occasions, but it caused undo frustration that is so uncommon with a Nintendo game, let alone one helmed by Mr. Miyamoto. Its almost incomprehensible that he thought this was a good enough idea to keep in the final product.Now, those of you who have played the game yourself might be tempted to say, But, Craig, if you practice enough it gels and becomes second nature. Before long youll be pulling off combos and breaking your high-score records. And, youd be correct. The more I played, the better I got, and I became more accustomed to the controls. I do appreciate that some of the enemies and bosses allow for you to aim in a different direction than youre moving. That being said, at the end of the day I still wish the game had given me the option to play the game solely on the TV with the precision of prior games. I dont need a cinematic view on the television. Heck, I have a 55-inch HD TV for a reason! I want to be immersed in my game and bask in its visual fidelity, not forced to look down at a 480p screen with noticeably worse graphics. This is especially evident when the game goes into all-range mode, making the television useless for shooting enemies as the camera sweeps around in a cinematic view. Who is that supposed to be for, your throngs of onlookers?Speaking of the graphics, Star Fox Zero features fine visuals. Sure, theyre not going to blow anyone away, but the game definitely keeps the simplistic look of the enemy ships from the prior games and I really dig the aesthetic. Some of the backdrops are gorgeous and the game does run silky smooth. My biggest concern is that half of the time Im stuck staring at the in-cockpit view on my tiny GamePad where the graphic fidelity takes a noticeable hit. At least if you play the two-player co-op mode one of you gets to appreciate the visuals on the big screen.The co-op mode is actually pretty fun to play. It does make the game easier if you both are on the same wavelength. One person flies the ship and the other uses the GamePad to fire at the enemies. It can be a bit disorientating at first for the player with the GamePad, but I found it to be a fun diversion as long as the person flying can stay focused on the enemies at hand.The audio in the game is good as well. Youll recognize some of the instrumentation and the old Good Luck! voice is back, which brought a smile to my face. All of the characters are voiced and the acting fits the scenes perfectly. It can be a bit hokey at times, but its supposed to be and adds charm to the characters. I dont think it quite reaches the pinnacle of the original Star Foxs soundtrack from the Super NES, but it matches the action well enough. The sound effects pack a punch, and the game does feature 5.1 surround sound for extra immersion. One nice touch is that all of the voice acting and even some vehicle sound effects are pushed through the GamePads speakers, creating the illusion that youre really in the cockpit.Star Fox Zero wont be a game for everyone. If you liked the prior games, which all have had somewhat short campaigns with a high replay value, this one could be worth considering. The problem is the controls are so irritating at times that its hard to know how each person will adapt to them. It truly is one of those games that make take several plays attempts before the controls click. Some may be perfectly fine with the gyro precision aiming and the constant need to glance between screens. Others are sure to find the experience unnecessarily frustrating and may not take the time needed to practice and get good at playing the game. The sad part is that Nintendo nearly always nails the controls in their games, and its disappointing to see them fail here. As such, while I did enjoy seeing the sights and blasting enemies to bits, Star Fox Zero is far from perfect.", "date": "April 29, 2016", "grade": "C+"}