{"name": "Aliens vs. Pinball", "ref": "https://gaming-age.com/2016/04/aliens-vs-pinball-review-for-zen-pinball-2-pinball-fx2/", "text": "Alien Day is here! (Actually this review is being published a day late.) Everyones favorite date has finally arrived and arent you thrilled? Well Im sure some of you had no idea there even was an Alien Day. 20th Century Fox decided they wanted to cash in on the successes of having themed days for movies (May the 4th for Star Wars or October 21st, 2015 for Back to the Future 2) and created a brand new day to celebrate everything of the Alien universe. They settled on April 26th due to the fact that the moon where the Xenomorph was originally discovered in Alien was, LV-426. Im almost certain that this date will see future Alien movies released on it, but that isnt why Im writing. Alien Day ushers in many new items from sneakers, vinyl, posters, and of course pinball tables. Zen Studios has made a brand new table pack and it includes three Alien universe themed tables. Dodge that Facehugger and lets play some pinball!The first table featured in Alien vs. Pinball is based off the movie Aliens. What youll notice immediately is that the table features the voice over work of the cast of the movie. Actually all of the tables in this pack feature the voice over casts of their respective movie or game. This is a key inclusion for me, especially when you consider how many Marvel and Star Wars tables Zen Studios puts out that doesnt have the actual voice overs. I should mention though that these voice overs are ripped straight out of the movie and the quality isnt the best. Having said that, the Aliens table is my favorite of the three included tables. You have the original voice cast and the table gives you the option of playing through scenes from the movie (in the order of the movie if you so choose), which adds up to a pretty cool experience. Alien games in general havent been very good (with the exception of Alien: Isolation) and most wouldnt think playing Aliens via pinball table would be ideal, but it works surprisingly well.The next table up is Alien vs. Predator. This also follows the movie of the same name. The enjoyment of this table is dependent on how much you like that particular movie, in my opinion. The table is fine and I had fun with it, but Im not a huge fan of the movie (come on, a human teams up with a Predator and becomes best friends?) and the voice overs started to annoy me. Overall the AVP table doesnt introduce as many gameplay elements as the Aliens table does (though it does have a cool predator vision part) and it just doesnt have as much replay value as most of the other tables I own.Lastly, is the Alien: Isolation table. This table has my favorite look of the three (alien cocooning on part of the table) and also offers some unique gameplay features that the others do not. Like the game this table is based on, your goal is to stealthy survive. You have health and ammo that depletes and an alien thats stalking you. This is still a pinball game Im talking about though, so in order to maintain your life and ammo, you must achieve certain goals on the table. All Zen Pinball tables feature interactive characters in some form, but this was the first time that I played a table that featured character health and weapons. While these added features increased my time with this table, I still craved a table based off Alien (the original movie) and would have preferred that in Isolations place.", "date": "April 27, 2016", "grade": "B+"}