{"name": "The Walking Dead: Michonne What We Deserve", "ref": "https://gaming-age.com/2016/04/the-walking-dead-michonne-what-we-deserve-review-for-pc-ps4-xbox-one/", "text": "So with the last episode of Telltales The Walking Dead: Michonne mini-series upon us, I find myself feeling pretty lukewarm on the entire tale told here. The first episode started off well enough, the second episode was a bit of a let down, and the thirdwell, its better than the second at least.The third episode, titled What We Deserve, culminates in a brutal showdown between Michonne and the slightly unstable Norma at the homestead introduced in the last episode. The events that play out here arent necessarily unpredictable. We know, considering where this tale takes place in the timeline, that Michonne is going to make it out alive. But theres a few curveballs thrown into the action that keep you guessing as to who the rest of the survivors might be.We also get a bit more of the flashback sequences, as Michonne tries to come to terms with the ghosts of her daughters. This culminates in the final sequence where Michonne dips in and out of reality a bit, and tries to carve out some semblance of peace with her past life. The revelations here arent necessarily mind-blowing for Walking Dead fans, but I found the final bit to be a pretty touching sequence that gave Michonne a bit more emotional depth than she had at the beginning of this series.Another sequence that I enjoyed happens at the beginning of the episode, which features a small conversation between Michonne and fellow survivor Oak. This takes place before the series started, shortly after Michonne joined Petes crew, and its just a neat calm before the storm sort of moment that helps you care for at least one additional cast member in a way that you didnt before. I wish that Telltale had been able to squeeze in more moments like this, as it would have gone a long way towards making me care about the additional characters introduced for this mini-series.", "date": "April 26, 2016", "grade": "B+"}