{"name": "F1 2019", "ref": "https://gaming-age.com/2019/08/f1-2019-review-for-ps4-xbox-one/", "text": "F1 2019 is the first time Ive ever played an F1 game, and in some ways its the strangest racing game Ive ever played.Of course, what that really means is that F1 2019 is probably the hardest, most true-to-life racing game Ive ever played. Even though I turned the AI challenge level down to Very Easy, and I made the controls and the tuning as simple as possible, its still incredibly challenging..And not in the way that racing games are often challenging, either. Its not like theres crazy rubber banding, or upgrading your car is next-to-impossible  which are often the biggest complaints Ive had with other games. No, F1 2019 is just plain hard. The cars go at high speeds, the curves here are tight and treacherous, and the AI racers are excellent. You cant just lower the difficulty, and then sit back and dominate  as I said, I tried that, and my reward was languishing near the bottom of the standings. It turns out, the only way to get good at F1 is toget good at F1.Luckily, F1 2019 gives you ample opportunity to do just that. Every race is preceded by plenty of opportunities to practice and learn the intricacies of each track. You can also spend some time in F1s training circuit, F2, so you can get a feel for whats expected of you. You can even opt for lower pressure teams, so that rather than disappointing the top-tier constructors like Ferrari or Red Bull, you can get your feet under you with teams where winning every race isnt the sole priority.Ill admit (again) that this didnt help me much. It takes real effort to unlearn years of ingrained driving game behaviour, where you can just easily drift around every tight corner, flick a nitro button, and zoom past everyone. F1 2019 doesnt allow you to do that. For me, the defining moment of my time with the game was in one of my first races, where Id fought my way up to 9th, with the first-place car less than two seconds ahead of me. I took one curve a little awkwardly, and even though I barely lost any speed, the slip was enough for me to plummet from 9th to 20th (also known as dead last).Mind you, I think thats the real appeal of F1  and, by extension, of F1 2019. Ive never been a racing fan, but Ive always had the impression that its a couple of steps above the likes of NASCAR and Indy car racing. Thats an impression borne out by F1 2019, and it means that anyone who wants a real racing game challenge would be well-advised to check it out.", "date": "August 6, 2019", "grade": "B+"}