{"name": "Dark Souls III", "ref": "https://gaming-age.com/2016/04/dark-souls-iii-review-ps4-xbox-one-pc/", "text": "The time has finally arrived and all the waiting is over. Dark Souls III is here and I can finallystop playing part 1 and 2 over and over. Its crazy to think that one year ago, I couldnt care less that there was another game releasing from From Software. Demons Souls was a game I always wanted to love and even picked it up on launch day, yet couldnt appreciate it because I sucked at it. Patience isnt one of my strong suits and this game had me rage quit more than any game in my lifetime so far. It wasnt until late 2015 that I was able to get any further than the 2nd boss in the first level.To put this in perspective, Demons Souls was released in Oct 2009. Thats six whopping years I had to make progress. So what changed? My birthday last year and a game called Bloodborne happened. When Bloodborne was first announced, I immediately had flashbacks of my experience with Demons Souls. These werent good flashbacks, as I simply remember two words about the game. You Died. I died a lot, and the frustration would always get the best of me so I would never make much progress. In turn, I thought this game scarred me for life as I would stay away from the next two titles in the series Dark Souls and Dark Souls 2. But Bloodborne changed everything for me and a lot of potentially haters.Fast forward to now, I successfully completed Bloodborne and its respective DLC, and began playing the series of games backward. I also completed both Dark Souls games all within 2015. To me this was a huge sense of accomplishment and it was all in preparation for Dark Souls III (I still need to finish (Demons Souls). Now with that out of the way, we can talk about what I would say so far is my game of the year for 2016 (Sorry Superhot).This game has been a long time coming and even when I played it last year at an event, I had no idea how much I was going to enjoy it. Clearly, Ive become a glutton for punishment as fellow editor Paul Rosselli calls me. Despite how many times I die and get pissed, it pulls me in for more. Between the three predecessors, I have over 150 hours clocked into this series. One thing that may have ruined some perspectives of the game is anyone that has been following the press releases as well as the crazy demand for this game to the point where someone found a way to import it on Xbox One via a Japanese account and play it in English.Then tons of videos began appearing on YouTube from streamers and some gaming sites, weeks before the release. This had turned off some fans and understandably so. The anticipation has been through the roof due to the commercial success of Bloodborne and the return of Hidetaka Miyazaki as director of the new release. Dark Souls 2 was met with mixed reviews and fans felt a big part was because Miyazaki was simply a Supervisor on the project due to the parallel development of Bloodborne.So the biggest question I had before plunging into the dark was whats new? Im going to assume most readers of this review are existing fans and have done their homework in what to expect. Well in my case, other than the event coverage last year, I tried to keep away from trailers, previews, streams, etc. I wanted to go in with a fresh perspective, especially after my short time with the E3 demo, I knew that it would make the experience even better for me.For starters, this game is as gorgeous as you would expect if youve played Bloodborne. Dark Souls III takes inspiration from each of the Souls games as well as Bloodborne. It could aesthetically be a sequel of sorts to Bloodborne based on the look and even the loading screens as well as the inventory theme. Even though there is tons of features and design in the likes of Bloodborne, this is 100 percent a Dark Souls game. Familiar sounds, weapons, items, locations, and even Non playable characters are present in this enormous world.Even though there is some familiar territory in this entry, it also comes with several new characteristics. Long gone is the theme and use of Humanity. It has been replaced with Ember which when used gives you the equivalent effects of using humanity. Also, there have been new classes added to the character creation. The two new classes are a Herald and Assassin. I chose to build an Assassin because you have a balanced character that wields not only swords but you have the ability to use magic from the start.Another addition to the game is the magic meter which changes how you manage your spells as well as replenishment. There is no longer any items to fill spells. This time youre alsogiven an ashenestus flask for your magic. As you upgrade your flasks you can allocate how many of each you carry to compliment your build. It takes a little getting used to but Im enjoying thus far. Theres several other changes and additions in the game which provides for hours of new experiences that I may not even have experienced yet.At the time of this writing, the online component was not fully functional so I wont be able to speak about it. What I will speak about is the one issue I have with the game. The console versions of DS III both have framerate issues. The game runs at 30FPS but has drops throughout. This is very inconsistent as it happened within the first 10 minutes with minimal happening on screen and hours later during a boss fight which caused me some headaches. The PC version from what Ive seen in videos runs at a smooth 60FPS which seems to be the best experience if you have a rig that can run it. My review is strictly based off the PS4 retail version of the game.There is so much in the ways of content that Dark SoulsIII offers which has always been something the studio takes pride in. Overall, I would say DS III was well worth the wait and encourage fans of Bloodborne to give it a go. The console versions feel like it in many ways and thats not a bad things. This hybrid sequel nicely fits elements from three series in From Softwares library and look forward to the hours upon hours of playing. That is until my first son is born which is in less than a month! Praise the Sun!", "date": "April 11, 2016", "grade": "A-"}