{"name": "Murasaki Mist: Akaras Journey", "ref": "https://gaming-age.com/2016/04/murasaki-mist-akaras-journey-review-ps-vita/", "text": "I feel kind of bad criticizing Murasaki Mist: Akaras Journey. Its the first game from Mexican developers Hollow Games, and their excitement at releasing something on the Vita was palpable through their email introducing themselves to me. I want to say something nice about it. I want to say that its an intriguing new title from a promising new developer. I want to have discovered a shiny diamond in the rough.I want all those things. The reality, however, is vastly different.Which, unfortunately, is another way of saying Murasaki Mist isnt very good. In fact, pretty much every respect, it gives you the exact opposite of what youd want in a game.Dont want to spend as much time watching loading screens as you do playing the actual game? Well tough, because youll be triggering endless loading screens here nearly every time you enter a new area. Want to be able to skip through dialogue quickly? Also too bad, because not only is every mission prefaced by lots and lots and lots of talking (most of it extremely poorly-written), the game also loves repeating itself  within the first twenty minutes or so of playing, I was subjected to the same five-minute cut scene twice. Regrettably, it wasnt any more interesting the second time around, and neither time gave me the option of skipping anything.Not that I was in a particular hurry to get back to playing Murasaki Mist. It is, after all, pretty bad: in a nutshell, think of the worst hack and slash dungeon crawler youve ever endured, and then lower your expectations from that by several orders of magnitude. Youre battling your way through enemies that look like different skins of the same awful clip art, youre attacking them with the least smooth motions imaginable, and youll quickly discover that youre more gently suggesting where your character should go than actually controlling them. On the one hand, it was kind of neat to get knocked over and then zoom around the ground based on whatever direction enemies, my own inputs, and the environment happened to nudge me. On the other, that seems like a horrible way to navigate around a map.", "date": "April 5, 2016", "grade": "D"}