{"name": "Blast Em Bunnies", "ref": "https://gaming-age.com/2016/03/blast-em-bunnies-review-ps-vita-ps4-xbox-one/", "text": "Not often do you see a developers name double as what your response should be to their game. In the case of Blast Em Bunnies, however, its too appropriate to ignore: much like it was developed by a studio named Nnooo, the answer to whether the game is worth your time is a resounding Nnooo, too.Was that a bit of a low blow? Maybe/probably. But also entirely deserved, as far as Im concerned. Blast Em Bunnies is essentially a DLC-heavy mobile game dressed up in console/handheld clothing. Its the kind of game where improvement comes via either grinding your way through the same level over and over (and over and over and over) again, or spending a few dollars to unlock slightly upgraded skills. Its also the kind of game where youre expected to jump at the chance to spend a few dollars just to unlock new arenas and new skins  though for a mere $20, you can buy everything all at once.Well, not everything. You still have to grind your way through the same level countless times in order to max out your crappy starter weaponsunless, of course, you want to spend a few more dollars to instantly upgrade those, too.Unspoken in all of this, of course, is the bigger question of whether you should even want to spend a single cent on Blast Em Bunnies, let alone the $20+ it would cost you to get the full Blast Em Bunnies experience. And quite frankly, I have no idea what would motivate anyone to answer that question in the affirmative. Much like the games cost structure was imported from the dregs of Google Play or the iTunes store, its gameplay is the kind of simplistic, repetitive garbage that barely passes muster on phones these days. You control a bunny shooting at other bunnies, anduhthats it. Hopefully youre not looking to a $20+ game to offer anything in the way of varied gameplay, let alone a plot, because Blast Em Bunnies doesnt have that. Its just the same thing on repeat forever, unless you decide to drop a few dollars here and there, in which case its the same thing on repeat for a slightly shorter amount of time.", "date": "March 24, 2016", "grade": "D-"}