{"name": "This War of Mine: The Little Ones", "ref": "https://gaming-age.com/2016/03/war-mine-little-ones-review-ps4-xbox-one/", "text": "From a purely philosophical point of view, I suppose Im glad This War of Mine: The Little Ones exists. Considering how cheap life tends to be in video games, and how quickly and easily most games tend to elide over the human cost of violence and destruction, its nice to have This War of Mine as a counterpoint. It serves as a harsh, brutal reminder ofwell, how harsh and brutal war can be.From a more realistic point of view, though, I have to admit: theres literally zero chance Ill play this game ever again.Are those two points of view in conflict? Possibly, though Ill do a little eliding myself by saying that, though I think This War of Mine is an Important game, that doesnt mean I think you should rush out and buy it immediately. Or, you know, ever. Its unrelentingly grim and dark, the kind of game thats meant to be endured rather than enjoyed.In fact, This War of Mine seems to exist purely to be an argument for the idea of Games as Art, with Art in this case being a substitute for misery porn. Its as if the games developers looked at how well-regarded media like Requiem for a Dream, Angelas Ashes, Push, and Dancer in the Dark, and decided that video games needed something that was equally bleak and depressing. (Or, alternatively, the cynical view might be that they were a little too inspired by 30 Rocks run of episodes where Tracy wins an Oscar for his role in Hard to Watch.)Because make no mistake: thats all youll get here. This War of Mine wants you to remember at all times how thoroughly awful life is in a war zone, and to that end you spend every moment of your time in the game dealing with that fact. You scrounge through garbage and rubble for supplies. You steal from your equally destitute neighbours. You try to prevent soldiers from raping vulnerable civilians. You try and prevent your protagonists from dying by sniper, or suicide, or easily preventable diseases, or starvation, or any of the myriad other ways people die in war zones. All the while, your chosen characters stare at you from the bottom corner of the screen, looking malnourished and beaten up, and occasionally blinking just to make you feel truly unsettled.Eventually, if youre lucky, a ceasefire miraculously gets declared, though because the game is random theres no way of knowing when or if that will happen. All that you can do is keep scrounging and scrapping and fighting, and hoping you dont die along the way. More likely, though, all your characters will die miserable deaths, and  assuming youre in a particularly masochistic mood  you can start over again from the beginning, without really having gained any knowledge that will help you survive.In this respect, I guess, the game is fairly true to life. And, like I said, This War of Mine deals with subject matter that most games dont touch with a ten-foot pole, so its kind of nice (for lack of a more appropriate term) to see one that rejects Call of Duty-style consequence-free explosions in the name of a more realistic view of the world. It would be pretty ridiculous if This War of Mine was more uplifting or positive, since that would be so contrary to what goes on in war zones. It may not be enjoyable, but neither is what the game is trying to represent.At least, thats the generous view of the game. The more cynical one is that, on some level, This War of Mine is an exercise in cheap edification, a way for everyone involved to say that they get the brutality of war without having to think about any of the real armed conflicts happening in the world right now. Or, to put it more bluntly: This War of Mine is basically the gaming equivalent of Kony 2012.", "date": "March 22, 2016", "grade": "C+"}