{"name": "Volume", "ref": "https://gaming-age.com/2016/03/volume-review-ps-vita-ps4/", "text": "I feel like Volume is a good game that could have been great.Part of this feeling is simply because of my expectations, of course. Mike Bithells last game, Thomas Was Alone, was one of my favourite of 2013, so I went into Volume expecting it to be some world-shaking event. When it wasnt, I couldnt help but feel a little let down.In larger part, though, I feel that way because it is a good-but-not-great game. Volume does a lot of things well and has some cool ideas, but doesnt do any of them so well that its a must-play game the way Thomas Was Alone was.Take the voice acting, for example. While Charlie McDonnell and Danny Wallace both put in exceptional performances here, they arent given nearly enough with which to work. Whereas Thomas Was Alone managed to make you feel sympathy for a bunch of shapes, here the story is told in spurts of dialogue, followed by lengthy silences. You get some of the gaps filled in by notes left throughout the levels, but those, obviously, dont have the same emotional heft that the superlative voice acting performances do.As a result, its difficult to get emotionally invested in the story being told here. While Volumes tale of a plutocratic dictatorship has arguably never been more relevant than it is today, more often than not I felt like the plot dragged, wasting time rehashing the same story beats when it couldve filled in some backstory, or even just let Wallace and McDonnell banter back and forth in the name of character development.This rehashing infects the gameplay, too. While Volume has some interesting ideas and mechanics, it too often feels like the game keeps trying to drill them into you long after any reasonable person will have picked them up and mastered them. To some extent, this may be unavoidable; Volume is committed to being a stealth game, so it seems silly to wish for it to be something more than that. Nonetheless, it wouldve been nice if the game had felt a little less constrained by its genre, and a little more willing to push the envelope.", "date": "March 9, 2016", "grade": "B+"}