{"name": "Into the Stars", "ref": "https://gaming-age.com/2016/03/stars-review-pc/", "text": "Into the Stars from developer Fugitive Games released last week on Steam, after spending a bit of time in Steams Early Access program. Its a game that offers up a pretty unique blend of space exploration and people management, as you captain the last surviving ark of humanity on its journey to reach a new home planet called Titus Nova. The game has drawn a number of comparisons to the ever-popular FTL, but I think Into the Stars certainly does enough to carve out its own space in the sci-fi exploration marketplace.At the onset of the game youre given a few difficulty options. One will allow you to more or less freely explore space, and not have to worry about enemy encounters unless you stumble upon a patrol. Youll only have to worry about picking your six primary crew members, and youll need to manage resources and your on-board populace while traveling to Titus Nova. The real meat of the game, however, is somewhat missed with this easy setting.Jumping into the next difficulty tier, youre getting a more well-rounded experience out of Into the Stars, and it was certainly my preferred way to play. Here you can choose and name your Captain, selecting various static avatars to represent the character. But better yet, you can also outfit your ship with a variety of modules, dictating what resources modules use, how much storage space youll have, and how powerful your starting engines, shields, and weapons can be. This requires you to really be thoughtful on how youll start your journey, and being too dependent on any one resource can be detrimental quickly at the start.Once your journey begins, youll likely be awestruck by how great the galaxy around you looks. While your interaction is generally limited to text screens and two camera views (inside the ship and outside), it doesnt detract from how awesome the various planetoids, rubble, asteroids, and opposing ships tend to look. Seeing a fiery star in the distance expand as you grow closer never gets old. And while it can feel more advantageous at times to view the surroundings using the exterior camera, viewing everything from the interior really captures that Star Trek feeling, as if youre actually sitting at the Captains Chair and commanding a giant star cruiser through the known universe.When you get close enough to another ship or planet, you can start to interact in a few different ways. For planets youll be able to pull together an away team to tackle a few random situations that can result in new modules or other items if youre successful. You can also mine the planet, which puts you in control of a simple mini-game where you guide a drill down through blocks containing various elements. You can also send out a probe that brings back limited resources for your ship. This is about the only weak area in Into the Stars, as these three options will get a little tired as you near the end of your journey. Youll need resources pretty often, and a bit more variety in how you obtain those resources would be nice.The only other option typically comes from trading, which is simple enough. Most of the time youll be trading items at a loss, at a 2:1, 3:1, or 4:1 ratio. I did like that Into the Stars also gives you a more devious option when it comes to trading, which is the ability to trade off your population for resources, which in turn nets you much better gains but at the risk of angering the remaining public.", "date": "March 8, 2016", "grade": "A-"}