{"name": "Digimon Story: Cyber Sleuth", "ref": "https://gaming-age.com/2016/03/digimon-story-cyber-sleuth-review-ps4-ps-vita/", "text": "Ive never had any real affinity for Digimon as a property or franchise. Releasing at the tail end of the 1990s, I was certainly aware of it, but I had little to no interest in checking out the anime, games, or toys that released at that time. So imagine my surprise when I found myself genuinely enjoying my time spent with Digimon Story: Cyber Sleuth, which recently released on PS4 and PS Vita. Playing on PS4, Ive found myself drawn into the world of Digimon in a way thats never happened before, and while it isnt enough to make me retroactively seek out what Ive missed, Ill certainly not be quick to dismiss future Digimon games going forward.So what is Digimon Story: Cyber Sleuth? Its basically a turn-based RPG set against the backdrop of both a digital world, where the titular Digimon reside, and the real-world. Youll primarily spend time in the real-world, advancing the storyline, taking on side quests, and exploring various points on a map that in turn lead to entryways into the digital side of things. Your main character gains an ability early on to jump into online connected devices, allowing him or her to explore various dungeons and hubworlds in the realm of EDEN. As you play, youll unlock more spots within EDEN to explore, furthering your access to new Digimon, bosses, and other characters.As far as RPGs go, Digimon Story: Cyber Sleuth isnt exactly a breath of fresh air. The actual mechanics of dungeon crawling and combat are pretty standard. Dungeon maps are fairly small, with limited branching paths that generally lead to treasure chests containing healing items and other limited use goods. Combat pits your collected Digimon against other Digimon, taking turns dictated by a display on the right hand side of the screen, which lets you plan out your attacks and know when your enemy will attack next.Most fights are pretty trivial, your random encounters against other Digimon require very little thought or effort in order to come out on top. Theres even an auto-battle feature, which youll likely enable after a few hours spent with the game. Boss battles are certainly tougher, but Digimon Story: Cyber Sleuth utilizes an elemental system, meaning that most monsters are weak or strong against one element. Provided you diversify the type of Digimon you collect throughout, youll likely have little trouble against bosses either.That said, despite the mundane battles, Digimon Story: Cyber Sleuth is remarkably addictive. I guess thats where the monster collecting hooks really come in, because while I couldnt be bothered to fight most battles manually, I certainly didnt turn down the opportunity to run around dungeon hallways already explored in order to encounter more monsters. In order to add a monster to your set, you simply need to battle them a certain number of times. Each battle nets a percentage, and when you hit 100%, youll be able to add that Digimon to your existing team. Theres some added incentive for going beyond 100% even, so youll likely need to knock out a fair number of encounters before hitting the 200% max.The collecting doesnt just revolve around battles. Leveling up monsters grants access to new skills, and most monsters have a level cap. This cap can be extended by evolving the Digimon, giving higher level caps and more skills. Another element is de-evolving, which in turn brings them down to a more base form but in turn can give access to newer skills previously not available. You can also position Digimon not being used on a farm, send them out on side quests, and have them gain experience on the side. Certainly the Digimon collecting and building is the highlight here. This might not come as a huge surprise for those already familiar with Digimon (or like-minded games), but I was sort of taken aback at how much I enjoyed this.So all in all, I found Digimon Story: Cyber Sleuth to be pretty darn fun. That fun doesnt necessarily come from the combat side, but there are a few boss bottles that actually require you to pay attention and make use of the elemental weaknesses and strengths. The real fun, however, comes from collecting Digimon and outfitting your roster with new and improved versions. I also generally enjoyed the story elements, even if they are a bit disjointed early on. The real stand out on the story side is the unique types of side-missions, which often seem a bit more thought out than most RPGs.", "date": "March 7, 2016", "grade": "B"}