{"name": "The Walking Dead: Michonne In Too Deep", "ref": "https://gaming-age.com/2016/02/walking-dead-michonne-deep-review-pc-ps4-xbox-one/", "text": "The first episode in Telltales The Walking Dead miniseries revolving around the ever popular character Michonne drops this week on a variety of platforms. And guess what? Its pretty good! Its more Walking Dead, and more Telltale, so provided you like both of those things, i think youll also enjoy this. Its a relatively short look at the character featured on both the TV show and the comic, with my total playtime clocking in at 103 minutes. But its also a pretty satisfying first chapter, giving us glimpses of Michonnes tragic past, and a whole host of new characters to keep track of (and likely watch die in horrible ways).Gameplay-wise, this isnt far removed from other Telltale titles. Youll have a few sections with limited exploration, where you can interact or view objects, and speak to NPCs nearby. The gut of In Too Deep is still focused on the dialogue choices, and your ability to quickly press button prompts when necessary. Its a little unfortunate that Telltale doesnt introduce some sort of unique gameplay mechanic here, but Im also not particularly surprised. Id imagine they want to slot this firmly in with their other Walking Dead releases, so theres probably some need to be consistent across all games.One thing that did stand out to me here is how I reacted to situations and what dialogue I chose when playing as Michonne. In just about every modern Telltale game to date, excluding The Wolf Among Us, the player characters have essentially been a blank slate. Its up to you to build that character how you want, imagine how theyd interact with others, or what their reaction to any given situation would be. As a fan of both the show and comic, Ive been playing In Too Deep differently. Michonne isnt exactly the happiest of characters, for good reasons. She has her moments, and certainly becomes more sociable in later arcs, but my approach here has been more in line with her earlier appearance in the comics. And I like this, because it causes me to play in a way thats different to my normal good guy approach to dialogue options.I dont care if a piss off a companion too much, and my world view as Michonne is a bit more dire than it typically would be. Im also more practical, but not entirely self-serving. And despite the short length of this initial chapter, Ive been given a pretty wide berth of options to approach Michonnes character from different angles, which Ive certainly enjoyed. I think this is literally the first time Ive chosen the silent dialogue option more than once in a Telltale game, and it feels perfect for this particular character. Thats not to say you cant play Michonne as a bit more positive, but Ive really enjoyed trying to keep myself in line with how shes already been established elsewhere.", "date": "February 23, 2016", "grade": "B+"}