{"name": "Far Cry Primal", "ref": "https://gaming-age.com/2016/02/far-cry-primal-review-ps4-xbox-one-pc/", "text": "Ubisofts latest Far Cry release kind of blindsided everyone when its surprise announcement was made in October 2015. It wasnt going to follow the natural progression of Far Cry 4 or bring us back to the world of Far Cry Blood Dragon, it would take us back in time, if you will. Far Cry Primal brings us back to a much simpler time, after the Ice Age. Gone are the use of guns, vehicles and anything else mechanical or electrical. Time to grab your favorite club, make friends with a sabertooth tiger and save your fellow Wenja.Far Cry Primal puts you in the loin cloth of Takkar, a member of the Wenja tribe. After a hunting expedition gets ugly, he is left as the sole survivor to search the savage world of Oros. Tasked with rebuilding the Wenja by any means necessary and take out their rival tribes (Udam and Izila) in the process. Thats all of the story you really need and I managed not to spoil anything (dont expect an incredible story driven experience, after all this is an open world FPS). I should mention my experience with the Far Cry franchise before we dive into the meat and potatoes of the game. Ive played Far Cry Blood Dragon to completion and I really loved my time with it. I also played sprinklings of Far Cry 3 and 4. I probably played a couple hours total for those two, and it wasnt that I didnt enjoy them, it was just that I had other games in the backlog that took priority and I havent made my way back to themyet. So my perspective on Far Cry Primal might be a bit different than some of the other reviewers.Lets talk about some of the immediate similarities from Primal to other Far Cry titles. Despite the removal of guns and other weapons, theres still an upgrade system for weapons. The world of Oros is massive and you can travel all over it on foot, on the back of a tamed beast or via the fast travel system. Youre also tasked with taking over or liberating barn fires and enemy outposts. Lastly, I found the shaman, Tensays, missions to be sometimes similar to the tripped out psychedelic missions of Far Cry 4. Those are some of the immediate similarities I think most players will pick out very early on. Seasoned Far Cry players will pick out more I assume but those are what stood out to me.Building the Wenja people back up may seem like a daunting task, but you have help along the way and almost all of the decisions you make in Oros can help or hinder how well you do at bringing your people back together. Sayla, another Wenja you encounter in the beginning of the game, helps you build a brand new village for the Wenja. As you complete tasks, find Wenja and gather goods the village will grow and populate. Some of the Wenja also have you build them huts within the village (as well as do missions), and building these huts will award you with varying items and experience points. The huts are built using resources you will collect out in the world of Oros and have varying requirements and item scarcities. In my opinion, this is a welcome addition to the world of Far Cry. I really bought in on helping the Wenja people and building up my village. I hope Ubisoft decides to implement these features into future Far Cry titles (especially the inevitable sequel to Blood Dragon). I have a feeling that people will play through Primal with vastly different numbers in Wenja saved and hut upgrades utilized.Lets talk a bit about the in game weapons. Obviously taking place thousands of years ago means you wont have any automatic weapons, but you do have a small selection of weapons at your disposal (bow and arrows, clubs, spears, and a couple more). Based off those weapon examples, you can tell that much of the action is melee in the vain of other FPS titles like Dying Light and Dead Island. I would say if you dont care for FPS games that feature mostly melee action, you might want to steer clear of Primal. Weapons, just like the huts of your village, must be crafted using resources you find out in the open world. The closest thing I can relate this system with is Rise of the Tomb Raider. Weapons and ammunition are crafted on the fly based off the resources you have collected. Upgrades and new weapons are treated exactly the same way. Practically anything and everything in Oros can be collected and is used in some aspect, unlike some of the junk and poor item management of something like Fallout 4.Everything from trees, plants, animal skins, stones, beehives and much more can be collected. I thought that while there can be a lot of varying items to collect, how much you can hold and how to track down required items is incredibly easy and accessible (by pressing the R3 button you enable the Hunter Vision, which highlights objects in the environment). You also have a really cool tool at your disposal in the Reward Stash. The Reward Stash is an item cache that holds items collected by your fellow Wenja and is updated at dusk of every day (the game features night and day situations, more on that later). The best thing about the Reward Stash is that it is accessible in all of the fast travel locations and also at campfire locations. Its safe to say you wont have to travel very far to hit up your Reward Stash, which is definitely a welcome feature considering how large the world of Oros is.As I mentioned earlier, you can travel the world on the backs of some animals. You dont get this ability until later in the game but it all starts with the shaman, Tensay, teaching you to tame certain animals and become a beast master. Taming some of the wild life of Primal and making them a companion to control is some of the most fun I had with the game. Lions and tiger and bears, all mine. Once tamed these beasts and a few others can be summoned to follow you around and also take orders from you. See some enemies in the distance? Send your cave lion to give them a nasty surprise. Need some help in taking out a wolf herd? Call in a bear for some assistance. Along with a companion animal you also have an owl that can be used to scout out areas as well as some other abilities after upgrading. The new level of strategy that you can use to approaching enemies, outposts, and more is just awesome. I loved sending my owl to do some recon work in the sky above an enemy outpost. He could Scan the area to tag the enemies, pin pointing select ones for my companion animal to attack, dropping airborne items and even swooping down to take out an enemy. I could tackle each area with a different approach and it helped from making everything feel repetitive.Now a break from the gameplay Lets talk a little about the in game audio. The animals and environment effects are top notch and just as you would expect. The most unique aspect of the whole game potentially, could be the in game language. Because Primal takes place thousands of years ago, the characters all speak an ancient language which I assume was created just for this game. So the entire game you are relegated to reading subtitles on the screen. While I appreciate Ubisoft trying to make Primal a complete experience and having everything authentic. It took some time to get accustomed to hearing the Wenja speak. While Takkar does speak in the game, he doesnt say much (or anything of substance), which is a problem that some games tend to have with their main character. Some of the side characters, especially Tensay and Wogah, really carry the voiceover work and help save the dialogue from just becoming somewhat useless and annoying.Primal also features day to night transitions, as I mentioned earlier. While this could have been used to just give the appearance of time passing, they use it for a bit more. Certain animals only come out at night and some missions are only accessible during certain points of the day. Also enemies could potentially be sleeping in their outposts at night, making it a good option to strike in the evening. To avoid the annoyance of having to wait out a particular part of day is the option to rest in any of your base camps as well.", "date": "February 22, 2016", "grade": "A-"}