{"name": "Naruto Shippuden: Ultimate Ninja Storm 4", "ref": "https://gaming-age.com/2016/02/naruto-shippuden-ultimate-ninja-storm-4-review-ps4-xbox-one-pc/", "text": "Ive generally enjoyed CyberConnect2s Ultimate Ninja Storm series of Naruto games. And this release, Naruto Shippuden: Ultimate Ninja Storm 4, is no exception. Its packed with characters from the anime/manga series, and wall-to-wall action sequences that are so ridiculous and over-the-top that they demand to be seen. Seriously, while Ive fallen off the Naruto wagon a while ago, Ultimate Ninja Storm 4 makes me want to see if the current manga at least lives up to the level of hype that UNS 4 generates. The story mode is absolutely off the rails for the most part, and I loved just about every second of it.Gameplay isnt remarkably different from the past games in the series. Most of the punching and kicking is done via one button, making it easy enough to string together combos regardless of skill level. You can create variants in your attacks simply by holding an analog stick in a specific direction, and its very easy to use substitution jutsu to warp out of harms way when being pummeled. Naruto isnt what Id call a defensive fighter, but theres a certain level of push and pull to any given fight that adds a neat layer of psychological combat to the affair.The big draw here is the amazing spectacle of specials and finishers. Every character has unique moves that can be performed by loading chakra, done by tapping the assigned face button and then pressing the attack button. Loading chakra once will unleash some sort of special attack, prefaced by a quick animation sequence that generally levels an unsuspecting opponent. More devastating, finisher style attacks are performed by loading chakra twice and then tapping attack, unleashing a larger, more powerful special ability that can be incredibly devastating. This is all kept in check by your chakra meter, which runs out with each special performed, and can generally only be recharged by holding down the chakra button and making yourself temporarily vulnerable.Additional moves are performed with partners, two of which you can take into battle from the large roster of characters. You can either opt to switch and control a partner completely, or call them in for limited use attacks. You can also partner up for finishers, expanding the number of wild moves at your disposal. Again, the controls for all of this mayhem are incredibly simple and easy to learn, making UNS 4 a great fighter for just about anyone.In addition to the story mode, which takes some limited branching paths between Naruto and Sasukes storylines, theres a hefty Adventure mode, and online VS. Both of these are pretty standard for the series at this point. Adventure guides you through a new storyline but allows a bit more freedom, you can move between different areas, explore in a third-person view, and complete side quests for various NPCs. Versus mode is exactly what youd expect, and still suffers from the balancing issues thatve plagued previous Ultimate Ninja Storm entries, but still remains a pretty fun experience with friends.", "date": "February 15, 2016", "grade": "A-"}