{"name": "The Witcher 3: Wild Hunt  Complete Edition", "ref": "https://gaming-age.com/2019/10/the-witcher-3-wild-hunt-complete-edition-review-for-nintendo-switch/", "text": "Lets just take a moment to consider how crazy it is that The Witcher 3 on the Switch is a thing that exists. Not only is it an ambitious game in its own right, with a massive world and a crazy amount of content, its probably even more ambitious to even attempt to shrink it down so that it fits on the Switch. That it runs at all  and takes up 10GB less than its Xbox One and PS4 counterparts to boot  borders on miraculous.Of course, to make it work, certain liberties had to be taken. Everything is more or less here that needs to be, but Im not going to lie: The Witcher 3 on the Switch looks rough, especially if you play it in handheld mode (which I did). Everything looks kind of muddy. The world around you is muted and lacking in detail. In fact, the closer you get to anything the worse it looks.Even worse, there are times where the game doesnt quite work the way its supposed to. I had to restart the tutorial, for example, after the game lost track of where I was, and the text on the screen wasnt matching up with what I needed to do. While that was by far the worst example of The Witcher 3 glitching, smaller problems abound, with people and animals getting stuck in trees and in walls, to trees swaying a little too much in the breeze, to all kinds of other little issues that make it clear this isnt the best possible version of the game.Of course, even a somewhat subpar version of one of the best games of the generation is still pretty darn good. Degraded graphics or not, The Witcher 3 on Switch is jam-packed with content. Its the kind of game where you can roam around with no particular goal in mind, and still stumble across loads of things to do. One moment you can be tracking down a griffin, the next you can be looking for an old ladys frying pan, still another you can try your hand at a game of Gwent. While the sheer volume of content feels a little overwhelming, it does so in the best possible way, with tasks and missions that feel substantive, as opposed to, say, mindless fetch quests where you have to gather X amount of some herb for no real reason.It achieves this by having everything in service of a story. As a newcomer to the series, Ill admit that I was a little hazy on the details, but theres enough here that even people like me will be able to not only follow whats going on, but get invested in Geralts story.To do so, of course, youll have to be willing to overlook that there are more than a few performance issues here, and youll have to be okay with graphics that looknot great, to put it euphemistically. But if you can stick that out  and you really should  youll be rewarded with one of the best games of the past decade. The Witcher 3 on the Switch is a marvel in more ways than one, and if you want a game that you can sink dozens upon dozens of hours into without ever feeling like youre doing the same things over and over again, then look no further because its right here.", "date": "October 18, 2019", "grade": "A-"}