{"name": "The Sinking City", "ref": "https://gaming-age.com/2019/07/the-sinking-city-review-for-ps4-xbox-one-pc/", "text": "The Sinking City may be a brand new IP, but itll look awfully familiar if you ever played any of Frogwares Sherlock Holmes games. In nearly every respect  from the voice acting, to the gameplay, to the graphics  it looks, feels, and plays almost identical to Frogwares take on Sherlock, so, really, if you have any opinion on those games, youll probably feel the same way about this game, too.There are much worse things that could be said about a game  particularly because The Sinking City is more like Crime and Punishments-era Sherlock than the iffier The Devils Daughter Sherlock. The game is built around solving a somewhat engaging mystery, and it doesnt bog the game down in too many gimmicks. The only real difference is that rather than drawing from the mythology created by Sir Arthur Conan Doyle, this game is built around HP Lovecrafts Cthulu Mythos  which, Ill admit, is unfamiliar to me even though this game represents the fourth Lovecraft-based game Ive played in the last year (after Conarium, Call of Cthulu, and Tesla vs Lovecraft, the last of which is kind of a stretch).Thankfully, The Sinking City doesnt require that you go out and read At the Mountains of Madness or The Shadow over Innmouth, though the game takes quite a few cues from the latter. It lays out its story pretty clearly on its own, and even when the game calls on you to make deductions in your Mind Palace, you only need to know things that have already been revealed via the story.Mind you, just as those Sherlock games are the definition of what used to be considered mid-tier, The Sinking City isnt going to wow you. The characters all look more humanoid than human (which, considering some of them are supposed to be fish-human hybrids, isnt entirely a bad thing), the voice acting is stilted, and the writing is wooden. Movements are awkward, and combat is a challenge at the best of times.The worst part of The Sinking City, though, is its open world. Nearly everything looks the same, and even though you can set waypoints, youll constantly be switching over to the map just to find your way. The city also feels oddly sterile  which is an odd way to describe someplace thats partly underwater and so rundown. Everything feels like its there just to fill space; contrast that with the best open worlds, where it feels like youre in the middle of a city that exists independently of you, and you can see the problem. Even if you run into other people, they dont really seem to react, though youll usually get some kind of vocal reaction that sounds piped in out of nowhere.Still, even with those complaints, I wouldnt describe The Sinking City as a bad game, by any means. Much like its Sherlockian predecessors its very much for a niche audience, but if youre part of that niche  and I think I am  itll be a fun way to pass 15-20 hours.", "date": "July 29, 2019", "grade": "B-"}