{"name": "Farming Simulator 16", "ref": "https://gaming-age.com/2016/01/farming-simulator-16-review-ps-vita/", "text": "Historically, Ive been a fan of the Farming Simulator series on the Vita. I was surprised by how much I liked the franchises first handheld entry, and then fully on board with Farming Simulator 14. I may not have been totally clear on what I was doing, admittedly, but I really enjoyed it nonetheless.Im afraid, however, that Farming Simulator 16 is where it ends for me. This is the point at which I look at the fact Im not entirely clear on what Im supposed to be doing with a bit of a side-eye, where the whole heres everything at once, figure it out yourself style of gameplay has me rethinking how much time I want to devote to planting, harvesting and selling various types of grain.Its not that this iteration of the game breaks too much from its predecessors, of course. As in past years, Farming Simulator 16 is all about getting into the rhythms of farm life. You select what crops you want to plant, you till and plow the fields, you take your crops to market, and then you use the money from those sales to start the cycle over again. The only difference this time out is that the game also includes livestock; youre given a herd of sheep from which you get bales of wool to sell, in order to allow you to buy more grains and better farming equipment. Other than that minor addition, though, FM16 basically offers you everything youd get from either the original Vita Farming Simulator or Farming Simulator 14. That means that youre dropped into the world with only a minimal explanation of the controls, but seeing as thats always been the case, its hard to get too worked up over it this time around.So whats my issue with it? On a minor note, the controls feel a little wonky here  as if theyve become a little too responsive, if such a thing is possible. Maybe this should be counted as a criticism of the previous games more than a problem with Farming Simulator 16, but I regularly found myself annoyed with how exacting the game was when when it came to ploughing and tilling the fields. Whereas previous games gave you some leeway in terms of how straight your line had to be, this time out it seems as though the slightest deviation from a rigidly straight path means that youll skip over a tiny piece of land, thereby requiring you to go drive back over that specific spot. That may be realistic  which I suppose is what youre looking for in any simulator-type game  but its incredibly maddening.The broader issue, though, is one of time: time you spend waiting for pretty much everything to happen. Or, to be even more specific, time you spend waiting for crops to grow so you can harvest them, since thats more or less the entire focus of Farming Simulator 16. Absent any control over the speed at which time passes, youre stuck adhering to the games internal clock. And while that clock moves at a slightly faster pace than it does in the real world, that still means you spend a few minutes at regular intervals poised on the edge of a field, waiting for your crops to grow so you can harvest them, sell them, plant some more, and spend more time waiting. Every so often the monotony will be broken up by random quests (which consist of drive to X and do this), but those are very few and very far between.", "date": "January 11, 2016", "grade": "C"}