{"name": "Xenoblade Chronicles X", "ref": "https://gaming-age.com/2015/12/xenoblade-chronicles-x-review-wii-u/", "text": "Where do I start with this game? Xenoblade Chronicles X has so much going on that its almost impossible to pick a starting point, except by saying its totally separate from Xenoblade Chronicles on the Wii. This game is its own beast, and one of the biggest open-world games Ive ever played. Is there such a thing as too much of a good thing? After diving into the world of Xenoblade Chronicles X, one thing has become clear: too much is starting to feel just right.Its easier to start off by saying who Xenoblade Chronicles X isnt for starting with the combat. The game is built like an offline MMO in all the sidequests and free-roaming design of the world, but also with combat based in real-time with cooldown timers. Im not really familiar with MMOs and didnt play Xenoblade Chronicles on the Wii, so it took me a little while to familiarize myself with the pace of the battles. Fighting enemies became second nature once I got the hang of things, but I could see gamers being put off by an MMO-style battle system like the one in Xenoblade Chronicles X.The combat system is actually much deeper than it seems to be. Xenoblade Chronicles X is a really solid effort with gameplay and performance, but one of the few things it isnt great at is teaching how to play it correctly. There are some basic fundamentals that will get you up and running, but a few quick searches on the internet will immediately turn up results that basically say RTFM and it really applies for this game. Like I mentioned before, I had some stumbling points out of the gate with getting used to the MMO-style combat, but once Arts, Skills, and Soul Voices started to become important, I was more or less at a loss.Were used to games that will hold gamers hands to show how everything works, but in Xenoblade Chronicles X there are a lot of things that go unnoticed or arent stressed enough. I managed to get by for a while, but had a lot of unanswered questions like why the B button would pop up with a quicktime event in battles, or why I felt underpowered when fighting enemies lower-leveled than my squad. Thats where the internet came into play, and for your benefit Ill post links to the Official Thread post on NeoGAF and a Reddit FAQ to explain some of the gameplay systems. They explain things in great detail and help provide a better understanding of how the game works in a way that a review cant fully elaborate on.The gist of it is that Xenoblade Chronicles is an open-world sci-fi RPG that allows players to do as they please, exploring the surroundings and surveying the landscape to gather information on the alien planet which mankind has crash-landed on. I forgot to mention it until now, but the plot of the game starts off with mankind escaping earth in a massive space battle that leads to one of the ships landing on an alien planet. After crash-landing, youre put in a character editor that lets you customize your character extensively, and rescued by Elma (a BLADE fighter) who introduces you to New Los Angeles inside the shell of mankinds mothership.From this point, some main quests introduce Lin (an engineer) and the alien Tatsu (a talking potato, according to Lin) who is rescued from another alien race hoping to take over the planet by wiping out all other life. This sets up your basic party and gets things set up to start exploring the planet Mira. Its mostly spoiler territory from that point onward, but the cast of characters is entertaining and the quests have a good pace to them.Players can mine for materials which are used in quests and generate money, discover new landmarks, and choose which enemies to fight based on their threat level and time of day. Planting probes for mining or otherwise will enable fast travel to that location and the same goes for discovering landmarks, so it pays to walk the path less traveled and eventually have quicker access to the massive world.Getting around also becomes much quicker with Skells (the games version of a mech), which can transform between modes to fight, fly, or drive around the landscape. In a nutshell, Skells are awesome. You wont get them immediately or even in the first 10 hours of the game, but after putting enough work into BLADE missions and acquiring a Skell license, the payoff is worth it. Theyre more powerful in combat, make Mira easier to explore, and look awesome. Just for you, Ill drop a gif below as proof:Unlike most RPGs, Xenoblade Chronicles X isnt about a long epic story to save the world. After all, the world is destroyed in the first five minutes. Instead, its a game about exploring the world that Monolith Soft has created and surviving on Mira. You could argue that a lot of RPGs have a similar amount of sidequests and content, but none of them are to the scale that Xenoblade Chronicles X is at. Id compare it to Skyrim but that feels like an understatement of how big Mira is, and with the amount of things to do in every square foot of it.This is one of the first games Ive played in a long time that makes you feel like youre really on a different planet where everything makes sense in its own way. For example, enemies who are aggressive are marked with an eye icon over them to show that theyll initiate a battle if you get too close. This is bad news for exploring areas where enemies are three times your level and can one-shot you if encountered, however their aggression will lessen during the daytime and increase at night. This makes exploring the game early on risky after dark, but still accessible during the day.Using the right equipment and Arts are just as important when going on a mission, since enemies have elemental weaknesses and vulnerable spots. Your squad will lock on to the target in combat, but on closer inspection youll notice the ability to lock on to individual limbs of the enemy which can be destroyed to weaken them or cause certain items to drop after combat. Its a little like Fallout 3/4 in being able to target specific body parts, but goes even further in changing how each enemy is fought since the battles last longer and require more strategy.Characters also have relationships with each other that can be explored in Affinity missions. These missions are like sidequests but more fleshed out than just accepting a mission, and usually have a good payoff or cutscene to add depth to the characters.This is just scratching the surface of Xenoblade Chronicles X since I havent even mentioned the online part of it. Players can join in 32-player missions and play in co-op squads of 4 players to accomplish bigger tasks, meaning that you have the option of playing offline or with friends. This is rewarding in a variety of ways starting with tickets that can be traded in for some rare items to help move quests forward. Ive spent most of my time offline, but had a good experience with what I saw online. When you consider the scope of Xenoblade Chronicles X on its own and then add online play, it feels like Monolith Soft was really trying to cram the kitchen sink onto this disc too.This reminds me that there are about 10GB of data not on the disc. Its content on the eShop thats not DLC necessarily but that can be downloaded in four packs of data to help with load times. This data is included on digital copies of the game, but is highly recommended to be loaded onto a USB drive for gamers with the disc. I didnt find time to test how long load times are without the data pack but load times were more than acceptable when using it.Xenoblade Chronicles X has so much good stuff that its a little tough to find criticisms with it that are the games fault. Some of the music can be really annoying (like in the Administrative Disctrict of New LA) and since youre going to be playing for anywhere from 60-300 hours, thats a lot of time to hear the same songs over and over. Its especially true for the music that sounds out of place or grating. This will be determined by individual opinion but theres no way to adjust the music or its volume. I really would have liked to customize the audio to my liking and its weird that they didnt include an option when comparing it to the highly customizable HUD settings.Some of the quests arent explained clearly either, especially with some side quests. I dont have a problem with looking up information online, but I hate having to stop playing after feeling like Ive wasted an hour on guessing what I should be doing or where to find an item. There will be times where this happens to gamers, and its honestly not worth banging your head against a wall when you could just Google an obscure item to save yourself the trouble.My only other complaint is that its on the Wii U, which is kind of a lame complaint. I already owned the console, but many people who would love Xenoblade Chronicles X may not have a Wii U. There are a lot of great Nintendo games for the console, but not many RPGs and even less third-party software. As far as we know its also near the end of its life-cycle with the NX on the horizon. A part of me also wishes it was a more powerful console when looking at the magic that Monolith Soft has performed on the limits it brings, but I consider this just as much of a compliment to how gorgeous the game is on the Wii U. Every environment feels different and has new forms of alien life that look great at any hour of the in-game day.", "date": "December 31, 2015", "grade": "A"}