{"name": "Yo-kai Watch", "ref": "https://gaming-age.com/2015/12/yo-kai-watch-review-nintendo-3ds/", "text": "2015 saw a great many JRPGs release, whether or not anyone outside the genre noticed, and perhaps with it was finally able to introduce North America to one of the most recent overseas successes. Yo-kai Watch.  Its often compared to Pokmon, sharing a lot of elements that made the original monster-hunting craze so predominant, and even come with its own cartoon series currently partnered with Disney.  While the idea of a Pokmon-killer has fallen out of style, it would be understandable at least to say this is the first competitor poised for a chance at standing on its own two feet in quite a while.And yet its only the first of three games currently released in Japan.  So with a potential sequel likely slated to begin localization, how does Yo-kai Watch stand out from any other kid-friendly monster-hunting game?For starters, its not really a monster-hunting game, and on that note, its genealogy shares less with Pokmon than it does with a more potent series thats found traction over the last few years: Shin Megami Tensei.  Well get to all that later, and for now should finish setting the table.Yo-Kai are spirits in Japanese mythology, taking different shapes and forms with a variety of personalities.  In Yo-Kai Watch, they exist in parallel with humans, and are viewed through devices like, say, a lens on a wristwatch.  This is precisely what players will find in the opening section of the game, where they fill the shoes of a young boy or girl (Nate/Katie according to the show, so well use those names) hunting bugs on summer break.  Shortly into the day, Nate has a run-in with a ghostly Yo-kai named Whisper, a butler of sorts, who introduces him to the unseen world around him by means of the Yo-kai Watch, thereby throwing them into a variety of adventures all directed toward overcoming a greater power looming over the town of Springdale.Just a moment to mention this, but having seen a bit of the game as both Nate and Katie, I was delighted to see dialog variations, as well as changes to each characters bedroom and house layout.  I didnt expect more than a palette swap, but Level-5 put work into making the choice between gender mean more than a different character model and its worth the mention.Springdales setting is almost idyllic in nature, and for someone who gave up on traditional Pokmon a long time ago, a bit of equally mixed fresh air and nostalgia to be running around town solving problems and battling more troublesome Yo-kai.  The nature of Yo-kai is surprisingly dark when considered, a topic which comes up early on with the introduction of Yo-kai cat Jibanyan  the spirit of a cat once hit by a car and now seeking vengeance on traffic.  Of course death is a natural occurrence in life, but the nature of a spirit world will inevitably acknowledge its relationship with mortality, and does so semi-regularly in a game catered towards a younger audience.  Its not only more of a mature aspect, but also just the sort of thing that a lesser localization might alter to be more kid-friendly.  Maybe its just more trouble to write death out of a game about a spirit world, but in an over-safe reality, I like that mature themes are discussed in a way for general audiences to understand.The gameplay is broken down between the overworld and battling Yo-kai, which at times also involves befriending them.  This harkens back to the elements of SMT that were mentioned earlier in more ways than one, as the battle system is a semi-automated affair.  Yo-kai will automatically attack based on their temperaments, and subsequently attitudes (which can be altered or improved by use of items).  This means that at times they may decide to nap a bit in the middle of a fight, or may be highly motivated after a tasty snack.  If you liked the self-operating demons in past SMT games, Yo-kai Watch refers lightly to a system of battle management, rather than delegating specific orders via menus.Your arrangement of whichever six Yo-kai will be fighting takes place on the lower screen on a wheel  allowing for three to be present in battle on the top screen.  Rotating the wheel with the stylus or by means of the shoulder buttons will of course change whos actively battling, useful for quickly swapping in fit Yo-kai before a major attack that may wipe out some wearier ones.  The bottom screen is also where inventory and actions will take place, as special attacks can be issued once a Yo-kais meter is charged, and are executed by way of a primitive minigame on the bottom screen (twirling a wheel, tracing shapes, tapping).  Yo-kai that are cursed can be rejuvenated with the same activity by popping them into inactive states, which means the most interactive parts of the game boil down to a handful of activities more suited for a first-gen DS title.  Theyre perfectly fine for giving players an action-based touch activity thats only around for a few seconds, but after 40 or so hours of playing, youll be doing them in your sleep, possibly sleeping due to seeing them so often.The balance of managing Yo-kai during battle was the one element of Yo-kai Watch that felt somehow imbalanced.  Its a daunting system at first, but at some point becomes tedious in waiting for Yo-kais Soultimate meters to charge while they decide when and how often theyll attack enemies.  Holding X during battles will speed them up, but this doesnt address the core design which would have benefited from some manner of fully automated play as the game drew on.  This is an ongoing issue with JRPGs, as boring battles are the quickest way to lose your audience, and while Yo-kai watch never becomes a bore, it will, at times, feel like a chore.  Im more surprised that with any mechanic Level-5 has lifted from other series, that nothing was implemented to offload repetitive play after a certain point.General progress is broken into Episodes, which revolve around an issue that someone in Springdale is having and Nates ability to sort things out with whatever Yo-kai has instigated things.  Its a nice way of pacing the game, with each episode bringing closure to its respective issue, and allows for transparency as to what players will need to do in order to accomplish goals.  Springdale also runs on a day/night cycle which will trap Nate in Oni Time,  akin to a sort of Midnight Hour scenario where more powerful Yo-kai are hunting him, allowing the player to use this to their advantage by raiding treasure chests or choosing instead to escape.There are plenty of sidequests and a variety of side activities to spend time with, as well, including fishing and bug-hunting (a touch-based minigame on the lower screen) along with running errands for townsfolk.  While the writing isnt half-bad, chasing the sidequest carrot can be a bit grindy at times, especially if your objective relates to an item drop.  Theyre worth it for experience or items, but I would have liked to see more motivation besides leveling up to fight stronger Yo-kai and repeat the cycle.Battling Yo-kai in the wild is a regular affair, with a hot/cold style meter indicating whether one is near, and then locking on with the Yo-kai Watch lens with the touchscreen.  At times, theyll befriend Nate after battle, and upgrading the Watch (by knocking off a checklist of troublesome Yo-kai) will allow more rare Yo-kai to be discovered.  Aside from being in designated areas where Yo-kai roam freely, I like the general approach to discovering them in general, as it gives players the option of combat as opposed to randomized battles.I really enjoyed myself with Yo-kai watch, although more for the setting and small moments, as the targeted younger audience may be limiting some aspects of the battle system.  Theres a ton of content in the game, and a fully-realized 3DS title behind it all.  At some point, I was surprised to see that Nate will actually run around town by directing him via stylus on the touchscreen, which leads me to believe the entire game can be played without buttons.  Nobody even asked for that, but Level-5 didnt stop short of making the game completely playable to suit a variety of people.  Theres even a practical use for 3DS Play Coins in Yo-kai Watchs capsule machine.  Its this sort of effort that reminds us of the effort put into Yo-kai Watch, making it at the very least, a solid recommendation for the system.  When Pokmon arrived on the scene, it was a basic Game Boy title that asked more of our imaginations than it could convey.  Almost a dozen years later, JRPGs have come a long way, and where Pokmon refuses to innovate, cool new projects like Yo-kai watch are arriving, with inspiration from series like SMT to modernize and stylize whats sometimes a very dry genre.  Whats even more exciting (all-well knowing the sequel is complete in Japan) is the potential for Yo-kai watch to have some of its own ideas when approaching turn-based battles, rather than sipping from everyone elses cup.  Its an imperfect game, more of a vacation for JRPG fans, but one Im not the least bit regretful to have played.", "date": "December 31, 2015", "grade": "B+"}