{"name": "Fat Princess Adventures", "ref": "https://gaming-age.com/2015/12/fat-princess-adventures-review-ps4/", "text": "If you enjoyed Fat Princess for the PS3 and PSP, chances are you were excited to hear a new game was coming in the franchise. What you may not expect is that this is not another competitive multiplayer game, but rather a co-op hack and slash fest. Some folks may be scared to try this out since its such a departure from the original games. I can safely say, fear not, as Fat Princess Adventures is just as fun and addicting as the games you are used to, with a few differences.What we have here is a simple hack and slash adventure game set in the world of Fat Princess. Gone are the days of class-based real time strategy gameplay with 32 other players. This has been replaced by a complete action mechanic where you are just slashing your way through nearly countless enemies and collecting everything they drop. Enemies drop new weapons and gear that you can experiment with, along with slices of the series staple item, cake! The cake can refill your life if you are running low, but picking it up when your life is full makes you super fat. When this happens, you attack harder for a short time, but the damage you take is doubled since any armor you are wearing no longer fits. This Fat Power Up only lasts a short time, but can come in handy if used correctly.As you attack enemies you also fill up an Awesome Sauce meter that, when used, will double your attack, defense and speed for a short time. You can also instantly fill this meter by finding bottles of Awesome Sauce from chests or enemy drops. There are classes for your warrior, but are limited to Warrior, Archer, Mage and Engineer this time around. Each class attacks differently and you can switch between them at each checkpoint you make it to, so you can find the class that works best for upcoming situations. Before you begin playing you can customize your character with different faces and hair styles, and different voice types. The voice you choose is fun, since your character will spat one liners as the massacres of enemy armies takes place. Also, the characters will converse with each other in co-op, making for some funny exchanges depending on the voices youve chosen. Speaking of co-op, this is the only multiplayer that Fat Princess Adventures contains.There are no competitive modes to be found here, unless you count scooping up all of the enemy drops before all of your other partners on screen. Also, co-op only allows up to 4 players, way down from the original count of 32, but since this a completely different play mechanic, its excusable. I couldnt imagine having 32 other players on screen at the same time, with the number of enemies that can fill the screen. Online play is very smooth and players should not have any trouble finding teammates to kill things and eat cake with. Of course with a game like this, the action and even the comedy, can get a bit stale after long periods of play. There were times that reaching the next checkpoint seemed tedious, but it should be expected due to the simple concept presented.Controlling your warrior is a breeze for the most part. You can lock on to enemies making it easier to land strikes, but there are times where you will get surrounded and take damage faster than you can face the direction the enemy is in. Players of other hack and slashers like this will understand the difficulty that the controls can present, but overall it does not take long at all to get comfortable with.Visually, you can tell right away that this is the world of Fat Princess, with the cute, storybook look of all of the environments and characters mixed with all of the buckets of blood and destruction from the original. Everything also runs at a smooth frame rate even when you are playing with 4 players with hordes of enemies on the screen. Sound and voice are a perfect fit with characters spouting hilarious dialog all the while listening to the death screams of anything that gets in the way of your sword. It all gels together to present a fun experience when playing.", "date": "December 29, 2015", "grade": "B+"}