{"name": "Devils Third", "ref": "https://gaming-age.com/2015/12/devils-third-review-wii-u/", "text": "I was really hoping to not end the year with a low score, but Tomonobu Itagakis latest has proven otherwise. The chance of this being a good game was slim, due to the long development cycle, changing the game engine after THQs demise (Originally on Darksiders IIs engine and now on Unreal Engine 3.), and the final nail in the coffin was deciding it was a good idea to make Devils Third a Wii U exclusive. Most games that go through delays and changes as significant as this tend tofail. Its a shame,becausethis title had so much hype when THQ first announced it back in 2011.A lot can change in four years, and this game is proof of that. People were excited to see Itagakis first title after leaving Tecmo in 2008. Its a shame that DT is such a departure from what he has done in the past. For one, there was a rumor going around that Nintendo was considering not publishing the game for its North American release after negative early reviews overseas. However, the game was released on the announced date unceremoniously with zero marketing and even less physical copies for retail.Gamestop allegedly only had 420 copies of the title for all their online business and most likely even less in store. For the most part the only way a store had any available was because of previous preorders. This is a pretty bold decision by both Nintendo and Valhalla, considering the game is only available on Wii U. Now, keep in mind that we live in the U.S. and any chance of this being valuable due to the limited stock, the scalpers will come and reap the rewards. As we speak, the cheapest I have seen a physical copy for online is $105 from a third party on Amazon.Remember, this is also available on the eShop for anyone that actually wants to buy and play. (Not many out there, trust me.) So with all this hoopla and strange interest in people playing it because its being crapped on by my fellow reviewers, I need to make a point to state that Im known to play some games deemed bad by many. If you have read my articles, you may remember the rant I wrote about Tony Hawks last train wreck. I needed to make sure I toughed through this game, knowing we werent even getting a review copy from Nintendo. (Yes, I invested money into this game, and no you cant borrow it when Im finished.)My next statement is going to sound a bit contradictory to my opening excerpt, but I will say it anyway. Devils Third isnt a horrible game. It has some decent ideas, and if executed by anyone other than Valhalla and released on more platforms, we could have a very different write-up. The simple reason I didnt give it an F, was because I was able to complete the game and it didnt feel like a chore. Thats a strange reason to be slightly generous on the score, but at the end of the day, I tanked through the game, not caring for the story or extras hidden in each level.Devils Third is a third person action shooter hybrid that has an identity crisis. The main character Ivan is a clich bad ass former Russian terrorist thats locked away in a prison for life. Some stuff happens in the real world while he is rotting away in prison which includes events based on the Kessler Syndrome theory in which debris from artificial satellites created a cascading effect of collisions, destroying all satellites orbiting the earth. This causes chaos across the world and the only one that can stop the people responsible is you guessed it. IVAN!When you first gain control of Ivan, you get a feel for the controls which suffer from some input lag, at least during my run. After an hour or so, I became accustomed to the delay and was able to worry about other issues that plagued the game. For one, the graphics are extremely dated, even for the Wii U. Also, the identity crisis I mentioned before? Yeah, well this is a third person action shooter according to the developer.I can believe that when Im able to use melee weapons to dismember enemies or waste a full clip on a standard soldier because the aiming is atrocious. This is where I had to scratch my head. When you click the Left Trigger, you get a better aiming option. So whats the problem you say? The view is that of an FPS. This means, you will be constantly switching between third and first person views during combat. This gets old fast, and the only way I was able to get though it was to add aim assist. I rarely use this type of support, but this somehow made the game more tolerable.The pacing itself is similar to Itagakis previous games Ninja Gaiden in the sense of being level based with dialog that is mostly confusion and lacks any character development. You have the main antagonist, who was the terrorist Ivan worked with prior to defecting. Some of them could have made the story more interesting, but by the time you meet them, you never see them again. DT feels more like an arcade game that got ported to home consoles and added some extras. Thats it, nothing more nothing less.Unless of course you play multiplayer, which I hear is the best part of this game, and a significant reason some scores were slightly higher. I will not be discussing this aspect of the game. For one, I dont play well with others unless its Dark Souls or Bloodborne. Lastly, I spent enough hours getting through the campaign and have better games that deserve to be played.If somehow, Nintendo thinks due to the price gouging, people want this and they restock it, wait for a price drop. This game is in no way worth $59.99 or even $29.99. This is the type of gamethat the Angry Video Game Nerd would review, shit all over it, then fans would go and buy it up. Dont do that. If you do, we cant be friends. Again, I took one for the team. Youre Welcome.", "date": "December 28, 2015", "grade": "D"}