{"name": "Earth Defense Force 4.1: The Shadow of New Despair", "ref": "https://gaming-age.com/2015/12/earth-defense-force-4-1-shadow-new-despair-review-ps4/", "text": "Has it really been seven plus years since Earth Defense Force was brought to the states? It has, and if you didnt know that, the dialog in the game will remind you, a lot. Whats funny is the timeline referred in the story is based off (2017-2025), which is coincidentally close to our release date in the US to now (2007-2015). EDF is a series of budget titles initially released in Japan on PS2. The first title we received was Earth Defense Force 2017 on the Xbox 360, which ended up garnering a cult following despite mixed reviews.Ive always seen the series as a game I could pop in at any time, and jump right into the arcade style gameplay. The gameplay is easy to pick up and even more fun when played cooperatively. Basically, EDF is effectively a third person shooter that feels like the movie Starship Troopers on crack. You fight hordes of ants, spiders, robots and other crazy sci-fi inspired creatures. As the series progressed, they included more types of characters to play as, that each have significant traits. The original included your standard trooper, and the sequel Insect Armageddon (first title developed outside Japan) introduced futuristic armors including jet packs.EDF 4.1 is a complete reimagining of the PS3/Xbox 360 title Earth Defense Force 2025 complete with improved framerates, HD graphics, and revised missions which includes more NPC soldiers who respond to your commands. You can play split screen local or up to four players online which can make for some insane action on screen. EDF is a game Ive always wanted to try with other players, but to this day, prefer playing solo. I encountered some framefrate drops playing online and it took away from the experience. Local split screen performed better under pressure which made the campaign a bit more enjoyable.Getting to the more exciting levels takes patience and determination, which is a bit of a drag. In the early levels, you focus on eliminating gigantic ants, spiders, and other creepy crawlers as they jump, climb and swing across the buildings. Some of these levels will be tedious and underwhelming. At least the playable character helps change things up. From the beginning, you can play as one of four classes, a Ranger, Wing Diver, who can take to the sky with their jetpack, an Air Raider, who can call in air strike and even vehicles, and the Armored Fencer, which is pretty much the heavy artillery.Once you get about ten to twelve levels deep, you begin to get more variety on the enemy loadout. You begin to fight enormous robots, and huge Kaiju like monsters which is really where the life of EDF is despite the insects being the focal point. In general the premise of this game is simple. Kill everything or survive long enough to complete a mission. You have hundreds of weapons you can unlock by playing through and collecting weapon boxes. You wont know what you have until you finish each level.The graphics are slightly improved with a traditional HD coat of paint. EDF may not look like a PS4 game but its not one that needs to, especially for fans of the series. Fans can appreciate the low Budget Sci Fi B-Movie look simply because its what EDF is known for. The biggest thing that ruins the whole experience? Unbearable dialog that repeats a bit too often. I have put the voice over volume at the bare minimum to hear objectives because hearing soldiers chant EDF, EDF, EDF! over and over was getting tiresome.The voice acting is what you would expect from something the cast of Mystery Science Theater would watch. Its goofy, and at most times utterly useless, yet there is something about it that makes the game what it is. Maybe its because Ive had to approach the game from an editors standpoint that Im being more critical than I used to be on the series.", "date": "December 15, 2015", "grade": "C"}