{"name": "Dynasty Warriors 8 Empires", "ref": "https://gaming-age.com/2015/12/dynasty-warriors-8-empires-review-ps-vita/", "text": "Confession time: I cant really tell all the different Warriors games apart. I mean, I can differentiate the One Piece Pirate Warriors series from the rest of the franchises various offshoots simply by virtue of the fact the stories and characters are completely and utterly insane, but beyond thatDynasty Warriors? Samurai Warriors? Warriors Orochi? Honestly, I have no idea how to tell one from the other. Im sure there are differences  both subtle and otherwise  but I cant for the life of me tell you what they are. That hasnt stopped me from the enjoying them (Ill never say no to hacking and slashing my way through hundreds and hundreds of enemies), but like I said, I have no clue how to tell one from the other.For the most part, Dynasty Warriors 8 Empires doesnt change things up too much. Youre still fighting your way through hundreds, occasionally thousands of enemies. Youre still navigating around the map in the corner, relying on it to tell you how to get from Point A to Point B. And youre still navigating your way through some vague approximation of feudal-era Japan.Sort of.Because that last point is where Dynasty Warriors 8 Empires differs just enough to make the game stand out. Where all the other games seem to tell more of less similar stories (particularly if, like me, your knowledge of Japanese history and lore is pretty much non-existent), this one spends much less time on endless dialogue and interpersonal relationships, and more, as the title implies, on building empires. Forget those scripted palace intrigues and long detours into the political weeds; everything here is presented in a much more straightforward, dialogue-free manner. Months advance, and you get to decide exactly what you want to do and when you want to do it. You want to build a forge? Then you build a forge by going to the correct spot on the building menu and selecting Forge. Want to try for an alliance? Go for it. Want to invade the neighbouring kingdoms at the behest of your emperor, and then turn around and stab him in the back by declaring independence and retaking all that land for yourself? Thats pretty much what this game is all about!This last point plays a particularly large role in explaining why I love the game so much. I feel like it distills the whole Warriors series down to its core elements, and is the better for it  with all due respect to the people who enjoy the stories, I just want to tear through enemy forces, and Empires helps expedite that wish.", "date": "December 14, 2015", "grade": "A-"}