{"name": "The Crew: Wild Run Edition", "ref": "https://gaming-age.com/2015/12/crew-wild-run-edition-review-ps4-xbox-one/", "text": "While not a game that really shook anything up with its release, The Crew was ambitious with its completely open world map and interesting events. Racing across the entire USA in what Ubisoft dubbed aCarPG, the game was met with mixed feelings thanks in part to lackluster gameplay and disappointing appeal. In an attempt to rectify this, Ubisoft has released The Crew: Wild Run Edition in hopes to correct the mistakes made with the original game. Did they succeed? Read on.Fortunately, if you already own The Crew, some of the more welcome updates have already been downloaded in the last game update. The biggest difference is the increase in the visuals. I only had limited time with the original game, but from what I played I can tell that a lot of work went into making the visuals look way better than in the original. However, a new coat of paint wasnt the only new thing implemented, as now there is a dynamic weather system. The original game had neutral weather no matter where you went, so this addition brings a bit more realism. Now when you speed through puddles on the road, your vehicles traction will change and can lead to a devastating crash if youre not careful. Sadly, the weather feature is a bit underused, as much of the game still contains the same neutral weather while you play, with only a few spots having seeing a weather change. When it happens though, its done well.For the most part, the main game and other modes remained unchanged in Wild Run, with the same solo story and somewhat floaty controls. They have stepped up the customizations you can add on and level up for each one of your rides, and the upgrades really do change the way everything handles, but not to any extremes. This new update also brings new vehicles in the form of Monster trucks and Motorcycles. While riding a more supped up bike is fun for a while, the Monster truck is a blast to use no matter what you want to do. I had a great time with these and wasnt even completing missions, just driving around and causing havoc!Since the game is constantly online, you can race against almost anyone that will accept a challenge, or build up a crew to dominate the ranks. It all sounds good on paper, but in reality, its difficult to find anyone playing online. In my travels I only encountered a handful of players. While the solo missions are interesting, the main draw of Wild Run is the new Challenge mode or Summit. These challenges change month to month and offer a wide variety of events like Drifting challenges and doing tricks around huge skate parks. It seems that most of the online community is hanging out here rather than in the main game, so expect some nice competition.While the visuals are a step up from the original game, they are still falling short of games like Need for Speed, Driveclub or Forza Motorsport. Pedestrians still have the same wooden animation, and some of the environments you drive in have strange glitches here and there. Since you are driving so fast through everything, little things like this probably wont catch your eye unless youre looking for them, but every once in a while, they stand out. Even with these little spots, Wild Run actually does look like a PS4 title now when you compare everything to the original.The audio is pretty cool, except for the voice acting which is a little campy. I would have liked some sort of radio station option to select my own tunes, but since most of the game music is either nonexistent or drowned out by the roar of your engine, it would probably be useless. The controls are somewhat tighter this time around but ultimately still feel like your car is floating all over the road. Drifting is still very hard to get right, and taking tight turns will almost always end up in you hitting the wall. The interface is also still pretty bad, especially when setting waypoints, on occasion Ive had waypoints marked on the map only to have them disappear, due to something that happened in the main story, and I was forced to reset them.", "date": "December 9, 2015", "grade": "C+"}