{"name": "Tom Clancys Rainbow Six Siege", "ref": "https://gaming-age.com/2015/12/tom-clancys-rainbow-six-siege-review-ps4-xbox-one-pc/", "text": "Rainbow Six Siege is one of the most nerve-wracking experiences Ive had in an FPS this year. Thats totally meant in a good way though, with Siege offering up a tense, exciting take on the PvP multiplayer formula thats been explored over and over again in the past few months with titles like Halo and Call of Duty. Rainbow Six Siege is something else entirely, not easily compared to anything else released so far this year, and by being unique it makes the game worth checking out, regardless of how exhausted you are with the genre right now.The main draw in Rainbow Six Siege comes from its PvP mode and its cooperative mode Terrorist Hunt. Theres not much in the way of single-player content here, outside of 11 training missions that are surprisingly fleshed out, but lack any standard story or campaign bells and whistles. While the game suggests you unlock a few operators before jumping into the online fray, I think its still just best to start off online. The only real penalty is that you get stuck with a more generic Recruit operator, as opposed to one of the 20 distinct character classes that make up the Attacker and Defender variations of operators.PvP consists of multi-round matches, where teams of 5 players will work together to either attack or defend various positions on various maps. The objectives can vary quite a bit, featuring bomb defusal, hostage rescuing, and more. Attackers win by either completing the objective or eliminating the other team, while defenders win by defeating the other team, or protecting the objective until time runs out. There are no respawns, and no recharging health, with bullets taking off a considerable amount of damage leading to a bleed out state or instant death. Because of this, rounds are typically quick and to the point, making it easy enough to jump in and play a few rounds here and there, or sit down for an extended amount of time without getting bored.Because your health is so precious, it serves you well to work with your team in Rainbow Six Siege. Theres a huge emphasis on teamwork, both in attacking and defending. Most maps feature various breach points, where an enemy team can infiltrate the building by destroying wooden barriers. Theres also various destructible objects in the environment, allowing well-armed teams to destroy floors, ceilings, and walls, offering alternate paths to your objectives.The cooperative mode, Terrorist Hunt, follows a similar formula, but pits you and your team against the A.I. The objectives and maps are basically identical to what youll find in PvP, but the A.I. controlled enemies tend to always outnumber your team, making for some pretty tough battles if you get caught unawares. Again, teamwork and communication is key here, and you wont last long without it. Im not as enthralled with Terrorist Hunt as I am with the versus stuff, but it does offer a decent alternative if youre more intrigued by cooperative play.I have very few complaints when it comes to Rainbow Six Siege. Im not a huge fan of the microtransaction feature, which offers limited boosts purchased using currency for the game thats bought with real-world money. These boosts dont offer competitive improvements, but I feel like theyre in place simply because the leveling system is pretty slow and tedious, and the payouts are minor for completing matches. If you want any real progression early on, these purchasable boosts become more enticing, which just feels sort of sketchy to me.Also, while matchmaking generally works, Ive encountered some network problems post launch. This primarily revolves around finding enemy teams in PvP, which seems to hang up and stall out on occasion. It doesnt happen frequently, but often it wont fix itself and youll need to back out of matchmaking entirely.But, on the plus side, everything looks and runs well. Ive had no real technical issues, and I love the amount of detail put into both the environments and the weapons here. The customization features, which generally revolve around skins for your weapons, are a bit lackluster, but I do like the diversity in the various operators you can unlock. And, above all else, Rainbow Six Siege is a lot of fun to play. Ive played through pretty much every major shooter released this year, and yet Rainbow Six Siege manages to stand out despite the quality releases already put out.", "date": "December 6, 2015", "grade": "B+"}