{"name": "Dragon Fin Soup", "ref": "https://gaming-age.com/2015/11/dragon-fin-soup-review-for-ps-vita-ps4/", "text": "Seeing as Dragon Fin Soup is free for PlayStation Plus members this month, I can see the appeal of grabbing it. Its free! I can practically hear people saying. How bad can it be?To answer to that rhetorical question: very. So bad, certainly, that its not worth the precious space it takes up on your memory card, let alone the time it takes you to download. In short, Dragon Fin Soup is a lousy game that manages the impressive feat of not being worth a price tag of zero dollars and zero cents.Whats surprising about this is that the game actually has a few decent ideas that, in better hands, couldve been kind of neat. The heroine has a personality, for one thing; rather than being your typical blank slate RPG main character, Dragon Fin Soup stars Red Robin, a foul-mouthed alcoholic. Likewise, the game plays with the trope of every box and breakable object containing treasure, dinging you for property damage every time you smash anything.Its important to recognize the in better hands aspect, however, because neither of those interesting ideas are implemented particularly well here. Yes, theres an attempt to make Red Robin a more fleshed out character, but thats undercut significantly when you discover just a few minutes into the game, that shes still essentially an amnesiac without a past. Even worse, though, is that property damage idea, which almost instantly shows why no one ever does it: because its really hard to buy things when your character is thousands of dollars in debt from property damage fines, and the only way to acquire money and goods is through breaking things  which, again, generally costs you more money than youre going to pick up.There are awful design decisions like that greeting you at every turn. Moving Red Robin around with the D-pad is a massive pain, and it only gets worse when you get sucked into a battle  when, as youll quickly discover, theres no way of instantly turning to face your attacker, because why would you want to do that? Instead you get to fiddle with unresponsive controls and flail helplessly as enemies pound away at you, and it only ends when your familiars or party members are able to kill the monsters themselves.At least in those cases, though, you can see your assailants. Its quite possible that Dragon Fin Soup features more hidden enemies who can kill you instantly than every other game Ive ever played. Even in the games earliest levels, its not uncommon for you to be walking around and exploring the map one moment, and then dead an instant later as you get destroyed by some sandworm hiding under a tree.Of course, I dont want to discount the possibility that the enemies were visible on the map, I just couldnt see them because the graphics are so hideously muddy. Whoever decided that the way to convey panic in this game was by making the screen increasingly more difficult to see really shouldve spent a few more minutes thinking about that  or, at the very least, forced to watch all their favourite entertainment through a muddy red lens, because thats what they do to players here.", "date": "November 30, 2015", "grade": "D"}