{"name": "Organ Trail Complete Edition", "ref": "https://gaming-age.com/2015/11/organ-trail-complete-edition-review-for-ps-vita-ps4/", "text": "Thanks a lot, Organ Trail. Up until I started playing you, I had a vague sense of nostalgia for Oregon Trail. I couldnt remember many specifics, but a mention of the game still brought back fond memories of playing it on an Apple II in my kindergarten computer class. Now, though? Now Im dredging up all kinds of apparently repressed memories as I remember the never-ending parade of death and misfortune masquerading as a childrens educational game that was the original Oregon Trail.Freaking cholera.Obviously, Organ Trail is a little different, in that its a game about traveling through a zombie apocalypse, rather than making your way west across an untamed wilderness. Theres a slight feeling that youre seeing the unending zombie craze and the equally-unending fetish for retro games combine into a single massive retro-zombie orgy. But its only a very slight feeling, because once you get beyond the gimmick, you realize that Organ Trail is a pretty outstanding game.Admittedly, because it hews so closely to the original, its hard to determine how much credit for the games outstanding-ness should go to Organ Trails creators, and how much should all the way back to the people who made Oregon Trail in the first place. Theres really not a whole lot differentiating the two, once you get beyond the premise. Organ Trail borrows from its predecessor liberally, from the diseases and injuries that befall your party, to the choices you have to make between speed and supplies, to the animations and graphics that couldve come straight from an old-school Mac, to the fact you can personalize the gravestones of your fallen friends.Of course, I dont think the original Oregon Trail had an endless mode that allowed you to mow down every zombie that got in your way, as Organ Trail does. Nor, apparently, did Organ Trails predecessor feature activities like fishing or scavenging, yet the way theyre included here makes it seem like their omission was a major oversight on the part of the original game.", "date": "November 18, 2015", "grade": "A-"}