{"name": "SOMA", "ref": "https://gaming-age.com/2015/11/soma-review-for-pc-steam/", "text": "Inevitably, technology will reach a point where interactive mediums like video games and VR are remembered fondly as practice towards using something far more sophisticated. Maybe its a chip in our head, or an earbud were always wearing, but most certainly, the goal will be to enhance our lives, and all the work weve done in developing interactive software will have served as countless steps toward something greater than itself. Whatever form our future takes, our fascination with computers is deeply intertwined on a path to some eventuality, or as futurists propose, a singularity.Its the kind of far-future spitballing that science fiction daydreams about, and games like SOMA like to contemplate. What is our relationship with technology? Is it physical? Metaphysical? Is there a point where weve crossed a line, or more accurately, blurred one? Its heady stuff, certainly, but for a game thats focused on these themes, a more immediate question rears its head: Where does all this fit into a horror game?As it turns out, thats a rather tricky question to answer. Its easiest to begin with the plot, perhaps.Its also worth mentioning that once you decide your game is going to have a story, it becomes important for the plot to cohabitate with the general design and mechanics. In SOMAs case, theres not really a good reason for this to be a horror game, but Frictional Games have a horror pedigree and seem intent on starting off on that foot. This is undermined a bit by the games major reveal somewhat early on in the plot, resulting in lopsided spookiness when the latter half is morally contemplative.The tricky part in all this is avoiding any discussion of the games plot, which is why Im giving myself permission to speak freely on that matter. Consider this a warning that open spoilers lie below these words currently.SOMAs gameplay reflects the same mechanics seen in Amnesia before it, with mouse gestures to operate and interact with the world. Items can be inspected individually, sometimes prompting a line or two of dialog, and puzzle-solving will inevitably take place. The lack of information given to players in regards to these puzzles is refreshing, and the games flow guides players to arriving at correct conclusions on their own. Its really one of the strongest suits of SOMA, in that roaming around a previously-inhabited base can be managed by poking around for small bits of information that when glued together with a bit of logic, open doors as they should.Its tough to make players feel any measure of intuition, and a mark of strong design when found in a game. While I never got around to actually playing much of the Amnesia games, the puzzles in SOMA seem too well-constructed for this to be Frictional games first stab at adventure-game puzzle design in first-person space. They do it well, and it fits into the explorative nature of naturally exploring your way around unfamiliar spaces.Id much rather that the game doubled up on puzzles than sharing space with tedious stealth sections where players need to avoid sentries in the form of creatures or machines that plod slowly about their domain. Theres less hide-and-seek than slowly crawling around, although not much in the way of penalties when spotted. Players can take about two hits from an enemy  the first knocking them out, and the second resulting in a game over screen  but the horror elements are all but lost in silly creature design.While the games plot manages to rationalize why robots are stomping around with violent personalities within, it makes for some really dull sections where the game feels more like busywork in waiting out simple enemy AI routines for an opportunity to sneak around and finish the task at hand. With no way of fighting back against the enemies of SOMA, they fall into the annoyances department, and even more accurately should be put in lost-and-found.SOMA is instead concerned more with the character Simon and his unfortunate situation of being more or less dead. Inhabiting the body of a formerly alive crew member is morbid and interesting, but the game is clumsy in revealing that youve literally traveled through time as a brain scan from the relatively current day (as opposed to imagining your situation or whatever ambiguous motivation sat behind holding off on that information) and Simons personality doesnt exactly line up with player actions throughout the game. His conversations with Catherines brain scan are also a great springboard for interesting dialog, but most of it boils down to cliched accusations and ethical dilemmas which arent very well-composed.Players seem expected to somehow form an emotional bond with Catherine, but due to the nature of her existing only at certain terminals, she falls into the background without any meaningful conversations to chew on in the interim. Dialog in The Talos Principles computer terminals were more mind-bending than the objective-based and fluff dialog in SOMA, and they werent even put in the foreground. Instead, we have Simon, whos too fickle to give players a sense for his personality, and Catherine to guide players while simultaneously wrangling the opinionated protagonist who the player is controlling.The interesting story is actually in the periphery, where the before and after are more compelling than the short-lived journey that Simon takes to ensure the survival of an idea. Some of the backstory is revealed in the form of audio logs, regular logs, and computer logs, but the loss of civilization and pursuit to save humanity is one I was always happy to fill in. The game of SOMA, however, tells the tale of two unremarkable characters in charge of the human races ascension toward existential denial, and the creepy robot-infested complex only serves to hamper any good reason for doing so with the likes of them in a place like that.Im proud of SOMA for leaving me with a review that spends more of its time critiquing the plot and themes than the gameplay itself, but I think thats due in part to the lack of gameplay worth discussing, aside from some clever puzzles on occasion. If Frictional Games were able to parallel their unique puzzle design and mouse controls with a games story, theyd really have something special. Theyd have The Swapper, or some similarly affecting title. SOMA instead finds itself torn between different priorities who argue perpetually among themselves.", "date": "November 4, 2015", "grade": "C+"}