{"name": "Saint Seiya: Soldiers Souls", "ref": "https://gaming-age.com/2015/10/saint-seiya-soldiers-souls-review-for-ps4/", "text": "Nearly thirty years ago, Saint Seiya was a manga released in Japan and an animated show shortly after. It was one of the first anime series I was introduced to in the early 90s at comic conventions with my dad. I remember watching plenty of episodes without subtitles, not knowing what was going on, but still enjoyed watching the action. The series has had a cult following for quite some time and with enough demand, we saw numerous video game adaptations on the PS2 and PS3. Most of these were never released outside of Japan and UK.That didnt stop hardcore fans from importing titles. Many years later we finally received a Saint Seiya: Brave Soldiers port on the PS3 in 2013. The reception was mixed, but more on the negative side. In the end, the fans that purchased it for the most part enjoyed it, which in turn would give reason to bring more titles down the line.Here we are in 2015 with a PS4 port of the latest in the series Soldiers Soul. The game is everything you would expect from the series, including 70 playable characters, The Story of Saint Seiya, and online modes. The title includes the original Japanese dialog with English subtitles so be prepared to read a lot during the story mode. One thing to keep in mind with this game is, if you are not someone that follows the series, the story is going to be hard to follow.The plot is confusing to begin with and there is a ton of scenes to watch in between each chapter, which can be tiresome and frustrating. Thankfully you have the ability to skip, but if you plan on doing so then I would just play the stand vs. modes unless you plan on using more than the couple available characters. The combat is arena based and fully 3D movement similar to the previous title and some Dragon Ball Z titles.Each character has a specific moveset accommodating to the appropriate zodiac they correspond to. The controls are simple and easy to master, but its the A.I. that can get the best of you. My experience with the game early on had me dying repeatedly due to the computer spamming the same move throughout the entire match. It felt like playing against someone in Street Fighter that only does Hadoukens. This gets stale fast and it forced me to beat fire with fire. (Literally in some cases)Once I got the hang of the controls, I found my time a bit more enjoyable in the hopes of unlocking the next character. The visuals are vivid and do the series justice. It also runs at a solid 60fps and full 1080p. The graphics dont truly feel current gen, but for this type of game it works just fine.Some of the visual flair you see in the game comes in the form of super moves called Big Bang Attacks. After performing them a couple of times, you will grow tired of the cinematic that is played each time. The last thing that was a big unnecessary, was the continue screen always shows Athena calling out from the DualShock 4 to the fallen player with a non-skippable sequence that requires you to mash the X button in order to build power to continue. Really?", "date": "October 30, 2015", "grade": "C"}