{"name": "Chibi-Robo! Zip Lash", "ref": "https://gaming-age.com/2015/10/chibi-robo-zip-lash-review-for-nintendo-3ds/", "text": "Of all the Nintendo series which have seen a revisitation or spinoff recently, Chibi Robo! Zip-Lash seems like the odd duck of the group. Originally a Gamecube game about a tiny robot who spends his time cleaning up messy apartments and such, Zip-Lash returns in the form of a 2.5D action platformer with some light puzzles in the mix. Its certainly a less niche gameplay model, but like many, I was curious about how the series has decided to gorw since the Nintendo DS game.Turns out that Chibi-Robo still has his trusty cable, ready for action. That, and maybe some cleaning along the way.Its also Chibi-Robos debut on the 3DS, which takes the already basic visuals of Chibi-Robo and seems to boil them down a little more to suit the systems abilities. Theres a lot happening for the little robot, between a genre change, the new hardware, and a new story as well. It almost feels like a reimagining of the series, or at least an effort to try something new with a character Nintendo clearly has a great amount of affection for (going so far as to provide the little guy with in-game costumes and giving him his own amiibo).As far as the gameplay is concerned, its actually pretty snappy. This may not come as a surprise to anyone familiar with Nintendos eye for tight mechanics and a high amount of polish and design, but theres a solid game at Zip-Lashs core. Most of the movement is a lot of jumping and running from left to right, with the ability to attack using Chibi-Robos cable, but levels are scattered with small extension pieces which will allow him to use his Zip Lash ability, charging up a long toss toward far-away enemies or grapple points.In certain instances, it reminds me of other games where swinging around was a big deal, like using Batmans grappling hook on an old Gameboy title, but the Zip-Lash ability is a multipurpose one. For instance, it is a more powerful way of breaking down obstacles, and in others will dispatch enemies in a single shot instead of hitting them several times with a regular attack. Theres also some geometry that comes into play, as Chibi Robos cable can be ricocheted off hard surfaces in order to reach hidden or distant areas.While the Zip Lash concept has a solid foundation, the amount of time it takes to charge up the move seems to be about twice as long as necessary. Game sections are designed around this, which leads to some exciting points where I was hoping the Zip Lash would be ready before taking a fall, but in general play, it felt tedious to wait for the Zip Lash to charge a couple seconds. There also happened to be a couple points where using the cable to fly up from ledges and grapple onto more complicated areas really seemed to tap into the potential it could present as a more engaging means of moving around the world. I was disappointed to find these more fun areas to be rare throughout the game.This turned out to be my overall issue with Chibi-Robo! Zip Lash, in that it ultimately doesnt reach its full potential. There are times where it scratches the surface of being a game that stands on its own two feet, but its mostly a very safe game in its design. Thats not to say that the design is boring, but the invention in Mario platformers, and even the Captain Toad spinoff game, was nowhere to be found here. Instead, gameplay mechanics that Chibi-Robo uses seem to be borrowed from more successful Nintendo series. Rolling around reminds me of Metroid, but feels nimble like Donkey Kong, although it resembles neither due to a lack of overall momentum and precision. Aiming Chibi-Robos cable is reminiscent of throwing eggs as Yoshi, and the grappling hook mechanics can be attributed to a variety of games  you decide which one.The level design also feels uninspired, but all of these issues are minor complaints when there are even stranger choices in the games progression. Rather than naturally going through levels in their numbered order, players are dragged through a roulette wheel of 1-3 which determines how far around a circuit theyll move. This means that if youve just played Stage 2-2 and hit a panel with 2 moves, then youll be playing 2-4. Sounds cool, until it becomes apparent that youre required to play each stage once before a boss fight and being allowed to move to the next world.Oddly, once the worlds are complete, players are allowed to select levels at their own choosing. it sort of undermines whatever game there is in skipping ahead (only to replay levels youve already seen before, if needing to circle back around). Im not sure what the point of this minigame was, as the only purpose it truly serves is to waste players time if theyre trying to see everything once and explore at their leisure after the fact. It was, if anything, the worst part of my experience in Zip Lash, followed closely by the painfully mandatory cutscenes and dialog between actually playing the levels. Players will be hoping to skip the brief animations and chatter after going through it a couple times, but the game has no option to speed up text or to skip the same ship landing sequence that youll have seen at least 42 times by the end of the game.All things considered, the actual gameplay is light and, if only for a bit, interesting. Chibi-Robo! Zip Lashs visuals and audio are both some of Nintendos lesser work, notably the music which seems to have no interest in keeping players engaged. It could be due to a small team, or simply the nature of how things went when developing for the 3DS, but both audio and visual aspects were underwhelming. Ironically, Chibi-Robo himself (along with creatures and bad guys) has the same top-notch animation that Nintendo has become well-known for. Its too bad that the bland worlds hes exploring arent doing anything to support how energetic he is.One other thing to note is that at least once in each world, players get an on-rails level that involves riding a skateboard, being in a submarine, or some other vehicle to mix up all the running and jumping. Aside from the minecart-style levels, these are the clunkiest sections in the entire game. Im not sure whats fun about the excruciating weight of moving a submarine from one point to another, but its not clear that Chibi-Robo! Zip lash had a great idea, either. Luckily, these sections are few and far enough between that I nearly forgot to mention them if not for referring to my notes from playing the game, but its essential in detailing the sort of things that drag down what could have been a much stronger game.", "date": "October 30, 2015", "grade": "B-"}