{"name": "Minecraft: Story Mode The Order of the Stone", "ref": "https://gaming-age.com/2015/10/minecraft-story-mode-the-order-of-the-stone-review-for-pc-xbox-one-ps4/", "text": "You can count me amongst those that were skeptical regarding a story-driven Minecraft game, despite Telltale Games overall excellent track record. its one thing to take a property like The Walking Dead, or Fables, and turn that into a story focused, decision-based episodic experience. But a video game as wildly popular as Minecraft, thats never had a story-focused element based on it before? Well, I had some concerns.However, having finished the first episode in Minecraft: Story Mode, most of those concerns have been laid to rest. While the game certainly emulates a lot of the core Telltale mechanics found in other games, it also encompasses the Minecraft look and feel quite nicely. The musical cues and sound effects are spot on, and theres even some limited crafting spots within this first chapter that follow the exact recipes found in actual Minecraft. And, maybe more amazing to me than it should be, playing through Minecraft: Story Modes first episode has made me really, really want to go back to actual Minecraft again. Just seeing the structures and ideas built within this game has got my creative juices flowing again, so if that was part of the goal for Telltale and Mojang, well, mission accomplished.But how about the actual story in Minecraft: Story Mode? Honestly, its geared towards a younger crowd, so those expecting drama on a Walking Dead or Wolf Among Us scale should keep those expectations in check. The overall story is very light-hearted, featuring a cast of misfits that find themselves embroiled in an unexpected adventure by the end of the episode. But the humor featured works well for all audiences, even if I felt like there were a few references and moments that didnt quite click for me. I think its one of the weaker Telltale stories so far, but its so early in the series that its a little unfair to be overly judgmental at this point.As far as the mechanics go, as I mentioned previously, a lot of the core Telltale concepts are still present. Youll encounter various dialogue choices, some limited QTEs, and occasionally see notifications for how your decisions affect other characters. The more unique aspects of Minecraft: Story Mode come from the crafting component, and also from some limited action moments that have you controlling your character forward and backward, timing sword swings to defeat creepers, zombies, and other foes. These moments help to differentiate Minecraft: Story Mode from other Telltale titles, but is still very much a standard Telltale Games experience.", "date": "October 27, 2015", "grade": "B+"}