{"name": "The Book of Unwritten Tales 2", "ref": "https://gaming-age.com/2015/10/the-book-of-unwritten-tales-2-review-for-ps4-xbox-one/", "text": "Im having a hard time judging The Book of Unwritten Tales 2 for a very simple reason: I never played the first one. Im not much of a PC gamer, you see, and The Book of Unwritten Tales never came to consoles, so Im basically going into the sequel blind.This matters because The Book of Unwritten Tales 2 is big on self-referential humor. Or, at least, I think it is. Absent that broader context, its difficult to understand many of the games jokes, since a lot of them seem to rely on knowing what came earlier in the series. Frequently  particularly in the early going  the game will make reference to some event that apparently happened the first time out, and it relies on your understanding of said event to fill in the blanks on what makes the reference humorous. Seeing as this game falls squarely in the tradition of games like Monkey Island or Grim Fandango, thats a little problematic.Which isnt to say the game isnt funny on its own merits. Like its forebears, The Book of Unwritten Tales 2 is full of snarky asides, sly one-liners and absurd observations that are guaranteed to raise a smile. I dont know that the game necessarily reaches the comedic heights of some of its contemporaries or influences, but its still funny enough to live up to what youd expect from this type of game.And what type of game is that? As the Monkey Island and Grim Fandango references probably told you, its your standard 90s-style point-and-click adventure. Its the kind of game where you have to pick up sunflower seeds early on so that you can hand them over to another character several scenes later, and then use the resulting magic seeds to help make a bird lift a pot of gold, which it then uses to buy you a magical flying creature, which you in turn use to take you on to the next chapter. Calling it convoluted doesnt even begin to describe it  though seeing as thats kind of the point of these games, its probably not even an appropriate adjective, either.As with its sense of humor, however, while it may aspire to be an irreverent take on The Tales of Monkey Island (which was pretty irreverent to begin with, but I digress), its gameplay leaves a little to be desired. Its hard to discern any kind of internal logic at work here  it often feels like the game decided to embrace randomness as a design ethos, which makes it very hard for a newcomer to suss things out. Ill be honest: I had to use a walkthrough for much of the game, since so little of it seemed like it made any sense.", "date": "October 27, 2015", "grade": "B"}