{"name": "Dragon Quest Heroes: The World Trees Woe and the Blight Below", "ref": "https://gaming-age.com/2015/10/dragon-quest-heroes-the-world-trees-woe-and-the-blight-below-review-for-ps4/", "text": "Ive professed my love for musou style games previously on this site, so it might not come as a huge surprise that Ive enjoyed playing through Dragon Quest Heroes: The World Trees Woe and the Blight Below. It might be more surprising to learn that, despite developer Omega Force having a primary hand in creating the game, its not quite Dynasty Warriors with a Dragon Quest skin. Much like 2014s Hyrule Warriors, Dragon Quest Heroes melds its existing license with the hack n slash formula that Omega Force is known for, by adding in equipment, crafting, experience/leveling, and a hefty story mode with plenty of callbacks for long-time DQ fans. The end result is a great-looking, long-lasting blend of RPG/Action (and at times Tower Defense) that really warrants a look.Like other spin-off Warriors titles, Dragon Quest Heroes takes characters and enemies from across the entire Dragon Quest line, with playable versions of fan favorites such as Yangus, Jessica, Bianca, Alena, and more. Each character comes equipped with a unique weapon-type, which in turn complements their play style and abilities. You can swap between characters at will while in battle, taking four characters into a level at once, with three of those four controlled by A.I. Every character feels, looks, and sounds unique, with voice acting that emulates the original work. For those characters that havent been voiced prior, the voice work matches up pretty well with how youd expect them to sound.Battles play out a little differently than other Dynasty Warrior titles, and even from the more recent spin-offs like Hyrule Warriors. In Dragon Quest Heroes, a key component to battles are Monster Medals, dropped from fallen foes. Collecting a medal will allow you to deploy that monster for your team, with certain monsters acting as sentries thatll guard the location theyre deployed to. This mechanic becomes important because a number of quests will see you defending a central point, or multiple locations. Gameplay for these missions focuses on defeating monsters, collecting medals, and then setting friendly monsters down in the oncoming paths of foes. While your monster team is battling it out with enemies, youll be headed towards portals that feed monsters onto those paths, attempting to shut them down permanently.That said, while a great number of quests feature that specific scenario, the variety and layout of levels changes greatly throughout Dragon Quest Heroes. Enough so that despite its repetitive nature, you never really get bored. Of course theres the power trip of cutting down a large number of enemies at once with powerful abilities and spells that helps considerably here, but theres also a surprising amount of challenge and strategy involved, more so than you tend to see in a standard musou title. Theres also a whole lot of story-driven content, with lots of side missions and optional challenges to take on in addition to the numerous main quests youll encounter.Also, Dragon Quest Heroes is a pretty solid looking PS4 title, and the best looking Dragon Quest game to date. Thatll likely be trumped come Dragon Quest XI, but I thought it was great to see series artist Akira Toriyamas work come to life in HD. Also, the soundtrack is filled with memorable Dragon Quest tunes across various entries, right down to sound cues for saving, leveling up, and having new people join your party.", "date": "October 12, 2015", "grade": "A"}