{"name": "Pumped BMX +", "ref": "https://gaming-age.com/2015/10/pumped-bmx-review-for-ps-vita-ps4-xbox-one-wii-u/", "text": "Ive been struggling to come up with anything to say about Pumped BMX + beyond Its Trials, but with BMX. I mean, that pretty much captures everything there is to know about the game. The core gameplay is identical, calling on players to use speed and momentum to pull off bike tricks as they run through a pretty crazy course. Beyond aesthetics, the only real difference is that youre on a BMX bike instead of a motorbike. Your opinions on the Trials franchise will entirely dictate how you feel about this one.So maybe thats all that needs to be said. Pumped BMX + doesnt try to mix things up too much, so why overcomplicate it?At the same time, of course, theres a chance you havent yet played a Trials game. And if you haventwell, first off, you should. Its a great series, and half the systems on which Pumped BMX + is coming out have their own entries in the franchise, so theres no excuse if you have a PS4, Xbox One or PC. Play that first, and then decide if you need more of that in your life.If, however, youre among that cohort of people who have neither played a Trials game nor own one of those systems  that is to say, if youre a Vita, Wii U or PS3 owner looking for a little arcade biking action  then youre in that group of people who really should check this game out. After all, on the Vita at least, its only real competition on that front is Urban Trial Freestyle, and thees no question that Pumped BMX + comes out looking a lot better. The graphics are cleaner and crisper-looking, the challenges are easy to understand, and the controls are so incredibly intuitive youll be pulling off toboggans and 360s before you even finish off the tutorial.In fact, if theres one area where Pumped BMX + might even be compared in a positive light to Trials, its in its controls. The game recognizes that players will want to pull off death-defying feats as quickly as possible, so it seldom makes them too difficult to figure out. Sure, there are some more advanced moves that require a little more dexterity than most people will possess, but for the most part, you get the sense that Pumped BMX + wants you to succeed. And hey, even when you dont, you still get to see some painful-looking ragdoll physics.", "date": "October 8, 2015", "grade": "B"}