{"name": "Metal Gear Solid V: The Phantom Pain", "ref": "https://gaming-age.com/2015/10/metal-gear-solid-v-the-phantom-pain-review-for-ps4-xbox-one-pc/", "text": "When a game opens up with a Midge Ure cover of David Bowies The Man Who Sold the World, you know youre in store for something special.Special is one of the best words to describe my experience with Metal Gear Solid V: The Phantom Pain. Id imagine most of the internet is tired of hearing praise being heaped upon the game at this point, but I cant help it. I absolutely loved my time spent with it.Ill warn you up front: SPOILERS! SPOILERS! SPOILERS! SPOILERS! Im going to talk about a few fairly specific instances in the game over the course of this review, primarily because its been out for a bit, and theres a myriad of other reviews out there that you can refer to without spoilers. This is sort of a personal freedom when it comes to reviewing something well after it releases, and Im going to take some advantage of that here.So againSPOILERS!Ahem.While The Phantom Pain has a pretty strong opening moment, with Big Boss awakening from a coma following the events of Ground Zeroes, the actual gameplay surrounding this moment is just about the only thing that gave me pause. The hospital escape sequence is a slow, plodding, tutorial driven event, wherein a recently comatose Big Boss is guided through a nightmarish hospital attack kicking off The Phantom Pain. There are some interesting moments, such as the seemingly inconsequential character creation prior to the attack, but by and large the gameplay surrounding the opening doesnt give the best first impression.That said, the rest of the game is almost all smooth sailing from that point. Theres a few specific missions I have gripes with, but by and large this is a very cohesive, mechanically sound, remarkably fun video game to play. The idea of an open-world Metal Gear Solid hinted at by Ground Zeroes is fully realized, with two very large areas to explore, complete with main missions, side ops, enemy outposts, hidden blueprints and other surprises, along with some fantastic scenery to enjoy.Speaking strictly on the PS4 version Ive played through, Ive found most of the visuals to be jaw dropping. Theres some repetitive structure layout, but thats few and far between. And while a locale like Afghanistan might not sound visually appealing, theres a lot done with various military structures, ruins and mountains in a sand-filled locale that more than make up for the lack of color. Every creature and human you encounter is well animated, with interesting solider designs centered around the type of equipment theyre currently using (molded in part by the way you play and attack enemies). All in all, The Phantom Pain is visually impressive through and through, and shows off what the Fox Engine can do quite well.Every story mission contains a number of objectives, both main and optional. With the open-world approach, you can generally tackle most missions in a variety of ways. For instance, a number of missions will revolve around destroying armored units or tanks. You can go in guns blazing, equipped with rockets, or you can sneak around and fulton those tanks and APCs, stealing them for Mother Base. Other missions will have you hunting down wandering soldiers from your own employ, which you can track and tranq over and over until you subdue them. Or you can don a cardboard box disguise and patiently wait for the soldier to stumble over to you, saluting and then recognizing you as Big Boss while you send them back to base.Theres a lot of weird little mechanics to uncover, some of which youre likely to miss completely if you dont play around with The Phantom Pain a bit. Certain things, like a tape you can pick up during a mission that features the grunts of a soldier in the midst of a solid bowel movement, might seem like some weird attempt at potty humor by Kojima. But that tape has an actual use, found when hiding inside of a port-a-potty at a military camp, using that tape and playing it over your walkman speakers will actually deter soldiers from looking inside. The Phantom Pain is chalk full of small things like this, which arent even necessary to use, but add additional layers to a game thats already swimming in options.I also enjoyed the odd mission structure, with events like the sniper battle between Big Boss and Quiet. Prior to this mission youll hear tale of a sniper near the Power Plant in the Afghanistan map. One side-op you unlock will actually take you out towards that direction, and when you pass through to an open area full of ruins, itll trigger the Mission 11 cue suddenly, and youll find yourself in the midst of an unexpected boss battle. This fight is one of my favorite moments in the game, echoing the battle with The End in Metal Gear Solid 3 quite nicely.Another favorite is a battle between Big Boss and The Man on Fire, which features multiple ways to bring the fiery monster down and escape, including the destruction of water towers, or using a jeep as a battering ram to send him flying off of a cliff edge. Again, its the options given to the player to approach and tackle various objectives that stand out as exceptional here, offering more variety in story sequences than youll find in other like-minded open-world titles.Of course, not all missions are perfect. One late-game mission features Big Boss and Quiet in what feels like a never ending assault, with multiple armored vehicles, tanks, and soldiers pouring in from all directions. Typically this would be a big, bombastic sequence in other games, where youre given control of some sort of superior firepower to embolden the player, allowing you to blow off some steam in a sequence of mass destruction and mayhem. Instead, youre stuck with limited windows to lay down defenses, which are largely useless, while trying to dodge tank fire thatll kill you in one hit. You have plenty of cover, and can easily play this sequence safely, but it carries on too long and makes poor use of your skills that have been built up to this point late in the game.The rest of Metal Gear Solid V: The Phantom Pain holds up to the high standard set by the gameplay. The soundtrack is fantastic, both the composed tracks unique to the game, and the use of various 80s tunes spread throughout. Im a huge fan of Quiets Theme in particular, which is used to great effect at a few different points. Also, having your A.C.C. come thundering in from the distance to pull you out of a mission while blaring The Final Countdown over its speakers never gets old.And then theres the general story/plot of The Phantom Pain. It is a little hit or miss, but overall I found it pretty enjoyable. The biggest shock to the system comes from the sheer lack of story-driven cutscenes early on, especially compared to something like Metal Gear Solid 4. A lot of information is instead packed into the cassette tapes you can listen to while running around the open-world, which provide a lot of background detail for characters and events. Theres still some wild cutscenes here and there, but they certainly arent in abundance. Chapter 2 of The Phantom Pain gives way for more story, and explains things in greater detail as far as how this game relates to the overall lore of MGS. The ending seems to be fairly decisive, but again, I really enjoyed the twist.", "date": "October 7, 2015", "grade": "A+"}