{"name": "Castle Crashers Remastered", "ref": "https://gaming-age.com/2015/09/castle-crashers-remastered-review-for-xbox-one/", "text": "Of all the remastered games this year, this took me by surprise. Castle Crashers was one of my favorite and earliest Xbox Live Arcade game experiences that helped convince me that online co-op can be great. In Castle Crashers, you have the ability to play single player and off/online co-op as you take control of one of four knights that must save four princesses and a large crystal that were all taken by an evil wizard. Beyond that, Castle Crashers Remastered takes brawlers to a whole new kind of experience.While simple at its forefront, the progression system in Castle Crashers Remastered is well designed and leaves room for going back and replaying with other characters. Each Knight has his own element, which is the focus for the magic usage for each. Outside of the elements, you have your traditional melee weapon that you can find many different varieties throughout the levels. Some are even available to purchase from merchants during your journey.So what has changed since we first visited this vivid and obscure world from creators The Behemoth? Well, you know what they say, if it isnt broke dont fix it. This statement holds true to this game, but they somehow found a way to make the jump to the Xbox One a worthwhile one. For starters, if you previously already owned the original on the Xbox 360, this version is free for you for a limited time. Another plus was they increased the textures by 5 times the amount used in previous releases and they also bumped up the framerate to a solid 60 FPS. That makes for some really gorgeous HD visuals.Going back and playing all over again felt fresh, especially with the time that has passed since I first played it. (7 years ago) Collecting all the weapons, unlocking characters and the awesome animal spirits you found makes for some depth when leveling up and progressing in the story. The animals you find essentially provide your characters some extra buffs, like combat support, or finding hidden items. With all the original content including all DLC as part of the remaster, what else was needed?The major addition to the game is in the form of a new mode. This was a bizarre addition and can be a bit tough to get a grasp of. This mode is called Back of Barbarian and all you have to do is simply jump, dart, move and groove to the music all while staying away from the enemy. It sounds simple until you are faced with the somewhat confusing controls. The D-pad is your central control scheme, but on screen there is a focus on color coordinated boxes which you step on. I found it difficult to keep the colors in sync with the face buttons, which end up not being the same on the D-pad.", "date": "September 24, 2015", "grade": "A+"}