{"name": "Skylanders: SuperChargers", "ref": "https://gaming-age.com/2015/09/skylanders-superchargers-review-for-wii-u-ps4-xbox-one/", "text": "2015 is the year of toys to life games with some stiff competition all around. Between basic forms like Amiibo, to more involved interactives like the upcoming Lego Dimension, it can be difficult to choose the right game. Theyre many things to factor in this type of decision like cost, value, replay, characters, and more. Something I feel Skylanders has always done extremely well is create original new characters with each entry. This years title is no exception to the rule.Skylanders: SuperChargers is the fifth game in the series and just like each year, we are treated to a new overall theme to the game along with brand new Skylanders. For the first time in the series, vehicles are a prominent addition to the gameplay, along with the traditional adventure mode. For those that have never played Skylanders, I will provide a brief synopsis.The evil Kaos is looking to rule the world by any means necessary and the only ones that can stop him and his forces are the Skylanders, elemental guardians in the world of Skylands. You take control of each in the form of little figures that you place on an accessory called the portal of power. This portal brings the toys into the game and allows you to level them up and take your data with you to other portals that someone else has so you can use your character wherever you go.SuperChargers has 20 new characters and 20 vehicles to choose from and also will have trophy and character sets that will allow you to play as the villains of the set. This brings the total amount of toys for this series to over 300 total! For me, it was a reminder of how long I have been supporting the game, as I have been buying figures for my two nephews Casey (6) and Benjamin (12) for several years.With this scenario comes a big question that every parent asks; So what do we do with all of these old ones? Well here is some great news for existing fans and collectors. All of the original toys from Spyros Adventure to Trap Team are all fully compatible and this includes the traps. Some may not work in the same nature but you will get items as a bonus which was done in previous entries. Vehicles have also been introduced in SuperChargers, effectively changing the gameplay in a whole new way. Not only can you control your Skylanders on foot, you now have the option to traverse by Land (one included with starter pack), Sea and Air.When you think about how many new characters have been made for this game, one tends to wonder if you need them in order to use the vehicles. That is where I feel Vicarious Visions shines in the biggest way. They took the time to develop the game with these new features and included legacy compatibility. This simply means, if you have Skylanders, they will be able to drive any vehicle you own. This includes Giants, minis, Swap Force and Trap Team characters. This is what innovation is all about!At its core, the game is an Adventure/Platforming game packed with some other great elements like a card battle feature called SkyStones Overdrive which is a fan favorite. In this side portion of the game you collect cards from fallen enemies and can use them to battle characters throughout the world of Skylands. This is not something I was ever a fan of but this time around found myself playing a game here and there as I progressed in the story.Another section of the game which is new to the series is racing. You are able to compete offline and for the first time in the series also race online. You choose between Land, Sea, and Air vehicles and each race is limited to one style. (You cannot race land vs sea vs air.) My time with racing was a blast and can get extremely competitive. The racing component shows inspiration from Nintendos Mario Kart series with the inclusion of power ups, shortcuts, and sabotages. Online works well and you have the ability to disable the chat on the Wii-U, which is a nice addition since young kids may be playing online.One of the biggest inclusions this year was a partnership with Nintendo to allow two very special characters to become Skylanders (exclusive to the Wii-U, Wii, 3DS.). The chosen two were Donkey Kong, who comes with the Wii U version, and Bowser who will be with the Wii and 3DS versions. Each of them have a unique design and move set to compliment not only the characters themselves, but the world of Skylanders. I think these two were a great choice and think everyone that gets the Wii U version will have a ton of fun as well.The game as a whole is the same version seen on the other consoles with the exception of the Wii and 3DS ones, which were developed by Beenox and is primarily a racer. The Nintendo platform toys will still be compatible with these versions as Bowser comes with both versions.Being someone that has played the games, but not to completion in the past, I found myself more immersed in the world this time around and I think the variety is the reason. The vehicles play a big role in the Adventure mode, which I loved because you have a pretty even amount of on-foot gameplay as well as vehicle combat. The team took the previously known Element Challenges in each level and made them vehicular Star Challenges that actually coincide with the story. I enjoyed this because it was a seamless transition as long as you have the other vehicle styles.", "date": "September 20, 2015", "grade": "A-"}