{"name": "Back to Bed", "ref": "https://gaming-age.com/2015/09/back-to-bed-review-for-ps-vita-ps4-pc/", "text": "If I were to take the lazy route for reviewing Back to Bed, I would just copy last weeks review of The Bridge, substitite in Salvador Dali for every mention of Escher, and call it a day. Because really, were talking about two very, very similar games: both are puzzle games based on the works of surrealist artists that came to PlayStation platforms within the last few weeks. If it werent for the fact one is in colour and the other in black and white, it would probably be impossible to tell them apart.Obviously, I guess, the puzzles are a little different, since The Bridge played out on a flat, 2D plane, whereas Back to Beds world is significantly more three-dimensional. And where gravity guided the main character of The Bridge, in Back to Bed youre controlling a weird little dog person who, in turn, is trying to get a sleeping person (you guessed it) back to bed. Back to Beds world is also more surreal  which makes sense, since Dali is arguably the most well-known surrealist painter ever, whereas Escher drew from other styles.But seriously, these games are weirdly alike.I do find it a little surprising that, out of the two games, Back to Bed is the one whose origins lie in mobile gaming. Actually, to be blunt, the thought of that this game couldve been played on a touchscreen device boggles my mind: it would be incredibly frustrating. Back to Bed requires a annoying degree of precision when it comes to putting down the apples that change the sleepwalkers direction (a sentence that makes much more sense in the context of the game). Its hugely challenging on the Vita, with buttons and thumbsticks, so I cant even imagine how this game wouldve worked on an iDevice.At the same time, its hard not to suspect that Back to Bed intentionally has tough controls to make up for the fact the puzzles themselves arent that hard. Much of the challenge here comes in keeping the dog-person ahead of the sleepwalker; if the controls worked more smoothly, its easy to imagine you could just blow through the 30 levels here without even breaking a sweat.", "date": "September 17, 2015", "grade": "B-"}