{"name": "I am Bread", "ref": "https://gaming-age.com/2015/09/i-am-bread-review-for-ps4/", "text": "When you hear the title, I am Bread, its safe to assume you dont expect a serious game. Having said that, I get the joke, this is a game where you control baked goods. That includes more than just plain old sliced bread, but more on that later. I know everyone has been dying for a game that lets you live the life of a slice of bread, but sadly youre going to have to wait for a better loaf, because I am Bread is just too frustrating to be fun and the novelty wears thin rather quickly.In I am Breads story mode you are tasked with taking a slice of bread and getting it toasted by any means necessary. That includes a toaster, an iron, a space heater and some others. So you take GrootI mean the slice of bread and traverse a given room to find a way to get it toasted. (I named my slice of bread, Groot after the famous Marvel Comics character and his phrase; I am Groot, being so close to the games title.) The bread is controlled using all four of the PS4 controllers shoulder buttons. Each corner of the slice of bread is paired to a shoulder button and this is how you will do 95% of your movement as the sliced bread. The control stick can be used to slightly move, but not effectively enough to be used for all movement. Flipping and flopping with the bread using the shoulder buttons got extremely frustrating for me rather quickly. The bread doesnt just need to move across flat surfaces, but also needs to climb walls and objects. At this point not only did the controls piss me off, but the camera then too became a thorn in my side.Now that we have an understanding of the frustration that is the controls and camera, its time to move on to getting the bread toasted. Trekking through the room to get that bread toasted can be quiet complicated. The bread doesnt have a health bar but rather an edibility bar, once the bar is depleted, you lose. The edibility bar decreases as the bread is on the floor, touching bugs and a some other hazards. I totally get why these things would decrease your edibility bar, but can I ask why your home would have tons of bugs on the counters in the kitchen? I think we have a larger problem than toasting some bread. Why would you eat anything off of your kitchen counters with all these bugs crawling around? I expect the sequel, I am Exterminator, to be announced any day now.There is a slight bit of delightful dough ball goodness in this odd game though. The bonus modes outside of the story can be pretty fun. In these other modes you control some other baked goods. One has you racing around a room going through check points as a bagel, ROLLing all over the place. Control in this mode is not as frustrating as the sliced bread because you are rolling and can primarily use the analog stick. Another bonus mode has you as a baguette and the point of this mode is to cause destruction. Take the baguette and flop it all over the place; destroying plates, glasses, bottles and more. There are also two other bonus modes that didnt really deliver for me. One you are the sliced bread again but this time in a zero gravity situation where you can fly around the room with tiny little boosters on each of your corners (you can image how these controls handled) and in the other youre a cracker searching the room for hidden stinky cheese(no joke necessary). These werent nearly as much fun as the bagel and baguette. While these bonus modes can be more fun to play than the story mode, they are mostly enjoyable in short bursts and get boring pretty quickly.", "date": "September 11, 2015", "grade": "D"}