{"name": "Disney Infinity 3.0: Star Wars Rise Against the Empire Play Set", "ref": "https://gaming-age.com/2015/09/disney-infinity-3-0-star-wars-rise-against-the-empire-play-set-review/", "text": "Star Wars Rise Against the Empire is an additional play set for Disney Infinity 3.0. In it you get the opportunity to play through the original Star Wars trilogy (episodes 4, 5 and 6). When Rise Against the Empire was announced it made me very excited for the latest Disney Infinity; I was cautious with my hype though. Disney Infinity 2.0 was rather lackluster in my opinion. But I can safely say that Rise Against the Empire is an awesome experience and my favorite Disney Infinity play set thus far; that includes the 1.0 and 2.0 play sets. The play set isnt the only area improved, the character controls and gameplay mechanics have been greatly upgraded as well. The controls are much tighter and the gameplay flows much smoother than previous games.Rise Against the Empire gives you an abbreviated run through of the original trilogy but that is not to say it is short by any means. If you are a completist, you will end up putting a good amount of time into this play set. I played around 8 hours so far and I still have side missions to go back and finish. Like the Twilight of the Republic play set, you are given the opportunity to travel to different planets and explore the Star Wars Universe. In Rise Against the Empire you can travel to Tatooine, Hoth, and Endor. Once you arrive at each planet you are dropped off into an open world which you can explore and complete missions. The missions vary a good amount and kept me interested. This was my main disappointment with the Infinity 2.0 play sets. Each mission was repetitive and all together just not very interesting. Even as a huge Marvel fan, it could not keep me interested. While Rise Against the Empire kept me going and still has me coming back for more.Missions can be anything from bringing back together the members of the cantina band, bringing Jabba the Hutt a rare artifact, taking down AT-AT walkers, stealing a AT-ST, and much more. Along with the missions, is a returning feature from Disney Infinity 1.0 which allowed you to construct all new buildings inside the play set. So for example, on Hoth you are going to need to traverse around the snow planet, and by foot just wont do. So you are tasked with constructing a building that will give you access to Tauntauns. Once the building is built you can also customize its color schemes, which are based off of characters from the Star Wars universe. I really liked the inclusion of this feature because it brings a bit of the popular toy box mode and instantly improves the play set. It gives you more ownership over your game knowing that a friend might not have created the same buildings or completed some of the same optional objectives.Another new feature to Rise Against the Empire, as well as the Twilight of the Republic play set, is the ability to use all of the Star Wars universe characters in it. The Marvel play sets of 2.0 were extremely limited by which characters were allowed to join which play set. You will find champion coins scattered across the planets. Once you collect the champion coin for a given character, then you may use that character in Rise Against the Empire. Immediately unlocked for play is Luke, Leia, Han, and Chewbacca. What is still unknown at this point is how the Force Awakens characters will be utilized. There are currently no champion coins in Rise Against the Empire for them and no character icons in any of the menus. I assume they will be added via patch once the play set and characters are released.One other quick bit I wanted to mention was the soundtrack and voice over work. While none of the original voice acting was used, for obvious licensing and royalty reasons, I found the actors they used to be very close to the original cast. The voice actor they used for Luke is the most spot on and very close to Mark Hamill. Everyone else does a pretty serviceable job imitating the original cast, with the exception of Lando, who sounds like a mix of Billy D. Williams and a Jersey shore guido. The soundtrack and sound effects of the original trilogy being used throughout really helps immerse yourself into the game as well. Flying around Endor on a speeder bike, shooting storm troopers with the classic score playing in the background has never been better or more rewarding.", "date": "September 10, 2015", "grade": "A-"}