{"name": "Monster Hunter Rise: Sunbreak", "ref": "https://gaming-age.com/2022/07/monster-hunter-rise-sunbreak-review-for-pc-switch/", "text": "A disclaimer to start this review, so you arent caught unaware: Monster Hunter Rises Sunbreak expansion is a post-end-game DLC. You cannot start this DLC without having finished the entirety of the base games story. If you have not finished the game, purchasing this DLC beforehand will net you no gain, so it is best to wait until actually wrapping up the storyline before grabbing this.Monster Hunter Rise: Sunbreak is well, its more Monster Hunter Rise! It is unashamedly not fixing what isnt broken and delivers you more of what youve loved in the base game. There are several new monsters added and a handful of areas, as well as a new rank worth of gear to work your way through. The Master Rank gear offers a lot of unique new looks and revisions of existing gear, as well as introducing new gear and effects into the midst.The story in Sunbreak isnt superbly enticing in my opinion, and, as with some other games, primarily serves the purpose of just laying the path for an excuse to fight each of these unique monsters. The story is light, as Monster Hunter ever delivers, but more than makes up for it in gameplay. Several new wirebug skills for every weapon have been added in Sunbreak, so you also get a reinvigorated feel to all of your favorite weapons in motion to keep that gameplay fresh.There are plenty of new monsters and subspecies introduced in Sunbreak, with (at least) 4 brand new monsters to the series. There are at least 10 reintroduced monsters from previous games and several new subspecies of existing monsters. Urgent quests will gradually introduce you to these new creatures as you fight through familiar foes. I do want to make note of this, as its one of my favorite changes to the game; they changed the introductions to new monsters. No longer does it start with cheesy poetry to present them to you. The intro cutscenes are now much more cinematic and more interesting overall in my opinion.Overall, Monster Hunter Rise: Sunbreak is just more of what you already know and love from the game. It provides further functionality to existing weapons and some new monsters but makes sure not to change too much. For me, it took about 16 hours to complete the main questline of Sunbreak, but as usual, there are easily hundreds of hours to pump out of the content if you want to. Just dont buy it until youve finished Rises main story.", "date": "July 7, 2022", "grade": "A"}