{"name": "Kid Tripp", "ref": "https://gaming-age.com/2019/07/kid-tripp-review-for-ps-vita-ps4-switch/", "text": "You know how some games inadvertently give away too much with their trophy lists? Kid Tripp would be the opposite of that.Just look at it. Going by some of those trophies  Complete the game without using a continue! Complete the game without losing a life! Complete the game using no more than 1 stone!  you might think it was a somewhat challenging, but ultimately fairly beatable, experience. In reality, its pretty much the exact opposite.See, Kid Tripp is yet another tough-as-nails, retro-tinged platformer. The difference between it, however, and the zillions of other games that could be described in exactly the same way is that Kid Tripp is both absurdly hard, and its trophies are absolutely insane. Like, this is a game where the titular Kid is constantly running, and it calls on you to nail jumps and avoid enemies with impeccable timing. Unfortunately, its hit detection is so precise, that it takes quite a bit of luck to never, ever botch a single jump and never ever lose a life. And to do all that and never have to throw a stone just seems impossible.(To be fair, of course, Ill note that approximately 30% of people who have played the game on the Vita have the Platinum trophy. This may be an indication that Im horrible at the game and missing something very important, or it may indicate that barely anyone has played the game on the Vita and those who have are kind of masochistic. Its probably a little of column A, and little of column B.)If you can overlook trophies and just play Kid Tripp for the heck of it, then you might find it a little more enjoyable. The levels are all fairly short, and even if the enemies provide a significant challenge thanks to the wonky hit detection, its rare that you reach a point where you cant see the way forward. The challenge, of course, is actually doing it, and thats where your tolerance for iffy (but not awful) controls comes in.Which is to say, your enjoyment of Kid Tripp will depend on how much you want your nostalgia catered to, and how steep a challenge you like in your retro platformers. If your answer to both questions is a lot, then youll definitely be in heaven here.", "date": "July 16, 2019", "grade": "B"}