{"name": "Contra Anniversary Collection", "ref": "https://gaming-age.com/2019/07/contra-anniversary-collection-review-for-nintendo-switch-ps4-xbox-one-pc/", "text": "Latest but not last to Konamis classic collections is the Contra Anniversary Collection which is a very good set of Contra games for you to check out. And if youre a fan of Contra or know anything about the games then you might be arguing with people about whether its actually 10 games or less than that with some ports of the same one but hey whats here is here and thats 10 Contra games. Also included are Japanese versions for your enjoyment so lets see how everything turned out!And the good news is that like the Castlevania collection the games were ported by the amazing M2 with very good emulation. These play like youd want so with that out of the way we can talk about the overall package which is pretty good.Switch dockedSwitch handheldMy main complaint is similar also to the Castlevania collection which is that I do not understand why the games wont fill the screen from top to bottom in docked mode and some wont in either docked or handheld. You could call this a minor complaint and if such things dont bother you then even better. But for those looking to fill the screen the only option is with the ugly scanlines which could be nice but make everything just dark. But for this reason I think the games all look best in portable mode on the Switch even though they have no other visual differences between modes. And just like the other Konami collections you get a grand total of TWO screen borders to choose from!This is the strongest on-release collection in terms of content as the Japanese games are included right away unlike the Castlevania Collection which saw them added at the time of this collections release. Another welcome feature is the ability to remap your buttons for titles which dont have the ability in the original game. This was also added to Castlevania but I wonder why neither version didnt go the distance and let you use the overlayed remapping tool on all games.With that said you get a lot of great games from the Arcade originals through their 16-bit days with the never-before re-released Hard Corps that is very welcome. Compared to prices for the cart this collection is worth the price of admission for that alone! We even have Probotector from the PAL regions, so you can kill robots instead of people if you hate robots!One game that feels like it would fit perfectly into this collection is Contra 4 from the DS. And if you think its because the game filled two screens then just look at the aspect ratio of Contra in arcades to see that this should not be a factor. They really could have made this feel like the full package but these are really the only complaints and when it comes to complaining about something that was never planned to be here then that means Im left wanting more and thats always a good thing. Well maybe if they make a part two for the later games there could be a chance!All this means of course that fans of Contra will be very happy with whats on offer and newcomers have a great collection of games to check out at a reasonable price. Not to mention a very enjoyable digital book about the series history which If youve ever wanted to know what all us old gamers have been raving about with these series then its a great way to find out!", "date": "July 16, 2019", "grade": "A-"}