{"name": "Ar nosurge Plus: Ode to an Unborn Star", "ref": "https://gaming-age.com/2015/07/ar-nosurge-plus-ode-to-an-unborn-star-review-for-ps-vita/", "text": "My first time playing Ar nosurge: Ode to an Unborn Star, I went in with no prior knowledge of the Ar Tonelico or Ciel nosurge universe. This was a mistake. I tried reading all the dialogues and cut scenes, but without reading up on the franchises expansive back story none of it made any sense.For the games Vita release  the imaginatively-titled Ar nosurge Plus  I decided to take a different approach. This time around, I figured that rather than trying to piece everything together and understand every little thing that was being said, I figured Id just go along with it all and see how that worked out. Let it all wash over me, and hope that it all eventually made sense.(It probably says something about me that the thought of actually doing all that required reading never crossed my mind.)Thiswell, it didnt work phenomenally well either. As youd expect from a game that has a well-established mythology behind it, theres a lot of detail here to absorb. Even if you dont actively try to remember ever little bit of minutiae, the sheer volume of characters and places means that youre bound to get stuck on all kinds of names and terminology, regardless of how much attention you pay to it all. Not only that, even if you ignore the story completely, theres still a ridiculous amount of reading you have to do just to learn all the different gameplay mechanics. Turn-based battles, Genometrics, item creation and synthesis, Purification, something to do with creating menus at a restaurant: all of these are important (to varying degrees) to getting through Ar nosurge Plus, and all of them have loads upon loads of instructions. In other words, even taking a more laidback approach to the game requires a fair amount of dedication.That said, I did notice a bit of a difference when I paid a little less attention to every single detail. While I cant pretend I understood it all, I got the general idea: theres a religious conflict, there are hostile alien life forms, and you have to fight them using Song Magic. Again, I wouldnt be able to tell you who did what to who, but I at least understood that much. Understanding what was going on made a definite difference for the better.I dont know that it made a huge difference when I was actually playing the game, mind you. The one thing I liked about Ar nosurge on the PS3 was the relatively speedy approach it took to combat; you can only expedite turn-based battles against wave after wave of enemies so much, but then  as now  the game found a way to make it fairly painless. They line up neatly, you build up big combos, they all vanish: its pretty simple, but it works.", "date": "July 30, 2015", "grade": "B"}