{"name": "The Artful Escape", "ref": "https://gaming-age.com/2022/06/the-artful-escape-review-for-switch-ps5-xbox-series-x/", "text": "The Artful Escape is a perfect example of a whole being greater than the sum of its parts. If you were to look at any of its component pieces individually, they wouldnt seem like much, but somehow, when you add them all together, the end result is magic.Take, for example, the fact that its kind of a platformer  except you really only ever move forward, and the jumps arent very difficult. You occasionally bounce or slide, which is neat, but if you judged The Artful Escape by any kind of platformer standards, it wouldnt be very impressive.Likewise, as a music game, its nothing noteworthy. For the most part, you just run across the landscape, holding down the Y button, while your character coaxes all kinds of crazy sounds out of his guitar. There are occasionally sequences where you need to press a few more buttons, but theyre more like a game of memory than what youd associate with most music games.For that matter, as a game about music, The Artful Escape doesnt do anything groundbreaking. Its all about a kid who dreams of breaking free from his folkie heritage (more on that in a moment) and unleashing his inner Hendrix. While it sounds great, its also a sound that couldve been created at any time in the last 55 years or so. If you were to tell me that this music was recorded for Bill & Teds Excellent Adventure (itself, now more than 30-years-old!), I would 100% believe it.And yet, combine these different elements, and you have a game thats a remarkable achievement. To some extent, this is because the game has a solid plot, and its voiced by some excellent voice actors. The Artful Escape is about a young artist, Francis Vendetti, struggling in the shadow of his famous uncle, a Bob Dylan-type folk singer who created a much-revered album. Vendetti feels pressure to follow in his late uncles footsteps, even as he yearns to do something entirely different, musically speaking. While this may sound pretty standard on paper, the characters are brought to life by an outstanding cast that includes the likes of Jason Schwartzman, Carl Weathers, and Lena Headey. Even with those bigger stars, however, the game is carried by Vendettis voice, Michael Johnston, who perfectly captures the insecurity of a young artist trying to find his own identity.It also doesnt hurt that the game looks gorgeous, and has a stellar score. Yes, its all wild guitar noodling, but the way it blends with the vivid colours and bright landscapes is a sight to behold. It may not sound original, and its easy to see where the game could have gone wrong and come off as self-indulgent, but in this context, it comes off as breathtaking.As I said up top, The Artful Escape may not sound like much on paper. Its individual pieces arent anything special. But mix them together, and youve got an amazing creation, and one of the best games of the year.", "date": "June 30, 2022", "grade": "A"}