{"name": "God of War III Remastered", "ref": "https://gaming-age.com/2015/07/god-of-war-iii-remastered-review-for-ps4/", "text": "Remastered. A term commonly used in the video industry as of late. We live in a world where games get re-released or remastered pretty often and some of the games arent even out more than a year. A recent example is the PS3 title The Last of Us. It came out near the end of the console cycle and was then remastered on PS4. Revisiting titles is not always a bad thing as The Last of Us can attest to. God of War III Remastered is the latest title to be given the same treatment.I think its a bit unusual that Sony decided to make the third entry in the series the choice as the first God of War title the PS4 gets. With the PlayStation Now service, you can stream the first two HD releases that were on the PS3. If you are new to the series, I would recommend playing the first two games, because GOW3 starts you in the middle of an already developing story and will be sure to confuse you.Theres a lot to like about GOW3 on both the PS3 and PS4 because its ultimately the same game with the exception of some minor additions. The HD release has been given a photo mode like all other first party titles, where you can take some cool screenshots of all the carnage. The only other notable additions were some texture upgrades and the game running at 1080p and a 60fps framerate which you can see the moment the game starts and rarely has any hiccups.Other than these minor improvements, God of War III Remastered is essentially the same game as it was five years ago, and thats not a bad thing. Any concerns I had about the game were the same from my first time playing it. For starters, the story is lackluster at best, especially for being the conclusion to the trilogy (at the time). The biggest issue that remains intact from the original release is the fixed camera. Nothing is more annoying in this game than having a bunch of enemies corner you so close to the camera that you fall off edges of the level or worse, just get killed.Something that has always drawn me to the series was the weapons. You get several weapons and abilities from fallen gods throughout the story. From the Blades of Athena to the Nemean Cestus, two large lion head shape gauntlets that do serious damage. I enjoyed playing through the story, getting better weapons and decimating the enemies. Another feature is the games puzzles, while usually simple; they are a good way to break up the nonstop bloodfest that is GOW3.Even though Im not a fan of the traditional quick time events in GOW, the smoother framerates make them much more tolerable. The upgraded textures and resolution also help the large scale scenes, like the games introduction, feel even more epic and make the revisit for veterans a worthwhile one.", "date": "July 16, 2015", "grade": "A-"}