{"name": "LEGO Jurassic World", "ref": "https://gaming-age.com/2015/07/lego-jurassic-world-review-for-xbox-one-ps4-wii-u-pc/", "text": "LEGO Jurassic World is roughly the 25th game that developer Travellers Tales has created with the LEGO license, most of which consist of family friendly, co-op enabled adventure games much like this one. With such a large number of titles being released across multiple platforms over the past 10 years, theres a pretty good chance that youve played one of these LEGO titles yourself.As the series has aged, more mechanics and features have been implemented that expand the overall enjoyability of the series for those of us that have played multiple entries. But theres almost always a point where the series seems to fall stagnant to some degree before becoming revitalized. LEGO Jurassic World isnt quite to that point, but considering LEGO Avengers and LEGO Dimensions are right around the corner, I really, strongly hope that Travellers Tales is holding back some more interesting innovations for those future releases.LEGO Jurassic World isnt a bad game, not by any means, but from a game mechanics angle its certainly well-tread territory. The gameplay consists of switching between multiple characters taken from the Jurassic Park and World license, revisiting highlight moments across all four films, destroying every breakable LEGO object across dozens of stages, and using the collected LEGO studs to buy new characters.Theres hidden gold bricks and other objects, and some form of replayability due to the new characters you unlock. Those characters may come equipped with a special ability you might not have had access to on previous stages, so youll revisit those stages to unlock new areas and discover hidden collectibles. None of this is any different than the majority of the LEGO adventure titles Travellers Tales has produced thus far, and these basic gameplay tenets have been refined over the years to the point that it would be difficult for Travellers Tales to screw up the formula.Despite the overall repetition and familiarity, its hard to deny the enjoyment smashing bricks and collecting items can bring. Even now, having played most of their LEGO library, I still feel compelled to see each and every release to the end, and LEGO Jurassic World is no different. Some of that is thanks in part to the license being used, but the gameplay is also pretty enjoyable, more so if you can bring a friend along for the ride with local co-op. Your mileage may vary depending on how tired you are with the LEGO formula, but if you enjoy both LEGO titles and Jurassic Park/World, I think theres enough here to keep you interested.My only serious complaint this time around is that the spliced in clips of voice acting from the films feels strange here. Around the time of LEGO Batman 2, Travellers Tales began to intro voice acting into their games. For the non-film properties, the majority of the voice acting was unique to the game. But film-based properties have generally used either voice clips, or a mix of voice clips and new material. LEGO Jurassic World does this to some degree. Owen Grady, the character played by Chris Pratt in World, has some one-liners and other comments that seem to be unique to the game. But every time a voice clip from one of the films is piped in, its super noticeable, and the sound quality is sort of at odds with the soundtrack or other voices. Its jarring, quite frankly, and sounds somewhat poor on the Xbox One version Im reviewing here. I doubt that its a system specific issue though, and its an unfortunate mark against a game that otherwise sounds fine.", "date": "July 3, 2015", "grade": "B"}