{"name": "Disney Infinity 2.0", "ref": "https://gaming-age.com/2015/07/disney-infinity-2-0-for-ps-vita/", "text": "I went into Disney Infinity 2.0 on the Vita with no prior experience with the franchise. In fact, if Im being totally honest, the whole game-related toy craze of recent years has completely passed me by: not only is the included Black Suit Spider-man toy my first Disney Infinity figurine, I dont have any Skylanders figures, and my Amiibo collection stands at precisely zero.Now that Ive played it, though, I get. Kind of. I mean, Im not about to run out and start a collection or anything, but its sort of like a slightly less obnoxious version of DLC, in that youre paying more for more content  but on the upside, you also get a nifty little action figure out of it. From the perspective of both the toy-sellers and the gamers, it makes a certain kind of sense.Or, at least, it does in a broad sense. On the Vita, Im a little less certain about its utility. For starters, for a handheld system, its not exactly portable. You cant really whip out the base and plop down the figurines and the discs on the bus and start playing, unless you want them to go flying at the first bump. I dont understand why they didnt take a page from the iOS version of the game and just make it a virtual base instead of a real, physical one, butwell, presumably there are reasons for that.Of course, the real issue with Disney Infinity 2.0s Vita port isnt its lack of portability (since Im sure that if people want to bring the game with them on the go, theyll find a way), its the speed at which everything seems to move. Load times are interminable, and youll constantly be waiting for quite some time every time you try to start a new level. Admittedly, once youve started a level, youll almost never have to sit through any loading screens (possibly none, if memory serves correctly, but I could be wrong about that), but its still pretty agonizing to sit and watch the progress bar move slowly across the screen. And even once youre in, theres a bit of an input lag; I regularly found myself accounting for the extra seconds it seemed to take between pressing a button and having the game recognize it. Its obvious enough to be a little frustrating, but never to the point of being genuinely game-breaking. In other words, its an annoyance, but one you come to accept as the price of playing the game.Youll also have to be willing to expect graphics that vary enormously in quality. Sometimes, it looks like youre getting scenes that look like they belong on a 3DS on its worst days  which means, of course, that they look pretty crummy on the Vita. At other times, however, Disney Infinity 2.0 looks absolutely fantastic, like an extremely well-made superhero cartoon. It varies enough that its hard to recommend one way or the other, but, as with the input lag, its one of those things that seems to be the price of doing business.And I have to say: its kind of a price worth paying. Even if you set aside that whole toy-buying hook, theres plenty in Disney Infinity 2.0 to keep you occupied for a long time, regardless of whether you buy extra figures or game discs. Not only do you have a couple of pretty decently-sized missions included with the game, you also have the whole toy box thing to play with, which means that the only real limit is your imagination. Admittedly, for someone like me who doesnt have much of an imagination when it comes to world-building in games, thats not a huge draw, but it still offers plenty to play with if youre so inclined.", "date": "July 1, 2015", "grade": "B-"}