{"name": "Clue: The Classic Mystery Game", "ref": "https://gaming-age.com/2019/07/clue-the-classic-mystery-game-review-for-nintendo-switch/", "text": "Its been a long, long time since I last played Clue. Like, its quite possible were talking decades here. As such, as soon as Clue (sorry, Clue: The Classic Mystery Game) arrived on the Switch, I was eager to give it a chance to see whether it lived up to my memories  or whether I was looking back at the game with some Madeline Kahn-assisted nostalgia goggles.Im pleased to say that Clue on the Switch is mostly exactly as I remember it. While my recollection of the rules is a little foggy, everything that I remember being in the board game has made the transition to the electronic game, up to and including a little notepad on which you can keep track of everything. Theres some kind of point system that doesnt make a whole lot of sense, but if you can look beyond that and just focus on experience, you should be okay.In fact, if youre like me and havent played Clue in forever, you may be pleasantly surprised by the number of options you have here. This game doesnt just feature the usual cast of characters (Professor Plum, Miss Scarlett, etc.) traipsing around the usual mansion (with a ballroom, a conservatory, and so on). This version features a bunch of different boards (like The Wild West and Hollywood Studio), each with their own unique rooms (i.e. the Hollywood Studio includes a cinema, a prop room, and a directors office). The character names are mostly the same, but they each have costumes and tweaks that make them more suited to the new locations. On top of that, you can mix and match your characters, so your choice of board doesnt restrict who you can play with.That said, Clue isnt without its flaws. For starters, at $30, its a little expensive, especially considering a) not all of its boards come unlocked at that price, and b) this is just the straightforward board game, with little in the way of replay value unless you want to play the same game over and over again.Ill also note that local multiplayer here relies on downloading an app. Thats not the worst thing in the world  Ticket to Ride on PS4 had the same thing, plus I dont know how else you could have multiplayer without showing everyone else your cards  but it still feels a little odd, especially when Jackbox Party Packs simply send you off to their website.Those complaints aside, Clue delivers exactly what it promises: the classic board game, ported to your Switch. Its not going to make you re-examine your feelings towards Clue or anything, but if you just want to play the game on the go (and you dont want to bother with all the little game pieces), itll do the trick.", "date": "July 10, 2019", "grade": "B-"}