{"name": "Portal Pinball for Zen Pinball 2, Pinball FX2", "ref": "https://gaming-age.com/2015/06/portal-pinball-for-zen-pinball-2-pinball-fx2-review/", "text": "If youve been living under a rock since 2007, you may have never heard of the Portal franchise. Portal and its successful sequel are original puzzle games by Valve that challenged players to solve puzzles and traps using Portal technology while being accosted by a homicidal A.I. computer. With Portal 2, the quirky puzzle adventure series came to a close and fans were left wanting more. So, Zen Studios has stepped in, and while they havent brought another complete Portal experience, they have brought us a fantastic Pinball table based on the franchise!As with all Zen Pinball/Pinball FX2 tables, you are guaranteed to get a true to life Pinball experience without having a real table in your house. However, unlike a real table, Zen Pinball can add great animations throughout the table, and the Portal table is no exception. From the moment you launch the ball, you are thrust back into the world of Portal, with psychotic GLaDOS watching your every flipper move. Portal 2s Wheatley also makes an appearance and provides some fantastic comedy (and some nice jabs) as you play. The play field is designed to look exactly like the settings in the Portal games, complete with turrets, companion cubes and even secret alleyways that can open up mini high scoring areas like the Ratmans chamber. Sometimes you can even shoot the ball into open portals and emerge at a different part of the table, so your reflexes will be tested often.The graphics are just what you should expect from Zen Studios. As with their other tables, you get perfect renditions of the characters and settings with an excellent soundtrack that is reminiscent of the original Aperture Science adventures. The only omission that I have noticed is that there are no quotes or assets from Portal 2s Cave Johnson which by far was one of the funniest things I remember from playing that game. There is so much to uncover in this table that good ol Cave might actually make an appearance, (since many Portal 2 elements are present) but after playing for a while I never came across him. My pinball skills might need a little work.", "date": "June 2, 2015", "grade": "A"}