{"name": "Splatoon", "ref": "https://gaming-age.com/2015/06/splatoon-review-for-wii-u/", "text": "My time with Splatoon wasnt what I expected. When the game was first unveiled, I didnt have any interest. First and foremost Im not a huge fan of online multiplayer unless it is co-op and story centric. Also, I wasnt sold on the idea of it being like paintball style games with the different colors. Then it hit me, this is a Nintendo first party title. I needed to give it a shot. Once I did, I was pleasantly surprised.The premise of Splatoon is pretty straight forward. One hundredyears prior to Splatoon, there was a war between the Inklings and the evil Octarians. You will learn the lore of the game from playing the Hero mode (single player) which I will touch on later. You play as an Inkling kid (male or female), and the Inkling you choose can be customized and later upgraded through progressing in the multiplayer portion of the game.The multiplayer component in Splatoon is the main factor in this release and as of this writing not all of the maps and matches were available. Matches are turf wars, and your team colors change each match. Each team has four players and your goal is to use your ink weapon and cover the map with as much of your teams color within the three minute time limit. The matches are not focused on shooting the other team like in traditional shooters, however attacking them is still welcome since you will end up having the opposing team covering your tracks and eventually try to do the same to you.As you continue to play online you will level up and be able to upgrade your character and purchase new weapons. Your upgrades coming in the form of clothing that include hats, glasses, shirts, and shoes that you get from different stores in the central hub called Inkopolis. Each item has a different attribute that will give your Inkling upgrades like respawning quicker or reload ink faster. In order to purchase the upgrades, you need to reach level 4 online and have enough currency.The other items you will purchase are your weapons. When you start the game, you are given a basic automatic ink gun, but you will stop using that once you level up because some of the weapons you can buy are just awesome and extremely creative. One that stuck out for me was the paint roller. The paint roller gives you a much wider radius for painting the level and can also be used to roll over your opposing team. The most clever design for this weapon to me was you can tap the shoot button and you will flick the roller and it acts as a shotgun type of attack which is very useful for hard to reach platforms and walls.Splatoons central hub (Inkopolis) is where you will access all the different modes of the game, and it also serves as the miiverse of the game. Here you can communicate via messages and share your art with other players. The game lacks voice chat, and in my opinion was a good choice. I only say this because we live in an age where trash talk is more common than regular chat. The fact that the game is for all ages also make it a challenge because you dont want young children to hear grown men talking inappropriately. The game works well without it.Of course, I spent most of my time on Hero mode. The campaign is pretty short clocking in at around 6 hours and has you saving zapfish from the Octarians. In each section of the level you need to save a certain amount of zapfish before facing a boss and getting to the next section. While being very short, I understand that this was not the focus of the game, yet I still found myself having fun with it. I would say the campaign is an extended tutorial of sorts and gives you the opportunity to get familiar with the unique control scheme and premise of the game.The controls took a little time to get used to, but once you get the hang of them it becomes pretty seamless. A really cool feature in Splatoon isthe ability to become a squid and travel in through the ink you place in the level. This comes in very handy with the hard to reach platforms since your Inkling doesnt jump very high in human form. When you paint a floor and connect it to a wall and platform, you can then change into a squid and get there with ease. This also works great for jumping from platform to platform, because when in squid form, you can jump farther into another ink pool.The last feature Ill briefly touch on is the amiibo integration. Nintendo created three specific amiibos for this release; the Inkling boy, girl, and the squid form. The amiibo can be purchased in a three pack for about $34.99, which is the only way to get the squid or you can get the Inkling boy and/or girl individually for about $12.99.The integration is limited but useful if you want to get some upgrades early for multiplayer, and I picked up the Inkling boy to give it a try. When you add him to the game, you are given challenges using a specific weapon in the campaign levels. In order to complete them all you will need to finish Hero mode. Each upgrade is awarded by finishing three levels, and once you complete all the challenges, you will be awarded with a samurai outfit and a unique paint roller weapon all exclusive to the amiibo. It was nice to have to earn the equipment instead of simply providing it with the touch of the amiibo.", "date": "June 1, 2015", "grade": "B+"}