{"name": "Sonic Origins", "ref": "https://gaming-age.com/2022/06/sonic-origins-review-for-switch/", "text": "Honestly, pretty much everything I wrote about the PS5 version of Sonic Origins also goes for the Switch version. Theyre the same game, after all  and, thankfully, the Switch version seems to perform just as well, in case that was your biggest worry.(I mean, that should be expected, seeing as were talking about 30-year-old games. Remastered versions of 30-year-old games, admittedly, but theyre still the flashy, fast-moving 2D platformers so many people will remember from their youth.)That said, there are a few things I should mention here that I forgot to highlight in that other review. For starters, one of the neatest things about the Anniversary Mode  where you really see the remastered versions shine, and the package attempts to form all four games into one cohesive story  is that youre not just restricted to playing as Sonic, you can also play as Tails or Knuckles. Not only does it look bizarre (since, after all, youre watching these other characters rush through the iconic levels, instead of the usual blue blur), if you play with Tails it feels like a different game. Maybe it was just my imagination, but it felt like he was moving more slowly  and seeing as the whole point of Sonic is to go as fast as possible, thats a pretty big departure. It changed how you play the game, which is a pretty interesting way to approach levels that have been around for so long.The other thing, unfortunately, is less positive: unless youre really keen on seeing these classic games recontextualized like that, the value proposition of playing Sonic Origins over, say, the SEGA Genesis Classics collection is harder to see. While the Anniversary mode and the remastered graphics are undoubtedly interesting if youre looking for a new spin (pun not intended) on these games, if you dont care about those things, then its really just a couple of classic platformers getting another re-release. Still, given the enduring popularity of Sonic over the years  even with a couple of missteps along the way  it seems like there are plenty of people who will value getting a chance to play these games with fresh eyes and from a different perspective. If youre one of those people, then Sonic Origins absolutely makes it worthwhile to revisit these classics.", "date": "June 28, 2022", "grade": "A-"}