{"name": "Final Fantasy X|X-2 HD Remaster", "ref": "https://gaming-age.com/2015/05/final-fantasy-xx-2-hd-remaster-review-for-ps4/", "text": "So its only been a little over a year since I reviewed Final Fantasy X|X-2 HD Remaster on PS3, and I dont have much to really add on the base experience for either game. Theyre both a lot of fun, hold up surprisingly well, and are remarkably different experiences from one another. If its been some time since youve played a Final Fantasy anything, I think this package of two excellent entries in the series is worth picking up.Obviously, the biggest question in regards to this PS4 version of the game, is how much of an upgrade are we talking here? The PS3 HD set already looked pretty great, with some clear work being done on the environment and character models throughout the game. But yes, there was still some muddy texture work present, and like most HD collections, it was clear that both games originated on older hardware.Thats still somewhat the case here. Nobody is going to mistake either Final Fantasy X or X-2 as modern games on PS4. But as much as the PS3 version of this collection managed to improve upon the original visually, the PS4 version tweaks those improvements just a bit further. The big standouts this time are the improvements to various NPCs and monsters, which will be pretty noticeable to just about anyone playing. The NPCs arent improved across the board, but its easy enough to compare screens between versions and see things like finger definition that werent present in the PS3 version of the game. Granted, these arent huge improvements, but theyre improvements nonetheless.Also worth noting is the inclusion of the original soundtrack for Final Fantasy X, which was removed in favor of the remastered tracks on PS3. You have both versions present on PS4, and can switch between them via the in-game menu whenever you want. Of course, all the additional content found in the PS3 collection is still present here, which serves to provide an additional epilogue to Final Fantasy X-2 and bridge the gap between Final Fantasy X and X-2. If youre looking for a more technical analysis than what Im able to deliver, Id urge you to check out the Digital Foundry breakdown over at Eurogamer, which gives you some good visual markers for what the PS4 version brings to the table.Of course, Id be remiss to point out that there are a couple issues with this version of the collection unfortunately. One of which, the fixed RNG, is something that may or may not impact your enjoyment of the game depending on how you tend to tackle games like Final Fantasy X. RNG, for those unfamiliar, is the random number generator that dictates when attacks land, how much damage a hit does, and a kajillion other things within the game thats based on random numbers. Generally, with most games, this is randomized to some degree, so that your experience will differ when replaying sections or reloading save states. From what I understand, based on the research of others, this version of Final Fantasy X on PS4 suffers from fixed RNG, locking you into set patterns regardless of how many times you reload or replay a section of the game.Honestly, this doesnt have much of an impact on me, at least not the way Ive played the game on my initial run through. Im not much of a min/maxer when it comes to RPGs, and quite honestly, if this hadnt been pointed out to me, I doubt I ever would have noticed. But for those of you that do care, obviously this sucks, and ideally itll get fixed or patched. I dont know that Square Enix has the best track record with actually fixing issues like this though, so if you know that fixed RNG will bother you while playing, then clearly Id wait on picking this up until SE announces some sort of fix, instead of assuming that theyll eventually get to it.The other issue with this release, and one that was pretty noticeable to me, is a soundtrack related bug that causes the field/town music to reset after every encounter. Encounters are frequent enough that this means youll get about 10 to 15 seconds worth of music, provided youre not standing still, before entering a battle and having the music restart once you exit. Its not the biggest annoyance in the world, but considering how solid the FFX soundtrack is, its disappointing. Thankfully, it doesnt seem to be an issue that persists with FFX-2.", "date": "May 20, 2015", "grade": "B+"}