{"name": "Capcom Fighting Collection", "ref": "https://gaming-age.com/2022/06/capcom-fighting-collection-review-for-ps4-5-xbox-one-series-x-switch/", "text": "Gamers will never accuse Capcom of not re-monetizing old titles, while their efforts range from praise worthy such as the Resident Evil Remakes, to perplexing such as their Arcade Stadium initiative. Todays subject is an interesting one as after the company logo is introduced in the intro, a Street Fighter 35th Anniversary logo is presenteven though the Street Fighter strictly makes up 10% of the collection. Capcom Fighting Collection compiles 10 arcade fighting titles. I put the world fighting in quotes because of the inclusion of Super Puzzle Fighter 2 Turbo, which is more of a Vs Puzzle game than a fighting game. Other titles included are Super Gem Fighter Mini Mix, Hyper Street Fighter 2: The Anniversary Edition, Darkstalkers, Night Warriors, Vampire Saviors, Vampire Hunter 2, Vampire Savior 2, Cyberbots: Fullmetal Madness and Red Earth. The back half of the collection has the distinction of never having a North American home release and Red Earth debuting as a home release in this very collection. While I question the heavy presence of Darkstalkers (I guess Capcom is making up for decades of neglect), Capcoms fighting catalog has plenty of non-licensed fair they can choose from, such as Saturday Night Slam Masters (although this one is going to be a part of the 2nd volume of their Arcade Stadium series, its absence makes sense.), Power Stone, Tech Romancer, Star Gladiator, so this compilation couldve been a cornucopia of choice. Each title appears to be using the arcade version of the game, you have the ability to switch between the NA and JP version which beyond the language, there are some minor changes in each region. The compilation even manages to include a training mode for those who need to refine their skills against a practice dummy. Other accessibility offerings include save states, the ability to bind special attacks to single button presses and the ability to adjust the visuals of the game itself. Although the display descriptors are not that useful as Type A doesnt quite describe what filters are or arent applied in the mode. The other major selling point is the museum mode which compiles key art, promotional materials, arcade manuals, music tracks and design documents for each title. Its a historical trove which many have not laid their eyes on and if history serves me correction, surely some content creator will be able to find the next Zubaz amongst these documents. Although Im slightly distraught at how little there is in the Hyper Street Fighter Section.If youre a Darkstalkers fan, you are definitely eating well if you purchase this compilation, hell as a puzzle fighter enthusiast I am ecstatic that I will be able to play the title on modern consoles and possibly on the go (via the Switch or the Steam Deck). It is also nice to have a legal way to own Cyberbots and marvel at the eccentricity that is Red Earth. While I have issues with the title curation, this is nonetheless a solid lineup. One can only hope that the licensing gods will grant us a Capcom Licensed Fighting Game Collection which will include their Marvel catalog, their JoJos Bizarre Adventure Part 3: Stardust Crusaders fighting game, Tatsunoko vs Capcom and dare I sayRival Schools.  Their resume is deep enough to have a couple more of these, but what we have here is a good start.", "date": "June 27, 2022", "grade": "B"}