{"name": "Shovel Knight", "ref": "https://gaming-age.com/2015/05/shovel-knight-review-for-ps-vita-ps4-xbox-one/", "text": "I know Im in the minority here, but the first time I played Shovel Knight, back when it first came out on the Wii U, I didnt love it. In fact, I was pretty indifferent to it. Maybe I had retro fatigue, maybe I was just in the wrong mood at the time, but whatever the reason, nothing about the game really spoke to me. All those insanely high scores just left me baffled and wondering what I was missing.Now that its on the Vita, though, I get it: its pretty awesome. As my colleague wrote about the game last year, it more or less does everything well. The controls are perfect, with the titular shovel being utilized to perfection as a weapon/means of bouncing off things  and unlike last years version, theres no adjustment to weird control schemes required. Likewise, the levels are all fantastic: each one feels distinctive, with its own unique personality and design, and theyre big enough that youre able to get a full sense of everything they have to offer. Better still, they balance their size with an excellent checkpoint system  just enough that you never lose too much progress, but not so close together that theres nothing lost when you die.This last point speaks to something else Shovel Knight does really well: difficulty. As youd expect from a retro-inspired platformer, its tough  very, very tough in places  with enemies and environmental hazards alike that will constantly keep you on your toes. What sets Shovel Knight apart, however, is that its still fair. Theres never any point at which youre left feeling as though something is impossible, or as if the games difficulty has spiked out of nowhere. Its demanding, sure, but never so much so that youll feel like throwing your controller across the room and moving on to something else.What really brings everything together, though, is the games exceptionally good writing. Where most other retro games rely on references in place of actual humour, Shovel Knight is full of jokes that are actually funny and a plot thats actually engaging. Yes, the PlayStation version features Kratos (and the Xbox One version has Battletoads in his place), but thats more a neat Easter egg than a symbol of any kind of reliance on referentiality.", "date": "May 13, 2015", "grade": "A+"}