{"name": "Grand Theft Auto V", "ref": "https://gaming-age.com/2015/04/grand-theft-auto-v-review-for-pc/", "text": "Typically a port review doesnt require more than a few boxes checked  mostly to do with how it looks, what new features are added, whether any optimizations are present, how many settings can be customized, and a general sense of value in comparison to the original release. In Rockstars case, their reputation proceeds them as being a typical mess for PC ports.Grand Theft Auto IV was poorly optimized, requiring powerful hardware to run a game at above average settings. For most, the compromise of having the game hit Windows was that theyd face an uphill battle to have an experience typical of PC-oriented games. Technical issues kept framerates and resolutions at odds with each other, and many players would struggle to play a slightly better-looking game at the cost of a high-end PC.By now, its safe to say that GTAV is a different story. While it isnt kidding around with the minimum hardware specifiations required to run the title, theyre a fair ask in regards to what most mid-range PCs would contain. Anyone whose machine fits the bill of the specs below should be able to achieve a stable 30-40fps game at 720p with visuals sitting closer to PS3/360 on a slider scale of GTAVs console cousins. It may even look a little nicer in some spots.The machine we played on contains an AMD 6950, core i7-920 CPU, and 8GB ram. A look at the visual setting shows a budgeting bar for what the VRAM can accommodate, and will notify users that the executable simply wont run if settings overstep the limits of the users hardware. Its possible that the game may be operational, but would likely run in a state so broken that Rockstar has an override preventing anyone from experiencing such a thing.Our review follows the release by a couple weeks, but at the expense of timeliness, weve completed the games story mode and experienced the core of GTAVs campaign. After 35 hours with the game, were happy to report this sentence: Aside from some general open-world hiccups, everything ran within 25-50fps at 1080p, with no crashes or performance issues. Well, aside from this one time Michael set a glass on top of nothing in a cutscene, but were sure that table was there in spirit.Mid-range GPUs will encounter some hard times in reflections.That said, the optimization process to run the game at a stable 30fps on 1080p required a few compromises. One being that just about all settings were ticked to Low or Normal  the most taxing to the RAM budget (reflections, anti-aliasing) were reduced to settings that looked hideous when encountered in game. Some of the most taxing sections took place in Los Santos at night, where complex geometry is met with a multitude of light sources, as opposed to the global light in daytime.For the most part, however, the optimization is remarkable. One could argue that the minimum required hardware is still a bit pricey, but in reality, anyone intending to play a game like GTAV will likely anticipate that theyre diving into a demanding piece of software. Its not going to run on your 5 year-old laptop with a Core2Duo processor, but then, did anyone expect it would?Its obvious that the time between GTA IVs completion, Rockstar has become increasingly pragmatic in their technical facilities, seeking not only efficiency, but designing with flexibility in mind. In this regard, the PC port is not only accessible, as most of this review has acknowledged, but is also capable of treating owners of more powerful hardware to a real treat. Its no surprise that the games release was widely covered by PC gamer and folks on Youtube with hardware capable of running the game at 60FPS with settings maxed out at 4K. Its all got to do with Rockstar delivering a game that many can play, but caters to those who intend to play all their games maxed out, whilst maintaining 60FPS, or on a slew of monitors covering three feet of desktop monitors. Heck, they can even do it in first-person this time around.Additional features (remember that box-checking we mentioned?) include the Rockstar Editor, in which players can create their own videos. GTAV isnt Steam Workshop compatible, however, leaving users to turn to the old-fashioned internet for goofy ragdoll physics mods, along with more technical fare like FOV tweaking. Players will still find the complete online experience present, which brings us to one of very few caveats, being that a Rockstar Social Club account will be needed to access online features. Its not detrimental in our eyes, but some may obstain due to a third-party presence.", "date": "April 30, 2015", "grade": "A-"}