{"name": "Card Shark", "ref": "https://gaming-age.com/2022/06/card-shark-review-for-nintendo-switch-pc/", "text": "I feel like I should love Card Shark. It was developed by Nerial, who created Reigns, and Arnaud De Bock, who created Pikuniku. I Reigns, and I adored Pikuniku. Throw in the fact that it looks incredible, the story is engaging, and its got a fantastic score, and it seems like I should be all over it.The thing is, though, I dont, and I think its because Ive never been super into the WarioWare series  and WarioWare, more than anything else, may just be Card Sharks biggest influence.Even though Card Shark is superficially about a card cheat working his way through pre-Revolution France, what its really about is mastering a series of minigames. You mark cards, you switch decks, you use false shuffles, you tip off your partner about what cards are in which players hands  and you do all of it by memorizing various twists, turns, and presses on your controller. Not only that, you have a short time in which to do the moves, and the game keeps piling on new ones the further in you get. Its stressful in the same way as WarioWare is, where you have to remember some fairly non-intuitive motions without much in the way of leeway, and failing to do so sets you back. Admittedly, the easiest mode is a little more forgiving  but not so forgiving that youre not stuck playing what feels like minigame after minigame.As I said, absent that core gameplay mechanic, theres a lot to love about Card Shark. Its absolutely gorgeous, and frequently looks like a series of sketches come to life. Likewise, the music is perfect for the game, evoking a feeling of Bourbon-era France with its mandolins and whatnot. Even the story, which makes reference to the growing dissension that culminated in the French Revolution while still advancing the story of Comte de Saint-Germain and his mute protg (youre the latter). It all moves along at just the right paceRight up until you have to learn a new card trick, at which point it feels like youre playing a minigame thats at odds with the vibe of the rest of the game.Obviously, if youre okay with WarioWare-style minigames, then that may be a bonus for you. And if I could ignore my dislike of them, then theres plenty about Card Shark to make it worth recommending  and even with those minigames, Id still say its better than average. But unless youre really fond of wiggling your thumbsticks around every few minutes, you may find the whole experience to not be as good as it could have been.", "date": "June 23, 2022", "grade": "B"}