{"name": "RBI Baseball 2015", "ref": "https://gaming-age.com/2015/04/rbi-baseball-2015-review-for-xbox-one-ps4/", "text": "I hate to engage in console warrior-type behavior, but I feel compelled to make an exception for RBI Baseball 2015. It is so terrible, so abominably bad in every way imaginable, that I have to say that if youre a baseball fan who only owns an Xbox One, you owe it to yourself to immediately go trade in your console and get a PS4, just so you can buy MLB 15: The Show with it and get a worthwhile baseball experience.I dont say that lightly. As I wrote just a few days ago, MLB 15 is a deeply flawed game, with such a horrific online experience I could see it making people question why baseball even exists. Yet, somehow, RBI Baseball manages to be even worse than that.Whats so bad about it? Literally everything. Pick some aspect of the game at random, and youll find something to be appalled by. Take the players, for example. Even though the game was made by Major League Baseball with licensing from the MLB Players Association, no one looks like their real-life likenesses. They got the skin tones right, but apart from that, theres no way to tell the players apart. Theres one body type for all, which means that teensy Jose Altuve looks like the statuesque Giancarlo Stanton or the husky David Ortiz even when the reality looks like this or this. Theres nothing inthe way of distinctive stances or wind-ups; everyone bats the same and pitches the same, because, I guess, going to the trouble of making your league seem like it has distinctive on-field personalities would be ridiculous?And thats just when theyre all in standing still. When RBI Baseball 15 starts moving, thats when things really go off the rails. Just before every pitch every player stands slightly hunched over, in the classic ready pose  just what youd hope for. When the ball is put in play, however, they stay in that same position, rotating in place towards the direction of the ball rather than looking like theyre reacting. It looks completely unnatural  though, for maximum hilarity, just watch when a ball gets fouled off, and youll get to see every player on the field rotate in the same direction simultaneously.Thats still preferable to watching them try to move from one spot to another, though. No one in this game runs like an identifiable human being. It would be slightly more accurate to say that they glide across the fieldthough gliding usually implies speed and grace, and those are qualities that absolutely no one in RBI Baseball 15 possesses. Everyone here moves at a glacial pace, which means every ball in play leads to an inept, slow-moving adventure. Fielders slowly jog/hover towards balls in play, baserunners show little to no hustle as they move from base to base, and when two or more players want to occupy the same place, rather than standing side by side, they just merge into one gangly being.Somehow, though, absorbing each other is the least ridiculous thing players in this game do. Thats because, above all else, players in this game are mind-blowingly stupid. Every single play finds them all woefully out of position; outfielders will invariably begin every play on the warning track, leaving them unable to get to most fly balls, while all infielders have a strange affinity for standing almost directly on their bases at all times. Sometimes the latter can be explained by the presence of baserunners, but other timesI dont know. I just dont know.I also have no idea what players are doing when they reach the ball. Sometimes theyll throw it where you tell them to, but thats hardly a sure thing. Occasionally theyll hold on for several button presses, only throwing once the baserunner is safely on base. Other times theyll whip it to a teammate standing in the general vicinity of the base  though not, its important to note, actually on the base or near the baserunner, because that would just make too much sense. Still other times, the player youre controlling will just give up entirely and hurl the ball into the outfield, as his teammates just stand and watch the ball roll all the way to the wall. You cant totally blame them for not throwing it to the right teammate in the right spot, though  I lost track of the number of times where a ball would reach the base before the baserunner, only for the fielder to just stand there and watch as the runner slide safely into the base. (Though considering howfrequently I watched as baserunners went into bases standing up on close plays, that may not have been the worst strategy.)If the players all act with general indifference, perhaps it may be because they realize they had very little control over how the ball acted. Without a hint of hyperbole, I can honestly say that RBI Baseball features the wonkiest ball physics Ive ever seen. Angry Birds features more natural physics than this game. There was absolutely no predicting where balls would go once they hit the bat. Sometimes sharply hit balls would bounce softly to a waiting infielder (provided they were waiting near a base, of course), while other times soft fly balls would end up floating for 400+ feet for a monster home run. The difficulty in predicting how a ball would react was compounded by the fact the game rarely showed the trajectory of foul balls; you could see it fly off the bat, frequently in fair territory, but the game would declare it foul and youd instantly move on to the next pitch.And speaking of pitchersno one in this game has any sort of stamina. It doesnt matter if youre using a soft-tossing lefty like Mark Buerhle, a knuckleballer like RA Dickey, or an innings-eater like Felix Hernandez: youll inevitably need to bring in a reliever by the fourth or fifth inning, because your pitcher will be completely gassed, lobbing the ball in at around 60 miles per hour with no movement. As you can imagine, this is moderately annoying if youre playing a single exhibition game, and absolutely disastrous if youre trying to play a full season  relievers all have lousy stamina and only slightly better recovery times than the starters, so youd better either have a very, very deep bullpen or be okay with being involved in lots and lots of slugfests. And dont go thinking you can just call some extra relievers up from the minors or acquire some in a trade, because youre stuck with the same roster all year long.If the game has any saving graces, theyre in places that dont really work in RBI Baseball 15s favour. Unlike last seasons game, for example, this edition of the game comes with the ability to track stats over the season. While that wouldve been revolutionary way back when the original RBI Baseball hit consoles back in the mid-80s, its obviously significantly less impressive today. Likewise, RBI Baseballs online play isnt as profoundly awful as that of MLB 15, but thats only because its non-existent. Theoretically, it has that feature, but after trying and failing to find anyone else online multiple times across multiple days, I just gave up on it. (And sorry to beat a dead horse, but thats how bad MLB 15 is when it comes to online play: its literally not better than nothing.)", "date": "April 15, 2015", "grade": "D-"}