{"name": "Life Is Strange  Episode 1 & 2", "ref": "https://gaming-age.com/2015/04/life-is-strange-episode-1-2-review-for-ps4-xbox-one-pc/", "text": "Life Is Strange doesnt feel like a Square Enix published game, which is probably an odd comment to start off a review with. While they have been known to venture outside of their RPG comfort zone on more than a few occasions (Tomb Raider, Thief, Deus Ex recently), the companys latest digital-only release moves in a new direction altogether.Developed by Dontnod Entertainment, Life Is Strange is, on a high level, an artsy episodic adventure that shares some of the same DNA as their previously released title Remember Me. Even more so though, the game follows in the footsteps of Telltale Games popular episodic story-driven releases such as The Walking Dead, The Wolf Among Us and Game of Thrones. So Life Is Strange is a strange beast indeed, and the type of slower-paced, palate cleansing game that you may need every once in a while. The time rewinding, supernatural teen drama may not be for everyone, but its not difficult to appreciate what Dontnod and Square Enixs intentions were.Life Is Strange is the story of a gifted photographer and high school senior by the name of Max Caulfield. Max has left her fictional Oregon hometown to attend Blackwell Academy, a prestigious private school, before heading off to college. One day during photography class, and after the disappearance of a well-liked fellow student, Max is presented with a nightmare like vision that shows the town being destroyed by a tornado. Soon thereafter Max realizes that she has acquired time-warping abilities which she is forced to put to good use to save a friend. With the town still wrapped up on trying to solve the mystery of student Rachel Ambers sudden departure, its here where the player takes control of Max to deal with these visions, newfound abilities and unexplained events.While we didnt cover the first episode of Life Is Strange when it launched, this review will take into account the first two episodes (out of five) which are now available. Chrysalis, episode 1, gets the player up to speed with the life of Max, her abilities, the setting, and the main characters presented in the game. If the idea of stepping into the shoes of a teen girl and dealing with high school drama  including stereotypical school cliques and characters  immediately turns you off, then Life Is Strange may not totally be for you. If you go into the story with an open mind, and can get past the deliberate, almost leisurely pace, then it gets far more interesting. Out of Time, episode 2, also starts out a bit on the slow side with a couple of scenes bogged down by excessive exploration. It doesnt take too long for a handful of the story threads to thankfully converge into a rather dramatic climax leading into the next unreleased episode. Of course being only 2/5ths of the way through the series, which amounts to 4 hours or so of playtime, there are still more questions than answers at this point.Slow paced in Life Is Strange is a relative term. While you can freely explore the environments as Max and interact with key characters and objects, theres no real action per se, so the entire pace is slow. Most decisions and actions can be undone using the neat time-rewinding ability, which is utilized to solve simple puzzles or take a different branch in a conversation to unlock some clues or new information. There are no QTEs or time sensitive action moments whatsoever, and nearly all decisions can be redone if youre not satisfied with the outcome (until a checkpoint is reached). Of course, changing your mind and altering time to your liking has a bit of a butterfly effect that can influence the story moving forward, so it makes sense to thoroughly debate which decisions you end up sticking with. Within the first 2 episodes, there are some key choices that appear to lead to different outcomes in future episodes, though its sometimes hard to tell to what extent. Like Telltales games, after each episode you can compare your choices and actions with friends and the rest of the community to see how in or out of sync your final decisions were.Throughout the episodes, Max can also take optional photos to place into her scrapbook. Not all of these photo opportunities are obvious, so using Maxs abilities to puzzle out where and when to take the shots is sometimes essential. These collectible photos are largely used for Trophies/Achievements, though I certainly had some fun replaying scenes in an attempt to snap them all.Life Is Strange is a stylish, pleasant looking game overall, though tech-wise, the Unreal Engine-powered visuals are sometimes a mixed bag. The UI and cohesive art design, along with some of the lighting and cinematic camera angles, do come together to show off some inspired graphics more often than not. There are a few instances of lower quality shadows and textures, and occasionally simplistic geometry, but for a digitally released, story-driven episodic game series, its more than attractive enough. If the goal was to capture the look of a small town in the Pacific Northwest, theyve done a pretty damn nice job.Life Is Strange is fully voiced, and even when Max isnt speaking with other students or characters, her inner-monologue and narration is always present. Just when examining objects she may have potentially informative details or amusing anecdotes to convey to the player. Some of the conversations, and the voice work for many of the supporting characters, can be unintentionally awkward and funny, and the script tries to be a little too hip for its own good sometimes. Theres certainly no shortage of high school stereotypes and tropes at of Arcadia Bay and Blackwell Academy including the rich spoiled kid, aloof wannabe hipster, mean cheerleader, introverted geek, football captain jock, goth loaner, and so on.As for music, Dontnod definitely put a lot of effort into the soundtrack (here on YouTube) which features some unique, licensed songs, including mellow indie-rock tracks from Syd Matters and Jos Gonzlez. Theres actually a really cool optional moment in the game where you can have Max turn on her radio and pick up a guitar in her dorm room and imperfectly play along with one of the songs.", "date": "April 10, 2015", "grade": "B"}