{"name": "Metal Slug 3", "ref": "https://gaming-age.com/2015/04/metal-slug-3-review-for-ps-vita-ps4-ps3/", "text": "Even though Im a child of the 80s and I spent a good amount of time playing video games throughout my youth, I can count the number of times Ive been in an arcade on one hand. (In fact, you only need one finger, since I went to an arcade precisely once.) Consequently, I never developed much of an appreciation for arcade-style games.This is relevant to Metal Slug 3 because its about as arcade-y as a game can get. It may have originally been released in 2000, but it feels like a relic of an even earlier time. Its got run & gun gameplay. Graphics that look like they came straight out of Double Dragon or Streets of Rage. An over-the-top military plot that feels like it was born out of an 80s action flick. A high score list that allows for three letter names. And, in its most arcade-y twist of all, levels that feel like you should be playing them on a cabinet rather than a console.What does that last one mean? For one thing, it means you always start a new game at the very beginning of the first level, rather than having the option to pick up where you left off  no save slots here. For another, it means that every time your player loses all his or her lives, you get a continue screen.(Lets just pause here to be grateful that SNK Playmore didnt make concessions to modern gaming economics and attach in-app purchases and real money to those continues.)While the latter is kind of neat (I cant think of many other retro-inspired games that have borrowed that from the past), the whole starting over at the beginning every time thing does absolutely nothing for me  which is where my lack of time spent in arcades decades ago comes into play. Try as I might, I just cant enjoy sinking a whole bunch of time into the game, and then turning around and playing the exact same levels the next time I boot it up. I dont get any sense of accomplishment from it. Sure, there are slightly branching paths in certain spots that help mix things up a little, but they hardly branch enough to make it seem like youre playing a different game each time. That said, I could see how people might enjoy it, particularly if it hits them in the right nostalgic mood. I mean, Ive sunk hundreds of hours into various sports games, and what are those if not the same thing over and over again?I have a lot more trouble understanding how people could enjoy Metal Slug 3s controls, though. To be blunt: theyre kind of lousy. As far as I can tell, you can only shoot in four directions, which makes attacking enemies diagonally opposed to you virtually impossible  kind of a big deal when you have enemies constantly coming after you. Similarly, the game makes it difficult on you if you want to run in one direction and shoot in another  again, not ideal when the game expects you to simultaneously run away from certain baddies and also shoot at them. Whether this is a holdover from the age of arcades, I cant say  since, as I said, they werent a part of my childhood  but I can say it makes the game feel creaky and archaic.", "date": "April 8, 2015", "grade": "C"}