{"name": "Etrian Mystery Dungeon", "ref": "https://gaming-age.com/2015/04/etrian-mystery-dungeon-review-for-3ds/", "text": "While the Etrian Odyssey series of titles is probably pretty familiar to most DS/3DS owners at this point, Id venture to say the Mystery Dungeon series from developer Spike Chunsoft has a little less recognition as a brand. Outside of Nintendos own Pokemon Mystery Dungeon series, these roguelike titles that have been pretty popular overseas havent gained much traction in the West. But for those of us that have played titles like the DS release of Shiren the Wanderer, the old PlayStation release of Chocobo Dungeon, or any number of indie releases that have looked to Mystery Dungeon as some sort of inspiration, the marrying of Etrian Odyssey and Mystery Dungeon likely sounds like a match made in heaven.And thankfully, with Etrian Mystery Dungeon, thats certainly true. Etrian Mystery Dungeon is basically the perfect blend of game design from two decidedly different types of dungeon crawlers. Etrians tough as nails, map-creating, 4-man party customization pairs quite well with Mystery Dungeons turn-based combat and exploration, featuring tons of item pick-ups, loot, challenging boss encounters, and random dungeon designs to explore and enjoy. Make no mistake, Etrian Mystery Dungeon is a difficult, slow-paced, occasionally frustrating experience. But at the same time that frustration gives way to remarkably satisfying moments and close calls, enough so that Etrian Mystery Dungeon is a tough game to put down.The pairing of the two series works like this: The beginning of Etrian Mystery Dungeon is not unlike any other Etrian title to date. You create a guild, pick from familiar classes for your starting party, such as Landsknecht, Gunner, and Medic, and work out of a central city hub that contains an inn, shops, and various quest givers for both story and side missions. The art style is extremely reminiscent of the Etrian series within the hub town, but looks decidedly different when exploring. Available dungeons to explore are often dictated by story, consisting of multiple levels to move up and down in. Dungeons also branch out a bit this time around, so youll have multiple paths to various floors, opening up your dungeon exploring parameters quite a bit.When exploring dungeons, youll have an isometric style view of your four character party, choose a leader and party layout, then youll start exploring. This is where the Mystery Dungeon portion of the game kicks in. For every step your party takes in the dungeon, all enemies present, whether visible or not, will also move. Youll fill in sections of the map as you move, but most rooms are completely invisible until you enter them, leading to a variety of surprises both good and bad. Sometimes youll stumble across a multitude of treasure or resource points to farm, other times youll encounter a room full of enemies.When you do encounter foes, youll take turns battling it out in real-time, with no change in perspective or a battle menu to cycle through. Youll still have access to a multitude of class-specific skills like other Etrian titles, which you can assign to various shortcuts. Every character also has a basic attack tied into one face button, and if youd prefer, you can access the skill menu at any point to use abilities in a more traditional, Etrian fashion. Combat is where youll really start to pay attention to party layouts, who youve assigned leader, and how to manage your party effectively. Generally the party will act without additional input, leaving you to control the leader. Occasionally youll get prompted to assign targets, or use a specific recovery ability, but generally the A.I. does the job, and does it well.Another component to dungeon exploring comes in the form of forts, which youll unlock early in the game. You can build a fort on any explored level of the dungeon youre currently in, which will lock in the layout of that floor. Youll still need to fill in the spaces of the map when leaving and returning, but over time youll learn where your exits are, making navigation through fortified levels a bit quicker.But forts also provide a layer of defense against D.O.E.s, monstrous beasts that are, of course, not unlike the F.O.E.s from the Etrian series. Forts can help prevent a D.O.E. from escaping the dungeon, at which point they will wreak havoc on your town hub, literally damaging and closing off sections of the hub for a certain amount of time. Needless to say, this can hamper the game quit a bit, so its in your best interest to prevent this from happening. The presence of a fort can drive a D.O.E. back to the lower levels of its respective dungeon, or you can attempt to mount a manual defense by placing unused registered guild characters to the fort. Attacking D.O.E.s, at least early on, is definitely not recommended, something that most Etrian fans will be well aware of from encounters with F.O.E. in other Etrian Odyssey titles.", "date": "April 6, 2015", "grade": "A"}