{"name": "G-Darius HD", "ref": "https://gaming-age.com/2022/06/g-darius-hd-review-for-ps4-switch/", "text": "The Darius series has always been about insane challenge and screen filling action. With each new version of the series, Taito always seems to 1-up themselves with fun and exciting action that never seems to get old. G-Darius is the first fully 3-D entry in the series, and just like its predecessors, brings a lot to the table.[Eds Note: The original version released late in 2021, but Taito has since dropped a major new update which is factored into this review.]Darius, at its core, is a horizontal shooter where your main goal is to survive countless waves of enemies and destroy the area boss. To keep the gameplay from getting stale, all of the games give the player the ability to choose their own path to the final battle. After the entry stage, you can choose where to go next by selecting the next Zone you want to enter. The game ends when you reach the final zone and destroy the boss. G-Darius continues this trend, but being in 3-D, you get treated to some nice animated transitions between stages. Everything found in the previous Darius games carries over into G-Darius with a few twists.You still get the furious gameplay, the ability to upgrade your weapons by collecting orbs, and the screen filling battles with the area bosses or Huge Battleships as the game likes to exclaim. One thing they added to this version is the ability to capture on screen enemies and add their firepower to your own. This can be a massive help when trying to get through tough waves of enemies. You can also use the captured enemies as bombs to cause big damage to everything on screen. The action is always fun, while giving you a nice sized challenge that will keep you coming back!This release of G-Darius is a small collection of sorts. While it doesnt offer different Darius games, it does give you all of the different versions of G-Darius itself. You get the original Arcade and HD releases of G-Darius and G-Darius Version 2. You also get the original PlayStation release complete with loading times and Anime intros and cutscenes! There are subtitle differences between the original game and version 2, with the second version fixing some minor glitches and changing some of the enemy patterns. Version 2 also seems to flow a little faster than the original. The PlayStation version is based on Version 2, but also has some of its own cosmetic changes and feels a bit slower overall.Graphically, the HD versions of the games look smooth and colorful, while the original Arcade and PlayStation versions retain their blocky, polygonal forms. The games havent been given any other facelifts other than the smoother textures in the HD versions. While it does look a bit dated, it still retains that classic charm. The music and sound effects really blend well, with each area having some awesome music to jam to while you are shooting everything in site. Some of these tracks are good enough to load up onto an iPod or other music player and listen to them on their own.G-Darius is classic Arcade shooting action at its very best. Combining great gameplay with fantastic visuals and audio, you will have a blast even if you are not that big on horizontal shooters. Fans of the series will be right at home with the gameplay, while new players will get the hang of things very quickly. No matter where you stand, you will find a fun and challenging game that will keep you coming back for more. Out of all of the games in the Darius series, G-Darius might very well be one of the greatest. Other 3D incarnations would come to home consoles over the years, but they dont come close to the original. It may not be a complete Darius Collection, but it certainly belongs in your library.", "date": "June 22, 2022", "grade": "A"}