{"name": "Axiom Verge", "ref": "https://gaming-age.com/2015/03/axiom-verge-review-for-ps4-ps-vita/", "text": "There are seemingly hundreds of indie games out there that use 8-bit or 16-bit style visuals as a mere gimmick, and most of the time, these games use such small sprites and are so spastic that you cant enjoy the gameplay. So in comes Tom Happ with Axiom Verge, a game that actually gives you awesome gameplay along with the great looking retro style of classic games like Metroid and Bionic Commando. Could this be the next Shovel Knight? Signs point to yes!Axiom Verge is a project created by a single programmer, not a team of people throwing all their ideas in a blender and seeing what they can shove in. Tom Happ worked on this title for nearly 5 years, and unlike the hundreds of other indie games that use an 8-bit retro style, he actually included fun gameplay that doesnt feel like work. Players will control Trace, a man who after suffering a fatal injury, wakes up in an ancient and high-tech world. The game focuses on action and exploration, and features over 60 items and power ups that are placed throughout the giant interlocking maps that make up the planet.As he progresses through the enemy filled rooms, Trace will find weapons and items that will help him survive as he slowly discovers who is behind the strange attack on this planet. The fun is ramped up to eleven when you encounter giant screen filling bosses that will take you quite a few tries to either memorize their patterns or find the best way to take them out. Fortunately, there are many rooms where you can save your progress, so the sting of defeat is lessened a little. Exploration is a large part of Axiom Verge. You wont progress very far if you dont explore everywhere you can possibly go. After you find a few weapon upgrades, such as a laser drill, you can access areas that were closed off to you at first pass, so a little backtracking is necessary to move forward. One of the best weapon upgrades you find that will be absolutely vital for progression is the Disruptor, a gun that actually allows you to glitch out enemies to make them less dangerous and even glitch portions of the background to create platforms and open secret paths. If you see flickering or missing sprites in any of the rooms, its not a mistake in the game and chances are your Disruptor can interact with it, giving you an advantage. Other power ups you acquire later allow you to glitch through solid walls, which open up even more paths and previously unattainable items, along with health and weapon upgrades that help you stay in the fight a bit longer.With encouraged exploration and the amount of backtracking you will be doing, it can get easy to get lost and seem a little frustrating at times, but following your map and having some patience will keep you going in the right direction. In the main game, youll be investing many hours in exploring the world and uncovering every part of the map to make sure you you are ready for the final boss battle, which is no push over to say the least. For those out there who enjoy a fast game with less exploration and backtracking, Axiom Verge contains a Speedrun Mode that sets all of the power ups and weapons in the same place each time you begin a new game and also allows you to skip dialog and cutscenes so you can get a fast completion time. Personally, Im not a fan of speed runs so I didnt spend a lot of time with this mode, but for some players out there this is a great way to test those speedy skills.Controlling Trace takes some practice to get perfect. Some of your weapons can be selected with the right analog stick, while others are readily available on the shoulder buttons. In the heat of battle, you can forget which button activates which weapon and that can sometimes lead to damage or even death. Once you experience this a few times, youll begin to get a better handle on the controls to avoid your accidental demise. Occasionally jumping up and reaching seemingly easy to reach platforms can be difficult, but the longer you hold down the button the further you can jump. It may take a few tries to master, but its not hard to get used to. Running and shooting baddies (even diagonally) works smoothly and once you get used to the weapon assignment, youll feel in complete control.Graphics are a nicely blended mix of 8 and 16-bit visuals, with highly detailed animation. The character sprites are a bit on the small side, but not so small that you lose where your character is on screen. There are a few large bosses that force the camera to zoom out and make your character super tiny, but you still never lose sight of your character and it really shows off the level of detail that went into making these room filling monsters. Audio is a nice mix of chip tune music and other 8-bit sound effects that sometimes make you think you are playing a game from the 1980s. You can tell that Tom Happ really knows the classics as everything looks and sounds like it could have been released back in the heyday of the NES.", "date": "March 31, 2015", "grade": "B+"}