{"name": "Sldner-X 2: Final Prototype", "ref": "https://gaming-age.com/2015/03/soldner-x-2-final-prototype-review-for-ps-vita/", "text": "If theres one thing Sldner-X 2: Final Prototype does well, its boss fights. Theres just something that feels so right about reaching the end of a level and coming up against an enemy who fills up almost half the screen. Whether youre squaring off against a giant head, a giant flying robot, orwell, a different-looking giant head/robot, Sldner-X 2 knows how to make a levels ending seem epic, even if youre playing it on the Vitas smaller screen. You just get an undeniable sense of satisfaction from beating something so enormous.Unfortunately, thats about the only thing Id say that Sldner-X 2 does well. Which isnt to say that it does everything else poorly, of course. I dont think theres any part of the game for which bad could be used as an adjective. But if youre looking for areas in which the game goes beyond being your standard shoot-em-up and into the realm of something special, its basically that one area and nowhere else.This is evident in every area of the game. Take the graphics. As I said, the bosses look incredible, and when you reach one, theres no questioning whether youve reached a levels big bad because they look so wonderfully distinctive. The thing is, everything leading up to that point looks really bland by comparison, with interchangeable enemies and environments that rush by in a nondescript blur. Obviously, they dont need to be amazing works of art, since the whole point of a shmup is constant movement (which generally means you dont get to stick around in one area long enough to really notice how things look), but it still feels like they couldve worked a little bit harder on making the first 85% of each level at least come close to that final 15%.Or look at the weapons. They work as they should, in that they fire straight and they blow up enemy spaceships. But thats about the extent of what you get; youre not going to start jumping up and down with glee about getting some particularly awesome cannon or anything. The laser might be a little more enjoyable to use than the other weapons, since its fun to just send a constant beam of death all over the place in front of you, but still, considering were talking about a game where shoot is right in the genres name, the firepower feels a little lacklustre.The place in which this is the most obvious, though, is the overall feel of the game (for lack of a better description). Theres no real weight to any of your ships movements  nor, for that matter, is there any real sense of movement. Whereas a game like Sine Mora  the Vitas best shmup, as far as Im concerned  made you feel like you were flying through space, Sldner-X 2 never figures out how convey that feeling. The backgrounds dont change enough, picking up power-ups never feels momentous enough, and getting hit by enemy fire doesnt rattle you enough. I understand that its inherently impossible for Vita games to have the same sort of tactile feedback you get from a rumbling DualShock 3, but at the same time, if a game like Sine Mora (or even the vastly inferior Big Sky Infinity) can do it, theres no reason why Sldner-X 2 shouldnt be able to as well.", "date": "March 30, 2015", "grade": "B"}