{"name": "La-Mulana EX", "ref": "https://gaming-age.com/2015/03/la-mulana-ex-review-for-ps-vita/", "text": "I find that retro-inspired old school platformers are really hit or miss for me. Sometimes  like with Rogue Legacy or Cloudberry Kingdom  I absolutely love every aspect of them, from their insane difficulty to their NES-aping graphics. Other times, though  and here Im thinking of the likes of Spelunky or 1001 Spikes  they do nothing for me. Im not sure what differentiates them or how I love one group of them but not the other, but Ive found that every time I start a new one, its a 50-50 proposition as to whether Ill love it or loathe it.La-Mulana EX, unfortunately, falls squarely in the loathe category. I suppose this shouldnt shock me, since it has a few things in common with Spelunky, but I still wasnt going into it expectingwell, this.And what is this, precisely? A old school platformer, of course, but one that has a healthy dose of Metroidvania rather than being your typical side-scroller. Its got a strong Indiana Jones vibe, with an explorer main character journeying through mysterious ancient ruins.Above all else, though, La-Mulana EX is hard. Like, really, really hard. So hard that those italics are fully justified. So hard that youll almost definitely need a walkthrough if you want to advance anywhere at all in the game. I went in unaware of this fact, which meant that my first few attempts at the game all were very short, exasperating, and ended in death. Theres basically no indication what youre supposed to do or where youre supposed to go once you leave the games opening screen, so if you venture off without a guide, death is guaranteed.Not that my attempts with a walkthrough were that much better. Even knowing exactly what I was supposed to do, I still fell victim to all kinds of hazards. Drowning to death slowly was the most common cause, though a few of those times the fact I was being divebombed by various flying creatures was probably equally to blame. Then there was the time a bat knocked me off a ladder onto a tiny platform surrounded by water that was home to a rather persistent monster. Because a) the only way off the platform was the ladder and b) the bat was on one screen and the monster platform on another, every time I went from one screen to the other the hazards would reset, sending me into a nasty loop that only ended when I died. La-Mulana EX tries to make things a little more fair by giving you a life bar, rather than killing you off with one or two hits, but considering how relentlessly difficult it is, thats not much of a concession.", "date": "March 10, 2015", "grade": "B"}