{"name": "Screamride", "ref": "https://gaming-age.com/2015/03/screamride-review-for-xbox-one-xbox-360/", "text": "As much as I like to think Im some intellectual snob, the truth  at least as far as gaming goes  is that my tastes are much, much more unsophisticated. I dont want planning-heavy RTS games or RPGs with endlessly complex plots; just give me mindless destruction and big explosions and Im happy.Which is to say: Screamride makes me very, very happy. By any measure, its kind of stupid. Its not just a game about rollercoasters, its a game about hilariously unsafe rollercoasters that have a tendency to derail and topple skyscrapers in the process. Oh, and the rollercoaster riders are people who tend to go flying into the sky when their cart takes corners too sharply, which only adds to the silliness.Whats notable, though, is that however stupid Screamride may seem, it never crosses the line from being funny stupid to offensively stupid. Beneath that moronic sheen, you can see wit and intelligence sparkling through. The games career mode is narrated by what can only be described as a pre-incident version of GLaDOS. This is just me making up connections where none exist, of course, but I still like to think that if there were some crazy intertextuality going on, the sinister-sounding voice that intones here about totally-not-at-all-evil reasons for testing dangerous rollercoasters on live human subjects will one day, after the robot apocalypse, be putting people through much more rigourous testing, perhaps while wearing orange jumpsuits.On a more serious/less fanciful note, its important to note that beneath all the explosions and destruction and people flying through the air, this is actually a pretty challenging physics-based puzzler. Think of it as, say, Angry Birds or Crush the Castle, only with substantially higher production values. After all, you spend about one-third of the game flinging people in orbs at buildings, with the goal of smashing down the structures and getting a high score. If thats not Angry Birds-esque, I dont know what is. Likewise, another third of the game  the one that will grab most peoples attention  is spent on rollercoasters, and during that time you need to have perfect timing (to get boosts), you need to have an understanding of how sharply to take hard turns, you have towell, basically you have to know what it takes to excel at racing games, only without the leeway you get on a racetrack.And then theres the final third of the game  the part of Screamride in which you build tracks. Ill admit, its my least favourite aspect of the game, since it doesnt have quite the same potential for massive destruction. Still, though, you need to know how to get all your riders from Point A to Point B in a way that gets lots of points (which means making them as queasy and vertiginous as possible), without launching all of them into the stratosphere. It takes lots and lots of trial and error, and its not something you can just mindlessly push through.I will add here that if the game has one drawback, its that you cant share your created tracks with other users. It feels like thats a wasted opportunity, and I say that as someone who generally doesnt care for user-generated content. Its a sign of how awesome this game is that I just want more of it.", "date": "March 9, 2015", "grade": "A+"}