{"name": "Jungle Rumble: Freedom, Happiness, and Bananas", "ref": "https://gaming-age.com/2015/03/jungle-rumble-freedom-happiness-and-bananas-review-for-ps-vita/", "text": "Its a shame that there hasnt been a Patapon game yet for the Vita. After all, the system has a touchscreen, and, as both Hatsune Miku and mobile gaming as a whole have shown, rhythm games work extremely well on touchscreens. Based on that, youd think that a current-gen edition of one of the PSPs most popular franchises would be a no-brainer, but, thus far, Sony has resisted the obvious.I know thats not a new complaint, but after playing Jungle Rumble: Freedom, Happiness, and Bananas, its definitely one for which I have a new and stronger appreciation. I mean, Jungle Rumble is basically Patapon, only with monkeys in trees rather than tribes of walking eyeballs. Much like the Sony series found you leading your little tribes in battles by marching in time with drumbeats, here youre leading groups of monkeys up trees and in combat against evil red monkeys via drum-based movements.Its not exactly the same, of course, even setting aside the monkey vs. walking eyeball thing. Whereas you were literally a god in Patapon, in Jungle Rumble youre guiding groups of monkeys who interact with their gods (youre more the monkey collective is what I guess Im saying). Likewise, while both games feature vibrant-looking worlds, as youd expect from a game on a more powerful system, Jungle Rumbles bright pastels pop off the Vita screen much more than Patapon ever did on PSP.The most noticeable difference, however, is that the levels here are a lot shorter; whereas Patapon levels could last several minutes, Jungle Rumbles levels  particularly near the beginning of the game  can be beaten in mere moments, depending on how well you can keep a beat. For me, this difference is definitely a point in the games favor, since I find that keeping precise time can be mentally draining; its a lot easier keeping it up for 30 seconds or a minute than it is for levels that seem to go on forever. Of course, the other side of this argument is also true: the levels are shorter because the beats here are nowhere near as complex.", "date": "March 6, 2015", "grade": "A-"}