{"name": "Grey Goo", "ref": "https://gaming-age.com/2015/02/grey-goo-review-for-pc/", "text": "RTS (Real Time Strategy) games seem to be coming out farther and farther apart these days, so the makers of the original Command and Conquer formed their own studio and have released Grey Goo for the PC. With RTS games being hard to come by these days, is Grey Goo worth your hard-earned fifty dollars?Right away the similarities to Command and Conquer (C&C) is noticeable. There is a single resource that you gather called Catalyst, much like Tiberum in C&C. The unique control style of C&C is front and center of the game, making veterans of that series feel right at home. However not just C&C fans will feel at home here as they make great use of quick keys for building structures and units much like in Starcraft. For beginners or veterans of RTS games, Grey Goo has a great video tutorial right in the main menu for the basics.Once you start the single player game, there are a few in game tutorials. Unfortunately they do a poor job of describing units  especially special units that will ONLY attack under special conditions, such as units needing to be on a wall or other structure. Once a unit like that is produced for the first time, all that pops up is an orange triangle in the upper right, and the player has to click on it in order to get details on the new unit. This can be extremely annoying as the computer opponent, even in easy mode, is relentless. Once a mission starts, players have about two to three minutes until their opponents will attempt to attack. I had to restart many of the beginning missions simply because I was still trying to learn the new units and was getting frustrated since some of them wouldnt attack.Players are thrown into the universe of Grey Goo head first and there is no explanation at all of what is going on. The opening cut scene shows an alien race called the Beta, opening a wormhole using Catalyst, and something comes through. They automatically believe that its their ancient enemy the silent ones, though it turns out the ships that came through are just us humans, and we are a violent bunch! The humans immediately attack the Beta seemingly without provocation. The third race in the game is the Grey Goo, a race of intelligent self-aware machines out to destroy anything that isnt them. The goo itself is a large mass of nano-machines that basically disassemble anything they touchThe skirmish mode for the game encompasses both multiplayer and single player vs CPU. This is a great mode to use if players are trying to learn the different factions. Especially if they setup a 2 team, 4 player map where the players computer team mate is set to easy against a computer opponent also set to easy. This setup really allows someone to figure out what each building does and builds without having the pressure of the computer breathing down their necks in the single-player. Cut scenes and voice acting are very well done and the Beta truly seem alien, from their faces to their voices. Each briefing at the start and end of the single player missions are fully voiced and animated and the quality of these cut scenes are fantastic.The units from the three different factions in GG are basically mirror images of each other with the exception of each races ultimate unit: the Beta for example, has a giant flying fortress; the Grey Goo ultimate unit is the Purger, which is a giant puddle of goo that wanders around the map and devours anything it touches. The rest of the units in the game are basically the same between the different factions.There really are only two complaints I draw from this game. The first is that in the single-player campaign, the opposing force makes it incredibly difficult in the early going to learn how to play each race. The developers could have made the first few missions easier, and then ramped up the difficulty afterwards. The second complaint is the lack of diversity in the different races. With the exception of the ultimate units from each race, the units from all three sides are very similar much like Warcraft II where each side had basically the same unit with different skins on them. Aside from these two complaints, Grey Goo is excellent.", "date": "February 26, 2015", "grade": "A-"}