{"name": "Ace Combat: Assault Horizon Legacy + Review for 3DS", "ref": "https://gaming-age.com/2015/02/ace-combat-assault-horizon-legacy-review-3ds/", "text": "I reviewed, and sort of enjoyed, Ace Combat: Assault Horizon Legacy when it originally debuted on the 3DS back in 2011. It was a solid enough remake of a PS1 era title (Ace Combat 2), and it looked pretty sharp on the 3DS with the 3D function enabled. There wasnt much that stood out about the title, other than the introduction of Assault and Evasion Maneuvers, which took a bit of the challenge out of the game for me.That said, I really question the need to release the game again, via Ace Combat: Assault Horizon Legacy Plus, which launched last week. Its essentially the same game, but with some Nintendo themed jets, amiibo support for New 3DS owners, and some slightly enhanced controls that are also specific to the New 3DS. Im not sure if this is a case of Nintendo wanting an additional title at the launch of the New 3DS to support the hardware, or if Bandai Namco though they could drum up a few more easy sales, but if you played the original game, Id highly suggest skipping this release.Considering its been 3 and  years or so since the release of the original, Id expect to see a lot more out of this rehash than what we actually got. The campaign is structured the same way via talking heads providing mission details, with most missions consisting of eliminating ground and air targets via lock-on missiles. The enhanced controls arent entirely necessary, making use of the new ZR and ZL buttons, and the C-Stick for limited camera functionality. The original didnt really have control issues in my opinion, outside of the surprising lack of gyro functionality, which again isnt an option here.Also, the game doesnt seem to utilize the slight bump in system power in regards to visuals. In something like Monster Hunter 4 Ultimate, the difference between a standard 3DS and the New 3DS is pretty clear, but I certainly dont see that difference with Ace Combat: Assault Horizon Legacy Plus. The actual in-air visuals still look solid, but the ground textures are generally a muddy mess, with non-descript cities occasionally popping into view. The 3D effect is still nice, and the added stabilization of the New 3DS is certainly a positive, but thats not a game specific feature considering its built into the hardware. Also, theres a bit of slowdown that occurs with just about every explosion, noticeable and annoying considering the majority of the game is made up of causing those same explosions.", "date": "February 19, 2015", "grade": "C"}