{"name": "uWordsmith", "ref": "https://gaming-age.com/2015/02/uwordsmith-review-wii-u/", "text": "As long as I can remember, Ive loved word games. Some of my earliest memories involve playing Scrabble with my parents and grandparents, and its a genre Im still really into today.This is why I was oddly excited to play uWordsmith. I mean, what more could someone like me want? Its a word-based video game! Its not a true substitute for Scrabble, but any port in a storm and all that.Or thats what I thought going in. Now that Ive actually played uWordsmith, I have to admit it doesnt exactly live up to my (probably unreasonable) expectations.My disappointment stems largely from the fact theres really not much to do here. You can look at pictures and use the letters on offer to write out what youre seeing, or you canI dont know, look at blurry pictures, wait for them to clear up enough that you can tell what youre seeing, and then use the letters on offer to write out what youre seeing. As I said, uWordsmith is a little lacking variety.I dont want to be too harsh on the game. After all, its a download-only title that can be had for under $2. And yetI dont know, it seems like there should be more here than there is. There are three game modes  arcade, challenge, and mosaic  but the differences between them are pretty minimal. You can ramp up the difficulty (and considering how easy the easy levels are, youd be wise to do so), but all that does is make the games minimal amount of content fly by even faster.Itll also expose you to the other big flaw, too: the controls kind of suck, particularly when the game gets harder. In theory, dragging letters around on the GamePad should be super easy, but the execution leaves a little to be desired. Its surprisingly cumbersome to drag a letter from one side of the screen to the other, and considering how quickly the timer runs down on the hardest difficulty, it doesnt make for an ideal experience.Of course, the iffy controls are kind of negated by the repetition. There arent a ton of words in uWordsmiths vocabulary, which means that if you play the game for any length of time, youll quickly start to recognize the same words popping up again and again. So even if youll be fighting the controls, at least you wont be getting too mentally taxed.", "date": "February 2, 2015", "grade": "C-"}