{"name": "Pac-Man Museum+", "ref": "https://gaming-age.com/2022/06/pac-man-museum-review-for-nintendo-switch-ps4-xbox-one-and-pc/", "text": "Pac-Man Museum+ recently launched for a variety of platforms, featuring a collection of 14 different Pac-Man releases that span multiple decades, with a selection of titles culled from both arcade and console entries featuring the power pellet munching mascot that originally made his debut in 1980. This selection of games is a pretty solid representation of classic Pac-Man, with some more eclectic entries making the list like Pacn Roll Remix, Pac-Man 256, and Pac Moto. Of course this collection doesnt encompass every Pac-Man title ever released, which isnt surprising, but it is a more robust collection than the original Pac-Man Museum from 2014.Heres the full list of titles available in this collection:Pac-ManSuper Pac-ManPac & PalPac-LandPac-ManiaPac-AttackPac-in-TimePac-Man Arrangement (1996)Pac-Man Arrangement (2005)Pac-Man Championship EditionPac MotoPacn Roll RemixPac-Man Battle RoyalePac-Man 256Of these, there are assuredly going to be entries that dont appeal to everyone, but when you have 40 years of Pac-Man variations to choose from, thats bound to happen. For instance, I could do without Pac-Land, or Pac-in-Time myself, but really enjoy the original Pac-Man, both Pac-Man Arrangements and of course Pac-Man Championship Edition. Its a bit baffling that this release didnt include the superior Pac-Man Championship Edition DX or its sequel, but the original CE is still a really solid title. Its also nice to see that local multiplayer is available in a number of games in this collection, but I would have loved an online multiplayer option, especially for Pac-Man Battle Royale.I also would have liked a bit more emphasis on the history of each entry. Whether that was concept art, high-res cabinet images, arcade or home console manual scans, box-art, level layouts, etc. Unfortunately, Pac-Man Museum+ really doesnt have much to share in that regard, outside of a simple blurb for each game with a barebones description of their history.Bandai Namco does try to spruce up the presentation a bit though, by featuring a virtual arcade in which you can play each game in, and then decorate by earning items for certain in-game achievements or by using coins you earn that can be spent at the gachapon machine. There are various wallpapers for the arcade room, floors, statues, and other decorations that can be unlocked, and if you enjoy room designing it does add some incentive for trying multiple titles and attempting to unlock these items. Personally I didnt find it to be a huge draw though, and again would have been far more interested in the history behind each game. I also wasnt a real fan of needing to unlock the majority of the games, which doesnt require much, but it does essentially force you to play through most titles at least twice in order to unlock another of the 14 games featured here. Its not super time consuming, sure, but if you really dont like something, having to play through it just to unlock something you actually want to play is kind of a bummer.As it stands, Pac-Man Museum+ is a solid selection of games from across Pac-Mans history, but it could also certainly be larger and more comprehensive than it is. It feels more like a random selection of games than a top hits sort of thing, and the additional build your arcade feature isnt particularly interesting. On the plus side, playing through on the Switch in both handheld and TV mode, I felt like the emulation for each title was pretty spot-on. I had seen reports of noticeable lag from a few people, but I never had any big issues with either mode of play. And yeah, its cheap enough and features enough good Pac-Man games that its sort of hard to not recommend it overall. While not super-impressive as a whole, I prefer this focused approach over another generic Namco collection.", "date": "June 15, 2022", "grade": "B"}