{"name": "Hyperdimension Neptunia Re;Birth2: Sisters Generation", "ref": "https://gaming-age.com/2015/01/hyperdimension-neptunia-rebirth2-sisters-generation-review-ps-vita/", "text": "I went into Hyperdimension Neptunia Re;Birth2: Sisters Generation with high hopes. After all, I enjoyed the first game in the series on the PS Vita back in the fall, while the pop idol management simulator, Producing Perfection, was far better than it had any right to be. Considering that the original PS3 version of this game was hailed as being a significant improvement over that first game, it stood to reason that the same would go for Re;birth2.Thats not the case, though. If anything, Re;birth2 actually represents a step backwards for the franchise, as far as Im concerned. Whereas the first two Vita games showed a surprising amount of character depth, this time around the plot and the characters are far less interesting. Gone are the surprisingly strong heroines of the first game; in their place, as the extended title suggests, are their boring younger sisters. None of the new characters seem to have any personality traits other than whiny, which makes them all awfully unpleasant to be around.Even more disappointingly, the humor here just doesnt connect the way it did in the first Vita two outings. This is kind of a big deal, seeing as the whole point of the series is to make fun of the game industry (to the point the games world is literally named Gamindustri). Re;birth 1 featured some pretty decent satire, while Producing Perfection was way more biting than youd think possible from a Japanese pop idol sim. Here, though? There is still some humor present in Re;birth2, but good luck finding it amidst all the aforementioned blandness and whining.Oh, and amidst the fanservice, too. Cant forget that. I mean, Im not going to pretend this is a completely new thing, seeing as the Xbox analogue has always had the most ridiculously bust-enhancing outfit imaginable, but In Re;birth2s case, it just all seems a lot more blatant and gratuitous. Characters are constantly put in poses with legs splayed and underwear showing, while it felt like there were way more single-entendre jokes here than in either of the first two games.Aside from those changes, theres not a whole lot new in Re;birth2 from the first Re;birth. The graphics look pretty similar, as do the characters. Likewise, youre still running through fields/dungeons engaging in turn-based group combat with whatever random monsters you come across. About the only change here is that there are some pretty crazy difficulty spikes early on; be sure to save often, because this time out, youre going to be faced with all kinds of sudden events that will most likely kill you so quickly youll be wondering if you completely missed something. (Note: you didnt, the game just really wants you to grind and grind and grind.)", "date": "January 29, 2015", "grade": "C+"}