{"name": "Fieldrunners 2", "ref": "https://gaming-age.com/2015/01/fieldrunners-2-review-ps-vita/", "text": "Considering that a) tower defenseis a pretty popular mobile genre and b) the Vitas touchscreen makes it well-suited to that particular kind of game, you would think it would logically follow that c) thered be plenty of tower defensegames on the Vita. But thats not really the case; you can probably count the number of them on one hand. If youre just counting the ones worth playing, theres a Pixeljunk Monsters port thats not too bad, and basically nothing else.Enter Fieldrunners 2. Or, as I like to call it, the best tower defense game on the Vita. Admittedly, this isnt a huge accomplishment; when your competition is stuff like Day D Tower Rush and Fort Defense, its not a very crowded field. Still, its easy to imagine that even if there were a few more challengers, Fieldrunners 2 would still fend them all off.To a large extent, this is because the game just works exactly like its supposed to. You wouldnt think simple competence would be a selling point for a game, but, then again, you probably havent played some of those aforementioned competitors. In Fieldrunners 2, its easy to figure out what each tower does, easy to place them exactly where you want them to go, and easy to upgrade them whenever you want. Theres no fumbling around on a hard-to-read map with weapons that dont look very different from each other; here, you just see everything laid out in a clear fashion, and go from there.In other words, were able whittle the list of the Vitas worthwhile tower defense down to 2 just by setting up a very low bar. And what sets Fieldrunners 2 apart from Pixeljunk Monsters HD, you ask? Ill admit, a lot of it just comes down to aesthetic preferences. Fieldrunners 2 looks crisp and clear on the Vitas screen in a way that Pixeljunk didnt, with characters and vehicles and weapons that look bright and shiny. On top of that, theres the fact that Fieldrunners 2 doesnt take a one-size-fits-all approach when it comes to gameplay. Its designed to be playable by gamers of all skill levels, rather than ramping up the difficulty early on; it gives lesser players the chance to play on casual difficulty, while people who want more of a challenge can try the harder difficulty levels.", "date": "January 12, 2015", "grade": "A"}