{"name": "Super Mega Baseball", "ref": "https://gaming-age.com/2014/12/super-mega-baseball-review-ps4/", "text": "I love MLB The Show. Its been one of the primary causes of me jumping into the last three generations of Sonys home consoles and both of their handhelds, and Ive probably spent more time on Road To The Show careers than I have in any other game, ever. That said, Id be lying if part of me didnt kind of miss the baseball video games of my youth, when there were (quite literally) dozens of them and the focus was less on realism and more on simply having fun.Because of that, Super Mega Baseball really strikes a chord with me. Its a throwback to those earlier days, when games like Extra Innings and Little League Baseball simply sought to recreate baseball in spirit, if not quite in graphical approximation. All the teams are fake, all the players are made-up, and basically, if youve ever wondered how RBI Baseball would look with current technology (while ignoring that abomination that released earlier this year), now you know.Thats not to say, however, that Super Mega Baseball will only appeal to 80s kids and people who cant wait four months for the next MLB The Show to get their baseball fix. I mean, being a baseball fan will definitely help, but its clear that this is a game designed to appeal to anyone who just wants a fun game, without all the hassle of learning all the intricacies ofwell, MLB The Show.There are more complex aspects if you want them, of course. If youre the kind of person who adores how much dexterity Sonys baseball flagship can call for, then you can adjust the controls here accordingly, making it so that you hit and pitch by sliding and pushing around your Dualshocks various buttons and thumbsticks. For me, though, being able to play a baseball game where its X to hit and X to throw brings me back to a state of childlike happiness.Likewise, freed of the constraints of realism, its fun to go into a game and not worry about how closely a pixelated player resembles his real-life counterpart. Because they didnt have to be true-to-life, developers Metalhead Software were able to make the players all caricatures and cartoons, which makes them seem, in every possible way, larger than life. (And sometimes female too, which is pretty neat evolution, all things considered.) Likewise, the stadiums all have crazy dimensions and look unique, which a welcome diversion from how same-y all these modern retro parks can feel nowadays.Best of all, though, thanks to ways that technology has evolved over the last 25 years or so, Super Mega Baseball allows you to play full seasons. Im pretty sure that the teenage me  who kept detailed books full of player stats and lengthy save codes  wouldve been blown away by the option of having a cartoon-y baseball game that saved everything. Heck, Im in my 30s now, and Im still kind of blown away by that. Again, as with the players looks, its neat to play a baseball game free of expectations of how players and teams should perform, and simply watch it all unfold organically over the course of a season.", "date": "December 16, 2014", "grade": "A"}