{"name": "Never Alone", "ref": "https://gaming-age.com/2014/12/never-alone-review-xbox-one-ps4/", "text": "On an ethical level, I adore Never Alone. Its the first game made by a native studio, Upper One Games (in partnership with E-Line Media), and its an attempt by Alaskas Iupiaq people to tell their own story, rather than having other people tell it for them. Not only that, the story centers around a girl and her arctic fox companion  not exactly your traditional gaming heroes. Considering that were talking about a medium that has produced the likes of both Custers Revenge and Gamergate, Never Alones very existence represents pretty amazing progress.Even better, the game delivers on what it sets out to do from an artistic perspective. Never Alone(Kisima Ingitchuna) is gorgeous, and weaves in all kinds of Iupiaq and Alaska Native imagery in a way that games havent done  or, really, even tried to do  before. On top of that, the games story (or, more accurately, stories) centers around Iupiaq mythology, which means Never Alone goes into territory that games havent traditionally trod. Take those two things together, and you have a recipe for a game that, from an aesthetic perspective, delivers some truly fresh-feeling experiences. When else do you get sent on quests by owl men, or ride on the backs of animal spirits? Theres no way to describe it all as any way other than very, very cool.Unfortunately, no matter how great a games ethical and artistic merits may be, the fact is it still needs to deliver from a gameplay perspective, and on that front, Never Alone falls a little bit short. For one thing, as a co-op platformer, it doesnt do a whole lot different in terms of what it asks you to do. The setting and characters may be fresh and new, but theyre still operating within a pretty standard genre. The fox is a little more nimble and spry, the girl is larger and can throw a bolo, andwell, you can probably figure out the rest from there.Being somewhat conventional when it comes to gameplay, however, is forgivable. Whats harder to ignore is that Never Alone features all kinds of glitches that will either cause instant death or force you to restart your console. During my time in the game I discovered ropes that couldnt be climbed, icebergs that didnt move the way they were supposed to, and terrain where youd simply fall through without any explanation. And, of course, there were the death animations; while it starts out being heart-rending to hear the girl mourn her fallen fox, its a lot less heart-breaking when the fox is vibrating rapidly on the ground, all the while spinning around in a circle.Oh, and apropos of nothing, I should also mention that some may find Never Alone to be a little on the short side, with a campaign that can be beaten in around 5 hours. If youre like me, with an unending backlog and limited time in which to game, that may not be a bad thing, but if you want a really, really long experience, this isnt it.", "date": "December 15, 2014", "grade": "B"}