{"name": "Lara Croft and the Temple of Osiris", "ref": "https://gaming-age.com/2014/12/lara-croft-temple-osiris-review-xbox-one-ps4-pc/", "text": "Lara Croft and the Temple of Osiris is the follow-up to 2010s co-op focused Lara Croft and the Guardian of Light, again opting to focus on the co-op experience, with plenty of action and puzzle solving to boot. Like the previous title in this Tomb Raider spin-off, youll guide Lara through a number of tombs, this time in an effort to ward off the fiendish Egyptian deity Set. Lara is aided by a large number of weapons, a mystical staff, timed explosives, and some time altering mechanics as she attempts to survive the curse bestowed upon her.While perfectly playable alone, youll get a bit more out of Lara Croft and the Temple of Osiris with a friend in tow. Single-player defaults to you controlling Lara, but an additional player can opt to choose between two Egyptian gods, or another human player that takes on the role of a rival treasure hunter. The gods provide a support role of sorts, while the humans come equipped with a set of functions allowing them to solve the various puzzles youll encounter. Either alone or with a friend, Lara Croft and the Temple of Osiris is a fun romp through the Tomb Raider universe, and a worthy follow-up to Guardian of Light.Like Guardian of Light, Temple of Osiris features an isometric, fixed camera to guide the action of Lara Croft and friends. Theres a hub world of sorts, which gives Lara access to both story-driven Tombs and optional Challenge Tombs, which generally contain more focused puzzles to solve. Both Tombs also offer up multiple rewards, including rare weapons, along with health and ammo upgrades. While completing these Tombs isnt necessarily a huge challenge, knocking out the optional objectives required to gain most of the weapons and upgrades can be pretty hard. Theres also some nice variations in the challenges from one tomb to the next, making most of the challenges feel pretty unique.Another nice feature is that adding players via co-op will change the difficulty of the game a bit. Both puzzles and enemies will increase or be altered by new players joining, rebalancing the game on the fly in order to prevent the experience from feeling like a cakewalk. Again, I dont think most will find Temple of Osiris to be particularly challenging, but the difficulty scaling by player count is certainly a smart idea to implement in a co-op focused game like this.Controls are easy enough to master, with the basic shooting mechanics taking on a twin-stick shooter approach. Characters move via the left analog stick and aim with the right, with shooting done via the right trigger on the controller. Characters can switch between four different weapons (out of a dozen plus), set to directional inputs on the D-Pad. Lara and crew also have a handful of other tricks up their sleeves, like torches to light their way through darker areas, a grappling mechanic that can attach to large, golden rings, and an explosive that can be detonated from a distance, used to take out enemies, find hidden treasure, or trigger various switches.My only major issue with Lara Croft and the Temple of Osiris is that the far-away isometric camera can sometimes become a hinderance for platforming and combat. In combat, particularly in a handful of encounters, it can become difficult to see where your character is. This becomes more aggravating when theres instant death hazards around like pits and spikes, and I died often enough in situations like these that Id consider it a problem. The camera can also be an issue when scaling walls with your rope, or attempting to wall-run while your rope is connected to a golden ring. With a few areas Id be positioned in a way that I couldnt tell if I was climbing vertically or horizontally, which in turn led to some unfortunate deaths. Checkpoints in Temple of Osiris are frequent, so death isnt a huge issue, but these are annoyances that Id rather see ironed out.", "date": "December 9, 2014", "grade": "B+"}