{"name": "Aqua Kitty: Milk Mine Defender DX", "ref": "https://gaming-age.com/2014/12/aqua-kitty-milk-mine-defender-dx-review-ps-vita-ps4/", "text": "I dont think that game premises get much cuter than that of Aqua Kitty: Milk Mine Defender DX. Youre playing as a kitten, and your goal is to defend the worlds naturally-occurring milk reserves from alien invaders. If that doesnt fill you with warm fuzzies, you may as well be dead.Of course, a game is more than just its premise, which means that Aqua Kitty DX needs to be judged on more than simply how cute it is, but other factors as well, like how nice it looks or how well it plays. And on that scorewell, it has a super-cute premise, right?Okay, that probably overstates the depth of Aqua Kittys problems. Its by no means a bad game  just a very, very repetitive one.Admittedly, thats kind of the point of the whole thing. This is an arcade game where you just go back and forth across the sea floor, shooting enemies as they appear and protecting the kitty milk miners (AWWW!) from the alien ships trying to steal them away. Its justthats all there is. Theres an endless mode, and you can always try for new high scores on each level, but everything youll get to do in Aqua Kitty DX basically reveals itself within its first few minutes, and if that doesnt do anything for you, youre pretty much out of luck.Similarly, the graphics arent anything amazing. Theyre sprite-based and sorta retro, but they dont have much of a personality beyond that. Considering the game is going for a 80s arcade feel, I guess that they fit, but theyre still unfortunately forgettable for a game with such a distinctive idea behind it.Now, in Aqua Kitty DXs defence, I will say that the controls are pretty easy to grasp  definitely an essential thing when youre going for a just one more time kind of game. The R button sends you right, L sends you left, and X is to shoot. It may seem a little strange at first, using the shoulder buttons instead of the thumbsticks, but it doesnt take long for it to feel like second nature.", "date": "December 5, 2014", "grade": "B"}