{"name": "Far Cry 4", "ref": "https://gaming-age.com/2014/12/far-cry-4-review-ps4-xbox-one-pc/", "text": "Far Cry 4 is by far (see what I did there?) Ubisofts best game this year. Assassins Creed: Unity, Watch_Dogs and Just Dance 2015 were adequate enough releases, and the jury is still out on The Crew at the moment, so its kind of a no-brainer to be honest. With their other franchises faltering to an extent, Far Cry 4 clearly rises above the rest of their 2014 library.Its pretty easy to spot a big budget Ubisoft-developed title these days and Far Cry 4 is most certainly a game which checks all those usual Ubi boxes: a large, gorgeous open-world environment, a story based on some sort of political struggle or uprising, a map literally bursting with places to explore and/or liberate, and more missions and activities than any sane human would strive to complete 100%. Oh, and dont forget the trademark scalable tower structures. So yup, Far Cry 4 is clearly an Ubisoft game, though it is one that finds a comfortable balance between storytelling and the optional stuff. It doesnt hurt that its exotic Himalayan setting is interesting and gorgeous too.In this latest entry in the franchise, Ubisoft cobbled together what worked in previous Far Cry games and cut out some of the junk that did not, and wrapped it up with some well thought out systems and solid FPS gameplay. And thankfully, they steered clear of the all-American surfer dude style main character from the last game for someone with a little more substance and background.FC4 places you in the hiking boots of Ajay Ghale, a young man who is determined to carry out his late mothers wishes by delivering her ashes to her birthplace, Kyrat. Little did Ajay know that visiting Kyrat, to spite its snowy mountains and tropical beaches, wouldnt exactly be a vacation. This fact is especially true thanks to the countrys brutal (though stylish and charismatic) dictator by the name of Pagan Min. The twist is that Ajays parents were actually incredibly important Kyrati citizens, both of whom served a higher purpose in the band of rebels known as the Golden Path. It doesnt take long for both Pagan Min and the Golden Path to realize Ajays importance, which of course causes a fair share of drama in the region as one may expect.The whole premise and tone of Far Cry 4 is very different from Far Cry 3. In 3, youre desperately trying to save the lives of your imprisoned friends and escape Rook Islands by any means necessary. FC4 on the other hand takes the main character on what appears to be a less-selfish and at times spiritual journey to help save his parents revered homeland. Far Cry 4 provides gamers with choices throughout the adventure that, to an extent, will influence the path that Ajay takes to accomplish this goal.The 30 or so campaign missions in Far Cry 4 are sandwiched between dozens and dozens of optional quests, events and activities that can very quickly suck up more time than the actual story. Of course, the game directly encourages players to do their own thing by tying Ajays upgrade tree, inventory and abilities to XP, crafting, Karma and currency systems that reward you for basically doing anything. Hunting animals yields materials to craft equipment that can hold more weapons, items, ammo and so forth. Earning XP by taking down enemies, finding new locations, or liberating areas earns upgrade points that can unlock new abilities on the skill tree. Performing tasks which include rescuing hostages, helping citizens, or using clean kills when hunting animals adds to your karma level which can unlock new equipment and rewards, such as discounts when purchasing new items.High on the list of important activities in Far Cry 4 is tracking down and climbing bell towers to reveal even more activities and weapons, and liberating outposts to provide for an additional (though not always safe) place to rest up, meet up with fellow rebels, purchase equipment and unload your useless loot. Many of these ideas existed as far back as Far Cry 2, although they are a bit more streamlined here in comparison as compared to the earlier games in the series.If you spent any time playing Far Cry 3 and/or Blood Dragon you should kinda know what to expect from Far Cry 4 in terms of gameplay. Ubisoft has come close to mastering the art of first person open world controls, and Far Cry 4 follows in the same footsteps as previous releases. From shooting and driving vehicles, to climbing mountains and swimming, and nearly everything in between, the controls are very nearly spot on. With that being said, Im not a big fan of the default vehicle controls which utilize the left stick for acceleration, brake and steering, though switching to the classic scheme using L2/R2 fixed that up pretty quickly.Far Cry 4 throws a pretty healthy selection of weapons and upgrades at players, but not so much that they need to be micromanaged. New gear, whether it is an upgraded recurve bow with fire arrows, or a grenade launcher, can be purchased, picked up and/or unlocked by accomplishing certain goals  liberating bell towers for instance. The game honestly gets a whole lot easier if you frontload your experience by hunting animals and crafting a larger ammo pouch, loot bag, wallet, etc. Its way too easy to get distracted by the random world events and sidequests, and at one point itll look like someone vomited on the overworld map with the sheer quantity of icons for discoverables, loot, quests, missions and events just waiting to be completed.Even with heavy firepower at your fingertips, the game generally rewards stealth over destruction all throughout. It doesnt take much to trigger an alarm and find that Ajay is quickly outgunned by eagle eyed snipers, a swarm of food soldiers or those sneaky Rakshasa hunter bastards. Once alerted of your presence, enemies can annoyingly pick you off from incredible distances, so if possible, keeping patient and attempting to not break cover is the best strategy. If you do need to go in guns a blazing, it helps that you can call in local mercs for backup, or even better, get involved in a co-op game with friends/other players (more on that later).A game as big as Far Cry 4 honestly doesnt need a multiplayer mode, or even a map and challenge editor, but it does, so its just icing on the cake. The 5 on 5 multiplayer is a fun distraction for a bit and the tools to create and share maps and throw them out to the community to play and rate are surprisingly robust. The drop in/drop out, open world co-op play sounds great on paper, but I had all sorts of issues joining games or having others join mine. For tackling well-guarded strongholds its practically a requirement to have some co-op assistance, so hopefully Ubisoft can smooth out the rough edges. As it is, the experience is fairly clunky and glitch, and requires the joining player to reload when the other joins or leaves the game. Not all progress is earned by the second player either, meaning outside of XP/Karma/Rupees, certain goals that are completed are not applied to the visiting player. So the feature needs some work, though its at least admirable that Ubi attempted to work it into the game. (right?)Running on Ubisofts Dunia Engine, Far Cry 4 is a damn fine looking new generation game on all platforms. Humming along at a nearly solid 30fps at 1080p on the PS4, the engine effortlessly tosses around quality textures, lighting effects and lush interactive vegetation like nobodys business. Being an open world game, youll come across a few angular rock formations or odd textures from time to time as expected. Seriously though, the trees, grass, weeds, shrubs and whatnot dynamically react to the wind, player movement and other events, and the overall effect is really second to none. Ubis impressive fire effects return as well, which means you can set entire areas on fire and watch the destruction spread across structures and foliage (insert evil grin here). The draw distance in FC4 is massive, and taking to the skies in the buzzer copter and flying clear across Kyrat shows off how solid the engine is.As for voice work, music and effects, Ubisofts sound design team has put together what feels like an authentic experience with a soundtrack inspired by Himalayan culture and an assortment of regional accents. The game is generally filled with ambient sounds of nature, gunfire in the distance, and Kyrati citizens going about their daily routines, with background music kicking in during key events. If you hear a call for help, its most likely worth investigating for some bonus Karma.", "date": "December 5, 2014", "grade": "A-"}