{"name": "Senran Kagura Bon Appetit", "ref": "https://gaming-age.com/2014/12/senran-kagura-bon-appetit-review-ps-vita/", "text": "Senran Kagura Bon Appetit is a mind-bogglingly stupid game. This shouldnt come as a surprise to anyone. After all, its the latest game in a series that exists primarily  if not solely  so that developers can master the art of boob physics, while throwing jobs to writers who are generally a meaning short of being able to write suggestive double entendres.Of course, no one is looking to Senran Kagura for mental stimulation. Other types of stimulation, sure, but if youre going into Bon Appetit looking for anything remotely intelligent, youre doing it wrong. This series has always been about underage girls saying suggestive things and being maneuvered into suggestive poses, and just because Bon Appetit is a rhythm-based cooking game doesnt mean any of that has changed.What is surprising, however, is that the gameplay itself isnt half bad. I went into this game expecting the absolute worst  my view of last months Shinovi Versus has only gotten worse over time, and it wasnt very charitable to begin with  but I quickly learned that if youre able to look beyond the girls talking about wanting big, thick things in their mouths and girls dressed only in whipped cream, its awfully easy to get hooked. Admittedly, thats asking you to look past quite a bit, but if you can, youll find that this is a rhythm game designed for people of all skill levels  and I say this as someone with an extraordinarily bad sense of rhythm. Bon Appetit has easy levels that are genuinely easy, hard levels that are challenging, and a good mix in between.Of course, if youre simply too creeped out by the absurd extreme to which Bon Appetit takes its, er, sexiness, thats wholly understandable. I found myself constantly skipping over everything I could, just to avoid the cringe-worthy dialogue and mind-bogglingly stupid scenes. And even if thats not enough to put you off, then youll also need to have a pretty high tolerance for J-Pop, because thats all youre going to get here. (Though the J-Pop is way less of a deal-breaker  I can barely stand the stuff, but I was still able to tolerate it for the purposes of this game.)", "date": "December 2, 2014", "grade": "B"}