{"name": "Captain Toad: Treasure Tracker", "ref": "https://gaming-age.com/2014/12/captain-toad-treasure-tracker-review-wii-u/", "text": "Did you enjoy the Captain Toad segments of Super Mario 3D World? Then youll likely love Captain Toad: Treasure Tracker! I know that comes as a pretty big shock, but you can take solace in knowing that Nintendo EAD didnt drop the ball in transitioning a handful of fun stages from one game, into a full-fledged, standalone experience. My primary concern before playing was how worn-out the concept might feel after a couple dozen stages, but considering Ive finished the game and continue to play for collectibles and bonus objectives, repetitiveness is not an issue here.And thats thanks to the fantastic diversity in the various levels contained within Captain Toad: Treasure Tracker. Youve got your expected variations based on familiar locales within the Mario universe, like Ghost Houses,lava and snow stages, grassy fields, and so on. But the enemy variety and layout of those stages are top notch, with occasional power-ups that can change-up the gameplay when used. The puzzles are never particularly taxing, and youll have little trouble finishing most stages. But hunting down the three diamonds in each stage, along with other hidden items like Golden Mushrooms, can take a fair amount of effort to find.In addition to collecting diamonds, every stage has its own bonus objective to complete. This can run the gamut of collecting a certain number of coins to defeating (or avoiding) every enemy within the stage. Youre not privy to what these objectives are before starting a stage, so depending on how thorough you are, youll likely need to make duplicate runs through a single stage in order to fully clear it. But considering the stages are relatively short, this never feels like a chore or aggravation, and on occasion youll luck into completing an objective without realizing it.Captain Toad: Treasure Trackers tale is broken up into three individual books, which in turn contain multiple stages to complete. Each book is sort of a self-contained adventure, with player control switching back and forth between Captain Toad and Toadette. Both characters have an identical skillset, but its nice to see both of them represented here. Both have very cute, whimsical reactions to different situations, through gameplay and the handful of cutscenes contained within each book. That old Nintendo charm is hard to classify, but Captain Toad: Treasure Tracker certainly has it in spades.The controls are pretty straightforward, but this is strictly a Wii U GamePad experience. There are certain stages that will feature moving platforms, manipulated via the touchscreen. Other platforms will make use of the mic function, having you blow into the mic in order to move a platform up and down, or left and right. Another GamePad specific mechanic comes from the handful of mine cart stages, where youll be equipped with an unlimited supply of turnips, which Toad and Toadette toss out as the mine cart moves automatically along a path. The turnips can be used to hit coins and diamonds to collect them, defeat enemies, and destroy breakable objects like POW blocks or bricks. For these stages the GamePad screen will switch to a first-person view, and you can either use gyro or analog controls to move your aiming cursor around.Im not a huge fan of the more gimmicky elements used here, but theyre so few and far between that I found them pretty inoffensive. The mine cart stages are the biggest disappointment, because they force you to look at the GamePad screen throughout, whereas the moving platforms are easily manipulated without taking your eyes off of the main screen. Again, this is sort of a minor complaint, but I certainly felt like the mine cart segments were the weakest points of Captain Toad: Treasure Tracker.Of course, when your biggest complaint is a handful of forced gimmick stages out of the 50 or more featured, you know youve got something good on your hands here. Captain Toad shines in both visuals and its fantastic soundtrack, which isnt as overly reliant on familiar Super Mario tracks as I thought it would be. Theres some fun callbacks here, but by and large the original tunes featured are pretty fantastic. The brightly colored world pops in HD, and seeing beautifully animated, 3D renders of rarely used Mario foes is a pretty big plus.", "date": "December 1, 2014", "grade": "A-"}