{"name": "Horse Tales: Emerald Valley Ranch", "ref": "https://gaming-age.com/2022/11/horse-tales-emerald-valley-ranch-review-for-nintendo-switch-playstation-pc/", "text": "As strange as itll sound, a big part of what attracted me to Horse Tales: Emerald Valley Ranch was its boxart. Between the colour palette and the character on a horse, the game gave me some vaguely Breath of the Wild-esque vibes. Obviously, seeing as Horse Tales is about restoring a family estate to its former glory, were not talking about a game thats even remotely Zelda-ish, but still  with all its talk of exploring an open-world island and uncovering the islands secrets, I didnt think it was too much to ask that the game might offer some fun exploration.It took about 30 seconds for those hopes to be dashed. My character got off a boat, stepped foot on the islandand the game immediately froze for about a minute. Just stopped working entirely. And when it started working again, everything looked like smudges of colour splashed across the screen for a few long moments, until it finally mostly righted itself.The good news is that the complete freeze was a one-off event. Horse Tales slowed down considerably at regular intervals, but it never quite stopped working completely after that.The smudges, however, were a pretty frequent occurrence. No matter what I was doing, no matter what was on screen, out of nowhere, everything on the screen would basically dissolve into blobs of colour. Let me put it this way: Horse Tales performance was so abysmal, it made Sonic Frontiers on the Switch look like a graphic masterpiece.That wasnt the only thing wrong with Horse Tales, either. It also suffers from having a terrible camera that you constantly need to readjust, and that regularly gets stuck behind trees and mountains. It doesnt move very quickly, either, so if youre doing something that requires seeing where youre going  say, a horserace, which is one of the games core activities  youll have to be okay with riding blind for a few seconds while the game catches up to what youre doing.The biggest problem with Horse Tales, though, is that the gameplay just isnt very fun. While theres some room for exploration, its kind of ruined by the constant fetch quests and grinding that make up the bulk of the game. Youll get sent from one side of the island to the other to find something or someone, and then once you arrive, theyll send you back to where you started to get an item that you need to bring back. On top of that, there are regular horseraces, which you need to compete in to build your fame and unlock more buildings  except these are hindered by the lousy camera and buggy graphics, and your margin for error in most of these races is literally zero. The moment you slip up, youll have no chance of matching the best time on the leaderboards, and if you cant do that, you cant progress the game forward properly.I know that, as a middle-aged man, Im clearly not the target audience for a game about rebuilding your family estate and bonding with your horse. At the same time, though, I cant imagine that the people who would be interested in that would want to put up with it, either. Horse Tales plays poorly and performs even worse, and its bound to disappoint anyone who picks it up.", "date": "November 28, 2022", "grade": "D+"}