{"name": "LittleBigPlanet 3", "ref": "https://gaming-age.com/2014/11/littlebigplanet-3-review-ps4/", "text": "Like it or not, LittleBigPlanet 3 was kinda sent to die. Wedged between releases of Call of Duty: Advanced Warfare, Assassins Creed Unity, Far Cry 4, Grand Theft Auto V, Super Smash Bros Wii U and a pair of Pokemon 3DS titles, it will surely be overlooked this holiday season. If it were a unique, top tier AAA release like the original LittleBigPlanet (and the sequel to an extent), it would be a shame; unfortunately, as much as I adore the franchise, LBP3 is a game that I suspect not many fans really asked for or expected.LittleBigPlanet 3 is still a charming platformer and creative sandbox at heart, yet without the full attention of Media Molecule, it feels like it sorta lost its soul. At first glance you would probably think that you were playing a proper LBP game by the original developers, but it doesnt take long to realize that its not quite up to the same level of polish or whimsical creativity that MM is usuallyable to whip up. The levels, the story, the music and interface provide for a LBP-like experience, although xDev and Sumo Digital cant quite duplicate the patented Media Molecule magic in LBP3.Ive thoroughly completed (and aced) the single player story mode in all of the previous LBP titles including the PSP and PS Vita releases; theres no way I can see myself doing the same in LittleBigPlanet 3. Even with a trio of new playable charactersjoining Sackboy(OddSock, Toggle and Swoop), and new abilities/gadgets to play around with, I never felt compelled to 100% the story levels or the optional challenges orquests  or spend much time in the trio of hubs that they are organized aroundfor that matter. The game supports up to 4 local or online players in any combination, except the levels do not lend themselves well to co-op play at all. The story mode is short and fairly frustrating at times with too many one-hit deaths and easy to miss stickers and point bubbles. There are a few super simple puzzles that require a second player (or just a controller), but none that need 3 or 4 players to tacklelike in previous games. Since all players share one set of lives (indicated by the ring around each checkpoint), it is frequently easier to just have other players drop out during a difficult sequence just to avoid replaying the whole level again. By the time you are introduced to all 3 characters, the relatively forgettable story more or less wraps up and ends.You can of course jump back into any of the levels with the newly unlocked characters to grab the few missing stickers or bubbles, or take on the side-quests, though unless youre a completionist or a hardcore crafter, theres no real incentive to do so. I have fond memories of replaying LittleBigPlanet levels over and over again with friends to find that hard to reach sticker or ace a level, and I sadly dont see that happening much with LBP3.Thats not to say the entire story mode is a waste of your time  there are some bright spots including fun and inventive platforming sequences and humorouswriting and voice work. Some of the levels are more memorable than others such asa those from the1950s inspired Manglewood hub which featuresauthentic licensed music including Dodie Stevens Pink Shoelaces (good luck getting that out of your head).Of course, only half of the LittleBigPlanet experience is actually playing the pre-made levels. The create and share concept is what the game was built on, and thankfully that still retains its identity  for the most part. LBP3 is backwards compatible with nearly all LBP1 and LBP2 unlockable items and content, and its pretty awesome that you can import your profiles from previous games and download/play the 8.5million or so user created levels. The creative tools, along with the new gamified Popit Puzzles and tutorials do a nice job getting less creative players (like myself) interested in the more creative experiences offered in the series. The tools in the PS4 version are a nice step up from the earlier titles with touch pad integration for resizing and positioning objects and support for recording video clips and attaching them to your custom made adventures. Also new is the ability to create custom power-ups and a weather tool. The browse/search tools are a little lacking, though with 8.5 million pieces of user generated content theres probably no easy intuitive way to organize it all.The popit interface still works well, yet it can be occasionally confusing for those who dont spend time learning about the tools, materials, actions, objectsand behaviors. Creative-types can definitely spend countless hours creating and sharing custom adventures and games, and players can reap the benefits by downloading the new content and getting involved in the community  so its a win-win.LittleBigPlanet 3 is a fine looking game, though not one thatfrequentlyscreams next-generation. The PS3 titles were legitimately impressive back when they were released thanks to the subtle motion blur, filmic effects and interesting rendering techniques. Its obviously much more difficult to impress gamers with the same basic presentation these days, evenwith 4 times the texture resolution and some new effects and lighting. The game runs at 30fps in 1080p natively and hardly seems to tax the hardware under most circumstances. LBP3 does have some small issues though, such as rendering/performance quirks with content created in previous LBP games and an annoying delay whenever accessing the popit. With a pre-release patch already out there and a launch day patch scheduled to go live soon, hopefully the experience is polished up. A PS3 version is actually shipping alongside the PS4 game and we assume it looks more or less in-line with LBP2.", "date": "November 17, 2014", "grade": "C+"}