{"name": "Costume Quest 2", "ref": "https://gaming-age.com/2014/11/costume-quest-2-review-for-pc/", "text": "It sounds dismissive to call a game more of the same. Really, this phrasing sits in a best case scenario of being the safest route a sequel could present, and at its worst is a dispassionate money grab. Double Fine hasnt ever offered us more of anything up to this point, but their first-ever sequel of Costume Quest 2 comes off as exactly that: more of the same. Its a knee jerk reaction to call it that, but one that stands true throughout the duration of Costume Quests successor. So, is that a good thing?Well, sure, if Costume Quest is your kind of thing. The story is of a similar length and pace, battles play out as they did in the first game, and the adorable look and dialog are all back in form. Its also stuffed with Halloween spirit, with a confident foothold in gaming as the only game to simulate trick-or-treating.In typical Double Fine fashion, the games personality is more endearing than the gameplay itself. In the case of Costume Quest, its always been limited by the basic nature of its turn-based combat. While theres nothing wrong with being accessible, there havent been any game-changers to spice things up for RPG veterans, which can lead to a bit of boredom after a few hours. This is balanced out with the inclusion of timing attacks for bonus damage  a Paper Mario mechanic that the previous game also used.Costume Quests combat may be highly animated and fun to watch, but its almost half asleep when it comes to player interaction. It would have been great to see a little confidence in what players are capable of, rather than keeping to tradition. Then again, Costume Quests whole theme is tradition; its the ritual of trick-or-treating, or of having another main villain and snappy dialog.I havent played Costume Quest since it came out, and I never finished it thanks a bug patched in post-release that wouldnt let me wear a fry suit or something. Unfortunately, thats my strongest memory of Costume Quest, second to the heartwarming Halloween setting. With Costume Quest 2, it seems that there arent any game-ending bugs.  What there are, however, are several points where you could have fooled me into thinking Id hit another brick wall  thanks to poor communication on a handful of quests and the overworld map designs. Its nice to have these elements, but clinging too closely to the style of the world (by laying out a map region as if a child drew it) manages to overcomplicate what should be a useful feature.Despite the frustration of delivering a fairly accessible game with poor communication skills, Costume Quest 2 delivers more of the same. The Creepy Cards feel overpowered, but give a thin layer of complexity to drape across its unchanged combat system. The dialog is all worth paying attention to, and costume designs come at a nice and steady pace to keep things fresh. Candy Corn would agree, youll want to keep mixing things up.Its a Double Fine sequel, with sequel traditions and a continuation of what they started in the first Costume Quest. Id love to see any trilogy cap get more stylized with its art, maybe a more textured stop-motion aesthetic, but that may have something to do with the out-of-place water and lighting effects that seem like theyre from a totally separate game ratcheted up a few levels in rendering tech. The music is also fine, neither disappointing nor finding its true voice.", "date": "November 6, 2014", "grade": "B-"}