{"name": "Stealth Inc. 2: A Game of Clones", "ref": "https://gaming-age.com/2014/10/stealth-inc-2-game-clones-review-wii-u/", "text": "This is going to sound like insane hyperbole, but I swear it isnt: Stealth Inc. 2 might just be my most anticipated game of the Fall. Seriously. The only thing that maybe comes close is Sunset Overdrive (which, admittedly, I bought an Xbox One for), but it should say a lot about the quality of last years original  which was easily one of my favourite games of 2013  that some sadistic little indie game is, at least in my mind, up there with one of the biggest AAA releases of the year.The crazy thing, though? This sadistic little indie game completely and entirely lives up to my expectations. Considering I was going in hoping for a strong GOTY contender, thats saying a lot.It helps, of course, that Curve didnt change things around too much. Everything that worked so well last time is back in full force here, too. Challenging puzzles? Check. Dark, Portal-esque sense of humour? Check again. Anduhwell, puzzles and a sense of humour are pretty much the extent of it. But when theyre done as well as they are here, thats really all you need.I mean, take the humour as an example. Stealth Inc. 2 isnt just a game that wants you to fail, its a game that makes no attempt to hide that fact. Like the first time around, it lives up to its PC title of Stealth Bastard by rooting for your failure loudly and actively. While Im not going to tell you whether the game features the same kind of hilarious gut-punch ending that the first game had, I can confirm that Stealth Inc. 2 also takes every opportunity it can to let you know that it thinks youre going to fail  and, moreover, when you do, it doesnt hesitate to gloat about your misfortune.And make no mistake, youre going to fail a lot. Thats simply the nature of the game, and unlike the first outing, there are no PC walkthroughs to help you through the tough parts. Youre going to have to die lots and lots of times to feel your way through Stealth Inc. 2, and theres not any easy way around that. Its all about trial and errorand error, and error.", "date": "October 29, 2014", "grade": "A+"}