{"name": "Ar nosurge: Ode to an Unborn Star", "ref": "https://gaming-age.com/2014/10/ar-nosurge-ode-unborn-star-review-ps3/", "text": "Ill be honest with you: I went into Ar nosurge: Ode to an Unborn Star without any prior knowledge of its universe or mythology. Its something I try to do for every new game I play, since I like to assess individual games on their own merits, rather than any unfounded notions of what they should be. Thats generally worked pretty well for me. Here, though? That approach is a recipe for disaster.See, Ar nosurge is really, really, really not for novices. Not only is it a sequel to the unlocalized, Japanese-only Ciel nosurge, its also a prequel to the whole Ar tonelico franchise, which Wikipedia informs me is somewhat sprawling. Its such a huge game that not only does its NeoGAF thread have required reading, its required reading is just a condensed version of this massive multimedia behemoth. Essentially, you dont go into Ar nosurge just for its own sake, youre going into it because youre already deeply immersed in its universe and the characters and peoples who populate it.Which, to be frank, is not me in the slightest. For someone like me, the game is akin to a sitting through a series of Cybernetic Ghost of Christmas Past from the Future monologues, each of which has some words and ideas that I can kind of wrap my head around, but which, for the most part, refer to all kinds of things that have zero meaning for me. No judgment from me if you are into with the whole Ciel nosurge/Ar Tonelico mythology, but Im seriously not qualified to tell you at all how well Ar nosurge weaves itself into the franchises larger fabric.And to some extent, that kind of bums me out. Not because the story seems like something I absolutely need to have in my life, but rather, because the combat is surprisingly fun. Where most JRPGs with turn-based battles seem to vie with each other for who can draw things out the most, Ar nosurge is set up so that you spend its battles mowing down wave after wave of enemies via huge combos. Considering how much the game asks you to invest in learning its stories, it surprised me a little that it would take practically the opposite approach to its fighting, but Im not going to complain. Ar nosurges combat is fun enough that I was willing and able to sit through seemingly endless exposition just because of the constant promise of more fighting being just around the corner.", "date": "October 15, 2014", "grade": "B-"}