{"name": "South Park Pinball", "ref": "https://gaming-age.com/2014/10/south-park-pinball-review-ps4-xbox-one/", "text": "Zen Studios are, lets face it, the kings of videogame pinball at this point. In a day and age when pinball is a dirty nostalgic word, the good folks at Zen Studios have created some of the most memorable and addicting tables in recent memory  all coming after the genre had been virtually extinct. To spite the tables being solid and fun scoring machines, it doesnt hurt the fact that the developers have been able to scratch up some of the most beloved pop culture icons to help inspire their creations. From Star Wars to Marvel and most recently the Walking Dead, Zen Studios has taken beloved themes and given them pinball machines that, not only never insult their intelligence, but very well fit the lore that each theme represents with impeccable accuracy. Their latest two tables based on the South Park series furthers this ever growing number of kick ass tables and provides fans with more silver ball finger flipping action. South Park Pinball not only will appease fans of Zen Studios work in pinball, but will get a marvelous chuckle from the fans of Matt and Treys South Park fan base as well.As I already mentioned the new South Park Pinball tables increase the Zen Pinball 2,Pinball FX2 number of tables by two, one based on the overall South Park universe, and the other focused on the loveable Butters character. Both tables are rich with detail, high scores, and notable surprises, while being relevant to the South Park universe with quotes and scenes taken straight from the shows best and critically acclaimed episodes.The South Park: Super-Sweet Pinball table will provide fans with a number of pleasantries that will not only make you grin on the scores you toss up, but with the humor and situations that are presented throughout your trip down to South Park. The gauntlet of goodies and challenges include; collecting STAN to prevent Stan from throwing up when Wendy walks by, playing a mini game of Sarcastaball, defeating Bat Dad by collecting RANDY, collecting the treasures of Smugglers Den by collecting MANBEARPIG, collecting KYLE and hitting the toilet for Mr. Hankey Multiball, collecting CARTMAN to open the alien probe and defeat the visitors spaceship, collecting CHEF to invite some ladies in for some sweet salty chocolate ball loving from Chef and collecting SCHOOLBUS to unlock a road trip multiball, collecting KENNY towell Kill KENNY. Completing all these tasks will earn you the letters SOUTHPARK and unlock the wizard and final mode. Other goodies include a Cheesy Poofs multiplier, collecting TIMMY for a frenzy mode, Terrence and Phillip bumpers complete with fart noises, a Christmas in Canada Super Jackpot option, an episode where collecting all 247 icons will earn you a huge bonus, and of course multiple ways to earn extra balls. To say this table is a score fest would be an understatement.Next up, every knowsits Butters! This charming table known as Butters Very Own Pinball Game doesnt have the chaotic frenzy of modes and success to score ratio compared to its brother, but its still a fun table nevertheless. The main portion of the game asks you to complete the 5 main modes and unlock imagination land to reach Wizard mode. Modes in this table includes unlocking a 3 ball multiball in Hawaii for Butters Hapa Noa ceremony, collecting VAMPIRE so that Butters can become a vampire to avoid being grounded, locking the balls to have Butters dress up like Marjorine to steal the future telling device from the all girls sleepover, helping the Mexicans cross the border in a game of Texans vs. Mexicans, and becoming Professor Chaos to take on Coon & Friends. Completing all of the challenges will open up the option to go to Imaginationland and earn the big jackpot. Other score raising helpers are spelling NINJAS, LOO LOO LOO, FELLAS, and GROUNDED, and there are Biker and Chaos multiball modes, a ramp that will give random presents to his girlfriend Lexus ranging from 10 million points, to extra balls, and lighting up AWESOM-O which will activate Butters Robot who comes up with movie ideas. Butters table features more niche moments as compared to the first table, unless you are a giant Butters fan, and I suspect more gamers will flock to the main table more often for the more assorted jokes and higher scores.", "date": "October 14, 2014", "grade": "B+"}