{"name": "Arcana Heart 3 LOVE MAX!!!!!", "ref": "https://gaming-age.com/2014/10/arcana-heart-3-love-max-review-ps3-ps-vita/", "text": "As a fighting game enthusiast, I can say whether or not I will enjoy the experience within the first few minutes of play. The simple one on one play mechanic is very difficult to get wrong, although sometimes a game comes along that does so many things wrong, that its hard to see the things they did right. The Arcana Heart series usually fits that description; its not completely terrible, but it sure has its issues.In Arcana Heart 3 LOVE MAX!!!!!, which is a sort of sequel/upgrade to the original Arcana Heart 3, you are presented with a roster of 23 strange characters all battling each other. The story will change depending on the character and path you choose with the main focus being the destruction of Japan, which will happen in about 6 days. The Celestial Union, a collection of special fighters who can wield the power of angels, is set to stop an evil organization known as The Drexler Institute. That is about all I could understand from the short dialog scenes between fights, as the story is more convoluted than an episode of the old TV show Heroes. The fact is that you are not playing Arcana Heart 3 for the story, its the fighting that you should focus on, but it also has it flaws.The strangeness of the characters, mixed in with very stiff controls makes this one of the more difficult to like fighting games out there. It takes a long time to get a good set of combos going for any character  that is if you are able to pull them off. It sort of feels like you are telling a 4 year old to do something. Sometimes they listen, and sometimes its a struggle. There are a few different endings to unlock depending on the path your character takes, but finding them all is tough with some boss battles being overly difficult. If you get tired of playing through the story, you can take the battle online and play with others. Online play was solid for the most part, but I really had a hard time finding matches. There are also your standard Time Attack and Versus modes to keep you occupied and help you unlock some artwork in the included gallery.Control is the biggest thing in a game like this; it has to be fast and fluid. Arcana Heart 3 LOVE MAX!!!!! is neither of these. While its functional, the controls feel stiff and unresponsive most of the time. Sometimes you can pull off a combo flawlessly a few times, but then it seems the control locks up and prevents you from accomplishing it again. Special moves are also hit or miss, sometimes performing the same motion will warrant a completely different move than intended, resulting in a quick loss. It does not feel as fluid as other Arc System Works game like Guilty Gear or BlazBlue, and doesnt even come close to some classic Capcom fighters like Marvel vs Capcom. My PS3 controller felt like it was going to fall apart in my hands after a few dozen fights.The graphics and animation of the characters are nice, with many frames of hand drawn sprites for each. There is an anime style side panel that constantly animates the feelings of your character throughout the matches. If they take damage, they wince in pain and even fall when beaten. Since its constantly moving, it can become a large distraction so most players will eventually turn it off. Backgrounds are well drawn, but are mostly lifeless and really dont catch the eye. Some of the music is a pleasure to hear, while other tunes feel out of place in a fighting game. Voices are all in Japanese (with only the text translated) in the cutscenes and during fights, and while it is constant, it hardly gets to the point of being annoying.", "date": "October 3, 2014", "grade": "C+"}