{"name": "Persona 4 Arena Ultimax", "ref": "https://gaming-age.com/2014/10/persona-4-arena-ultimax-review-ps3-xbox-360/", "text": "Persona 4 Arena Ultimax is the sequel to the sequel of the fourth Persona game (and sort of the third), both of which (P3 and P4) were responsible for making the Persona series a pretty big hit here in North America. Granted, there were Persona games launched prior, but I dont think most would argue against the thought that the series has really gained traction here over the past 7 years. And if you have any love for the characters spawned from either game, then youll certainly want to check this entry out.Of course, this is a remarkably different experience than the RPG series that spawned it. Ultimax, like the original Persona 4 Arena, is a fighting game developed by Arc System Works, the group behind the beautifully rendered Guilty Gear series. Their prowess with spritework shines here in Persona 4 Arena Ultimax, with stunning renditions of characters like Chie, Yosuke, Mitsuru, and Junpei. This is a fantastic looking title, with incredible animation work, and a remarkable level of detail. You could tell me theres a better looking 2D fighter, but Id have a hard time believing it.While the leap from RPG to fighter might sound surprising, that doesnt mean that Atlus and Arc System Works have forgotten what makes the Persona series unique. Theres definitely RPG elements in the underpinnings of different modes, and the theres still a heavy emphasis on story. Ultimax features two lengthy story modes right out of the gate, each focusing on the point of view from the cast of their respective games, Persona 4 and Persona 3. While the cast intermingles quite a bit in both tales, youll get different events between the two. And if youre interested in DLC, theres more story related content coming down the road.The story elements take on a visual novel presentation, with a handful of animated sequences tossed in. The story is occasionally broken up by single round fights, which helps keep the player attention active. But if youre not all that into fighters, you can opt to have the game play through those battles for you. Honestly, theres very little difficulty in the one on one A.I. encounters throughout the story, so if youre going to learn the basics of the game, the story mode is a good place to start. The voice acting here is spot on, with a lot of returning cast members from previous games. Id imagine some will be upset with the lack of Japanese voice track for authenticity, but the English voice actors featured are top notch.For those of you that are interested in the fighting portion of Persona 4 Arena Ultimax, theres a great tutorial present thatll teach you a number of the unique mechanics featured. Ill warn any casual players at this point, youll have a lot to take in and its easy to become overwhelmed. This isnt necessarily the best fighter for someone new to fighting games, but theres enough to the tutorial, single player, and challenge modes that youll be able to get your feet wet before you try to to go toe to toe with real opponents. Youll certainly want to take advantage of those modes as well, as youll likely get your ass kicked numerous times due to the various nuances of Ultimaxs fighting systems.The roster of available fighters has been expanded upon for this sequel, doubly so if youre willing to count the shadow counterparts for each character. New faces are largely from the Persona 3 side of the fence, with characters like Yukari, Junpei and Ken joining the fray. Rise from Persona 4 is also added (along with some interesting new abilities) and a couple others. Day 1 DLC adds in Adachi and Marie, free for the first week. Additional characters are planned, and the game features a brand-new antagonist as well. Most characters play in a wildly different fashion from one another, with certain characters featuring unique systems within the other fighting mechanics available to the entire roster. The diversity of abilities found in this cast makes for one of the most memorable fighting game line-ups that Ive ever seen.Outside of the story, training, and free battle modes, theres a neat mode called Golden Arena, which incorporates some of the traditional RPG structure the Persona series is known for. It works in a similar fashion to a survival mode, wherein you battle your way through successive battles against increasingly tougher opponents. Winning fights will net you experience points, which in turn can level up your fighter. Leveling up will gain you stat points for a handful of core stats, and can also net you new abilities. These abilities can provide status effects, nullify those effects, or provide healing abilities. Every five floors features a boss battle, and theres four different difficulties to tackle.Persona 4 Arena Ultimax also features your standard ranked and unranked online play, along with lobbies to mill about in while waiting for fights to begin. Cross-regional play is featured here too, so theres rarely a shortage of opponents waiting online. And online play has been remarkably smooth, even when participating in fights outside of North America. Its not flawless, as most online fighters rarely are, but its a suitable enough experience if you find your local fighting scene to be a bit lacking.", "date": "October 2, 2014", "grade": "A-"}