{"name": "Forza Horizon 2", "ref": "https://gaming-age.com/2014/09/forza-horizon-2-review-xbox-one/", "text": "Its rare that a spin-off manages to outdo the franchise that spawned it, but when Forza Horizon launched on the Xbox 360 in 2012, it did just that. As good as the Forza series had been up to that point, Forza Horizon was like a breath of fresh air that I didnt even realize the series needed. It was fun both online and off, featuring a beautifully rendered open world that any racing game enthusiast could enjoy. Thankfully, the same can be said of the sequel with Forza Horizon 2 on Xbox One.Just like the original, Playground Games has crafted a beautiful world for you to compete in. The Horizon Festival featured in the game consists of six locations, with varied terrain to drive across as you compete in an incredible number of events with a massive host of toys at your disposal. You can rip across farmland, weave in and out of dense woodland, drift across dirt roads, and navigate through oncoming traffic on city streets. The overall scope of Forza Horizon 2 is huge, with over 300 unique roads to travel down, and over 700 events to compete in. Needless to say, youll be able to spend dozens upon dozens of hours competing and exploring here.Most events are contained within Championships, kicking off with a timed Road Trip guiding you to your next destination. Youll pick from one of the many Championship events, chose a car that fits the event restrictions, and compete in four different races to bring home gold. Event types can vary, but typically feature a mix of Sprints, Circuit/Street Races, and Cross Country events. Every racer in the world is populated by Drivatars, returning from Forza 5. Drivatar A.I. seems largely unchanged from Turn 10s racer, which can lead to a lot of overly aggressive driving, but Forza Horizon 2 may correct that a bit by incentivizing clean racing through its Skills and Perks system.While racing or exploring, performing certain activities will net you points that can then be used to purchase perks. So actions like getting air, drifting, narrowly avoiding traffic, and racing clean can be chained together, with each action earning points that are further multiplied by quickly chaining these actions together. Unlockable perks can provide discounts for new vehicles and tuning, permanent experience point gains for completing races, expanded fast-travel options, and much more. It becomes worth it to avoid opponents, as smashing into other vehicles or inanimate objects can cause you to lose a chain and all the points that come with it. Once youve felt the pain of losing 80,000 points due to reckless driving, youll quickly make the effort to become a more conscientious driver.Outside of the Championships for various car classes, you can participate in returning Showcase events, and the new Bucket List challenges. Showcase events are few and far between, but provide unique races that pit you against non-standard vehicles, like trains and hot air balloons. Bucket List challenges are more plentiful, with varying degrees of difficulty, and giving you access to some pretty unique vehicles specifically for those events. Bucket List challenges may have you accomplishing something simple, like running from point A to point B within a limited timeframe, or something more focused on skills and stunts, like jumping shipping containers at an expansive dock. Either way, these events break up the standard race events nicely, with just the right amount to see and do within each of the six major locations featured in Forza Horizon 2.Outside of the vast amount of content, another big feather in Forza Horizon 2s cap is how damn beautiful this world looks. Draw distance is incredible, environment pop-in is kept to a minimum, and the weather effects are stunning. Driving haphazardly through fields at night in the rain is a sight to see, and theres nary a technical hiccup to be found. Its a fantastic accomplishment for Playground Games, and helps a lot when it comes to providing that immersive feeling that so many video games strive for.Car handling in Forza Horizon 2 feels pretty much identical to what was done in the original game. Theres a heavier emphasis on arcade style racing, but not to the point that drifting becomes a must-master ability in order to navigate turns. Youll still need to drive conservatively in some events, dialing back the throttle a bit and making ample use of the brakes for tight turns. And regardless of your affinity for racing games, the adjustable difficulty and assists ensure that youll be able to find the sweet spot to match your own personal skill level, rarely making Forza Horizon 2s racing feel frustrating, even for new players.Forza Horizon 2 also features two online modes, Roadtrip and Free Roam. Roadtrip works much like the single-player side of the game, where you can open your game up for other players, or enter the game of another. All players within the game world can then compete in championship events, with the winner dictated by the number experience points gained. Again, this emphasizes skill and clean driving more than brute-forcing your way across the finish line first, which I thought was an interesting approach. Free Roam allows you to explore the world and initiate random events for everyone to participate in. These are one-off events, not tied to any specific location or championship, taking on a more exhibition-like style of gameplay. You can pick the vehicle-class, and then often choose from a handful of vehicles that fit that class. Theres a hefty number of events to choose from, and Free Roam ended up being my preferred online experience for Forza Horizon 2.My only complaint, and this is primarily a subjective thing, is that I wish the music selections in the game were a little more diverse. Theres a number of radio stations, with over 150 track selections, but Ill be damned if I could find a single song that I enjoyed. Outside of a few classical selections that were at least familiar to me, I got very little enjoyment out of Forza Horizon 2s soundtrack. Again, Im sure there are others out there that will love it, but it didnt fit my personal tastes, and more often than not I rode around with the radio off.", "date": "September 25, 2014", "grade": "A"}