{"name": "Gravity Crash Ultra", "ref": "https://gaming-age.com/2014/09/gravity-crash-ultra-review-ps-vita/", "text": "I feel kind of sorry for Gravity Crash Ultra. Its got a name reminiscent of one of one of the Vitas highest profile titles. Its gameplay isnt that far off from Pixeljunk Shooter or Velocity 2X. Its come out around the same time as Velocity 2X, which, indie game or not, is getting quite a bit of attention and publicity (for very good reason, of course).Is it better or more deserving of attention than any of those games? Wellno, not really. But those are all among the very best games the PS Vita has to offer; saying that Gravity Crash Ultra doesnt measure up to them doesnt tell you a whole lot, since the vast majority of games on the system dont either.Indeed, even if this isnt one of the best titles on Sonys handheld, its not that far off from that level, either. Its a well-made, stylish space shooter, and theres ample reason to pick it up.First and foremost among these is the simple fact that it plays really well. This shouldnt come as a huge surprise, of course; the games predecessor, the PSPs Gravity Crash Portable, was widely praised, with the main knock against it being that it lacked the twin-stick part of twin-stick shooter. Thats obviously not a problem here, and you can see the improvement, as navigating around tight corners and small spaces is significantly easier.The gameplay is also enhanced by some very pretty graphics. While the neon palette may not do much to differentiate it from, say, Velocity, it still looks gorgeous. Absent the rumbling feedback you get on a console, there are few better ways I can think of to vanquish your enemies than to see them explode in a cloud of neon stardust. It just looks undeniably cool.The games not without its drawbacks, of course. It isnt the kind of game that you can sit around and play for hours on end, unless you have an appetite for some highly repetitive gameplay. Alsoumm", "date": "September 19, 2014", "grade": "B+"}