{"name": "NHL 15", "ref": "https://gaming-age.com/2014/09/nhl-15-review-ps4-xbox-one/", "text": "EA Sports NHL series has been on par with their FIFA series as the most consistently solid sports titles over the last decade. One would think that the skys the limit for this franchise and the transition to the next generation of consoles would be a breeze. I mean, why not, as both Madden and FIFA were brought over without sacrificing elements or modes, so why would the NHL series be any different? Well unfortunately the start of a new generation is more like a start over for a new generation due to a wide amount of omissions in NHL 15. This could be due to a new team, or the fact the company spent too much time on the new engine, but regardless of the excuses, something was lost in translation. Not only is NHL 15 a step back, but considering that the franchise has been so dominant over some time now, NHL 15 is a disappointment even for the most diehard fan.First off I would not be doing due diligence if I were not to list features that are not available for the next generation versions of NHL 15. Keep in mind if you own an Xbox 360 or PS3 these features are still present and are only omitted from the XB1 and PS4 editions. Ready, setgo: No EASHL, No Offline Seasons in HUT, No tournaments in HUT, No Winter Classics, No GM connect, No Shootout, No Live the Life Mode, No be a NHL Pro, No be a Legend Mode, No standard season mode, No playoff mode, No Edit Team, no Edit Player, No Create a Play and No Custom Music. Now I know there are things that Im omitting from this list, but you should get the gist of what is NOT there. Also, EA has mentioned that many features missing will be patched in over time. My question is, if your intention is to get them in there eventually then why not delay the game for a month or so?In any event, there is still enough to love in NHL 15 that keeps it off the totally pass on it list. Hockey Ultimate Team is present, even if it is not as deep as previous versions. So for those who love to create their own dream team and show their skills off online, this mode still exists for you. Be a GM Mode is still present, even if it isnt part of the connected franchise element we have grown to love so well. Once again you can play up to 25 seasons, play the roles of GM, Coach and Player all at the same time, and guide your favorite franchise to NHL Stanley Cup Glory. Be a Pro is back but with one major flaw, you cannot sim to your next play on the ice and you are forced to watch the entire game whether you are part of the action or not. Now how in the heck did this get overlooked? Also, you receive no feedback from your coach to let you know how well you are doing or what you need to improve on. Oh and I must add  what is up with the lack of commentary for names that the play by play team announces? How in the heck is Peterson not an option? My last name is extremely common, but alas I am forced to choose another since none isnt even an option here. So Peters is the closest I have to choose from LAME! NHL Moments, Play Now, and Practice Modes are there for those who want a simple pick up and play for a quickie NHL fix. And thats it.Typically the most important aspect of any game is how it looks and plays, but to tell the truth, the many omissions from NHL 15 really hurts the score, no matter how well it a job it does on the ice. For those gamers out there who are content to live with the options that are currently available, you will be happy to know that the new development team has done an outstanding job not only on presentation, but game play as well. For starters, there is a new team in town thanks to the NBC Sports commentary team of Mike Doc Emrick, Eddie Olczyk and Ray Ferraro. Not only do they provide a new and refreshing job calling the plays on the ice, but a new video opening for each game you play will give you the insight you crave on your upcoming matchup. Toss in a reactive and enthusiastic crowd that sounds as if it were actually recorded from a live broadcast, and thanks to this new style of NBC presentation, the game has never looked more like as seen on TV than ever before.On the ice the game of hockey has never looked better or more authentic. New player and equipment models have been rebuilt from the ground up and you can finally see a difference between the players, equipment and jerseys. Each player representation shows a greater sense of emotion and animation than ever before. The puck has a life of its own as well and you will find more deflections, bounce and garbage shots, all making the game as unpredictable as the real thing. Rounding things off are the new crowd recreations with over 9000 individual crowd models that not only fill the stadiums with life, but react to bad calls, fights, and big plays.Looks are not deceiving when it comes to how NHL 15 plays either, as one aspect this series has always gotten right is how the game plays overall. NHL 15 still delivers the smart, fast paced and realistic action as it always has. The new game engine and physics models have not hampered the overall game play or its A.I. one iota. In fact the games A.I. seems to have been improved, especially where players reading and reacting to plays, learning your tendencies and how the overall flow are affected from play to play. Those looking for a solid on ice representation of hockey will be more than satisfied with the results from this new development team.", "date": "September 17, 2014", "grade": "C+"}