{"name": "Teslagrad", "ref": "https://gaming-age.com/2014/09/teslagrad-review-wii-u/", "text": "Its not very hard to classify Teslagrad. As a 2D puzzle-platformer, it slots in neatly amongst the likes of Braid, Limbo, Thomas Was Alone, Fez, Stealth Inc. (or Stealth Bastard, depending on where you played it). Weve had no shortage of them over the last few years, to the point that its practically become rote: take some almost-but-not-quite retro graphics, add in some kind of mechanic as a hook, throw in a story, and voila: youve got yourself an indie hit.That last paragraph may have been lacking in enthusiasm, but dont let that put you off Teslagrad: the only reason Im not raving about it is because I dont feel like I have an adequate vocabulary to do it justice. Indeed, if theres one thing any of those games I mentioned in the last paragraph have in common, its that theyve all taken a fairly standard formula and put a unique twist on makes them feel fresh and new.In Teslagrads case, the twist is twofold. The first is obvious: this is a game all about controlling electrical currents. Much like the inventor from which the game borrows its name, the goal in Teslagrad is figuring out how to manipulate electricity to your advantage. Charging yourself and the world around you, you slowly work out how to get to difficult-to-reach ledges and platforms. Occasionally its fairly straightforward and simple, but more often than not, youll have to do a little trial and error in order to achieve your desired result.Admittedly, some of this trial and error is because the games controls can feel like theyre working against you. Most notably, your character cant run; he can only propel himself forward using teleportation. While this is certainly useful in getting through some walls and grates, its not a perfect mechanic. Its incredibly frustrating to have to rush through a section, only to discover that you cant chain together teleportation dashes that are sufficiently fast enough. Of course, if it were easier then there might be an issue with the whole puzzle half of the puzzle-platformer equation, so as annoying as it may be, its at least understandable.The games other twist isnt so much a twist as it isa storytelling choice, I guess. Teslagrad is entirely dialogue-free, preferring instead to tell its story through short, wordless vignettes and other text-free images. Theres definitely an onus on the reader to figure things out, which is somewhat at odds with how most game storytelling goes nowadays, but more often than not, this faith is justified. In this respect, Teslagrad is helped by the fact it knows how to tell a story: it grabs your attention right off the bat by placing a child in peril at the hands of vaguely Russian-looking thugs, and it keeps you enthralled by constantly doling out just enough story to keep you engaged.On the storytelling front, dont underestimate the power of gorgeous visuals in keeping you hooked. Even when theres no plot to be found and youre just climbing and jumping and teleporting around, the game keeps you in its world simply by dint of having a distinctive visual identity. Essentially, think of a slightly more Slavic take on how Braid looks, and youre most of the way there.", "date": "September 14, 2014", "grade": "A"}