{"name": "Vampire: The Masquerade  Swansong", "ref": "https://gaming-age.com/2022/05/vampire-the-masquerade-swansong-review-for-ps5-xbox-series-x-pc/", "text": "Vampire detective stories should not be as boring as they are in Vampire: The Masquerade  Swansong.To be sure, some of this is on me. Ive never played a Vampire: The Masquerade game in any form  whether were talking about the tabletop game or any of its various video game adaptations  so I went in without knowing anything about the world or its characters. Its entirely possible that if I knew who these characters were or what they were talking about going into the game, I would have been a lot more invested in it.Of course, the flip side of that is that Swansong doesnt give you all that much reason to care about whats going on. It tries to set the stage with a few introductory paragraphs, but even this introductory text cant help but devolve into hyperventilating, lore-heavy exposition about Code Reds and the Boston Camarilla and the Hartford Chantry. While this may be riveting if youre already a fan of the franchise, it all sounds like a bunch of nonsense if youre not.However, its pretty good prep for what happens the rest of the game. Swansong may pretend to be a mystery RPG where you play as a vampire detective  which sounds pretty amazing, when you see it written down like that  but the reality is that its a poorly written visual novel with a slightly higher budget. Seemingly every interaction is accompanied by a note saying that theres a new codex entry, which is great if you feel like interrupting the game constantly to figure out what exactly is going on.This is a game where characters named Emem and Drory and Galeb and Journey monologue at each other, spouting lines like Well have to increase our diplomatic presence to the Warlocks and Youre not like the other Children of Malkav. Obviously, such overwrought dialogue would be clunky even in the hands of incredible voice actors  but Swansong doesnt have those. I mean, they certainly try their best, but it all comes off as flat and lifeless.In that respect, it matches how the game looks. Swansong tries so hard to fill its world up with mysterious, cool-looking vampires, but the illusion is lost any time any of them speak. They mostly look like shiny character models with dead eyes, and when they talk they move their bodies in the same, repetitive motions over and over again until theyve finished their lines. The best comparison I can think of is to Frogwares Sherlock Holmes games, where the characters all get trapped on the far side of the uncanny valley and make it impossible to get that invested in whats going on because they all look so silly.At least Sherlock is able to offset those looks with gameplay thats somewhat serviceable. Swansong aspires to be a detective game, except youre constantly funneled to where you need to go. On top of that, it bogs its mystery down in an impenetrable, needlessly complex disciplines system that never fully explains itself  which, of course, makes it the perfect accompaniment for a game thats in love with its own impenetrable lore.As I said up top, I get that its a little unfair to come into a series thats been around for a couple of decades and complain that you dont know whats going on. But at the same time, the more you play of Vampire: The Masquerade  Swansong, the more you get the sense that its being so convoluted because it doesnt know what else to do. It tries to wrap everything together sometime around the 15-hour mark, but theres really no reason why you should want to stick around for that long.", "date": "May 26, 2022", "grade": "C-"}