{"name": "Madden NFL 15", "ref": "https://gaming-age.com/2014/08/madden-nfl-15-review-ps4-xbox-one/", "text": "Typically when consoles transition to a new generation it takes a good half a year before sports games get back to being on par with the features and offerings they had on the previous console generation. Thanks to technology and the power of the PS4 and Xbox One, we dont have to wait that long. As a matter of fact, less than one year into the new platforms lives, not only is the 2nd wave of Madden on par with what had been offered on the Xbox 360 and PS3, but thanks to the new systems capabilities, weve moved well beyond the last generation. Madden NFL 15 takes everything to a whole new level, and dare I say this is easily the best Madden title Ive played in a decade. Im not just talking visuals here either folks, as now the game is just as deep as ever, but the game play has stepped up to the pacing, difficulty, and realism we have been chomping at the bit for year after year, and now its finally delivered to us in spades.Beginning with gameplay, we are finally not only offered a great challenge that doesnt feel cheap or rubber band-like, but playing defense is now as rewarding as playing offense thanks to new and improved tweaks that give a whole new meaning to disrupting an offense. New to Madden 15 is a visual cone that appears in front of defenders whenever a ball carrier is within range of the tackle. The effective range of where the cone is and when you perform a tackle leads to more consistency and fewer missed tackles, all which will improve your defense game on a whole in just one aspect. Other defensive upgrades come in the form of new mechanics that give you the opportunity to shed blocks and cause disruption to the offensive line, the ability to jump the snap or create enough diversion to make the offense false start, block steering to the point where you can use the weight of a lineman to clog up the lane or improve your chances for a successful pass rush, and much more. Adding a fresh perspective to the way you play defense you can now flip the camera around on the fly to whichever position you choose, so whether you are rushing the pass or defending against it you will now have the perfect point of view that will increase your chances of success.Of course defense isnt the only point of view that has gotten a vast improvement. On offense the pacing of the game is far more deliberate and thought provoking than ever before. Partially due to the much increased frames of animation and more due to attention to detail and realism will you find the running game tough but fair which forces you to really read the lines and find the holes more than ever before. Toss in a new stamina meter that will keep gamers from over using the boost button, as not only will your running back play fatigued but also cause a fumble if they are too tired to keep their wits about them. On the passing game you are also prone to mishaps if you dont read the lines and playmakers coming your way, but just whipping the ball into a general direction isnt going to get it done either thanks to a more intelligent and realistic passing game. Now not only are QBs vulnerable to miscues and bad passes, but receivers will also misread ball height and speed cause them to bobble, drop, and even possibly end up in the possession of your opposing defense. There are many other nuances that gamers will notice and enjoy that are frankly too many to write about, but youll notice these improvements just after a few short games. Believe me though when I say that Madden has never played better or more realistic.The presentation enhancements that the game has received is the proverbial shot in the arm here as well, from pregame to the final whistle, you will be impressed with how Madden NFL 15 looks and sounds. It is officially the first next generation Madden title that will wow onlookers. Beginning with a whole new package of camera angles helmed by NFL cinematographer, each game looks varied and unique from one game to the next. Player models have also received a dramatic improvement including faces, bodies, uniforms, and even field degradation. While not every NFL player has been scanned, most of the notable stars have been and the overall effect it has on the visuals is immediately noticeable. Imagine what the future brings when they all are accurately captured.Gone from the past are repetitive and annoying cut away videos that used the same handful of actions, and in their place are more lifelike experiences that showcase a players spontaneity and emotion. Changing cameras on the fly before the play doesnt hurt either, providing you with the best read of the field you need for any play you pick. Madden NFL 15 provides gamers finally with a respectable halftime show complete with highlight clips, a recount of actions, and commentaries on scores, turnovers and other big moments that shifted momentum of the game. Whats more the game even has between quarter sponsors that really bring the broadcast feel to life. Sure some people may complain about the sponsor use, but someone has to pay for some of this stuff right?Rounding things off visually are the stadiums which are large and accurately represent the cathedrals that they are trying to imitate. From the concrete structures to the intricate blades of grass on the field you can rest assured that your teams home turf is recreated so well you will feel like part of the crowd. Speaking of the crowd, you will notice just how dramatically improved the crowd audio is as early as the first flyby of the stadium. Not only is the crowd impressive by how real they sound, but how they react to game events will also be pleasing to your eardrums. Of course there is a slight bit of bad as Jim Nance and Phil Simms return for commentary, and while they do have new lines of material recorded, they are far and away from being as engaging as what we hear in NBA 2K or even EAs NHL series. I think it is here where this franchise needs the most help, but for the most part I guess you can say they do a passable job.Madden NFL 15 is as deep as ever providing oodles of options for gamers online and offline to keep you rocking the gridiron well into next season. Not only are all your favorites like Connected Franchise and Ultimate Team back and provide players with the meat of the game, but for those of you who are new to the Madden franchise or havent played it in a while the game does a great job of teaching you football with the games Skills Trainer feature. Here you will go through rigorous drills on both offense and defense teaching you the basics, but as an added bonus EA tossed in a new option in this mode called The Gauntlet. In The Gauntlet your real Madden skills are put to the test as you are pitted against 40 increasingly difficult challenges testing all facets of the game. Whats more after every five levels completed you take on a boss stage that puts a crazy and unique twist on the typical proceedings. The Boss stage will have you doing various insane challenges like kicking 110 yard field goal or even trying to score a Super Bowl touchdown while dodging not only players, but cameramen, sound engineers, and even your own teammates. While the game doesnt provide a wealth of new features, it certainly improves upon the many it already has, which is plenty good enough for this reviewer.", "date": "August 22, 2014", "grade": "A-"}