{"name": "Ratchet & Clank Collection", "ref": "https://gaming-age.com/2014/08/ratchet-clank-collection-ps-vita/", "text": "In a way, I kind of credit Ratchet & Clank for getting me back into gaming. I was really into it back in the days of NES and SNES, but as I got older my interest waned, until it reached a point where all I played was sports games. Then a few years ago, I needed a break from MLB: The Show and I randomly picked up Ratchet & Clank: A Crack In Time, and that, in turn, instantly reminded of why I loved games so much.This means, of course, that I missed out on all the games included in the Ratchet & Clank Collection back when they first came outwhich also means that I have no frame of reference for how good the games are on the Vita compared to how they were on the PS2. I have to say, though, that if the Vita versions are even half as great as the originals, then Im kind of kicking myself for not having played them first time around  it would have saved me from years of buying the same annualized roster updates.Because make no mistake: even if the HD Collection looks a little dated on the Vita, its still a fantastic game. There are the usual complaints to be made about it, most of them in the graphics department. Like the God of War collections back in May, the cutscenes throughout all three games here look kind of lousy. Thankfully, however, the fact were talking about characters who are very obviously cartoons rather than real people/human-looking gods means that theres a little more leeway in terms of looks, and youre not constantly noticing how grainy everything looks. In fact, not only does the Ratchet & Clank Collection look a little better, it also performs well in general  no small thing, all things considered. By that I mean that the port was developed by Mass Media, who also did last years Jak & Daxter Vita port, which was roundly slammed for having all kinds of problems. They seem to have learned their lesson this time out, however, since none of the major issues that plagued that game  the crashing, the tearing, the camera getting stuck, the lousy controls  are present here. The Ratchet & Clank Collection on the Vita is stable, you can move the camera around without it getting stuck behind a wall, and the controls work just as they should.The game still shows its age, of course. As I said, every time a cutscene shows up, youre instantly reminded that the original games came out a decade ago (and the in-game graphics and menus are only marginally better). Similarly, considering how expansive more recent games in the series have been in terms of weapons and abilities, there are definitely moments here where you might feel a littl short-changed.", "date": "August 11, 2014", "grade": "A-"}