{"name": "GRID Autosport", "ref": "https://gaming-age.com/2014/07/grid-autosport-review-ps3-xbox-360-pc/", "text": "GRID Autosport wont go down as my favorite racing title by the talented devs at Codemasters Racing, and I doubt itll top most fans best of lists either. Its not a particularly awful racer, or broken in any significant way, I just didnt find myself having much fun while playing it. Most of my issues with GRID Autosport stem from the single-player portion of the game, in fact, I found multiplayer to be my preferred mode. Im not sure what the thinking was in structuring the Career mode the way Codemasters has here, but its certainly not something Id like to see return in future GRID installments.Career mode is broken up into seasons. Each season you pick from one of five different car disciplines, which will dictate what types of cars youll drive, and what courses youll face. GRID Autosport isnt lacking in variety, with over 20 tracks and around 100 course variations, plus plenty of well-known car manufacturers and models. But while titles like Forza and Gran Turismo seem to focus heavily on the actual cars and tracks featured, GRID doesnt highlight these aspects much. Instead, its more about the type of racing youll engage in, which brings you to the five disciplines offered here.GRID Autosport features Touring, Endurance, Open Wheel, Tuner and Street as its five primary disciplines. Each discipline has a series of events to compete in, as you race against A.I. controlled opponents, and a computer controlled teammate. Each discipline has its own experience bar to fill, so youll level up each discipline individually. Once youve hit landmarks of level 3, 6 and 9, youll unlock additional GRID Series events, which grant experience for all five disciplines.Each season features a couple of sponsor choices to pick from, pulled from real-world brands like Intel and Oakley. The sponsor you choose will dictate who your A.I. teammate will be, and the optional goals available to complete for bonus experience. These goals typically involve beating a particular racer or team, traveling so many miles on a course, coming in 8th or better place, and so on. There are small objectives thatll earn you only a couple hundred experience a piece, doled out for each race completed in a season. At the end of the season, you can also earn way more experience by completing the two team/sponsor objectives, providing a considerable boost of experience if completed.None of this sounds particularly awful, until you realize that youre locked into each discipline for every season of play. Granted, seasons are short, offering only a handful of races at most, but not being able to switch between disciplines on the fly seems like a needless nuisance. Also, you have to actively compete in every single discipline, not all of which are going to be appealing depending on your preferences. For instance, I absolutely loathed the Touring events, featuring 8 minute timers across tough track layouts with overly powerful vehicles. Even turning on all assists and dialing the difficulty back to Easy had little impact on my inability to navigate Touring events. You could certainly argue that with more practice Id improve, but quite frankly I didnt want to play these tracks or cars at all.And in Career mode, you cant actually choose your car, so I never had the opportunity to try my hand with a different vehicle in the Touring discipline, or any other discipline for that matter. You do have some tuning options, but no actual upgrades unless the vehicle being used for an event already has one installed. You have no real garage to maintain, and no progression curve outside of unlocking additional events. Its a very different direction to take a single-player racing career, especially when compared to heavy-hitters in the genre. That lack of options or freedom really sucked the fun out of the game for me, despite featuring events and tracks that I did enjoy in disciplines outside of Touring.Its even more odd when compared to GRID Autosports multiplayer mode, which actually gives you all of those options and more. Youll have a garage, a starter car, earn cash and experience for completing events, and can even purchase new or used vehicles. You can unlock upgrades based on experience levels, and can still fine tune the vehicle, or paint it to your liking. Basically everything thats missing in the Career mode is tucked away into multiplayer, so why not have these options available in both modes? The only real issues here is that the community is already dwindling. Custom Cup mode in multiplayer is somewhat active, but this doesnt grant you experience or cash for necessary unlocks and upgrades. The playlist mode that features the five disciplines does, but I could never find more than 4 or 5 people in matchmaking at any given moment.", "date": "July 27, 2014", "grade": "C+"}