{"name": "One Piece: Unlimited World Red", "ref": "https://gaming-age.com/2014/07/one-piece-unlimited-world-red-review-ps3-wii-u-ps-vita-3ds/", "text": "One Piece: Unlimited World Red is a mouthful of a title, but it makes for a surprisingly fun stand-alone adventure set against the backdrop of the One Piece anime world. It features a number of recognizable characters for fans of the anime, including Luffy, Zoro, Nami, Robin, Franky and others. The cel-shaded look of the graphics lends itself well to the game, and theres a lot of side-content available in addition to the main story missions you can engage in.While the story featured in Unlimited World Red is completely original, fans will still see a lot of familiar places and foes. For new locations, Transtown serves as a hub town for the Straw Hat Pirates, wherein you can set-off to tackle story based missions, build up and construct new merchants, or take on optional side-missions. Youll encounter a number of town folk to speak with, most of which just provide flavor text, with a handful offering up quests that typically lead to new store or crafting locations. But most of the story and side-missions youll engage in feature familiar locales like Punk Hazard and Alabasta. These areas also feature boss fights taken from previous anime episodes, with enemies such as Crocodile and Rob Lucci.Story missions are usually built around multiple areas, with breakable objects and materials available to gather for use back at Transtown. Enemies are sparsely populated throughout, outside of an occasional sectioned off area where youll need to clear a large number of enemies in order to advance. Some parts of the map will feature fishing holes, and you can also opt to equip a bug net too, providing some side-activities to engage in outside of just punching dudes in the face. One Piece: Unlimited World Red is still predominantly an action-focused video game, but I enjoyed the optional material gathering mechanics here.Combat involves light and heavy attacks chained together to perform limited combos, both aerial and ground-based. Youll tackle each mission with a team of three characters, with direct control over one while A.I. makes use of the other two. You can switch between all three characters at will, and defeating enemies will net experience for everyone, allowing them to level up and become stronger. Unfortunately the combat doesnt feel very fluid or impactful, Unlimited World Red lacks the grace and depth of better action titles like Devil May Cry or Bayonetta. But its a decent enough button masher, and provides bonuses for switching up your chained attacks with a menu of combo prompts to cycle through while fighting.Just about every story mission culminates in a boss fight, typically offering up a large arena-like area to engage in. Again, most bosses are culled from the anime, and the mechanics for each encounter vary. Your initial boss battle is against a large, red dragon, which can fly around slowly before slamming into the ground. Its also equipped with a powerful tail attack and can strike quickly to bite. Each boss encounter feels unique, but the strange button prompt countering system that One Piece employs negates much of the difficulty here. Any time an enemy is about to land a blow, youll be prompted to hit a counter button, allowing you to dodge, block or counter the attack with a 100% success rate. Its a strange, and somewhat lazy, system to employ. But considering the camera tends to get a bit hectic and out of control, it becomes necessary to use it.The level layouts for the story missions arent huge, so most only take about 10 to 15 minutes to explore before encountering the boss. Progress is typically gated behind a wall or two, which sometimes requires you to annoyingly backtrack through previous areas in order to fight enemies, which spawn a key of sorts to unlock your way forward. Its odd how this works, as you can completely explore an area before running against this wall, and youll still need to backtrack in order to trigger the necessary spawn of enemies for the key. Maps also offer up the option to travel back to town via specific points, but youll rarely have use for it. The only annoying restriction while participating in story missions is that you cant swap out equipped custom or item words, which provide bonuses to attack, defense, speed and so on for you and your team.Overall, I enjoyed what I played of One Piece: Unlimited World Red, certainly more than any One Piece title Ive played prior to this. Its not a top-tier action title, but it throws enough content at the player to keep you busy, and does so in a way that feels fun and engaging. The combat could be better, as could the level design, but if youre looking for a solid B-tier experience with an anime attached to it that you actively enjoy, youll likely find your money well-spent with One Piece: Unlimited World Red.", "date": "July 24, 2014", "grade": "B-"}