{"name": "The Walking Dead: Season 2 Amid The Ruins", "ref": "https://gaming-age.com/2014/07/walking-dead-season-2-amid-ruins-review-pc/", "text": "Amid The Ruins marks the fourth episode in Telltales second season offering of The Walking Dead, and its easily the best episode of the season. Coming off of one hellacious cliffhanger with episode 3, that might not come as much of a surprise. But the tension and drama for Clementines newly adopted group of companions doesnt stop with the explosive departure from Carvers camp, as the group is given little time to get their bearings before even more tragedy strikes. Again, considering the game, it might not be that surprising that things look bleak for Clementine, but that knowledge doesnt lessen the blows delivered by this round of storytelling.Obviously we dont want to go into spoilers for this episode, but you can expect to see some new surroundings for the gang here. The episode picks up during the events of the third episodes ending, seamlessly so, with zombies swarming in on every side. Not everyone will make it out of this episode unscathed, and theres a number of very tense, action-driven encounters that propel the group forward. If you thought that Kenny, Rebecca, Bonnie and the rest have had it bad up to this point, well, you aint seen nothing yet.Theres actually so many memorable moments packed into this episode that it makes it nearly impossible to write this review, outside of saying that I really, really enjoyed. As to why, or what specifically worked for me, going into much detail is really going to ruin the experience. What I can say is that while this season hasnt necessarily felt slow, this episode makes you feel as if the training wheels have been kicked off, and the brake lines have been severed. While the overall length of this entry doesnt seem to be any longer than previous chapters, it really feels like Telltale has packed a lot of story into this episode. Its very light on interactive, explorative moments, but the action bits keep you entertained, and the developments will have you on the edge of your seat.", "date": "July 22, 2014", "grade": "A+"}