{"name": "Dynasty Warriors Gundam Reborn", "ref": "https://gaming-age.com/2014/07/dynasty-warriors-gundam-reborn-review-ps3/", "text": "As someone who greatly enjoyed Dynasty Warriors Gundam 3, I find myself completely underwhelmed by Dynasty Warriors Gundam Reborn. Its not necessarily the worst DW related title Ive ever played, but it feels like a stripped down version of the previous game in a number of ways. And granted, it comes with a smaller price tag at launch than the last entry in the Gundam series, but that $20 difference doesnt really make up for content lost.For the most part, this entry feels similar in approach to the previous three titles. Theres a main story mode, which features six different Gundam storylines, from First Gundam to Gundam SEED Destiny. Each entry in story mode contains a number of missions to tackle, typically bookended by fancier CGI cut-scenes than what weve seen in previous DW Gundam titles. As a whole, the presentation angle of Gundam Reborn is solid, marking one of the few positives here.That said, story mode still feels a bit light in comparison to Reborns predecessors, but the real content culprit here is the accompanying Ultimate mode. Its a bit more in line with DW Gundam 1 and 2, but in direct comparison to DW Gundam 3, this alt-universe collection of missions is sorely lacking. Gone are the multitude of mission types found in DW Gundam 3, instead youll have a series of missions associated with different bits of story, that boil down to repetitive maps, encounters, and enemy types to engage. This might sound like any other Dynasty Warrior experience to a non-fan, but the difference in material is noticeable to anyone thats played through the series up to this point.That said, theres still a number of Gundam and pilots to unlock and use. Youll be able to pilot just about every notable Gundam across virtually all the main series released in the US and Japan. The same goes for the Pilot selection, featuring your standard notable characters like Amuro, Char, and Heero. While the story mode only reflects six different storylines, Ultimate mode will grant you access to a whole lot more. But this isnt necessarily exceptional when compared to previous titles, which have also contained huge rosters of both pilots and Gundam. And with Reborn theres a hefty amount of day one DLC, $30 worth in fact, something that comes across as particularly sleazy.The majority of the combat and mission goals remain similar to previous DW Gundam entries as well. Stages are comprised of a series of squared off locations, fields that you can opt to control and stave off the waves of enemies and intermediary generals that spawn. Generally youll be tasked with taking down notable Ace pilots on the opposing factions side, with different requirements that need to be met before that character will spawn in. On Easy and Normal difficulties few players will have trouble with any threat thrown their way, so Id urge experienced DW players to start off on Hard. Even then, it will take some time for the difficulty to ramp itself up, making the early hours spent with the game feel like a slog.The more significant changes, outside of the lacking content, are few and far between. The most noticeable comes from the visual change, which removes the cel-shaded look of DW Gundam 3 in favor of a more realistic approach. This brings the visuals more in line with DW Gundam 2, just spruced up overall. The Gundam models look really great, visually distinct, but the environments are just as bland and repetitive as ever. Theres little to note when it comes to the actual pilots, with artwork pulled from the anime that are little more than talking portraits with limited animation.One positive change to be found is the option for certain Gundam to change forms on the fly. By pressing the X button twice rapidly, certain Gundam can alter form. This allows for new weapon and attack combinations, in addition to notable visual differences. Its a neat trick, and a welcome addition, even if it ultimately makes little impact to the combat.One final change to note is the removal of the online mode found in DW Gundam 3, which featured specific online maps for up to 4 players. This time around, while in Ultimate mode, you can send out an SOS signal on different stages, calling out for players to assist. While it does give you more maps to test multiplayer out on, I rarely found that it worked. Id get notifications that were either expired or no longer available, and sending out a call for help would summon no one. Im not sure if the mode is just poorly explained, or non-functional, but it seemed like a serious step backwards for the series.", "date": "July 14, 2014", "grade": "C"}