{"name": "The Wolf Among Us  Episode 5: Cry Wolf", "ref": "https://gaming-age.com/2014/07/wolf-among-us-episode-5-cry-wolf-review-pc/", "text": "Cry Wolf marks the final episode in the first season of Telltale Games excellent The Wolf Among Us. If youve been on board for the past four episodes, I dont think this season finale will leave you disappointed. Things wrap up nicely, there are very few loose threads left hanging, and theres a sense of real change being enforced by the player based on decisions made. Like the overall direction of The Walking Dead, youll see a similar ending regardless of what steps you took to get there, but the overall well-being of certain characters, and where theyre at emotionally and physically, seems to carry greater weight than the first season of The Walking Dead.A lot of that has to do with the fact that the robust cast remains robust. While obviously telling a different story, than TWD, I find The Wolf Among Us benefits from a less bleak, apocalyptic setting than its Telltale predecessor. Thats not to say that everyone makes it out of this final episode unscathed, but with a large cast of supporting characters introduced and built up throughout this season, theres more possibility for Bigbys interactions with those characters to have a more meaningful effect in whatever season 2 ends up becoming. At least thats my hope, and Im willing to give Telltale the benefit of the doubt that Ill see some real payoff on the next round of Fables inspired episodes.But you dont have to wait for Season 2 in order to see some actual results. The overall mystery that surrounds the deaths of Faith and Lily, the seeming enslavement of the girls working for Georgie, and overall effect of underworld string-pulling courtesy of the Crooked Man, will be resolved here. How that all shakes out is something youll want to experience for yourself, but theres a few moments throughout this episode that stand out as memorable, and feel unique even when compared to Telltales other works. I was pleasantly surprised to see Bigby still had a trick or two up his sleeve, and I think fans of Fables will be pretty happy to see one particular sequence unfold here.", "date": "July 8, 2014", "grade": "A"}