{"name": "Z-Run", "ref": "https://gaming-age.com/2014/07/z-run-review-ps-vita/", "text": "I feel like Z-Run should be better than it is. This may be unfair of me. After all, its essentially an endless runner, and no matter how popular those games may be on mobile devices, its not like theyre generally renowned for their quality. Still, its made by a developer  Beatshapers  who knows what theyre doing when it comes to casual games on Sonys portable systems. Furmins, BreakQuest: Extra Evolution, Stardrone Extreme, ports of Canabalt and Jetpack Joyride (and several other games besides those): Beatshapers may not make big, cinematic AAA experiences, but theyve consistently demonstrated that they fully understand how to create enjoyable, bite-sized experiences on both the Vita and the PSP before it.Which is why Z-Run surprises me. Quite frankly, its just not very fun. Where all those other games I just named had simple, easy-to-understand mechanics, Z-Run has layers upon layers of controls that are about as far from simple as possible. Admittedly, part of this is just a matter of presentation. Some endless runners  actually, no, scratch that; lets go with a game thats somewhat similar to Z-Run, fellow sorta-endless runner Runner2. Like Z-Run, Runner2 called on players to do all kinds of actions, and it generally gave players even less time to pull them all off. The key difference, though, is that Runner2 introduced them gradually, and gave you the chance to familiarize yourself with each action before introducing new ones. Here, by contrast, youre pretty much given all of them all at once, and you have to magically grasp all of them right away if you want to get beyond the first level.This wouldnt be a big deal if it were the games only issue  after all, whats a little trial and error? No, what really makes it annoying is that the hard-to-learn controls are also pretty imprecise and unresponsive. Dodging left and right works sometimes, but not all the time. You can dive past some zombies, but not others. Occasionally your kicks and swings will connect with the undead, occasionally they wont. Basically, the controls are a crapshoot on top of being unreasonably complex, which is just a terrible combination.To top it all off, the game is pretty ugly, too. I feel like Im just kicking a dead horse while its down (to mix a couple of similes), but honestly, Z-Run does not look very nice. Everything is dark and grimy-looking, and not in a good way  less Oooooh, spooky environment!, more Huh? Is that a shrub or a zombie? Everything is muddy and indistinct, even with brightness turned all the way up, and what is visible looks pretty uninspired.", "date": "July 2, 2014", "grade": "D"}