{"name": "Pixeljunk Shooter Ultimate", "ref": "https://gaming-age.com/2014/06/pixeljunk-shooter-ultimate-review-ps4-ps-vita/", "text": "Im warning you now, Im going to make an absolutely terrible comparison for Pixeljunk Shooter Ultimate. Im stating this upfront since I know its a bad comparison, but its also one I cant seem to shake, and Im figuring I may as well be out with it, rather than trying in vain to be more descriptive.Got that? Here goes: in many ways, Pixeljunk Shooter Ultimate reminds me of Super Motherload.It should immediately be obvious why that comparison sucks. For starters, unless you were a really desperate PS4 launch owner, it probably doesnt mean a whole lot to you. (And if thats indeed the case, heres what I had to say about it seven months ago.) And if you are familiar with Super Motherload, then it falls apart for the simple reason that Super Motherload was painfully dull, whereas Pixeljunk Shooter Ultimate is one of the best games of 2014 so far.Still, I dont want to discount the comparison entirely, since on one level, it works. After all, both games are about exploring beneath the surface of an alien landscape and finding disturbing hints as to what may have happened before. That counts for something, right? At the very least, there are plenty of games with way less in common than these two.As I said, though, Pixeljunk Shooter Ultimate does a whole lot more with the setting. Even though it all takes place beneath the surface of some godforsaken alien planet, the games developers still managed to create a vibrant, colourful world full of interesting enemies and challenging hazards. Explore each level thoroughly enough, and youll come across lost scientists who dole out bits and pieces of information about the fate which befell them and their colleagues. On this latter point, of course, I should hasten to add that  as anyone who played the original Pixeljunk Shooter games on PS3 and PC can probably attest  this game is more about the gameplay than about solving any mysteries.And on this front (the gameplay one, that is), Pixeljunk Shooter Ultimate is a massive success. The controls are easy to pick up; few games on the Vita use the handhelds dual thumbsticks quite as well as this one does. Likewise, the levels are fantastic; each one is essentially search through each level to find lost scientists and navigate your way to the exit, but theres plenty of variety in how you get from Point A to Point B. You have to deal with all kinds of enemies, ranging from enviromental terrors like magnetic fluid and hot lava, to creepy robots and weapons of all kinds that are out to kill you. The solutions are usually easy enough to figure out, but the game challenges you with just the right level of difficulty in pulling each one off.", "date": "June 30, 2014", "grade": "A"}