{"name": "Cotton Fantasy", "ref": "https://gaming-age.com/2022/05/cotton-fantasy-review-for-nintendo-switch-ps4/", "text": "The beloved shooter series Cotton has been around for a whopping 30 years, on many different platforms. Recently there have been re-releases of classic adventures on digital stores as well as games being released for the first time in the west on devices such as the Astro City Mini Console. Some games were absolute classics, while others didnt really make the grade. Now just in time for the 30th Anniversary, a new adventure that hit Japan some time ago is now coming to the West in the form of Cotton Fantasy.Cotton is a teenage witch with a bad attitude and all she wants to do is eat Willows, a type of candy that comes from the World of Fairies. It seems in almost every outing, an evil force is trying to steal these Willow Candies causing havoc throughout the world, which forces the Fairies to find someone that can help get their Willows back. Cotton may be an adolescent, but she is powerful and anyone who tries to steal candy from her, so the fairies always seem to trick Cotton into helping them defeat the evil plaguing them with the promise of all the Willows she can eat. Once she hears this, she zooms off and everything in her path will get destroyed as she is only thinking about getting another Willow Candy!Upon starting up, you have a selection of six playable characters, including Cotton herself. The main story will focus around Cotton and doesnt change no matter who you pick, but the gameplay can drastically change depending on which character you are using. The other five characters (with one more unlocking after your first playthrough) all control and play differently, so there is plenty of replay value even with its unlimited continue system. Theres even a special guest character in the form of Umihara Kawase, fresh from her own popular ININ title that just recently saw a release here, joins Cotton in the fight for Willows! The main goal is to get through thousands of wacky enemies by shooting them with your magic or other weapon of choice to reach the boss and recover the Willow. As you progress, you will collect crystals that can level up your weapons, speed or add more hit points to your life. Some characters die after one hit, while others can take a few hits before dying. There is so much coming at you all at once that it will take mad skill to make it through the onslaught without dying. As stated before, you have an unlimited number of continues, so beating the game will not be much of a chore, but be prepared to lose all of your score when you continue.While there is a remarkable challenge to be found in Cotton Fantasy, the newest adventure seems to also be the shortest. With just 8 semi-short main stages (minus the quick Bonus stages), you can complete the main story in just under 20 to 25 minutes. It seems like just as you are settling in to the gameplay and wacky characters, its over and youll find yourself back at Stage 1. Sometimes, shooters like this can get a little boring with an abundance of stages, but Cotton games dont really suffer from this problem, so its a little disappointing that more stages were not included.The graphics are spectacular with a nice mix of 2D and 3D elements making up a nice looking fantasy world. There are even some nice 3D bonus stages that look sharp. All of the enemies, especially the bosses, are amazingly well drawn and look as wacky as ever. Visual effects like dropping bombs and particle effects will fill the screen with super bright colors making this game a joy to view as well as play. Control takes a bit to get used to with all of the different characters you can be. Some can change weapons on the fly, while others have special super destructive weapons that can take out a whole screen of enemies. Once you play with all of the available characters for a little while, the control will become second nature. The Music is a perfect fit of whimsey and somewhat scary, depending on what craziness you are flying through or boss you are fighting. Voices are completely in Japanese, and can grate on your ears in some places, especially when you get hit. The cutscenes are also fully voiced in Japanese, and can get a little annoying the more you view them in one sitting.Cotton Fantasy is a fantastic addition to the franchise. Its completely new, but feels more like a classic Cotton adventure with some nice added features. If you are a fan of Bullet Hell horizontal shooters, they you will be right at home here for as long as the experience lasts. Its a little on the short side, and offers a challenge that is a bit over shadowed by an unlimited continue system, but its still absolutely fun to play. Even if you arent familiar with the Series, this is a great game that almost anyone can jump into and play. Give it a try if you are able, you might like what you see!", "date": "May 20, 2022", "grade": "B+"}