{"name": "Murdered: Soul Suspect", "ref": "https://gaming-age.com/2014/06/murdered-soul-suspect-review-ps4-xbox-one-pc/", "text": "Theres ideas in Murdered: Soul Suspect that could make for a great game, but theres also plenty here that doesnt work. This is a narrative heavy experience, with some shoe-horned stealth elements tossed in, that isnt going to appeal to everyone. But Im happy that I played through it for this review, as it definitely could be the most unique retail console release Ill see this year.The core concept of Murdered: Soul Suspect is that youre a ghost detective attempting to solve your own homicide. Ronan, the detective in question, is further incentivized by his also dead wife, who passed away a few years ago and has already journeyed to the other side. Murdered: Soul Suspect doesnt really strive to present any one belief on what the afterlife actually is, but basically Ronan is stuck in the ghost version of Salem until he can catch the guy or girl that tossed him out of a window, and pumped seven bullets into his chest.In order to do so, Ronan has to explore the streets of Salem on his way from one objective point to the next. The streets have a small number of NPCs to interact with, both alive and dead. Occasionally youll be asked to help the recently deceased understand what happened to them, which uncovers some additional story elements that distract from Ronans main goal. These are decent bits of interaction, but they rarely end up feeling important. It doesnt help that uncovering clues for these side-mysteries involves searching the ground in the immediate area next to the ghost, and figuring out what combination of clues found will trigger the next cutscene.Hunting down clues and putting them to use doesnt get better in the main storyline either. And this is really one of my bigger issues with the game. Evidence for any given scene is generally no further than 10 feet away. When you visit a location and youre tasked with uncovering a mystery, youll simply walk from one object to the next, hope to see the button prompt indicating possible interaction, and then figure out what pieces of evidence are relevant to the mystery at hand. Not that this requires any real head-scratching, as most answers are blatantly obvious.For some reason the game gives you an indication that you have three chances to present the right evidence, but exhausting those tries really has no negative effect, you can continue to present clues even if you mess up a few times. On the flip side, if you manage to present the right evidence on your first try, theres absolutely no incentive for doing so. The whole system is essentially pointless, which leads me to believe theres a lot of elements to Murdered: Soul Suspect that were left on the cutting room floor.Case in point is the really awful stealth mechanic youll engage in occasionally. Combat isnt a thing in Murdered: Soul Suspect, you wont be firing guns or ghost punching people. However, in order to fill that action quota, youll sometimes need to exorcise demons inhabiting story-related areas of the game. I like to think these are the deceased souls of Metal Gear Solid 1s enemies, as they stick to a very strict path floating back and forth, will hound you if spotted, and will forget about you once youve remained hidden long enough. Basically, the stealth mechanics here are 14 years old already, and add little to the game other than a tinge of annoyance when you hear the demon scream signifying youll have to trudge through more stealth.Outside of these issues, there are a few ideas and things in Murdered: Soul Suspect that I genuinely enjoyed. The game is sort of open world, in that you can freely walk the streets of Salem and uncover hidden items and engage in optional activities. Its still a pretty small space, but the way the game prevents you from moving out-of-bounds is actually smart. Theres remnants of old Salem that are highlighted a ghostly white and blue that you, as a ghost, cant pass through. You can move through just about any wall or door once inside of a building, but cant move into a building without an open door aiding you. And once inside buildings, ghostly Salem remnants will still exist and occasionally block your path. Neat moments include a ghost train that runs through a museum, where you need to deftly avoid the train by teleporting to open spots around the track.I also enjoyed the dialogue, and most of the characters presented. Its not the most mind-blowing mystery or procedural youll encounter in media, but its fun in the way youd find an episode of Supernatural enjoyable. I was swerved a bit by the overall mystery of who the Bell Killer was, as I thought I pegged the right individual early on and was proven wrong by the time the end credits rolled. I also found humor in some of the dumb product placement, like Just Cause 2 posters in the police station, or that just about every cop in Salem is actively playing Deus Ex: Human Revolution as opposed to actually solving crimes, based on the game menu displayed on their work computers.", "date": "June 13, 2014", "grade": "C"}