{"name": "The Sly Collection", "ref": "https://gaming-age.com/2014/05/sly-collection-review-ps-vita/", "text": "To date, neither of Sonys HD collections on the Vita have been without their flaws. The recent God of War Collection was a solid  if unspectacular (and kind of ugly)  port, while last years Jak & Daxter Collection had more than its fair share of bugs. Based on that, you might be looking at The Sly Collection with a perfectly understandable degree of skepticism.This skepticism is totally unwarranted, though. See, this port was done by Sanzaru, who not only put together the original PS3 version of the Collection, they were also behind the most recent new Sly Cooper adventure, 2013s Thieves in Time. Consequently, they went into the original trilogy with both a solid understanding of the franchise and a pretty strong idea of how to develop games on the Vita. This familiarity with both helped them bring the Sly Collection over almost flawlessly.Before I go any further, of course, it should be noted that they were helped by the fact the three games included were already pretty outstanding to begin with. The original Sly Cooper, Sly Cooper and the Thievius Raccoonus, along with Sly 2: Band of Thieves and Sly 3: Honor Among Thieves, are among the finest games the PS2 has to offer, amazingly fun 3D platformers that featured just the right balance of stealth and action. Not only that, they looked pretty nice, with lovely cel-shaded graphics that have aged a lot better than some other more highly-regarded games of the era. In other words, considering the high point at which The Sly Collection was starting, you might be tempted to dismiss the fact that it continues to be awesome now that its on the Vita.Youd be wrong to do that, however, and to show you why Ill just refer you back to the first paragraph of this review. Both the Jak & Daxter and God of War PS2-era games are generally pretty well-regarded, yet neither of them could accurately be described as must-owns on the Vita. The Sly Collection, by contrastwell, it is a must-own, at least if you have any interest whatsoever in having a trio of exceptionally well-made platformers at your disposal anytime, anywhere. They all look amazing on the Vita, with absolutely zero indication that they were all originally designed around a decade ago. Even more importantly, they play almost perfectly. Theres never the sense that anything had to be sacrificed in order to fit everything in here, and you never feel that Sanzaru had to trim the game down or make any comprises. This is the full Sly Cooper experience, in all its glory.", "date": "May 27, 2014", "grade": "A+"}