{"name": "Daylight", "ref": "https://gaming-age.com/2014/04/daylight-review-pc-ps4/", "text": "I mostly find myself enjoying the current crop of modern survival horror games. While most titles dont stray too far from the Amnesia formula, I think theyre really effective at delivering the same type of scares felt by filmgoers, but in a much more immersive fashion than a movie experience can provide. Daylight, from Zombie Studios, is certainly one of those experiences. It is a little over-reliant on jump scare tactics than I typically like, but theres a solid amount of general unease and dread mixed in as you slowly agitate spirits while uncovering bits and pieces of the story.In Daylight you take on the first-person role of Sarah, a young woman who awakes inside an abandoned prison / asylum, armed with only a cell phone, which doubles as a flashlight and map. Youll explore wing after wing of the facility, uncovering a number of atrocities that occurred there through newspaper clippings and journal entries. Daylight presents these bits and pieces in a very direct manner. I often found myself thinking about Gone Home, and how well the narrative there was woven into the actual environment. In Daylight youre just having scraps of digital paper shoved in your face as you read through too many excerpts, which just constantly serve as a reminder to whats already obvious minutes in  bad stuff happened here.Ignoring the hamfisted story aspects, Daylight does provide a very tense, horror-themed roller coaster ride throughout the 2+ hours a single playthrough provides. Sarah has limited tools at her disposal outside of the cell phone. She can find both glow sticks and flares, and has a sprint function that lets you dart away from immediate danger. Glow sticks provide better lighting than the cell phone, and also helpfully highlight interactive objects. Flares can actually disperse approaching spirits, buying you valuable time to get to an exit. Sections of the map are completed by collecting remnants, which are additional bits of story, and then unlocking a spiritual relic in a given area. With the relic equipped Sarah then needs to make a mad dash to a helpfully highlighted exit area, as the spirits get more aggressive and frequent with each remnant found.Ghosts rarely approach Sarah directly, but there are plenty of hints when one is nearby. Sarahs cell phone screen, which constantly displays a map, begins to get scrambled. Youll hear a number of audio effects as well, all of which brings along a massive sense of dread. More often than not the ghosts will appear behind you, or just out of view, making sudden camera swings an opportune moment to scare the hell out of you. I certainly found myself jumping more than once, and Id definitely urge you to play with some decent headphones attached. Even Sarah, with some minor vocal cues here and there, managed to surprise me once or twice with a sudden gasp.That said, theres not much sustenance to keep the gameplay engaging. Its a little less noticeable considering the slight length of the game, but really youre just moving up and down hallways, collecting bits of story, and moving on to the next section. The atmosphere in Daylight is fantastic, but the game feels mechanically hollow. I was a bit more forgiving of this with something like Gone Home, but Daylight doesnt benefit from an intriguing story. And while the prison grounds do make a solid, horrific environment to explore, theres not enough unique things built into the environment to make exploration worthwhile.Daylight is also the first game released on any platform using the new Unreal Engine 4. But Im not sure that Daylight was the best showpiece for Unreal Engine 4s debut. Its not a bad looking game, but its also very dark, certainly by design. I didnt feel like the visual upgrades stood out well, outside of the obvious lighting effects provided when busting out a glow stick or flare. Its also a little rough on my current i5 4670k / 750ti rig. I could run at 60 frames per second with Medium settings and no V-Sync. But if I wanted to turn on all options at 1080p with max settings, Id fall somewhere between 25 to 30 fps. Not awful, sure, but not necessarily ideal for a lot of PC players.", "date": "April 29, 2014", "grade": "C+"}