{"name": "Backgammon Blitz", "ref": "https://gaming-age.com/2014/04/backgammon-blitz-review-ps-vita-ps4-ps3/", "text": "Im not even going pretend I went into Backgammon Blitz with any knowledge whatsoever of the board game. Prior to playing this, the extent of my understanding of backgammon was some rough idea of how the board looked, and that was about it.After playing Backgammon Blitzwell, Im still not totally sure I understand all the ins and outs of the game. The in-game tutorial tries to be helpful, but quite frankly it just left me feeling more confused than anything else. That said, once I actually got past it and started playing against the AI opponent, I quickly got the hang of it. Its not that difficult, after all  while Im sure there are all kinds of crazy strategies I didnt discover, youre basically just rolling a pair of die and moving little circles around a board. Theres minimal controls to learn, and playing on the PS Vita means you get the added functionality of a touchscreen.In this respect and in others, Backgammon Blitz reminds me of the PS Vita version of Pure Chess that came out a few years ago (which shouldnt be too surprising, since both were developed by VooFoo Studios). Like Pure Chess, Backgammon Blitz does a great job of easing in newcomers, showing how simple the game can be even when theres all kinds of strategy that can come into play (or, at least, thats my assumption about backgammon). And like Pure Chess, Backgammon Blitz looks lovely, and really makes you feel like youre looking at an actual game board.Unfortunately, this also means that, like Pure Chess, Backgammon Blitz has terrible online play. You can challenge other people to matches, but theres no way of telling whos online at any given time, which means that asynchronous matches are your most likely outcome. Given that the average backgammon match seems to take dozens and dozens of moveswell, you can probably see the problem. Or, more bluntly: score one for the low-tech solution, an actual backgammon board that can be played anywhere against anyone in real time. (Then again, the flip side of that argument would be that youd have to find someone to play with first  and seeing as backgammon isnt the most widely-played game these days, you might be better of just waiting for your online challengers to play their turns.)", "date": "April 21, 2014", "grade": "C"}