{"name": "Kinect Sports Rivals", "ref": "https://gaming-age.com/2014/04/kinect-sports-rivals-review-xbox-one/", "text": "I truly couldnt wait to get my hands on Kinect Sports Rivals. Ever since I saw it unveiled at E3, I was hoping that everything I hated about the original game would be fixed, and I could finally have a game with advanced motion controls with this new Xbox One Kinect. KSR does deliver an experience that is by far better than the original in some areas, and falls flat on its face others. Its fun at times, but there are a few glaring flaws that make it far from perfect.Unlike the original Kinect Sports, where you can pick a sport and just play, you first have to create yourself with the Kinect scanning abilities. I was shocked by how accurate my Avatar turned out. The scanning technology is a thousand times better that that of the original Kinect. Once this is finished, you can dive in. Rivals changes things up with a sort of story mode. You see, KSR takes place on a strange sports island where 3 teams are competing for dominance, and in order to unlock all of the events, you first have to suffer through convoluted and disjointed story arcs. Lets start by looking at one of the worst parts of this game, the Training. Here you have to suffer though being yelled at by Coach, an infuriatingly annoying character that could give Navi the Fairy a run for her rupees. He constantly berates you and tells you that you are no good, all the while sounding like someone doing a horrible impression of R. Lee Ermey from Full Metal Jacket. After the first few interactions with him, I wanted him punch him off of his little platform he stands on.Once you are properly trained in every event, you can then begin visiting the 3 teams on the island. The teams are, for the most part, are annoying stereotypes that basically serve no purpose other than to unlock outfits and items. You have Eagle, the clean cut snowy white team that are all about fairness. Then, we have Viper, the technology driven team lead by an angry female, and Wolf, the tribal team with a daughter who doesnt agree with the old ways of the tribe. Eventually as you progress through each teams missions through the events, youll have the option to join one of these teams for the remainder of your career.Once all of the training and ridiculous story is complete, you can finally start digging into the challenges of each event, or just play to have fun. Soccer and Bowling return from the original while Boxing, Track and Field, and Volleyball have been 86ed. Table Tennis is replaced by actual Tennis, along with new events Target Shooting, Rock Climbing, and Jet Skiing. In some events, the Kinect sensor works really well and has no issues, while other events do not work as they should. The good events are Soccer, Bowling and Target Shooting, which work well, and very seldom experience glitches or problems. In Soccer, your only goal is to score a goal. Passing the ball up the field and slamming it into the goal with a fast kick or a head-butt. After you score (or miss), you defend your goal with either a block or a punch that can sent the ball back to the opponents goal. It all works well, but does get stale quickly. Bowling is your standard 10 frame game similar to but more accurate than the original. Throwing the ball is simplified and almost always goes exactly where you release it. Target Shooting is not only new, but one of the more accurate games in the game. Here you basically move a cursor with your finger and once a target gets into the crosshair, it auto fires. Anywhere you move, the crosshair follows accurately and with precision. Its a fine addition and a joy to play.Now we get to the not so great events, in Tennis, Rock Climbing and Jet Skiing. Tennis is your basic serve and volley game, with the Kinect sometimes reading your movement while other times it does nothing. You can lose whole sets where the ball simply goes past you and your swing didnt register. Jet Skiing works well for the most part, but occasionally the steering can bug out, running you into a wall, or not register when you performed the correct movement to pull off a trick.Which brings us to the worst event of the game, Rock Climbing. This is an unbelievable mess of bad movement recognition that barely works. Most of the time, the Kinect cant see when you actually grabbed a peg, or doesnt see which direction you are reaching. No matter how good you think you are doing in once section, you will eventually fall from an unrecognized movement. Its one event to just get it over with as fast as you can and never do it again.In every event you can build up a power meter that gives you a power up move. Saying Power Up will activate it, and can give you advantage for a short time. Early on, you may not even use the power ups, but later opponents will challenge you to the point where you may have to rely on them to win.The graphics in Kinect Sports Rivals are bright, and colorful with fluid animation that really shines. Some events like Target Shooting dont really show off the exceptional visuals, while Jet Skiing can blow you away from first wave to last. Even facial expressions on your avatar and your opponents are fantastic and actually give life to the rather cartoony looking characters. Even things like background spectators are animated well, and all look like individuals rather than just repeated animations. Sound effects are spot on with the jet skis sounding as they should, even hitting the ball with your tennis racket sounds authentic. Music consists of what I call Party Tracks you would hear at Karaoke bars, but these are mostly found in menus and are largely forgettable.", "date": "April 7, 2014", "grade": "B-"}