{"name": "Diablo III: Reaper of Souls", "ref": "https://gaming-age.com/2014/04/diablo-iii-reaper-souls-review-pc/", "text": "Theres no denying that the original version of Diablo III had its fair share of problems. Casting aesthetic concerns aside, the always online approach presented a multitude of problems after launch that frustrated many initial buyers. The Auction House mechanic had its uses, but also seemed like a way to circumvent the lack of quality loot drops, making many players feel as if they needed to play the Auction House instead of playing the actual game. Legendary items, the golden egg of the Diablo universe, were downright awful yet still incredibly hard to come by. And Inferno difficulty, the end game of Diablo III, featured such a massive difficulty spike / gear check that this was the point where many players quit.But, to Blizzards credit, theyve made a number of improvements to the game since then. The loot system has gone through a couple of overhauls, the most significant of which came during the last major patch a week or so prior to Reaper of Souls. Difficulty had been adjusted and brought down across the board, and then Monster Power scaling was brought in, and now its been ultimately replaced with the Torment system thats more in line with the console versions of the game. Classes have seen a number of tweaks and adjustments, and legendary items now feel as if they match their designation. Drop rates have been improved along with the overall quality of loot, making this is a far better Diablo III than what we had two years ago.A lot of these changes were put in place to build up to the launch of the Reaper of Souls expansion last week. It was clear from the start that Blizzard had learned some lessons with this launch. The game went live at 12:00 AM on 3/25, and there wasnt a server issue in sight. I wasnt home until about an hour after launch, but I was able to log in and play immediately. No server queues, no disconnect, no lag. This was a night and day difference compared to the launch of the original game. And going forward from last Tuesday, Ive had little to complain about when it comes to Blizzards servers for the game.I played through the new story bit, Act V, with my main Monk character. Act V has a fantastic pace to it, bringing it more in line with Act 1 and Act 2 in overall length when compared to the main game. The layout of the maps featured here are drastically improved compared to any previous chapter, with a fair amount of random side quests to engage in, and challenging bosses to fight. I went in to Act V at Torment 1 difficulty, and found myself dialing it way back by the time I hit the final boss.This difficulty adjustment wasnt necessitated by lack of loot. Throughout my initial playthrough of Act V I encountered upgrades for nearly every piece of gear my Monk wore. I had put in over 300 hours with my Monk previously, so Ill admit that it was a bit disheartening seeing how quickly my hard work was being replaced. But I came out of the other end of Act V feeling pretty awesome character-wise, and couldnt wait to play more. Finishing Act V unlocked Adventure Mode, which is where the real meat of Reaper of Souls content tends to be.Adventure Mode allows you to play solo or with others, completing small missions called bounties or cashing in keystones to open rifts. There are five bounties per Act, and you can move from one location to the next just by bringing up your world map. Bounties will vary, but most see you hunting down a unique rare enemy, killing a certain number of enemies in an area, cleansing a cursed shrine or chest, or defeating an act boss. Completed bounties earn you gold, experience and blood shards. The latter of which can be cashed in for random quality loot, with the chance to earn a legendary item.Rifts are portals to randomly generated areas, which feature redesigned locations from the various Acts with random monster populations. The quality of rifts can vary, as can monster density, but the randomization provides some much needed variety to loot runs. To complete a rift you need to kill a number of enemies to fill a bar up to 100%, which then summons a rift boss. These bosses can be modified elites, or actual bosses like Ghom or The Butcher. Loot rewards for boss fights tend to be more significant, and provide another method of earning the new blood shard currency.Another new component featured in Reaper of Souls is the Mystic, a new crafter that allows you to re-roll item stats and change item appearances. The Mystic is a key component here, allowing you to take average loot and make it downright amazing with a single adjustment. The results can be random, but there are always a set number of skills that something can change into, and youre able to see what those options are keeping guesswork to a minimum.Finally, the last significant addition to Reaper of Souls is the new Crusader class. This review is a bit late in the making simply because I wanted to play this class up to level 70, and then some. Ive devoted around 40 hours or so to my Crusader at this point and I definitely enjoy it. The class could certainly use some tweaks, which I imagine well see at some point. But I think Blizzard has done a great job of making the class feel unique. Wielding a two-handed weapon with a shield, allowing for melee and ranged builds, and the ability to outright tank for groups is a lot of fun.", "date": "April 1, 2014", "grade": "A"}