{"name": "Luftrausers", "ref": "https://gaming-age.com/2014/03/luftrausers-review-ps-vita-ps3/", "text": "Note to self: start trusting Devolver Digitals taste a whole lot more. I mean, last year I went into Hotline Miami (which they published on the Vita) skeptical of whether there was any substance behind its neon-tinted violence; I ended 2013 by calling it my favorite game of the year. This year, I initially hated Luftrausers (again, published by Devolver), and nowwell, I dont think itll be my GOTY in nine months, but I wouldnt put it past it, either.Whats surprising to me, however, is that all the things I hated about the game at first soon became reasons for why I liked it so much. Case in point: the match lengths. The typical match in Luftrausers seems to end in under a minute. When I started playing the game, this bugged me. After all, I thought, how could I improve if every single time I played it, the matches seemed to finish before they even began?Funny thing about those short levels, though: they make you keep going back and playing again and again and again. In a strange way, their brevity enraged me enough to make me go back and try again. My thought process went something like: Bah, dead after thirty seconds? Whats wrong with this stupid game? Ill try again, just so I can say that you always die after thirty seconds and this game sucks!Needless to say, thirty second levels can add up pretty quickly. Its the appeal of games like Angry Birds or Jetpack Joyride, and its the appeal of Luftrausers too. Thirty seconds here, forty seconds there, and suddenly you look up at a clock and realize an hour has passed.On a similar note, the games controls initially gave me fits. I found it impossible to steer without crashing or stalling out or plummeting into the ocean, and it made me question why someone (in this case, Vlambeer) would make a game where it was so difficult to fly a plane in a straight line.As those quick matches began to pile up, however, I came to realize that I was overthinking it: this isnt a game where youre supposed to be able to fly in a straight line from Points A to B. Much like the planes from the early days of aviation, each different plane configuration here has its own charms and idiosyncrasies. You need to learn how to make your chosen build soar, and sometimes  at least on the Vita  it means just letting things happen, rather than trying to force your plane in one direction or another. It takes a bit of getting used to this, for sure, but once youve gotten the hang of it (to the extent you can get the hang of it), it all feels a little majestic.Now, to jump thoughts completely, Im going to go back to that Jetpack Joyride comparison of a few paragraphs ago. It actually serves a double purpose, since not only does Luftrausers share its approach to short(ish) matches, they also have similar approaches to setting goals. Like Jetpack Joyride, Luftrausers gives you three objectives for every match, and does a great job of mixing together goals that can be achieved in a single match with goals that require carrying out certain actions across several matches. As youd expect, it gives the game an extraordinarily high level of replay value.", "date": "March 27, 2014", "grade": "A-"}