{"name": "inFamous Second Son", "ref": "https://gaming-age.com/2014/03/infamous-second-son-review-ps4/", "text": "When inFamous Second Son was initially revealed, my first impression of Delsin Rowe was that he kinda looked like a smug, skinny jeans and beanie-wearing jerk. After spending 20 plus hours playing as Delsin, I can in fact confirm that he is indeed a smug, skinny jeans and beanie-wearing jerk  but not in a bad way. Compared to Cole MacGrath, the somewhat sulky protagonist of inFamous and inFamous 2, Delsin Rowe is a rather cool, charismatic guy who actually enjoys his new found powers. Whether he uses these powers for good or evil is up to you, but in either instance he seems to fully take ownership of his superhuman abilities and makes the best of them.inFamous Second Son takes place around 7 years after the events which unfolded in inFamous 2s good ending and is set in Seattle, Washington. With many conduits (humans with abilities) wiped out or in hiding after what went down in the second game, the government put together the Department of Unified Protection (DUP) to further contain the remaining population of these bio-terrorists. Needless to say, the (ironically super power-infused) DUP force and their director Brooke Augustine have been super aggressive at reigning in anyone they suspect may have even the slightest bit of power.Delsin Rowe is a twenty-something graffiti artist and seemingly professional slacker who cant quite live up to his bigger brothers status as a high ranking local police officer. As you would expect from any self-respecting rebel, he doesnt seem to care what anyone thinks, and even goes as far as defacing his siblings own billboards and getting busted for it. It doesnt factor heavily into the games overarching plot, but Delsin and his family are Akomish, which is a fictional Native American tribe whom has settled in a district just outside of Seattle. When a DUP transport vehicle crashes and several bio-terrorists escape custody, Delsin attempts to lend a hand to a seemingly injured conduit near the site.  After the DUP descends on the Akomish tribes town to track down the escapees, Delsin unwittingly gets drawn into the scuffle and discovers that he too has abilities. Delsin is not a normal conduit however, and once the DUP catches wind of that, they attempt to harm his family which motivates him to strike back and take down the organizations leader. Its at that point where Delsin strategizes with his brother Reggie to unravel the DUPs grip from the city and take down the agencys director.inFamous Second Son is most definitely an inFamous game through and through, which makes it a super power-infused action adventure game at heart. If youre expecting a massive, varied Grand Theft Auto V map, or realistic traffic patterns and vehicles, dont. Second Sons virtual recreation of Seattle is a playground for Delsins abilities, first and foremost. Forget cars, planes or public transportation, his preferred form of travel around the area is either on foot or by utilizing his traversal abilities. Traversal is something youll do a lot of as Delsin hes quick and nimble, and can climb damn near anything in the city. In conjunction with his new superhuman abilities, he can run or fly, over or through obstacles, and clear across each district, with lightning speed.Ive never had the pleasure of visiting Seattle, but seeing the in-game Space Needle up close and of course the damp weather, Starbucks-style coffee shops on every corner and skinny jeans-wearing residents all over the place, I can only assume that its a fairly accurate (and incredibly attractive) depiction of the city. inFamous Second Sons sandbox version of Seattle is broken into several districts, each under strict control by the DUP as they attempt to round up the remainder of the conduits in the area.Second Son is broken down into story missions which are very clearly marked on your phones mini map. Sure, you can proceed from story mission to story mission if you really want to, but Sucker Punch makes it difficult to stay on course thanks to the variety of brief side-missions and the games karmic system. In inFamous Second Son, its up to the player to decide what moral path that Delsin takes: good or evil, and like in previous inFamous games, the choices you make in the game are fairly binary. Capturing DUP, freeing fellow conduits, busting drug dealers and steering clear of harming citizens will earn you good karma. Assassinating DUP, breaking up peaceful protests and generally causing havoc in the city will earn you evil karma. There are also side-missions which present you with a good/evil choice which will further push you in one direction or another. To truly unlock Delsins full potential, the ability tree and unlockable abilities are structured in a way where you kind of need to go fully in one direction, though it depends on your play style.Blast shards, which are utilized these days as power sources in DUP equipment, play a huge role in Second Son, essentially serving as the currency used to upgrade your abilities. The shards in the previous games were just there to collect, and while addictive to track down, were often a super pain in the ass to 100%. Chasing down drones, taking down DUP Command Vehicles and busting up scanners at checkpoints are just as addictive in Second Son, but also a whole lot more enjoyable thanks to the locations being marked on the map.Most other missions scattered about each district can earn Delsin karma and/or decrease the control of the DUP. These include locating surveillance cameras, capturing undercover agents, finding recording devices planted around the city, or tagging the city with some (rather attractive and often clever) graffiti art. Since the karma payoff is worth it and they only take a short time to complete, most of these ancillary missions suck you right in. Before you know it youve wasted an hour busting dealers, tagging the city and  sneaking into DUP command posts and whatnot. Choosing to be good/evil also influences the storyline, so most players will have to work through the game twice in order to see it all. As for length and difficulty, Second Son should take players between 12+ hours to get through the story depending on the amount of side-missions completed and difficulty chosen. If youve been following the inFamous Paper Trail ARG game online, you can unlock a few more hours of episodic side-story missions along with some karma.Ok, so enough about the city, the DUP and Delsins beanie, how does inFamous Second Son play? Two words come to mind  smooth and responsive. Sucker Punchs games are always a pleasure to play and Second Son is right up there with their best. Whether Delsin is just running around on the street, climbing a tall building, or taking on an aggressive batch of enemies, the gameplay always holds up. As a playable character, Delsin is quick and nimble on his feet, and with his cache of powers, hes spry enough to take care of himself. Except for water he apparently cant swim and is immediately warped back to shore if he finds himself submerged.Delsin begins the game with smoke powers but thanks to his ability to absorb new powers from other prime conduits, he picks up two more during the course of the game, one of those being the previously revealed neon power. The decision to allow Delsin to use one power at a time is an interesting one, especially when being good/evil influences which set of abilities he has access to. Once unlocked, switching between the powers is as easy as finding a source to recharge them  a smokestack or a smoking vehicle for smoke, and any neon light or sign in the city for neon. What this means is that you cant mix and match powers on the fly and instead need to stop for a moment to locate the appropriate power source and absorb it. Some strategy comes into play since certain powers may be more advantageous in a particular situation. The game does occasionally force a power on Delsin for a short time, boss fights for example. The up close melee attacks (which are power dependent) are streamlined and effective if you end up in close quarters with an enemy. There are no wacky QTE motions or button presses to worry about during combat, just short close-range combos that are ideally mixed in with ability-infused attacks. Other attacks such as a focused sniping shot, crowd control grenades, armor piercing charge blasts or an earth-shaking aerial drop are both influenced by power type and karma levels, so they may serve different purposes depending on how you choose to play the game. Delsins third ability is an interesting one, and it would be a spoiler to reveal it in a review.Sucker Punch didnt go overboard with the unique DualShock 4 controls, though theres a comfortable amount of non-combat usage of the sixaxis (for tagging missions), and the touch pad (for absorbing shards, recharging abilities, opening doors). So if youre worried that theyve tossed in some poorly thought-out motion controlled sequences during difficult gameplay sequences, dont be.Since inFamous Second Son is one of the few post-launch, non-cross generation games available for the PS4 right now, theres no way I cant discuss the games stunning visuals. Sucker Punch certainly put together a stylish looking game, and the art direction is especially focused and consistent throughout. The image quality is nearly impeccable, rendered at a 1080p native resolution and running at a seemingly smoother than 30fps framerate. Textures, lighting and particle effects are all high quality, and the game is full of realistic looking shaders and materials. The often wet, reflective Seattle streets and the constant glare of the sun and other light sources make for some spectacular backdrops.  Even when Delsin is moving at light speed and unleashing all his powers during an intense battle, the engine does a great job holding texture/object pop-in and framerate drops to a minimum.  There are no load times to worry about either, so the data is either loaded in memory or being streamed on the fly.  When Delsin whipped out his neon powers at night for the first time, Im pretty sure I said wow! out loud.InFamous Second Son impresses on the audio front as well, and Sucker Punch utilizes surround sound and the DualShock 4s speaker to great effect in much of the game. The city feels and sounds fairly alive, with ambient sounds, voices and audio cues all around. Listening closely for the whirr of an overhead drone or the crackling launch of a DUP long-range attack is essential for survival. The sound effect of absorbing shards, which shifts from your home theater speakers to the DualShock 4 speaker, is especially neat and three-dimensional. Delsins catchy cellphone ringtone generated by the controller speaker will likely catch your attention the first few times it happens. Background music kicks in during action sequences and dramatic scenes, and I personally appreciated some of the modern alt-rock soundtrack that occasionally fades in.The voice work in Second Son is also nicely written and acted, and the tone of the game isnt nearly as dark as we saw in inFamous 1 or 2. If you look past his wry grin and sense of style, Delsin is actually quite likable, and his sarcastic wit is totally in character. To tell parts of the story, inFamous Second Son jumps back and forth between in-game cut scenes and motion comic scenes, both of which are gorgeous and surprisingly not all that frequent.I can boil down what I dont like about inFamous Second Son to mostly a few nit-picky complaints  which is a good thing. Overall, inFamous Second Son is more the refinement than the re-invention of the inFamous formula; so if you totally disliked the series on the PS3, theres a small chance youll like what Second Son has to offer. I can see some gamers complaining that, like inFamous 1 and 2, the side missions can become repetitive. They are, at the beginning, but the variety opens to an extent later on. Also, enemies can sometimes spot and unleash attacks from incredible distances with pinpoint accuracy, which as you would expect, can get annoying in certain situations. Other oddities may find you standing right beside some seemingly aggressive DUP soldiers who will run right by instead of attacking even after theyve been alerted to your presence. [Pet peeve alert] I cant believe Delsins feet dont kick up water or create footprints when he runs through a puddle or on a rain-slicked surface. Also, foliage doesnt move when you brush past or trample through it. Visually, the game is loaded with amazing little touches, so those two omissions irked me a bit. [/Pet peeve alert] Last but not least, there are no leaderboards, mission rankings or the ability to replay story missions. The game structure doesnt lend itself well to that sort of replayability, though if you were used that type if feature in Grand Theft Auto V or other recent open world games, you may be disappointed.", "date": "March 20, 2014", "grade": "A-"}