{"name": "Titanfall", "ref": "https://gaming-age.com/2014/03/titanfall-review-xbox-one-pc/", "text": "It has been many years since Ive played a hard core multiplayer game online for more than enough time than just to review it and forget it. Sure, games like Battlefield and Call of Duty have served their purposes for those who crave the online thrill of competition, but for myself, I have stayed away from the multiplayer atmosphere due to its ever growing repetitiveness and hackers galore who suck the fun out of it. When hearing that Titanfall was going to be an online only game with no story-driven single player campaign, my excitement for the game began to diminish. Thankfully I participated in the beta, and after just a few short days, I was hooked to say the least. Now that the game has shipped and I had a chance to experience all the game play modes with the general public, I can honestly say that Titanfall has exceeded my expectations of what to expect from a typical multiplayer shooter. From the games fantastic controls, to its strong visuals, to the fast and furious twitch, run and gun style of gameplay, there is very little to snub your nose at. This effort from the former Call of Duty developers at Respawn Entertainment have really raised the bar on what gamers will expect from this point on in their online multiplayer shooter experience.Ill begin with what makes Titanfall so great  and that is the seamless and responsive controls, as this goes for playing as a human-sized pilot or a towering Titan. You would figure with the amount of different ways to run, gun, and play that the controls would be too convoluted to map to a controller, so I was surprised at the pick up and play mechanics which make the game accessible to everyone. The well thought out controls make Titanfall feel as natural on a controller as it does if you play on a PC with a mouse and keyboard. Keep in mind that just because you can easily get into a game and quickly become familiar with the control scheme doesnt means that this game is a pushover. You are only as good as your wits, so they better be fast and keen if you are to top any of the leaderboards anytime soon.Whether you find most of your time playing as a jet pack-wielding, wall-running soldier, or jumping into a massive Titan, the games simplistic and balanced play feels genuine, fun and addicting without feeling overwhelming or cheap. In each session your begin with a pilot and you join in the 6 on 6 battle arena to grab frags and take over territories. After a certain amount of time you will be granted the ability to call your Titan from the skies, and once you suit up, you become more badass than Barney Stinson ever imagined. You come equipped as a pilot with access to a primary fire arm, a side arm, a titan buster, as well as grenades and certain abilities such as cloaking devices. Titans also have an assortment of gear and upgrades as well; it is up to you which style suits you best. As you level up you not only gain access to more pilot and titan gear, but you even will be able to customize each however you feel. There are also game-enhancing touches such as burn cards to earn, which can be equipped for one match only with extra abilities such as faster speed, amped up weapons, or faster Titan launching times. While they may give you a temporary advantage, they never feel so overpowering as if you are cheating either.There is a campaign mode in Titanfall, but its not what gamers would describe as a single player mode. You play as either the Militia or the IMC in 9 different rounds of game play in 6 on 6 battles and you gain experience and challenges throughout. Once you finish one side, you have the option to play as the other, but to be honest with you; the story is essentially background noise that even after completing both sides I still couldnt tell you what the real objective was. Of course the game offers more than just the campaign mode and it is this variety and strength of each style that will keep gamers coming back again and again. You have the entry Attrition Mode which is your most typical of the pilots versus Titans game play which inevitably ends when the best team wins. Pilot Hunter mode is one of the more challenging modes and is your best bet if you are hoping for a more classic Deathmatch mode. Hardpoint Domination can best be described as Star Wars Battlefront with Titans, where you try to hold down small areas on the map and seize control until only one team is the sole survivors. Capture the Flag is the mode everyone loves, with a twist, as you have your lively pilot taking the flag into the safety of his massive Titan in which you must defeat to regain access to the flag. Lastly, those who want a mono e mono showdown, Last Titan Standing puts gamers on an even playing field, one Titan, one life, no prisoners. All these modes are accessible from the beginning, but it is up to you in the end which mode has the best taste for your gaming palate.No matter which mode you chose, the progression pace is fast and satisfying as it seems that new features, weapons, challenges, and goodies open up all the time. You will earn these progressions in both classic multiplayer modes as well as in campaign, so you are not forced to play one way or the other. If you havent played a shooter in a while, Titanfall even supplies a nice in-depth tutorial that is set in a MGS VR style training room rather than trying to figure it all out in open battle. This definitely came in handy for sure, and Im certain there will be gamers out there no matter how skilled they are that will feel the same way.Visually Titanfall is pretty stunning, from the different and original maps you encounter, to the more than stable framerate and lack of lag which is exceptional especially since the game is only online and relies on such stability. This isnt to say I havent experienced a few hiccups here and there, but none that ever came in the same place where I would say that the game had a problem here or in this situation . Happily it all remains very smooth and I would maybe see something that stuck out as a technical flaw maybe once in every 20 matches. Things become even more impressive for the future possibilities of Titanfalls DLC as in a few of the levels you will see some gigantic monsters who look like the brothers of the Cloverfield monster. While they are just backdrop fodder this go round, you have to wonder if in the not too distant future we will be able to take them on in some major battle.", "date": "March 18, 2014", "grade": "B+"}