{"name": "Flat Kingdom Papers Cut Edition", "ref": "https://gaming-age.com/2022/05/flat-kingdom-papers-cut-edition-review-for-nintendo-switch-ps4-5-xbox-one-series-x/", "text": "Ive been playing games published by Ratalaika for a very long time, and almost without exception. That means, of course, I have a lot of experience in playing games that, often times, arent of much value apart from being an easy Platinum Trophy. Part of me (a very, very small part of me) sometimes (by which I mean virtually never) wondered whether Id enjoy the games at all if it werent for that addictive sound of trophies being achieved.Going by Flat Kingdom, the answer is a pretty clear no.Quite simply, Flat Kingdom sucks as a platformer. Theres really no other way around it. Whatever charm its visuals possess  and Ill get to those eventually  the actual gameplay is so brutally terrible, its hard to see anything redeeming in the game.First off, the combat system makes no sense. Its sort of similar to rock-paper-scissors, in that all the enemies you come across are vulnerab;e to one of the three shapes your character can change into (circle, square, triangle). Unfortunately, Flat Kingdom never actually tells you this, as far as I could tell, instead relying on you to seek it out in the pause menu  first selecting your journal, then requiring you to flip over to the enemies subsection.To be fair, youll occasionally see shapes appear over some enemy heads, but unless you dig into your journal (again, in a subsection of a subsection), youre not necessarily going to put it together. Even if you do figure it out, though  either by chance or by reading  it still doesnt always seem to work like it should. Numerous times Id switch to what I thought was the right shape, only for it to do nothing. Its most egregious in the boss fights, however, where there doesnt seem to be any connection between your shape and whats most effective.Flat Kingdom adds to its frustrating nature by having terrible platforming (kind of a big deal, since its a platformer). Jumping is a pain, and all of the shapes  even the circle and its double-jump  feel heavy and lifeless, to the point that even when you double-jump, it doesnt feel like youre doing much more than a short hop. Along the same lines, running isnt all that fun either, since the shapes speeds only vary from medium (with the triangle) to plodding (the square).The truly bizarre thing about it all is that Flat Kingdom looks like it wants to be a cute, charming platformer. Youre playing as a shape trying to protect a 2D kingdom from 3D enemies, and its all brightly coloured. Its also kinda-sorta done in a paper craft style, though if that werent said explicitly in the games description on the eShop, I wouldnt have guessed that. Still, it looks nice enough.But no matter how cute it may be, theres no getting around the fact that Flat Kingdom is an awful game. It might be worth it if youre obsessed with Trophies or Achievements on another system, but if youre just playing for the fun of it, dont bother. There are plenty of other, better platformers to be found on the Switch.", "date": "May 11, 2022", "grade": "D"}