{"name": "E-Win Racing Gaming Chair  Flash Series", "ref": "https://gaming-age.com/2019/05/e-win-racing-gaming-chair-flash-series-review/", "text": "When it comes to modern gaming, people have a laundry list of things they focus on to make their experience great. Some people focus solely on performance and the graphics output of their favorite gaming platform, some people focus on the peripheral items like controllers or mouse and keyboard, some focus on the best screen available, be it a TV or computer monitor. All of that is great, but if you stop and think, the one piece of gear that is relevant across all platforms and will be used more than almost any other feature is a chair. Whether you are a console gamer or a PC gamer, a serious shooter player or a casual Minecraft enthusiast, you need a place to sit while you do what you love. Consumers will drop a casual $1000 on the hot new screen, or $500 for the latest console, but balk at spending a couple hundred on a chair, something that can reasonably last through several iterations of all the other peripherals. In addition to lasting a long time, a good chair can save your back and help improve your posture if you are someone who plays for hours a day, every day.I had a pretty solid gaming chair of my own when E-Win approached me about checking out their line of PC Gaming Chairs. They asked me for an idea of my height and weight so they could tailor the chair to my size, as they have several different series of chairs that fit different body types. I am 62 and weigh around 200 lbs, so they sent over a chair from the Flash series, which is their largest series. According to their website, it can comfortably accommodate a player who sits at 7 tall and <500 lbs.The first thing you will notice is how incredibly simple installation is. After opening the box and grabbing the base and the back out, it was about a 10 minute install from open to set up. This is better than any chair I have previously owned by a large margin. Not only is it incredibly simple to assemble, it is SOLID. There is not a single part of this chair that feels like it is less than capable of supporting a large person. Sometimes you can see or feel where corners were cut to release a piece of furniture, but the E-Win Flash series chair feels good all the way through.Multiple recline options give the user the ability to adjust their seating based on their needs. When I am sitting at my PC writing or playing with mouse and keyboard, I like to be seated straight up, with full back support and a good platform. If I am playing with a controller, or just watching a movie or something, I like to recline a little bit more since my arms are not up and I do not need my hands on the desk. The E-Win chair makes it easy with a simple pull handle on the right hand side under the armrest, similar to how most vehicle passenger seats without electric controls used to work. The armrests themselves are solid, but comfortable. They adjust up and down, you can adjust their angle or you can slide them forward and backward. The height of the Flash series is one of the key selling points for me. Even on lower settings, I am high enough to sit comfortably without feeling like my knees are being pushed up to my chest, but without my feet dangling either. There is plenty of room to raise it as well, so taller people can definitely take advantage of it. There is also the standard neck pillow and a lumbar support pillow included with the chair, pre installed. When it comes to chairs, take the time and do the research to make sure you are getting the most bang for your buck, and dont be afraid to spend a little bit more (if it is justified) to get the most comfortable chair you can to fit your needs. The Flash series comes in at around $400, but if you are smaller and do not need as much you can get many different styles of gaming chair on their website with many coming in with much more reasonable price tags. You can also use the code gamingage for 20% off any purchase you make.", "date": "May 23, 2019", "grade": "A"}