{"name": "Thief", "ref": "https://gaming-age.com/2014/03/thief-review-pc-ps4-xbox-one/", "text": "A good sneaking game with great stealth mechanics is hard to come by these days. As a master thief, its your job to score some great loot without anyone knowing you are there, until its too late. So is everything worth taking or are all the gems in the game made of glass?I have been a fan of the Thief series since the original game, Thief: The Dark Project by Looking Glass Studios came out in 1998. The games were great fun finding your own way to sneak into a building or residence, and taking the target loot from them. The Thief games have always made shadows your friend, and in many ways was a pioneer with lighting in games. Players use shadows to hide from the guards and hoping they dont see you. The series for the most part has almost always been about stealth and not confrontation, and this is no different in Eidos Montreals take on the game.Players take the role of Garrett, a master thief, and he has been hired to steal the Primal Stone. Along the way we run into Erin, another thief, and discover that stealing the Primal Stone is a two person job. Once you reach the location of the stone, however, some bad things happen and Erin is presumed dead. During this mission players are given very easy to follow and understand tutorials, helping players to understand how the game mechanics work, since for example, it can be a little confusing to figure out whether Garrett is standing in light or shadow. Once the prologue mission is over, Garrett must make his way to the clock tower, and there the game truly begins.The world of Thief is a fully imagined fantasy world with a dash of industrial revolution. Its a dark, very compact city making traversing the roofs fairly easy and fun, making you feel like an actual thief. Garretts handler, Basso, sends the master thief out to steal various objects around the city. At this point Garrett can make his way to the mission point in the city any way he wants or just break into a house to steal some trinkets  just make sure the watch isnt around. Once Garrett reaches the starting point of a mission, there is a brief cut scene and then the mission starts.Garrett has many tools to use while sneaking around. Tools for making distractions, putting out light sources, stunning guards, etc. Aside from his hands, he can use items like his bow with water arrows to put out light sources from a distance, or rope arrows to help him climb. His blackjack is used to knock out guards, the claw is used to hook onto ledges and help pull him up out of range of guards. As items are taken during missions, they are automatically turned into gold, and then can be used to upgrade or buy new tools.Sneaking around during missions is extremely satisfying, especially when sneaking up on guards and relieving them of their wallets, keys, or whatever else they have in their possession. Players will feel very satisfied when successfully avoid particularly well placed guards by using all the tools in their arsenal. When guards think they see you an eye appears over their heads, the eye slowly fills up as long as you are in their field of view. Once it fills, the guard has seen you and he alerts other guards around him. Once guards are alerted, Garrett can run and try to hide, or fight the guards. Combat in Thief is extremely clumsy and difficult and for the most part if you engage in more than one target at a time, which makes it obvious that Garrett is a master thief not a master swordsman.One of the tools that Garrett has in his arsenal are empty bottles. They can be found in the environments and thrown to distract guards. But be careful, if you do it too many times in the same area, the guards will be alerted to your presence. A big complaint with this mechanic in the game is that more than once I have come across a couple of empty bottles that I could not take, and Garrett can only carry one bottle at a time.A nice touch within the games environment is the placement of notes and other objects that can be used to find loot. For example, early in the game players come across a note written by a voyeur detailing where a safe in a house is. Overhearing conversations can also reveal details on where valuables can be found in the city.This Thief review is based on the PC version of the game, so the issue may not be present in other versions, but there seems to be issues with the audio. For example during the prologue it is raining when players are trying to make their way to the clock tower. When ducking out of the rain, such as breaking into a jewelers store to relieve them if their product, the noise of the rain gets dulled just like it should. The annoyance comes from if there is a window open there is no gradual increase in the sound of the rain the closer you get to the window. The sound of the rain is either there or not depending on how close to the window you are. Similarly, when eavesdropping outside a window, the conversation happening on the other side of the glass is heard clear as day, even across the street. Im hoping this gets fixed in future patches.When spotted, a tense music theme starts playing to create a sense of urgency to get out of sight and hide. However, the music can be a burden, also popping up while you are sneaking around keeping your ears open for guards footsteps. A stealth game like this should be quiet with no music unless spotted, as a thiefs ears are one of his best assets.", "date": "March 11, 2014", "grade": "B+"}