{"name": "The Walking Dead: Season 2 A House Divided", "ref": "https://gaming-age.com/2014/03/walking-dead-season-2-house-divided-review-pc-xbla-psn/", "text": "Telltales take on The Walking Dead continues to put an emphasis on drama and survival in a post-apocalyptic setting with the second episode of Season 2, dubbed A House Divided. We last left Clementine amidst an all-new cast that didnt harbor nearly as much goodwill and trust as the characters in Season 1. Of course the same could be said of Clementine, and this second episode does a solid job of allowing this new group turmoil time to unfold.It also throws another wrench in the works, as were introduced to quite a few new faces this time out, including a surprise or two. For fans wondering when the events of 400 Days would start to play out, A House Divided gives us our first glimpse of that DLC starting to bear weight.This episode weaves between action and drama nicely, with an excellent pace that makes the nearly two hours spent with the episode fly by. There are a number of fantastic decision making moments that have immediate impact within the episode, including a couple that are sure to have larger ramifications down the road. And while some decisions have little effect on how a particular scene goes down, theres also real opportunity to affect who lives and dies in the tense finale.A House Divided doesnt introduce anything thatd Id call new, outside of the plot development. The voice acting remains top notch, the visuals are crisp and echo the comic that Robert Kirkman, Tony Moore, and Charlie Adlard have created. All of these are things to be expected at this point, and the ball isnt dropped here. My only real complaint in the gameplay department is that this episode continues to deemphasize exploration, with very little non-character interaction within the environment. There are even a couple prompts to look at items that lead to literally no reaction out of Clementine, which just seems odd.I played through this episode on PC via Steam, and thankfully ran into no technical or graphical issues, outside of the end. As Walking Dead fans know, each episode will display your critical choices, and often compare them to the actions taken by other players. While this screen did display at the end, it was essentially blank. Letting the game roll through credits and go back to the title screen, I still didnt have an option to see these choices I had made. I did get full achievements for completing the episode, and a save file is updated, but I hope that this has no ramifications for how the next episode will pick up on things.", "date": "March 5, 2014", "grade": "B"}