{"name": "The Banner Saga", "ref": "https://gaming-age.com/2014/02/the-banner-saga-review-for-pc/", "text": "This being the first Kickstarted game Ill ever review, theres a bracing nakedness in the lack of barriers between the audience and artist which casts an air of intimacy over the whole critique. In no way do I feel that this separates it from any other indie or AAA game Id likewise be writing about, but its worth acknowledging that I feel a responsibility of being more careful about what I have to say, namely because I know that its being read by a handful of guys who worked really hard on bringing a vision to life. The least that can be done in a review is to be as thoughtful in writing as Kickstarter stuff intends to be in practice.Anyway, its really rad of me to pat myself on the back. Lets get on with this.The first thing anyones going to notice about The Banner Saga is that its aesthetics are no longer interpretations of concepts, but simply the art itself, in-engine, with nothing lost in translation. Its a visual treat and were almost a little bit spoiled by the fact that there are even a few fully-animated cutscenes, considering the exhaustive process of hand-drawn animation. Instead of risking any half-imagined ideas you have of what that looks like, well just leave gifs to speak for themselves.Banner Saga starts off on a strong note with one of those cool cutscenes and then levels out over the next few hours, as characters are introduced enough to hint at their moral compass. Clearly the fictional world on display has a lot of backstory, or at least we could be lead to believe so due to subtexts for almost every character interaction. Whats fascinating is how rarely I can recall the games interest in explaining much about anything before the events taking place in Banner Saga, outside of some rough outlines of who the Dredge are, why everyone hates each other, and that some gods used to be alive.The last game I remember denying itself the temptation of having characters speak to each other as if theres suddenly an uninformed audience is The Witcher, and that game was about a guy with amnesia. Writing in games is important to me, which is why bias clouds my judgement over a games quality especially when the writing is there to uphold a contrivance for whatever the actually gameplay is doing.This isnt to say I loathe The Banner Sagas tactical systems, although they managed to confound me for a while. However, the secret reason to play Banner Saga is to appreciate the detail with which each characters actions are described, and in every small conflict that roots your choices even further in the reality that your decisions  for better or worse  persistently affect your caravan.The lack of familiarity with this new fiction only further serves to throw us for a loop, eking uncertainty into many of the gut-based responses youll commit to in a conversation. Its nerve-wracking at times, and refreshingly unfamiliar its uncaring outcomes. Just how many refugees are you going to shelter before you get sick of the percentage that turn out to be bandits leaving you high and dry with a few casualties to boot?Youll wish for revenge, feel blessed at good fortune, wonder what could have been, and all the while flying by the seat of your pants in a perpetual state of self-doubt. The Banner Saga doesnt just make you second guess its characters, but pits players against themselves at committing to most decisions. Its an agonizing feeling at times, but almost a rarity to experience when playing any other video game. If I could buy this game an ice cream for how much I hated playing it, Id do that in a heartbeat.As for combat, the game operates on characters possessing attributes of Strength and Shields  the former being a collective resource which directly connects the damage points you can inflict with the amount of HP you have. The weaker the soldier, the less harmful. Shields are a more traditional value, being a straightforward number that determines your level of defense. While these are two separate resources, they can be targeted individually or collectively with special attacks that use Willpower the wildcard of the bunch.Willpower points are a multipurpose asset that can be used to extend movement on the map for a tile-per-point, finagle out a couple more points of damage on attacks, or used previously mentioned special abilities which are specific to characters. They also hold the special talent of being the one thing enemies cant draw out of you in some way, so theyre yours alone to waste.Each battle operates like a game of chess with strings attached, as every moving piece can make combat dynamic to a point of being unpredictable, while still offering endgame opportunities to turn the tables in a moments notice. Most tacticians will find themselves surgically removing the enemy from the map, or surreptitiously building a dominos finale of unmatched proportions. Me, personally, I was shit at combat for the first four hours at least. While battles offer the potential to level up, regain willpower through kills, and sharpen your skills, they were a losing battle for me until I began opening strong on specific enemies with as much added willpower as I could muster to each opening attack. Bring down the shields, thats what worked for me, only I finally got the hang of Banner Sagas systems fairly late in the game.This will backfire on players not anticipating the games demanding incline as enemies grow stronger. Unlike XCOM or Fire Emblem, losing a battle simply means the story continues with no loss of characters. The cost of being allowed to continue past a lost battle is instead a more subtle, long term consequence of units failing to achieve kills over time, preventing them from leveling up, and effectively setting players up for repeated failure save for a few gimmes.While this gradual decline in unit competence is a shared trait between a game like XCOM, whats not so clear is the contingency plan is for players: load an earlier save file or give in and change the difficulty level to get those levels. Levels, and perks, which dont seem to have nearly the impact in battle that youd hope they will or at least are only useful in the rare situation where enemies are lined up just right.Myself, Im not sure if the dynamic nature of Banner Sagas combat is inventive or simply experimental, but for the time being, its at least different. I also cant tell if theres any scaling going on or if the game just expects a difficulty dial to stand in for more thorough design. My take is that its a great starting point for 1v1 tactical gameplay that could use more time in the oven, although other people seem to like it and you may be one of them.", "date": "February 26, 2014", "grade": "B-"}