{"name": "Sonic Frontiers", "ref": "https://gaming-age.com/2022/11/sonic-frontiers-review-for-nintendo-switch/", "text": "Should you play Sonic Frontiers? Maybe. Its an odd game, but it also does some interesting things, so its really dependent on how much you want to see Sonic in an open-world (sorry, open zone) setting. Ive played worse games, and at the right price I think its probably worth it.Should you play Sonic Frontiers on the Switch? Now thatthats a much more complicated question.The good news is that Sonic Frontiers on the Switch is the same game, essentially, that youd play on any other system. If you want to explore a decent-sized world, collecting lots (and lots and lots) of rings and hearts and all kinds of other collectibles, youll get that here. Mind you, this also means that you get the same less-than-great parts of Sonic Frontiers, too. The so-so platforming with a camera that cant always keep up with where Sonic is? Thats here. The combat that often feels a little reliant on button-mashing? Also here. The annoying minigames that you occasionally have to compete to move the story along? Yep, those are present too.But playing Sonic Frontiers on the Switch doesnt just mean enjoying the good parts of the game and enduring the annoying parts. It also means putting up with one of the ugliest games Ive ever played on the Switch.On the one hand, I get it. Even if its not officially an open-world game, these zones are pretty huge, and making it so that Sonic can zoom around without loading screens every few seconds is a pretty impressive technical feat. But just because Sonic Team were able to make it happen doesnt mean that there werent some pretty significant compromises made in the visual department. For example: thanks to the weather cycles that are a feature of the game, right when I got dropped into the open world at the very beginning, it was raining. Or, more accurately, it was supposed to be raining, but it looked like I was watching the game through a very old, very fuzzy CRT TV where I didnt subscribe to the channel I was trying to watch.Id like to say this was a one-off thing, and that once the rain cleared up it improved, but that didnt happen. Even in perfect weather, everything here looks dull and unfocused. Pop-in is a constant, whether were talking about the grass around you, or trees, or enemies, or, uh, entire mountains. It would be great to say that none of this matters, and that the gameplay is enough to carry Sonic Frontiers. And, to be fair, during the more traditional gameplay sections, the game performs mostly fine. But seeing as you spend the vast majority of your time here wandering through a hideous open world, the performance is an issue. If you can put up with that thanks to a deep and abiding love of all things Sonic, I wouldnt fault you  but if you take one look at this ugly mess and decide you dont want any part of it, I wouldnt blame you for that either.", "date": "November 23, 2022", "grade": "C"}