{"name": "Earth Defense Force 2025", "ref": "https://gaming-age.com/2014/02/earth-defense-force-2025-review-ps3-xbox-360/", "text": "Ive never been big on stealth in games. Given the choice between charging headlong into battle, Kratos-style, or skulking about in the shadows, a la Thief or Deux Ex, Ill go with God of War every time. (In fact, sometimes I go with that even when its not a choice, which explains why Im not very good at stealth games.)This is why the Earth Defense Force series has long been one of my favourites, and why Im so in love with Earth Defense Force 2025. I mean, youre given access to shotguns, rocket launcher and grenades (among other things), and youre told to go kill every bug and giant robot in your way. EDF 2025 is the exact opposite of stealth, and every moment I played it was pure joy. And not joy in the Tearaway, Creation-is-so-wonderful-la-di-da sense, either  rather, I mean joy in the I blowed that buildin up reeeeeal good! kind of way.In fairness, of course, there is some strategy to the game. You need to know which weapons work best in which levels  a fact I learned all too well the first time I attempted to use an overpowered rocket launcher inside a small cave. Further, you need to know the proper angles for using certain weapons, lest you happen to fire a missile at a building thats a little to close, thereby launching yourself  or, rather, your corpse  hundreds of feet into the air.Really, though, EDF 2025 is all about using immense firepower to level everything in your path. And when it gets that right  as it does most of the time  it is freaking awesome. Every explosion of green and purple and red that accompanies the destruction of another bug; every city block I completely destroyed; every time I launched bits of bug hurtling off into space: all of these things left me cackling with glee.Of course, its the B-movie touches that have always elevated EDF games to the level of must-play, and EDF 2025 is no different. Like previous games, the buildings in EDFs alternate universe shatter rather than explode, and its as hilariously wonderful to watch the hundredth time it happens as it is the first. Similarly, I love the dialogue in this game; whether its the breathless reports coming in over the radio of the most inane, irrelevant things, or the bizarre lines uttered over and over by your EDF squadmates, every time anyone speaks in this game, you get the sense that the writers who translated the game into English do so without ever having heard actual English sentences before in their lives. In particular, kudos go out to whoever decided that the EDF needed a song of their own set to the tune of Battle Hymn of the Republic  its gloriously stupid, gloriously cheesy stuff.Now, there are some joyless souls out there who may say that EDF 2025 doesnt fall into the category of so bad its great, but, rather, is simply bad. That the gameplay is repetitive. That the plot is nonsensical. That the graphics are awful. And to those people, all I have to say is", "date": "February 26, 2014", "grade": "A-"}