{"name": "King Oddball", "ref": "https://gaming-age.com/2014/02/king-oddball-review-ps-vita/", "text": "My expectations for King Oddball werent very high. Considering that a) 10tons first PS Vita game, Sparkle, was a straight-up Zuma clone, and b) they spent a big chunk of their PlayStation Blog post promoting the game referencing Angry Birds, I figured there probably wasnt going to be much in the way of originality on this one.As such, heres a surprise: its not nearly as derivative as you might think. In fact, if anything the games one big flaw is that its not derivative enough.See, its a casual, physics-based game. It certainly has some similarity to Angry Birds in that respect, but the gameplay is different enough that I wouldnt call it a reskinned clone or anything. Whereas Angry Birds is all about getting the right angles on your shots, King Oddball is more about timing. Youre still flinging things at objects, but you have far less control over them here than you do in Rovios ubiquitous timesink. Rather, the titular King Oddball swings rocks back and forth across the screen, and its up to you to time his release at just the right moment; time it right, and you can make those rocks careen back and forth across the screen, taking out everything that happens to be in their way. Its a pretty simple mechanic, but  as is the case with the very best casual games  there are seemingly endless ways to employ it, and King Oddball puts them all to very good, and very addictive, use.The games issue, however, is that it has virtually no replay value whatsoever. Whereas most games of this ilk have realized the inherent value of high scores and three-star rankings, King Oddball has none of that. Once you finish a level, thats it. There are a few side quests (for lack of a better descriptor) that play with the formula a little, but even in those cases, theres nothing compelling you to come back and try a level again. True, there are plenty of levels on offer herebut considering how quickly youre likely to fly through them (because seriously, this game is addictive), it wont be long until those are all gone and theres nothing left to do.", "date": "February 14, 2014", "grade": "B+"}