{"name": "Eufloria HD", "ref": "https://gaming-age.com/2014/02/eufloria-hd-review-ps-vita/", "text": "Just looking at Eufloria HD, you might be tempted to slot it into the whole games-as-art movement. After all, the overall point of the game is to pollinate planets, youre doing so against a softly-coloured backdrop, and its all set to gentle, ambient music. If that description doesnt just scream Artsy! at the top of its lungs, I dont know what does.Then you actually play the game, and discover that everythings not quite what it seems. Sure, it looks and sounds all gentle and relaxed, but the gameplay itself is anything but. See, while youre off pollinating planets, youre also dodging enemy seeds that can either destroy your seedlings in midair or head to your home planet and take it over completely. In other words, that gentle, ambient faade is really just a front for a fairly intense Real-Time Strategy game  and a pretty good one at that.Whats really impressive is that Eufloria HD achieves this tension without straying very far from its artsy base. All it takes is a couple of dissonant notes here and a few red pulses there, and suddenly those dark specks flying across the screen take on a significantly more menacing tone. It probably wont make your heart pound or get your palms all sweaty or anything, but it will make you feel uneasy, and thats nothing to sneeze at  certainly, there are games that try a lot harder to evoke an emotional response, and most of them dont succeed half as well.Of course, Id wager that most of those games probably control slightly better than Eufloria HD. This is actually kind of odd, since the games core mechanic is incredibly easy to pick up: you select other planets, and you send your seedlings over, and its all done via touch. If you want to do more than that, though, things go a little haywire. Case in point: the game tells you how to change the number of seedlings you send, but when you actually try to do that, its hit-and-miss whether it actually works. Likewise, the game offers different types of seedlings, but it doesnt really tell you how to regenerate them, and its on you to figure out what each of the different types do. This isnt a game-breaking flaw or anything  the basic gameplay is so simple and straightforward, its hard to really screw things up  but it does detract from the overall experience.", "date": "February 3, 2014", "grade": "B"}