{"name": "Tomb Raider: Definitive Edition", "ref": "https://gaming-age.com/2014/01/tomb-raider-definitive-edition-review-ps4-xbox-one/", "text": "Its not surprising to see titles from PS3 and Xbox 360 ported over to their respective successors, but it is surprising when the developer puts a bit more effort into the port. Tomb Raider: Definitive Edition does just that, sprucing up the visuals in a number of noticeable ways, and making marked improvements to the framerate as well. The version played here was on PS4, which sees an unlocked framerate that averages in the 50 FPS range, but from my understanding even the Xbox One version of the game stays at a near rock-solid 30, which is certainly more than the original game could claim.I originally reviewed the Tomb Raider reboot on Xbox 360, and you can check out that full review here for more detailed thoughts on the core game. Essentially I had fun with it, but found it to be a bit derivative of other popular titles, cribbing mechanics like upgrades and map progression from various places. My most negative opinions stemmed from the multiplayer modes, which still holds true here. If youre planning on giving Tomb Raider: Definitive Edition a look, definitely do so with just the campaign in mind, as the multiplayer portion of the game is still a notch or two below fun.As far as the Definitive Edition subtitle claimed by this version of Tomb Raider, Id say thats a pretty accurate way of describing the game on PS4. Granted, the PC version of the game looks pretty great on moderate to high-end systems, but the work done to improve the Lara Croft model in-game is hard to ignore. The addition of a version of TressFX, which adds some very realistic detail in regards to Laras hair, is instantly noticeable. Laras improved character model stands out even more when compared to the rest of the cast, most noticeably in every cutscene starring Lara and someone else. The only real hard pill to swallow comes from the price, which might be worth it to those that havent played the game yet, but certainly warrants a pause for those that have.However, the improvements dont stop with Lara Croft. Youll see a lot of added detail in the environment, including trees and other foliage swaying and moving about, actually affected by weather and climbing. Texture work is certainly better, and I had trouble locating anything that looked particularly low-res or muddy. On PS4 youll have added map control with the touchpad on the controller, and on both Xbox One and PS4, voice commands have been added with varying degrees of success.", "date": "January 31, 2014", "grade": "B+"}