{"name": "Assassins Creed Liberation HD", "ref": "https://gaming-age.com/2014/01/assassins-creed-liberation-hd-review-ps3-xbox-360/", "text": "For the most part, I have skipped over the Assassins Creed Series for unknown reasons. It could have been either sheer ignorance or stupidly that I never indulged into Ubisofts masterpiece, but for what its worth after playing Assassins Creed Liberation HD, I consider myself a fan of the series. From the very beginning I was intrigued with the captivating story and the overall feeling that everything around you is alive. Despite some small issues, what we have here is a fantastic and albeit exciting trip into the past.Assassins Creed Liberation began its existence on the PlayStation Vita system. Previous portable incarnations of the series (mostly for Nintendo handhelds) sort of fell flat and never captured the feel of what the console versions offered. Enter the mighty PS Vita with its superior power and control and the first true portable AC game is born, and developed a fantastic following. There were some minor glitches and flaws when it was first released, but in the end it was considered one of the best PS Vita games available. Now, Liberation has made its way to consoles and received a rather nice upgrade. This is definitely not a simple HD filtering, as almost everything has been given quite a face lift.The game is set between 1765 and 1777, and primarily features the series first female protagonist, Aveline de Grandpr, an African-French Assassin around the end of the French and Indian War, in 18th century New Orleans. You take control of Aveline and guide her as she completes missions for the assassins brotherhood and right the wrongs of many dastardly people standing in the way of freedom. You help slaves escape their horrible masters, and track down (and sometimes assassinate) key figures as you progress through the story. If you havent played it, I dont want to spoil what is in store for you, lets just say as you get the answers you seek, you are rewarded with even more questions. The gameplay mechanic is largely unchanged from other AC games, where you can free run on rooftops to escape from or run down bad guys, or climb to the highest viewpoint to get the lay of the land. That is of course you are dressed for free running.Sometimes, you have to complete missions as Aveline in her Lady Dress, and while wearing those, you wont be moving very swiftly. Some Missions have been removed from the original due to them relying heavily on the Vitas touch screen and/or touchpad. In their place you have completely new missions or slightly altered ones that do not break the flow of the story in any way. In some cases the new events add to the overall plot. Occasionally, you may be forced to complete a mission that is, shall we say, a little on the boring side, but these are few and far between. Combat is done well, but doesnt really feel fluid here, like it does in something like the Arkham Asylum games, but it does borrow a bit from that series. Its mostly block at the right time, and counter attack, but sometimes you are left standing surrounded by enemies and no one is making a move. It takes an impromptu attack from you to get the battle going and keep it going in some cases, which can lead to unnecessary damage taken.As I stated before the graphics have been overhauled to great extent. Everything looks like its been redrawn and given more animation when compared to the original Vita version. I spent some time with the original to get the feel of what was changed and let me tell you that a lot has been completely revamped. Some areas dont even look the same with the new transfer, while the animation of even the smallest object is fluid. Thats not to say there arent any minor flaws however. Sometimes, a texture can look muddy and washed out, only to have it pop in clearer as you approach, and very rarely, a character model will take some time to load in. In one instance, I watched as Aveline was talking during a cutscene and she took the form of a faceless nightmare for brief periods. Thankfully it was a rare occurrence and will probably go unnoticed by most players. Even with these minor visual flaws, its still a joy to look at as well as play. Sound wise you have all of the tracks from the original game, but spiced up with new instrumentals. As always the music gets you pumped for a blood pumping battle or a scurry across buildings and trees and never feels out-of-place. If someone yells off in the distance, you will sometimes feel as if the voice actually came from behind you, rather than out of the speakers in front of you.", "date": "January 24, 2014", "grade": "B+"}