{"name": "Terraria", "ref": "https://gaming-age.com/2014/01/terraria-review-ps-vita/", "text": "When Re-Logic were porting Terraria over to the PS Vita, its a shame they didnt watch Sony Bends GDC 2013 presentation. If they had, they might have learned that developers use the Vitas rear touchscreen at their peril  or, to be more specific, they might have realized that enabling the entire rear touchscreen as control method might not have been the best of ideas. I get that they wanted to tailor the game so that it took full advantage of the Vitas bells and whistles, but that doesnt make it any less annoying for players when your on-screen cursor suddenly jumps to the other side of the screen just because something happened to brush against the back of your Vita.Is this design choice game-breaking? Of course not. Its occasionally bothersome (especially because theres no way of turning it off), but it doesnt really harm the game in any substantive way. At the same time, however, its pretty emblematic of Terraria on the Vita as a whole, one of quite a few niggling little issues that prevent the game from being a must-buy.Issues like, say, the graphics. Generally, theyre fine, and the game doesnt look tremendously different here than it does in its other versions. But it still looks ever so slightly off, with a muted color palette that means it doesnt jump off the Vitas screen the way youd expect to it.Or take the hint boxes during the tutorial level. 99% of the time, theyre finebut theres also that 1% of the time, where the hint boxes get stuck on the screen and refuse to go away, even after you do what youre supposed to. Again, its not necessarily a game-breaking bug, since its just the tutorial, and thats short enough that you can just restart it and not miss out on too muchbut, like the other issues, its still annoying enough that it makes the game a tiny little bit less fun.Thats a shame, of course, because, otherwise, Terraria on the Vita has so much going for it. Its essentially the same, full-featured game that console and PC owners have been playing, only with the added bonus of being able to take your terraformed world with you wherever you go, in addition to being able to bring it online. Even for someone like me, who wasnt hugely fond of the game on PS3, that portability is a huge plus. Likewise, complaints about the rear touchscreen aside, the control scheme works a lot better on the Vita than it did on PS3; the smart cursor seems to be much more precise here than it is on the console version, while flipping between items and inventory screens is a breeze thanks to the front touchscreen.", "date": "January 14, 2014", "grade": "B+"}