{"name": "Furmins", "ref": "https://gaming-age.com/2014/01/furmins-review-ps-vita/", "text": "I feel kind of bad for a game like Furmins. Its good but not amazingly great, and in a world where games are either the best thing ever or the worst of all time, theres rarely much room for the solidly above-average. Not only that, its a casual game, which means it exists in an even more crowded marketplace, and without having any amazing hook to hang its hat on, its hard for the game to stand out  and, I have to admit, a little difficult to get incredibly excited about, too.Make no mistake, though: Furmins is a fun game. If youre in the mood for a Lemmings-style puzzle, where you have to lead little furry creatures to an exit, then its perfect. Similarly, it makes good use of the ubiquitous three-star system, by 1) making it plainly obvious what you need to do to earn each store (in other words, none of the occasional randomness that can be annoying about Angry Birds scored star rewards), and 2) letting you use the stars to unlock new levels. The latter, particularly, is useful as a tool for making you go back and perfect each level  which, again, isnt something you can say about every game.As for what specifically you do to earn those starsthat, perhaps, is where things are a little less exciting. The titular Furmins, after all, simply drop, and occasionally roll (assuming theres an incline), and its up to you to get them from point A to point B by using a combination of gravity, momentum and bouncy platforms. Theres some player input, but generally its just up to you to put things in place, set it in motion, and watch what happens. As youd expect, this involves quite a bit of trial and error involved, not to mention a not-insignificant amount of luck. In other words, its awfully similar to loads of other casual puzzle games.And yetits better than most. The Furmins are kind of cute, and the puzzles increase in difficulty at the perfect pace. If theres any problem, its that the Vita version of the game costs twice as much as the iOS one, even though  if the description of the latter is accurate  its literally the same game. I mean, I like trophies as much as anyone, but thats kind of insane.Only a little, though. When Angry Birds can come over to Sonys handheld and charge (at least) a twelve-fold premium, then simply doubling the price arguably counts as reasonable. And besides, there are arguments to be made regarding screwed up traditional pricing structures, not to mention the size of the Vita userbase compared to the iOS one.", "date": "January 9, 2014", "grade": "B"}