{"name": "Bit.Trip PresentsRunner 2: Future Legend of Rhythm Alien", "ref": "https://gaming-age.com/2014/01/bit-trip-presents-runner-2-future-legend-rhythm-alien-review-ps-vita/", "text": "The question to ask about Bit.Trip PresentsRunner 2: Future Legend of Rhythm Alien isnt whether its any good. That, after all, was answered pretty definitively back in March, when the game first came out on PS3/Xbox 360/Wii U. It was an A+ game then, and nine months that verdict still stands.Rather, the question for Runner 2 now that its on the Vita is how well it translates to the smaller screen. Not that the original was some huge, expansive game that needed to be experienced on a big TV or anything, but it was  and still is, for that matter  one of the nicest-looking games of the year, and it had a control scheme that took full advantage of the DualShock 3.For the most part, the move from console to handheld seems to have gone pretty seamlessly. Charles Martinets voiceover narration is, as youd expect, as charming and delightful as ever. Likewise, Runner 2 looks just as gorgeous here as it did on the consoles, with its bright colors popping off the Vitas screen.If theres any flaw in the port, it comes in the controls  or, more accurately, in what youre expected to do with them. Obviously, part of this is embedded in the games design, since Runner 2 was meant to be challenging, but on the Vitas smaller screen, it occasionally feels like everything has been crammed together, giving you even less time to react. Admittedly, some of this undoubtedly comes down to my reaction times sucking, but at the same time, I often felt as if I didnt have enough time to do everything that was expected of me  and, as anyone who played the original game knows, at times Runner 2 expects quite a bit from you. Not only that, because everything is shrunk down, there were times my eyes seemed to gloss over enemies or obstacles in my path (though, again, Ill give my own crappy reaction times some of the blame here).", "date": "January 6, 2014", "grade": "A-"}