{"name": "Halo: Spartan Assault", "ref": "https://gaming-age.com/2013/12/halo-spartan-assault-review-xbox-one/", "text": "The concept of a bite-sized Halo experience that was custom made for touch-screen platforms might not sound that appealing, but Ive actually enjoyed my time spent with Halo: Spartan Assault on Xbox One. Its not quite the caliber of the original Halo spin-off, Halo Wars, but it certainly puts the Halo stamp on the top-down arcade shooter style that Spartan Assault adopts. And if you enjoy high-score focused action with a bit of Halo spin on it, then Spartan Assault might be the thing for you.Spartan Assault is broken up into two modes, a single-player campaign that consists of six operations divided into smaller stages, and a new co-op campaign which is essentially a survival mode featuring the Flood. Co-op is an online mode for two players, and is new for this edition of the game. Co-op is fun, but I found myself wanting more than the handful of stages that are offered up here. Theres a sizeable challenge in the scant few levels present, but Id love to see more added to the game in future updates.It falls to the campaign to make up the meat of Halo: Spartan Assaults gameplay. Here youll take on the role of Spartan Palmer and Davis embroiled in a battle against the Covenant between the timeline of Halo 3 and Halo 4. The story bits are told through short cutscenes that close out each level within an Operation, with more bits told through short text introductions for each level. The lore aspect doesnt seem to step on any toes in other parts of the Halo universe, and whats there is written well and seems to fit the general tone of the series.The actual gameplay feels reminiscent of many top-down shooters, but this isnt a simple run and gun style game. Halo: Spartan Assault features a number of traditional Halo mechanics, like rechargeable abilities, regenerative standard shields and health, plasma grenades, and a whole host of familiar weapons. Youll also run into your standard assortment of Covenant bad guys, and even get to jump on board the occasional vehicle for some destructive mayhem.Halo: Spartan Assault is at its best when youre surrounded on all sides by Grunts, Elites and Jackals, stuck between a rock and hard place with ammo dwindling down. This is where the Halo aspect really starts to shine. Youll need to make ample use of distance and terrain in order to have room to recharge and resupply, and as you get into the late stages of the campaign youll need to make use of every found weapon available in order to clear most stages. 343 Industries has done a pretty solid job of marrying Halo to a pint-sized arcade style shooter, giving off just enough of a Halo vibe to make Spartan Assault stand out as something unique.My biggest complaint stems from the controls, specifically the right analog stick that controls aiming. At close range being able to effectively hit a target wasnt a problem; however trying to hit anything at range was usually a waste of ammo. Theres no onscreen indicator to assist your aim, and sometimes the direction youre pointing the analog stick in doesnt seem to line up with whatever youre trying to hit. Generally this isnt a huge issue, but it can be frustrating to waste precious ammo on a missed round of fire that you were sure was on point.Also, out of all the digital releases seen on Xbox One so far, this is the least impressive from a graphical stand point. Its clear this wasnt made from the ground up for the platform, and it doesnt seem to be aided in any significant way by the hardware. The image is crisp in HD, but theres little going on here thats meant to be a visual showcase.And of course Im not a big fan of the use of micro transactions that lock away specific weapons like the Sniper Rifle, Spartan Laser and Rocket Launcher. You can purchase credits using real money to use these weapons within a single stage, or you can use experience earned instead. But at 1000 experience points a pop youll rarely have the means to do so. Clearing the entire campaign with no skulls activated (the use of which can increase XP gains) netted me right around 4000 experience points. That means by the end of the game Ive only gained four uses of a heavy weapon, which seems pretty low.", "date": "December 27, 2013", "grade": "B"}