{"name": "Max: The Curse of Brotherhood", "ref": "https://gaming-age.com/2013/12/max-curse-brotherhood-review-xbox-one/", "text": "As an Xbox One owner hungry for new games to play on the console, I was interested in checking out Max: The Curse of Brotherhood simply because it was new. Quite frankly, I wasnt expecting a whole lot out of this one. The reveal trailer really didnt grab me, and I wasnt familiar with Max and the Magic Marker previously developed by Press Play. But I was certainly surprised with how fun and inventive this unique platformer ended up being.You take on the role of the titular Max, a young boy frustrated by his younger brother, to the point that he accidentally has him whisked away through a portal to a magical, corrupt realm. Instantly realizing his mistake, Max chases after him, but arrives too late to prevent his younger brother from being kidnapped by the evil Mustacho. Stuck in a strange world with strange creatures, Max gets a little help through the power of a marked infused with magical abilities, as he sets off to free his brother and release the corrupt hold that Mustacho has on the land.The magical marker becomes the crux of Max: The Curse of Brotherhoods unique gameplay. Theres some cues taken from the pages of games like Trine, making use of environmental puzzles to propel Max across large gaps and other hazards in conjunction with the marker. As you advance through the stages, the marker will gain new abilities, allowing it to draw vines, branches, and construct earthen pillars. Eventually youll be able to draw in spouts of water, and even shoot fireballs from designated spots as an offensive and puzzle-solving ability.Max is generally defenseless without the marker, but this isnt a platformer filled with enemies. When you are presented with adversaries, youre generally given the tools to either entrap or defeat those foes. Sometimes youll simply need to flick a switch to drop a trap door, other times youll need more inventive strategies that use a combination of the above listed abilities. For the most part the challenge here comes from keeping Max out of harms way, and considering just about everything can kill him in one hit, it can become a sizeable challenge throughout the 7 stages that make up the game.Most levels are simply focused on getting Max from one end of the level to the other. Theres a handful of head-scratching moments scattered about, forcing you to use multiple abilities at once. Max: The Curse of Brotherhood really excels in later stages at conjoining abilities, forcing mechanics to work together so you can solve puzzles in interesting ways. You can combine a drawn vine with a drawn branch, and then sever the vine from its starting point in order to drop the vine lower since the other end is connected to the branch. You can likewise cut down a branch so that it slides into a stream of water, allowing it to hit a switch that would otherwise be out of reach.There are moments of frustration that creep in, mostly when it comes to controlling the marker ability in moments of immediate danger. There are different points in the game where Max is being chased, either by a larger monster or some other hazard. These chases lead to a series of frantic moments that force you to quickly draw vines, blast away obstacles, or create jets of water in order to propel Max to safety. Often times youll be graced with a slowed time effect that eliminates the unwanted frustration from these bits of action. But when youre not granted that boon, youll quickly realize that this is a game that would greatly benefit from some sort of input more precise than a standard analog stick.Max: The Curse of Brotherhood also features an annoyingly cheap and poorly designed final boss that puts an unfortunate stamp on the final moments of the game. It adopts that traditional larger than life final boss design seen in many games, and tries to marry all the powers Max has accumulated up to this point in order to defeat him. But the execution feels sloppy, leading to cheap death after cheap death. Id even respawn into an instant death when reverting back to the last checkpoint, without the opportunity to prevent it. Youll eventually get past it, as the checkpoint system is pretty lenient, but that last fight really makes the game end on a sour note.", "date": "December 23, 2013", "grade": "B"}