{"name": "Zoo Tycoon", "ref": "https://gaming-age.com/2013/12/zoo-tycoon-review-xbox-one/", "text": "It has been nearly a decade since a Zoo Tycoon game has been released, and even in its heyday, and very few had ever graced a console.  Granted, in those days, due to hardware limitations and the restrictions of using a controller rather than mouse and keyboard,  developers didnt want take many chances on releasing a game like this into the wilds of the console gamers.  Then all of a sudden the first person shooter era began and the big sellers that were once point and click adventures, platform gaming, and tycoon titles seemed to just disappear.  It seemed as if the gaming public had become content with run and gun violent games and that the creativity of the developer had all but gone away. Never let it be said that a good idea will never make a return if it fades away, and thanks to games like Minecraft, the itch to build and create seems to be making that comeback once again.  This brings us to the first of its kind on a next generation console with Zoo Tycoon only on Xbox One (and current gen has Xbox 360). Not only is the classic  if you think it, you can build it  idea brought back to fruition, but it also provides for nice niche title that is vastly different than any of the launch titles on either system. Zoo Tycoon provides gamers with the tools, resources, and of course animals to either recreate your favorite zoo from your home city, or start from scratch and Ted Mosby it like only some can dream to do.  Thanks to the power of the Xbox One all the components are at your finger tips to create lush and inviting environments for the virtual public to visit and enjoy.  You also have the power to make them just as inviting to the creatures you choose to habitat them.  While there are over 100 animals for you to play with, feed, and even clean up their poop, the selection of exhibits is kind of disappointing, especially if you wanted to perfectly replicate your favorite zoo.  For instance there are no aquatic animals such as seals, sea lions, fish, or even penguins, as this game is tailored much for the safari style animals, so if there is any slight knocks on this game, that would be one that stands out the most.  Who knows, maybe they can release a DLC expansion for those types of animals in the future?  Nevertheless, it is still hard to argue that the amount and variety of animals you will encounter and interact with is still quite impressive to say the least.  Zoo Tycoon offers a nice, in-depth and interactive tutorial mode to get your feet wet for those who have never experienced a game like this or even for those veterans trying to retrain their brain on how the operations work again.  Once you are ready to take on the elements for yourself, there are still helpful guides and menus throughout, but the open game gives you the freedom to build, train, and maintain all at your capacity.  This not only goes for keeping the animals at bay and watching their reactions, routines, and rituals to make sure they are happy, but the even more demanding chore of keeping the wildlife walking around to see the sights can prove to be a bigger beast than even the king of the jungle himself.  Ive come to realize that with all the years of evolution we have been through, we still are a very lazy and dirty species.  So make sure you put plenty of trash bins, restrooms, and food and drink areas or they will go nuts.  The building and maintaining of your zoo is as simple as selecting the exhibit or facility you want and placing it down in an area not occupied.  The building process is simple as the walkways and vegetation are all taken care of for you depending on the choices you made.  So while you may not play god and put every little plant down yourself, the Zoo creator, while simple, is still pretty deep and gives you enough to work with to make a unique creation to satisfy even the most fickle fan.  One of the toughest tasks would be keeping tabs on all the goings on in your zoo from the animals, to the upkeep of areas, to the happiness of your guests can be tiresome to say the least. Thankfully one of the best features you will find is if you have a smart phone or tablet device, the Smart Glass option provides you with access to detailed economic breakdowns, actions of the people and animals, and the impact they make on the decline or growth of your zoo, and a far easier method to make those strategic decisions.  Granted its not like keeping order in your zoo is impossible if you dont have the option for Smart Glass, but as Ferris Bueller would say, If you have the means, I highly recommend picking one up.  Of course building and picking up poo isnt the only things to do, as you actually get to interact with the animals, literally, thanks to the Kinect 2.0.  While I will start off saying the execution isnt perfect, once you get the gestures down necessary for things to happen on screen, the results can be pretty cool, and in some instances pretty creepy.  For example, when playing around with a baby chimp, the instructions of covering my mouth with one hand or raising my arms in the air for him to mimic worked as expected, but once the chimp came up close to me against the glass; it would mimic my facial movement such as winking, blinking, and smiling.  Not all the animals have the same interaction capabilities as you will need to put down toys and play items to keep them happy, but this is to be expected as Im sure playing with a lion would not have as positive of a result if you started making faces at them.  The visuals and audio for Zoo Tycoon arent the graphical showcases that say this is why I paid $500, but it without a doubt is the best looking Tycoon game ever created.  The real visual pleasure comes from the animals, and obviously so, as who goes to the zoo to applaud the architecture anyway?   Thankfully the animals look remarkable, but there will be times if you are not interacting with them, that you will find them moving about in a loop of sequences that repeat after time.  Of course with over 100 animals to gaze upon, I cant imagine you would spend enough time at only one exhibit for this to happen.  I just happen to notice this while cleaning around the house while I left my zoo keeper watching one particular animal exhibit.  The rest of the game runs at a silky smooth frame rate and looks vibrant and clear in impressive 1080p, while remaining easy to move and navigate whether you use blimp view, or virtually walk around the zoo.  The ambient sounds are very life like and listening to your visitors reactions as you walk the through the zoo also help to keep you informed on their happiness.  The animal sounds are of course impressive as even a blind person will be able to recognize the animals just from their sounds.  Even your voice recognition works quite well whether you are navigating or just playing with the animals, it all works quite well.  Lastly, Zoo Tycoon has a multiplayer mode where you can team up with up to four players to play, create, and even maintain each others zoos.  Here you can communicate via in game chat, engage in community wide conversations, and even trade and loan animals between two zoos.  This is just one early example of how Microsoft is initiating the cloud capability and the future looks bright when it comes to this innovation.", "date": "December 18, 2013", "grade": "B+"}