{"name": "Star Wars: The Force Unleashed", "ref": "https://gaming-age.com/2022/05/star-wars-the-force-unleashed-review-for-nintendo-switch/", "text": "Arguably the most interesting thing about Star Wars: The Force Unleashed is how normal it looks on the Switch.Just compare it to ports of games that are just a few years older, like Star Wars: Republic Commando or Stubbs the Zombie: while I loved both games, they still felt extremely dated in all kinds of ways. Likewise, if youre looking at games that came out in the 14 years since The Force Unleashed was first released, their ports feel a little off on the Switch, too  just look at how Assassins Creed III performed.And yet, somehow, Star Wars: The Force Unleashed doesnt suffer from any of the issues that plagued older and newer games. Its not like it looks amazing, but it also doesnt suffer from looking all washed-out like so many other ports seem to. Likewise, while its hardly a demanding game, it also performs much better than youd expect it to. I mean, I wouldnt think that a 14-year-old Wii game would be too challenging for a modern system, but given the track record of a lot of ports, clearly Im expecting too much.Of course, thats not to say that Star Wars: The Force Unleashed doesnt show its age in other ways. You see it most of all in the boss fights: this game came out right between God of War II and III, right when games were really big on throwing in quick time events in dramatic places. Consequently, you get a lot of those here  you hack and slash away at your enemies with your light sabre, reach a spot on their health bar, and then suddenly you have to hit random buttons when prompted to get to the next part of the fight. While I never hated QTEs back then, seeing them again now, a decade after they were at their most popular, definitely feels a little odd.The camera is also a little odd. While you can mostly pan it around and see where youre going, every so often it will snap back into a completely useless angle. It doesnt happen frequently enough to be an issue, but its still often enough that youll notice it.That said, even if Star Wars: The Force Unleashed doesnt feel fresh in terms of gameplay, that doesnt mean its not fun. Whereas most games make you develop your character  you start out weak, and gradually get stronger  here Starkiller (Darth Vaders secret apprentice) starts out with some pretty decent powers, and only refines them the further in you get. Not only does it feel nice to skip over those usual early stages that basically double as tutorials, it also works from a story perspective  like, why wouldnt Darth Vader wait until his apprentice is at least decent at fighting before he sends him off on a revenge mission?Obviously, thats not to say that Star Wars: The Force Unleashed is a must-play, or that its re-release on the Switch is an opportunity to discover or return to one of the all-time greatest games. But its still a fun game that probably gets overlooked since it wasnt one of the highlights of its generation, and if you go in expecting an enjoyable (if slightly dated) game, youll be pretty happy with it.", "date": "May 4, 2022", "grade": "B+"}