{"name": "The Wolverine: Unleashed Extended Edition Blu-ray 3D", "ref": "https://gaming-age.com/2013/12/wolverine-unleashed-extended-edition-blu-ray-3d-review/", "text": "The X-Men film franchise has definitely seen its share of ups and downs, but even X-Men: The Last Stand didnt come off as poorly as the abysmal X-Men Origins: Wolverine from 2009. An awful plot, terrible FX, and a myriad of other problems plagued that film, making it one of the most disappointing superhero films Ive ever seen. Were not talking 1990 Captain America bad, but it was pretty damn close.Thankfully, James Mangolds The Wolverine is a big improvement.Taking cues from the classic Chris Claremont, Frank Miller four part saga that kicked off Wolverines individual comic book series, The Wolverine puts the titular super-hero smack dab in the middle of a corporate conflict in Japan. Set against a modern backdrop, Logan is a man out of his element, attempting to deal with his inner demons and the fallout from the deaths of Jean Grey and Charles Xavier from X3. He gets an offer from an old friend that he essentially cant refuse, and the adventure kicks off from there.While the film certainly borrows a lot of elements from the comic plotline, its not a cut and paste of those events. There are some character changes and moments that stand out as unique, but these changes arent necessarily better. While the film has a solid opening and middle, some concepts and reveals kept for the end fall a little flat. The main villain of this film, meant to be shrouded in mystery throughout, becomes a little too obvious to an attentive audience halfway through. And the reveal of this villain, and his ultimate delivery device to carry out his machinations, is ultimately too silly even by comic book standards.The standout elements for the film come both from the cast and the location. Hugh Jackman fills the role of Wolverine so well that its impossible to imagine anyone else filling his shoes for future installments. To think that we almost got Dougray Scott in this role when the original X-Men was shot is hard to believe, and Jackman brings an undeniable mix of heroic charm and physical intimidation that I doubt few could pull off for the role of Logan.And the rest of the cast brings considerable weight here too, and as the extra content on the Blu-ray reveals, the decision to go for a set of unknown actors of Japanese descent was a smart decision. A few do come off as a little green for the big screen, but the iconic roles presented by the comic are filled out well. The only lackluster performance comes from the role of Viper, which has little to do with the actress and more to do with the unnecessary changes to the character.Likewise, the choice to shoot a large portion of the film on location in Japan was a great decision. Theres more than a couple sequences in the film that benefit greatly by it, to the point that its not difficult to tell the difference between the created sets and the on location spots. Another thing worth noting is the improved FX work, which made more than a few sequences in X-Men Origins laughable, forever mocked in .gif form throughout the internet. Theres still a couple moments here that are spotty, a fight on top of a bullet train springs to mind, but by and large this is a big improvement. I was also surprised to learn that the end fight incorporates a lot more actual props than just straight CGI, which sort of speaks to the strength of the visual work done here.The Wolverine isnt a perfect film, nor is it the best that the super-hero genre has to offer. But Id easily slot it in with X2 and First Class in terms of quality, and the fun post credits teaser certainly has me excited for X-Men: Days of Future Past. My only gripe is that I wish the alternate ending presented on the extras here had made its way into the film; it doesnt add a significant change but introduces an element that has long been lacking from the X-Men films as a whole. Maybe theres hope that Bryan Singer will use it for Days of Future Past, but Im not holding my breath for it.For this review we were given the standard Blu-ray release, but I opted to pick up the 3D Version of the film as well. Mostly because I wanted to get my hands on the extended cut, which is unfortunately only present in the 3D set. I say unfortunately because the 3D version of the movie is largely unnecessary, and I say this as a proponent of 3D film. It doesnt add much to the experience, and few moments in the film shine with the 3D effect on. Its easy to tell that it wasnt really filmed with 3D in mind, so dont expect something akin to Avatar with this one.And truth be told, the extended cut doesnt make this a must have by any means. It adds just enough flavor to the film to make this a better experience than the theatrical cut. The changes arent significant; they mostly add either humor and/or violence, along with a few words the MPAA didnt care for in a PG-13 cut. But the accompanying directors commentary provided by James Mangold is worth a listen, he remains pretty active throughout the film, highlights and explains the cuts featured, and ends up being pretty informative for movie geeks like myself.There are not a lot of significant extras on either the 3D or standard Blu-ray set, most of which involve a group of featurettes under The Path of a Ronin header. These can be watched individually or as a set, and provide the typical behind-the-scenes interviews youd expect to see. There are a couple spots that feature Chris Claremont and Wolverine creator Len Wein, which made some of the interview bits a little more unique. Its nice to see the film has a spot of approval from both men, who have contributed quite a bit to Logan as a character over the past few decades.Rounding out the features is a quick walkthrough of the set of X-Men: Days of Future past with director Bryan Singer. Nothing major is revealed here, we mostly see glimpses of sets pulled from the two timelines featured, with slight teases of whats in store. Unless youre absolutely hungry for more Days of Future Past anything, its not a very revealing or fulfilling segment for fans.The real difference between the 3D and regular editions comes down to the Extended Cut and the 3D itself. And again, the Extended Cut gives you an edgier version of the core film but doesnt transform it drastically. Id suggest it to those that saw the theatrical cut and enjoyed it, and would like to have that enjoyment enhanced. Otherwise, stick to the cheaper standard edition and be content that youre not missing anything significant. One slight annoyance with the 3D version is that the 3D disc is only the theatrical version and not the Extended Cut, which is on its own disc. If youre going to force that version to be bought, why not mesh those two things together?", "date": "December 12, 2013", "grade": "B"}