{"name": "Everybodys Golf VR", "ref": "https://gaming-age.com/2019/05/everybodys-golf-vr-review-for-playstation-vr/", "text": "Back in 2017, Sony released Everybodys Golf for the PlayStation 4. It was another great game in the Hot Shots Golf series and really made playing 18 holes surprisingly fun. Now, a more compact version of that game has landed in Virtual Reality with Everybodys Golf VR. Is it another Hot Shots Hit? Signs point to yes!This is a more scaled down version of Everybodys Golf. There arent any tournaments or online modes, just simple rounds of golf with you and a caddy. The visuals have been stepped up a little so the characters you interact with look a bit more human, but you can tell you are still in the Hot Shots World. It is advised that you play through the tutorial at first, so you can get a feel for what is to come. You can play this game sitting with the DualShock Controller or standing the Move Controller. I suggest trying both modes to see which one fits you. Personally, after trying both, I stuck with standing and using the Move. Playing with the DualShock is fine and works well, but I really dont think that this was the way this game was intended to be played.After you get comfortable with the controls, you can practice at a driving range before heading out or you can dive right in and start playing. I recommend doing a little practice first as it does take a little bit of time to achieve a good swing. Once you are confident, you can head out to the actual course at anytime.You only have 3 different courses to pick from, with only one unlocked from the start. The course you get is limited to a 3 hole game at first, but as you play you will slowly unlock the full courses, new clubs and caddies, along with new outfits for them to wear. I wish there was more of a variety of courses and unlockables like in previous Hot Shots games, as this is somewhat lacking when compared, but what you get will keep you busy for a while. Speaking of caddies, you are given one at the start, Reiko, and she will be super bubbly and talkative. As you play on the courses with her, there will be Events that occur. These events seem to simply act as intermissions and range from just sitting and going over your score, or taking a shortcut over an open valley while trying to balance on a log. You really cannot interact with these little events, and they are there to give you a small break. Plus, you can go back and watch them at anytime once they occur during normal playtime. All of the caddies you can use and unlock have their little quirks and behaviors that can annoy some players, while others wont be bothered. Some of their advice may not be the best, but they really do try. Just stick with the caddie that works for you.Since this is a VR title, the game takes place all around you, but the game tries to do everything to make it comfortable for you with different control options. Players with a small amount of playing room may want to play while sitting down and using the Controller, while players with more space will benefit from standing and using the Move, like I did. Using the controller, you really dont get a sense of depth and it tends to feel awkward. It works very well, but if you have a PlayStation Move Controller you get a more enriched experience. Gripping the club and swinging, even putting all feels like you are really on a golf course.Graphics wise, everything looks great. The character models, courses and driving ranges are rendered really well and give you a sense of actually being there. On the driving ranges they have music playing from the clubhouse speakers that can be heard from different ranges depending on where you are on the range. This is the same with the actual course and their ambient sounds. Sometimes, the sounds can actually startle you, like when the caddie stands behind you while talking or when an airplane buzzes you on the driving range. All of this mixes together perfectly to bring a great VR golf experience.I was really surprised by Everybodys Golf VR, in the most pleasant way possible. Not being a golf fan by any means, I thoroughly enjoyed what Clap Hanz has done here. If you have a VR, I highly recommend this title, even if you dont like the actual sport of golf, you will have fun here. It may be a little skimpy with content, but that shouldnt stop you from checking this one out. This one definitely should not be missed!", "date": "May 21, 2019", "grade": "A"}