{"name": "Ys: Memories of Celceta", "ref": "https://gaming-age.com/2013/12/ys-memories-celceta-review-ps-vita/", "text": "If I were to make a list of my all-time top 10 most played games, I suspect it wouldnt be particularly impressive. Itd be at least 80% sports games, casual games and fitness games. In amongst the baseball and hockey and Wii Fit and various iterations of Mario Kart, however, thered be one oddball entry: Ys Seven. Simply put, I played the crap out of that game. What makes that especially odd is that Im not a particularly big RPG fan, either; I dont usually have the time or patience for crafting objects or managing parties or long, drawn-out adventures. I like games that are short and get to the point, and Ys was not that at all. Yet, for some reason, I couldnt get enough of it.Now the next game in the series, Ys: Memories of Celceta, is here, and I have a sneaking suspicion it has a shot at making that list as well. Admittedly, it may be a little early to make that pronouncement, since at this point Ive only played it half as much as I did its predecessor, but it has all the same qualities that made me fall in love with Ys Seven. Again youre playing as Adol, the mute red-haired explorer, and again youre on an epic quest that requires traversing an enormous map for various reasons. Like that last game, youve got to manage your companions and your inventory and all those things (that, I should emphasize, usually bores the crap out of me).Most importantly, though, like Ys Seven, Ys: Memories of Celceta knows how to keep things moving along as a brisk-pace. Combat is all real-time and button-mashy; you see an enemy, you hit the enemy, and you move on. You can keep pressing X to keep your characters running (and rolling, and jumping) as fast as they can, so theres no moving slowly or methodically. You occasionally slow down for dialogue, but thats about it. Even if theres a bit of grinding going on in the side quests, its not anything particularly onerous  you pick up a lot of stuff just from defeating enemies, and whenever theres an object to be smashed thatll yield additional materials, its always very clearly marked on the map.Which reminds me: Ys map is phenomenal. You never have to wonder where you havent traveled, because its all helpfully laid out, and it tells you exactly how much  by percentage  youve discovered so far. Considering the games first plot point is the Governor General offering a prize to anyone who can map the entire forest, thats incredibly useful.And if were talking useful, Ill throw in another word of praise for the games save system. Basically, you can do it anywhere, anytime, as long as youre not in a cutscene. That, obviously, is a huge godsend.", "date": "December 9, 2013", "grade": "A+"}