{"name": "Rainbow Moon", "ref": "https://gaming-age.com/2013/12/rainbow-moon-review-ps-vita/", "text": "Thats it. I give up. Rainbow Moon, you have defeated me. You have ground me down into the dust, and I officially am declaring you the winner in the contest to break my spirit. I didnt think such a thing was possible, but after playing you for several hours, Im there, and Im done, and I can take no more of you.On the plus side: I now totally see where the term grinding comes from, and I have a new appreciation for how literally it can be taken.Seriously, I thought I knew what grinding was after playing the Atelier games, or playing Disgaea, or after any other number of games where youre expected to do the same thing over and over and over again. None of those games, however, have anything on Rainbow Moon. This is the be-all and end-all of grinding. You get a snazzy intro, then next thing you know youre on an island, and you cant take more than a few steps without being challenged by one monster or another. Though, on reflection, the better way of putting it may be one monster and another, because youll most likely step into a new fight just seconds after the last one ends.And once youre in those fights, its another layer of grinding on top of the grinding. You can have up to three people in your party, and you can be fighting up to twenty enemies in a battle, and since its turn-based combat, you get to watch every single turn and subturn. Oh, and theres no way of speeding things up either, so when I saw you watch every single turn and subturn, I really mean it. As you can imagine, things can take awhile, and the actions (your standard move/attack/defend/item/skill/etc.) arent particularly riveting, so unless you have an affinity for that sort of thing, itll start wearing you down awfully quickly. I mean, if you do have an affinity for it, good on you, because youre clearly a better man than I, but, as I said, it wore me down.The fact I was able to suffer through Rainbow Moon for as long as I did can be attributed entirely to the fact that it looks so darn nice. The opening cutscene is on par with some TV cartoons in terms of production quality, and it was lovely enough that it actually got me excited to play the gameand then the grinding started, and that excitement got worn away. That said, even as I was feeling my will to live slowly drain away, I never failed to be impressed at how gorgeous the characters and the landscape looked. The game may adhere to the usual isometric look, but the developers never used that as an excuse to be lazy in the games look.", "date": "December 4, 2013", "grade": "C-"}