{"name": "Super Motherload", "ref": "https://gaming-age.com/2013/11/super-motherload-review-ps4-ps3/", "text": "Hows this for irony? Super Motherload is a game thats all about digging, yet at the same time, its one of the shallowest experiences youre ever likely to come across. It leaves you with a great first impression, but scratch beneath its beautiful surface and youre left with pretty much nothing.Which is to say: it looks and sounds very nice. The games art style is gorgeous, a neat mixture of Soviet propaganda and Atari 2600 rendered through the power of PlayStation 4. From the intro screen to the character portraits to your little digging machine, everything looks great. On top of that, the sound is phenomenal. It does a great job of building up a spooky, tense atmosphere even when theres not a whole lot going on.Unfortunately, that describes most of the game. See, when you get right down to it, Super Motherload is all about digging. And digging and digging and digging.I mean that literally. For six or seven hours, you just dig  straight down, through soil and rocks, through minerals and lava, through skeletons and pick-ups and everything else. Occasionally, youll pause to refuel, or repair your hull, or sell off all the minerals youve obtained so that you can upgrade your drill bits. These pauses, however, are strictly in the service of allowing you to dig deeper, so that you can get more minerals, so that you can get more money, so that you can upgrade your ship more, so that you can  you guessed it  keep on digging. And digging and digging and digging.Occasionally, youll get dispatches from trapped miners or space colonists or scientists or your onboard computer. Dont be fooled by these: they may seem like the vestiges of a story, but theyre not going to change anything that youre expected to do  which, again, is to just keep digging. And digging and digging and digging.Eventually, you reach a point at which you can no longer dig, and youre expected to get back to the planets surface as quickly as possible, for reasons I wont spoil here. I will say, however, that this is the key part of the Super Motherloads boss fight. As you can tell, Super Motherload is not a particularly exciting game, unless you have a real passion for digging. And digging and digging and digging.Im well aware, of course, that for some people, the prospect of terraforming in games is highly exciting. And among people who love games like Terraria and Minecraft fans, Im sure theres got to be a subset of fans whove always wished that they could just do away with those pesky construction and creation bits and just focused on the digging. And if youre one such person, Super Motherload is here to meet your strange, slightly incomprehensible desires.", "date": "November 27, 2013", "grade": "C"}