{"name": "Knack", "ref": "https://gaming-age.com/2013/11/knack-review-ps4/", "text": "Knack for the PlayStation 4 has gotten a bad rap. Is it a system-selling, AAA launch title overflowing with next-generation eye candy? Not by a long shot. Is it the best family friendly action game on the console? Nope, that would be Skylanders: SWAP Force. Though as an original, day one, PlayStation 4 release that falls outside of the shooter category, it serves its purpose. Pro reviewers seemed to speedrun through the game for the purpose of cranking out a review in time for the consoles launch, and it feels as if they may have missed out on what makes Knack at least a good PS4 game.At first glance, Knack may resemble a platformer of some type, which it definitely is not. What Knack is, is a character-driven 3rd person action game with a heavy focus on combat and relatively simple controls. Dont let the cartoony style and straightforward gameplay fool you, it puts up a decent fight with an unexpectedly challenging and lengthy quest. The game doesnt come close to breaking new ground in any way  as a next-generation launch title or as an action game  but it doesnt fail spectacularly either.Knacks story is pretty standard fare; unlikely hero, ancient relics, only he can save the world, blah blah blah. The games style is uniquely simple and cartoon-like, with bright colors and characters with overly rounded features. The titular Knack, who is only a few feet tall and constructed of relic shards, has Katamari-like properties where he can absorb relics to grow or shrink in size and power, depending on his environment. He may be a clump of ancient artifacts, but he has a personality, a mean streak, and the know-how to beat down goblins, tanks and colossal mechanized suits alike.Knacks controls are simple by design, which certainly isnt a negative if you take into account the audience for the game. Beyond a jump button and punch/attack button, Knack can unleash a trio of super moves by collecting sun crystals, and also dodge/dash by using the right analog stick. Thats not to say the game has no technique, because thats not at all true. The games stages are, at a high level, divided up into rooms with enemies that need to be dealt with on order to move onto the next. Each of the enemies usually requires a certain technique to take down efficiently, from setting them up with a jump attack, to baiting them in order to dodge and counter. Since Knack is fairly fragile at times, theres an element of trial/error and reloading at checkpoints during difficult encounters, since just trying to button mash through them does not work. This also depends on the state of Knack at any given moment. If he has absorbed enough relics and has increased in size (and power), most enemies go down a little easier. If youre stuck with little Knack taking on an area with mixed and/or more capable enemies, then some strategy is required to proceed. The combat definitely has a rhythm to it that is not readily apparent when first playing the game. Once the pacing and gameplay techniques click, even the more challenging enemy skirmishes are satisfying.Knack supports local drop in/out co-op gameplay with the second player taking control of a chrome-colored, more-or-less invincible, helper Knack. This second Knack has the same jump/attack/dodge moves of the original Knack, though with the ability to heal the real Knack instead of a super move. Knack 2.0 cant do much with relics however and his size/power doesnt vary much, but hes useful to have around in almost all circumstances. Having a second player use the PlayStation Vita as a Remote Play device and second player controller simultaneously is a pretty excellent perk if you have both a PS4 and a PS Vita. This functionality is built right into the PS4 and works surprisingly well in a number of games.Speaking of pacing, the intro tutorial and the first few levels in Knack (there are 13 in all, each with 4 sections) are a drawn-out borefest. However, once you get over that hump, the action and the story pick up rather nicely. The plot takes a couple of twists and turns, and the levels, environments and enemies get more interesting. Naturally there are also a couple of unique pattern-based boss fights wedged in there as well. Some of the later levels do stretch out far longer than expected and there are a handful of semi-annoying checkpoint positions, but nothing that approaches frustrating. Knack actually takes a few sittings to get through, even on Normal difficulty, and its nowhere near a pushover even with a co-op partner. Besides the combat and the simplistic platforming elements, there are hidden gadgets to assemble and crystals to track down that can grant Knack optional new abilities. Locating most of these gadget elements and special shards, to unlock a combo booster gadget or a near invincible Diamond Knack for example, requires more than one playthrough. After completing the game its possible to select chapters to help track down missing items or take on challenges and an arena mode to perfect your Knack skills.Visually, Knack checks a couple of next-generation boxes, but just barely. The game is rendered at a native 1080p resolution and is super crisp and vibrant with a nice selection of high quality textures and a few massive environments. The somewhat simplistic art style and inconsistent framerate nearly negates the next-gen-ness so to speak. There are a small handful of wow moments here and there at least, but nothing that seriously shows off the power of the hardware. If you want a PS4 game like that, make sure to check out Killzone: Shadow Fall or Resogun.", "date": "November 25, 2013", "grade": "C+"}