{"name": "CastleStorm", "ref": "https://gaming-age.com/2013/11/castlestorm-review-ps-vita-ps3/", "text": "The underlying idea behind CastleStorm is a good one: take a little bit of Angry Birds and a decent amount of Worms, throw in some tower defense and real-time strategy, and cover it all with a moderately funny story about vikings trying to take down a kingdom. Voila! Youve got yourself a game.Unfortunately, theres a world of difference between having an idea and executing it, and CastleStorm falls firmly in the middle of that gulf.As I see it, the game has three major problems. First and foremost, the controls kind of suck. Regardless of whether youre playing the game on PS3 or Vita, aiming is a massive pain. Even the slightest touch of the left thumbstick can send your projectile trajectory wildly of course, and you constantly run the risk of accidentally nudging it so far that it seems to vanish off the screen for a short time. It gets a little easier the longer you play, but thats because less because you eventually get used to the controls, and more because extended sessions with the game make you hyper-aware of how much pressure youre putting on the thumbstick at all times. Needless to say, that kind of hyper-awareness can grow a little tiresome.The other major problem is that even though CastleStorm borrows liberally from the likes of Angry Birds and Worms, it forgot the best part: the wildly overpowered weapons. One of my favourite things about both of those games is getting a black bird bomb or an airstrike, and blasting my enemys territory to bits. Here, you dont get that. Even if the enemy strongholds look like they were built by the same construction firm that the Angry Birds pigs used, theyre far, far more durable  and thats is not a good thing. Rather than bringing towers down with a well-timed hit or two, here it takes hit after hit after hit to knock a castle down. After awhile  much like the control issue  it grows a little tiresome.The most tiresome thing about CastleStorm, though, is the repetition. Now, considering the games biggest influences, a little of that was unavoidable (I mean, as much as I love Angry Birds, Ill readily admit that it doesnt exactly mix things up very much). Here, however, its significantly worse, with several levels seeing like outright copies of each other. Sure, the bonus objectives may change, but theres only so many ways you can beat back hordes of rampaging vikings and direwolves before it starts to feel like youve done it all before.Even with all my complaints, however, I cant say I wholly disliked CastleStorm. The overarching story has its funny moments, which makes it easy to overlook some of the repetition. On top of that, the game is a lot more tolerable in small doses than it is in long sessions  in other words, while it may not lend itself to playing through the campaign in one or two sittings, its great if you want to hop online for a quick couple of multiplayer matches. And, of course, even if knocking down opposing castles takes far, far too long, I cant deny its awfully satisfying when they finally come crumbling to the ground.", "date": "November 21, 2013", "grade": "B"}