{"name": "Castlevania: Lords of Shadow  Mirror of Fate HD", "ref": "https://gaming-age.com/2013/11/castlevania-lords-shadow-mirror-fate-hd-review-xbox-360-ps3/", "text": "Castlevania: Lords of Shadow  Mirror of Fate HD is the upgraded console version of the Nintendo 3DS game which was released this past spring. Rather than just porting the 3DS version straight over with slicker visuals, the developers decided to revamp (pun intended) some of the game and smooth out issues that plagued the original release. These enhancements bring Mirror of Fate HD closer to feeling like a Konami classic thanks to some smart game changing ideas.Mirror of Fate reveals the story of Gabriels descendants each with their own destiny and shocking fates. Trevor Belmont, a knight of the Brotherhood of Light sets out to avenge the death of his mother at the hands of his own father, who has now returned from years of exile to take up residence in a mysterious castle. What was once Gabriel Belmont now stands a powerful vampire called Dracula. Dracula has declared war upon the Brotherhood and thus the scene is set for a cataclysmic showdown between father and son.Visually Mirror of Fate looks solid as this HD remake does a good job holding its own and managing to be on par with the visuals seen in digital download exclusives. The game supplies a nice blend of 2D game play while tossing in 3D visuals, that while a little rough around the edges, still manages to pull off the look and feel of classic Castlevania titles. The animations of the characters are very smooth with a wide assortment of items and enemies to encounter in this quite large and lush environment. The level design is more traditional to todays gaming standards, meaning you wont find any tricky platforming or hidden turkeys and items behind faux walls. Instead, beyond the visually impressive backdrops, it is a button mashers dream along with game play stylings that resemble the great Simons Quest from the NES. Gone are the annoying QTEs that plagued the 3DS version and not only made that version cumbersome, but took out anything that resembled the retro feeling it initially tried to capture. This is one feature that has become overplayed and in this series just felt unnecessary and was used far too often during your adventure.What still remains are the checkpoints galore which eliminate the fear of not making it to your next save point which really takes much of the urgency away from this adventure. Sure there are some exploring elements to the game thanks in part to your trusty whip that allows you to reach places out of the ordinary such as rappelling down walls or grappling and swinging across from area to area. Along the way you will be enthralled by the wonderful orchestrated score that is one of the few instances in this version that wisps you away to the glory days of the series, even if there are little other similarities you will find along the way.There is a good amount of depth to Castlevania: Lords of Shadow  Mirror of Fate as you will be earning experience, finding items, leveling up, and learning new abilities to help you fight the good fight against the forces of evil. Now you have the chance to level up and feel like a bad ass, and unlike the 3DS version you get to actually play out the boss battles in their entirety rather than watching flashy cut scenes and suffering through QTEs that really took the challenge and fun out of the game.When the mist clears and the evil has been slain, this installment of Castlevania tells a decent story, wraps up the Lords of Shadow storyline (not to mention sets up the upcoming sequel), and plays like a pretty decent action game. With that said, Castlevania: Lords of Shadow  Mirror of Fate HD finally plays like a Castlevania game I grew up playing. Gone is the emphasis of trying to blend the current LOS style game play and classic Castlevania game play that just never worked in the end and felt like a mess on the 3DS. Now you have a Castlevania game that happily lives up to its predecessors instead of being another version of the series that time forgot.", "date": "November 14, 2013", "grade": "B+"}