{"name": "LEGO Marvel Super Heroes", "ref": "https://gaming-age.com/2013/11/lego-marvel-super-heroes-review-xbox-360-ps3/", "text": "Ever since their first incarnation with the Star Wars license, The Lego video games have been about fun, humor and all around great gameplay. From Indiana Jones, to Lord of the Rings, TT Games always seems to top themselves with each sequel and new franchise they bring to the Lego world. Now, they have made the jump from DC to Marvel and have created the fantastic Lego Marvel Super Heroes, and it may be the best Lego video game yet!The best thing about the Lego games is that with each incarnation, the core gameplay remains unchanged. TT Games stands by the old saying If it aint broke, dont fix it and this continues to work in this newest installment. You control a large collection of Marvel Characters like Iron Man, Captain America, Wolverine and even The Hulk as you progress through a fantastically written and humorous story. The further you go; more Heroes (and even villains) unlock and become available for you to use and master. Once you begin you will find it hard to put down as you really want to see what happens next, or what character you get to use for the next part. In the Story Mode, it seems Galactius is extremely hungry and its up to the Silver Surfer to get him more food, in the form of planets. Surfer arrives on Earth only to be met by Iron Man and S.H.I.E.L.D. and through humorous events, gets his surfboard shattered and separated into Cosmic Bricks. Its now up to The Super Heroes to recover all of the Cosmic Bricks before Dr. Doom and his army of Marvel Super Villains find them. Throughout the entire story, you will meet up with many heroes you can team up with, and switch control of each one on the fly as different situations require certain skills.Some of the puzzles you are presented with can be somewhat confusing at first, since the game only gives you subtle hints as to what to do next. Sometimes you will find yourself in a room with no idea how to progress, with the only hint being Characters with Supernatural Powers can access this area. At first it is frustrating (especially if you miss the hint when it is presented), but after a short while you get the hang of it and you actually kick yourself for not knowing the solution beforehand. The battles with the various Super villains you encounter require you to use all of your team members to defeat them. Its tricky at first, but it doesnt take long to get used to switching team members and combining their powers. The entire story will keep you hooked with its great action, and hilarious scenes that bring some big belly laughs. After you complete the story, you can replay any scene youve completed, or you can explore an entire open world New York City. Later on, on the S.H.I.E.L.D. heli-carrier, you can actually create your own Marvel Hero using parts from other characters. With over 100 characters to pick from, the possibilities are practically endless.Controlling your character can be tricky at first, especially with flying characters, but a little practice and you can control any character with ease. Sometimes when fighting a group of henchmen, you can take some cheap hits from the entire group of baddies surrounding whatever character you are in control of. The other characters that the A.I. control, are somewhat useless in fights, only jumping in occasionally while you are being pummeled. Since you dont have a number of lives to worry about, you wont care very much about losing a fight with a henchman, and since one or two hits completely obliterates an enemy, nothing gets too tedious. Sometimes, but not very often, you can miss a jump or had a difficult time lining up with a platform because of the position of the games camera, but these instances are few and far between and only take a few attempts to get past.The graphics are fantastic, with even the smallest of details given great care. Environments are presented in such high quality that sometimes you almost forget you are basically playing with digital Lego. Animation is fluid and gives you the sensation of being in a living world completely made of Lego bricks. This is especially evident in the Open World New York City map, where everything, down to the fire hydrants, looks fantastic. Even with thousands of bricks, and tons of animated characters on the screen, the visuals dont stutter even a little, and everything has great flow. Music is very fitting for each level and cutscene, but some of the voices sort of sound out of place for some characters. The only two voice overs that stand out as great are Clark Gregg voicing his Agent Coulsen character, and Steve Blum voicing Wolverine. All others sound just plain wrong (Black Widow, Hawkeye) to downright silly (Hulk, Captain America).", "date": "November 12, 2013", "grade": "A"}