{"name": "Batman: Arkham Origins Blackgate", "ref": "https://gaming-age.com/2013/11/batman-arkham-origins-blackgate-review-ps-vita-3ds/", "text": "The thought of making a Metroid style Batman title using the art design of the Arkham series sounds like such a great idea, that I wonder why its taken this long to happen. But the actual result leaves me wanting something better than Batman: Arkham Origins Blackgate. Theres some merit to this challenging action-adventure title out of Armature Studios, but not enough to get past the frustrating sense of design stemming from the often confusing world presented here.The setting and background story is handled well, even if the visuals and scale are dialed back from the home console Arkham games. This is a direct sequel to Arkham Origins, but honestly you could dive right into this without having played Origins and clearly understand whats going on. The concept here is that Blackgate Prison, the predecessor to Arkham Asylum, is under-siege by the inmates, including the likes of Black Mask, Joker, Penguin, Solomon Grundy and a whole bunch of no-named thugs. Batman, teaming with Catwoman, is tasked with restoring order and re-capturing the reoccurring characters pulled from his popular gallery of rogues.The Metroid style of game design is prevalent throughout. Youll start off with virtually no gadgets as you enter Blackgate, but will eventually gain access to explosive glue, electrical Batarangs, grappling hooks, and other familiar tools. Youre also tasked with hunting down sequence codes for Batmans Cryptoanalyzer, which end up being the red, blue and green doors of the Batman universe.On the plus side, the way you tackle a lot of the content here is pretty much up to you. Youll have a main objective to hunt down, but theres some leeway given to what order you tackle bosses in. Youll most likely stumble into some of these scenarios, but that open-endedness also ends up being a great way to get lost, which youll often be.My biggest frustration with Batman: Arkham Origins Blackgate isnt from the parts where I get stuck, but its the poor tools given to help me get unstuck. The map, accessible via the select button on the Vita, is one of the worst 3D maps Ive ever seen. Its devoid of detail, and doesnt compensate for the verticality of the different areas at all. Its nearly impossible to tell if youre heading up or down, which wouldnt be too frustrating if it wasnt for the ridiculous amount of backtracking the game requires.I also thought the different security levels for access codes were poor excuses for blocking access to areas. A better attempt at emulating Metroid, which is present here to some degree, is to use actual inventory items to unlock new modes of access. You get that with things like the grappling hook, and those inventory items feel more organic in this style of game. Key codes that allow you to play a boring number matching mini-game to unlock a door or two are not particularly fun.Also, while I understand the need to keep this game within the same universe and style of the home console Arkham titles, I dont think the combat system translates well to a 2D space. Your regular thugs are super easy to beat, and countering is rarely necessary because youll only face off of against foes in front or behind you. Thankfully combat isnt really a big deal here, and the boss fights are actually inventive and go beyond just punching familiar villains in the face over and over again.Batman: Arkham Origins Blackgate also suffers from an over-reliance on the Detective Vision gimmick found in the other Arkham games. It feels almost necessary to keep it on at all times, as certain objects, like grates or busted floors you can demolish, wont become interactive until youve scanned them. This again makes world navigation needlessly frustrating, unless youre willing to keep Detective Vision on at all times, and constantly run your finger across the screen in every area looking for something new to highlight and scan.", "date": "November 7, 2013", "grade": "C-"}