{"name": "Assassins Creed IV: Black Flag", "ref": "https://gaming-age.com/2013/11/assassins-creed-iv-black-flag-review-ps3-xbox-360-wii-u/", "text": "I have no problem calling Assassins Creed IV: Black Flag a far better game than its predecessor. Thats coming from all angles here, the gameplay, story, and characters are certainly more fun and appealing than Connors humdrum romp through Americas fledgling years. Im still of the mind that the series could use a bit of a break at this point, I dont think yearly releases are doing Assassins Creed a world of a good. But its nice to see the developers over at Ubisoft repair some of the damage done to the brand from Assassins Creed III.As youre likely aware, AC IV ditches the American backdrop of III and backtracks in time, to an era where pirates roamed the Seven Seas, and battled it out against England and Spain, who were increasingly aggressive towards the free-spirited likes of Blackbeard, Jack Rackham, and Mary Read. These historical figures, along with a handful of others, weave in and out of the narrative featured in Black Flag, but the focus is on series newcomer Edward Kenway. Whereas Connor was a stoic warrior out for revenge, Kenways initial motivations are a little less noble.But thats also what makes the character far more appealing than the straight-laced Connor. Edward Kenway isnt always a likeable person, he has a problem with drink, he often thinks before he leaps, and he has an unhealthy preoccupation with fame and fortune. He plays the role of rogue very well in Black Flag, and his moral complications make him an entertaining character to sit behind throughout this adventure. I also enjoyed the fact that he isnt initially tied up with either the Templar or Assassin factions, owing no real allegiance to either side in the ongoing series conflict, but of course that changes as you near the end game.Another area that Black Flag excels at is ship-to-ship combat and sea-faring exploration in general. Both are elements that were introduced in Assassins Creed III, and ended up being the biggest and best addition to the series there. The concept is further expanded on in AC IV quite a bit, with a good portion of the game taking place on sea, with smaller island locales making up your on-foot segments. The map here is pretty large, and it can take some time to cover the entirety of it. But there are a lot of allowances here to make exploration easy, with quick travel points aplenty and variable speed settings for Kenways ship.Theres also a host of ships to fight against when traveling, and the combat here is fun and easy enough to grasp while still retaining a surprising level of immersion. That immersion is aided in the quiet moments by a close-up view behind the wheel of your ship, complete with sea shanties sung by crew members moving about deck. You can cycle between these songs in a similar fashion to changing radio stations in a Grand Theft Auto game, and can collect a large number of these songs as one of many collectible items scattered about the world.There are still a lot of recycled ideas and elements here too, which arent particularly noteworthy but are still executed well. Environment traversal feels nearly identical to what we saw in Assassins Creed III, complete with your standard building to building jumping and climbing, plus a lot of open land tree stump hopping, cliff-side shimmying that punctuated a good chunk of Assassins Creed IIIs wilderness sections.Likewise combat feels pretty similar again, complete with various counter attacks that become key to survival. Enemies feel a little more aggressive here than before, upping the challenge a bit. But provided you can hit the counter button within the generous window provided, youll have little trouble in one on one encounters, and even most group fights.But there are also some returning elements that continue to be a sore spot for the series. The biggest offender comes from the tailing and eavesdrop missions, which Black Flag seems to rely on heavily. Youll play a number of these scenarios, tasked with following a couple individuals or a small group deep into enemy territory, dashing between high foliage in order to remain unseen, or sticking to the rooftops. Failure can sometimes mean a lengthy restart, and can be absolutely frustrating when trying to contend with the eavesdropping portions of these missions. If theres any one mission Id like to see expunged from the series, it has to be this.Also, while I appreciate the necessary change for the out of the Animus sequences of Assassins Creed IV, the moments not spent looking over the shoulders of Captain Kenway are remarkably dull. The story here is that youre a random employee of Abstergo, the modern day Templar group, and youre a pawn of sorts in their entertainment division. Essentially youre mapping out the history of Kenways exploits in order to sell this experience to the public, but of course theres a little more going on behind the scenes. But this is all told through a first person perspective with absolutely no action, the most youll see out of this mode is a series of hacking mini-games that honestly arent that great. And the information provided here feels like more a tease, with glimpses of other eras that could potentially be explored in later games. I found that these sequences, which youre forced to engage in every few chapters, bog down the otherwise brisk pace of the plot.One other element worth mentioning here is the Aveline add-on content found in the PS3 version, which is the version of the game we were given for review. The 60 minutes of additional content advertised is mostly spot-on, depending on your play style it may take a bit less to clear it. But while its a fun enough, briskly paced one-off adventure for the Liberation heroine, it doesnt really add anything meaningful. Maybe theres some overarching plot element thatll show up in a later game stemming from this, but theres not enough meat to this singular adventure to propel the PS3 version of the game above any other.Finally, the excellent multiplayer the series debuted some titles ago returns here, and remains one of my favorite competitive multiplayer experiences from this generation of gaming. Ill freely admit that it might be a bit long in the tooth for series fans at this point; Im hard pressed to see considerable differences between whats been offered here compared to the previous game. But the whole cat and mouse mechanic that drives the versus mode featured is still a lot of fun. But again, its one of those elements that would benefit from a little more development time to freshen up the experience.", "date": "November 1, 2013", "grade": "B+"}