{"name": "Phoenix Wright: Ace Attorney  Dual Destinies", "ref": "https://gaming-age.com/2013/10/phoenix-wright-ace-attorney-dual-destinies-review-3ds/", "text": "So its been a few years since weve seen a new entry in the popular Ace Attorney series from Capcom. For me that three year break has done the series a world of good. While the sequels to the original have generally been great, I found myself getting a little burned out on the Ace Attorney formula. But having now played through the excellent Phoenix Wright: Ace Attorney  Dual Destinies, Im really glad to see the series return in excellent form on the 3DS.Dual Destinies picks up about a year after the events of the fourth game, which focused on new attorney Apollo Justice. And while this game drops Apollos name to reestablish Phoenix Wright, theres certainly a lot of Apollo featured here. So much so that Id argue you could call this Apollo Justice 2 if you wanted, but Phoenix definitely has his moments in the various cases featured. A new lawyer is also introduced in the form of Athena Cykes. Athena is a plucky teenager hand-picked by Phoenix to join his firm, and brings with her one of a few gameplay enhancements new for this installment.Athenas primary ability stems from a device worn around her neck that allows her to read into emotions evoked during testimonies or interviews. In order to root out the truth in a statement, she can analyze testimony via the Mood Matrix, which breaks down into four primary emotions such as anger, sadness, happiness, and shock or awe. During a testimony, when prompted, players will see the various moods of the character delivering the statement, and can pinpoint unexpected emotions or shifts in emotion in order to press on a particular statement. Its another solid tool added to the repertoire featured in previous games, with returning functions like Apollos ability to pick up on nervous ticks to figure out when someone is being dishonest.Other major changes in Dual Destinies come from the use of 3D environments and character models. While the series has primarily been in 2D, with fantastic sprite based characters, the 3DS shifts the series into the modern era but in a way that retains all the charm and hilariously timed objections and animations that the series is known for. The 3D environments that pop up during the investigative portions of the game allow for more area to be searched, giving you something that feels more akin to an actual crime scene investigation instead of a flat, hidden object mini-game to tap away at.But if youre afraid that Dual Destinies is too far removed from the Ace Attorney series you know and love, youll have little to fear here. Its a great return for Phoenix Wright and company, filled with smart dialogue, elaborate scenarios, and genuinely funny writing. Outside of the occasional typo here and there, the translation work done in Dual Destinies seems to be top notch. The limited animated cutscenes are rendered well enough, but the visuals really shine in the character animations and reactions to surprise statements or reveals. Also, the constant one-upping that goes on in the courtroom between the defense and prosecution is left intact.Other small additions have been added to make the game a little less stressful, like the court record that allows you to sift through previous bits of dialogue in case you missed something. You can also check to see if there are items that need to be presented to advance the story or a particular person youre meant to question, making it less likely that youll get stuck at any point in comparison to past games. There are still some tricky scenarios that are tough to figure out while in court, but Dual Destinies never gets to the point that it feels obtuse or confusing.", "date": "October 29, 2013", "grade": "A"}