{"name": "Shadow Warrior", "ref": "https://gaming-age.com/2013/10/shadow-warrior-pc/", "text": "After reviewing Rise of the Triad a few weeks ago  a game that, for better or worse, was excruciatingly *true* to the original  I was actually a little nervous about how the re-envisioning of the beloved cult hit, Shadow Warrior, would translate across the decade and half since its initial release. The good news, it translates really (I mean, REALLY) well.The thing about Shadow Warrior was that the original was overshadowed by the pioneers of the genre. After Duke 3D it seemed 3D Realms could do no wrong, but the game used older tech (2D sprites, voxels?, etc.) as the industry was very quickly moving towards 3D with Quake and then Half-Life (which basically annihilated everything and redefined gaming). In other words, it kind of fell between the cracks, even though it was arguably better than Duke.This new version is the same, but better. Its aged like a fine wine for those of us that like its lowbrow and slightly controversial sense of humour. Fortunately, while they still mix and match Chinese and Japanese customs/traditions liberally, they ditched most of the overt racial stereotypes wait maybe not, but the it is toned down compared to the original.You play Lo Wang (I mentioned lowbrow, right?), a grunt working for Zilla Enterprises, a conglomerate that has its hands in everything. Your first assignment is to purchase an ancient katana of immense power for your boss. However, when things go wrong and youre left for dead, a banished spirit named Hoji decides to aid you in a quest to set things right and avenge your double-crossers. The sword actually allows Lo to combat demons from the shadow realm, who are building up strength in order to take over the world (or some such evil). Its not exactly a remake, but rather the story of a younger Wang on his journey to becoming the true shadow warrior a reboot of the franchise, per se.The point is, youre a warrior with an ancient, magical katana, a wide assortment of projectile and explosive-based weapons that can all be upgraded, and a vast army of minions to slice, shoot, and La verite, cest quand les jeux etaient vraiment truque, alors beaucoup de gens nauront pas gagne les jeux une casino en ligne s bases sur Internet ne sont devenus tres populaires. explode through, all while giving hilarious (give or take) one-liners about how awesome you are. Oh and there are boss battles Did I mention violence? The game relies on over-the-top violence for comedys sake. And it works. The gnarl-kills and sheer amount of gore are only accentuated by Los quibs about kicking ass An excellent combo.Its really satisfying when a throwback FPS that uses decade old game mechanics doesnt get stale across its ~20hour adventure. Thats right, its full-on game and at $40 Id expect nothing less. Even the music kicks ass. Graphically it stumbles a bit; not that it looks fugly, but it certainly doesnt shine like rest of the game does. Thats okay though, since it runs a treat even when there are tons of baddies on screen (which is often) and everything around you is exploding in flames of glory (also often).Like any good shooter of yore, the weapons and their upgrades are what keep you playing during the onset of the adventure. Shadow Warrior definitely as some wacky weapons to choose from  like demon hearts that cause enemies to explode or magic projectile fireballs which you can use while the Katana is equipped. Speaking of which, youll most often revert to your katana as the melee combat, while slightly cumbersome to control, is so gratifyingly gruesome. Decapitations are the norm here, folks splitting heads in half also happens a lot. And just when you think youre running out of steam on the weapons, the story actually picks up. Unlike (from what I remember of) the original, this versions plot actually thickens as you progress. Im not going to spoil anything, but between the myriad of weapons, Los hilarity, the collectables/secret areas, and the simple but effective story, youll actually be pretty motivated to continue playing to the end, which says a lot about the games entertainment value.Because of how well Shadow Warrior turned out, Im actually excited for the next installment (assuming there is one.) The beauty of a game like this is that Flying Wild Hog (developer) and Devolver Digital (publisher) neednt rely on expensive development to keep the franchise going. They just need to come up with new/fresh experiences for Lo Wang to traverse through, and then let the character do the leg work. Its not a game that requires the glitz and glamour (and presumably budget) of AAA titles; its entertaining out of the box I really should give Hard Reset a try, too (although I heard that story is a little bunk).", "date": "October 9, 2013", "grade": "B"}