{"name": "Rain", "ref": "https://gaming-age.com/2013/10/rain-review-psn/", "text": "Its going to be hard to not constantly compare Rain, the latest PSN release out of Sonys PlayStation C.A.M.P. studio, to beloved PS2 classic Ico. Both titles share a number of similarities, like a young male protagonist, ethereal creatures that pose a constant danger, and a mysterious young girl that accompanies you throughout the majority of the game.But the comparison isnt entirely apt. Whereas Ico was content to let players explore the prison ruins that made up its world with a certain level of freedom, Rain takes a more structured chapter by chapter approach. Rain is also more focused on telling a story, interjecting bits of text across the background and foreground as you advance through a stage. Granted, that story is open to some interpretation, theres still a level of mystery to whats happening within the drenched, abandoned city streets youll be navigating, but this is certainly a more linear experience than something like Ico.And while Im not opposed to linearity, I cant help but feel a little disappointed with Rain. Theres no denying that the game has a lot going for it, the fantastic piano-infused soundtrack is incredible from beginning to end. Mix that with the constant rainfall, bleary streets, and broken architecture of Rains eight chapters and youll find that Rain does a great job of setting a melancholy mood thats unlike anything Ive played all year.The visual design is aided by the unique way the boy and girl characters are presented. At the onset of the game, the boy youll control throughout steps out into the rain drenched streets near his home, following a mysterious figure that seems all but invisible against the downpour. As he does so, he enters an invisible domain, and from there on lacks any defining form, so youre only able to see him when hes either standing or running through the rain, or when hes occasionally covered in mud.The same is true for the various enemies youll encounter, which can only track you when standing in the rain, often requiring the player to duck under roofs or other outcroppings to become completely invisible. To allow the player to keep track of where the boy character exists, youll be able to see faint, wet footprints in dry areas. Navigation either while in the rain or under cover is easy enough to perform, and despite the faint outline presented by an invisible character, I had no trouble guiding the boy throughout.This is an experience that is more focused on seeing the player finish than allowing you any particular freedom to explore. Youre rarely given an opportunity to fail, unless youre not paying a bit of attention to the world around you. The threats featured here, invisible creatures visible only through the pattern outlined by the falling rain, are easy enough to avoid. The light puzzle solving presented will hardly tax your mental abilities, and every object you can interact with is made obvious by way of highlighted outlines. The only real tension is delivered when the monstrous creature dubbed the Unknown appears and gives chase, requiring you to run for safety to some designated point.And while Im not discounting Rain based on game length, its worth mentioning that Rain is remarkably short. Its designed to be played twice, your initial completion will unlock collectible memories scattered in out of the way places that fleshes out the tale of the children featured. Youll likely finish both runs in one or two sessions, with just a scant few hours for each. Thankfully Rain stands out as something memorable due to the intriguing visual design and beautiful soundtrack, so despite the lack of challenge or length it isnt time wasted.", "date": "October 1, 2013", "grade": "B"}