{"name": "Real Boxing", "ref": "https://gaming-age.com/2013/09/real-boxing-review-ps-vita/", "text": "If I didnt know that Real Boxing had gotten its start in the mobile realm, I probably would never have guessed it.This is, of course, both a blessing and a curse for the game. On the plus side, its a statement about how great Real Boxing looks, and how surprisingly deep it is. The former is a testament to the power of the Unreal Engine on the PS Vita; between this, Jacob Jones and Smarts As, I dont know why more developers dont make use of that engine, because the end results are generally excellent. (Heck, even that awful Doctor Who game looked pretty good, and it was a terrible game otherwise.)Likewise, Real Boxing has much more content than youd think from first glance. While the (sadly unlicensed) career mode only has three belts to fight for, it doesnt take long before the difficulty level in them ramps up, and youre forced to figure out the strengths and weaknesses of each opposing boxer. On top of that, the game has online tournaments, which means that even after youve finished up your career, theres still plenty to do  though, admittedly, hoping for a long-lasting online community for a download-only game may be a little foolhardy. Nonetheless, it is there, and, for the time being at least, it adds to the overall package.All that said, however, theres a downside to not coming off as a quick mobile refugee cash-in: it means that a couple of things that you might forgive or ignore on an iOS game seem like a much bigger deal. I mean, repetitive announcers for a $3.99 game? Whatever, its just impressive they included them. Repetitive announcers on a $9.99 game? Huge annoyance after the second or third bout. Similarly, imprecise controls are easy to overlook if youre just flicking your fingers around on a screen; when you have actual buttons at your disposal, by contrast, its much harder to think that the game simply didnt register the odd punch here and there. Sure, punches are effective about 90% of the time, but when you have buttons and youre paying 2.5 times more than you are on your iDevice, thats harder to accept.", "date": "September 30, 2013", "grade": "B"}