{"name": "The Wonderful 101", "ref": "https://gaming-age.com/2013/09/wonderful-101-review-wii-u/", "text": "Wonderful is certainly an apt word to use when talking about Platinum Games newest release. Fantastic, incredible, amazingthose work too. About midway through The Wonderful 101 youll stop trying to come up with appropriate adjectives to describe the experience youre having, and just bask in the fun, all the while wearing a grin that stretches across your face from ear to ear.That about sums up my feelings for The Wonderful 101, and I think itll appropriately describe the reaction most will have when they lay hands on the game tomorrow morning. While Nintendo platforms are generally known for exceling at Nintendo developed titles, its nice to see that third parties can still outclass Nintendo at their own game. And thats exactly what Platinum Games has done here.If this were 1989, The Wonderful 101 would fill the pages of the lastest Nintendo Power. Your friends would cluster around you in the school cafeteria, engrossed in page after page of character artwork, grainy screens, map layouts, and character bios. Youd argue over who gets the three page poster from the middle of the magazine, and once home, would have proudly hung it with a single thumbtack above the top bunk just slightly out of reach from your younger brother, who would surely tear it if he got ahold of it.Every time a commercial for The Wonderful 101 aired, youd block your parents from changing the channel. Youd wake up early Saturday morning to catch the newest episode of the cartoon, and beg to be taken up to Childrens Palace weekly to scour the pegs for new Wonderful 101 action figures. All of these things would certainly happen, and definitely exist, if this game and concept were transported back in time 25 years.While playing The Wonderful 101, I couldnt stop thinking about how much my younger self would love this game, probably more so than I do as an adult. In my somewhat old age, I found myself getting annoyed with the occasional bug, unclear platforming sections, and slightly obtuse directions on how to proceed through a stage. But about midway through I decided to let my inner child take the reins, the version of me thatd put up with pixel-short jumps, endless pits, and limited continues from the original NES. And The Wonderful 101 went from being a great game, to being the best thing Ive played all year.The frustration that stemmed from instances where The Wonderful 101 fell short was eclipsed by the moments where it exceeded my expectations. Hideki Kamiya, the man behind Devil May Cry, Bayonetta and Viewtiful Joe, further cements his Pure Platinum status in regards to action games with The Wonderful 101. The diversity in characters, weapons, moves, and enemies outclasses any other action title Ive played in recent years. Even Bayonetta, a game that I absolutely love, has a tough time competing with what The Wonderful 101 brings to the table.The adventure contained within the single player portion of the game is a constantly escalating, breakneck whirlwind of excitement. Youll be constantly introduced to new members of the titular 101, with a handful of members taking center stage throughout the game. There are equal amounts of humor and drama, with fantastic characterization, breathtaking action sequences, and tons of little nods to the world of video games throughout. Theres even some love for one particular Nintendo franchise that I think fans will find surprising, and Id urge you not to spoil yourself on this prior to going in.Ill avoid my typical review pratfall of describing a list of features and gameplay elements here, in favor of urging you to simply try it for yourself. My only suggestion prior to picking it up is to take the time to really wrap your head around the game, and if you find yourself getting frustrated, just stick with it. At the onset youll feel like youre doing something wrong, as if things havent quite clicked into place, or that maybe youve missed some crucial bit of info in a tutorial screen somewhere.But by the time you hit the final credits, youll feel like an interstellar bad-ass, ready to take on any and all threats to Earth, GEATHJERK or otherwise. The learning curve given by The Wonderful 101 is slow but infinitely rewarding, and youll find that this is the kind of video game that has layers upon layers of hidden mechanics and techniques that youve only scratched the surface of by the time youre ready for New Game +.", "date": "September 14, 2013", "grade": "A+"}