{"name": "Tales of Xillia", "ref": "https://gaming-age.com/2013/09/tales-xillia-review-ps3/", "text": "Being a loyal Tales fan, Xillia was the Tales game I was waiting for this generation ever since it was announced and released in Japan. Tales of Vesperia on 360 was awesome and probably the best in the series since Symphonia. Graces f slipped on the fun scale a little bit, but Xillia was going to redeem the Tales games for me.Tales of Xillia starts off with a choice of one of two different characters: Jude and Milla. Both characters meet up very early in the game and depending on the character players pick, certain cut scenes are shown from the chosen characters perspective if they are ever split up. The battle music between the two is very different as well, with Judes music being your standard battle music with a rock feel to it, whereas Millas has some of the same but a really bad trumpet sample that makes your ears want to bleed. Thankfully, if players equip alternate costumes, which come with the Limited Edition version or can be purchased online, the battle music changes.The game begins with both characters trying to break into a heavily guarded military base for two very different reasons. Millas reason is much more feasible, while Judes reason is really mind numbing. Milla wants to break in to destroy the Lance of Kresnik, a weapon that sucks mana, or life force, of beings into itself and uses it for destruction. On the other side, a professor of Judes was asked to help with a project on the base and leaves to go help. Jude receives a message that the Professor has won an award and wishes to tell him. When he gets to the base the guard tells him that the professor has already left, yet the signature on the guards paperwork doesnt match up with the professors. Instead of Jude thinking there is something going on and he must investigate, he decides that he must tell the professor the good news and so he decides to break in.The battles in Xillia are much like Tales of Graces. As with other Tales games, there are no random encounters. Monsters are visible on the field and when touched, a new screen appears and a battle starts. Battles in all Tales games are in real time and in Xillia, they take place on a 3D battlefield but unless L2 is pressed, characters only move on a 2D plane with the monster targeted. Each character has AC or an assault counter, which is the number that is used to represent how many moves or attacks each character has. When attacking, each attack uses one AC point, even Artes (special moves, magic, etc.), and AC automatically regenerates when characters stop attacking for a very short time. New to the Tales games is linked combat. This is where players can choose another party member to link with and they will assist you, doing things such as flanking, helping when knocked down, and combining artes when cast. Be careful who you choose to link with though, each link does something different. For example, Jude heals characters when they fall over and Alvin guard-crushes enemies who do nothing but guard.The story in Tales of Xillia for the most part is pretty good, and very straight forward. Basically you are trying to prevent the deployment of the Lance of Kresnik to prevent the destruction of the world. Falling in line with other Tales games, the story and characters are partially fleshed out through the use of mini cut scenes that can be activated by pressing a button at the appropriate time. The voice acting in the game isnt exactly top notch but it is workable, and players do start to care what happens to the characters.The game has no overworld, instead somewhat open areas connect towns and dungeons. Eventually players get a world map that allow them to just teleport to places that they have visited. Annoyingly, when the story doesnt want players to leave or teleport to a certain place, it blocks them from using the world map with no warning. Visually the game is nowhere near as good looking as big blockbuster titles like The Last of Us, and a little more detail would have been nice in the cities and the areas between cities. Load times can also be a problem, with the first encounter in an area or after a save has been loaded takes about 2 seconds longer than normal. There are also issues with the game loading the entire environment when players enter a new area. Occasionally characters will just appear out of nowhere because the engine doesnt load all of areas assets right away. This can be slightly annoying and can pull players out of the experience of the game a little bit.Leveling characters up in Tales of Xillia works a lot like the sphere grid in Final Fantasy X. When players level they get GP and GP can be spent on their Lilium Orbs. This is a spider web-like grid with spheres that are activated using these points. In the middle of each rectangle of spheres is another sphere that is activated when all the points around it are activated. Each corner of the grid is represented by a stat, strength, dexterity, intelligence, etc., and as players upgrade each stat, they start to learn skills and artes that coincide with the stats they are upgrading. As players start to fill in their orbs, they expand and give players access to new abilities. In order to expand an orb, players need to unlock three center spheres along the outside edge of the current orb level. For the most part this gives players the freedom to develop their characters as they see fit.", "date": "September 11, 2013", "grade": "B+"}