{"name": "Killzone: Mercenary", "ref": "https://gaming-age.com/2013/09/killzone-mercenary-review-ps-vita/", "text": "Lets be honest, first person shooters and portable systems are usually not, by any stretch of the imagination, a match made in heaven. The PlayStation Vita was supposed to fix that gaping hole thanks to near console levels of processing, a second analog stick and more than enough control options to satisfy most FPS players. The problem is, to this day, all we have to show for the genre on the Vita is the fairly mediocre combination of Resistance: Burning Skies and Call of Duty: Black Ops Declassified. Resistance wasnt a bad first attempt on the hardware, though Call of Duty was a missed opportunity and widely regarded as trash. So was Guerrilla Cambridge finally able to hit the FPS mark on the PS Vita with Killzone: Mercenary? Thankfully, yes.Like those other first person shooter attempts on the PS Vita, Killzone: Mercenary is a spin-off, so like it or not, the game is not intended to supersede Killzone: Shadow Fall for the PS4 in any way. But alongside the excellent Killzone: Liberation for the PSP before it, Mercenary is a spin-off that both makes sense within the Killzone universe and works rather nicely as a portable title.Going into Killzone: Mercenary , since the game essentially revolves around being a for-hire mercenary whos just in it for the money, I expected more of a Unit 13 set up with a limited storyline and a large grid of missions and challenges. Thats not actually what we got here however. Killzone: Mercenary is actually a story-driven game, with dramatic set pieces, voice work, cut-scenes and a 9 contract mission campaign. The plot is a mostly straight-forward affair with players dropped into the boots of Arran Danner, a soldier who is recruited to take on some contract work for both the ISA and the Helghast during the events following Killzone 1. There are some minor twists and turns through the relatively short campaign and its a fun ride while it lasts.The progression through the games campaign may seem linear at first, but the real goal for each of these missions is to earn as much Vektan Dollars as possible. Merely completing a stage can bank you a certain amount of cash depending on the difficulty chosen, and nearly every action you take while playing can reward you with even more. Money can be earned from taking down enemies, picking up ammo, maintaining stealth, scoring multiple kills, hacking terminals, finding intel, interrogating enemies, head-shots, melee kills, injuring an enemy, and a few other actions. On the flip side, getting killed or accidently suiciding will cost you a regeneration fee of $50 or $100 or so, so youre better off staying alive.What good would this bankroll of Vektan Dollars be without someplace to spend them, and thats where Blackjack, the games remotely located arms dealer, comes in. Blackjack has lockboxes scattered all throughout the mission maps and even in the middle of an intense firefight you can pop one open, cloak, and purchase or swap out weapons and equipment. Danner only has a few slots for weapons, armor, equipment and gadgets, and for a fee, you can purchase and equip new gear. Beyond primary and secondary firearms, Danner can choose a body armor type, a grenade variation (explosive, gas or pyro for example) and a powerful VAN-Guard gadget. Firearms are neither upgradeable or customizable and include Killzone versions of assault rifles, SMGs, sniper rifles, pistols, shotguns, rocket launchers and whatnot. They run the full range of silent and accurate, to loud and powerful, so your equipment choices will dictate how you play the game. I personally choose stealth over power for nearly all of the main missions, although theres nothing stopping you from switching it up throughout assuming you have the cash. Just re-equipping items you have already purchased can cost upwards of a couple hundred Vektan Dollars, so if you find yourself low on cash, it may make sense to stick with that particular loadout for little longer.The VAN-Guard gadgets are by far the most interesting part of your armory, and even though they can cost a pretty penny and take several minutes to charge up, they can effectively turn the tide of a difficult encounter. Like the variety of weapons available, VAN-Guard equipment can assist in covert missions or just blow apart waves of enemies. The ghost cloak allows Danner to maintain near invisibility for a limited time  perfect for finding and interrogating officers  or he can unleash Sky Fury, a remote controlled drone with precision GPS strike capabilities (which utilizes the PS Vita touchscreen). Even without the ability to reconfigure or upgrade equipment, Killzone: Mercenary offers enough strategy and variety to keep the missions from feeling too repetitive.Even on the PS Vita, the gameplay in Killzone: Mercenary has somewhat of that Killzone-feel to it, meaning a bit heavy and not as hyper feeling as, say, a Call of Duty game. Im personally a big fan of Killzone 2 and 3 and play my Vita regularly so I felt right at home with Mercenary. The weapons in the game feel great, and you can certainly tell the difference between a pistol, a SMG, an assault rifle and a heavy machine gun. Different body armor affects movement too, so if youre equipped for movement and stealth youll have an extra pep in your step and vice versa. The analogs are nicely tuned right out of the box and I didnt even feel the need to reconfigure them, and the L and R triggers work fine for iron sights and shooting respectively. The touchscreen is certainly utilized quite a bit throughout the game, especially when it comes to melee kills, interrogations, some of the VAN-Guard gadgets and intel hacking. Other actions, such as reloading weapons, switching equipment, throwing grenades and running can be triggered with the touch surfaces or buttons, and I found myself switching it up regularly.The main campaign in Killzone: Mercenary will only last around 5 hours at normal difficulty, though there are a trio of mission variations unlocked upon completion of each contract. Precision, Covert and Demolition contracts play out the same way as the main missions do except with some distinct requirements, objectives and new rewards. Most of these variations require different loadouts (which need to be purchased of course), and the goals change from contract to contract. Precision may task you with pulling off a defined number of headshots or hack consoles, while covert could require you to maintain stealth and take down security cameras, whereas Demolition could send you in guns a blazing to destroy everything in sight. If any of the requirements fail to be met, you are prompted to either restart at the nearest checkpoint or potentially the entire mission. On paper, these additional objectives should add some replay to the brisk campaign mode, except for the fact that you must play through the entire contract, story-scenes included, to earn the cash and rewards. I would have preferred more bite-sized challenges with different requirements based on the original missions instead of literally needing to play the same exact missions over from start to finish. Each mission can take upwards of 20 minutes depending on the objectives, so for a portable FPS, these variations dont always work in its favor. Even with new weapons and equipment to unlock, because they take more than a few minutes to complete I never felt compelled to keep replaying the contracts just to earn more cash, rank or valor.Another thing that irked me about the campaign is that the enemys range of vision and intelligence seems inconsistent. You will sometimes be spotted even while creeping along slowly in cover at a long distance, and other times you can cross right in front of an enemy without triggering an alert. It doesnt happen often, but if you are going for covert bonuses it gets annoying to be spotted when you shouldnt have. Enemies will play smart and try to outflank and use grenades to flush you out from behind cover, and at other times theyll stand there and let you take down an entire group just using a brutal melee technique. Another gripe worth mentioning is the monster closet-type of encounters that trigger several consecutive waves of enemies that seem to go on for a little too long.Like the single player campaign, the mulitplayer modes in Killzone: Mercenary are all tied in with earning cash, rank and valor cards. You can jump into a trio of modes with up to 7 other players in public and private matches, both of which support parties. There are 6 maps available to play on and the modes and options available are nicely thought out, enjoyable and fairly competitive for the most part. Pre-launch, there have been some scattered stability issues which is not all that out of the ordinary. We assume theyll be patched up once the beta sessions are over and more of the general population gets their hands on the game. The multiplayer modes available include Mercenary Warfare (deathmatch), Guerrilla Warfare (team deathmatch) and the most interesting of the three, Warzone. Warzone is a team based mode which features 5 rounds of alternating objectives which range from incapacitating and interrogating enemy players, to securing VAN-Guard capsules, to killing the enemy and picking up their valor cards. The team who scores the most points by finishing off the objectives wins. The progress achieved in single and multiplayer modes, including cash, rankings and equipment is shared offline and online, so players who spend time playing through the campaign will likely have a few extra goodies available. Overall, theres not much in Mercenarys online modes that are super unique or different, however the quest for cash and rewards should certainly add some longevity to the game.It goes without saying that Killzone: Mercenary is one great looking PlayStation Vita game, stunning even. There are next generation-style effects everywhere, from HDR lighting effects to fine particles floating through the air. The environments are varied and interesting from mission to mission, even though they mostly take place indoors. There are definitely some cool set pieces too, and it wouldnt be a Killzone game without them. The characters are impressively modeled and animated and react appropriately when pegged in the leg or the head, or taken down with a brutal melee from behind. The textures are mostly high quality and youll still catch a few random lower quality ones here and there if you look hard enough. The framerate tries to maintain 30fps and does so for a good chunk of the game. It definitely dips here and there but I didnt find it horribly distracting, personally.The sound design in Mercenary is pretty awesome too and the voice acting isnt half bad all around. The radio chatter effects change depending on your proximity to your teammates, and the Helghast troops all sound suitably pissed off. As usual, play the game with headphones for the best results.", "date": "September 10, 2013", "grade": "A-"}