{"name": "The HD Adventures of Rotating Octopus Character", "ref": "https://gaming-age.com/2013/09/hd-adventures-rotating-octopus-character-review-ps-vita/", "text": "In some alternate universe  specifically, one where smartphone gaming never took off and Sony and Nintendo products were still the be all and end all of on-the-go gaming  I could see The HD Adventures of Rotating Octopus Character being a huge hit. I mean, it has a lot going for it: an adorable design, short levels, a one-button control scheme thats easy to figure out but hard to master. In other words, all the ingredients of a game thats perfect for picking up and playing whenever youve got a free moment or two. And at $2.99, it offers it all at a price point well below pretty much everything else on the Vita.Unfortunatelywell, you can see the flaw with that line of thinking. While Id personally love a world where Vitas and 3DSes were the go-to mobile gaming devices, the reality is that iOS and Android devices have largely supplanted dedicated handheld gaming systems in the minds of most people as far as gaming is concerned. This means that The HD Adventures of Rotating Octopus Character isnt competing with the newest Mario or Rayman platformers at $40, its competing with games that are a fraction of the price, if not free. Whats more, while there may not be many other Vita games with such simple controls, other mobile platforms are overflowing with them.That said, there are a few points that should be made in Rotating Octopus Characters favor. First, this game is actually an HD remake of an earlier PSP Mini, The 2D Adventures of Rotating Octopus Character. While its not as if that original game introduced some revolutionary new style of play or anything  after all, it came out in early 2011  it still had slightly less competition in the one-touch platformer arena then than it does now. Secondly, it seems worth noting that even if The HD Adventures of Rotating Octopus Character is more expensive than your typical iOS game, its still cheaper than the original PSP Mini, despite the updated and improved visuals.And, most importantly, theres this: The HD Adventures of Rotating Octopus Character may not be the cheapest or most original game, but its still fun and well-made. All things considered, that seems like it should count for something. Whats more, out of all the platformers in the Vita library  of which there are more than youd think  Rotating Octopus Character stands out for its bright, appealing graphics and its easy-to-grasp controls. Those may not be essential criteria for everyone, but those aspects do count for some people, and for those people, this game is a must-play.", "date": "September 5, 2013", "grade": "B+"}