{"name": "The Bureau: XCOM Declassified", "ref": "https://gaming-age.com/2013/08/bureau-xcom-declassified-review-xbox-360-ps3-pc/", "text": "Spin-offs of popular properties are rarely good. Sure, sometimes you get Daria, The Jeffersons, or Mork and Mindy. More often than not though, you get Joey. The Bureau: XCOM Declassified is essentially the Joey of the video game world this year.Coming off of the successful reboot for XCOM that debuted on consoles and PC last year, saying The Bureau is a let-down is an understatement. I knew going in that this wasnt a strategy game in the same vein as standard XCOM. But I was really hoping for something that featured a little more ingenuity than a thinly veiled attempt at employing the same squad based, third person shooter mechanics found in Biowares Mass Effect series. Unfortunately that makes up the gut of The Bureaus gameplay, with the rest filled out by bland bits of dialogue and unnecessary backstory that fill in the early years of the XCOM universe.In The Bureau: XCOM Declassified youll take on the role of Agent William Carter. Recruited for duty to fight against the threat of the Outsiders, youre slowly introduced to the early days of XCOM and an initial plot by the alien invaders to overthrow Earth. Set against the backdrop of the 1950s, you take Agent Carter across a series of missions based almost entirely within the United States, driving back an early invasion that eventually sets up certain elements of XCOM: Enemy Unknown.From a story perspective theres not much here that actually ties in directly to Enemy Unknown outside of a late-game reveal. Without spoiling much, the reveal certainly gives The Bureau the ability to tie into Enemy Unknown, but doesnt feel especially necessary. This is an attempt to tell a more personal tale than what weve seen out of XCOM so far. William Carter is a man without a family, a war hero with a propensity for alcohol and insubordination. But most of these traits are overlooked throughout. While cutscenes are meant to show Carter battling his inner demons, nothing that you actually control in the game backs up his internal conflict.The Bureau tries to marry a third person shooter with cover mechanics to typical RPG tropes like experience gaining and skill building. Agent Carter, and the additional agents you can customize and take into the field, will gain experience for killing enemy combatants and for winning missions. There are a handful of side missions, along with dispatch missions that are handled autonomously by agents you create and deploy, allowing you to build up a team of reserves in case you lose a friend. Permanent death for field agents is one of the concepts that carry over from standard XCOM, but since you can just go in and make another character at any point in between missions its not really a big deal. The biggest issue stems from losing a character with a higher experience level, but your agents can only go up to level five so it doesnt take much to max out a new one.Along with that, Agent Carter hits his level cap at level 10, with each level increase bringing along a new skill to use in the field. For Carter that includes abilities like mind control, the ability to deploy a drone, and a telekinetic lift ability that again feels like something ripped right from the pages of Mass Effect. The other field agents you create and use are further defined by classes, like Engineer and Commando, giving them additional skills like turret deployment or taunts to draw enemy fire.The leveling system, skills, and overall pacing in The Bureau feels pretty busted. Youll max out your field agents early on, making experience gains somewhat pointless. I came to a point where I was doing dispatch missions simply to gain new backpacks, the one piece of gear that isnt a new gun, but doesnt honestly add much to the game. I maxed out Agent Carter a couple missions before the end of the game, which further reduced any incentive to seek out additional objectives or enemies to fight. Im not sure why the level cap is so low, and why there were such a small number of abilities to unlock, but considering the game length The Bureau could have done with a more robust character development system.Combat is equally tepid in The Bureau: XCOM Declassified. Again, this feels remarkably like a Mass Effect clone, but with a stronger emphasis on ability spam to win fights. Most missions consist of holding down the roadie run button until you get to a telegraphed environment filled with enemies. From there you hunker down behind cover, unleash every useful ability Agent Carter and the field agents can immediately deploy, and then occasionally pop up for a quick and easy headshot.On harder difficulties The Bureau tosses a ridiculous amount of grenade spam at you, but on the two lower difficulties the game becomes a breeze. Theres no middle ground here, and very little use for actual strategy. Youre given the option of positioning agents behind cover, and really digging in to micro-manage, but its never necessary to do. And on the higher difficulties it becomes pointless because your friendly A.I. is absolutely brain-dead, and will often die when running to and from cover, or theyll get blown up by grenades instead of taking the initiative to move out of harms way. So while you might have the options for something more tactical, youre either punished for attempting it or youre wasting time because its not necessary based on whatever difficulty you opt for.", "date": "August 30, 2013", "grade": "C-"}