{"name": "SteamWorld Dig: A Fistful of Dirt", "ref": "https://gaming-age.com/2013/08/steamworld-dig-a-fistful-of-dirt-review-for-3ds/", "text": "If youve been looking for something to pick up on the 3DS after that awesome promotional credit for Fire Emblem: Awakening and Shin Megami Tensei IV, Id suggest you propel SteamWorld Dig to the top of that list. While its a relatively short game, the four or five hours itll take you to complete is time well spent with a unique adventure title focused on vertical exploration.Its hard to compare SteamWorld Dig to anything else, it culls a bit from titles like Minecraft and Terraria in that youre digging downwards for treasure and secret areas, but theres no building or constructing going on here. Instead youll continually mine for valuable ore, bring that ore to the surface, upgrade your tools, and dig down some more. There are some small combat elements with enemies that pepper the environment, which get more aggressive the deeper you go. But SteamWorld Dig is clearly more focused on the addictive nature behind finding out whats next, what new cavern youll uncover, or what that shiny, ore filled rock a few feet down is going to give.And while the concept of digging downward might not sound enticing on paper, SteamWorld Dig breaks its gameplay up nicely by introducing a series of mines to uncover as you continue down. Some of these areas will contain useful power-ups, like an electrically charged double jump, while others are strictly filled with treasure to gather. The mines contain gameplay elements akin to platformers with puzzle elements tossed in. These often require the player to make tricky jumps, chain together wall jumps, avoid enemies or use them against each other. Theyre often filled with traps or other hazards to avoid, and occasionally use switches or other triggers to unlock paths to new areas. Ideally the game could use more of these areas, or at least larger, more complex versions of the ones available. But as an initial entry into what could easily be a budding franchise of sorts, SteamWorld Dig certainly shows promise with its unique mix of gameplay.Theres not much fueling the plot behind SteamWorld Dig, but I do enjoy the aesthetics of the Old-West theme used to represent this world. The opening town which doubles as a hub gradually opens up over time, with more shops becoming available where you can purchase increasingly helpful tools to fuel your adventure. Youll also find multiple entrances to different levels of your dig as you advance, giving you quicker access than just starting from the top. Other supplies can be found here too, like dynamite, ladders, and a handy teleport that lets you instantly warp back to town when used.SteamWorld Dig isnt the longest experience, but its designed in a way that promotes both slower, explorative digs and faster speedruns as well. I played at what I would assume is a moderate pace, but if youre determined enough to try you could certainly clear this adventure in a couple hours. You might have a tough time of it, as the enemies do get progressively harder and more aggressive the further down you go, but theres some unique self-challenge opportunities present here, and I like that theres a bit of open-endedness in the way you can tackle SteamWorld Dig.", "date": "August 15, 2013", "grade": "B+"}