{"name": "ibb & obb", "ref": "https://gaming-age.com/2013/08/ibb-obb-review-for-psn/", "text": "As someone who plays single-player games almost exclusively, I generally ignore any proclamations that certain games need to be played in multiplayer. My attitude has always been that if a single-player mode exists, I can take whatever the game will throw at me  which, in most cases, means shoddy AI.This isnt true for ibb & obb. Its description in the PSN store calls it a a two player cooperative game, and that pretty much nails it. Its a puzzle-platformer that really does require two people playing the game in sync with each other; anything less than that, and you just cant get through it.In fact, Im going to take that description one step further, and say that you need to approach ibb & obb as local two player co-op game, since figuring out many of the puzzles requires the sort of communication you just cant get from online play. I say this from personal experience: playing through the game online resulted in frustration and rage quits (only the former on my end, shockingly enough), since theres no easy way to communicate in some of the trickier parts, which leads to death after death after death. By contrast, when I played the game with my wife, whose video game skills outside of Wheel of Fortune and Jeopardy are pretty much non-existent, we were able to get through each level relatively painlessly. Not that local co-op made the game that much easier, mind you  the puzzles here require a good deal of thinking, along with no small amount of good timing and reflexes.Which means, of course, that ibb & obb is a whole lot tougher than youd think just from looking at it. Between the adorable main characters and the bright, fun colors that populate the game world, visually the whole thing rivals the likes of Kirby, Sackboy or Toki Tori in terms of sheer cuteness. That its far harder than anything those games have to offer may cause a bit of a mental disconnect, but at the same time, when you get trapped or stuck, it makes it a lot harder to get too mad at the game.And you most likely will get trapped and stuck, because thats just how ibb & obb works. Make sure you have someone else along for the ride, though, and youll probably find the solution in time  and more importantly, youll have a lot of fun doing it.", "date": "August 14, 2013", "grade": "B"}