{"name": "Brothers: A Tale of Two Sons", "ref": "https://gaming-age.com/2013/08/brothers-a-tale-of-two-sons-review-for-xbla/", "text": "If you hear the game Ico mentioned any time Brothers: A Tale of Two Sons is talked about, its a comparison thats well-deserved. It seems pretty clear that developer Starbreeze took some inspiration from the beloved PS2 cult-classic, and really put that inspiration to good use here. Its also a hell of a way to kick off Summer of Arcade for XBLA this year, and really sets the bar pretty high for digital downloads for the rest of 2013 in or out of the promotion.The overall tale told by Brothers is pretty simple, but remarkably ends up as one of the bigger emotional experiences Ive had with a video game this year. Theres no text to read through, and the spoken dialogue sounds like something pulled from The Sims more than any known language. But theres enough conveyed through the action and animations of each character to not only sell you on the fantasy infused world the titular brothers live in, but to really drive home the all-important and often elusive connection with players that few games manage to make.Theres not much else I can say about the story without ruining that end response, but trust me when I say its well worth checking out. Thankfully the gameplay manages to match up nicely, opting to focus on exploration and puzzle solving rather than simple and repetitive combat. If youve grown tired of shooting dudes in the face or beating bodily fluids out of everyone, youll enjoy the break that Brothers: A Tale of Two Sons gives you from a bit of the old ultra-violence.Brothers: A Tale of Two Sons makes use of a pretty unique control feature that puts you in direct control of both brothers at once, by using each analogue stick on the controller for simultaneous movement. The left stick controls the eldest brother, while the right controls the youngest. Context sensitive actions are controlled by a single action button for each brother, and while the thought of controlling two independent characters via one controller sounds daunting, I thought it ended up as something surprisingly intuitive. Id go off the rails a bit here and there, but theres not much in Brothers that punishes you for mistakes.My only real complaint is that Id like a bit more challenge out of the short experience that Brothers delivers. The puzzle aspects of the adventure never really get off the ground until the tail end of the game, and even then youll hardly find yourself stuck. Its great for the pacing, since youll hardly pause for long in one spot, but makes for a pretty fleeting experience overall. I certainly appreciate the emphasis on the environment and unique scenarios found throughout though, and while this might not be the most visually impressive game out there, it has an incredibly charming art style that helps sell the world really well.", "date": "August 12, 2013", "grade": "A"}