{"name": "Fist Puncher", "ref": "https://gaming-age.com/2013/07/fist-puncher-review-for-pc/", "text": "While digital platforms have featured a lot of quality ports of classic arcade beat em ups, like the recently released Dungeons & Dragons compilation, theres not nearly as many original titles that do justice to classic quarter-munching machines and old-school console entries in the genre. I can think of two off the top of my head, Castle Crashers and Scott Pilgrim, but another one worth adding to the list is this title, Fist Puncher from Team2Bit, recently released for PC and Steam.Theres not much that I can find at fault with this ridiculously fun throwback. Its a 2D based side-scrolling beat em up in the vein of classics like Final Fight and Streets of Rage, with a hefty number of characters available, lots of stages to fight through, various bosses with unique mechanics, and an experience/stat building system that makes this more than a throwaway 2 hour experience.Fist Puncher, as the name implies, never takes itself too seriously. The starting characters are pretty eclectic, even for the genre. Youve got entries like Dr. Karate (literally a doctor that specializes in karate), Steroid Jackson, The Beekeeper, and Hella Fistgerald. There are 15 characters in all, with the other 11 unlocked throughout the game. Most appear while playing through the stages normally, while the rest are a little harder to get.The roster diversity carries over into skills, but all heroes have a handful of basic abilities, like punching, kicking, jumping, blocking, and the ability to grab enemies. You can roll to evade, double tap a direction to sprint, and each character has unique special moves that are limited by a meter displayed below the health bar in the HUD. Theres full controller support here, stylized around the typical Xbox 360 set-up, but you can opt to play with just a keyboard if youd prefer.Theres also four play co-op to check out, and the ability to switch between characters before entering a stage. The stages are laid out on an overworld map, with multiple directions available allowing you to choose the sequence of stages tackled. The end goal involves rescuing international pageant contestants kidnapped by the villainous Milkman, who in turn is accompanied by a series of named bosses like Kony parodies to killer robots.Every character has their own experience to gain, and stats to level up. Experience is gained by successful hits, and youll rarely run out of bad guys to punch. Stages are somewhat short, usually clocking in around 2 to 3 minutes apiece, but the levels feel really well paced. Theres a hefty number to go through, with some solid variety to break up some of the monotony typically found in the genre. Youll run into stages were you might need to diffuse bombs within a time limit, battle it out atop a semi/box truck trailer where you can fall off of every side, or ride an ostrich through a desert littered with land mines.Fist Puncher also really nails the combat aspect, which is certainly the key thing that makes this such a standout experience for me. The action is fast paced, your character has the mobility to never feel sluggish, and there are enough defensive options that skilled play really feels rewarding. Theres nothing cheap or punishing about the difficulty, and while its not going to be classified as the toughest game out there, youll still find yourself getting knocked around a bit. Enemies are also aggressive enough that you cant just button mash your way to success, at least not against bosses, requiring you to actually use all the moves at your disposal more often than not.", "date": "July 18, 2013", "grade": "A"}