{"name": "SteamWorld Quest: Hand of Gilgamech", "ref": "https://gaming-age.com/2019/05/steamworld-quest-hand-of-gilgamech-review-for-nintendo-switch/", "text": "SteamWorld Quest: Hand of Gilgamech is the newest entry in the Steamworld series of titles from developer Image & Form, and just like the games that have preceded it, this is a very, very different experience within the SteamWorld universe. Whereas the SteamWorld Dig titles have tackled the platforming Metroid-style of play, and SteamWorld Heist was more a tactical 2D strategy game, SteamWorld Quest: Hand of Gilgamech is an RPG card battler with a hefty amount of depth and strategy customization.Adopting the general look and feel of previous SteamWorld titles, such as the sense of humor one finds from robotic humanoids adopting a variety of fantasy styles, SteamWorld Quest: Hand of Gilgamech is comprised of a number story missions throughout its moderate length campaign. Youll gain access to new party members as you play, all of which have different personalities and traits that extend to combat.As I mentioned before, this is an RPG that focuses on using decks of cards in place of standard menu commands during battle. Each party member has an 8 card deck, which you can customize by obtaining or crafting new cards in between battles. As you gain access to new cards, you can start to build strategies with your selected team, which can consist of up to three party members at a time. Cards can be direct standard attacks, buffs, debuffs, heals, and more. You can play up to three cards per round of battle, occasionally deploying an extra card if you use three cards all in one turn from a single character deck. You can also opt to discard up to two cards per round, instantly drawing new cards if you need different options. Combat may seem complicated at first glance, but SteamWorld Quest does a fantastic job of easing you into the mechanics.Theres a push and pull function to fights as well. At the top of the screen youll have a meter that consists of a series of cogs. To fill this meter, you need to play specially designated no-cost cards. Each of these cards played will put one cog on the meter. Other cards, typically more powerful by design, will use this meter to unleash heavy hitting attacks, heals, or party wide buffs. Youll constantly need to be involved in your decisions during combat, meaning that every fight is worth paying attention to and rarely feels tedious or boring. Also, SteamWorld Quest doesnt make use of random encounters for combat, so if youd prefer to explore an area and avoid combat, its certainly possible to do so.Besides the fantastic combat system, SteamWorld Quest: Hand of Gilgamech looks and sounds great. It certainly feels in line with the previous SteamWorld games, and Id say the style hues a little closer to SteamWorld Heist, albeit with a fantasy spin instead of sci-fi. Each party member feels unique, both in how they play and how theyre written. The overall plot is certainly entertaining, and the soundtrack is fantastic. SteamWorld Quest: Hand of Gilgamech is basically what weve come to expect from the SteamWorld series, namely a well-realized take on an existing genre masterfully executed once again.", "date": "May 1, 2019", "grade": "A+"}