{"name": "The Walking Dead: 400 Days DLC", "ref": "https://gaming-age.com/2013/07/the-walking-dead-400-days-dlc-review-for-xbla-psn-pc/", "text": "Its definitely a testament to the quality of an experience when it leaves you wanting more. And thats exactly what Telltales The Walking Dead accomplished when I came to the conclusion of the five-part Season One a few months back. But while were still pretty far off from the release of Season Two, theres finally some new content to play within this splintered portion of The Walking Deads universe with 400 Days, a bit of DLC for the first season that seems to set in motion events for Season Two.400 Days features five individual tales that all weave around a single location, a diner/truck-stop on a lonely stretch of road, run down and spoiled by time in a Robert Kirkmans post-apocalyptic world. While not necessarily housing every single piece of the cast featured here, most of the events found in each short story are relatively close in distance to this location, a place at various points that does house a handful of survivors.Im attempting to be pretty vague here, obviously, because like the main game this is something that you dont really want to ruin for anyone. And the story aspects once again take center stage above all else, so dont expect any sweeping changes to gameplay with 400 Days. If you thought The Walking Dead was more interactive fiction than video game, 400 Days isnt going to change your mind about that. What little gameplay featured here is solely to propel the story forward, and the light puzzle elements found before are pretty much non-existent, which is disappointing.But as far as setting a stage goes, assuming this is the cast that we will run with for Season Two, I think 400 Days does its job well. Each of the five stories unveiled occur at various points during the zombie outbreak, spanning a 400 day period. You can tackle these stories in any order but it does seem to benefit the overall experience if you go in the order suggested by the posted photos that represent each chapter. Since the stories do intermingle a little bit, certain appearances or mentions might mean little if taken out of order.One thing that each story does well, which carries over from the main game, is giving your decisions some feeling of weight and importance. Theres generally a key moment or two featured in each chapter, which I imagine will position characters differently headed into Season Two. And at the end of the game, just like before, youll see how your choices rank with those that have already played. One interesting thing to note, as of now at least, that every key decision encountered is a 50/50 split among the player base. Which makes a lot of sense given the decisions required, none of which are black and white in a moral sense. Just about every key action taken in 400 Days will be an uneasy one for most.I played through 400 Days on the XBLA release of the game, and its worth mentioning that there are a few technical hiccups that persist from the original content. Some slight stuttering and loading hesitation when saving or transitioning from one scene that could clearly go in another direction is often noticeable throughout, and its something that I really hope gets ironed out for consoles before Season Two starts.But on a positive ending note, despite featuring an entirely different cast than Season One, all of the characters introduced here feel just about as real to me as the originals. While Telltale isnt trying to emulate the Lee/Clementine dynamic with this cast, when you get to the end of 400 Days youll definitely find yourself wanting to know what happens to this eclectic and troubled group next, which is just about where Season One left us when it ended.", "date": "July 8, 2013", "grade": "B+"}