{"name": "Project X Zone", "ref": "https://gaming-age.com/2013/07/project-x-zone-review-for-3ds/", "text": "Project X Zone is the very definition of fan service video game enthusiasts. Its a game that pulls the various franchises and universes from three major Japanese publishers  Namco, Capcom, and SEGA  and slaps them all into a dimension-hopping conflict pitting them against the majority of their significant villains found in titles like Tron Bonne, Tekken, Darkstalkers, Street Fighter, God Eaters Burst, Dead Rising and so on. Theres an ambitious scale thats pretty impressive as it unfolds, with how the game constantly escalates its ridiculous crossovers as each chapter is introduced. But strip away your love for the various franchises featured and youre left with an experience that doesnt stand up well on gameplay alone.This is a strategy RPG, complete with isometric, 3/4s overhead viewpoints, grid layouts on large maps with varying terrain heights, and turn based gameplay. Youll control individual units that consist of two character teams, which can be further enhanced with single hero characters that are completely interchangeable between chapters. Positioning characters near each other will unlock special support attacks, and theres some underlying strategy in building up an experience meter that can unleash powerful specials when you go past the 100 percent mark.The big issue with the strategy aspect is that its wholly unnecessary. Theres little to no difficulty found in Project X Zone, despite the constantly increasing size of enemy armies thrown your way with each successive chapter. Youll face off against dozens of no-name enemies at a time, three or four bosses may even be included, but youll rarely find yourself in any danger of losing a battle. Outside of simply not paying attention to health meters, Project X Zone does very little with its strategy trappings to put it on par with classics like Final Fantasy Tactics, or even lesser known titles like Jeanne DArc.And that lack of difficulty ends up making the overly long battles feel more like tedious slugfests than tactical battles for survival. Theres a lot of repetition throughout the game, which is only alleviated by the stream of new characters introduced throughout. Theres a pretty huge roster at your disposal once you wind down to the end game experience, and its the only hook thatll keep you playing through the 30 plus chapters that make up Project X Zone.There are some unique aspects worth mentioning, the biggest of which is the way combat is handled. While combat can get tiresome over time, the way its handled is certainly different. When you position a unit close enough to an enemy to attack, youll switch to a 2D-zoomed in view with large, sprite rendered characters that battle it out in a simplified fighting game mode. Here you can perform a series of attacks using directional input combined with button presses, call in support attacks and partner attacks with the L and R buttons, and attempt to juggle enemies for prolonged combos. Every hit builds your experience meter, and once you pass a certain mark you can trigger a flashy finisher that pummels an enemy into submission.Theres some skill involved in timing your commands so that you can keep an enemy suspended in mid-air, which at least keeps the combat from feeling overly dull. And the flashier finishing moves are fun to watch the first few times, but can thankfully be skipped once that appeal has worn thin.", "date": "July 3, 2013", "grade": "C"}