{"name": "Company of Heroes 2", "ref": "https://gaming-age.com/2013/06/company_of_heroes_2_review_for_pc/", "text": "I can tell that Ive grown sort of used to yearly or bi-yearly launches for franchise entries when I found myself pretty surprised its been seven years since Company of Heroes was released. Even with the demise of THQ, former publisher for the title, and with Relic being bought by SEGA late last year / early this year, thats a hell of a time span for most sequels nowadays.But has that time been well spent for Relic with Company of Heroes 2? Yes and no. Yes, in that its mostly a clear improvement over the original game in a number of ways. Flashier visuals, a completely new faction with the Russians replacing the Allies, and some neat ideas like the way winter can cause a number of impacts on any given battle. But theres a lot about this game that also feels like a spruced up version of the original, which isnt out of place for a sequel, but theres not a lot of broad, sweeping changes in play here.Company of Heroes is split between three modes. The campaign focuses on the Eastern Front of World War II, attempting to wrap a story around the conflict via cutscenes that portray a treasonous member of the Russian Army imprisoned and reliving events of the war via his cell. This aspect isnt entirely necessary or well executed, and does little more than set up each mission while constantly reminding us that war is pretty awful, even if you come out on top. The historical focus that was present in the original Company of Heroes still takes center stage though, and focuses on a number of known events from the conflict between Germany and Russia, which actually ends up being a bit more interesting to someone that grew up with constant reminders and history lessons focusing more on the American and British exploits.The campaign is cut into three difficulty settings, but CoH vets will have little trouble here even on the hardest setting. Its also not the best way to acclimate yourself to the game if youre new to the series. There are some bits of a tutorial given in the opening mission, but a lot of elements that become vastly important in multiplayer or skirmishes are rarely touched on all at once. I definitely found the campaign to be fun, but I think its hardly the best reason for buying the game.However, the campaign does introduce you to the winter element, and how that can have a variety of effects on battle. Winter snow can accumulate quickly, slowing down troop movement significantly outside of a select few units. Also, being caught out in the open during the cold can lead to frostbite, and actually kill enemy units if theyre not near a source of warmth like a campfire, or huddled inside of a building. Each squad under your control will have a small meter that lets you know how cold they currently are, and this concept really adds another layer to how youll control and execute the movement of troops for any given fight.Youll occasionally run across frozen bodies of water, which can provide handy shortcuts to areas that youd normally need to trek around. But these can be a double edged sword as well, if an enemy spots and targets units crossing ice, they can literally sink you with a number of direct shots. This is especially useful against tanks and other mobile units, which is one of the earliest examples given during the campaign.The multiplayer portion of the game marks the second mode available. Here you can match up with players across the globe, with Company of Heroes 2 offering up to 4 vs. 4 matches with a mix of real players and A.I. controlled units. Player only matches make up the ranked portion of multiplayer, but the ranking system is unfortunately hidden from view. Player level is always shown, but this is dictated by experience earned throughout all three modes in the game, and only shows that youve been playing the game for a while instead of actually relating skill. Not being a bit more transparent in how or why Im being matched up with other random folk is certainly a negative here.If youre not interested in fighting against other players, you can opt to team up against A.I. opponents instead, or even play 1 vs. 1 against the A.I. across the 8 maps featured with the custom play settings. While 8 maps might not sound like a lot, there are some winter variants tossed into the mix as well. And the maps are all pretty varied, with control, ammo, and fuel capture points spread out in unique patterns. Fuel and ammo capture points in particular emphasize a lot of risk in maintaining your hold on them, making them almost like choke points of a sort due to their high value.There are also some army customization options available here that tie into the experience and leveling system shared across modes. These include minor things like camo skins for tanks and other vehicles. But there are also commander units that you can activate while playing, and depending on which commander you choose you can execute a number of unique abilities during matches after youve built up the necessary command points. Some of these abilities are pretty unique and interesting, like an option thatll drop propaganda leaflets on enemy units making them question the morality of their actions. Others are a bit more straightforward, like special tanks or infantry units, mortar drops, or recon planes thatll unveil sections of the map occupied by enemies.Theres also the equivalent of perks present here divided up between different unit types. When equipped into one of three slots these Bulletins will add bonuses to things like accuracy or damage, or potentially speed up the time required to build units during play. The bonuses are mostly small, nothing that seems particularly game-breaking, and are also tied into various achievements available. Most perks also require a certain level to be hit first, so itll take a while before you gain the full suite of options here.The third mode featured is a bit more unique to Company of Heroes 2, called Theater of War. This mode is comprised of a series of missions and challenges, some of which can be tackled alone or with a friend, that focus on either unique scenarios or actual battles from World War II between Russia and Germany. This doesnt simply recycle content from the campaign for the sake of co-op, but generally constitutes new missions unique to Theater of War. It adds a lot of content on the backend of the single player campaign for those that arent interested in competitive multiplayer, and promises to be updated via DLC with additional missions. I wasnt quite able to finish the content found in this mode prior to review, but what I played I definitely enjoyed.On the negative side of things, there are a few elements that stood out poorly during my time with Company of Heroes 2. While I imagine its challenging to program A.I. that has to deal with some of the large scale conflict found throughout the game, I found myself constantly annoyed with unit awareness and positioning. This was more so with my own units than that of the enemy, but trying to get them positioned behind cover or other structures was far more daunting than the intro of the game makes it out to be. Theyd often pop around the sides or literally stand out in front, with only one or two units taking up position behind something. Sometimes this would be due to the size of the structure used for cover, making it more understandable, but there were certainly instances where cover was in abundance while their intelligence clearly was not.Another aspect to be wary of is the fact that Company of Heroes seems to be a GPU beast. The system I played on is quite modest, so I expected some framerate sacrifices would be made. Even then the range given for FPS when running tests with various settings selected, or going by the suggested settings that Company of Heroes 2 gave me, was quite wide. And judging by forum reactions and online rumblings, I dont seem to be the only one surprised by this. While Company of Heroes 2 is certainly a better looking game than its predecessor, I hardly think its such a massive leap as the GPU requirements seem to dictate. Hopefully this issue will be worked out over time via patches, but as of now it is well worth demoing before diving all in, even if you exceed the requirements.", "date": "June 27, 2013", "grade": "B"}