{"name": "Fireburst", "ref": "https://gaming-age.com/2013/06/fireburst-review-for-xbla-psn/", "text": "I have played many racing games in my run as a gamer. Ive played some good ones like Mario Kart, and Gran Turismo, and some obscure ones like Chocobo Racing and Sonic R. The concept of a racing game is so simple its hard to mess it up, so its a very rare occurrence that I come across a downright bad racing game. Then along comes Fireburst, and while I was optimistic after seeing the various trailers, once I began playing I wanted to drive off the nearest cliff.Fireburst is a standard battle racing game at its core, with over-charged vehicles piloted by strange drivers all trying to reach the finish line first. Like other battle racing games, you can smash the other drivers into walls and bump them to make them crash or flip. With other games, this mechanic works well, but it doesnt work well here. There is a strange boost power that you have to use to ignite your entire vehicle on fire, only then can you attack other racers and blow them up. This process also speeds you up the more its utilized, but using it too much will result in you blowing yourself up, so you have to use it with caution. You can cool off the engine by crashing into water barrels scattered on the track or driving through water on the ground, but crashing into a scattered heat barrel or getting caught in another cars fire stream makes you get hotter and can result in your demise. All of this sounds great, on paper, but once you begin actually playing you will see that none of this works as it should. Driving on any course at high speeds is a complete headache, since one bump into a wall will either stop you cold, or send your car flying out of control around the track. Most of the time, the flying act will result in your car getting stuck in a wall or sign leaving you with one option  to restart the race. Other times, you could be driving along fine, hitting all the turns with expert timing, only to have your vehicle randomly explode for no reason at all. Another issue is that the camera can mysteriously wander away from the back of your car leaving you driving up a wall (literally and mentally) or just randomly crashing. A few times, after a crash I was re-spawned inside of a sign and couldt move anymore, while another time had me re-appearing in the air over a cliff, resulting in another crash. The characters are basic stereotype edgy racers you would find in a game like Road Rash, only here they are not memorable or remotely interesting. Anytime I had a glitch free race (which was rare) I placed first by a mile. I would talk about the online play, but sadly I never got it to work even after attempting several times to join a race and being sent back to the menu. Judging from the single player experience, I can only imagine the complete mess an online race must be. I was forced to try multiplayer using the local split screen mode, which seemed to work a little better than the single player game. I experienced less issues in this mode, but it still wasnt a very fun time. There is a sort of challenge mode where you can complete a series of challenges set by the various racers, but I could only complete a few of these before I experienced game freezes and one where my entire system locked up. The events I managed to finish suffered from the same issues found in single player races, making something like dont crash more than 3 times impossible to complete. Im not sure if there are patches in the works to fix the freezing issues, but they are major, and if they are not addressed, you wont see many people looking for a Fireburst 2.Graphics in Fireburst are not up to par with other digital games being released this late in the consoles cycle. They are reminiscent of early budget Xbox 360 titles and the cars look like piles of metal and fire most of the time, while the landscapes and backgrounds on the tracks are muddy and washed out. The framerate takes a huge hit when two or more vehicles are on the screen and dips further when there are fire trails all over. Needless to say the visuals will not impress. Sound-wise you get to hear one liners from all the other racers as you pass them or crash into them, or (at least in my case) have many voices which stutter and loop at odd times. Music is standard hardcore tunes that are included with games of this nature, and most of them are forgettable. I simply turned it down and suffered through the races that worked in silence.", "date": "June 25, 2013", "grade": "F"}