{"name": "The Last of Us", "ref": "https://gaming-age.com/2013/06/the-last-of-us-review-for-ps3/", "text": "The Last of Us is a brutal and shockingly unflinching look at humanity in a post-pandemic world. It also happens to be one hell of an intense videogame experience and a fitting final PS3 title by the acclaimed developers at Naughty Dog. Blending together a story driven Uncharted-like adventure with tactical stealth and survival gameplay, The Last of Us may be the studios finest creation yet.Being their first new IP in almost six years, The Last of Us is easily Naughty Dogs most mature title in more ways than one. The theme, setting, story and character interactions are in huge contrast to their previous franchises such as Crash Bandicoot, Jak & Daxter and Uncharted which are all certainly much lighter in tone. Uncharted had us on the edge of our seats thanks to breathtaking set pieces and intense action scenes, but The Last of Us is so incredibly tense that its impossible to look away (even if you wanted to).The plot in The Last of Us is centered around Joel, a hardened pandemic survivor in his late-40s, and Ellie, a 14 year old girl he is tasked with protecting (for reasons that cant be stated due to some serious spoilers). The game is set nearly twenty years after the infectious cordyceps virus mysteriously struck the United States and began mutating humans into beings decidedly less human. Joel has clearly seen and been through alot over the past 2 decades, whereas Ellie, being born after the pandemic hit, has never even stepped foot outside of the military-run quarantine zone. With the breakdown of government and the ensuing power vacuum, underground activities and factions have begun to gain a foothold in certain uncontrolled areas.The acting and storytelling in The Last of Us is excellent and easily on par with the Uncharted series. Unlike Uncharted however, beyond a few uncomfortable chuckles from Ellie and another companion during the adventure, dont expect much in the way of tongue-in-cheek jokes or intentional humor. The tone of the game is deadly serious, and there are more than a few twists, turns, scares and tense nail-biting scenes. TLoU is definitely more survival adventure than horror, but seeing (or hearing) the infected wandering about and then come rushing when they catch your scent will freak out even the most hardened of gamers.Joel is not Nathan Drake. Hes older, slower and far less nimble, and apparently he cant even jump at will. He is, however, incredibly tough and resourceful. With supplies and materials being relatively scarce, Joel has to rely on picking up discarded firearms with very limited supply of ammo, or picking up items from the environment to use or craft into weapons of some sort. Collecting supplies in The Last of Us is akin to collecting treasure in Uncharted, except the supplies actually have a use. The crafting system is simple and easy to comprehend, and most certainly adds some strategy to the game. There are times, for example, when youll need to choose between creating a health kit or a molotov cocktail since they use some similar materials. Crafting happens in real time and requires several seconds, so its usually not something youll want to do out in the open. You can also find work benches around the city that allow Joel to take a break and upgrade his weapons or abilities using components hes picked up.The Last of Us isnt a fast paced game by any means. Joel can sprint if hes healthy, though since its noisy and can attract too much attention, youll probably find yourself crouch-walking through a good portion of the adventure. To maintain stealth, an important technique thats introduced early on in the game allows Joel to enter a listen mode to help him better locate both friends and foes who are within earshot. The ability essentially allows the player to see through walls to an extent and can be used as much as needed. Joel can carry a nice amount of equipment in and on his pack, including a melee weapon such as a pipe or plank of wood, a long gun/bow, a handgun, a distraction item such as a brick or bottle, a shiv, and a health kit. With ammo being relatively scarce, going for stealth takedowns (of humans and the infected) is almost always the best option. Except for a couple of specific situations, firearms are usually a last resort tactic.The close quarter combat and melee system that Naughty Dog implemented in The Last of Us is well done and incredibly satisfying. Its most definitely dangerous to take on more than one enemy at a time in the game, though if youre forced into that type of situation, Joel can usually fight his way out of it. Learning to break away from a mob using the sprint button or do a quick 180 turn to back up and defend yourself are need-to-know survival techniques. Ellie, who accompanies you through most of the game, can usually hold her own and does a rather intelligent job assisting Joel during encounters.The post-pandemic world of The Last of Us is dark, gritty and gloomy, with small splashes of color and beauty. Visually, the game is gorgeous and runs incredibly smooth with impressive, realistic environments and motion captured character animation. The effects, from glimmering sun rays filtering through the trees, to raindrops splashing off a window, to tarps and fabrics blowing in the wind, are some of the best seen on the PS3 to date. The dust on the lens effect is clearly the next generation lens-flare, so you might as well get used to it. The image quality is damn near perfect with nary a jagged edge or low resolution shadow map to be found. I dont know how Naughty Dog does it, but theres no denying that The Last of Us is one of the best looking current generation games yet. The technology driving the game comes quite close to pushing into next generation territory.As mentioned earlier, the voicework in The Last of Us is of high quality, and there are emotional and somber, heart-breaking scenes that will undoubtedly cause players to tear up. The dynamic, dramatic soundtrack and rich ambient sound effects amp up and fade away at all the right moments. The positional, uncompressed 7.1 channel surround sound paired with the twisted screams and clicking noises produced by the infected are enough to give you nightmares for real.The Last of Uss single player campaign is not particularly easy or short. Surviving means patience, so running and gunning instead of stealth and strategy is almost never the ideal option. Taking your time to plot your way around the environment usually yields the best results, though there are times when you are forced to deal with a situation head on. These moments are usually chaotic and intense, and nearly always require some sort of strategy to survive since enemies intelligently flank your position and try to flush you out if they hear or see something suspicious. There were a few times where the A.I sometimes failed to see Joel and/or Ellie when they were directly in their line-of-sight, but it wasnt particularly common. The checkpoints in the game are more than generous so if you fail a sequence it only takes a second to jump right back in and try again.My only real gripe with the game design is there are a few simple rectangular areas that have crates, boxes or similar structures too obviously laid out to allow for stealth or cover-based gameplay sequences. Its not a huge complaint, and The Last of Us isnt the only game guilty of this phenomenon of course, but I was hoping for more organic layouts throughout.Like Uncharted, I personally would have been perfectly content with just the single player experience in The Last of Us, but Naughty Dog and Sony had other plans. The online Factions mode picks up where the single player leaves off and provides for competitive, team-based survival gameplay. Players can join up with the Firefly or the Hunter factions and battle it out for control of several unique maps in the Supply Run and Survivor modes. The gameplay rewards stealth and tactics though it certainly offers a little more in the way of run-and-gun potential as compared to the single player game. Scrounging up supplies to support your clan is as important as taking down the other players, so its not just kill-kill-kill. Its a fun diversion, with a nice amount of customization and progression, so its obviously a nice addition to an already great game.", "date": "June 14, 2013", "grade": "A+"}