{"name": "Donkey Kong Country Returns 3D", "ref": "https://gaming-age.com/2013/05/donkey-kong-country-returns-3d-review-for-3ds/", "text": "If youve ever wondered why people are losing their minds trying to figure out what Retro is currently developing, you need to look no further than Donkey Kong Country Returns to see why. It is, hands down, one of the best platformers to ever grace a console, and sort of puts to shame even Nintendos better efforts of the past decade. Retro took a franchise developed by Rare and literally improved upon it, while keeping enough of the core experience around to tug on heart strings of nostalgia for anyone that enjoyed DKC growing up.This port of the game for the 3DS loses none of the charm and hardly any of the execution in its move to the small screen. All levels are intact, including the maddening K levels. The developers responsible for the port, Monster Games, have done an excellent job of bringing Donkey Kong Country Returns over, and even implemented a brand new world that doesnt feel a bit out of place with the rest of the game. If this is meant to be a testing ground for Monster Games going forward on this particular series, theres a lot of evidence on display here that DKC is in the right hands.If you missed out on the Wii version (shame on you), this is a great version of the game to check out. Youll take direct control over Donkey Kong across 8 worlds, divided up into a series of stages spread across an overworld map. There are plenty of secrets and collectibles packed into each world, with a difficulty progression thats natural and unrelenting throughout. It has a deserved reputation for being one of the hardest platforms released by Nintendo, infinitely more difficult than the majority of content found in the New Super Mario Bros. series that theyve directly developed. But if that difficulty caused you to toss the game aside on the Wii, theres a new, easier difficulty introduced on the 3DS that makes certain events, like mine cart riding, a bit more palatable.Its also worth noting that the game really shines with multiple playthroughs. I approach platformers with the mentality of blitzing through content as fast as possible, trying to unlock each world before revisiting stages and hunting down secrets or collectibles. Having played through Donkey Kong Country Returns on Wii, and then again here on 3DS, I think actually love the game even more now. Theres some incredible level design on display here, and while Retro is certainly responsible for the majority of that, Im really pleased to see that Monster kept all of that intact. And the new content that theyve introduced really is worth seeking out, even if you need to pass the hardest stages in order to advance into the new world.Not everything is perfect though. Theres a significant framerate drop from the Wii version to this, cutting down from 60 frames per second to 30. The loss is noticeable, particularly so if youre running through the time trial events and attempting to collect gold medals. It takes time to adjust, depending on how familiar you are with the game and its performance on the Wii. Its hardly a deal breaker, but something that DKCR vets will notice instantly. That said, it maintains that framerate well throughout, with only slight dips noticeable for me on the effect laden world 8.One big thing that people were looking forward to here was a Donkey Kong Country Returns without the forced motion controls of the Wii version. In the Wii game, you would turn the remote sideways, using the D-Pad for movement and the face buttons for running and jumping. But the roll ability, necessary to defeat some enemies and for longer jumps, was stuck to shaking the controller. It wasnt the best way to handle that ability, and one of the biggest negatives that most folks will call out on the original game. The 3DS version gives you the face button for rolling, which is certainly great, but the control scheme still suffers a bit.Here youll have two control set-ups, one based on the circle pad and the other on the D-Pad. With the circle pad your movement speed is simply tied into how far left or right youre pushing. And the rolling mechanic while using the circle pad is tied into both the X and Y face buttons. But the ability to blow on objects, used to uncover some secrets and to defeat a handful of fiery enemies, is also tied into those same face buttons, but activated only when ducking. Essentially this led to a handful of deaths that were certainly due to my impatience, but could have been avoided if these two mechanics were split into separate buttons, possible considering the B and A buttons arent even used.The other control scheme for the D-Pad was far more awkward for me. Here the roll buttons are tied into the left and right top buttons on the 3DS, which caused my hands to cramp up in an uncomfortable position, and it just didnt feel that natural. Also, the roll buttons still double as the button used to blow on objects or slap the ground. The grab buttons are tied into X and Y, and also add a run option to support the D-Pad movement. Basically, I wish there were more control options available, or at least something that would be fully customizable for the player instead of the two offered.Outside of those issues, this is a fantastic experience on the 3DS. The 3D effect is well utilized, to the point that youll believe Donkey Kong Country Returns was meant to be in 3D from the get-go. I noticed very little ghosting even with the 3D on full blast, but what you notice can certainly be managed by adjusting the slider to your preference. Its certainly worth keeping on throughout the game, especially for stages where background elements and hazards pour into the foreground, actually making it easier to predict some patterns and avoid danger.", "date": "May 31, 2013", "grade": "A-"}