{"name": "Fuse", "ref": "https://gaming-age.com/2013/05/fuse-review-for-xbox-360-ps3/", "text": "Insomniac Games makes their first multiplatform debut in co-op fashion with Fuse for the PlayStation 3 and Xbox 360. Thats right, the popular developers of Ratchet and Clank and Resistance have finally found their way onto a new platform, and while Fuse may not have the wow factor of its previous releases, it does offer a multiplayer experience that will please co-op fans of games like Left 4 Dead and Brute Force.In a not too distant future, an alien technology dubbed Fuse is unearthed and quickly becomes the target of a powerful weapons manufacturer as a potential way to rule the arms race. This paramilitary company is called Raven and they are attempting to steal the Fuse to create an arsenal that is beyond anything that the military has ever prepared for. The CIA has sent 4 elite agents from a group called Overstrike 9 to keep this all a secret and neutralize the threat by thwarting Ravens attempt to acquire the Fuse tech and stopping them from being the most deadly force on the planet.To say Fuse is the prettiest game that Insomniac has ever created would be a bold faced lie. Actually the visuals border on the bland for most of the game, but show signs and glimpses of brilliance in brief moments throughout. These visual feats come during climatic and story driven big moments of the game, which when they do rear their heads are pretty cool. These moments includes boss battles and new areas of exploration, but being that each level is a good 2 hours long, expect to see many of the same environments, cut scenes, and enemies from level to level until these big scenes arise. The character models for the agents are as generic as can be, but at least the voice acting and story events bring more character to these cookie cutter protagonists than meets the eye. One bright spot as far as the graphics are concerned is the game seems visually different from level to level thanks to the unique designs that will make each new mission feel original and not like the mission before, even if the gameplay doesnt change much.While Fuse is a shooter that can be played alone along with 3 A.I. partners, this is definitely a game that really should be played with 2 to 4 players. Not only is keeping up with your A.I. partners upgrades and whereabouts a chore from time to time, the levels, teaming system, and flanking of enemies is difficult to manage alone. To be successful in Fuse, 2 heads (or 4) are definitely better than one. Not that the games A.I. is atrocious as they do a fine job keeping themselves alive, reviving others, and doing a good amount of damage themselves, there are many instances where they are just out of position, or god forbid stuck on a wall trying to reach your position too often to say that they are flawless. This wouldnt be so bad if you could leap into the others while you are down and out of commission, but you can only leap from player to player when everyone is intact.When the game is played as promised, however, there is a lot more that this game offers than what it seems on the surface. Not only do you have a great team built engine that allows you to take enemies out by stealth, head on, or with heavy weapons, there are many multi-tiered areas that allow for gamers to make battle plans where splitting up into sections not only is advised, but is vital to your success. Toss in that each character is upgradable as far as XP is concerned along with the Xenotech weapons which are unique for each agent. These Xenotech weapons use the power of Fuse and they are not only necessary for survival, but produce unexpected and extraordinary results. If you are playing single player you will get to sample each of these weapons since you can switch on the fly, but if you are teaming up in co-op, you will want to know your personal game playing strength as each weapon features different abilities which includes cloaking, shielding, long rang attacks, etc. The rest of the arsenal is offered up for everyone to enjoy and can be interchangeable once you either reach weapon refill stations, or pick them up from a fallen foe.Fuse does suffer from slow burn as it takes a little bit into the game to find its hook. Once it opens up and gets going, the game can really grab you and you will want to see how the story unfolds with its twist, turns, and inventive enemies all the way through the 10 hour or so romp. Again this story can be played single player or up to 2 players offline or up to 4 online. Keep in mind if you are going it alone you will find frustrations with the A.I. that will leave you sometimes helpless and repeating levels due to positioning and just plain dumb A.I. maneuvering. This isnt to say you cant or shouldnt play alone, but this game is built from the ground up as a multiplayer game, much like Left 4 Dead. On the other hand Fuse is much more fun and accessible with a couple of friends and increases the games playability, fun and replay value. Whats more, once you complete the games core story mode there is a mode called Echelon that plays like a wave based horde mode for those who want to keep upgrading their characters and letting the good times roll.", "date": "May 31, 2013", "grade": "B-"}