{"name": "Sanctum 2", "ref": "https://gaming-age.com/2013/05/sanctum-2-review-for-xbla-pc/", "text": "Sanctum 2 is a sequel to the PC and Mac only title Sanctum which combined two popular genres  first person shooter and tower defense  into a single game. I was intrigued to see how these two gameplay styles would combine, and once I began playing, I saw that while the idea of the overall game is sound, it doesnt really do anything to hold the interest of the average player. If you are expecting an action packed FPS with the strategy of a good Tower Defense game, you wont stick around here for very long.Basically you can think of Sanctum 2 as a sort of horde mode game, like you would find in Gears of War, only not as intense. Once you being the game you are thrown right into an area with very little instruction on what to do and where to go. After a few minutes of wandering, you will find some weapons and process to the play field. At first it feels like a low-budget FPS, until you go to where your Oxygen generator is. Its this Oxygen generator that the aliens want to destroy, and you must set up some defense towers to prevent them from reaching it.Before the waves of baddies swarm your play field, you are given the chance to build up your defenses or upgrade an already placed sentry tower. You can also recycle towers and barriers to change the flow of the enemy waves to give you a better chance of making it through the attack. Some waves take longer to spawn than others, so you may have some extra time to set up a good defense. Other times, you may only have a few seconds to get ready so you may not have the back up you need, that is where you start running and shooting the enemies yourself to slow them down. Dont rely on any of the CPU soldiers you begin each area with to help, as they will die right after the first wave starts, and I mean immediately. They give the term useless a whole new meaning.After you survive about 7 to 10 waves of aliens, you move on to the next area and repeat the process again. In between the levels, you get a short storyline with comic panels depicting the 4 playable characters. The attempt at sticking in a story seems half-hearted as even after reading many of the panels, I didnt really understand who these people are, and didnt know why I was expected to care. Maybe it was from the fact that I never played the original Sanctum, but they whole story seemed unnecessary. There is an online mode where 4 players can set up defense and take on the hordes of aliens, but it was difficult to get a game going since the servers seemed void of players. The few games I did play were functional, but I was kicked out of play many times and had to reconnect. While the online worked for the most part, the game is more suited for a solo affair.While the gameplay in Sanctum 2 seems stale, the visuals are nicely detailed. So much so, that they will keep you playing for longer than you should. Everything from the environments to the aliens themselves all look really nice, and help you get into what little action there is. Sound effects are fitting for the presentation, with all the zaps and explosions youd expect from a game like this. There is an overall noticeable lack of music, with tunes playing only during a wave attack and most of the time you are surrounded by silence or the industrial sounds of building defense towers. Even though the visuals and sounds look and sound just fine, they arent anything that will get your blood pumping.", "date": "May 28, 2013", "grade": "C-"}