{"name": "Dragons Dogma: Dark Arisen", "ref": "https://gaming-age.com/2013/05/dragons-dogma-dark-arisen-review-for-ps3-xbox-360/", "text": "Over the course of reviewing Dragons Dogma: Dark Arisen, I learned a valuable lesson about why you should always keep track of flash drives with save files on them. Assuming thats what happened to my original Dragons Dogma save, which Im not entirely sure is the case. Either way, Im pretty late on the review train, but thats because I literally had to replay the entire core game included in this release, along with a chunk of the post-game Everfall content. While you can access the new area of Bitterblack Isle early on, its certainly not recommended.If you havent had a chance to check out Dragons Dogma yet, theres no reason to not buy this edition. Youve got the core game, the post-game content, all the DLC for the core game, and Bitterblack Isle as a new area. Theres not a lot of changes made to the original game via Dark Arisen, theres some slight adjustments made with items available in shops (no more buying Airtight Flasks), but by and large the changes arent so significant that those outside of the hardcore base will notice any change.Bitterblack Isle, a new area accessible via the initial town your hero originates from at the start of the game, is an area comprised of a number of locked off sections filled with the toughest enemies Dragons Dogma has to offer. Its very gear dependent as far as progression goes, and if you havent effectively farmed Everfall for post-game gear and weapons, youll hit a progress wall in BBI pretty early. Youll face most of the harder enemies introduced in The Everfall, like the Gorechimera, Hellhounds, and so on. And a few new enemy types like the Gorecyclops will appear exclusively in Bitterblack Isle.Other additions come from new weapons and augments, including a purification system that requires you to take cursed loot found in BBI and purify it in order to discover what you actually have. Purification costs are paid through rift crystals, giving a little more purpose to the currency than just buying higher level Pawns for use from other players. Theres also a new upgrade system for Dragonforged equipment, allowing you to upgrade marked items to a silver or gold level, further enhancing existing gear.I found myself enjoying Bitterblack Isle quite a bit, at least what Ive managed to uncover so far. Theres a lot of challenge in the new area, youll come across some ridiculously difficult combinations of bosses, but I found this area to be a massive improvement over what Everfall offered as far as post-game content. Everfall was a great idea marred by an awful navigation system, wherein you fell through a pit and needed to latch on to different entry points for various levels of the pit to explore. It was annoying and difficult to remember which level was which, until you already landed on one, making it a little more frustrating to explore than was necessary.Bitterblack Isle, on the other hand, plays out like a better connected, and vastly larger dungeon area. Youll be able to explore mostly at will, occasionally avoiding difficult encounters to snag keys thatll let you get past previously locked doors. I have a ways to go before I finish this bit of content, but I really love the exploration angle that Bitterblack Isle provides. It also smartly employs the use of unlockable shortcuts, allowing you to quickly backtrack to safer areas as you advance deeper in. And then theres a series of quests you can partake in for added incentive, available by a specific quest board once you arrive at the Isle.Theres also some incentive to double dip for previous Dragons Dogma owners with a significant save file boost. If the game detects a save file from the original game, youll get 100,000 rift crystals up front, and six full outfits for your main character and created Pawn. These outfits can be extremely useful throughout a significant portion of the main game, often outclassing most gear youll find or uncover. So if youre like me, and dont have your original completed save file, rent the original game or download a save file to use for the boost alone, and start a new game from there. Itll make retreading through old content go by a whole lot faster. Another big addition is the eternal Ferrystone, which has unlimited uses, making quick travel less of a headache here.", "date": "May 15, 2013", "grade": "A-"}