{"name": "Draw Slasher", "ref": "https://gaming-age.com/2013/04/draw-slasher-review-for-ps-vita/", "text": "Like Burn The Rope, Jetpack Joyride and Dragon Fantasy Book 1 before it, Draw Slasher arrives on the Vita after getting its start in the iOS gaming ecosystem. While that hardly constitutes a massive trend, it is enough to say that iOS games seem to follow three different routes of adjusting to the different platforms. Theres not charging a thing, releasing the game for free, and making money off of in-app purchases (like Jetpack Joyride); theres adapting things to the new platform, and getting around the awkward question of pricing and content by charging the same amount (a la Dragon Fantasy); and theres the Burn the Rope way of adapting, which is tinkering with a few things here and there, charging a few times more than you charge in Apples App Store, and hoping that people wont mind paying a PlayStation Store premium. As you can tell, Im not a fan of that last method  even if the game itself was still just as fun on the Vita as it was on my iPod.Im disappointed, then, to report that Draw Slasher follows squarely in Burn The Ropes footsteps: it changes a few things here and there (it adds a challenge mode, and itwell, thats pretty much it, unless youre a fan of newly-recorded voice acting), but the core game is pretty much the same as what youd get on your iDevice.That, by itself, isnt a bad thing, since the game was  and still is, for that matter  a blast to play, a perfect example of simplicity going a long way. You play as a monkey ninja mowing down rows upon rows of zombie monkeys, and thats all there is to it. Yes, you need to change your tactics depending on what type of zombie monkey youre facing down, but its core gameplay never changes too much. Couple that with a decently funny script and some lovely visuals, and its hard to find fault with the game itself.Problems arise, however, when you consider that youre paying three times as much for the Vita version as you would for the same game on your iPod/iPhone/iPad. I know, I know: were only talking about $2 versus $6, and its a sign of how much App Store pricing has screwed up peoples expectations that Im complaining about it. Nonetheless, its still the undeniable fact that the Vita version of Draw Slasher costs more, and its hard to see why.This is further compounded by the fact that the games campaign is only a few hours long, at most. You could certainly prolong things if you have an urge to climb up the leaderboards or get all the Trophies, but otherwise youre looking at a game that could realistically be beaten in one medium-length sitting.", "date": "April 25, 2013", "grade": "B+"}