{"name": "Hyperdimension Neptunia Victory", "ref": "https://gaming-age.com/2013/04/hyperdimension-neptunia-victory-review-for-ps3/", "text": "The world of Hyperdimension Neptunia Victory is a strange one. Imagine if the game industry was an actual living world with kingdoms governed by goddesses who are based on 4 top hardware manufacturers. Its a very clever idea that spins out a captivating story, but leaves a bit to be desired in the way of gameplay. Read on to see if this unique JRPG is worth your time, or is it descended to become another strange release that falls by the wayside. The 4 kingdoms are Lowee (Nintendo), Lastation (Sony), Leanbox (Microsoft), and Planeptune (SEGA), and as the story progresses you will learn about each ones trials and tribulations from the 20 or so year history of the kingdoms. Its a little too twisted to get into detail about every single portion of the story, but trust when I say you will enjoy its presentation and over the top Anime style. You take the role of Neptune, a bubbly sort of air head who had let her duties as a princess lag on. So much in fact that she has taken to just play around all day and not finish her daily tasks as the kingdoms CPU. Her little sister NepGear tags along and tried to keep Neptune focused, while her other friends (the goddesses of the other kingdoms) all are getting tired with her goofing off. Things take weird turns and after some pretty shady characters begin to interfere, Neptune gets plunged back in time to when their world, Gamindustri, was just starting out. At times the story can be difficult to follow, but the game never leaves you with a what do I do next feeling. If you do get confused, you simply follow the Event icons on your map and you are right back in to it. There is an option to skip through some portions of the story, but you may miss vital information and may feel disoriented. Personally, I mistakenly hit the fast forward button on more than one occasion since its very easy to hit while trying to get through some of the more lengthy text blocks. The writing here is top notch, and really keep you hooked with its pop culture references and some risqu humor that sneaks its way in at times. The main gameplay of HDNV is a 3D dungeon crawler. As you progress through the story, you will have to venture into an area to complete certain tasks. When you being, you can check your map to see where you are supposed to go (usually marked by an exclamation point) and fight through various enemies until you reach your goal. Some of the dungeons are sparsely populated so youll be running through open areas with no interactivity. The battles you do face are fun for the first few runs, but over time, they feel like a burden. They are necessary to level up and get money to buy new weapons and armor, just like other RPGs, but dont require much thought or strategy. Sometimes you can unleash a super attack that trigger animations that are fun to watch, but offer little relief from the slightly mundane battle system. To make the game a little longer, there is a quest system where you can complete tasks to level up your character or get special items. These quests dont add anything to the main story, but do help out if you need extra cash or experience. The quests also allow you to find special items you can use to upgrade or create new weapons you wouldnt normally find throughout the game, but once you create a new special weapon you still have to buy it as creating it only adds it to the shop in one of the kingdoms. These quests are largely present to simply extend the play hours of the game and their rewards offer little incentive to complete them. The other modes like the previously mentioned upgrade/creation system used with the quest system, are a little confusing with most players ignoring them completely. While everything works, gameplay does tend to drag on enough, that youll be hunting down the nearest save spot just to take a break. The graphics are a mixture of still anime pictures and behind the character 3D in the dungeons. Some of the stills contain little bits of animation, like blinking eyes and on occasion will move arms, but it mostly looks like a Flash Game on the internet. The 3D portions seem to look like a dated, early PS3 affair. The animation is okay, but nothing here is really eye catching, even the special move sequences look rough. Its not a complete mess, but this late in the systems cycle, you would expect more than what you get. Sound is the standard RPG fare with tunes that fit the tone of the universe youre in, and battle effects like you would hear in the oldest of Final Fantasy titles. Again, its nothing that will stand out, but isnt terrible. Every character is voiced well, (when they talk) with each English voice fitting the characters personality. Combine this with the great writing in the story, and you have something that stands out above all else.", "date": "April 22, 2013", "grade": "C-"}