{"name": "Giana Sisters: Twisted Dreams", "ref": "https://gaming-age.com/2013/04/giana-sisters-twisted-dreams-review-for-xbla-psn/", "text": "The Giana Sisters have a somewhat troubled past. While their story has gone unknown to most gamers, it is quite an interesting one. Years ago, The Commodore company approached Nintendo of Japan with a port Super Mario Bros. for the Commodore 64 Computer. Nintendo was on board and really seemed enthusiastic. After creating a working port, Nintendo, surprisingly passed on it with no explanation and ordered all of the work on the Super Mario Bros port to be halted and destroyed, so that any evidence of it would be buried. A short time later, Nintendo developed Super Mario Bros. for their NES console, and it became a household name. This did not sit well with some programmers who worked hard on the Commodore 64 version, so instead they decided to get back at Nintendo for axing the port. Thus, The Great Giana Sisters was born. It was a simple platformed that looked a lot like SMB, in fact, it was mostly just changed sprites and music. Nintendo did not like this one bit and sued Commodore for infringing on copyright. All copies of The Great Giana Sisters were ordered destroyed and not many people ever knew of its existence. Flash forward to today, and thanks to the efforts of Kickstarter, and Xbox Live Arcade (and soon PSN) we now can play Giana Sisters: Twisted Dreams, and while it is a huge departure from the original in graphics, its gameplay largely remains unchanged.Borrowing from games like Limbo or PID, this game does not have a stock of lives to worry about. You are dropped into a gorgeous world full of shiny gems and danger around every corner. With no lives, or even hints you are forced to learn from your mistakes until you make it to the goal of each level. At first it starts out easy, but as you progress the challenge gets tougher. In the Original game, players could control Giana in a one player game, or in a two player game, a second player could control Maria with alternating turns. Here, it is Maria that has been kidnapped by the nightmares and its up to Giana to rescuer her! Also, the original game had a few power ups that would turn Giana (or Maria) into a punk or hardcore version of themselves, or shoot bouncing energy shots at enemies. Twisted Dreams changes this with a sort of parallel world switch, that will turn normal Giana into Punk Giana, also changing the world around her. Each version of Giana has distinct skills that can help solve puzzles or reach seemingly unreachable gems and treasures. Regular Giana can twirl herself in a jump, thus slowing her decent while punk Giana can smash bricks and rocket boost over large gaps. You will be switching worlds a lot, since some platforms arent reachable, or act differently in both. Some of the more difficult puzzles, will have you switching world in the middle of jumps so you can progress, while others will have you switching to reach super size gems that unlock artwork in the gallery for later viewing.Boss battles are unlocked when you collect enough gems to unlock their areas, and most require quick thinking and skill to get past. Practice makes perfect, as after a few attempts their patterns will become obvious. The only sort of power up you can find is a shield which will allow you to take one hit before losing a life. It helps, but with the many deaths you will face with or without one it wont matter much. If you manage to beat all 20 levels, there are still more challenges to beat. Modes like Time attack which adds a timer to the levels for even more pressure, and Hardcore mode where you are expected to complete the entire game on one life. It does add to the replay value, but most gamers will give up after a few attempts.The visuals will be the first thing you notice here. The worlds, enemies and obstacles are beautifully rendered really add to the experience. The backgrounds in either world you play in are just stunning. Everything you will see seems to live a life of its own, right down to the flowers. While the visuals are a marvel, they can also be a hindrance, with deadly spikes, pits and unnoticed enemies may end you rather quickly. I lost many lives because I was unable to see a hidden thorn patch, or jumped for platform that was supposed to be used in the other world. While it was amusing at first, it later got to be a little annoying and made me rage quit on more than one occasion. While I dont blame the visuals for all of my deaths, there are quite a few areas that need to tone it down just a bit for easier progression.Both worlds have distinct music tracks that fit with the surroundings quite well. Regular Gianas world has a more upbeat music set, while Punk Giana is accompanied by a hardcore metal soundtrack. None of the tracks are really memorable, its just standard platforming audio that wont ring any bells if you hear them without the game running. With games like this, control is a giant concern, and its not without its issues here. Switching between worlds is seamless and works great all the time, but its little things like jumping or bouncing on walls that seem a bit flaky. Sometimes you will swear you pressed jump, only to see poor Giana fall to her doom. It can also take a few tries to land a jump or get to a higher platform that seems easy enough, only to have no response from the controls. While the control issues are largely minor, you will definitely notice them as you play through.", "date": "April 9, 2013", "grade": "C"}