{"name": "Terraria", "ref": "https://gaming-age.com/2013/04/terraria-review-for-psn-xbla/", "text": "Terrarias one of those games youll either love or find irredeemably boring. Those who like the game will be all over the fact it gives you a virtually wide open world in which to build and explore and be creative; those who are less fond of it will be turned off by its mundanity and its relatively non-linear gameplay.I, unfortunately, fall firmly in that latter camp. Its with some shame that I admit this. After all, saying you dislike a game that gives you the freedom to be as creative as you want is basically the same as admitting youre not that creative yourself. This may be true, but after playing the game for hours, Im ready to give up and give in to an inevitable conclusion: Terraria bores the crap out of me.Thats not entirely on me, though. Even though the game includes a lengthy tutorial that tells you most of what you need to know as far as gameplay goes, youre pretty much on your own after that. You can explore  and mine, and chop, and dig, and craft, and build  for hours and never totally figure out what or where youre supposed to go next. There are, of course, plenty of online tutorials that will tell you exactly where to go and what to craft next, but in a game devoted to giving players the tools and the freedom to explore fairly sizeable worlds, following a tutorial seems like it defeats the purpose.(Then again, I can hear the opposing argument in my head: Terraria gives you the freedom to play the game however youd like, and part of the joy comes from the simple acts of exploring and experimenting. Play it long enough, and eventually things become clear. Thats not my view, obviously, but I can see the argument being made.)My other major problem with the game is pretty straightforward: the core gameplay  digging and mining to extract the materials you need for crafting  is painfully dull. Again, I can see what Terrarias partisans might say about it: digging is there to encourage exploration, exploration is a huge part of what makes it fun, and anyone who just wants a straightforwardly linear game should look elsewhere. While Id agree with that last sentence, for me its the starting point: anyone who just wants a straightforwardly linear game should look elsewhere, because Terraria is all aboutnot just repeating the same actions over and over again, but holding done one button and very slowly moving you character in one direction or another. I hate to be so dismissive, but I just dont get the appeal of something so repetitive.Which is a shame, because  purely on a superficial level  the game looks and sounds highly appealing. The whole 16-bit SNES thing may be a little overdone these days, but Terraria captures the vibe of that era so perfectly that its almost impossible to not love its aesthetic. (Of course, considering its difficulty level, some might say that the game borrowed a lot more than the graphics of the late 80s/early 90s.)", "date": "April 8, 2013", "grade": "B-"}