{"name": "Gal*Gun: Double Peace", "ref": "https://gaming-age.com/2022/04/galgun-double-peace-review-for-nintendo-switch/", "text": "Gal*Gun: Double Peace is a Switch port of a PS4/PS Vita game that was originally released in North America way back in 2016. It brings with it all the DLC that was released, making this a complete version of the original game, which is in turn a sequel to the first game that was just dubbed Gal*Gun. At this point, its likely that youve heard of the game to some extent, it carries a certain level of notoriety to it due to its emphasis on scantily clad schoolgirls, mini-games that involve rubbing on barely animated models to excite them, and a whole host of crude, pervy jokes throughout the short time it takes to clear the game.What I didnt realize, and you may not either, is that Gal*Gun: Double Peace is essentially a light gun game, sans light gun. And when it comes to that concept, its actually almost fun to play. Its certainly not as tight or precise as a House of the Dead or Time Crisis entry, but it has some solid ideas that could honestly be adopted elsewhere in the genre. Granted, theres a whole lot of questionable content that is gonna be pretty hard for most to get past, but provided you are able to do so, you might actually get some non-sexual enjoyment out of Gal*Gun: Double Peace.As far as the sex stuff goes, Ill say that Gal*Guns anime ladies arent really my thing. I know that there are plenty of people out there that will be into it, but the weird rubbing mini-game that pops up occasionally as part of the story is just a little too much in my opinion, and the optional Doki-Doki mode you can activate thats fairly similar is just kind of corny overall.As far as the story in Gal*Gun: Double Peace your main character has been shot by a cupid, but shot too many times, and now needs to find true love by the end of the day or risk never being loved again. As a result of being drilled too many times by cupids bullets, your character is also endlessly attractive to every woman around him, turning all of his female classmates and teachers into enemies of a sort, who will swarm at him from different directions.Your character is equipped with a gun, granted to you by the inept cupid, in order to ward off the ladies as they rush at you from level to level. The whole experience is on rails, so youll be solely tasked with aiming, shooting, and occasionally choosing a direction to go when given multiple paths. Its fairly simple overall, especially if youre familiar with other on-rail light gun games, but its also a pretty fun time and individual stages dont overstay their welcome.In addition to shooting down the girls that pop around corners or from behind boxes and lockers, you can scan your environment using an x-ray vision mechanic in order to uncover hidden items or objects that will increase your overall score. Also, in between missions, youll get little side quests assigned to you, which will tell you to seek out items in different stages that youll again need to uncover using your x-ray vision. The side quest mechanic is probably the biggest thing that makes Gal*Gun: Double Peace stand out in comparison to, say, Area 51 (outside of the whole perv thing), and makes for a pretty solid reason to run through the game multiple times in order to collect everything you may have missed.In addition to side quest activities offering replayability, Gal*Gun: Double Peace also offers up multiple storyline paths to complete in order to fully finish the game. Running through one of these stories doesnt take much time, usually about 6 or 7 stages with a few acts for each stage. Most of which focus on romancing one or more ladies youll encounter throughout the game. When starting the game youll have the option to choose between a few of these paths right away, but more become unlockable as you choose different dialogue options or paths while in the middle of a story. While I cant really say that I got a lot of enjoyment from the story in Gal*Gun: Double Peace, I do like the idea of branching narrative paths in a lightgun style shooter, and its something Id like to see the genre play with in the future.One thing that I do want to point out before closing this review, is that I was bummed that there is seemingly no support for motion controls here. Considering the type of game Gal*Gun is, it seems like aiming and shooting with the joycons would be a pretty natural addition, but sadly youll be aiming with joysticks only throughout. There are some light touchscreen elements if youre playing handheld, but the lack of motion controls feels like a huge misstep with this Switch port.That said, I cant really recommend Gal*Gun: Double Impact overall. The subject matter is difficult to get past for most people, and its present throughout the game. The touching mini-games are weird, the pervy humor is rarely funny, and the fact that it all seems to take place with high-school aged teens is just a bit much. And its a shame, because theres elements of a competent light gun game here, but its buried under too much junk to glean any lasting enjoyment from it.", "date": "April 4, 2022", "grade": "C"}