{"name": "Jupiter & Mars", "ref": "https://gaming-age.com/2019/04/jupiter-mars-review-for-playstation-vr-ps4/", "text": "Jupiter & Mars is a new PlayStation VR title releasing today (Earth Day!), from development studio Tigertron in partnership with environmental organizations SeaLegacy and The Ocean Foundation. Developed from the ground up with VR support in mind, Jupiter & Mars puts players in control of Jupiter, a dolphin paired up with her mate Mars as they explore the ocean in a post-humanity world that has seen most of mankinds civilizations overtaken by the sea.So yes, theres a message at the heart of Jupiter & Mars, which is something that the game is definitely upfront with. Its also not a message you see broadcast throughout gaming very often, and as someone who certainly believes things are headed in the wrong direction currently, Im happy to see the subject tackled here. Its not overly heavy, and theres certainly enjoyment to gleam from the game regardless of the message, but swimming past notable landmarks now submerged, brushing past endless plastic waste as you swim around, and just pondering the thought of everything you know being washed away does make you pause and think while playing.Jupiter & Mars is primarily about exploration, with some light puzzle solving mixed in and a few additional, unique mechanics that make use of a tool set youd commonly associate with, well, a dolphin. As Jupiter, youll play from a first person perspective, (almost) always accompanied by Mars who swims around you until you give Mars a command to do something. As you explore the ocean, youll find other creatures in need of assistance, rocks or other breakable objects to shatter, and occasionally the odd power-up thatll allow you to revisit secret areas in earlier stages.For puzzle solving youll spend time looking for alternate entrances to different areas, tracking down power sources for the harmful wave emitting beacons that tend to block your path forward. Theres not much in the way of enemy variety, but the game isnt about combat, its more about pushing past and finding safe passage through various obstacles while taking in the sights.To aid in your exploration, Jupiter can emit sonar, working as a sort of detective vision that highlights the nearby environment in a brief flash of light. The world is already lit up with a neon-infused color scheme, but sonar helps highlight darker areas at varying depths, and also helpfully highlights the destructible objects you can command Mars to ram. Breaking objects in the game can be a bit underwhelming, only because they rarely seem to contain anything, and even then youre only gathering collectables. I reached a point towards the tail end of the game where I stopped breaking items altogether, unless it was an obstacle blocking my path forward.The use of the PlayStation VR is certainly a highlight here, with three different control options for playing in VR. You can opt to move the camera and control turning via the VR headset, in conjunction with the DualShock controller to move forward, backwards, or hit a button to do a quick 180 degree turn. Or, you can simply control the camera with the headset, and use the left analog stick to control your turns, either with a slow, gradual turn, or a flick style quick turn. Personally, I opted to just use the headset for camera control, and movement with the DualShock, as it became the most comfortable option over time. The ability to tap triangle to do a quick 180 is useful, but it never felt ideal when I needed to turn partially around. Id eventually hit a point where I was constantly craning my neck over to the side after a turn, and felt awkward trying to adjust my position when seated or standing.If VR isnt your thing, Jupiter & Mars is also completely playable without it. Its honestly a better looking game outside of VR, allowing the limited textures to shine a bit more, especially with the bright color palette at play here. Thats not to say the game looks bad in VR, but the hit in resolution does make a difference.Jupiter & Mars is accompanied with a fantastic soundtrack, something that fits the overall look and feel of the title quite well. The catchy opening title track provides an upbeat turn to what could be a dour narrative, but not in a way that undercuts the message being delivered. Its a soundtrack that would feel right at home in something like Rez or Child of Eden, which certainly seems intentional given the pedigree and background of the people who worked on this game.All in all, I certainly enjoyed Jupiter & Mars, and think its a PSVR title worth checking out. The environmentally friendly message being delivered is sound, the world is filled with interesting surroundings to explore, and the soundtrack is fantastic. The VR component is well done, but not mandatory for enjoyment. So if youre in the market for a new, unique PlayStation exclusive, Jupiter & Mars certainly fits the bill.Dutiful Disclosure: Gaming-Age has a historical connection with a member of Tigertron, Sam Kennedy. Sam was one of the founders for this website back in the day, but has not been involved with Gaming-Age for quite a while. I started as a reviewer with Gaming-Age well after Sam had moved on to other things too, but I want to make sure we disclose that within this review!", "date": "April 22, 2019", "grade": "A-"}