{"name": "Gears of War: Judgment", "ref": "https://gaming-age.com/2013/03/gears-of-war-judgment-review-for-xbox-360/", "text": "Gears of War: Judgment marks the first game in the series that isnt developed by Epic Games, with Bulletstorm developer People Can Fly taking over for the popular third-person shooter. Its also the first game in the series to not feature Marcus Fenix as the lead character, instead focusing on Baird and his exploits as leader of Kilo Squad.But if youre expecting some grand departure from the typical Gears of War experience, youll either be pleased or disappointed with the knowledge that it doesnt make any grand, sweeping changes to the core formula. Theres definitely adjustments made to both the campaign and multiplayer, but youll still be roadie running around broken down environments, popping up behind cover to shoot at Locust, and occasionally dumping a grenade into an emergence hole. If youve enjoyed Gears of War up to this point, theres a good chance youll have some fun with Judgment.The story revolves around Baird and Kilo Squad, and takes place in the past, about 30 or so days after Emergence Day. Most of the game is focused on Halvo Bay, described by Director of Production Rod Fergusson as Gears of Wars version of San Diego, a large, upscale coastal town that gets hit hard during the war. Things go south quickly for Baird and his squad, which in turn leads into the big trial thats pretty much the focal point of the game.The story revolving around the trial wont be spoiled here, but the campaign is structured as a series of flashbacks to the events leading up to said trial. Baird, Marcus Cole, Garrus Paduk, and Sophia Hendricks make up Kilo Squad, and youll take control of each character at various points in the campaign. While the game is certainly focused on Baird as the main character, everyone gets some time to shine, and the story actually does a decent job of building up the newer cast as potentially intriguing characters.I found myself slightly disappointed in the fact that the overall plot doesnt really tie into anything significant from the previous titles. Maybe there was some additional content or nods I was missing that might be covered in other Gears media, but overall this prequel is pretty self-contained.The only real nod to the rest of the series comes from the playable Aftermath epilogue, which happens during the events of Gears of War 3, when Baird and Cole split off from the team to find a boat prior to the invasion of Azura. This helps to tie Judgments narrative in with current events, but is shoe-horned in. Its a fun sequence to play through, but its oddly structured, considering its only accessible via the menu and only after youve unlocked it by meeting other requirements through Judgments campaign. It feels sort of like DLC that you dont have to pay for or download, and should have been weaved into the campaign in a cleaner fashion.However, there are areas where the standalone story aspect works to benefit Judgment. Since Kilo Squad isnt trying to save the world, instead attempting to save or deflect the invasion of a single city, youre getting an experience thats more similar to the original Gears of War than any of the sequels that came after. As much as I like Gears of War 3, I cant help but feel that the series lost a little character with each installment, focusing and bigger scenarios with each sequel. Judgment brings the universe back to a point where humanity still felt it had a chance in the war, the Locust were still largely unknown and mysterious, and it feels like a more interesting world because of it.As far as new mechanics go, there are a couple of things introduced by People Can Fly that I really enjoyed. One of those new concepts is the use of optional Declassified missions, which can be activated at the start of most areas. When you activate a declassified mission, youll change the upcoming battle for that area in a variety of ways. Sometimes a time limit is imposed, while other scenarios will restrict the types of weapons available. Some of these missions repeat themselves with small variations, but theres enough variety here to keep them enjoyable. Theres the added benefit of increasing your score at a faster speed, shown in-game through the use of a star gauge that slowly fills with each kill, headshot, ribbon earned, and execution given. These stars in turn unlock other things, like multiplayer characters and the aforementioned Aftermath epilogue.Another big feather in Judgments cap comes from the use of dynamic spawns. I can only think of a couple shooters that have used a similar idea before, but Judgment employs the concept well, and itll be sorely missed in every shooter that doesnt use it going forward. Dynamic spawns mean enemy waves will constantly change, whether thats from reloading at a checkpoint or revisiting a completed sequence at a later date. This keeps the experience fresh regardless of how many times youve played a sequence. It also helps curve the difficulty for everyone, without taking anything away for the hardcore player.For those of you more interested in the multiplayer portion of the game, my limited time with the handful of versus modes in Judgment was sort of a mixed bag. On one hand, modes like Free-For-All and Team Deathmatch are still a lot of fun, and remain staples of the series. I actually liked most of the new maps, and found that the pathways were plentiful, and that the majority were built smartly around the trademark cover mechanic.But the two objective based modes didnt do a lot for me. OverRun is definitely the better of the two, stealing a page from the co-op Survival mode. But instead of playing against A.I. controlled waves of Locust, youll face off against player controlled Locust characters in a three round structure. Domination is a multi-point control mode, similar to other shooters like Call of Duty that literally use the same name for the mode.These four modes, and the limited map variety, dont really cut it. Im sure theres some DLC right around the corner for maps, but unless the mode selection gets strengthened, I cant see myself spending an incredible amount of time with the multiplayer side of Judgment. OverRun isnt bad, but the experience gains are slow and I feel like the Locusts are ridiculously overpowered in comparison to the four classes of Cog soldiers you get. Domination gives Team Deathmatch some added incentive via goals, but again, Ive played this mode a million times over in other games. I really enjoy the uniqueness of the combat provided by Gears of War, but Judgment feels sort of lackluster in that department.Also worth mentioning is that both online and offline play could use a little more polish. Lag was a bit of an issue online, with the occasional player teleporting during a fight. Granted, this is on a pre-release server but it didnt make a good impression. I cant imagine that filling those servers with lots and lots of people come Tuesday is going to be better, unless something is patched or changed. On the plus side, matchmaking isnt an issue, and I never found myself being dropped from games in progress unexpectedly.For the campaign I didnt have anything that was necessarily game-breaking, but I did have to restart a couple checkpoints due to enemies not spawning, or literally getting stuck in something that I couldnt shoot through. The worst example was during a sequence where I needed to open a gate by turning a wheel, and after opening it slightly I was bombarded by Locust. A Corpser showed up in this fight, but when it burrowed underground it never came back up. I could hear it making noise, but had no way of seeing it, much less attacking it.Framerate also seems to take a dive in the campaign anytime things start to get hectic. Its not a huge loss, but noticeable enough to realize the world around you has slowed down. And the frequent checkpoint saving can cause the action to hitch up too, but generally doesnt happen during combat.", "date": "March 17, 2013", "grade": "B-"}