{"name": "Phantom Breaker: Battle Grounds", "ref": "https://gaming-age.com/2013/03/phantom-breaker-battlegrounds-review-for-xbla/", "text": "In Japan, Phantom Breaker is more of a household name. With a Manga series and 2D fighting game for Xbox Live Arcade, many players are familiar with the strange characters that populate this bizarre world. In the US, however, Phantom Breaker is relatively unknown to most, which makes Division2s decision to bring a spin-off to the US instead of the main game strange indeed. It seems that this decision may have paid off, since Phantom Breaker: Battle Grounds is a fun and unique side scrolling beat-em-up that may be the best way to introduce the property to the US.If youve played the fantastic Scott Pilgrim vs. The World game, then you pretty much know what to expect here, as Battle Grounds borrows heavy from that title. You select your Heroine, and proceed through a barrage of strange enemies blocking your path. Combos and special moves at your disposal, you eliminate the waves of baddies that are in your way.As the story moves on, you learn that there is a parallel world of demons that is trying to invade the human world. One of your friends has been taken to this demon world and you set out to rescue her. The characters you can use are not helpless in their efforts. Each one possesses unique skills and powers to help you power through the biggest of enemy waves. Each girl can be leveled up and given new skills to help you along. A one on one fight between your character and a demon world inhabitant (a Boss fight of sorts) happens occasionally which sometime can be a little unfair if you havent leveled up properly. You can level up each character to 50, and you will no doubt reach that cap quickly as the game progresses.Battle Grounds uses a simple control layout with weak, medium and strong attacks with special moves like evade and a super move added. Once you collect enough power from fallen enemies, you can unleash Super Attacks that will dominate the horde surrounding you. It can be very satisfying to unleash it when all hope seems lost to win, and breaks up the button mashing that you will be using throughout. You can jump between the background and the foreground to fight, which can bring a little relief if you are getting slammed or if you need to grab extra EXP and coins. I never strayed from mashing buttons myself, since I saw no reason to. I managed to send enemies flying around the screen with little effort and continued to do so even in the later levels. While the simple controls are nice, it can get a little monotonous even with the little break you get while fighting an area boss.Online modes are a big plus for games of this type, and Phantom Breaker: BattleGrounds has them. Sadly, they are riddled with lag and time outs, making a good co-op game difficult to get going. Even the multi-player battles were hard to complete in my trials, as there was simply too much lag to enjoy them. While I did manage to squeeze some enjoyment out of my co-op games, I didnt stay with it for very long, and found myself playing offline much more. If they fix the online code here, I could see a very enjoyable experience, but for now its a low point.Graphics are a mix of classic 16-bit and 32-bit styles, with the character graphics looking like they were ripped from a late 90s Super Nintendo Game. The backgrounds you fight in remind me of the classic Sega Saturn game Guardian Heroes, with its colorful and detailed settings. Sound effects are crisp but sometimes can get on your nerves the longer you play. The cutesy high pitched tone of the player characters really begins to irritate the hundredth time you hear them scream. Its to be expected with a franchise like this but thankfully it can be adjusted on the options menu. Music is a great collection of chip tunes that sound like the classic 8-bit melodies of yesteryear, and really mix well with the flow of gameplay.", "date": "March 13, 2013", "grade": "B+"}