{"name": "Fuel Overdose", "ref": "https://gaming-age.com/2013/03/fuel-overdose-review-for-psn-pc/", "text": "Ill be blunt: Fuel Overdose is bad.Actually, thats understating things. Fuel Overdose is terrible. Like, so terrible it might just be the worst game Ive ever played. Its certainly worse than any game Ive played in recent memory  and in the last year Ive played Page Chronica, Men in Black: Alien Crisis, and 007 Legends. In a nutshell, this is an ugly, glitchy, mind-numbingly boring, joyless slog of a game.Honestly, there are so many things wrong with Fuel Overdose I dont know where to begin. Bad graphics? Wonky controls? Random glitches? Any of the countless minor annoyances sprinkled throughout the game? Theres such a wealth of awful, awful options that its like drinking from a hose at full blast.Ill just pick one at random: saythe controls. At first I thought I was having trouble navigating my vehicle through the top-down course because Ive always struggled a little with isometric racers. After playing through several (of the completely unengaging) storylines over many hours, and still finding it a battle to keep my vehicle going in anything resembling a straight line, Im starting to think the problem is less with me, and more with Fuel Overdose and its habit of making your vehicle randomly flip over, or do 180 degree spins, or any of the many other things it does to make your car impossible to control.Which reminds me: this game is, possibly, full of glitches. I say possibly because the random spins and flips might be intentionally built into the game. If thats the case, its a forgivable  if annoying and a little bizarre  design choice. Im a little less charitable in my reading of the times when my car suddenly started racing beneath the street, or when a random spin sent me flying off the road and the game kept resetting me on top of the same hole. Im pretty sure thats a case of the game just not working properly, and considering how long Fuel Overdose has been in development, theres just no excuse for that.Also inexcusable: the games graphics. First and foremost, the cars are all basically giant blocks. This, of course, explains some of those aforementioned seemingly random spin-outs; after all, when you cant tell which direction your vehicle is facing because the front and the back look identical, its easy to get confused. The problem is less pronounced, of course, when youre talking about some of the larger trucks, but those can take awhile to unlock  and considering the frustration that will surely come from anyone trying to navigate the indistinguishable little blobs during the games early stages, I cant imagine anyone wanting to invest time and effort to make it to those larger vehicles.Other graphical annoyances abound. When the cars crash into each other  a fairly common occurrence, seeing as Fuel Overdose is a vehicular combat game  they become difficult to make out. Couple this with the fact you can barely tell the fronts of the cars from their backs, and you have a recipe forwell, the kind of annoying controls Ive already mentioned. And, on a completely separate graphical note, theres one track in which a portion of the road is flooded. At this point, it should almost go without saying that the water doesnt look anything like water. A more accurate description would be shimmering nothingness, which, while artsy-sounding, is presumably not what the game designers were going for.", "date": "March 5, 2013", "grade": "D-"}