{"name": "Naruto Shippuden: Ultimate Ninja Storm 3", "ref": "https://gaming-age.com/2013/03/naruto-shippuden-ultimate-ninja-storm-3-review-for-ps3-xbox-360/", "text": "Naruto Shippuden: Ultimate Ninja Storm 3 marks the third entry in the series for current consoles, after the somewhat lackluster stop-gap title dubbed Generations that was released around this time last year. Lackluster in that it didnt really capitalize well on deserved praise heaped upon its predecessor, Ultimate Ninja Storm 2, opting to ditch some of the bigger than life boss battles in favor of a more traditional fighting game set-up. Honestly, the spectacle is one of the things that I enjoyed most about UNS2, and having that sort of thing ripped out with Generations just didnt do it for me.But thankfully UNS3 doesnt suffer from that same mistake. There are still a few missteps here, but this is definitely what I was looking for in a sequel to the second game. CyberConnect2 continues to show a certain level of mastery when it comes to making those dreaded QTE sequences that usually bring down other games, with an awesome sense of style previously delivered by UNS2 and Asuras Wrath which they developed for Capcom.Also, the cel-animation style given to the 3D models for the 80 plus characters that make up the playable roster is top notch, delivering some of the best graphics in that style. In my opinion it tops the work done by Level-5 in the recent Ni no Kuni for PS3. Granted, the backgrounds and environments featured might not be as bombastic or spectacular, but theres no denying that the characters featured here look great and are superbly animated.As far as playable modes go, the game gives you about the same set of options as previous entries in the series. The crux of the single player experience is found in Ultimate Adventure, which kicks off with the attack on the Hidden Leaf Village by the Nine-Tailed Fox, an event that really drives home the spectacle missing from combat in Generations. That battle really gives you a great sense of scale, and as far as giant boss fights go, is really a lot of fun.From there the storyline picks up after the events of Ultimate Ninja Storm 2, and proceeds through The Fourth Great Ninja War, catching up to and I believe exceeding the storyline currently covered by the anime. How these events compare Im not entirely sure, Ive dropped out of the current Naruto Shippuden series a year or so back, but if youre not caught up the game certainly delivers a lot of narrative in between fights. In fact, Id say it goes a little over board at times, with one particular cutscene in the fourth chapter of the game lasting well over half an hour. Thankfully if you find that content boring, or if youre already up to speed, you can skip through these scenes at any time.One area that Ultimate Ninja Storm 3 does doesnt do well is the free roaming segments that pop at various points. There are a handful of locations composed of a few different screens where you can move around and explore your surroundings. The initial location is the Hidden Leaf Village, covered in various Naruto games already. But the content featured in these sections is virtually non-existent, offering up a handful of NPCs that deliver one or two lines, a shop or two to purchase materials to take into combat with you, and a few save points. Theres a couple breakable objects scattered about, which can contain a blueprint to unlock new gear in the shops, and the occasional smattering of Ryo (currency), but by and large most of this material is trivial.The blueprints would have been better handled as rewards for winning fights, and the Ryo you find is nothing compared to what you win after a battle. The storefronts also seem like something that could have been relegated to a menu, and exploring these sections is generally bland since the majority of the areas are composed of single roads or outlets. Certain sections will have you literally run a straight line in order to trigger the next event, with no other purpose. And really, all these sequences do is make you sit through some sort of loading screen when this bridge could have been gapped by excising the free roam moment completely.Theres one aspect of free-roaming that had the potential to be interesting but was rarely used. There are sequences present where you can control your character and actually engage in limited combat against what you might think of as trash mobs, unnamed ninja or other foes. Your abilities are downgraded here, meaning that your combos and other skills arent as fleshed out in comparison to the larger one on one fights, but these sequences do provide an interesting break in the action. But theres so little of this present in the game that it might as well be non-existent.The actual combat system featured in the regular one on one battles is just as fun as the previous entries, and easy enough to pick up and play for just about anyone. The majority of your combo strings involve tapping the primary attack button various times, but the ability to use a Substitution Jutsu in order to disappear and reappear, usually behind a foe, makes combat feel very unpredictable and exciting. Other functions, like building up Chakra to load up special ninjutsu attacks, or the devastatingly spectacular Ultimate Jutsu finishers are handled in an identical fashion to the previous games. The Support Drive mechanic returns here from Ultimate Ninja Storm 2, giving you the option to use two characters as AI controlled teammates that can be called in to attack provided they havent been used recently. These characters now come with their own health gauges and can be knocked out of a fight permanently, and they also offer up a number of unique combos that set them apart from one another.One of the big returning features, for me at least, is the epic boss battle sequences. These moments are peppered throughout the Ultimate Adventure mode, and while they dont always appear as end of chapter events, when they do occur they tend to be quite memorable. When youre in one of these encounters, during the fight things will transition to what appears to be a cutscene, with a star counter that appears overhead, grading you on how quickly you input a series of button presses and movements during this sequence. The prompts do a great job of not taking your eyes off of the action, and often mimic the on-screen fighting, making the QTE effect a little more meaningful. But the real winner here is just seeing the crazy stuff that happens during these moments, making each fight feel like a significant pay-off at different intervals throughout the game.There are other new features in place too. One of these features is the ability to choose a Legend or Hero path at different points in the story. Essentially youll come to some key moment or decision, and be able to take a more difficult path through the Legend option, or can take it easy by choosing Hero. The end result is typically the same, but there is a chance that youll make some alternate impact to the overall timeline, which can be revisited at any point via the menu option. Its a neat idea in concept, but I found that it really didnt do anything as significant as it seems to indicate. The biggest thing gained here is points that earn you levels, which in turn dictate the type of equipment and tools you can bring into a fight. This gear is divided into Legend and Hero categories, but I honestly think this concept is a little to convoluted and bloated, with the differences in Legend and Hero equipment feeling negligible at best. Outside of the Ultimate Adventure mode, you also have the option to engage in offline one on one fights or create tournaments for 4 to 8 players. In addition you can take your game online and participate in both Ranked and Player matches. The roster available is dictated by what youve unlocked through Ultimate Adventure, making it worth your time if youd like access to everyone featured. The roster is a pretty significant group of characters, and while a number of slots are filled with the same face in either different clothing or different forms, there are a lot of unique first time entries for the series as well. Online mode seems pretty solid, I didnt have a chance to play much prior to launch, but what I did play seemed to have little in the way of connection or lag issues. I do wish that the search options were a little more than the ability to search by rank or region, an option to sort by connection strength would have been a big plus.One other thingworth mentioning is that the performance of Ultimate Ninja Storm 3 was generally fine, but youll experience a bit of slowdown anytime theres more than a few characters involved in a battle. This becomes way more noticeable if both players start dropping both support characters at once, which might not happen often, but when it does prepare yourself for a big dive in framerate. Its not game-breaking by any means, but its something that I wish had been cleaned up a bit more prior to launch.", "date": "March 5, 2013", "grade": "B"}