{"name": "Metal Gear Rising: Revengeance", "ref": "https://gaming-age.com/2013/02/metal-gear-rising-revengeance-review-for-xbox-360-ps3/", "text": "Its true that Platinum Games is no stranger to the action genre, with their excellent Bayonetta far behind them, and with the upcoming sequel thatll land exclusively on the Wii U. And while Bayonetta certainly had the bonus of Hideki Kamiya as game director, Risings own director, Kenji Saito, gives Kamiya a pretty good reason to up his game with this Raiden focused romp through the world that Kojima built. I wont go so far as to say that it surpasses Bayonetta, not quite, but it certainly borrows familiar and useful elements, while introducing a handful of new concepts that make this title stand out as unique.The only real significant shortcoming Ill level at the feet of Metal Gear Rising is the laughable, often inane plot. Say what you will about the Metal Gear series from a story perspective, which can certainly be accredited with its own set of issues, but Rising really gives anything seen in the Metal Gear universe to this point a pretty good run for its money. This doesnt become evident until the last quarter or so of the game, which includes one of the most out of left field boss fights youre likely to encounter. Seriously, youll need to see it to believe it, but I imagine its not anything that youd expect.But whether you enjoy or dislike the dumb, loud action provided by the script, I find it hard to believe that you wouldnt fall in love with the well-crafted gameplay that fills the void between cutscenes. Its a remarkable experience for a number of reasons. One of which is the fact that the game is surprisingly accessible for Metal Gear fans that maybe arent the best at combo based action titles like Rising, or the aforementioned Bayonetta. The normal difficulty setting is relatively easy, certainly for the more advanced player, but does a pretty great job of easing you into the game while still constantly wowing you with incredible sequences and encounters. Even if youre not an action game bad ass, youll definitely feel like one by the time you finish the first chapter. And thats a great feeling to evoke for a game like this, as it keeps you compelled to continue whether you know what youre doing or not.But new players will hit a bit of a wall when theyre introduced to the first real boss of the game (after the initial prologue), which will force you to learn Risings all important parry system. Its easy enough on paper; simply tap the direction an enemy is attacking you from on the analog stick, along with the normal attack button. If timed correctly youll push back against a foe and open up an opportunity for a counter-attack. If your timing is off a bit, youll simply block the attack, provided its blockable to begin with. This singular mechanic becomes the crux of advancing through a lot of the game, and becomes especially key when facing off against the challenging bosses that Rising throws your way.The parry function does become a little harder to use when youre surrounded on all sides by foes that are stronger than your average PMC cyborg. As the game tosses harder and harder enemies your way, youll find yourself fighting against the camera a bit, and trying to parry a blow from a foe that you cant adequately see on-screen can oftentimes be frustrating. For the most part its fine, but there are definitely points in the game where you get confined in smaller spots and the camera becomes nigh impossible to position just right, leading to some unfortunate moments that could be avoided if the camera would just pan out a little further from Raidens back.But again, and I want to emphasize this, Metal Gear Rising: Revengeance is just a whole lot of fun, despite some camera quibbles that impact that parry system. Raiden is given a fair number of moves to perform from the onset of the game that are easy enough input-wise to pick up quickly, and use effectively. When you start to toss in all the upgrades, not only to things like health and weapon strength, but additional weapon types and move sets for those weapons as well, youll find a decent amount of depth hidden behind the flashier side of the game. I do wish that there was an easier way to swap between newly acquired weapons than backing out to the main menu, at least to swap out one weapon with your standard HF Blade, as it is now it can be a little clunky if you want to try out a different weapon in the middle of an intense fight.Also worth noting is that the level design of the 8 stages that make up Rising are actually well suited to combat, and oftentimes provide you with some alternative ways of tackling fights. While the game certainly doesnt emphasize stealth often, youll be surprised to find that you can sneak around foes, and are sometimes rewarded for doing so. If you can get behind any enemy in the game without catching their attention, you can also perform a one hit kill, which can be a godsend on some tougher foes. It doesnt seem like it would be possible to do a no-kill run like a typical Metal Gear title, but you can certainly opt to play the game differently than just wading into the middle of a group of enemies and slashing everything in sight.But if you prefer to just hack your way through the game, that can be a lot of fun too. Metal Gear Risings inventive Blade Mode never really gets old, and considering that youll use it a whole lot throughout the game, thats saying something. On weaker enemies it can be used outright, but on tougher foes it becomes a tool for disabling them by cutting down legs, arms, and armor. Most boss encounters will trigger a Blade Mode moment for you to respond to, allowing you to take advantage of a temporary weakness. It also gives you the option to use the powerful zan-datsu technique, which allows you to rip the inner workings from cyborgs and instantly replenish your health and Blade Mode meter, a tool that is incredibly useful on harder difficulties.Finally, Metal Gear Rising: Revengeance offers up a lot of reasons to play the game over and over again. Theres a host of unlockables, some of which are only accessible once you finish the game. Each stage is divided up into combat sequences that are ranked on an S-Class scale, much like Bayonetta. There are even hidden sequences that you can miss in most levels, requiring you to scout through a stage and find the encounter instead of simply rushing through it. Most stages often contain a handful of collectible items, and power-ups that go towards your BP tally, which is used to buy new skills for Raiden.", "date": "February 19, 2013", "grade": "A-"}