{"name": "Fist of the North Star: Kens Rage 2", "ref": "https://gaming-age.com/2013/02/fist-of-the-north-star-kens-rage-2-review-for-xbox-360-ps3-wii-u/", "text": "Fist of the North Star: Kens Rage 2 is the first follow-up game in the series that debuted from developer Omega Force and publisher Tecmo Koei back in 2010. Dynasty Warriors fans will feel right at home with both the content and gameplay featured in this sequel, as Omega Force has certainly put some effort into making this particular series fall in line with their other known works. That means this is a bit of a departure from the slower, deliberately paced experience of the first game, sacrificing some of the depth found in combat there in favor of a lighter, quicker style of gameplay for the sequel.And I dont find that to be a bad thing. The original Kens Rage was a pretty great representation of the popular anime series, featuring the majority of the story content and cast, focusing on combat, signature moves, hyper moves, and the one on one boss encounters that ended each arc. While the combat in Kens Rage 2 is certainly simplified in the sequel, much of the excellent presentation remains, and is even expanded upon. The story sequences are cut into comic book panels, representing limited animations of the 3D models used by the game, faithfully recreating familiar scenes for manga and anime fans of the series. These sequences are generally focused on the action bits, building the stage for boss battles and epic encounters, but you still feel like youre getting far more information here than the scant offerings of the original.But the sped-up combat is a welcome change. Ken, Rei, Mamiya and the other characters youll get to control all move at a decent clip, making stage progression less annoying and cumbersome. The ability to jump has been dropped in favor of a dodge mechanic for all characters, which can be timed against enemy attacks to perform counter-attacks, which have a tendency to disable or stun foes. Combo strings are built around two attack commands, normal and strong, and feel very similar to the strings found in other Dynasty Warrior like titles. Most combinations lead to flashy, crowd clearing attacks, giving that appropriate oomph to the combat fans have come to expect.Level design has also been simplified a bit, which is a disappointment. Theres not much in the way of hidden content in each stage, outside of an occasional breakaway wall or hidden chest. Instead youll just be running from point A to point B, clearing a certain number of enemies, triggering an event scene, and occasionally fighting a boss. Its the weakest aspect of the game by far, and even pales in comparison to the open-ended nature of titles like Warriors Orochi 3 or Dynasty Warriors Gundam 3. It could certainly be expanded upon greatly for any sequel in the series, and is certainly one of the aspects Id like to see revamped in the future.Visually the game captures the unique art style of manga illustrator Tetsuo Hara quite well, which carries over from the original game. The appropriately beefy, hyper-masculine look lends itself well to a 3D world, and without the use of cel-shaded design typically found when adapting anime to a video game nowadays. Characters also sound appropriate voice wise, but admittedly my ability to understand Japanese is non-existent. The subtitle work is fine though, devoid of any noticeable spelling errors or inconsistencies that I could spot. And the soundtrack, while often repetitious, is catchy and laden with the sort of rock/metal mix that fits the desolate world of Fist of the North Star well.From a content perspective the game is filled with a fair amount of gameplay spread out across three primary modes. Legend mode runs a player through the story bits of First of the North Star, and seems to capture most of the notable moments found in the series, covering a bit more material than what was found in the original. Of course, if youve played through the first game, some of the story moments are going to be redundant, but the levels and boss fights feel wholly unique in comparison to the first title.Dream mode also returns for the sequel, giving you access to characters both playable and not in Legend mode. This means youll be able to take control of a lot of villains and bosses, which feature their own move sets, unique mechanics, and so on. Both characters in Dream mode and Legend mode can be further customized through the new scroll system, which allows you to equip found scrolls to boost your core states of strength, health, technique and so on. You can equip five scrolls at a time, and each scroll can contain three individual upgrades a piece. If you line up matching upgrades youll get an enhanced boost and access to an active skill that can add a variety of bonus parameters.Each individual skill, regardless of what scroll is equipped, also levels up as you play through either mode for every character. When you defeat enemies youll collect experience orbs, and depending on different criteria met during combat, that experience will boost your various stats. While its an interesting way of building up a character beyond a simple leveling system, the game does a poor job of giving the player enough information to know how each skill is really progressing. While the skills are color coordinated, collected experience orbs are not, and theres zero on-screen indicators that let you know if youre close to leveling a skill, or how much experience it will take before you hit that threshold. Id love to have some sort of optional UI functionality for this, and if the system is retained for the next game hopefully this option is considered.The third mode offers online play for 2 to 8 players. Theres co-op for Dream mode, allowing you to run through any unlocked stages with available characters by pairing up with a friend or random online partner. Then theres a 4 to 8 player competitive team based mode, which pairs you up with others and gives you a handful of maps to choose from, with various objectives to tackle on each map. Its not a straight up versus mode of any kind, youre not going toe to toe with the other characters, but are instead earning points based on completing objectives in order to come out on top. An added benefit to both methods of online play is access to stronger scrolls both as rewards and random drops, which can carry over to your Legend mode as well. Online play felt pretty smooth, but I did have some difficulty locating other players unless I hosted my own room. Even then, filling out player slots was a little time consuming, so I imagine the initial week player base is a little small.", "date": "February 11, 2013", "grade": "B-"}