{"name": "Strike Suit Zero", "ref": "https://gaming-age.com/2013/01/strike-suit-zero-review-for-pc/", "text": "Growing up as a Star Wars fan that also enjoyed a lot of video games, it was pretty natural that I gravitated towards games like TIE Fighter and X-Wing vs. TIE Fighter on the PC. And for the sake of this review, you can toss Wing Commander in there for the Mark Hamill involvement, but to a lesser degree. These games were my first introduction to any sort of space faring dogfighting action title, and to this day are pretty much the pinnacle in that short lived genre. This title, Strike Suit Zero, looks to bring back the heyday of space combat to modern PC gamers, and for the most part does a decent job of it.Its not a flawless experience by any means. Strike Suit Zero has a number of issues that well go over in a minute, but all in all it does manage to evoke the style of the classic PC titles its trying to aim for. First and foremost, for me at least, are the controls. The game supports mouse and keyboard, joystick, and gamepad configurations, all easy enough to pick up and play. I preferred mouse and keyboard, I think it offers up the most precision when it comes to your run of the mill dogfights, but any of the aforementioned methods seem to work well.What really helps is the overall simplicity of the controls. I know theres a group of players out there that would love to see every damn key on the keyboard used when it comes to any game that involves flying, but thats certainly not the case with Strike Suit Zero. Aiming and shooting down opposing fighters is as easy as moving your mouse left to right, or up and down, and tapping the left mouse button for regular fire, while holding down or pressing the right button for missiles. You can swap between weapons on both sides of the fence with a letter key assignment, speed up, slow down, and initiate rolls with keys that bind to your typical WASD configuration found in most shooters. Thats about it going in, and makes this a very easy experience to pick up and play regardless of your experience.But Strike Suit Zero isnt an easy game, which is both a boon and a curse to the game. I love that the actual ship to ship combat is both strategic and downright difficult. When you try to go against enemy fighters youll have a hell of a time keeping up. Theyll bob, weave, and circle around you often, making it hard to keep a bead on them for anything more than a handful of seconds. Theyre not exceptionally smart in this regard, in that they wont often take advantage of your mistakes by punishing you with fire from behind, but theyll at least move out of the way if youre shooting at them.And when you try to tackle the larger frigates, essentially capital ships filled with flak cannons and missile launchers, youll experience a quick death if you dont strike quickly and then move back. Its both satisfying and fun to strip a larger starship of its offensive capabilities before going in for the kill, and those larger ships manage to put up a hell of a fight. This can feel a bit tedious for some folks, but I honestly enjoyed running in, figuring out a suitable approach, and backing down when my shields started to drop in order to repeat another strafing run. This feels like what space combat should be in a video game, and Strike Suit Zero really nails that.Another fun aspect, and probably a selling point for most folks, is the actual Strike Suit that youll lay hands on starting with the third mission. At this point youll gain control of a vessel that can change from a typical fighter into a mecha of sorts, which allows you to unleash hell through a near endless missile barrage, and also offers the benefit of an auto lock on to nearby targets. The only real problem with the Strike Suit is its mobility, making it an easy target for the larger targets its clearly meant to be effective against. This leaves you with a feeling that youre not quite as invincible as the game wants you to be, lessening the overall empowerment of a transformation. Combine that with a built in timer that dictates use based on a Flux meter that depletes over time, and youre left feeling like the Strike Suit portion of the game, clearly meant to be a big deal, isnt as cool as it could be.Other detractors come from the mission design, which is often stale. Theres a multitude of escort style missions, which I know are atypical for this particular genre but are no less annoying now than they were 20 years ago. Especially since friendly ships cant seem to put up much of an offense, at least not as much as they are a target, to enemy fire. This leaves you with little more choice than to babysit friendly frigates and hope beyond hope that this will be the attempt that youll get lucky and whittle away at your targets hull faster than they can yours.This also ties back into an annoyingly archaic checkpoint system that will see you repeating numerous sequences and objectives previously completed. I dont mind harsh death penalties in game, but if I have to replay all the slow, easy parts before getting obliterated in the final, more difficult sequences over and over again, it starts to make me feel like the experience is extremely unbalanced. Spreading that difficulty evenly across all sections and implementing a more standard, modern checkpoint system would benefit Strike Suit Zero greatly.", "date": "January 28, 2013", "grade": "C+"}