{"name": "The Cave", "ref": "https://gaming-age.com/2013/01/the-cave-review-for-xbla-psn-pc-wii-u/", "text": "While Telltale Games can certainly be accredited with the revival of the traditional adventure game, its nice to see someone else giving it a shot. Especially when that someone else ends up being Ron Gilbert, famed former LucasArts developer behind classics like Maniac Mansion and The Secret of Monkey Island. Hes one of the most well-known figures in this particular genre of video games, and seeing him return to the genre after the fairly tepid DeathSpank with a brand new, 2D focused adventure title thats backed by Tim Schafers own Double Fine Productions, leads you to believe that youre going to be in store for some sort of treat. And The Cave certainly delivers in that regard.The concept behind The Cave is that seven different protagonists, culled from various walks of life, are all on a quest of sorts that leads them through the inner workings of the titular cave. This cave also serves as a narrator throughout the game, offering up guidance and quips in equal measure throughout your adventure. From the onset of the game, players take control of three different characters from the initial set of seven. These characters are fairly eclectic, consisting of a time traveler, a knight, a hillbilly, a scientist, a monk, undead twins, and an adventurer. Thats about all you know going in, no character is ever named, but as you play through the various puzzles contained within The Cave each characters backstory is fleshed out more and more, unveiling a fairly dark history for each.The Cave is an experience that begs to be played with each and every character available. While certain sections of the game will remain the same no matter who you control, other sections are tailor made around specific characters, so youll literally have specific sections unavailable for any given play through depending on whom you opted to take into The Cave with you. Of course, this leads to some redundancy too, considering that the roster consists of seven characters, so if youre interested in seeing every story unfold youll have to use a couple characters more than once. There doesnt seem to be any real benefit to playing through a characters tale twice either, which can make a romp through a puzzle filled section that you already know the answers to feel a little boring.That said, the puzzles are definitely fun and thoughtful. There are a couple throwbacks for genre fans too, which are nice nods to the history surrounding this particular game and the developer behind it. Theres also some definite head scratchers tossed in, with one particular section that had me stuck for a good two hours or so. And each puzzle solved feels incredibly gratifying once finished, and for the most part the logic involved in solving a puzzle makes sense and can be finished with the right amount of thought and concentration applied without needing to result to online FAQs. Despite the fact that the setting, controls, and general feel of the game arent like the point and click adventures of old, the puzzle solving is clearly built around the genres foundations.But lets talk about the rest of The Caves unique format. Theres an effort here to make the game traversal a bit more than your standard point and click, done by literally creating a platformer built around the various puzzles contained within. That means youll be jumping around a whole lot, sometimes over pits, sometimes over pits filled with spikes and so on. Theres also a whole lot of climbing in The Cave, and lots of puzzle focused areas involve multiple levels where youll need to manipulate items, switches, and other mechanics. While the majority of the platforming feels really smooth, with some really nice physics applied to the jumping in particular, some of the climbing gets to be a bit tedious. It feels like the overall climbing speed is honestly just a tad too slow, at least for my tastes, and when a puzzle would require a lot of back and forth across a ladder or rope, I found myself groaning just a bit. Coming down and up a ladder as opposed to a rope isnt nearly as bad, since you can jump up and down to speed things up. But the constant need to climb around, slowly, sort of breaks the pace for me.One last thing worth mentioning in the complaints department, is that theres a pretty often framerate stutter that pops up on the XBLA version of the game that we reviewed here. My assumption is that this occurs during some behind the scenes loading, but when it happens in the middle of a jump or other key moment, it can be a little aggravating. Death isnt really an issue in The Cave, dying simply causes you to reappear instantly at the last safe platform or location you came from, meaning that no real progress is lost. And considering that the game doesnt force you into any loading screens or animations outside of the initial start-up makes me feel like I should temper this complaint a bit. But that stuttering is certainly something that youll notice.As far as the writing, and more importantly for most, the humor goes, I think old-school LucasArts fans will feel right at home here. I dont think Ill go so far as to say that it exceeds some of the humor found in stuff like Day of the Tentacle, or Gilberts own Monkey Island titles, but it certainly works more often than not. There are lines here that definitely caused me to laugh out loud, and certainly a number of moments that brought a wry smile to my face. Dark humor abounds in The Cave, so much so that I dont think theres any one point that Id label as a happy, good feeling moment. But it certainly knows its strengths, and plays up to them well. While dialogue isnt always prevalent, there are a number of visual gags present too, which again work more often than not.", "date": "January 22, 2013", "grade": "A-"}