{"name": "Virtua Fighter 2", "ref": "https://gaming-age.com/2013/01/virtua-fighter-2-review-for-xbla-psn/", "text": "In the endless sea of fighting games that populated arcades in the early 90s, one stood out with its amazing 3D graphics and hard to master combos. This was Virtua Fighter by Sega and it set a standard that many other 3D fighters followed or copied. A few years later, Sega struck gold again with a stellar sequel and finally after a few watered down home ports, Virtua Fighter 2 comes home via Xbox Live Arcade and PlayStation Network.For those whove never had the pleasure of playing this classic, VF2 gives you 10 fighters all fighting for supremacy on the world stage. Defeating all opponents grants you the ultimate fight with Dural, a relentless metal fighter that knows every other fighters moves. Simple in its presentation without any form of back story, and that is all you need, this is a fighter for the true fighting fan.With each fighter available, you have literally hundreds of moves at your disposal, but mastering them and using them correctly will be a chore even for seasoned vets. Even taking the time to master one character will keep you playing for months at a time. This is definitely not your typical button mashing, throw fireballs and win type of fighter. One wrong move, and you can be in for a world of hurt. The beauty of Virtua Fighter is that no matter how many times you get knocked down, you always want to get back up and try again, its that engaging! The addition of online play only adds to the challenge, since you will have no trouble finding skilled players from all over the world to take on.Not only is the gameplay captivating, but the visuals will keep you glued to the TV. Compared to even todays 3D fighters, the character models and fluid 60 FPS animation is enough to keep anyone hooked. This release brings everything that the arcade version offered. Not even the extremely popular Sega Saturn version or the Japan only PS2 release can compare to this version. Something that other home ports never got right is the addition of version 2.1 that gives you more moves and a redesigned Dural to defeat. While most of the differences will go unnoticed by many players, seasoned vets will notice even the most subtle change.", "date": "January 11, 2013", "grade": "A+"}