{"name": "Far Cry 3", "ref": "https://gaming-age.com/2012/12/far-cry-3-review-for-ps3-xbox-360-pc/", "text": "With Call of Duty: Black Ops 2, Halo 4, Medal of Honor: Warfighter, Borderlands 2 and others all being released this year, there is certainly no shortage of quality games to fill out the FPS category. In terms of open world games, Assassins Creed III, Borderlands 2 (again) and Sleeping Dogs topped the charts in one way or another as well. Somewhat surprisingly, even in the face of such steep competition on both fronts, Ubisoft may have snuck in and jumped to the top of both lists with the release of Far Cry 3 for the PS3, Xbox 360 and PC. With its story-driven single player experience, interesting characters, lush and breathtaking visuals, open world gameplay, RPG elements, enjoyable co-op and competitive multiplayer and solid controls, its difficult to find many reasons to not put Far Cry 3 alongside the very best of 2012.Far Cry 3 has more in common with Borderlands 2 than it does with Black Ops 2 or Halo 4, so the comparison isnt exactly always apples to apples, but it still applies. Like its predecessor, Far Cry 3 borrows elements from many other genres including open world adventure games, RPGs and hardcore first person shooters. What makes Far Cry 3 stand out is that Ubisoft found a way to balance these often distinct elements nearly perfectly within a single game.First and foremost, Far Cry 3 is a story-driven game which is told from the perspective of Jason Brody, the games protagonist. To let loose before joining the real world, Jason (you) booked a booze and party-filled vacation to the fictional Rook Islands in Southeast Asia with his two brothers, his girlfriend and some buddies. It takes around 10 seconds to realize that these individuals can best be described as annoying, spoiled, entitled brats. The horrifying events that follow however, which are kickstarted by their decision to skydive down to a mysterious tropical island, will change your perception of them pretty quickly. Without spoiling anything, it ends up as Jasons responsibility to reunite his friends and family and get the hell off of the dangerous island. In theory at least.There is no shortage of open world games or first person shooters on the market. Mixing both genres together and successfully balancing the FPS side with the open world side, however, is tricky. Developers need to provide enough freedom (or the illusion thereof) and exploration elements along with action and twitch gameplay in a way that keeps the game moving at a nice pace and doesnt bog players down. I really enjoyed Borderlands 2, but after a while, micro-managing weapons and equipment became somewhat cumbersome. Far Cry 2 had some great action and story, but the pace was dragged down by side missions and the environmental design to an extent.Far Cry 3 on the other hand offers the best of both worlds, and Ubisoft nailed the pacing perfectly thanks to a number of well thought-out game features. Far Cry 3s lush, tropical environment is essentially a sandbox that provides players with almost unrestricted access to travel and explore. Some bits and pieces are of course triggered and opened up by the story missions, but most of the map is open for exploration. Far Cry 3 does a very nice job in clearly defining what are story missions and what are optional missions and tasks, and thanks to generous checkpoints and the ability to fast travel at will, youll never find yourself wasting a ton of time (unless you want to of course).The story missions are the meat and potatoes of the campaign obviously, but like any good open world game, there are various optional tasks designed to sidetrack you. In Far Cry 3, even the side missions are well paced, and tasks such as hunting animals or bad guys, taking over outposts, collecting plant and animal resources to craft items, climbing radio towers to unlock weapons and parts of the map, or tracking down treasure, relics and memory cards (to name a few), never feels like a chore. Some of the requirements to craft certain inventory items, such as rucksacks, syringe pouches and weapon holsters are a little silly in needing different animal hides for basically the same object, but the process itself is streamlined. Performing pretty much any action within the game (from completing a mission, to making a headshot) earns you XP which are utilized to distribute points within a trio of skill trees to unlock new abilities (in the form of tattoos) and upgrade existing ones. You can play through the entire game without even messing with any of the optional missions or features if you wish, though considering how well designed most of the game systems are, you will likely never feel bogged down or annoyed by the process. Again, and I cant stress it enough, it all comes down to the games excellent balance and pacing.The campaign itself is a good length, Id say 12+ hours without getting involved with a whole lot of exploring or optional tasks and distractions. The chance of running through just the story missions are slim however since the couple of minutes or so needed to climb a radio tower, hunt a few animals or ambush an outpost are well worth the payoff, especially when they are conveniently placed in areas adjacent to the important missions. The story features a motley crew of good and bad guys, and a number of rather mature and violent scenes and themes. The running theme of the game is insanity, and there are more than a fair share of what the hell just happened? moments. The main cast is certainly interesting, even if you cant stand some of them right at the start. The Far Cry 3 antagonists are clearly just not right in the head, with Vaas, the mohawked lunatic on the cover of the game, being especially unhinged.Considering the games open world roots and environments, the FPS gameplay in Far Cry 3 is incredibly solid. Jason can climb, jump, swim, run, crouch, take cover and perform a number of context sensitive actions such as takedowns and multi-kills. The weapons feel great, and give the impression that they have some weight and power behind them. The first person vehicle driving controls for jeeps, trucks, jetskis, boats, gliders and wingsuits are even good.The beauty of Far Cry 3s game design is that you can run-and-gun with heavy weapons and explosives, or take it slow and quiet and go the stealth route with a bow, sniper rifle and knife. Taking over an outpost by finding some high ground and using the scope to tag enemies from afar and strategize a plan of attack is usually very satisfying. Of course, you could load up on body armor a grenade launcher, waltz right through the front gate and blow the place to bits if you so prefer.The single player campaign is probably the main draw of the game, though the separate co-op campaign for up to 4 players and the competitive multiplayer, arent too shabby either. Ubisoft provided a lot of customizations and a good amount of content right out of the box. The co-op mode in particular is a lot of fun, and reminds me a bit of what Naughty Dog put together for Uncharted 2 and 3, although from a first person perspective. There is no lack of players or online game sessions running either, for the PS3 version at least.Visually, Far Cry 3 is a stunning looking game. Yes, the framerate on the console versions can dip and drop below 30fps pretty consistently, and yeah theres a touch of screen tearing and dithered shadows here and there. But for an open world game that very frequently pushes near Uncharted 3 levels of image quality, I can deal with it. The lush vegetation, while not quite as interactive as what was in Far Cry 2, looks amazing, as do the shimmering bodies of water, detailed temples, dramatic time-of-day transitions and excellent character models. The draw distance in the game is immense, and standing upon a radio tower or high peak, you can practically see way across the map. Ubi didnt take the easy way out by dropping the resolution significantly either, so the high quality texturing and details are clearly visible. Other than when fast traveling or starting certain missions that require a cut scene, there are no real bothersome loading screens either. If Ubisoft were able to get Far Cry 3 pushing 30+ fps on the consoles, it would have been quite a feat, and this is something that gamers will expect from the next generation no doubt.The voice acting in Far Cry 3 is also well done, even if the main character sounds a little too much like Desmond Miles from the Assassins Creed series. The dramatic, dynamic audio is well suited for the game though not particularly memorable. The audio backdrop is essentially made up of ambient environmental sounds, with a soundtrack that kicks into high gear when being engaged by enemies or during high action scenes.Far Cry 3 isnt perfect of course, but it does almost everything just about right. You can tell the developers put a lot of thought went into the games systems and menus to keep the experience streamlined while still offering a lot of customization and information. One thing missing in particular in Far Cry 3 are the non-player characters. Youll run along endlessly respawning jeeps of bad guys if you dont take over their outposts, though besides that, youll find a small handful of natives hanging out in the villages and towns, and maybe at the beach. Besides occasionally doing dumb things or fighting with pirates, the small number of NPCs dont do much in the game. On the other hand, wild animals (NPAs?) are everywhere and frequently get spooked enough where they come charging. Having a Gila monster hiss and scurry out of the brush, or shark suddenly strike while swimming through the water will scare the hell out of pretty much anyone. Also, the campaign sort of switches gears for the last 1/3 of the game, which Im still not completely sure Im crazy about.", "date": "December 21, 2012", "grade": "A"}