{"name": "Sine Mora", "ref": "https://gaming-age.com/2012/12/sine-mora-review-for-psn-ps-vita/", "text": "Released on the Xbox 360 way back in March of 2012, Sine Mora grabbed players with its classic side scrolling shooter gameplay and fantastic visuals. Fans of classics like Gradius and R-Type jumped right in and starting blasting enemies out of the skies, and fans of the Bullet-Hell type of shooter found a whole new level of challenge. Now, PlayStation 3 and PS Vita owners have a chance to experience what might be one of the best classic style shooters of 2012.Upon firing up the main menu you are presented with a few choices. Along with the standard Arcade and Score Attack Modes you have the Story mode. Here you play through a complicated story of a mad man with an army of robots that has kidnapped a very important woman. You play a group of time traveling pilots that are sent to rescue the woman and bring down the mad man and his army. Really the story doesnt make a whole lot of sense and the cutscenes that are scattered throughout dont really help to understand it better. However, storylines arent strong points for games like this, its just kill or be killed. Story Mode offers two difficulty choices, Normal and Challenging, with Challenging giving you the true ending if you manage to beat it.New to the PS3 version is the Challenge Mode. Here you fight every single boss from the game, one right after the other in a hectic battle. This mode might not sound like much, but once you play it, all you want to do it finish it, as it is surprisingly fun. Another mode similar to this one is the Boss Rush mode, but it only contains the bosses that youve previously defeated in the main game, and it seems to be a lot easier than the Challenge Mode.Gameplay, as you would imagine, is exciting and fun. As you play through the main game, your ship changes between all the different pilots. You cant choose your own ship, it changes depending on the level, so you will have to learn and master all the different weapons quickly so youre not caught off guard when the ship changes. You can upgrade your main weapon on each ship about 9 times by catching floating power-ups. There are also ones for a limited shield and one to fill up your Time Bar. Speaking of the Time Bar, this is a unique twist that can actually help you navigate through the walls of Bullets you will encounter. Slowing down everything around you can help you avoid a cheap hit or get through an otherwise impossible situation. Using it too much though will cost you, as the stages are timed, so only use it when you absolutely need it!Visually, Sine Mora is a stunning masterpiece. Everything from the enemies to the backgrounds are extremely well animated and modeled beautifully. Even though most of the action is 2D, everything is presented in a fantastic 3D world. You really get sucked into the world quickly as everything around you seems to have a life of its own. The cut scenes in the Story Mode have some of the best visuals presented, even if the story makes little sense, you should still check them out. The soundtrack comes from the great composer of the Silent Hill series Akira Yamaoka, and fits really well with the action. Usually these type of games have a techno style soundtrack that can get annoying quickly, but not here, each piece of music sounds so good, I spent some time listening to it on its own.If there is anything wrong with Sine Mora, is that its a little on the short side. The game has eight levels with 3 or 4 stages in each, so the main game is over rather quickly. But the replay value you get with all the different modes more than makes up for it.", "date": "December 18, 2012", "grade": "A"}