{"name": "Midway Arcade Origins", "ref": "https://gaming-age.com/2012/12/midway-arcade-origins-review-for-xbox-360-ps3/", "text": "In years past, Midway was a forced to be reckoned with when it came to Arcade Games. Local arcades were filled with their unforgettable classics like Smash TV, Total Carnage, Joust, Defender and Gauntlet. After the fall of the arcade, many gamers took to getting these classics through digital downloads or compilations on todays systems and even some portable devices. Although their original charm was there, something about these previous releases didnt feel quite right. But now, Warner Bros. Interactive and Backbone Entertainment have compiled almost every classic Midway arcade game with Midway Arcade Origins, and this collection is done better than any other one released previously.This collection is by far better than any other collection of Midway games available, including digital releases. This is because Backbone Entertainment uses the original programming from each game included on the disc and the emulation is perfected to give the games that authentic arcade feel. On some other complications, there would be a sound effect missing or replaced with another, but not here. Every sprite, sound effect and key element that made these games such a blast to play is faithfully recreated giving the player the feel of being back at the arcade.Every game included plays just like the original stand up machines, and are fitted to the Xbox 360 (or PS3) controller perfectly. You can jump right into any of the 30+ titles included and play in free play mode, or try to grab Achievements (or Trophies) in Score Attack Mode. Achievements and Trophies are super easy to get here, its actually possible to collect all of them for each in a very short time. You will spend most of the time just sitting back and reliving these classics over and over again, that you might want to create your own challenges to better yourself or challenge your friends. Some games like Gauntlet, Joust 2 and Championship Sprint are much better with a group of friends all trying to out-score one another.Like I said before, the controls are well adapted to the controller you are using. Ive heard some people out there say the controls are hard or unresponsive, but after playing all 30 titles extensively, Ive never encountered an issue. Sound effects are like a journey back to your favorite dimly lit arcade and sound just like they did back then. Again, some folks out there claim to have experienced sounds cutting out or not hearing them at all on some games. I myself never experienced any hiccups with sound, so I really dont know if these complaints are valid or just a bunch of bad discs got out there. As of this review and after some quite extensive play time, my experiences with control and sounds have been flawless.With all the praise I give this game, (after all I am a classic game enthusiast) I do have a few minor gripes. First, the menu you use to select your game is uninspired. Its a simple bare bones affair with nothing more than a picture of the original arcade machine. No history or original flyers to look at or any option to see the machine up close to admire the classic artwork used. I would of liked to have seen a history option for some games or maybe a collection of posters or artwork, but nothing like that is offered. Another gripe is that 4 Midway arcade staples, Mortal Kombat, Mortal Kombat 2, MK3 and Ultimate Mortal Kombat 3 are missing from the collection. But my gripes are VERY minor, as the menu is perfectly functional, not having a history or artwork option is no big deal, and not having the MK games is understandable considering the amount already included.", "date": "December 6, 2012", "grade": "A-"}