{"name": "LEGO The Lord of the Rings", "ref": "https://gaming-age.com/2012/11/lego-the-lord-of-the-rings-review-for-xbox-360-ps3/", "text": "Its no secret that I have some fondness for the LEGO games developed by Travellers Tales/TT Games, and outside of a few bad eggs,theyvebeen some of the most consistently fun single player and co-op experiences on this generation of hardware. LEGO The Lord of the Rings is no different, and provides players with a pretty faithful adaptation of the LOTR films in LEGO form, while carrying over new additions like open world travel from LEGO Batman 2 and voice over work, making for a sizeable adventure for those willing to dive in.The game follows the theatrical release of the three films quite closely, with the story originating in The Shire, and ending at Mount Doom. Most of the important bits in between are covered, like the Battle at Helms Deep, the Ent assault at Sarumans tower and so on. If youve got a favorite action sequence from the films, theres a good chance youll play it here in LEGO The Lord of the Rings.The core formula of the series remains largely unchanged, but there are some fun additions and departures from the norm. While youll still be going through a series of levels, ransacking LEGO structures to build up studs that can then be cashed in towards additional characters; youll do so with a pretty large party behind you. One other LEGO game, Pirates of the Caribbean, made an attempt at this that didnt quite work due to some awful path finding. But here in LEGO The Lord of the Rings its pulled off extremely well. Its really fun, and sort of epic, to see the entire fellowship strolling behind your lead character as you make your way through the Mines of Moira. And later, when the fellowship is split, theres a lot of focus put on switching between groups in order to turn the gaze of Sauron, allowing you access to new areas when done.Like most games in the series, LEGO The Lord of the Rings features a whole host of characters to play as. And while youll cover a lot of ground in the single player campaign, taking control of series favorites like Eowyn, Faramir and more, theres nearly double the initial playing cast featured as extra unlockables once everything is done and through. And youll need to unlock a number of characters, as their unique special abilities will be the only way to fully complete a number of levels, provided you have an interest in uncovering everything the game has to offer.Also, in addition to giving you most of Middle-Earth as an open world playground, LEGO The Lord of the Rings introduces unique quest givers, which will task you with finding a particular item hidden in different stages. Retrieving items will lead to different rewards, including the coveted red cheat blocks thatll unlock options like invincibility, LEGO stud multipliers, and a whole lot more. Quest givers are a great fit for a fantasy themed game like this, and give added incentive for revisiting areas via Free Play mode. Theres also a lot of ground to cover in Middle Earth, with a number of hidden items and areas to explore.Finally, another neat addition comes from the Blacksmith, and the ability to take mithril bricks and create useful inventory items to outfit your characters with. Mithril bricks replace your standard gold bricks found in other LEGO titles, and youll want to collect as many as possible for Blacksmith gear, which can come in quite handy. Gear can give your characters new abilities that are typically found only on certain characters, allowing one character to be more of a versatile tool if outfitted correctly. Again, its a great fit for the setting, and a fun game specific addition that gives added value to all those end of level blocks you obtain.", "date": "November 28, 2012", "grade": "A-"}