{"name": "Warriors Orochi 3 Hyper", "ref": "https://gaming-age.com/2012/11/warriors-orochi-3-hyper-edition-review-for-wii-u/", "text": "I really enjoyed Warriors Orochi 3 when it launched for PS3 and Xbox 360 earlier this year, and if youd like to see why feel free to check out the full review that I did for the game here. And considering that there isnt a significant content change between the Wii U version of the game and the versions that preceded it, not a whole lot of that has changed. It remains one of the better Musou style games available on home consoles, and if you enjoy the series but didnt pick it up on the other two platforms, the Wii U port is certainly serviceable. But its not without issues, which are a little balanced by some minor additions.For one, youll notice a drop in framerate and the number of on-screen enemies present in battles. The latter is less of an issue, and certainly less noticeably unless youre doing a side by side comparison of each version. But the framerate issues are certainly more noticeable here, from the beginning battle against the Hydra that kick starts the game onwards, youll see the engine struggle to keep up with on-screen action a number of times. Its disappointing to say the least, and while it doesnt really become a game breaking experience, I was certainly hoping for a better port than what we get here.Thankfully, the rest of the experience seems to carry over without any major hiccups. Graphically this looks similar to the other two versions of the game, and while Im sure someone with the ability to do better direct comparisons than I will find some difference in texture or shadows, to my naked eye it looks pretty much the same. Its certainly not a bump up, but Ive had my expectations about the Wii U hardware firmly in-check for a while now, so Im not particularly disappointed about there not being more visual fidelity present in these launch window ports.There are a handful of additions worth noting in Warriors Orochi 3 Hyper Edition as well. One is the inclusion of four characters, two of which carry over from the Japanese only release of the PSP port of the game. Ninja Gaidens Rachel is now present as a playable character, joining Ryu Hayabusa and Ayane on the existing roster. Another NG cast member by the name of Momiji has been added. The other two characters, Seimei Abe and Shennong Im a little less familiar with, but the more characters present here the better as far as Im concerned.Warriors Orochi 3 Hyper Edition also features a new mode not present via DLC or the original release. Theres a new multiplayer mode called Duel Mode, which pits three man teams against each other in a vs. match set across various stages. This mode also incorporates the new strategy card system, which can bestow special abilities and effects via the D-Pad on the Game Pad or Pro Controller. While the game begins with only one three man team available, youll be able to unlock more characters by advancing through the story mode of the game.Another big and obvious addition is the ability to play through co-op without the need for split screen. One player can stream the gameplay to the screen on the Game Pad, while the other can use the Pro Controller and keep their view on the TV. Its a great way of cutting down the loss of visibility found in split-screen local play, but the Game Pad screen is small enough that theres a significant loss of detail for the player stuck playing through the game that way. The mini-map in particular can be really hard to read, and pinpointing items and breakable objects that contain health and other items can be ridiculously hard to find.", "date": "November 27, 2012", "grade": "B-"}