{"name": "Karateka", "ref": "https://gaming-age.com/2012/11/karateka-review-for-xbla-psn/", "text": "Karateka began its life on the Apple II computer. It was created by Jordan Mechner (also famous for Prince of Persia), alone in his dorm room at Yale. Soon after its release, it became a #1 bestselling game for the platform and was ported to other systems like the Atari 7800 and even the NES in Japan. What made it so unique was Mechners use of rotoscoped animation and cinematic cutscenes. This was a groundbreaking feat for the time, and has influenced game developers and gamers alike even today. Now 28 years later, the original creator is back with an updated version of his classic, and lets just says lighting doesnt strike twice.The premise of Karateka is a simple one. You begin at the bottom of a long path leading up to a palace, where your girlfriend has been kidnapped by an evil foe. Your mission is to climb the path and rescue her before she comes to harm. Along the way you will meet the masters henchmen, who will try and stop you from reaching your goal. Beat all who stand in your way and the final battle with the master will be all that stands between you and your beloved. Since all you do in this game is fight, you would think an array of awesome martial arts moves would be at your disposal. Sadly, that is not the case, as traditional fighting mechanics are thrown out in favor of a sort-of rhythm based combat system. Upon meeting an enemy on the path, you enter fight mode. There you listen carefully for music cues and press B to block their attack. Block at the right time and you can counter attack with X or Y. Repeat this process until the enemy is downed. Occasionally a Chi meter will fill up and you can use it to stun a more difficult enemy and get some extra hits. Coming across a blue flower on the path can refill your health to full, so its quite difficult to die, although the game likes to not register a button press from time to time so you can take cheap damage. The cheap hits and spotty controls are really the only ways you can lose a fight. You get a total of three lives in the form of three different characters all attached to the princess in some way. You cant select between them other than dying as one and taking control of the next one. The whole gameplay experience gets stale after the 5th fight or so. Graphically, the game looks nice. Its the visuals drawn by artist Jeff Matsuda, who did work on The Batman and other successful animated shows. The environments are colorful and nice to look at, but thats basically all you do, since you cant interact with anything other than the enemies and the occasional flower. The music is composed by Christopher Tin, who did the music for games like Civilization IV, and its well done. Sometimes the background track and the sound queues you need to listen for overlap, but overall its pleasing to the ear.", "date": "November 16, 2012", "grade": "D"}