{"name": "Street Fighter X Tekken", "ref": "https://gaming-age.com/2012/11/street-fighter-x-tekken-review-for-ps-vita/", "text": "Street Fighter X Tekken for Vita marks another great fighting game port for the handheld from Capcom, and while I wish their support for the Vita was a bit more substantial, at least theyre able to get these ports done right. I was a pretty big fan of the original release on Xbox 360 and PS3, and while I do fall into the camp that has found the gem business a bit tiring, overall Im extremely pleased with how well this port has shaped up.Like I mentioned in my original review for the game, seeing the worlds of Street Fighter and Tekken meshed together like this is pretty much a fanboy dream come true. My 13 year old self would have fallen out of his seat when the announcement was made that a collaboration would occur between these two fighting game giants, and even as an adult I found myself giddy with expectation. And the end result, at least on the Capcom side of the fence, has left me pretty satisfied and happy.For the Vita version of the game, there are not a whole lot of bells and whistles added in, but there are some benefits with DLC that carries over between this platform and the PS3. Youll have access to all the alternate costumes and character DLC that original game has had released, giving you a pretty hefty roster to choose from. The Vita version of the game does come with some touch screen options, similar to what was found in Marvel vs. Capcom 3 on Vita. Here youll have access to four buttons on the front screen and two on the back. The front four serve as option P+P+P, and K+K+K, along with basic combos that can be programmed together and altered. Other touch options include throws and the ability to tag your partner in and out of a match, commands that usually require two button presses at once.From a control perspective the game works about as well as it does on a standard DualShock controller, so if youre at all familiar with fighters on a PS3 or PS2, you should feel right home here. The touch screen controls, at least the ability to map three punches and three kicks, can be useful, but youll find yourself accidentally hitting the rear touchpad quite a bit, so much so that youll most likely need to turn that option off, which you can do without disabling everything.Everything else about the game seems to play out in an identical fashion to the original. Both rosters are well represented, featuring fan favorites from both sides. Im still amazed at how well the Tekken character translate to a 2D style space, and how much sense their command inputs still make when you take the 3D plane out of the equation. Online play is present here, and feels just as smooth and complete as it does on home consoles, which is a huge benefit for those looking to play this game on the go.Visually the game is no slouch either, and while it might not be on par with the PS3 version of the game, I think youll still find yourself surprised with how close the developers manage to get here. Without sacrificing FPS and without much loss in the texture department, the environments and characters modeled here really look great.", "date": "November 15, 2012", "grade": "A-"}