{"name": "Smart As", "ref": "https://gaming-age.com/2012/11/smart-as-review-for-ps-vita/", "text": "If you think about it, Smart As exists in a really odd place. On one hand, its unquestionably a niche title that, like the Brain Age series on the Nintendo DS, appeals mainly to a very specific group of gamers  if, that is, those people would even want to be called gamers. At the same time, however, its a niche that  again, like the Brain Age series on the DS  has the potential to be absolutely enormous, drawing in people who may not even normally buy video games.Or, to put it more succinctly: you have to figure that somewhere along the line, Sony looked at sales figures for the PlayStation Vita, looked at how many copies the two Brain Age games have sold (32 million and counting), and figured, Hey, its worth a shot!That said, what matters isnt how (hypothetically) mercenary Smart As birth was. What matters is whether its a fun, engaging game. And on that front, its a success.Of course, your enjoyment of the game will depend entirely on whether youre a fan of puzzles, math and word games. And not just a casual fan, either. While the Easy challenges in this game are, for the most part, just that, as soon as you start making things a little harder, the difficulty levels ramp up pretty quickly. I mean, I like to think I have a decent vocabulary, but asking me to spell words like ginglymus, hyalithe and yataghan is just unfair, particularly when you factor in the voice reading them out, which has just enough of an English accent that its occasionally impossible to discern what youre being asked to spell. Similarly, Im a big fan of being able to do math in my head, but anyone who can do multiplication and division of three-digit numbers at lightning speeds probably has better things to do than be playing on a Vita. Then again, Smart As wouldnt be much fun if it didnt offer players a challenge, so its easy to understand why tasks verge on impossible when you get to Genius.Less forgivable are the little things here and there that detract from an otherwise stellar experience. Like the aforementioned voiceover, for example. I get that the game was developed by XDev Europe, which means that getting a British voice actor was probably easier than getting an American one. And no doubt it sounds classier, and it provides some nice consistency with the rest of the narration, which is provided by John Cleese. But the accent is just thick enough that it makes some words sound incomprehensible (or, at least, impossible to spell). On a broader level, youve got the issue that the game doesnt pick up what youre writing 100% of the time  no small thing when the clock is ticking down, and the game keeps insisting that the J or R you typed in is actually a U or a K. It doesnt happen every time, and certainly not enough that the game truly suffers as a result, but its enough that its a constant, low-level annoyance.", "date": "November 15, 2012", "grade": "B+"}