{"name": "LittleBigPlanet Karting", "ref": "https://gaming-age.com/2012/11/littlebigplanet-karting-review-for-ps3/", "text": "When United Front Games and Sony unveiled ModNation Racers in 2010, quite a few gamers were wondering why they just didnt team up with Media Molecule for an actual LittleBigPlanet-themed kart racer. I mean, it very much followed the LBP Play, Create, Share formula, and was a solid game in its own right, but it unfortunately lacked the recognition and loveability associated with Sackboy and friends. So two years later, it was definitely nice to see Sony recognize this and actually release a proper LittleBigPlanet Karting. Is it the best kart racer ever created? Not exactly. Is it the most creative kart racer ever? Totally!LittleBigPlanet Karting should be incredibly familiar to anyone who has played even a single LittleBigPlanet game. Theres a distinct feeling of familiarity when playing the game, from the intro and the interface, to the load screens and the creative bits, LBP Karting is undeniably LittleBigPlanet. As Tarsier Studios did with LittleBigPlanet Vita United Front did an excellent job building LBP Karting following Media Molecules blueprints and theres honestly not a piece out of place.LittleBigPlanet games are usually touted as creative platforms to build out your own games, levels and whatnot, except the developers always find a way to work in a substantial story mode to show off everything you can do in their sandbox. LittleBigPlanet Karting is no different with a fairly long 25 race campaign across 7 different themed planets, with several race types and even boss fights. The core is still kart racing, but there are a few twists on the formula with battle mode races, checkpoint races and a few one off racing-shooter type races. Variety is the name of the game.As you would expect from a LittleBigPlanet kart game, there are references to pretty much all of the other LBP titles within the game, from the weapons, score and prize bubbles, to the vehicles and race environments. Some of the tracks look exactly like 3D versions of the more popular LBP stages, complete with the appropriate supporting characters and respective storylines. The attention to detail even extends to the familiar sound effects and music with the only thing seemingly missing is the rooster sound effect when picking up 100% of the prize bubbles on a race.The story mode is fairly long for a kart racing game, and not incredibly difficult, save for a few later races assuming youre not going for 100% and 1st place (and if youre a dedicated LBP player, you probably are). In typical LittleBigPlanet fashion, playing through the story unlocks a plethora of items for use in the create mode and for customizing both Sackboy/Sackgirl and his/her kart(s). Sackboy is the Sackboy we have grown to love and the pop-it interface is exactly the same one that players have been using for years now. Sackboy himself can be dressed up and customized just as before, as can his pod, and now his vehicle as well. The karts in the game all actually control identically, though theres a huge range of styles and suspension types, from a traditional go-cart or buggy, to a hovercraft and other very odd creations.The controls in LittleBigPlanet Karting are quite solid and tight, and clearly based on ModNation Racers  except tweaked and tuned up a decent amount. Hop drifting is used to build up a boost which is used immediately at the end of the drift, and not stored in a meter. Weapons can be used offensively, or defensively, and the game does a nice job indicating when you can aim backwards and defend against most incoming projectiles. Driving over jet packs give your kart a little boost, and during jumps you can initiate a simple spin that rewards you with a boost upon landing. A nice little addition is the ability to grapple onto floating yellow sponge materials while in mid-air to make it over larger gaps and obstacles. Speaking of obstacles, those which are created out of fire, electricity, or acid will immediately cause Sackboy and his kart to dissolve and regenerate back at the (next) closest checkpoint in typical LBP fashion.The create mode is also based on a mixture of ModNation Racers and LittleBigPlanet and it all works out beautifully and thats coming from someone who doesnt have a ton of patience for spending countless hours in a create mode. The ability to drive your course or drop waypoints to create a track, and have the game automatically fill in the rest goes a huge way in making the mode enjoyable. You can carve out a playable track in no time and then spend as much or as little time as you wish detailing and fine tuning it, LittleBigPlanet style. If you want to go crazy and create custom objects and behaviors, feel free to. But if you just want to made some bad ass jumps and dangerous crisscrosses, thats okay too. You can simply share it with the online community or invite others to race it with you. Basically, anything you could do in any previous LBP title you can do in LBP Karting.LittleBigPlanet Karting is definitely a great looking kart game, especially considering that is built using essentially the same create tools that players have access to. It has the same look as most LittleBigPlanet games do, which is to say it uses some unique techniques to provide a slightly filmic style. Its suitably colorful and cheery, or dark and creepy when it needs to be, though it sort of lacks the hyper colored and over saturated cartoony look that we mostly associate with kart racing games. The game isnt insanely fast moving by any means, and the framerate mostly holds its own and is seemingly locked at 30fps 99% of the time. As you would expect, it has charm to spare.The multiplayer gameplay in LittleBigPlanet Karting is just as smooth and seamless as it is in any other LittleBigPlanet game. Up to 8 players can compete online, either on custom created levels, the story levels, or the unlockable, tweaked story level races/competition. Regular races, checkpoint races, battles races and more are all easily accessible and are a ton of fun to play. You can even party up with up to 3 other friends and jump into races together. You have the ability to rate, comment on, or favorite nearly every piece of content within the game including tracks, players and items. Players can snap photos from within the game or real life using the PS Eye, and share them as well. As of this review, there werent a ton of players online, at least when compared to the huge number associated with LittleBigPlanet 1 and 2 at around the same time after launch. Theres certainly enough to get a game started at any given time.", "date": "November 14, 2012", "grade": "B+"}