{"name": "Sports Champions 2", "ref": "https://gaming-age.com/2012/11/sports-champions-2-review-for-ps3/", "text": "Its not difficult to see that support for the PlayStation Move has dwindled somewhat since its introduction in 2010. The PS3 motion controller peripheral had (and still has) a lot of potential, and games that launched alongside it, like the original Sports Champions, provided gamers with accurate, intuitive, and nearly one-to-one controls. While dedicated PS Move games are few and far between at the moment, there is still the occasional bright spot. Sports Champions 2 is an obvious one.I spent an untold number of hours playing the original Sports Champions, and very much enjoyed the quirkier events such as Disc Golf and Bocce. The sequel goes decidedly more traditional with a half a dozen pretty straightforward sports that build on concepts and controls of what was found in the first game. Sure, I would have preferred a few more events, along with less-traditional ones as found in the first title, but what Zindagi Games and Sony included is still more than solid.Besides the events themselves mostly being new, Sports Champions 2 improves on the original in pretty much every way imaginable. The interface is slick and easy to navigate, the character customizations, player profiles and unlockables are way more fleshed out, the controls are even more accurate and intuitive, and the calibration is quick and streamlined. Profiles can keep track of individual players, including their progress, motion control preferences (including using 1 or 2 controllers), unlockables and more. The most appreciated upgrade is the addition of a proper Party Mode which does a nice job in handling multiple players and multiple controllers in different combinations of competitive and co-op play. As with the first game, there is no online multiplayer functionality unfortunately, which while expected, is still a bit of a letdown.The half a dozen sports in Sports Champions 2 are mostly enjoyable, though it probably depends somewhat on your opinions of the real life versions. Boxing, Golf, Bowling, Skiing, Tennis and Archery are all represented in fine form and Zindagi did a nice job mixing realistic mechanics with fun gameplay and modes for each. The games play equally well with 1 or 2 Move controllers, though for those which support it, using a pair at the same time is undeniably more realistic and fun.Archery is the only returning sport from the original game, and it is just as fun now as it was then, especially when using 2 controllers. As someone who used to shoot a bow pretty regularly, reaching back and grabbing an arrow from your quiver, nocking it, drawing the string, aiming and releasing does an excellent job imitating the flow of doing the same thing for real. The events in Archery range from leisurely shooting a set of stationary targets, to picking off a frantic rush of wooden zombies, and competing against another archer in a skill-based game of memory. The CPU players can put up a good fight in arcade mode, so perfecting your skills is a must at higher tiers.Boxing is definitely as straightforward as you would expect, and the one-to-one controls hold up very well especially when using 2 controllers. Punches definitely feel like they have, err, punch, and jabs, hooks, uppercuts and overhands are mimicked by your on screen character quite accurately. The same can be said for blocking. Of course the more power you put behind your punches, the more powerful your on-screen punches are, and the game does a nice job differentiating between power levels. You do have very limited control over moving about the ring, but considering the arcade-like action going on, theres not all that much to complain about. If youre looking to break a sweat, boxing is definitely the sport to choose.Skiing is a fun addition to Sports Champions 2 and the natural-feeling controls and interesting courses remind me a lot of Namcos Alpine Racer arcade games, which is certainly a good thing. At the start, you pull the controller(s) toward yourself to simulate launching from the gate, and make a rowing motion with the PS Move to build speed using the poles. You can crouch slightly to gain and keep speed, and gently tilt the controller(s) to carve or turn, depending on the angle. You can even perform a jump and pull off simple flips by tilting the controllers appropriately in mid-air. Like skiing in real life, the event definitely rewards players for smooth movements. Racing against another player in split screen and taking on CPU racers is a blast.Bowling, as you might expect, is exceptionally easy to just jump into. You hold the Move controller in front of you, squeeze the T button (which starts the approach) then swing your arm back and forward and let go of T to release the ball. The character can easily be repositioned side-to-side beforehand but in a regular game it is hardly ever required. Putting variable amounts of spin on the ball is handled by simply twisting your wrist in either direction upon release. Its definitely not difficult to pull off a 300 game in bowling, and all it takes is a moderate amount of power and a little spin. The timed arcade challenges are far more difficult and will present a challenge at higher levels even if you can bowl a perfect game. Bowling in SC2 is fun, very accessible and customizable, and will likely get a lot of play time. Being able to team up with another player and take on the CPU is a nice touch.Golf in Sports Champions 2 actually has some of the best golfing controls in a PS Move-enabled golf game yet, which isnt a surprise. From using the controller to point where you would like the ball to go, to swinging from a realistic stance with one-to-one controls taking into account your power and hook/slice/spin, golf is definitely a solid addition. Is it exciting? Well, not really. Zindagi thankfully streamlined the experience to allow players to automatically or manually skip CPU turns and the cinematic fluff, and they also put together some enjoyable arcade challenges which balance it all out. I love golf games (especially Hot Shots) but would still have preferred Disc Golf again personally. Whats included is a nice representation of arcade golf though.Last but not least is Tennis. Tennis is probably the most throw-away event in SC2 its neither as fast paced nor as exciting as Table Tennis was in the first game. The controls are nicely implemented, again, with accurate one-to-one controls. Holding and swinging the controller as you would a tennis racquet, you can perform a wide range of shots including forehands, backhands, lobs, slices and also add a bit of top or back spin. Player movement around the court is mostly automatic so the focus is on making accurate shots. Holding the racquet behind you for a brief time will build power which can set the ball alight if hit properly. Its fun to play with or against other real players and theres more than enough customization to keep it from being boring. The arcade challenges, as with some of the other events, will keep you on your toes.Visually, Sports Champions 2 is a nice upgrade over the first game. The framerate is usually super smooth, and its definitely crisper and better looking than the original game in every way. The lighting and effects are just as impressive, and the textures are noticeably of higher quality. The characters look great and there are more than enough customization options and unlockables to keep it interesting. Creating a virtual representation of yourself isnt all that difficult with the options available, though you can really go crazy with weird skin patterns, colors, hairstyles, accessories and outfits if youre into that sort of thing. The music, voices, sound effects and whatnot are all appropriate enough, so no complaints there.", "date": "November 9, 2012", "grade": "B+"}