{"name": "Serious Sam 3: BFE", "ref": "https://gaming-age.com/2012/10/serious-sam-3-bfe-review-for-xbla-psn/", "text": "Serious Sam 3: BFE comes to Xbox Live Arcade and soon the PSN almost a year after being released on the PC. The transition to console is fantastic, with all the controls nicely adapted to game pads. You can pick up a controller and start blasting away at enemies in no time. With that being said, you may find yourself throwing said controller across the room in frustration after the 50th Kleer slams into you for the 100th time in a row.The main goal of the game is to guide Serious Sam Stone through hordes of enemies and reach the Time Lock, a device that will allow him to travel back to before Mentals alien forces invaded the Earth and destroyed humanity. As you are thrown into a battlefield, you need to find weapons and armor to stay alive. At first all youll have is your fists, and a few scattered enemies, but because Sam is a bona fide badass, one press of the Melee button and youll be ripping eyeballs out of aliens heads. It seems you will have an easy time reaching the end of each area, but this is where the game starts kicking you in the head.In no time, more and more enemies will appear, and soon youll be trying to survive huge waves of Kamikazes and charging monsters. After the waves die down, you may find yourself lost in an open area with no idea where to go next. I spent loads of time trying to find the path that lead me to the next area (or horde of baddies) because a heated battle would leave me disoriented after the smoke cleared. With no map of any kind to pull up, you will get frustrated for a while, only to somehow stumble on your next path by accident and totally not ready for the next wave of enemies. Thankfully, the game auto saves a lot, so dying wont be too much of a burden on your progress. The auto save feature is something you usually dont see in PC to console ports of this type and it is a welcome feature since you will die often.Croteam presents a somewhat decent package here, with nice detailed graphics and lots of secrets and weapons to find scattered in each area. There are a few areas with messy textures and sometimes you do see some glitches popup, but none of this hurts gameplay. Sound is mediocre, with the standard gunshots, explosions and monster screams. The music is fine for a game like this, with the usual heavy metal tracks blasting during a battle and Sams wisecracks, although humorous, become stale after hearing them a few times. After the 3rd episode or so, some tedium will set in, as the game really doesnt change from the standard run, gun and die motif. Before too long, you realize that there isnt going to be too much variety. You can still have fun finding new weapons and blasting enemies, but eventually it will become tiresome. Some Boss battles break this up at times but were really tough, due to cheap hits and sometimes Sam missing his target randomly. After the initial wow factor of the detailed graphics and streamlined controls wear off, you are left with a bare bones throwback to games like Doom and Duke Nukem 3D.If you want to break up the tedium of the main game, there is a multiplayer option with the DLC pack Jewel of the Nile. The Multiplayer add-on includes modes like Death match, Capture the Flag, Last Team Standing and My Burden. The online play is really good, with no dropouts or connection issues of any kind. It adds to the overall package, but this pack, plus the game will run you 2400 MSP, with both downloads costing 1200 each. For what you get here, its a little pricey, even if you play to completion.", "date": "October 23, 2012", "grade": "C+"}