{"name": "The Unfinished Swan", "ref": "https://gaming-age.com/2012/10/the-unfinished-swan-review-for-psn/", "text": "thatgamecompanys Journey was honestly an emotional and transcendent experience nearly each and every time that Ive played through the game. That being said, it will be difficult for me to not compare any such videogames as art new indie release to what I consider to be both a masterpiece and one of my personal games of the year. But, with Giant Sparrows The Unfinished Swan (also produced by Sonys Santa Monica Studios), we have yet another surreal and frequently brilliant PSN release that comes very close at times.The Unfinished Swan takes the unique concept of splattering paint in a mostly colorless 3D world and spins it into a bizarre and thought provoking, mind bending adventure that seemingly asks as many questions as it answers. Journey was fairly abstract on occasion, but like Inception, The Unfinished Swan will definitely get in your head.The Unfinished Swan is the story of an orphaned little boy by the name of Monroe, who one night, awakes to find the subject of one of his late Mothers paintings, an unfinished swan, somehow jump off the canvas and disappear through a door. The game follows you, as the boy, as he chases down the swan into a mysterious unfinished kingdom created and apparently abandoned by a King.As with many games in the genre, The Unfinished Swan drops you into the game without as much of an onscreen prompt, a tutorial, or a stitch of direction as what to do. In the case of TUS, you see nothing but a simple white screen, in a first person perspective, with a small reticle in the center. Its not until you start pressing buttons do you figure out that you can splatter paint about the world which helps define what you see and where you can go. Splattering paint, in conjunction with yellow swan prints and the occasional glance of the swan itself, provides some sort of direction as what to do next and how to get around.The Unfinished Swan is undeniably unique experience that has players traversing through five parts/levels and a number of chapters in pursuit of both the swan and the story behind the King who created the magical kingdom which you are now trapped in. Splattering paint (or other liquids) is the primary gameplay concept in The Unfinished Swan and is adapted from chapter to chapter to coincide with the story. Explaining the slight change in mechanics will likely spoil some of the game, so Ill avoid doing so. Monroe can also jump, and there are some very light platforming elements utilized during a chapter or two in the game, but a majority of The Unfinished Swan moves at a leisurely pace giving players time to think about the puzzles and challenges and briefly explore.The game tells a terrific and thought provoking story which unfolds in hidden storybook pages with voiced narration that are uncovered during the journey. Upon completing The Unfinished Swan, it is obvious that there is no easy way to describe what a player may have just experienced, which is certainly a good thing for a game such as this. The meaning of the game is certainly up for interpretation, and its fun to read up on or discuss the story with other players that may have the same questions or perceived the adventure somewhat differently.Visually, The Unfinished Swan is definitely a unique looking and gorgeous game. At first, it looks unfinished, with nearly no color and only blotches of black paint defining your environment. That all changes as the chapters progress, and at one point youll be treated to some really clean, strikingly fantastic visuals, along with some splashes of color. The audio is equally interesting, with ambient effects and just the right amount of music to highlight a particular game event or scene.There is one thing worth noting with the visuals in The Unfinished Swan that may or may not be an issue with all gamers. While using the PS3 controller (PS Move is also supported), I found myself getting a bit of motion sickness during the first few chapters. The game is presented in first person, but due to the lack of a focal point in the distance, or maybe only seeing sections of the levels rendered and moving by swiftly, I end up feeling fairly woozy after 10 minutes and had to quit playing the game a few times. I was able to get past this issue by turning the camera speed way down and using the PS Move controller. Later in the game, probably also because of the different level designs, it was less of a problem. But still, it was something worth noting in the review for those susceptible to motion sickness caused by games.I cant quite elevate The Unfinished Swan to Journey levels of amazing due to a few issues I had with the game. First up, the games length. The Unfinished Swan is under 3 hours long and is a mostly linear, single player experience. Yes, you can go back to find balloons, which can be used to unlock upgrades and extras dubbed toys, but for $15 I found the content somewhat anemic. Journey was super short as well but thanks to the more open nature of the levels, and the online co-op of course, I was hooked enough to play through it around a dozen times. Secondly, while the game does try to introduce some variations on the paint/liquid splattering mechanic, they are only used sparingly to solve puzzles or make progress through the story. As a result a few chapters felt somewhat forced and, well, unfinished to an extent.", "date": "October 22, 2012", "grade": "A-"}