{"name": "Warlords", "ref": "https://gaming-age.com/2012/10/warlords-review-for-psn-xbla/", "text": "If you are a retro gaming fan like myself, chances are you have stumbled upon one or two remakes of classic games for todays consoles. Weve seen remakes of Yars Revenge and Haunted House, even updated versions of Centipede and Battlezone. Now, Atari is continuing this trend by unleashing a remake of what could be called the original party game. Warlords brings back the classic feel of the original and adds some new twists to keep new players entertained and us veterans on our toes!The main goal is simple, a dragon spits a fireball onto a play field of 4 castles. Your objective is to deflect that fireball away from your castle with your shield and into your opponents castle. Keep defending and deflecting until you break through their walls and take out their tower. Players can hold on to the ball by pressing X just as it hits their shield for a power shot that can be aimed. Holding on to the ball too long can damage your own castle, so time the grabs and aim quickly to reduce damage. As the battle progresses, the dragon returns to spit out more fireballs to increase the difficulty. Some battles can have a total of 5 fireballs shooting all around at once for a truly hectic experience.This is only where the fun begins with this remake. New to the world of Warlords are the Snoots, a sort of minion that can be controlled by the player to tip the scales in battle. Players are in control of the Snoot captain holding the flag of your castle. You can move the Snoot captain with the left analog stick around the play field and the other Snoots will follow to where he is positioned. Placing a captain near an enemy castle will tell your Snoots to attack their walls, while placing a captain near your own castle will make the Snoots repair any damage youve taken. The play fields also have some power-up plates that can be collected by placing your Snoot captain on one of them, and having enough minions follow the captain to it and fill the control meter. Once the meter is filled, you gain that power-up. The power-ups range from reversing the direction of the opponents shields, to making every fireball you deflect a power shot.Power-ups and minions arent the only additions to the battle. Occasionally the evil Black Knight will appear, taking control of all the power-up plates and flooding the field with his own minions. This giant Knightmare (pun intended) will kill your minions and attack your walls with devastating force and can really leave you in a world of hurt. You could be dominating the battle, only to have him appear and tip the scales against you in a heartbeat. His sudden appearance in a battle is something you will find annoying and unfair at times. The only way to get rid of him is to have your minions reclaim all three power-up plates, while fighting off his evil minions. Fortunately his appearance also spawns the White Knight shield that can, once collected by your Snoot captain, make your minions immune to the Black Knights Snoots.Single player and Multiplayer modes offer battles with up to 4 opponents with different rules. You can choose from 1 on 1, 2 on 2, Free for all and Classic if you want to play without the Snoots or power-ups. In this mode however, matches can last upwards to 20 minutes with no victor, so be prepared for some marathon volleys. Online mode offers all of the above, but matches were hard to find and if there was an open game, it was hindered by lag and strange connection issues. If they do patch the online mode in the near future, it may add to the replay value. But for right now it really doesnt work well.Graphics for the play fields are colorful and moderately detailed. The characters are presented in a type of chibi style and sort of fit in with the wackiness of the entire game. Sound effects and Music are standard flair and nothing to write home about. Nothing about the overall presentation is bad, but its nothing that will blow you away.", "date": "October 17, 2012", "grade": "B+"}