{"name": "Pro Evolution Soccer 2013", "ref": "https://gaming-age.com/2012/10/pro-evolution-soccer-2013-review-for-xbox-360-ps3/", "text": "Konami has had a difficult time reaching their American fan base since coming over to the next generation of consoles with their Pro Evolution Soccer franchise. Lets be honest, on the PS2 and original Xbox, as far as quality and authenticity is concerned, this team couldnt be touched, even by the great EA and their FIFA franchise. Leap forward over a half decade later and they are still making up ground, but no longer is it a blowout. Instead it could be a matter of choice this year for this team as Pro Evolution Soccer 2013 finally catches up in quality and depth, even if it still lags behind in terms of visuals and A.I. Without a doubt though, this is a series worth considering, especially if you feel that FIFA may have phoned in their efforts this season and are looking for another option to get your soccer fix.Visually PES13 doesnt look or sound bad, but it still isnt nearly as detailed or sharp on the presentation as it could be. The player models move extremely well and the animation is brilliant and flows together nicely. While they dont get the faces exactly right, the detailed and animated expressions come though nicely using a new technology that ports over the physical features and skills of the worlds top players and even includes authentic celebrations and goal reactions. As an extra bonus, if you have the old school Vision Camera on the 360, you can put your face in the game in solo career mode. The stadiums are well lit, and unlike FIFA, will supply the right amount of crowds in the stadium for the game that is in progress, even if the audio doesnt match the number of people in the stands. The game does a decent job replicating TV style presentation, and the replays are remarkable and even are brought to you in multiple angles to show you how you achieved that great moment on the pitch. Commentary is fine, but the duo just doesnt seem to keep up the chatter throughout the game as there is too much dead air between big plays more often than not. Overall the audio and visual package gets the job done, but is easily one of the games weakest points.The play on the pitch is where fans will get that oh yeah, I remember you feeling all over again as the game plays brilliantly thanks to a new control schemed labeled PES Full Control allowing gamers to dribble and pass however they choose, trap and move the ball to create flowing movement, and better time their defensive moves allowing for better accuracy, timing, and options to break up the play. While the controls have gotten the proper overhaul, the games A.I. still lags behind the competition and can be very gullible for moves and plays on the pitch that work nearly every time we like to call them money plays. This isnt to say that the CPU doesnt play fair, but you really have to set your level of skill to the highest degree to get an even match up, and even then can feel unbalance as far as shots, time of possession, and goals are concerned which all end up feeling nearly like an arcade game with simulation intentions.There is a wealth of options to play though from single player career modes to online friendlies that will keep you playing throughout the entire season. The online community suffers in PES because either Konami knows its fan base isnt as strong, or they havent quite gotten the knack of bringing souls together to join in on a huge all-out online franchise mode. Even so, the online play is pretty smooth with very little lag, so at least the servers will provide strong stability to complete each game with very little hitches.", "date": "October 5, 2012", "grade": "B"}