{"name": "RPG Time: The Legend of Wright", "ref": "https://gaming-age.com/2022/11/rpg-time-the-legend-of-wright-review-for-nintendo-switch-pc-xbox-playstation/", "text": "Heres a criticism I dont usually have for games: RPG Time: The Legend of Wright is a little too inventive.Obviously, as complaints go, thats not a bad one. Its probably better for a game to have too many ideas than to have not enough  and make no mistake, The Legend of Wright is overflowing with ideas. Its just that all those ideas have a tendency to get in the way of each other. One minute in The Legend of Wright youre playing Whack-A-Mole, the next youre gathering worms, the next youre playing Rock Em Sock Em Robots, and still the next youre playing baseball. Elements of bullet hell shmups sit alongside JRPG gameplay, and both of them intermingle with point-and-click adventure gaming and racing. Theres a lot going on in this game  which kind of makes sense when you consider that the in-game story is that the game was created by a 10-year-old. Kids generally arent known for being able to keep their focus on one thing for extended periods of time, so from that perspective, it would stand to reason that a game created by one bounces from idea to idea.But that doesnt make it pleasant to play. While on some level its fun to play something where youll never get bored because it never stays on one topic long enough for that to happen, at a certain point you kind of wish The Legend of Wright would stay on one thing for longer than a few minutes and stop being so hyperactive. (And yes, I realize how old I sound saying that.)It also doesnt help that the 10-year-old is really annoying. Again, I know that kids love talking, and it can be a delight to hear them talk about random subjects at length, but in the case of The Legend of Wright, it detracts from the gameplay. You do something for a moment or two, then the narrator feels the need to chime in with his comments. It doesnt matter where you are in the game, he cant help but tell you his thoughts, taking you out of the flow of the game as you work your way through the extra text. The other flaw in The Legend of Wright is that theres no obvious way to save or quit the game. Auto-saving works well enough, I guess, but at the same time, you never can tell exactly when it kicks in, which means you sometimes lose your spot because you cant tell if the game has saved what youve just done. But if youre okay with that uncertainty, and really okay with crazy hyperactivity, I could totally see why someone would love RPG Time: The Legend of Wright. Its a love letter to gaming  as in, a love letter to almost every genre you can think of  and its designed to look like someone drew it up in a notebook, which only adds to the charm. Its all over the place, but if you want something unlike anything else, this is the game youre after.", "date": "November 17, 2022", "grade": "B-"}