{"name": "Resident Evil 6", "ref": "https://gaming-age.com/2012/10/resident-evil-6-review-for-xbox-360-ps3/", "text": "Its been a little over three years since the last numbered Resident Evil graced home consoles. Weve seen a couple spin-offs since then, namely Resident Evil: Mercenaries and Resident Evil: Revelations, along with the pretty poor Operation Raccoon City, but fans have definitely been clamoring for another true sequel, and Resident Evil 6 looks to deliver on that. And for the most part it does a pretty good job of delivering a solid, action-packed modern Resident Evil experience that takes a number of cues from previous titles, but manages to pull together into something fairly unique for the series.One of the biggest factors contributing to that uniqueness is the way the campaign is crafted this time out. Consisting of three campaigns, and one unlockable, players will get to control series favorites like Leon Kennedy, Chris Redfield, and Sherry Birkin, who are paired up with newcomers Helena Harper, Piers Evans, and Jake Muller, respectively. Even though the fourth campaign is more or less public knowledge, Ill not divulge the spoiler of who youll play as, but I will say series fans will be pretty happy with that particular protagonist, and the way that campaign plays out.So essentially youre getting four different RE games in one cohesive package. And its a pretty good value if you want to factor in how long it will take to complete each storyline, which averages out to about an hour or more for each of the five chapters contained in a single campaign. I finished the game with a playtime of about 22 hours, and thats without searching heavily for the hidden breakable icons scattered about in each chapter. And if you want to play from your teammates perspective, which I think is worth doing for sections that involve branching paths, youll find yourself spending a fair amount of time with the campaign alone.But the campaign isnt the only thing worth checking out in Resident Evil 6. The fan favorite Mercenaries mode returns, featuring three playable maps, and multiple characters culled from the campaign. Some of these maps and characters are unlocks doled out by completing the campaigns themselves, but from the onset of the game youll have access to an initial map set in China, with access to Chris, Leon, and Jake as playable characters. Mercenaries mode is once again best experienced with a friend in tow, and you can pull someone in via local split-screen, or through online play. Online seems to work pretty well from my limited experience, its easy enough to find players, search through a number of parameters, and get a game going quickly. Lag doesnt seem to be an issue provided the connection strength of both players is up to speed, and the handful of rounds I played went off without a hitch.And in general, the online side of things for Resident Evil 6 is handled quite well. The campaign also features offline and online co-op, and again, there are a lot of search parameters when looking for someone to play with. You can even search by intent, like playing for the story, playing for fun only, searching for medals, or looking for serious players only. You can also search by region, difficulty, and whether youd allow the use of unlimited ammo, and Agent Hunt.Speaking of, Agent Hunt is a pretty unique mode that allows you to jump into a participating players campaigns as one of the bad guys. This role will vary from campaign to campaign, but youll have the limited move set, mobility and special attacks that are featured for each creature you can play as. Its kind of fun to screw around in someone elses campaign for a bit, and see if you can score a kill or two, but keep in mind that youre generally going to be overpowered by an aware player. Killing one of the main characters is hardly easy, but ends up being pretty satisfying when you manage to pull it off.But enough about modes and online features, how does Resident Evil 6 actually play? As mentioned previously, each campaign is more or less its own game, and as such has a certain model or play style to it that manages to make them stand out from one another. For instance, Leons campaign is more deliberately placed, against foes that arent particularly skilled offensively, but will swarm and overwhelm you if you let them. Some of the more challenging sections of Leon and Helenas campaign involve areas that pin you into a location and have you fending off hordes of undead and other creatures while you wait for a scripted event to occur, a door to unlock or some other time constrained event. Other campaigns certainly feature similar things, but Leons definitely focuses on survival with limited movement, and overall avoidance if possible, leading to a more hectic, tense experience than the others.However, for Chriss campaign its almost the exact opposite. Chris plays very much like youd expect him to coming out of Resident Evil 5. His weaponry is bigger, his enemies are smarter, and overall his campaign feels more like a third person shooter than a standard Resident Evil experience. And it actually does a pretty good job with that feeling, more so than the tepid experience delivered by Resident Evil: Operation Raccoon City. The added mobility of being able to shoot and move at the same time is a huge plus, but the addition of a cover system feels sort of unnecessary. The cover system in general feels kind of awkward, and I found myself rarely needing to make use of it throughout the entire game.The third campaign, featuring Jake Muller and Sherry Birkin, feels a little more like a blend of the previous two. Jake has a unique hand to hand combat ability, and while the game as a whole does place a pretty heavy emphasis on melee attacks, Jake has a couple special moves up his sleeve that make him a far more capable fighter. Theres still a hefty amount of action in Jake and Sherrys campaign, but some of the action gets bogged down in some tiresome vehicle sections that can be annoyingly difficult due to some sluggish controls and poor visibility. I really like the addition of Jake as a new character, more so than anyone introduced to the series since RE4, but I definitely feel like his campaign is the weakest of the three. All of the campaigns have some uneven moments, but Jake and Sherry seem to suffer the most in overall quality. One thing about their campaign that I do love is the near constant threat of a Tyrant like creature that hounds them at different points, and is one of the standout monster designs in the whole game.The fourth campaign, unlocked after completing the other three, does a great job from a story perspective of filling in certain gaps. It also offers up more puzzle solving elements than any other campaign, which helps to give it a certain old school Resident Evil feel. However, its the shortest campaign in the game, with stages that only take about a half hour or so to complete. It doesnt feel rushed in a design or quality sense, but certainly doesnt feel quite as involved as the other three. I could have spent a lot more time in this particular campaign, and I have a feeling that it will stand out as one of the favorites for most old-school RE fans.One thing that Resident Evil 6 does suffer from, as a result of this multi-campaign structure, is a certain level of unavoidable repetitiveness. Each campaign features points where the other characters show up and interact in some way. Typically this involves a boss fight, which in turn means youll be going through that same boss fight multiple times. Also, at these points, the cutscenes dont differ from one another, so youll also be stuck watching the same scene play out again. You can thankfully skip these scenes and get right to the action, but performing the exact same mission or fight over again can get a little tiresome. Occasionally characters will split off or pair up in an effort to give you a fresh experience the second time around, but those moments are pretty short.However, outside of some uneven campaign moments, an annoying reliance on QTE segments, and some repetitive bits shared between campaigns, Resident Evil 6 ends up being a really satisfying romp through the world of Resident Evil, and makes for a welcome sequel. It paves some new ground for the series, and unlike RE 5, doesnt feel like its cowering in the large shadow of the excellent Resident Evil 4. It certainly offers up familiar elements introduced in both games, but tries for a different experience, along with a unique campaign structure that stands out from the rest of the series. Its also a pretty sharp looking game, and while early demos displayed some technical hiccups, Capcom seems to have done a pretty solid job of ironing out the issues.", "date": "October 1, 2012", "grade": "B+"}