{"name": "R.A.W.  Realms of Ancient War", "ref": "https://gaming-age.com/2012/09/r-a-w-realms-of-ancient-war-review-for-xbla-psn/", "text": "Until that fateful day that Blizzard decides to bring Diablo 3 to consoles, R.A.W.  Realms of Ancient War can serve as a suitable replacement for fans.R.A.W.  Realms of Ancient War is a new heroic-fantasy hacknslash that takes you on a continent ravaged by death and destruction. Take control of a powerful Warrior, a dark Sorcerer or a Rogue master of stealth, and jump into a dark quest to free the world of a sinister evil. Take on hordes of monsters, loot weapons and magic items from the lifeless bodies of your opponents and random chests, and develop the power of your hero! Fans of the Diablo series will feel right at home here, as the overall presentation is borrowed heavily from Blizzard Entertainments action/RPG.The game begins with the player selecting a class. You can choose from The Warrior who is really good at taking on hordes of baddies. The Wizard who can dish out more damage, but is better with long range attacks, and The Rouge who is efficient with arrows and daggers. From there, you are given an explanation of your first quest and off you go! You can pick up more quests along the way that further the story, and many side quests that can be completed for extra bonuses. When you start, you are given 3 soul gems, which serve as your lives. You can acquire more throughout the game, but if you manage to run out of them, you will lose your characters loot, weapons, and even your level progression and have to begin the quest over again!Usually without a keyboard and a mouse, this type of game is somewhat awkward to play with a controller. But Wizarbox simplified this by creating a simple to understand control scheme that fits well even for people who never played this type of game before. The left analog controls your hero, with X,Y,B,A controlling your attacking skills. Start will pause the action and give you a chance to check your inventory, equip new weapons and armor or upgrade your skills when you level up. If you get lost during a quest, a simple click of the left stick will bring up a quest compass to get you back on track.As you take damage or use special skills, your life and mana will run down. It can be replenished 2 ways, either by falling back from combat and waiting, or using one of many potions picked up during battle or purchased at village shops. Thankfully, there wont be a need to pause the game to use these potions, as they are conveniently mapped to LT and RT for ease of use. One thing that stands out from other hacknslash games of this type is the possession mechanism, where your character can temporally possess a larger monster and take on enemies or find hidden portals.Game modes offer a bare bones experience only offering single player and local co-op. There is no online play to speak of, which is kind of disappointing since this type of game really shines when you team up online. The local Co-Op is presented very well, with no slowdown or lack of challenge. It really does enhance the experience playing with a friend.The environments and settings look nice, but are mostly for show, as you cant interact with 90% of it. So no smashing barrels and crates for extra loot and rare weapons. The camera is fixed at a high perspective with no zoom or extra angles, but the character models and surroundings look sharp and well lit. The sound is a bit of a miss, with some sound effects missing their mark. Sometimes it will sound like you connected with an enemy, but most of the time the only way you know you won a fight is by seeing a death animation. Occasionally I lost a life because I didnt hear the cries of my character dying in a large group of enemies.", "date": "September 28, 2012", "grade": "B+"}