{"name": "Torchlight II", "ref": "https://gaming-age.com/2012/09/torchlight-ii-review-for-pc/", "text": "If youve been looking for a video game thatll absolutely devour every waking moment you have, then you need look no further than Runic Games Torchlight II. The long-awaited follow up to their wildly successful action RPG from 2009, Torchlight II delivers more of the same loot hoarding, fantasy style, action RPG gameplay found in the first game, but with a handful of refinements and one big addition of online and local co-op. The co-op angle is certainly one of the most noteworthy additions, and something fans have been clamoring for since the original game, and Im happy to say that outside of a few kinks, co-op works pretty well.And the rest of the game is an absolute joy to play. Even if you opt to play through the game solo, which I tend to do in these types of games, youll get a ton of enjoyment out of Torchlight II, which is impressive considering its low asking price. For $20 youre getting an experience that easily rivals, if not trumps in some areas, another particularly high profile, $60 game within the same genre. Torchlight II delivers in spades when it comes to world content, exploration, and loot. SO. MUCH. LOOT.The plot for Torchlight II isnt exactly its selling point, but it does the job of getting your character, selected across four classes, out into the world and exploring the randomly generated maps and dungeons. The four classes, Berzerker, Engineer, Embermage, and Outlander, provide some pretty distinct play styles, with hefty skill trees to explore throughout the 100 level cap. Thats right, 100 levels, meaning that you can devote a whole lot of time to each character if youre willing to do so, and the end result will net you a whole lot of skill points to distribute, allowing a lot of freedom to explore the three skill trees for each class.The skill trees make a lot of room for that number of skill points as well, with each ability typically allowing around 15 points to be dumped into it, with most abilities incorporating multiple tiers. So after hitting tier 2 or 3 youll gain some type of boost to that ability thatll make it generally better than before. Theres still a level cap in place for abilities, so you cant necessarily min/max, but youll have no trouble finding something worthwhile to do with that recently earned point.Leveling also comes fast and furious. The benefit to having such a large leveling cap right out of the gate is that the game isnt afraid to let you ding on up to a new level on a pretty frequent basis. This just adds to that carrot on a stick feeling thats already present by the ridiculous amount of worthwhile loot that drops nearly every time you kill any kind of named mob, and helps to keep you interested in the game for that much longer. Its no joke when I say that youll have a hell of a time pulling yourself away from the game, and youll easily let hours of time slip by throughout each session.The only arena that Torchlight II doesnt shine as strongly in as its competitors is that the combat can feel a little flat and under-produced. Without some more face time with other classes, Ive been using a Berzerker as my main here, Im not sure if this applies strictly to the melee in the game, but theres an oomph lacking to fights in Torchlight II that does cause my interest to wander a bit. This is less from the abilities, which there are plenty to check out, and more from the audio/visual side of the game. Knocking my axe, sword, or claw fists against any sort of monster never seems to carry any kind of weight to it, and feels like something akin to plastic toys smacking against each other. Theres just a lack of production value in the combat system that surprisingly hinders the overall feel of the game, and is something that sorely needs to be enhanced.", "date": "September 24, 2012", "grade": "A"}