{"name": "NHL 13", "ref": "https://gaming-age.com/2012/09/nhl-13-review-for-xbox-360-ps3/", "text": "This morning I awoke to the realization that the collective bargaining agreement deadline passed with no agreement, so it looks like a lockout for this year is upon us. Unless talks resume and a miracle happens that also may mean no NHL hockey, which is huge considering it is a six month sport! While the players may not be delivering the hits on the ice, EA is still delivering a hit of their own in the form of NHL 13, and hoping like last years NBA season, talks resume and we can salvage some NHL action this year, if albeit, abbreviated.Of course this lockout means that one of NHL 13s new features will be completely useless unless the season resumes, as Im referring to of course the NHL Moments Live mode, but more on that later. What the NHL series has done for many years is not only improve on their product from year to year, but have done so in a way that they have won many sports Game of the Year awards. This year I feel the series, while still improved, has not made the leaps that I was hoping for in new features and innovations, compared especially to EAs latest Madden offering which is amazing. What fans are left with this year is a better looking and playing game than they have ever experienced, but the way you play it, including the modes and features, just seem a bit too familiar, especially if you own NHL 12.Visually the games player models, arenas, and even some additional presentation camera shots have gotten a facelift and are improved in every sense of the word. The coaches, the players, and heck even the fans are given tons of new polygons to their structure, and as far as the players and coaches are concerned, they have more of them who look just like their real life counterparts. I was saddened to see the Game Face feature not make it into NHL this year, especially since it was in Madden and their faces are mostly covered up.The audio didnt get the same upgraded love as far as commentary is concerned. While the dynamic duo still do a great job as always, and even if their commentary is different on a majority of what they say, including during replay analysis, its just becoming too familiar and I think its time we get a new booth to spew out the play by plays. The crowd on the other hand is remarkable, and while this is nothing new to fans of the series, even veterans like myself will be pleasantly surprised. In just the opening couple of minutes you play the game, it isnt difficult to hear just how interactive, responsive, and life like this new crowd audio really is. This also holds true for the on rink audio it seems the microphone work for hits, pad checks, and even pings off the post have been better implemented and sound dead on.NHL, as always, plays a brilliant game of hockey, but this is the first time I can remember that it feelswellright. What I mean is out of the box, and setting the game to my usual difficulty level, the game plays tough but fair and more like a real game ought to. There is just the right amount of hits, checks, shots on goals and goals, and this isnt even touching on little things like close games, and blow outs that come randomly without feeling like the CPU is keeping the scores close using that nasty rubber band A.I., which is nowhere to be seen here. Ive played over 30 games already and each one feels different from the last in terms of how players react, fight, hit, score, and even play on their home ice. This is the first year I didnt have to rely on new tuner sets or checking online blogs for the best settings for my sliders, againit just feels right! A big part of this could be contributed to the games new player physics scheme labeled True Performance Skating, which is all based off momentum and is very impressive.Where NHL 13 takes one just high off the crossbar is the features that keep you playing. This isnt to say the game doesnt have every mode, including the proverbial kitchen sink, as it does. What it doesnt seem to have is vast improvements in any of them with the exception of the online Be a GM mode, which is now renamed GM Connected. This mode now allows you to connect with up to 750 other people and you can choose your role to play as either player, a commissioner, or a GM and play the game in 5 unique ways including Vs the CPU, User vs. User, Co Op or Online Team Play, Build your AI, or just sit back and coach. You can even connect online with your mobile device and make critical calls from anywhere that could affect decision making in your online league. Other modes such as the offline GM mode have seen little touches of improvement such as mobile phone use to call your coach (this one is an in game virtual phone) make changes, and demand better performance. The CPU logic for player moves including trades and line edits seems to have gotten a boost as well. Otherwise, most of the modes including Be a Player and even Ultimate Hockey have kind of gotten the cold shoulder in the wake of the new GM online mode.", "date": "September 18, 2012", "grade": "B+"}