{"name": "Assassins Creed: The Ezio Collection", "ref": "https://gaming-age.com/2022/03/assassins-creed-the-ezio-collection-review-for-nintendo-switch/", "text": "Lets be honest: theres not much (or anything) new to say about Assassins Creed: The Ezio Collection at this point. Not only is it a repackaging of a remaster that first came out on PS4 and Xbox One back in 2016, the newest of these games  Assassins Creed: Revelations  came out more than a decade ago. Whatever there is to be said about these three games has surely been said at some time in the past thirteen years.(In fact, Ill pause here and link to what Benny wrote about this collection back in early 2017. A lot of it still applies.)The biggest, most obvious thing about The Ezio Collection is how familiar it all feels. Even if you havent played these games recently (or ever), Assassins Creed II is basically a template for many of the open-world games that have come out since it debuted in 2009. Not only can you still see echoes of it in all the Assassins Creed games that have come since, you can also see its influence in the likes of Watch Dogs and Far Cry (and plenty of other non-Ubisoft open-world titles, too). Despite the worlds being littered with sidequests, they still start to blend together after a while and feel pretty same-y. It frequently makes all three of these games (ACII, plus Brotherhood and Revelations) feel like a repetitive slog, particularly if you choose to play them one after the other.The other way that The Ezio Collection feels familiar is in the parkour. It may still have been slightly novel back when ACII came out to jump your way up a tall building, but with the benefit of thirteen years of it, the newness has definitely worn off. It also doesnt help that the parkouring feels so imprecise here, which can definitely lead to a lot of frustration  say what you will about the more modern Assassins Creed games, but the controls are very superior to what they were way back when the series started.That said, even if The Ezio Collection feels a little overfamiliar, the three games here are still worth playing now that theyre on the Switch. The story, for starters, is more ambitious than anything the series has tried since. Admittedly, this also means it feels a little overstuffed and twist-heavy at times, but if youre after a narrative that tries to sustain itself for a few dozen hours, youll get that here.Ill also note that The Ezio Collection feels like it performs better than either of the previous Assassins Creed games on the Switch. While no one is ever going to mistake it for the best-looking game the system has to offer, at the same time, it doesnt feel like there are as many hiccups as there were on Assassins Creed III or The Rebel Collection, nor were there as many concessions. True, these games also feel smaller in scale, but thats not the worst thing in the world.But still, its hard to shake the feeling that Assassins Creed: The Ezio Collection almost feels like a history exhibit at this point. We may still be living with its legacy  and to be clear, its fun to play these games if you never did the first time around  its hard not to feel like its been surpassed by a lot of the games it influenced.", "date": "March 8, 2022", "grade": "B"}