{"name": "SEGA AGES Gain Ground", "ref": "https://gaming-age.com/2019/04/sega-ages-gain-ground-review-for-nintendo-switch/", "text": "If you were around in the late 80s then you got to be a part of a great arcade era that is only a memory now. And you also got to play games like Gain Ground which was a fun diversion from other offerings in that it wasnt the most advanced game but the real-time combat offered good times with its multiplayer offerings and many character types to unlock.This game also received several console ports to things like the Genesis and Turbografx but the Switch is now home to the original arcade game which has now joined the ranks of other ports in the SEGA AGES line. And you know what it still kind of holds up for some great local co-op! You can even play with up to three players on the international version which wasnt possible on said console ports or in Japanese arcades, so grab your kids or drinking buddies and lets dig in.The game consists of single screens filled with enemies you must slay. There are also friendly characters you can rescue by walking over them and making it to an exit area which has the big letters EXIT in a surrounding box. So in other to progress you must defeat your foes but if you do so with a friendly character still at your side then you wont have access to that new class once you move on. So make sure to get your friends to safety!This is part of the games strategy since it will take some decision making to plan who you will use to rescue and who will be better to just go in and kill everyone. Maybe you want to destroy most of the enemies first and swap out for a different class at the exit before going back to save the friendlies, or maybe youre better equipped to take out only the enemies on a higher platform than taking everyone head-on. The choice is yours but making these decisions wisely will be the key to your success.I personally enjoyed seeing how far I could get back in the arcades just to see what each new character could do. But if you want to skip all that theres now a Full Member Mode mode to enjoy with all characters unlocked. Now this is the good stuff! Its a great way to take a break from chipping away at the original mode and experiment with the different classes right away to get a good idea of how characters play off each other over time.Also offered here is a vertical mode, or tate if you play a lot of Japanese shmups. Is it still tate if its not a shump? So in this mode you can take the Switch and set it in a vertical fashion either flat on a table or standing upright for a more arcade-like viewing experience to appreciate how the game was back in arcades. But you can also do this on your TV so go ahead and set your 72 screen on its side and laugh at those who had to settle for a smaller screen 30 years ago!My only complaint about the vertical setting is that this doesnt affect the top-level AGES menu so youll still be turning your head sideways to navigate those menus. If the ability to change this exists then I couldnt find it. Beyond this are the regular M2 offerings of different regions and for this game a rewind feature to correct those stupid mistakes youre gonna make.But Gain Ground is also one of those games people either love or hate even back in the day. And if Im being honest it hasnt aged well but my nostalgia allows me to enjoy it, so while $8 isnt a big investment I also cant recommend it to everyone. Why this is in the AGES line might just be for M2 to show off the vertical mode and join the ranks of only a few games which take advantage of this on the Switch because otherwise its more of a very well ported historical piece. Will I spend more time with it? Probably not after I put my big screen TV back in an upright position.", "date": "April 5, 2019", "grade": "B+"}