{"name": "Shadow Warrior 3", "ref": "https://gaming-age.com/2022/03/shadow-warrior-3-review-for-pc-ps4-xbox-one/", "text": "Having never played a Shadow Warrior game before, I was entirely unprepared for just how much absurd fun this game is. I have eyed the previous two games on Steam during various sales but always seemed to have something else on my plate at the time and ultimately passed on them. After having spent a weekend with Shadow Warrior 3, I feel like I made a mistake skipping out. This game is not genre-defining, not world-shaking, or game-changing. It is simple, straightforward, *short*, but a hell of a lot of fun.You play as Lo Wang, picking up right where it seems the second game left off. There is a gigantic mythical dragon bringing about the apocalypse, and Lo Wang believes everyone and everything that could help him has been lost or killed. He quickly learns that is not the case however and proceeds to start working to set things right. The game throws you right into the fray, with a short combat and movement tutorial. After that, Shadow Warrior 3 just takes off.I will throw a disclaimer on here, for anyone like myself who was entirely unfamiliar with this series. The dialogue and general feeling of the game are incredibly low-brow; full of fart jokes and one-liners that will either keep you laughing all the way through or will be insufferable after the first 10 minutes. I do not think there will be a middle ground here. Shadow Warrior 3 ranks a 12/10 on the absurdity/high school humor scale. I personally did not mind it and felt like it fit the feeling of the game overall, but it will absolutely not be something for everyone.When Lo Wang is not cracking wise about his low wang, he is killing Yokai. This is accomplished with a combination of firearms and a Katana. The super-fast-paced, arena-style shooting takes center stage when combat starts and the movement and flow of the system are some of the best I have played recently, outside of the ostensibly untouchable Doom (2016). Ammo and Health are relatively plentiful around the arenas, and every enemy drops one of the two, depending on the method you use to kill them. Katana kills net ammo, while firearm kills get you health. Keeping track of those resources is vital, and helps determine the approach you will take in each combat encounter.The firearms are varied enough to be interesting but do not include any real stand-out performers. Each one works better in various situations, which really makes cycling through them fun and stress-free because everything *can* work everywhere for the most part. Katana combat is much less varied but no less satisfying.Shadow Warrior 3 is a pretty short game, I finished the main story in just over 7 hours. Unfortunately, it kind of runs out of steam about halfway through. The number of upgrades are pretty limited, and you reach what feels like maximum potential relatively quickly. After that, you pretty much mow through everything until you reach high-level enemies, which just become a DPS check, which bogs down that sense of free-flowing combat and movement and becomes almost a hit-and-run fight. This change in the pacing of the game, with no real option to get strong enough to recover that speed in combat puts a bit of a sour note on the final few hours.Additionally, while I really did enjoy the game, and had a ton of fun learning the combat rhythm and mechanics, I will probably never go back for a second playthrough. As I mentioned earlier, the game is full of the lowest type of humor imaginable, and by the end of the game, the same batch of one-liners that had me chuckling during the opening hours was starting to grate. That, coupled with the singular playstyle and set of upgrades, make for a poor reason to start a second playthrough. While launching at only $50, coming in competing with some of the finest video games of this (or any generation), make it hard to justify an early purchase. (It is also worth noting that it is a day 1 title on Playstation Now) If the other games are any indication, it will most likely get a steep discount in an upcoming sale, which would probably be the best time to pick this up. If you cant wait though, and you know what you are getting into, you will absolutely have a blast for 7-10 hours.", "date": "March 7, 2022", "grade": "B-"}