{"name": "Transformers: Fall of Cybertron", "ref": "https://gaming-age.com/2012/08/transformers-fall-of-cybertron-review-for-xbox-360-ps3-pc/", "text": "Transformers: Fall of Cybertron, from developer High Moon Studios, feels like a pretty solid improvement over their original effort, War For Cybertron. I wasnt a huge fan of WFC, and found that its campaign left a lot to be desired outside of showcasing the classic G1 characters that Transformers fans know and love. Fall of Cybertron delivers a more bombastic campaign that left me far more satisfied, and actually wanting more. So if youre like me, and were initially put-off by their earlier efforts, then I think youll find this is worth checking out.The game still focuses heavily on the G1 cast, and doesnt venture into territory that wasnt covered by the original game, outside of a handful of additions. One of the biggest for fans will definitely be the Dinobots, headlined by a playable Grimlock section that feels wholly different from anything else in the game. But the overall level variety provided by the different characters is really the main selling point of FoC for me, with each level offering up some pretty unique experiences that help each sequence stand apart from one another.For instance, theres a stage where youll get to control Cliffjumper, who offers up a level design thats taking a small cue from Metal Gear Solid. The emphasis on stealth is pretty massive, with Cliffjumper having a secondary skill that allows him to cloak for a limited time, sneaking up behind bad guys and performing spectacular executions. Hes not limited to that one mechanic though, and can also switch into vehicle form to take advantage of numerous spots that allow him to travel through passages in walls, predicting enemy routes and taking them out one by one. His vehicle form even comes with a sort of scanning tech that allows him to spot enemies from afar with little markers to let you know where they are.Thats immediately followed by a stage where youll take control of Jazz, who comes with an ability thats not unlike the hookshot found in Zelda games. Jazz can use this electric whip to latch onto nearby ledges and pull himself up, or can use the whip to tear down walls, doors, and structures to make bridges. His entire level is smartly designed around this concept, and plays differently than any other stage featuring the Autobots and Decepticons.Its this variety in the stage design that kept me planted in my seat for the 7 hours or so it took to finish the game. And while Ive got a number of collectible items left to find, I have no issue with wanting to jump back into the game and experience the campaign all over again, as its certainly good enough to warrant multiple playthroughs. Youll find that the core shooting and vehicle switching doesnt feel that different from War for Cybertron, but the shooting mechanics and controls were never the issue for me with that game. The level design in Fall of Cybertron is head over heels better than WFC, and it also provides some seriously impressive playgrounds to toy around in, with some equally impressive sequences of scripted action to enjoy.Fall of Cybertron also tosses in the expected multiplayer mode, similar to what we saw in War for Cybertron, and the Dark of the Moon movie tie-in game. Multiplayer is divided up into four modes, three of which tread familiar ground like Team Deathmatch, Capture the Flag, Conquest (think King of the Hill). The fourth mode is a little more unique, dubbed Head Hunter, which has you killing enemies and then returning dropped orbs to a central location to score points for your team.Map variety is decent enough, with the ability to vote between a couple maps which have become pretty standard for third person and first person shooters. My only real complaint is that some of the maps feel a bit too big for the amount of players involved, with certain maps involving large stretches devoid of player contact. Obviously vehicle mode helps to alleviate some of the downtime, but it often feels like it takes too much time to get back into the fight.One big feature in multiplayer mode is the customization option for your given robot. The Transformers are divided up into four classes, like Scientist, Destroyer and so on, which dictate their overall size and weapons they can use. Weapons have upgrades that are unlocked by gaining levels, along with some limited perks to outfit each class with. There are multiple slots for each class, so you can customize loadouts a bit, but the slots also need to be unlocked by gaining levels for each class through play.There are some hefty customization options when it comes to creating the actual look of your Transformer as well, with different parts that are interchangeable and a fair number of paint scheme combinations to help you stand out from the pack, along with a metallic sheen slider to adjust. I appreciate the number of options given to make your character feel unique, and its fun to toy around with in between matches.The actual online play feels pretty solid too, with little in the way of lag or technical issues. I did encounter an occasional problem, like all players not loading into the match from the lobby, which led to a weird one on one encounter for about 10 minutes or so, but overall the launch seems to be pretty smooth.", "date": "August 28, 2012", "grade": "A-"}