{"name": "Madden NFL 13", "ref": "https://gaming-age.com/2012/08/madden-nfl-13-review-for-xbox-360-ps3/", "text": "Its no secret that the Madden Franchise stumbled out of blocks upon its next generation arrival on the 360 and PS3; in fact many will say it took a good 4 incarnations in order to find themselves as a franchise again. Last year the franchise made great strides in where the company wanted to take this series and attempted to finally get past the comparison to NFL 2K5, for good. I can truly say with great confidence that Madden NFL 13 not only brings a football experience to those holding out for a reincarnation of the 2K franchise, but may be, arguably, the best the series has ever seen if for one reason and one reason only  realism. From the games look, to the physics, to the pacing and flow of the game, the methodical game of football has seen its most accurate representation the sport has ever seen and is coming closer to blurring the lines between reality and video game.The visual and presentation side of the coin you are welcomed to a new play by play team, not only in audio form, but in a new virtual booth that closely resembles an actual CBS broadcast. Featuring hosts Phil Sims and Jim Nantz, they do a great job of not only setting up each days match up, but calling the game as well. While still not to the caliber of NBA 2Ks nonstop chatter commentary, the dynamic duo does a great job of not allowing a lot of dead air between plays. Its true that you will hear a lot of the same scenario one liners time and time again, but thats generally par for the course when you are dealing with sports games. At least the team keeps it entertaining throughout each game and is about 95 percent accurate on calls, with only a few hiccups here and there on yards and situational calls.The crowd and atmosphere has really been enhanced with reactive crowd cheering and jeering, stadium reflective chants and noises for first downs and big plays, and finally a real emphasis on critical plays especially in the red zone. In this situation, crowds will be very loud if a defense stop is needed, but can be very quiet if the home town QB is trying to call off audible plays on the goal line.One of the biggest upgrades noticeably is the new graphics engine that not only makes use of new camera angles, side line cut scenes, reactions of play on the field, but the character models look the best they have ever looked in a football game and finally each player not only has the correct proportional definition, but their face and likeness is ported into the game as well. This makes the inclusion of the Game Face featuring being used for the first time in the series a real plus as well, as now you can upload your own face into the game as a player or coach and see yourself actually be held accountable for all the big plays.Where the engine really becomes noticeable is the new physics engine that finally puts behind days of floaty footwork, canned animations, and false yardage. Thanks to the new Infinity Engine things such as mass, speed, power, all come into play when making big plays or tackles. The first time you actually see players stumble over others, trip and slip, lose possession when another player hits the football just right or pulls off that impressive tip toe catch along the sidelines, it is something that will take quite some time to get old. We have never seen dedication to physics in the series like this before, which all but solidifies the realism the team was going for. Even if sometimes a player falling over another after a play or a hand off comes off looking silly due to the nature of the collision, its hard to deny just how next generation this engine is.While all the stadiums are intricately detailed, it is sad to see that there is no real field degeneration or dirty uniforms this year, which takes all but a near perfect visual engine and gives it a scar or two.The games AI has also seen a major lift in realism as awareness is at an all time high. Even on the games default setting of Pro, gamers can expect unpredictability and a very good challenge as the offenses will change things up at the line, throw the ball away, switch up defenses to read and react to situations like play action and pounce when necessary, double coverage on a hot receiver, and even avoid making a critical error like roughing a passer by holding their arms up and not deliver intentional hits and cost their team valuable yards. Thing like this become even more noticeable when you bump up the difficulty as the CPU really means business on All Pro and above. Only the real dedicated and hardcore fans who have a great knowledge of the series need apply here.All the looks and game play is just the tip of the proverbial iceberg as EA has found a way to enhance how you play from game to game. Of course you have your Play Now exhibition, Madden Moments allowing you to relive real time season highlights, and even the Ultimate Team Returns in its unique card trading game of sorts, but the biggest inclusion to this years game is how you play your career and franchise modes which are now all combined into one spectacular mode called Connected Careers.The Connected Careers mode allows you to play as a player or a coach all in one big bad mode. For instance, if you choose to play as an individual you can choose to play as a created player, active player, or legend. Much like the My Player mode in the past, you only control the aspects of the game relative to your player. Whats great is now you can literally play at any position, not just the glamorous ones. Your importance to not only the team but how you are viewed can be impacted on how you enter the league, High Draft, Low Draft, or Undrafted, each having their own unique set up circumstances and challenges to prove your worth to your franchise. Using an RPG style XP system, you earn points by practices, success rates in games, and off field decisions, in which you can use those points to grow your players attributes.As a coach, which you can also create, use an active coach, or a legend, you play in the more traditional franchise mode where you make all the decisions that affect the team such as cuts, trades, negotiations, taking flack for loses, and praise for wins, etc. Again, you earn experience points but now you use those points to keep players from retiring, increasing your chances for free agent bids, or certain players interests in joining your franchise.Now while you are saying to yourself, ok so whats new, those modes sound the same minus the XP system, and if that were it, youd be right. Now, what if I told you that if you chose to be a QB Player, and 10 games in you got bored with that mode and wanted to play defense as well, but your team is doing too damn good to really quit the teams successful run for a Super Bowl title, well thats where this mode shines. Now if you chose you can continue a Player mode and choose a defensive player and pick up right where you left off, with all the same stats and results you just experienced as a QB, but you are now in a different role as a defensive player and now have a whole new batch of challenges and goals to meet. Whats more, lets say you want to play full length games, then quit your QB and play as a coach and play in that franchise style mode and meet those challenges head on, while still enjoying the glory of what you accomplished as a Player QB. You can do this as many times as you like at any mode you like over and over again for an incredible 30 seasons. Not having to start over career mode will keep your experience fresh until your favorite team is touted as the greatest of all time.Also in Connected Careers you can now play online or offline, but not at the same time as the mode you choose to play for your Connected Career you stick with for the remainder of it. If you play online you will play with up to 32 others with each player competing in real time, and of course offline the teams you are playing against are simulated by the CPU. This only makes sense that you cant bounce back and forth here with what is at stake especially online where the competition is hot and heavy.No matter which of the aforementioned modes you choose to play, one thing is certain is just how wonderfully and deliberately paced this virtual world is compared to the real thing, its almost scary. Enough changes and improvements have been made this off season that will not only please long time fans who clamor for this title year after year, but its even more surprising to the haters who have sat out that last couple years waiting on the series to become serious.", "date": "August 27, 2012", "grade": "A"}