{"name": "Awesome Pea", "ref": "https://gaming-age.com/2019/04/awesome-pea-review-for-ps-vita-ps4-xbox-one-switch/", "text": "Its hard for me to play Awesome Pea and not immediately compare it to Super Life of Pixel. Maybe it shows a lack of imagination on my part when it comes to talking about two retro-infused platformers, but it feels to me like theyre pretty much the same game.Actually, thats unfair. It really feels to me like Awesome Pea is the continuation of one part of Super Life of Pixel, stretched out to an entire game. Or, perhaps more accurately, it really feels to me like Awesome Pea is a direct descendent of every green-tinged platformer that graced the original Game Boy  a genre that Super Life of Pixel mined as part of its comprehensive stroll through the history of video games. Add on the fact that, like Super Life of Pixel, Awesome Pea stars a miniature protagonist (the titular pea, rather than an eponymous pixel) and its super-hard, and you can see why Im so ready to declare one a clone of the other and call it a day. To be fair, Awesome Pea does some things a little differently. For starters, its much more challenging than Super Life of Pixel  which is saying a lot, considering that SLoP frequently called on players to make blind leaps of faith. Here the game comes at you hard almost from the very first level, throwing jumps that leave you with no margin for error almost from the get-go.On top of that, it doesnt give you the tools you need to succeed. Its customary for tough-as-nails platformers to even things out by also giving you precise controls. Not Awesome Pea, though. Instead, you get floaty jumps that call to mind Little Big Planet, and youll just have to make peace with dying a whole bunch of times. Id like to say that theres some redeeming quality to balance that out, but theres really not. I mean, on some level, its kind of neat to see how well the game mimics the Game Boy platformers to which I devoted countless hours during my youth, but thats hardly reason to recommend the game. There other games out there that inhabit the exact same space (did I mention Super Life of Pixel enough?), and they do it much better than what youll find in Awesome Pea.", "date": "April 4, 2019", "grade": "C-"}