{"name": "Tony Hawks Pro Skater HD", "ref": "https://gaming-age.com/2012/07/tony-hawk-pro-skater-hd-review-for-xbla/", "text": "Weve all seen a fair amount of HD remakes at this point, from a variety of franchises, some great and some bad. Tony Hawks Pro Skater HD definitely falls into the category of great, but labeling it as a remake isnt quite right. Its more of a greatest hits album than anything, an amalgamation of stages taken from the first two Tony Hawk games, but featuring modes, skaters, and music that wasnt originally there. The overall feel, look, and control is definitely in place, and for me thats what counts the most.Ive got a lot of love for the Tony Hawk games all the way up to the second Tony Hawks Underground. THUG 2 is where I started to feel my interest waning, and after that I just kind of let the series go. Ive had to dip back in here and there, mostly for writing purposes, but as a whole the severe dip in quality past THUG 2 was enough to wean my interest. And of course theres the abomination of the more recent accessory enabled Ride and Shred, which honestly should have been enough to kill the brand all together.But nostalgia has a way of reviving just about anything, and apparently Tony Hawk themed video games are no different. Tony Hawks Pro Skater HD ends up being an extremely fun trip down memory lane, and while it might fill in some gaps with more modern musical tracks and skaters, as a whole its well worth revisiting. The only omissions that I find myself overly baffled by is the fact that the HORSE mode isnt present, and that theres no local split-screen mode either. Both of these things would seem like shoe-ins if youre going to revisit this series, yet both are missing here.The levels contained in THPS HD are a mix of stages from the first two games, and really work as a best of look at those titles. Dropping back into the first stage featured, the Warehouse from the original Tony Hawks Pro Skater, felt a bit like learning to ride a bike again. It took about 15 minutes to get re-acquainted with the controls, but once that clicked, I found myself picking up the same trick lines that I remembered from all the hours I spent playing this stage back in 1999 and 2000. And the same applies for pretty much every stage here, with locations like School II, The Hangar and Venice Beach. Right down to the locations of the SKATE letters, Ollie the Magic Bum, the hidden videotapes (now DVDs) and so on.If you have any affinity or love for the original four titles in the franchise, theres little reason to not enjoy this HD re-working of the 7 stages contained within. And while 7 stages might sound a little light on content, like most THPS fans will tell you, these stages are meant to replayed again and again. And the addition of online leaderboards to compare your top scores against not only your friends list but everyone else in the world is just an added incentive to up your game to new heights.The actual HD part of the game has been done with a lot of care. Objects and environments are largely unchanged, just way more detailed than they were before. The same goes for the returning skaters, who animate like youd expect modern character models to. The overall feel and the physics are damn close as well, and like I mentioned earlier, you wont have any trouble getting back into the groove of things.For the new additions, the soundtrack is decent, but Im not sure that the new tracks are something thatll stick in my head quite the same way stuff like When Worlds Collide or Superman does now. I guess time will tell on that, but while I can understand wanting to infuse some new blood into the musical selection, I do wish we could have seen a handful of more classic tracks used in the mix. Maybe thatll be rectified a bit more with upcoming DLC, and the same goes for the skater roster. Neither of these things are enough to be that off-putting for me, but it would be great to get this experience to be as pure as it possibly could be.There are two new modes present outside of the Career and Free Skate mode for the single player side. One is a mode called Hawkman, which litters a stage with colored pellets to collect, but can only be picked up while in the middle of a trick. The idea is to make one massive run from the start of the pellet line to the end, and to do that within a certain time limit. The other mode, Big Head Survival, will cause your skaters head to constantly inflate, and youll need to pull off tricks to keep the head from popping. Both modes are fun enough, but not exactly what Id call exciting. I like the skill involved with making Hawkman work, but neither mode does little to curb my disappointment that the classic HORSE mode is missing here.Online fairs a little better, and thankfully does include the Graffiti mode that has you tagging objects in a stage while playing against another skater. The other modes present online are Free Skate and Big Head Survival from the single player side, plus Trick Attack, which is just a score based competition between you and other skaters within a time limit. I didnt get a lot of opportunity to play online prior to release, so I cant speak much on how the game handles lag or how the connections really faired. The few games I was able to participate in seemed to connect without a hitch, but when the game goes live that could certainly change.While the Create-A-Skater function is also missing here, THPS HD does at least retain the ability to earn and pour skill points into the various skaters that make up the roster. Each skater starts off with a particular set of stats that are geared towards their style, but with enough earned cash you can max out anyone. You can also use that cash to buy new decks and tricks via the in-game Skate Shop, which is also a welcome return but lacks an actual virtual shop in favor of just menu selections.", "date": "July 18, 2012", "grade": "B"}