{"name": "Lollipop Chainsaw", "ref": "https://gaming-age.com/2012/06/lollipop-chainsaw-review-for-xbox-360-ps3/", "text": "If a game starring a buxom, blonde, pig-tailed cheerleader wielding a large, pink hued chainsaw that moonlights as a zombie hunter doesnt sound like a Grasshopper Manufacture game to you, then I dont know what will. Lollipop Chainsaw, developed by Grasshopper, directed by Ikeda Tomo, produced by Suda 51, and written by James Gunn, with music composed by both Johnny Urine and Akira Yamaoka, pretty much sounds like a game written in B-Movie heaven, and for the most part actually plays like one too. Lots of tongue in cheek humor, zombie movie references, and combat that feels like a more refined version of No More Heroes, helps to make Lollipop Chainsaw a title worth checking out.The game stars Juliet, the aforementioned cheerleader, who comes from a family of zombie hunters that are just as eclectic as Juliet herself. At the onset of Lollipop Chainsaws story, its Juliets birthday, which has just been ruined by an invasion of dark forces from a dimension labeled as Rotten World. Pretty much everyone at Juliets school has been converted into a flesh-hungry member of the walking dead, and its up to you to cut through thousands of walking corpses, and a number of unique bosses, to set things right again.One of the things that I really found myself enjoying about Lollipop Chainsaw is that its a video game that actually revels in the fact that its just a damn game. In a medium rife with games that are trying their hardest to emulate blockbuster summer films, Lollipop Chainsaw doesnt shy away from some very basic elements of video game design that dont pop up quite as much as they used to. Sure, it borrows heavily from a comic book theme used for the majority of its U.I., has scripted cutscenes, and even plays out like an old-school exploitation/horror comedy from the early 80s, but it never abandons some very unique elements that can only be found in the world of video games.For instance, enemies spout gold and platinum medals when defeated, which Juliet can use to purchase a variety of upgrades found at different shops scattered about the six stages that make up the game. Those stages can be accessed via a world map representing her high school, and can be replayed on various difficulties. Finishing a stage unlocks ranked play, which is divided up by score, medals earned, and time cleared, all of which upload to online leaderboards. Switching the difficulty level will alter zombie placement and type, along with store locations and health drops. And the boss fights that punctuate the end of each very unique stage setting are actually memorable, entertaining, and even feature multi-tiered forms with a little bit of challenge to boot.And when I mentioned earlier that the game feels a bit reminiscent of No More Heroes, I feel like that seems pretty intentional. In fact, it really feels like a version of No More Heroes with all the filler activities stripped away, in addition to improved combat. I honestly think Travis Touchdown would actually kind of fit as a cameo character within this world, and feel like a natural addition to the game if Grasshopper saw fit to do so in any kind of sequel.Juliets ability to fight the zombies comes in two forms. One involves Pom-Pom attacks, which are basically melee strikes used to wear down and dizzy the zombies she encounters. While dizzy, zombies can be decapitated with a single blow from the chainsaw. However, you can swing away with the chainsaw and slowly dismember a zombie until their eventual decapitation as well, which essentially works as a stronger, slower attack option. As you advance through the game and begin to unlock combos, youll begin to combine both types of attacks into different, more effective ways of crowd control.The zombies certainly arent content to just let you hack away at them either. While the game is relatively easy on Normal difficulty, if you allow yourself to get surrounded you cant really button mash your way to victory. To help make Juliet a little more mobile, youve got an extremely handy dodge function that allows Juliet to backflip, side step, or even leapfrog over zombies. Again, as you unlock more moves, Juliet can use this dodge button in conjunction with attacks to trigger more impressive ways of dealing with undead foes.But Lollipop Chainsaw isnt just about hacking and slashing through the undead. In fact, the levels are often broken up into side activities that range from zombie basketball and baseball events, to partaking in odd variations on classic arcade games like Pac-Man and Elevator Action. These often strange moments help break up any monotony youll start to feel stemming from the combat, but end up being short enough that they dont detract from the main gameplay elements in Lollipop Chainsaw.Not all of these diversions are great though. There are a couple sections that I found to be pretty frustrating and detracted from an otherwise enjoyable experience. A little more fine tuning into the overall quality of these oddball sections would have certainly helped, which can also be applied to some of the mechanics found in a couple boss fights. The last boss of the game, in particular, is kind of a chore to get through, and not nearly as fun or inventive as the previous five you fight. Still, despite the flaws in these sections, I found myself more than willing to go back and replay levels for the various ranked modes, so they werent exactly mood killers when it came to how much fun I was having with the game.And despite the few times where the gameplay falls flat, I feel like Lollipop Chainsaw more than makes up for it in its overall execution. I can certainly understand the point of view that Ive seen a few take when it comes to the super sexualized nature of the lead character, and some of the marketing surrounding the game, but I never felt while playing Lollipop Chainsaw that it was solely aiming to simply titillate its audience and do nothing more. Its an incredibly humorous game, well written, and features an extremely memorable cast of characters that end up being a lot more than just a scantily clad cheerleader. And while Juliet certainly can come off as a stereotype at different points, she also seems to be fairly empowered and never hesitates to kick some ass, more so than any male character featured.In addition to the great presentation, its worth noting that this might be my favorite game soundtrack so far this year. The original content by Akira Yamaoka and Johnny Urine is absolutely fantastic, but the use of licensed tracks is also executed so well for different sections and events in the game. The title track of Cherry Bomb by the Runaways at the main menu, along with licensed tracks used when Juliet enters her powered up mode or visits the in-game shop are all super appropriate and help make the overall game that much more memorable. Id equate this to the way Saints Row: The Third used What I Got by Sublime or Power by Kanye West if youd like a more direct comparison to what I mean.", "date": "June 11, 2012", "grade": "A-"}