{"name": "Death End re;Quest", "ref": "https://gaming-age.com/2019/04/death-end-request-review-for-ps4/", "text": "Theres something odd about Compile Heart making a game like Death End re;Quest. As developers, theyre best known for the Hyperdimension Neptunia series  a whole franchise devoted to gently mocking all the tropes and tendencies that you find in JRPGs, along with whatever other genres happen to cross their sights. Death End re;Quest, by contrast, is an ultra-serious JRPG with more than its fair share of fanservice, and a whole faux-MMO thing going on. Given that Compile Heart devoted game after game making fun of those things  including Cyberdimension Neptunia, which was a faux-MMO JRPG  its kind of hard to take their change of direction seriously when, presumably, theyre well aware of how silly much of it can come across.And if theyre not aware, they probably should be. Death End re;Quest is full of exactly the kind of endless exposition and dumb fan service that the Neptunia games were precisely designed to skewer. The game devotes hour after hour to lengthy cutscenes that go on for far longer they need to, featuring characters that arent anywhere near as interesting as they need to be in order for you to want to spend those hours upon hours with them. There are also random bits of fanservice thrown in, as characters (female ones, obviously) suddenly find themselves stripped down to their (very) jiggly bits, with only tiny strips of fabric protecting their modesty. Its a weird mix, and it takes away from the presumably serious message the game is trying to deliver to intersperse it with random moments of T&A.Id like to say that it does other stuff well, but that would be overstating it. Death End re;Quest does things that you can find in plenty of other JRPGs, from its Sword Art Online-aping setting of a woman trapped inside an MMO to its fairly generic turn-based battle system. It doesnt do any of these things poorly, but it also doesnt do any of them so well that it sets itself apart from the competition.That said, there are bits and pieces here and there that hint at bigger and better ideas. Battles, for example, include knockbacks, which, as their name implies, allow you to set off chain reactions of knocking enemies into each other. It adds an extra layer of strategy to battles that, otherwise, wouldnt have been that interesting. Likewise, when the game moves its focus from the real world to its MMO world, there are some neat glitching animations that look pretty neat.But hitting your enemies into each other and moderately interesting graphical flourishes do not a great game make. Death End re;Quest is the sort of thing that Hyperdimension Neptunia would have skewered mercilessly  and, for the most part, that skewering would have been deserved.", "date": "April 2, 2019", "grade": "C+"}