{"name": "Daggerhood", "ref": "https://gaming-age.com/2019/04/daggerhood-review-for-ps4-ps-vita-xbox-one-switch/", "text": "Word to the wise: if youre playing Daggerhood, dont play it on the PS Vita. I know that Im one of about a half-dozen people in the world for whom this warning matters, but Im still stating it anyway. My initial impression of the game after playing it on the Vita was that it was a virtually impossible tough-as-nails twitch platformer, and it wasnt until I decided to try it one more time on the PS4 that I learned this wasnt the case at all.I mean, its still challenging in places, if you want it to be. On each level, you have the option of not only getting to the end, but also collecting all the treasures, capturing all the fairies, and beating it within a certain time limit to get three stars. If your goal is just getting to the end, you probably wont have that much difficulty, but if you decide to go after any of those bonus things, youll find that the game gets a little harder  particularly if your goal is capturing the fairies, since those only stick around for a few moments at the beginning of each level. The difference between the handheld and the console versions is that, on the Vita, you have zero margin for error on anything. One of Daggerhoods core mechanics beyond the usual stuff youd get in any platformer is that the main character, the titular Daggerhood (full name: Vincent S. Daggerhood), can throw his dagger, and teleport to wherever it goes. This makes flying over large gaps a breeze, and means that he can get to all kinds of treasures on little tiny blocks of land.Or, at least, he can do that on PS4. On the Vita, the game is unforgiving, and Daggerhood dies if he even gets in the general vicinity of any spikes or enemies. Given that most levels feature spikes rather prominently, you can imagine how frustrating it is to die for the nth time because Daggerhood and a spike were near each other. As I said, though, Daggerhood (the game, that is, not the character) is much more enjoyable on PS4. Maybe I just had lowered expectations because my initial experience was so bad, but it was fun to play a platformer in which constant death wasnt a given, but rather a side effect of choosing to take the more difficult route. Couple that with a retro vibe thats spot on, and you can see why Daggerhood is a solid choice for anyone in the mood to play an old-school platformer that doesnt seem to want to punish you just for playing it.Unless, of course, youre playing it on the Vita. Then its just not any good.", "date": "April 1, 2019", "grade": "B+"}