{"name": "Ketzals Corridors", "ref": "https://gaming-age.com/2012/04/ketzals-corridors-review-for-3ds/", "text": "Ketzals Corridors is a quirky little puzzle title coming from Nintendo and developer KeysFactory, put out on the eShop for the Nintendo 3DS just a couple weeks ago. The games major mechanic involves a concept not unlike a simple childs toy, wherein you need to match up a block with appropriately shaped holes in order to fit it through.However, in order to provide some much needed challenge to that particular task, the game has an on rails effect, which pushes you forward constantly. Youll encounter a series of walls with just a limited spot to move through, and youll need to manipulate your current block in a way that will make it fit. To increase the challenge, youre also trying to gather up a certain amount of hearts distributed within those open spaces, and as the game advances a time limit is implemented as well. Theres even a further element, that involves the game tossing odd shapes and spaces your way that you could never hope to fill, but can count them as filled if you move your character piece over the open spots before passing through, creating what the game calls Tricks.What first seems like a simple enough puzzle game becomes increasingly difficult, and the super easy early stages make way for some really challenging sections later on. The game world is divided up into three distinct areas, which allow you to use a unique character block piece for each one. These areas are then divided into a series of stages, which are accessible across a number of spots in an overworld map that actually reminded me a bit of the overworld map from a number of Nintendo-bred platformers, oddly enough. Besides the main levels, there are a series of unlockable side stages that offer up optional stages, like endless modes and so on, that you can tackle provided youve cleared the pre-requisites.Theres also a story behind the game, which is told using a Mayan style motif that actually fits the game really well. You take on the role of a number of block shaped Kings attempting to revive the games titular deity, and must do so by advancing across various stages and gathering the heart pieces that have been scattered in Ketzals absence. To provide you with context and narration youve got your standard chatty side companion, which fills you in on stage requirements and story bits here and there.When moving through stages, youll control the movement of your current character using the face buttons to flip around on a horizontal and vertical axis. Your shapes resemble something similar to Tetrominos, the shapes that make up the popular Tetris series of games. In fact, a little familiarity with the way Tetris typically controls ends up being pretty useful in Ketzals Corridors, and outside of the 3D space element, youll end up noticing some similarities between the two titles. Each of the four face buttons the 3DS correspond with a direction, but youll also be manipulating your block character using the D-pad or Circle Pad in order to match him up with the opens spaces on each wall. You can also handily rotate your character while facing its current direction with the R button the 3DS, and the its worth noting that the game seems to be devoid of stylus controls, which Im actually O.K. with.Also, while it might seem like this type of game would be well suited towards having the 3D effect on, I found that the effect had little impact on the actual game. There are sequences where the stage around you will toss blocks or pillars your way that looks kind of neat, but for the most part I thought the 3D effect was kind of underutilized. It doesnt suffer from any ghosting or visual issues when turned all the way up though, so its certainly worth keeping on for the occasional wow factor.", "date": "April 24, 2012", "grade": "B+"}