{"name": "MLB The Show 19", "ref": "https://gaming-age.com/2019/03/mlb-the-show-19-review-for-ps4/", "text": "Ill say this right up front: by any objective standard, MLB The Show 19 is better than R.B.I. Baseball 19. Like, theres such a massive gap that theres no question about. The Show is deeper, it has a more varied selection of game modes, it looks nicer, it caters to a wide variety of play styles, it has a thriving online communityhowever you want to measure it, youll find that MLB The Show 19 comes out ahead.And yet, for some reason, this year I almost find myself liking R.B.I. Baseball 19 more.A huge part of this comes down to expectations. R.B.I. Baseball 19 comes after a long line of abject failures. Since its resurrection, theres been nothing good to say about the series whatsoever. By contrast, Ive put more time into The Show franchise than any other game or franchise by several orders of magnitude. Last year, two of my top 3 most-played games were MLB The Show 18 and MLB The Show 15 (Vita means life!). The year before that, it was MLB The Show 17 and MLB The Show 15. I suspect that if I were to tally up how Ive spent every hour of my life over the last decade, MLB The Show would probably merit its own category. So when I say that I kind of like R.B.I. Baseball 19 more than MLB The Show 19, there are very clearly two competing curves at work  one that rewards R.B.I. Baseball 19 for being the first non-terrible R.B.I. Baseball game, and another that dings MLB The Show 19 for not being as perfect as it has been in previous years.Because really, thats what bothers me about MLB The Show 19: the little things that it gets wrong. One of the most exciting things about this years edition  at least for me  was the creation of a Moments mode, where you go back in time and relive famous moments from baseball history. And while it certainly adds something to the game, I cant help but notice that it skimps on the details.Take the Moments section dedicated to cover star Bryce Harper. You play through key moments in his career-to-date, except several of them are tweaked so that theyre not actually the same moments. Youre told, for example, that you have three games in the minors to show what you can do, except you then play the same game three times in a row (and with the scoreboard identifying you as playing for Washington, rather than their minor league affiliate). You play Harpers debut against the Dodgers, except, rather than facing the actual pitchers who took the mound that day, you face off against their current pitchers  or, more accurately, Clayton Kershaw and Dodgers Reliever. And, bizarrely, the game doesnt even include last years Home Run Derby, which seems like a major oversight.Things are even more infuriating when it comes to the historical moments. You relive important parts of Babe Ruths career, like teeing off in the 1923 World Series against the Giants and their famed pitcher, uh, Giants Pitcher, while trying to drive in your teammates, Yankees 2B and Yankees 3B. Its possible there are licensing issues at play involving former players, except that doesnt explain why, when you play as Willie Mays trying for his 3,000th hit, youre facing a nondescript Expos pitcher named Steve Renko  who, it should be noted, wasnt on the mound against Willie Mays at any point in 1969, let alone on the mound when Mays notched his 3,000th hit. And dont even get me started on the fact that the game has Mays going for his 3,000th hit in AT&T Park/Oracle Park, which opened 28 years after Mays played his last game for the Giants. I get that these are minor little details, but when youre talking up baseball history, it seems like the least you can do is get that history right.There are similarly infuriating features in the other new mode, March to October. The mode essentially allows you to play a condensed version of season, playing key moments in your favourite teams drive for a pennant. The problem is, it doesnt give you very much control over the team. You cant, for example, tinker with the line-up. Nor are you allowed to change your teams roster  which is particularly bad if youre, say, the Blue Jays, and the game gives you a roster featuring three catchers, three first basemen, no utility infielders, and four outfielders. I mean, I have my problems with the teams terrible roster construction, but even I wouldnt accuse their current management of being that stupid. Its a really neat mode, but its held back by weird details that make it less fun than it could be.Thankfully, the standby modes arent too bad. I dont play much online or Diamond Dynasty, but both are here, and both pretty much conform to my expectations  though I will say that I liked that Diamond Dynasty allowed you to build up your roster by competing in Moments. I may not have been crazy about the mode as a whole, but it did a good job of integrating the two things together. Franchise is still here, and it still allows you to take control of your favourite team and tinker to your hearts content  which is all the more appealing after March to October takes that ability away from you. And, of course, theres my preferred mode, Road to the Show, which fixes the major issue from last year, the fact that every player had their abilities capped. Im still not crazy about how they do it  I want to be able to max my players abilities in every category, verisimilitude be damned!  but at least this year they merely make it more challenging to level up in certain categories, rather than simply making it impossible. (Ill also never forgive last years RttS for doing something so stupid, since it meant my interest in continuing the record-breaking career Id embarked on in MLB The Show 17 plummeted to zero once I discovered that my abilities from the previous year didnt carry over.)Oh, and Matt Vasgersian is still here, sounding exactly like he has for the last decade. While his voice is certainly familiar at this point, I cant help but wish that the game went for someone new. There are only so many times you can hear him say the same things over, and over, and over again, you know?Dont get me wrong: MLB The Show 19 is still a very good baseball game. Even if it has its share of flaws, as I said, most of these flaws are magnified because of how well the game does everything else. If you want a true-to-life baseball experience, this is almost certainly it. But when you get so close to doing everything right, what you do wrong stands out more. With MLB The Shows track record, I have no doubt that, come MLB The Show 20, theyll fix the niggling little issues that prevent MLB The Show 19 from being a truly great game  but for now, those issues still exist, and theyre what prevent the game from making the jump from very good to great.", "date": "March 29, 2019", "grade": "B"}