{"name": "Lumines: Electronic Symphony", "ref": "https://gaming-age.com/2012/03/lumines-electronic-symphony-review-for-ps-vita/", "text": "Apparently you cant have a portable PlayStation system launch without a Lumines title, and Q Games and Ubisoft were certainly happy to oblige with the release of Lumines: Electronic Symphony for the PS Vita launch.Lumines: Electronic Symphony is everything you loved about the first 2 PSP games, mixed in with a bit of Lumines Live for XBLA and Lumines Supernova for the PSN. Most importantly, the game is stocked with an absolutely killer electronic soundtrack that is probably only rivaled by the original Lumines. Lumines is as much about the music and skins as it is about the puzzles and gameplay, so having the best possible soundtrack is at the top of the list. With around 40 catchy, unique tracks and remixes from Kaskade (4 AM is still my personal favorite), Goldfrapp, The Chemical Brothers, Amon Tobin and even the Pet Shop Boys, theres no doubt that if youre even just playing Lumines: Electronic Symphony for the music, you wont be disappointed.For the uninitiated, the gameplay in Lumines is incredibly straightforward. As with Tetris or other similar puzzlers, blocks drop from the top of the screen into a rectangular playfield. In Lumines, these blocks are all made up of quads, 4 squares in the form of a larger square, created from only 2 colors/patterns. As blocks drop, there is also a timeline which moves horizontally across the field along with the pace of the music. As these blocks descend downwards you attempt to create quads of matching colors/patterns by rotating (if need be) and dropping them. As the timeline moves across, it eliminates those that you have matched from the board and you are awarded points based on how many you clear out in each sweep. The more you clear at once, the higher the bonus and multiplier, and the better score you receive. If you let any stack of blocks reach the top of the playfield, your game is over. Sounds simple enough and it is. Mastering Lumines, as will all good puzzle games, requires practice and strategy.As compared to previous Lumines titles, Electronic Symphony does add a little twist to the gameplay in the form of random special blocks and avatar abilities that can be used in the single player and versus modes. The special blocks themselves are fairly straightforward as well, with one that can link together blocks of like color and clear them, and another that randomly changes the colors of a section of blocks already on the playfield. Both of these appear seemingly at random, and frequently (and coincidentally), just in time to save your ass from a particularly bad situation. The avatar abilities on the other hand, work a bit differently. You begin the game with a single avatar and ability unlocked and tapping on the avatar icon on the screen will unleash their respective ability. These abilities range from just releasing a special chain block, to slowing down the timeline temporarily, to changing the next 3 blocks to a quad of the same color. Once you use up an ability, you can recharge it by either playing well and scoring bonuses, or tapping the rear Vita touch surface to charge it. If you have fast fingers and use the right technique, you can literally recharge the avatar ability in 1 or 2 sweeps of the timeline leading to some rather interesting scoring strategies. As you progress through the game and rank up, more avatars and abilities become available, though there isnt actually all that much variation. Both the special blocks and avatar abilities are only available during certain single player modes, and the avatar abilities in particular, are uniquely tailored for competitive play in versus mode.Along with the standard single player arcade-style mode of increasing difficulty and the ad hoc local wi-fi versus multiplayer, Lumines: Electronic Symphony has a timed challenge mode, a more difficult master mode with 5 stages to clear, and the ability to create and play your own playlist of unlocked skins. Overall, there is a nice amount of content, but it feels like there is nowhere near as much as, say, Lumines Supernova for the PSN. There is, however, a whole EXP and ranking system, deep player stats, and some interesting online social functionality. Besides leaderboards that instantly compare you to friends and other players around the world, theres a huge World Block that is composed of millions of blocks that gets reset every day. Every time any online-connected Electronic Symphony player plays any mode in the game, the number of blocks they have cleared are subtracted from the World Block until its gone. If the community does succeed in wiping out the block for the day, and you were one of those who participated, yourself and everyone who helped out, will receive a huge ranking boost. Im personally a big fan of community tasks like this and actually found myself scheduling my playtime just so I could make sure to contribute to the World Block event. Id love to see more developers include such community-oriented functionality, even if its just as simple as this.Visually, Lumines: Electronic Symphony looks super sharp on the Vitas impressive 5 OLED screen. Q Entertainment has switched to a 3D graphics engine from the 2D sprites used previously, and honestly, it is difficult to tell the difference or see much of an advantage besides the slight perspective effects used sparingly. The game is simple looking (its a block-dropping puzzler after all) but nicely designed from the front end and menus to the gameplay sequences themselves. Some of the skins are distractingly disorienting at first, but thats pretty much par for the course for a Lumines game.Lumines: Electronic Symphony looks like Lumines, sounds like Lumines, and plays like Lumines, but there are 2 things I have to ding the game for. Number one is the price. Almost $40 retail for a puzzle game is a bit absurd, especially when the arguably more feature-packed PSN release of Lumines Supernova is less than half the price. Two, there is no online play in the game. And no, local ad hoc multiplayer and comparing leaderboard scores with friends dont count. I love Lumines, dont get me wrong, but the pricing seems somewhat off compared to other Vita and puzzle games.", "date": "March 8, 2012", "grade": "B+"}