{"name": "Asuras Wrath", "ref": "https://gaming-age.com/2012/03/asuras-wrath-review-for-xbox-360-ps3/", "text": "This game. THIS GAME. Seriously, even as Im writing the review I cant get some of the awesome imagery contained within Asuras Wrath out of my head. On one hand I want to knock it down a peg or two for having the audacity to compose the majority of its gameplay out of Quick Time Events, which have become a damn near bane of modern gaming. But somehow Asuras Wrath makes that work, in part because theyre never set up to make you fail a sequence, and the other part comes from the fact that everything you see in the game looks so freaking cool.And while I could see the overuse of QTEs getting tired after a few sessions with the game, the pacing is so well done that it never gets tiresome. And as a testament to how true that is, I find myself seriously wanting to replay the game again, which doesnt happen very often. And thankfully, once you advance past chapter 4 or so, the game starts to take the training wheels off a bit and actually give you some honest-to-god action to participate in.So what, exactly, is the game about? You take on the role of Asura, a demigod that gets betrayed by his brethren and killed, only to be reborn and seek revenge on the other 7 that sent him to his early grave. Its a pretty standard revenge story, but when you replace typical human protagonists with god-like figures, everything gets ratcheted up a notch.The action never slows, as Asura rips through his former companions. In the midst of their infighting youll also encounter monsters known as Gohma, which are beast-like creatures that all 8 of you had been fighting against before. There are a few secrets revealed along the way, and as a whole the story in Asuras Wrath never really disappoints. Its definitely engaging enough to keep you pretty entertained, and youll have a hard time putting the controller down, most likely opting to finish the game in one sitting.The game makes heavy use of interactive cut scenes, comprised of a series of button prompts that display on screen like other QTEs that youve probably encountered before. Theyre usually in-tune with the action youll see, like a singular button prompt that has to be timed as a solitary punch lands, or multiple mashes of another button as you hammer away at a foe, or bounce back an energy beam with one of your own.As I mentioned before, you cant really fail the cut scene stuff. It all ties into an end of chapter ranking system though, and achieving high ranks in chapters are tied directly into some of the unlockables, including achievements and trophies. It also ties into the end game content to a limited degree, so its in your best interest to do as well as you possibly can in these sequences.Besides the QTEs, youll occasionally go toe to toe with the actual demigods, or their minions. These sequences are like most third person action titles, with a strong and regular attack button, jump, dash, and the ability to bounce back quickly from hard hits. On the normal difficulty most fights wont be too taxing if youre at all familiar with the genre, but the last couple sequences do get to be a little challenging. You can totally fail these battles too, so the game isnt without the occasional Game Over screen, but the checkpoints are pretty lenient.The majority of these fights involve you pounding away at your foe in an effort to build up a Wrath meter, which will then kick off the next sequence of QTEs. I can only think of a few sequences where filling the meter didnt immediately allow you to end a fight, and I came to view that Wrath Meter as a sort of reverse-fill life bar for the enemy I was currently fighting.Overall the action feels really great, and while the combat system doesnt have the depth of other top-tier action titles, it does the job of filling the gaps between action-packed sequences. If the concept of a sword drilling through someones gut and literally bursting through the opposite end of a planet, or repelling the giant finger of a god thats taken on the size of the world youre fighting on sounds at all awesome to you, youll probably enjoy the majority of what Asuras Wrath wants to show you.", "date": "March 5, 2012", "grade": "B+"}