{"name": "Red Ronin", "ref": "https://gaming-age.com/2022/02/red-ronin-review-for-nintendo-switch-ps4-xbox-one/", "text": "Red Ronin is an ultraviolent puzzle game.That may have been a weird combination of words at one time, but given that Hotline Miami came out about a decade ago (!!!), its no longer surprising that a puzzle game can also be brutally violent. So, in that respect, Red Ronin doesnt break any new ground. Slicing and dicing your way through bodies while figuring out the best path to an exit has, generally speaking, been done before.Of course, originality is highly overrated. Whats more, even if the idea of ultraviolent puzzle game has been done expertly before, Red Ronin shows that there are still ways to do it differently. In this case: as a turn-based puzzle game where you slide your ninja around the room, trying to find a way to kill everyone before you can exit the room.In a way, this is something Hitman Go also did very well (again, several years ago), so I cant give Red Ronin full points for creativity. That said, besides the different killing method  here you obviously need to slice through your targets, seeing as youre a ninja  this game does a couple of things differently. First, apart from the times when you change your trajectory, you basically slide from obstacle to obstacle, which means your path to the exit is much more winding than youd get in a game like Hitman Go.The other difference  and what makes Red Ronin especially fun  is that theres no one way to go about any level. Sure, you get more points for clearing a room quickly, but theres plenty of room here to improvise and play around with different approaches. It definitely helps if you scout around a room and plot a quick path to the exit, but Im always a fan of any puzzle game that gives players as much freedom as they get here.Is Red Ronin original? Definitely (or, at least, mostly definitely) not. Is it a fantastic game nonetheless? Yes, beyond any shadow of a doubt.", "date": "February 15, 2022", "grade": "A-"}