{"name": "Tales from Space: Mutant Blobs Attack!!!", "ref": "https://gaming-age.com/2012/03/tales-from-space-mutant-blobs-attack-review-for-ps-vita/", "text": "The PS Vita came out of the gate with both guns a-blazing with around 20 games; some good, some bad, and some meh. There were some games that were priced fairly, some games that may be a little over priced, and some are just downright bargains considering their lack of big name developers and digital-only PSN releases. One such game, which happens to be the sequel to a previously released PSN title, is Tales from Space: Mutant Blobs Attack!!! The extra exclamation points mean extra good in this case as you have a game that is simple in nature, fun and colorful with quirky visuals, and it utilizes many of the Vitas functions. It is also addicting and enjoyable enough to go back through multiple times to better your score.In Tales from Space: Mutant Blobs Attack!!!, you play as a blob coming straight from a college science lab on earth, where you and your mutant buddies are subjected to torturous treatment. You now must not only find ways to escape and free your buddies along the way, but each time you consume an object, you grow larger and larger much like the 1950s film The Blob.Best described as part platformer, part puzzler, and part Katamari, the game provides an incredibly good time for both casual and hardcore gamer types. The game has you exploring 5 chapters with over 20 levels to complete ranging from college labs, to the moon, to the badlands of Area 51 and Hanger 18, and finally ending up in the big city where you can get your revenge on those pesky humans.The visuals remind me of something out of the minds of Hanna Barbara with their way of drawing humans and over stating certain features and characteristics. This animated take on things allows for more imagination and child-like humor, while still taking the subject matter of torture and human sacrifice in a lighter fashion. The vivid colors really pop on the OLED screen that the Vita is equipped with and is really pleasing to the eye. The game moves and animates quite fluidly, and the puzzle and platforming designs are ingenious and most will have you scratching your head, but never to the point of frustration. Whats more, the games soundtrack is just as enjoyable with a jazzy xylophone and trumpet take on contemporary 50s/60s music. Much like Katamari, I get a slightly sick joyful giggle when hearing the screams and yells of helpless victims trying not to become devoured by my blob.The game play in Tales from Space: Mutant Blobs Attack!!! never misses a step and takes advantage of most of the Vitas controls. You will move your blob with the analog sticks, utilize certain abilities like slam, and hydrogen float and burst with the face buttons, stick to metal objects or repel off them with the shoulder buttons, maneuver obstacles out of the way or into place with the touch screen, and even slink through a maze using the games tilt functionality much like a table top game at a coffee shop. Tales from Space keeps things fresh from level to level and you never tire of the game as they rarely repeat patterns and objectives throughout the entire game. Youll even find all sorts of pop culture jokes spread throughout the game, from movies to even an Angry Birds nod. All this results in a game that is fun to complete, but even more fun to repeat and better your score.So what is my bid for a game that will provide countless hours of game play, supports most of the Vitas gimmicks, looks and sounds cool and clever, and plays even better? Not 40 dollars, not 30 dollars, no not even 20 dollars. Much like an As seen on TV ad you can get this game for only $7.99 right from the PlayStation Store. But wait, theres more! Thats right, the developers have already promised DLC to accompany this already deep title, so there will be more to purchase down the road making this more than just a one trick pony.", "date": "March 1, 2012", "grade": "A"}