{"name": "SSX", "ref": "https://gaming-age.com/2012/02/ssx-review-for-xbox-360-ps3/", "text": "Snowboarding games have come and gone for the last decade or so, but its been a while since EAs SSX disappeared, once thought gone for good along with the EA Sports Big logo. SSX couldnt have returned at a better time since the competition has been mediocre at best, and never really reached the heights or entertainment value that EAs flagship snowboarding series had in its heyday.Never fret lovers of powdered adventure, SSX is back, and while it may have dropped all the sequel numbers and catch phrase subtitles, it doesnt mean this game is basic. Its the biggest and deepest snowboarding game to date providing enough thrills, icy chills, and painful spills thatll prompt a visit to the ER to make sure your heart can take it.The game looks stunning, showing off a massive open world that spans over 9 territories; the Rockies, Patagonia, Siberia, Himalayas, Antarctica, Alps, Africa, and New Zealand, all with multiple drop points and event styles to board through. If EA did the norm, you wouldnt be able to identify the difference between locations, but EA went above and beyond, so expect to see clear definition between the locations and obstacles found in each area.Gone are the trick events and ramp jumps found in the X Games style of previous SSX titles; its all about downhill action here. Each terrain has a unique downhill run that will keep gamers jumping, dodging, weaving, and sometimes crashing and failing. For instance, Siberia has ice filled wreckage and drops, the Rockies are full of trees, Africa has chasms of lava, and New Zealand has a breath taking dam jump. Its in these details that you will find some miraculous visuals that range from snow blinds to crazy jumps, and all of this hyper-detailed scenery makes it difficult to keep your wits about you and keeps your heart pounding.The gameplay has also become more diverse, allowing you 3 ways to play between racing, tricking, and the ever frustrating survival style events. Each drop comes with gear that will help you prevail over these insane obstacles. It wouldnt be EA if they didnt try to be innovative and invent a new style of game play that involves using the analog sticks, but unlike the mixed reviews of games like Grand Slam Tennis and Fight Night, the analog controls are a perfect fit for this game, and enable you to pull off even sicker tricks than just using button combinations. If you still prefer a classic control scheme, thats available as well, but youll lose out on some fun there.One of SSXs biggest hiccups is the unpredictable difficulty with some races that youll breeze through, while others become so frustrating you will find yourself cursing the TV. These points are completely random and come as early as your first round, and will keep rearing their ugly head through the rest of the 150 drops at various points. There is a wimp out clause though, so if you find yourself cursing EA, the skies, the controller, the TV, your dog, or whatever, the game is generous enough to ask if you want to buy your way out of the round and advance to the next level, provided you didnt blow your cash on gear.Speaking of gear, this version of SSX allows you to upgrade your character and provide them with suits, boards, and other goods that are meant to help you not only score better, but also for survival reasons or to enter certain stages. While this is a good way to spend your bonuses for completing events, I cant say other than the visuals that I could tell a difference in gameplay with or without them, but maybe using the auto-customize feature masks the improvement. Still, its nice to have the feature, even if there is no character specific customization. Youre still forced to play with a premade character with no creation tools available to create your own Lane Meyer from Better off Dead.Another snag that keeps this from the A list is the lack of multiplayer either offline or online. I dont know if it was a time issue, or that EA just felt the experience was a one man show, but it is disheartening to see you race against CPU opponents, but never against friends in real time. Sure the game provides their coveted Autolog-style Ridernet feature for racing against your friends ghosts and times, along with leaderboard score updates, but that is far from a true multiplayer experience.", "date": "February 28, 2012", "grade": "B+"}