{"name": "ModNation Racers: Road Trip", "ref": "https://gaming-age.com/2012/02/modnation-racerss-road-trip-review-for-ps-vita/", "text": "The PS Vita has some pretty impressive launch titles that not only showcase the systems capability, but have blurred the lines of what a handheld should look like comparatively to the home consoles. ModNation Racers: Road Trip should have been one of those titles, as it was not only developed by the original team, but had all the makings of a game that could really take advantage of the touch screen, cameras, and gyro motion functions, while all the time looking just as good as the PS3 version. Alas there was a wrinkle or two, that in this reviewers opinion, winds up giving ModNation Racers the unfortunate honor of being the most disappointing title in the systems expansive launch. Again, I said most disappointing, not the worst, and to be honest there is only one real game killer here and that only really holds true to one particular audience. So read on to see if you pick this one up, or wait for it to go bargain basement.Visually ModNation is a mixed bag, as the game looks good most of the time, but due to some obvious lack of testing time, hits a speed bump on occasion. Id be lying if I said that the original game for the PS3 pushed that systems capabilities, so I was surprised to see that ModNation Racers on the PS Vita has a hard time processing things when it becomes crowded. Mind you, the game looks pretty close to the home console version with its bright colors, humorous animations, varied track designs, great sense of speed, and cool weapon upgrades, but things slow down to an odd crawl as far as frame rate and consistency goes when you have the full field of racers bunched up all together. This of course happens a lot as the game does rely on that white knuckled, every man for himself and rubber band style game play, especially on tougher difficulties. Not that the game feels completely unplayable, but honestly if this were my first look at the Vita to showcase the systems power, I would question if the Vita could be all they claim it to be with a game that is not technically all that. One last nugget of frustration when it comes to presentation is the load times that are unbearably long; not only for a handheld, but for a cartridge/card game that isnt even disc- based. We are talking upwards of 30 plus seconds between choosing to start a race and when the race begins, and while that may not seem long on the surface, it is when you take in account that most other games on the Vita have decent to fast load times. Thankfully if you need to restart a race you do not have to go through the same painful loading, and if you did, this game would be a giant failure indeed.I wish I could say that the game play makes up for the visually lacking, but again, there are some issues here that should have been addressed during the testing stages. For one, the steering mechanics are far too touchy, especially for a game that uses analog sticks, and there are no sensitivity adjustments either. Not that the game is unplayable, its just far too touchy if I may use the term loosely. ModNation Racers is still a blast to play, its just a shame it feels less than polished.Speaking of touchy, have you picked up this and the Vita in the hopes of using the touch capabilities to have a blast navigating and creating tracks and outfits? The good news is that you can, the bad news is that the calibration of the touch controls is far too wonky. Expect frustration when trying to do simple things with the touch controls, as the touch mechanics are not, to be nice, very accurate. These issues not only rear their ugly head when doing something simple such as dragging the menu screen to choose your race type, but boy, try shrinking down a sticker or perfectly placing landmarks on your track creations and you are in for one treat of agony. It honestly gets to the point where I just said screw it and went with some quick add ons and default characteristics.Lastly, Ill quit Mod bashing this game on one last gripe. Why no online play? Seriously? Sure you have Ad Hoc, but whoopty freaking doo! What is this, the days of Atari Lynx? When I buy a 250-300 dollar portable that supports Wi-Fi and mobile 3G, and with the nearly limitless hot spots for Wi-Fi and stable connections wireless available, and you give me Ad Hoc as my only online function for a racing game, I want to just flip you the bird! Oh, and Im sorry but uploading times and downloading ghost do NOT make up for this lack of content.If you are able to get by all of these little nuances, there is a lot of game to be played here both in terms of customization and the single player experience. The career is pretty expansive with 6 tours containing 5 races in each, and plenty of reasons to come back to them again and again thanks to shortcuts and awards. Toss in quick race, time trials, and uploading and downloading tracks and times to the mix and you have a title that can last you for quite some time. Unfortunately if you want to play against someone besides the A.I., your friend not only needs to have the Vita and a copy of the game, but has to be sitting next to you, as again, there is no online play.", "date": "February 27, 2012", "grade": "C-"}