{"name": "Shinobido 2: Revenge of Zen", "ref": "https://gaming-age.com/2012/02/shinobido-2-revenge-of-zen-review-for-ps-vita/", "text": "Shinobido 2: Revenge of Zen is one of the more random launch titles for the PS Vita. Its a sequel to a PS2 game that released around 2005, and never made its way to the United States. The developer, Acquire, is probably best known for the Tenchu series of games, which I imagine most folks are going to be more familiar with. Shinobido certainly tries to evoke that Tenchu feeling, and is heavily focused on stealth assassination between rival ninja clans.Shinobido 2 also feels like the least polished of the launch Vita titles. Its not an awful looking game, but it looks more like an upscaled PSP release than the stunning graphics featured in most of the other Vita titles so far. The characters are a little too blocky, animate poorly, and have some really wild ragdoll physics going on. The voice over work is equally bad, and the presentation is just lacking as a whole.Another complaint that can easily be leveled against the game is that its super repetitive. The game focuses on a lone ninja named Zen, whos out to avenge the death of his friend/partner at the hand of two rival ninja that are seeking out some powerful, mystical mirrors. Your first encounter doesnt go so well, and youre brought back to health by another man who agrees to help you in exchange for rebuilding his village.The backdrop to this tale involves three clans vying for power in the land, and the gut of the gameplay comes from taking on missions for one of the three clans. These missions consist of certain objectives, like assassinating a merchant, wiping out a certain number of enemy forces, escorting an NPC, carrying a heavy item across a map and so on. The goals themselves arent overly complicated, but most maps are populated by enemy forces that youll either want to avoid or stealthily kill.Completing missions for a clan will earn you favor, money, and experience with that faction, and usually has some type of negative effect against another clan. The more you do for one clan, the more they like you, and eventually the more theyll pay you as well. There are a few things that factor into each clans strength, and youll either want to focus on one clan, or use two clans to quickly wipe out the third.The concept certainly sounds neat, but actually playing the game gets to be a bit of a bore. Theres a serious lack of maps, so even as your mission types will change over the course of the game, the areas you tend to play those missions in dont. Youll see the same locations over and over again, which takes a bit of fun out of things. Also, the enemy AI is borderline brain dead, and while theres a heavy emphasis on using stealth kills, going one on one, or even two on one, isnt that big of a deal. Even the bosses can generally be cheesed with a couple moves, so it really just comes down to how much patience you have.Its hard to deny that theres a certain cool factor to using your grappling hook to propel yourself to a nearby rooftop, so you can come up behind an enemy guarding a passage and shove your blade into his back, but even that gets old after the 100th time of doing it. To Shinobidos favor, you do get a lot of freedom to handle most of your missions in the manner you want, most of the stages are designed to be pretty open, and the grappling hook mechanic does add a lot of mobility to your character. But again, its the repetitive nature of the gameplay that really killed my overall enjoyment.", "date": "February 23, 2012", "grade": "D+"}