{"name": "Touch My Katamari", "ref": "https://gaming-age.com/2012/02/touch-my-katamari-review-for-ps-vita/", "text": "Touch My Katamari is definitely the first portable Katamari title that feels like the real thing. Other versions, including the previous PSP iteration, have certainly tried, but theres really no great substitute for having dual analogs in a Katamari title. The PS Vita release will definitely scratch that itch for more Katamari, provided youve had an itch to scratch. But there are definitely some disappointing aspects to the overall package.The biggest of which is the lack of any real fresh content here. Touch My Katamari largely consists of recycled levels and goals, going as far back as the Cow/Bear stuff in We Love Katamari, which was the second PS2 release. Thats not necessarily unusual, most of the Katamari releases have used content from previous games, but you cant help but get a feeling of diminishing returns from the franchise. As much as I enjoy the Katamari titles, I feel let down every time a new one hits the shelf. Theyve never quite managed to capture the unique feeling of the first game, and Touch My Katamari is no different in that regard.The worst, or maybe best part, is that this game seems to realize that. The narrative involves the King of All Cosmos trying to come to grips with decreased popularity. The game begins with a boy and his parents, where the boy begins to extol the virtues of the King by comparing him to other people. When it comes to comparing the King to his school principal, the boys parents decide that the King is JUST as cool as the principal, which kicks off the Kings crisis.From there the levels are created by former Katamari fans, who give reasons as to why the King and Katamari in general have fallen off. A lot of their comments are surprisingly on the mark for the series, so its kind of odd to see it used as a story point in the game, but not properly addressed by the gameplay. As I mentioned before, some of the stages are straight lifted from previous games, and the majority of the themed goals are as well. One level will have you trying to build a big enough Katamari within a certain calorie limit; another has you trying to amass as many riches as possible. Youve pretty much seen all of this before.I guess the real main appeal here is having all of this in a portable format, which certainly goes a long way to making this more enjoyable than it normally would be. The controls are spot on, and you can opt between classic controls that allow you to use both sticks to control movement, or a newer scheme that controls the movement with the left and the camera with the right. Theres also touch screen controls, which always felt awkward and cumbersome to me. One addition here is the ability to manipulate your Katamaris size, you can either smoosh it together to help navigate narrow passages, or widen it out to help collect a number of items that are side by side. Mastering both of these uses will be key to maxing your goal requirements, and stand as the only big and useful addition found in Touch My Katamari.Besides the standard goals for each stage, you can eventually unlock Katamari Drive versions of stages, which will increase movement speed and decrease level time limits. There are also unlockable endless modes for every stage, which is great if youre trying to hunt down the hard to find curio items, presents, cousins, and Fan Damacy collectibles.Beating stages earns you candy pieces, which acts as the currency model in Touch My Katamari. Candy can be redeemed for a number of items, including the unlockable modes mentioned above, and additional clothing items for both the King and Prince. Every so often the King will request pieces of clothing, so buying him outfits on demand will occasionally net you bonus candy pieces. The King will also dole out candy tickets, which can be used in conjunction with your reward at the end of a level to increase the amount of candy pieces given.", "date": "February 22, 2012", "grade": "C+"}