{"name": "Kingdoms of Amalur: Reckoning", "ref": "https://gaming-age.com/2012/02/kingdoms-of-amalur-reckoning-review-for-xbox-360-ps3/", "text": "What do you get when you mix in one part R.A. Salvatore, one part Todd McFarlane, and one part Curt Schilling? No, you dont get an expensive autograph session at a Comic-Con, you get a new development project called Kingdoms of Amalur: Reckoning that is written by Salvatore, with art designs by Todd McFarlane, and produced by Curt Schilling, all coming nicely together to give ever changing, story driven, action RPG fans that 100 plus hour game they have been clamoring for.Taking a new direction in the savior of the land scenario, while the character you play as had a past, it has all been forgotten. You had been slain on the battlefield and left to have your remains picked apart by vultures. Then, as you are carted away a la the scene from Monty Python and the Holy Grails bring out your dead skit, you are remorselessly dropped into a pit of dead bodies, but little did fate know that you are were in the well of souls and have been brought back from the dead. Now that you are formerly dead, you have no ties with fate or what you have done in the past, so it is now time to start anew and it is up to you how the rest of your surrounding existence winds up. If you want to save innocent people or kill them, do good deeds or be a thief, talk to people civilized or just piss them off, its up to you, which completely give you free will to live life how you want it to be with no regrets or apologies. Whats more, the people around you are envious as the future was unchangeable before you came along, so now you will have all kinds of fair-weather fans coming to your side wanting your aid to change things their way.All of this would be grand if the people in Kingdoms of Amalur: Reckoning werent so wooden speaking and long winded with their conversations. Not to say the dialogue isnt written well enough, or the people dont have interesting stories to tell, but at times you get the point half way into the conversation only for them to continue to jabber on relentlessly. While it is few and far between that RPGs of this ilk really have that moving main storyline like Mass Effect, you are left with one that is created almost on the fly like Fallout and Skyrim, which too many gamers find passable and forgivable. I was just hoping for a reason to care, and while I can change fates, the decisions I make do not provide new forks in the road, which also makes the decision making of good and evil feel downplayed as well. This all boils down to wasted talent by such a well renowned writer as the storyline, and how it all ends, really arent the games biggest selling point.I wish I could say the game lives off its visuals and goes head to head with the beauty of Skyrimbut I wont. Actually at first glance I thought I was playing a Fable title with its charming, yet uncomplicated visuals. Sure there is a massive world that is relatively open world, nice color and lighting that look almost water colored than realistic, but the art design is lacking, especially considering that McFarlane had a hand in this. Sure the main baddies look impressive, but its the variety of the town folks appearance that is sorely lacking, as are the overall look of the environments once youve played a few hours of the game and the whimsical charm of the old timey fantasy villages and dungeons starts to wear thin. What is noticeable is that Ive never encountered a game killing glitch, and thats a plus as most games of this lengthy nature tend to have a few scars here and there. When describing how the game generally looks, lets just say that Kingdoms doesnt dress to impress and leave it at that.Where Kingdoms of Amalur: Reckoning shines on brightly is the games amazing game play elements that offer something quite new to this genre. This is an action game with meat, and what I mean is that you have all the elements of a God of War or Devil May Cry in the combat scope, tagging along with the overly long questing and looting. The weapon variety not only is impressive, but each weapon provides a sole purpose and isnt just there for extra fire power. Broad swords allow you to smash through big object and tough armor, daggers allow for that sneaky stealth attack, bows will allow you to fend off foes from a distance, and even your staff will conjure fire, ice, and other elementals that not only destroy enemies, but provide openings to places you couldnt reach before. Tie all that in with character classes with growth opportunities, each supplying their own unique game play shape, or just take the best of all worlds and create a spell conjuring, axe wielding, lock picking, badass who says neigh to the class givers! In short, taking tight controls, variable options and game play types, along with a lengthy game that could take from 25 hours to over 100 to complete in all, equals one pretty sweet experience for those with time on their hands.", "date": "February 22, 2012", "grade": "B+"}