{"name": "Epic Quest for Zen Pinball, Pinball FX2", "ref": "https://gaming-age.com/2012/02/epic-quest-for-zen-pinball-pinball-fx2-review/", "text": "Pinball fans its time to quest for booty!  Epic Quest for Zen Pinball and Pinball FX2 comes to gamers for both the PSN and XBLA and provides a bit more than just ramping up your wizard score and hitting jackpots.   The new Epic Quest table boasts a level up system that takes place, for the first time, throughout the play of multiple games instead of ending when you are all out of balls. Dont be mistaken, your scores do reset, but your character levels up from game to game so that your chances of obtaining rare goodies and score multipliers increase with each new game as you start from the level you left off at the prior game.   This helps by taking some of the feeling of woe away after having an epic game as you can use your newly acquired points in a new game.  While this concept is new, it still doesnt cheat players by making things easier, or handicapping objectives, but instead allows you to use the skills youve earned in past games to kill off foes and finally take down the final boss without playing all day to do so.   These added skill points are also complemented by higher attack and defense ratios, all leading to one addicting pinball game indeed.Its up to you to battle fiends of all sorts through the den of wickedness and claim the loot and booty that comes with being a hero.  Along your journey through bat filled caves, forests, and caves you will come across trolls, bandits, ogres, skeletons, spiders, evil trees, rats, goblins, imps, ghost, vampires, and wolves ready to do you harm.  You are fearless in the pursuit of wealth and good, but mostly wealth.  Besides hitting your multiballs opportunities, earning new equipment, finding potions, using spells, buying new armor, and leveling up, your main goal is to take down those aforementioned baddies one by one until you reach the final evil one.  Earning those skills will be necessary as brawn and steel will do little against this beast, so collect those magic scrolls and other elemental fortunes, as you will need them, and a little luck, if you planning to succeed in the final battle.The Epic Quest  table itself is fast and brutal.  You must have a great sense of timing and reflexes to do well on it, but once you learn the games rhythm, you should find yourself being quite successful after a few games.  The scores will be limitless once you have the tables big scoring opportunities down as there are many multiball, mini games, mini boss fights, and even many times you can go for that skill shot beyond the beginning of a new ball set that will increase each time you successfully hit a skill shot. The look of the game is straight out of a kids story book, with a lanky knight, cartoony sound effects, and during certain epic battles you are treated to a puppet show describing the entity you are about to face in a fun and creative little cut scene that takes place right on the table (and allows you for a few seconds of breathing room).  This is just a small example of the games many charms that come into play, the rest you will have to find out for yourself.", "date": "February 16, 2012", "grade": "B+"}