{"name": "Monster Hunter Rise", "ref": "https://gaming-age.com/2022/02/monster-hunter-rise-review-for-pc/", "text": "The last two years have been great for PC gamers. GamePass on PC with the Day 1 first-party titles from Microsoft, Sony pushing some of their best exclusives out on Steam, certain Nintendo Switch games getting released on Steam, it has just been great. Monster Hunter Rise is another great addition to the growing list of fantastic ports that PC gamers have received. It takes everything that made the Switch version so successful last year and doubles down, making this the definitive version of Monster Hunter Rise.I am a relative newcomer to the Monster Hunter franchise, having only player Monster Hunter World prior to the release of Rise. I enjoyed World with friends but was never exactly hooked on it. After a few hours with Monster Hunter Rise on the Switch, however, I knew this game was going to be the one that got me. With the knowledge that the PC version was coming within the year, and anticipating that to be the better version, I stopped playing it on the Switch and waited for this port to be released.In our review for Monster Hunter Rise on the Switch, Dustin said that it was a really fantastic experience, and Id highly recommend checking it out. He specifically calls out the increased exploration speed made possible by the Palamute companion, and the streamlined hunts made possible by the Cahoot marking monsters on your map automatically, showing you exactly where you need to go. I agree with his review completely and feel like Monster Hunter Rise has streamlined everything that was great about World while keeping the core experience intact.The maps are smaller than they were in World, and with the drastically improved traversal options they feel even smaller, but the focus on getting straight to the hunt makes this a bonus, not a complaint. Everything feels designed to aid the player in getting straight to what they are there for; hunting down giant monsters and skinning them to make clothes/weapons. There is a deep stable of monsters to fight here, and the apex variants are introduced right as you start to get tired of the available options. These variants look cooler, use new and surprising moves/tactics, and can take a ton more damage. This allows the later hunts to remain fresh, even after close to a hundred hours of playtime.Cooperative play remains an important part of what makes Monster Hunter so much fun, and the online system for Rise is easy to use and was always populated for me. Playing with friends is as simple as chatting with the delivery Palico in the middle of the village to open up your play session. If you dont have friends online to play with at the time, you can go to the hub and either start your own hunt and leave it open for other players to join, or choose to answer the call from another player for assistance on their hunt. This makes hunting specific monsters to farm for parts you need simple and fun, even for players running solo.The performance on PC is fantastic. Although it definitely still shows that it was originally a Switch exclusive title, a lot of love was given to the PC version. It cannot compete visually with World, but it chooses not to even try. The unique art style lends itself to the lower performance that was available to it originally, and this version smooths out even the roughest edges leftover from the original release. 4K/120fps was easy to achieve, even with the settings maxed out for me on my 30 series.The PC port for Monster Hunter Rise is the definitive way to experience this game. I am excited to see where the franchise goes from here, although I will find it hard to slide back into any Monster Hunter game without the new traversal and streamlined elements. Whether you want to hunt alone or play with your friends, play Fashion Hunter or experience the main quests, there is something for everyone in Monster Hunter Rise.", "date": "February 10, 2022", "grade": "A"}