{"name": "Star Wars: The Old Republic", "ref": "https://gaming-age.com/2012/01/star-wars-the-old-republic-review/", "text": "MMOs are generally a pain in the butt to review. And as much as I tend to like MMOs, trying to figure out the right way to review them and playing them for that purpose does tend to take the fun out of it, even more so when the MMO in question is a mess, or just downright bad. So the fact that Im STILL enjoying Star Wars: The Old Republic should be saying something right off the bat.Id like to start by giving you some info on where Im currently at with the game. My highest level character is a Sith Marauder at level 44. I wanted to hold off on writing this review until I hit level 50, the current max for SWTOR, but I realized putting this review off till then most likely meant this wouldnt see the light of day for another two weeks.But I have managed to sample most of the crafting and gathering skills, labeled crew skills in SWTOR, and have maxed out three: Synthweaving, Underworld Trading, and Archaeology. Ive also run a number of instances, grinded up my Valor level (PVP) to around 18, and toyed around with a number of other classes for both the Republic and Empire sides.And overall, I feel like SWTOR is a pretty great MMO. Its certainly one of the more polished MMOs at launch Ive seen in a while. My system is pretty low-end nowadays, but still capable of running this game well enough. I had to mess with BIOS settings a little bit, the game is pretty heavy on processor use, and my pitiful dual core had some trouble keeping up until I came to realize it was artificially bottlenecking my performance. But once I adjusted that Ive managed to maintain a pretty steady framerate, even in the more action oriented and taxing PVP arenas. I can even run the settings at a medium level and squeeze out a little more graphical fidelity than I was expecting for my system, so its nice to see that the game is pretty well implemented for a range of PCs.Not to say that its entirely flawless. Ive run into a number of bugs, which range from small graphical errors that dont matter much, to the occasional system crash that tends to be a little more alarming. Little graphical issues, like my companion playing dead after every fight even though he or she is still totally alive are more annoying than game breaking, but again theyve been repaired by logging out and back in. And Ive only had the displeasure of encountering one quest bug across the hundreds of quests Ive completed, which I think is actually a pretty good ratio for a new MMO.For those of you that have heard the game is little more than World of Warcraft with a Star Wars skin applied, I cant say that remark is too far from the truth. It certainly shares a number of similarities in quest design to WoW. The spoken NPC dialogue from quest givers does help to make the stand apart though. But still most missions will consist of killing a certain number of enemies, or gathering a certain number of items. Theres little here that we havent seen before.But there are other elements to help SWTOR stand apart from the rest of its MMO brethren. One big inclusion is the use of Companions, which are essentially pet characters that accompany you while playing solo. The companions get added to your overall crew over time, and their introductions usually play out in a similar fashion to expanding your party in any other offline RPG. Each companion is fleshed out, and has certain likes and dislikes that get triggered based on the conversation options you choose. They also have a likeness meter that you can fill by making choices that are more in tune with their interests, and filling that meter impacts how quickly youll accomplish tasks for crafting purposes.Thats right; companions are also crafting bots. This is one of the cooler things that I liked about SWTORs design, is that I never really had to spend down time gathering items or crafting weapons and armor. Instead I simply brought up a menu and assigned those tasks to my crew, who would go out on little missions to gather materials, or spend time creating items from those materials. It really helps to take some of the down time out of the game, and is certainly appreciated on my end.It would be even better if I could find an actual purpose to crafting though. This is something that really reveals itself once you max out your crafting profession of choice, but you come to find, at least as far as Synthweaving is concerned, that theres little need to craft high level items. The basic green loot drops have been comparable to even the highest quality items I can craft at the same level, and quest rewards are almost always better. Considering the amount of time it takes to craft those high level items, the rewards are pretty thin for bothering with it. Ive been better off gathering materials and selling them than I have been trying to craft gear and selling that. And when you introduce modable items, orange class gear that can be refitted with modifications to constantly increase their performance, the whole idea of being a high level crafter goes down the drain quickly.Another element of the game that Im not particularly fond of is the space combat, which feels like a throwaway addition at best. The combat is completely on-rails, and involves you painting targets with the mouse for missile locks, or simply holding down the left mouse button to auto fire at anything you see. Your ship as a hub is great, but outfitting it with parts and going out on space missions is pretty dull at the moment.On the flip side of that, there are a lot of things I genuinely enjoy about the game. It does get quest progression down pat early on, always advancing the player properly to new quest hubs on every world you get to explore. Theres never a moment where youre left without any idea of what to do next or where to go, and the maps are extremely easy to read with well-defined waypoints that show you exactly what marker means what.The spoken dialogue for the NPCs is a huge plus, and makes me give a damn for the story surrounding my current character. I know a lot of people dig the lore in WoW, but Ive always found myself skipping through the dialogue boxes for quest givers there. In SWTOR I found myself actively engaged in the reasons behind every quest I took, whether it was a main class quest or a side quest. I can tell you more about the quest givers and individual stories in SWTOR after playing the game for a month than I could about WoW, and Ive been playing that game for years.", "date": "January 23, 2012", "grade": "B+"}