{"name": "Nira", "ref": "https://gaming-age.com/2022/02/nira-review-for-nintendo-switch-pc/", "text": "Heres the problem that Nira faces: its a procedurally generated sandbox survival game with lots of crafting and very retro-looking graphics. Does that description not remind you of something else? Or maybe a few something elses?With that kind of competition, Nira needs to do something interesting or different to stand out. Given that just about all it offers are visuals that try to be even more retro than games like Minecraft and Terraria  and little in the way of interesting gameplay  its pretty clear that it doesnt do that. I mean, its neat that Nira wants to give you a Minecraft-type experience with Atari-level graphics, but thats not enough to make a compelling game.Mind you, even if we lived in a world where Minecraft or Terraria never existed  or Dont Starve, for that matter, since thats another major influence here  Nira still wouldnt be that interesting or enjoyable.Part of the issue is that theres a pretty steep learning curve, and the game doesnt do much to help you climb that curve. There are pop-up tutorials every few moments right after you start the game, but they dont do much in terms of telling you what you need to do. Rather, theyre more like lengthy infodumps that may or may not be associated with what youre doing at that moment, and that come at you so quickly that youre not likely to remember any of it.Likewise, the game sets objectives for you, but doesnt give you a lot of clarity as to what they mean  Nira may tell you that you need to pick up sticks or features or logs, but good luck figuring out how to find any of them. Similarly, it tells you to create things like a shelter, but then you discover that you need to pick up an absurd amount of resources just to create a door or a window, and again, youre left wandering these procedurally generated islands, hoping youll stumble across what the game wants you to find.This latter complaint points to another issue: the retro graphics actively work against you. The game wants you to pick up pieces of wood, but is that small square on the ground a piece of wood from the tree you just chopped down? A rock? Something else entirely? Its never clear, and Nira doesnt feel much like explaining any of it.In terms of steep difficulty, theres also the issue of some enemies being way too aggressive and powerful. In particular, you need to stay far, far away from water, since the sharks are very strong and very fast. The thing is, youre on an island, so you can see how it might be difficult to avoid water. On top of that, you lose everything youve picked up after you die the second time (the first time, at least, Nira is nice enough to give it all back), so your weak character will spend a lot of time grinding and re-collecting resources to make up for everything it just lost.To be fair, of course, some people like games precisely because they dont hold your hand, and those people may enjoy the challenge of Nira. If youre fond of very old-school graphics, too, Nira is unquestionably gorgeous, to the extent you couldve called an Atari 2600 game gorgeous.But if you want something to take over a Minecraft- or Dont Starve- or Terraria-shaped hole in your life, Nira isnt it. It aims high, and clearly has some great influences, but it cant seem to meld them all together into something worthwhile.", "date": "February 6, 2022", "grade": "C"}