{"name": "Dying Light 2: Stay Human", "ref": "https://gaming-age.com/2022/02/dying-light-2-stay-human-review-in-progress-for-ps5-xbox-series-x-pc/", "text": "I would be lying if I said I wasnt concerned about the various delays that have occurred since the initial reveal at E3 2019. As a fan of the original Dying Light and its enormous DLC The Following my expectations were through the roof. Seeing the first gameplay behind closed doors at E3 built a level of excitement that would slowly dwindle down as the time passed.Comparing another highly anticipated game also shown at the same show behind closed doors, Cyberpunk 2077 was where my head was going, and this didnt bode well as a fan. Seeing what happened during that launch scared me into worrying about Dying Light 2: Stay Human, and with the pandemic still in full effect some delays were expected. The most important factor here is, was the delay giving the developers the time they needed to get the game to where the fans hoped it would be?Yes and no. Full disclosure, I was provided the code to review with a greater time to play before launch, so not all planned pre-launch and day 1 patches are in place. During my initial time with the game, I had my share of challenges as many other reviewers did, but I want to stress that most of that has not affected my overall opinion of the game.Something I feel is an expectation with the original Dying Light is there were always bugs, but for me, they were easily forgiven based on the rest of the game experience. But, also most importantly, the sheer love and dedication of the developers and the supportive community provided to this day, 5+ years later.Dying Light 2: Stay Human shares the same traits so far. With Techland committing to at least 5 years of content and support, this is an exciting time to be a fan of the series. Without further delay, lets talk about this ambitious sequel and if its worth your investment.Like its predecessor, Dying Light 2 boasts an enormous open world, impressive and polished combat, sleek parkour traversal mechanics (which to me stands out as my favorite feature) and a ton of new components that I think can easily give you hundreds of hours as advertised. For starters, lets speak to some of these for newcomers to the series.Dying Light is a hybrid action adventure title with mechanics that feel inspired by a number of games from a variety of genres. To me, EA and DICEs Mirrors Edge is at the forefront of the mechanics as you traverse the world in first person at a fast pace including climbing and jumping from building to building, which also may feel familiar to fans of Assassins Creed. The most important aspect here though is that this is a zombie survival game through and through, and shares traits with games like Dead Rising and Dead Island.With the sequel, there are a lot of story-focused details I wont speak to or spoil but its important to know how important they are to the mechanics of the game. As the name suggests Stay Human can play to the words in meaningful ways. One of the games core mechanics also making a return is the day and night cycle. The best part here is how it plays into your gaming experience in a whole new way, which brings out one of the best parts of the sequel. In the original, you didnt want to be caught outside at night due to the crazy, difficult zombies you would meet. I found myself jumping out of my seat with anxiety when the sun came down, and this time around its for a completely different reason  but its still just as intense.One of the biggest fears I acquired by playing Dying Light is my newfound fear of heights in first person games, and I will never forget the stomach-turning moments I had climbing up a huge bridge and having to walk across only to fall to my death. Even VR has not scared me the way this did, and Dying Light 2 reminded me that this feeling is here to stay.The new city of Villedor feels much bigger than what was available in the original and this is only a portion where you will visit. During the game you will meet tons of characters and different factions that play well into the narrative, and you will have to choose sides with some characters attempting to convince you to follow their beliefs  and this is where some of the voice acting shines. I could be deep into a mission with my mind set on who Im going to help, and here comes an NPC to re-educate me and question my decision. Many of the characters have heartfelt backstories and dont feel all too generic or recycled as can happen in games of this scope.As you progress in the Dying Light 2 story, you help decide which factions control important resources in the city and this can be a rollercoaster as the diversity in the people of Villedor is a welcome addition to the experience. Currently, Im 40 plus hours in and currently feel like Ive barely scratched the surface of total content that has been provided.What really helps drive the narrative is the fantastic score by BAFTA Nominee, composer Olivier Deriviere. His credits include Assassins Creed IV: Black Flag and most recently Streets of Rage 4. Whether you are climbing the highest building or racing through the streets to escape a wave of zombies and Volatiles in the dead of night, the music falls right into place through and threw. Getting a moment to breath not only feels refreshing, but it also sounds it. As a musician, I truly appreciate the emotional attachment to the score behind the story telling. Personally, Im not one to be a completionist in most games in this genre, and once the story is over I will usually put the game down. This was not the case with the original Dying Light and I dont think it will be the case this time either.As I mentioned, Dying Light 2 is huge and fast travel would be nice to help in getting around. Well, the good news is its here but you must earn it. You will find Train Stations you will need to bring back online and those of course come with their own challenges. In the end it will be worth it as I missed many chances early on and regret it, and as you travel further you will want access to these stations so be mindful. There are also special items you will acquire as you get deeper into the story which help open up ways to explore and travel.Another great part of the experience is getting your hands on some binoculars which will allow you to locate places from a distance and add them to your map. So no need to climb towers to gain more access to your map. This can also make the game a bit overwhelming as you will spot all kinds of side missions and challenges.So far, I cannot recommend Dying Light 2: Stay Human enough if you havent caught on. As someone who put hundreds of hours into the original and consider the DLC to be the best additional game content ever released, this sequel had a lot to live up to. Currently Im in a bit of limbo with my current playthrough and am waiting for the day 1 update to hopefully resolve a technical issue until then I cannot wait to jump back into the world of Dying Light 2: Stay Human.[Reviewers Note: Post Day 1 Patch update Final thoughts]The good news is I was able to progress once again and completed the main story. One major change was the overall flow of the game felt significantly smoother than my initial hours pre patch. This is a great sign for the public once they get their hands on the game in less than a day. My final thoughts on my overall experience with Dying Light 2: Stay Human remains positive. Seeing some coverage come out and be turned off by the bugs and issues that were pre-release was expected, but disappointing since I had faith that Techland would stay true to the fans and make sure the experience is covered top to bottom with prime support for the players and community. I commend the entire development team including Lead Designer Tymon Smektala for being engaged with the community leading to the release and listening to what they all have to say. It shows in the final release and look forward to spending even more hours in Villedor for years to come.", "date": "February 3, 2022", "grade": "A"}