{"name": "The Outer Worlds: Spacers Choice Edition", "ref": "https://gaming-age.com/2023/03/the-outer-worlds-spacers-choice-edition-review-for-playstation-5-xbox-series-xs-and-pc/", "text": "I did a double take when trying to figure out when The Outer Worlds originally launched, and was surprised to see it was prior to the beginning of the pandemic, hitting PlayStation 4, Xbox One, and PC back in 2019. So its been 4 years between the original release and this complete, upgraded version that just hit PlayStation 5, Xbox Series X|S, and PC dubbed The Outer Worlds: Spacers Choice Edition. While the original version of the game has run quite well on modern platforms, theres never been an official, native current-gen release before now. This version brings a few upgrades like an increased level cap, upgraded lighting effects, dynamic 4K resolution, and enhanced details. This version of the game also includes all of the DLC in one, complete digital package.Unfortunately, Id also say this version of The Outer Worlds is a downgrade, which is a bummer considering its a $60 standalone release or a $10 upgrade if you already own the original game. Most of that stems from the frame rate issues, which have been pretty rough in the PlayStation 5 version of the game Ive been playing, and my understanding is that its just as bad on other platforms. There was a recent patch that made improvements, but its still not a steady 60 frames per second in performance mode, with noticeable dips when running around large open environments, even when not engaged in combat.Its primarily disappointing to see because the PS4 version of the original game runs really well, without the framerate drops. And while the visual upgrade is noticeable, its not such a huge leap for me that the sacrifice to a solid frame rate is worth making. I held off on writing this review last week due to that planned patch, but again, even with the patch there are noticeable issues.This is a shame because The Outer World is a really well done first-person RPG in the same vein as titles like Fallout or The Elder Scrolls. The original game by Obsidian was and still is fantastic, and the DLC included here is well worth checking out. For my thoughts on the original game, check out my original review here. Id argue that the score and review still holds up to my memory of the game having replayed a chunk of it for this version, and despite the technical issues, if youve never played The Outer Worlds before, its still an experience Id recommend.", "date": "March 23, 2023", "grade": "B-"}