{"name": "Loop Hero", "ref": "https://gaming-age.com/2021/12/loop-hero-review-for-nintendo-switch-pc/", "text": "For me, Loop Hero is a perfect example of why you shouldnt judge a game until youve played it. On paper, nearly everything about it seems like the sort of thing Id usually hate. Its a roguelike. It involves deck-building. The action is both very passive and very repetitive. You have to constantly juggle your inventory. It requires lots of strategic thinking. For the most part it looks like something you couldve played on the Atari 2600.Just one of things is often enough to turn me off a game, sometimes before Ive even played it. Youd think all of them together would be a disaster. Yet the more I played it, the more I loved it, to the point I can state, with absolute certainty, its one of my favourite games of the year.A big part of why I was able to embrace all those elements that I usually dont care for was because Loop Hero makes everything so simple. While it could easily have bogged itself down in complicated mechanics, instead it focused on making everything as streamlined as possible.Not coincidentally, thats kind of the point of the whole game. Yes, theres a story about an evil wizard who locked the world in an infinite loop, but thats almost secondary to what the game is really about: creating a gameplay loop thats as basic as it gets, but also highly addictive. In Loop Hero, you watch as a hero  rendered in graphics that hover somewhere between Atari 2600 and NES, depending on the situation  walks around and around in a procedurally-generated loop, battling every monster (s)he comes across. You have no control over what happens in those battles, and all you can do is watch as they unfold  and maybe retreat from the loop entirely if things get especially dire.What you do control, however, is the world around your hero. Monsters drop cards, which can be used to either change the landscape of the board or to change your weapons and armour. Where the strategy comes in is that not all cards are beneficial  you often have to figure out exactly where you want to put that vampires castle, or figure out how to space out graveyards, or decide whether you want the ring that regenerates your health or the one that damages your enemies. Theres constant trade-offs to be made, and I regularly found myself debating over which way I wanted to go. This could have all been very complicated  but again, because Loop Hero doesnt try and overwhelm you with info, it all works incredibly smoothly.The other great thing about Loop Hero is that its got an enjoyable sense of humour. Its not exactly the funniest game youll ever play, but as your hero interacts with the world around her/him, youll constantly find that theres a lot of care that went into making conversations as enjoyable as possible.Of course, everything about Loop Hero is focused on making it as enjoyable as possible, because its just a really enjoyable game. As i learned, whether youre usually into these kinds of games or not, it doesnt matter: Loop Hero is fun, and its sure to get you hooked.", "date": "December 31, 2021", "grade": "A-"}