{"name": "The Jackbox Party Pack 8", "ref": "https://gaming-age.com/2021/12/the-jackbox-party-pack-8-review-for-xbox-one-series-x-ps4-5-switch/", "text": "As Ive written before (and numerous others have also noted), the formula for The Jackbox Party Packs seems pretty straightforward by now: you have a couple of great games, some okay ones, and a dud.The wrinkle in that truism, however, is that not everyone shares the same definitions of great and dud. I know some people who swear that Guesspionage (from Party Pack 3) and Dictionarium (Party Pack 6) are amazing, but I couldnt care less for them. Meanwhile, I love Bidiots, but I always get outvoted when I want to play it. On top of that, your feelings towards the games will be influenced by who you play with  if you play with people who share your sense of humour and who enjoy the games, theyll be awesome, while conversely, it doesnt matter if youre playing the most reliably amazing games, if the people youre with arent funny, the game will be a drag.That said, in some ways Jackbox Party Pack 8 seems like it might be the most reliably solid Party Pack yet. The only game Id classify as a dud would be Weapons Drawn, the latest attempt to include a social deduction game in the Party Packs  and honestly, its not even a dud so much as its fairly complicated, and requires a fair amount of explanation. If youre playing with a bunch of people who are into social deduction games it may seem more intuitive, but I wasnt, so it didnt. In the right hands and with the right group, however, I could see the murder mystery being kind of fun.The reason it stands out in a negative way, though, is because the other four games here dont require too much qualification. Take Poll Mine, for example: its a dungeon-crawler of sorts, where you answer questions and then have to guess how your group as a whole ranked the answers. Its not as funny as the usual Jackbox fare, but it does require you to try and figure out how everyone else thinks, which is always an interesting challenge.The Wheel of Enormous Proportions is also interesting, but in a different way: it combines trivia with random chance. You answer questions, and then you spin a wheel to try and get it to land on your piece. Answer more questions, and you get a bigger piece of the wheel. The twist, though, is that the game gives out points pretty freely, so its not impossible for even the worst trivia player to come from behind and win a game. As someone who likes trivia, that was kind of infuriating, but it certainly ensures that no one ever feels totally out of a game.Its the other two games, though, that stand out as the go-to titles of the bunch. One, of course, is the latest Drawful game, Drawful Animate. As the title implies, you have to animate your drawings  which is almost as tough as it sounds, even though you only have to draw two frames. However hard it may be, however, the game is hilarious enough that you wont mind drawing, say, Grass grows on my favourite foot, or Getting a sparkly spanking, or Best friends at circust schooool. As you can tell from those examples, Drawful Animate is deeply weird (and, with those typos, also keen to throw in a few spelling curves to keep the game from getting too easy), but with the right group of people, its amazing.Likewise, Job Job depends on playing with a good group of people  but if the people are good, the game is outstanding. It gives you writing prompts, then throws your answer over to someone else and asks them to use your words to formulate answers to job interview questions. It leads to some truly bizarre moments  some of the prompts I got, for example, were Why are peacocks overrated? and How would you fare at a rodeo?  but they lead to moments of hilarity.I mean, the whole game leads to moments of hilarity; thats the point of Jackbox, after all. But The Jackbox Party Pack 8 may be better than most of the other entries in the series  and seeing as were talking about a series that has produced some amazing games, that should tell you a lot.", "date": "December 7, 2021", "grade": "A-"}