{"name": "Mickey Storm and the Cursed Mask", "ref": "https://gaming-age.com/2021/11/mickey-storm-and-the-cursed-mask-review-for-nintendo-switch-ps4-xbox-one/", "text": "Mickey Storm and the Cursed Mask is a waterslide-based platformer. Remarkably, its not the first game of its kind to exist, since the same developer put out a game last year called Slide Stars, with the only difference apparently being that Mickey Storm is a new IP, and Slide Stars featured moderately popular YouTube and TikTok influencers.Now, I never played Slide Stars, but it sounds (and, indeed, probably is) horrible. And while I wouldnt say Mickey Storm and the Cursed Mask is the worst game Ive ever played, its still bad enough that it makes me wonder why anyone would think that waterslides are a great basis for a platformer.To be fair, Mickey Storm isnt a platformer in the most traditional sense of the word. Rather, its a platformer thats got a strong Trials influence. As you manoeuvre yourself across a series of waterslides, you also have to keep yourself balanced atop your innertube, or else you wipeout and need to start over again from the last checkpoint.To be less fair: it doesnt make a difference, since Mickey Storms controls are so bad they make it impossible to enjoy the game.The problem is that the physics are all off. Water, improbably, flows uphill  but the eponymous hero of the game cant really go that direction, so he needs to ride jumps and build momentum in order to make some pretty big leaps from slide to slide. Unfortunately, if he doesnt make a jump on his first try, youre pretty much screwed, since its nearly impossible to go back and build sufficient momentum. Even If you use the Trials trick of rocking back and forth, its not enough to make it onto a ledge thats just out of your reach.It also doesnt help that jumping sucks, especially if you havent yet unlocked the double-jump. It was pretty common for me to reach a trampoline (you know, that old water park mainstay), just miss it, and then spend the rest of my time trying  and failing  to get high enough to bounce onto it. And even then, the trampoline jumps are kind of weak, so I still wasnt guaranteed to make it where I wanted to go.Perhaps the weirdest thing about Mickey Storm and the Cursed Mask is that its very clearly aimed at young kids. Its been years since I was a kid, but based on the few young kid gamers I know, I cant imagine many would have the patience to deal with terrible controls like these  particularly when there are plenty of much better, much fairer platformers available to them.For that matter, I dont have the patience to deal with Mickey Storm and the Cursed Masks terrible controls. Or anything else about it, really. It may look bright and shiny and welcoming, but it quickly becomes clear that there are far better platformers out there.", "date": "November 9, 2021", "grade": "C-"}