{"name": "Forza Horizon 5", "ref": "https://gaming-age.com/2021/11/forza-horizon-5-review-for-xbox-series-x-xbox-one-pc/", "text": "If there is a single racing series that I love more than most, it has to be Playground Games Forza Horizon series. These are some of the best open-world racers on the market, and Im consistently floored by how much fun they tend to be even if each subsequent entry doesnt exactly remake the wheel. And thats exactly where I land with Forza Horizon 5, its an amazing racer that doesnt deviate too far from the past two entries, but the new Mexico location, and improved look/performance courtesy of the Xbox Series X, makes for one racing game you absolutely should be playing. Its also a day 1 Game Pass title, making this sort of a no brainer for Xbox owners that subscribe to that service.At the onset of the game youll be introduced to the Forza Horizon Festival, as youre literally air-dropped in different vehicles that show off of the new map in a pretty gorgeous intro sequence. From there youll start exploring Mexico proper, completing events to earn points that will unlock Horizon Adventures, which allow you to gain access to even more events and race types spread across multiple specialities, including PR Stunts, Road Races, Dirt Racing, Cross Country and so on. The progression system works pretty well here, just about everything you do manages to feed into the campaign progression nicely, and youll constantly be unlocking wheelspins, new vehicles, clothing options for your driver, new horn sounds and so on by clearing various attempts. Theres an absolute ton of content to uncover and explore across the expansive Mexico map, so youre never lacking for something to do.It also helps that car handling and in-game physics feels amazing. Leaping over sand dunes, cornering around small town streets, or just exploring the wilds at your leisure is just a really fun experience, and overall seems easy enough for just about anyone to enjoy. If youd like more of a challenge, there are plenty of tricky feats of skills available via the PR Stunts, and a load of adjustable difficulty options to make opposing drivers a little more fierce.You can also just opt to challenge other real players in a variety of events, and once again your world will be populated by other players when you connect online, allowing you to spontaneously engage in various events, convoy around the map, and so on. The unique battle royale inspired Eliminator mode is back, along with Horizon Arcade, which allows you to spontaneously join events with whoever has populated your current online game and take on unique, timed challenges. And of course you can opt to just straight up challenge other racers when starting the campaign events or opt for a separate online mode that consists of a variety of different mode types. While nothing feels particularly new about the online side of Forza Horizon 5, it all works flawlessly, and its also completely optional to engage with if youd prefer to solo around your world instead.Forza Horizon 5 also has all the livery customization options youve come to expect from the series, along with the ability to create your own events or try other player events from pretty much any objective marker on the map. Creating courses allows for a lot of flexibility, allowing you to create course names, descriptions, and use either preset routes or create your own route in order to build the ultimate custom experience. Again, all of this is super user friendly, and pretty easy to understand even if you commonly find level editors and what not be super confusing. I had little trouble creating my own initial courses, and could see people spending a lot of time fleshing these modes out even more.In addition to your standard race events and PR stunts, Forza Horizon 5 also has the fan-favorite barn finds, which are cleverly hidden unique cars that can be uncovered out in the wild. There are also a large number of single-player story driven events, which add a little spice to the standard races, with fully voiced interactions and stories to be told revolving around specific car types or scenarios. Id love to see this element fleshed out even more, at the moment it doesnt end up being much more than disembodied voices going through the story, but as it stands its a good distraction if youre a little tired from racing from point A to point B. Also Showcase events return here, offering up some additional spectacle with special races against other vehicle types like trains, jet skis and so on, which again just tosses in additional variety for the player to enjoy.I absolutely adore Forza Horizon 5, and while its possible to fault it as being a bit more of the same when compared to Forza Horizon 4, Im not sure thats actually a bad thing. Its a more polished experience overall, and while it may be playing it safe just a tad, its hard to deny that the game is a technical marvel, and a fantastic show piece for Xbox Series X and 4K displays everywhere. Even if you opt to play in performance mode to hit that sweet 60fps spot, youll be pleasantly surprised with how great everything looks in motion. So yes, if youre not already convinced, do yourself a favor and check out Forza Horizon 5 when it launches this week.", "date": "November 3, 2021", "grade": "A"}