{"name": "LEGO Builders Journey", "ref": "https://gaming-age.com/2021/11/lego-builders-journey-review-for-nintendo-switch/", "text": "By now, the LEGO game formula feels like its become pretty standardized. Thats not necessarily a knock against games like LEGO DC Super-Villains or LEGO The Incredibles, both of which are just fine on their own, but the glut of licensed LEGO games in the latter half of the last decade made it hard to distinguish between them all (licenses notwithstanding).In that context, LEGO Builders Journey feels kind of like an intentional rejection (for lack of a better word) in favour of something else entirely. There are no licensed characters to be found here, no crazy action sequences, no unlockable minifigs, no funny cutscenes  none of the traits that you may usually associate with LEGO video games.Instead, LEGO Builders Journey takes a more simple approach, with a basic story, no dialogue, and lots of short, puzzle-based levels. The game follows a boy and his dad through a hike and into their daily lives, and it tells it all through levels that look like they were created using piles of LEGO. The game arguably has more in common with The LEGO Movies frame story than with the main plot itself.The end result is fine. Nothing spectacular, nothing terrible, justfine. On the one hand, LEGO Builders Journey definitely lives up to its name: unlike all those licensed LEGO games, where the selling point was The Hobbit or Jurassic Park or Harry Potter, but with LEGO, here LEGO is the star. The game is all about using LEGO blocks to solve problems and get from Point A to Point B.The flip side of that, though, is that LEGO Builders Journey also feels much more ponderous and self-important than your standard LEGO game. LEGO Builders Journey wants to remind you of what it was like to play with LEGO as a kid, and it never lets you forget that. In fact, coupled with the tinkly piano soundtrack, at times it all starts to feel calculated and treacly, as they try their hardest to pull on your heartstrings. While I get why theyd want to do that, in its own way it feels as calculated as any of those licensed games.But Im probably being far too cynical about LEGO Builders Journey. In fact, Id say this: if you want a LEGO game thats actually about LEGO, rather than about using LEGO to see something else, then LEGO Builders Journey is exactly the kind of game you need to play.", "date": "November 3, 2021", "grade": "B"}