{"name": "The Legend of Tianding", "ref": "https://gaming-age.com/2021/11/the-legend-of-tianding-review-for-pc-switch/", "text": "I will always be the first person to admit that Im a pretty bad Asian person. I take no pride in my race, and will often ignore pleas to support my own (I can still say I havent watched Crazy Rich Asiansalthough I did watch Shang Chi: Legend of the Ten Rings). So it was surprising for me that during this years PAX Online, my eyes were drawn to a very Asian-centric demo on Steam. The Legend of Tianding is a platformer from Creative Games and Computer Graphics Corporation depicting the life of Liao Tianding, a Robin Hood-like figure revealed in the island nation of Taiwan. Liao Tianding lived during the Japanese occupation of the area in the late 1880s/early 1900s. Although declared a criminal and a murderer by the Japanese authorities, he was purported to have stolen from Japanese collaborators, defending an old man from police brutality and even absconding weapons from police facilities. Tianding is revered by the Taiwanese to the point where numerous plays, television programs and even films were made to spread his legend. The title puts you in control of a fictionalized version of the man, in the region of Dadaocheng, Taiwan. This hub world is brimming with activity and changes as your adventure progresses. In the course of protecting the natives from the Japanese colonizers, Tianding allies himself with a resistance group called 28 Mansions and investigates a set of mysterious talismans which could lead to pirate treasure. The devs managed to weave a lot of Tiandings exploits into the game, such as his rescuing of an old man from police brutality, his bounding from the rooftops, stealing from collaborators and even his untimely demise. The history lessons are also wedged into the collectibles of the game, which paints a picture of how life was in the early 1900s. Controlling the man felt extremely fluid and I would say mirrors the same feeling found in Drinkbox Studios Guacamelee. Tianding can jump, dodge, repel from points and perform special moves a lot like the colorful luchadors, however he distinguishes himself by wielding a crimson scarf that can be used to disarm enemies. Another distinguishing element of the combat is that most projectiles can be deflected by Tiandings tanto. The game however does frontload a lot of abilities in the first dungeon of the game, so changes to your character are minimal.The games action takes place over the course of 6 chapters which consists of 5 stages, and 6 boss fights. The stages are relatively linear with plenty of secrets to be found, the bosses are unique and will test the players skills and patience. On the surface, the title can be construed as a metroidvania, but its more castlevania than metroid, backtracking into the stages are only necessary to complete secondary objectives or to farm talismans which could bolster your abilities. The game can be completed in its Wanted Outlaw difficulty within 10 hours and getting 100% completion would tack on another 3-5 hours depending on your luck with item drops. I was extremely charmed by the presentation of the title. This legend is presented as a comic book, with panels showing up during the course of gameplay. Characters and backgrounds looks cell shaded, but incorporate halftones to really drive home that comic feel. The opening of each chapter is presented as part of a radio play, the intonation and the scratchiness of the audio is reminiscent of what I would hear when I would visit my grandmother. Much like the story of the man it is based on, I think people will be unaware of this extremely competent title. Its a tad short for my liking, but it is an otherwise complete experience. Hopefully the games marketing team will find the right influencers to champion this title. Those who do find it will get a chance to experience an enjoyable game and learn about the colonial history of an area that increasingly finds itself on the world stage.", "date": "November 2, 2021", "grade": "B+"}