{"name": "Beasts of Maravilla Island", "ref": "https://gaming-age.com/2021/11/beasts-of-maravilla-island-review-for-nintendo-switch-xbox-one-pc/", "text": "Before I write anything else about Beasts of Maravilla Island, I should probably admit that Ive never played Pokmon Snap  either the original game, or the Switch sequel that came out earlier this year.This is important to note, since the two games seem to have a lot in common. Both are photography games where you take pictures of rare and exotic (and entirely fictional) animals, so  again, never having played Pokmon Snap  its quite possible that everything good about Beasts of Maravilla Island is lifted from the Nintendo game.That said, from what I can tell, theres one key difference between the two that makes Beasts of Maravilla Island worth playing even if youve sunk tonnes of hours into Pokmon Snap: its not on-rails.I mean, its not entirely free-roam, either. While there are three biomes in Beasts of Maravilla Island, none of them really connect with each other, and in each one youre very much steered in one direction.Still, you get to proceed at your own pace here, and that makes a huge difference  the most important one being that it means you get to enjoy how gorgeous Beasts of Maravilla Island is, particularly in its first two worlds. The first one is a massive, lush tree canopy, the second one is a dark night-world, and both are full of plants, birds, and animals that are brightly coloured with hues from across the spectrum. Even with a few hiccups  which Ill get to shortly  its absolutely breathtaking. Its a pleasure to view these strange worlds through our viewfinder and just take in everything they have to offer.Unfortunately, the game isnt without some noticeable technical issues. The game definitely stutters  if not outright freezes  in places, which occasionally detracts from enjoying these majestic worlds. There are also several places that the games camera cant quite reach, which causes it to cut through solid objects and give you a glimpse into the gaping abyss that lies beneath every gaming world. Apart from when the game freezes completely, its never enough to completely ruin the game, but it definitely ruins a few nice moments.And Beasts of Maravilla Island has plenty of those. It may borrow some obvious elements from much better-known (and, frankly, probably better-made) games, but if you give it a chance, Beasts of Maravilla Island should be able to win you over with its charms.", "date": "November 1, 2021", "grade": "B+"}