{"name": "NEOGEO Pocket Color Selection Vol. 1", "ref": "https://gaming-age.com/2021/10/neogeo-pocket-color-selection-vol-1-review-for-pc-switch/", "text": "When someone mentions the NEOGEO systems, they rarely ever mention the handhelds SNK released. The NEOGEO Pocket and NEOGEO Pocket Color were not that well known in the USA, but were highly advanced units with a great line up of games available. SNK has brought back some of these great games in a nice collection for Steam (also the Switch) and while the selection of games is good, there are some missing ones that could have made it better.For those not familiar, the NEOGEO Pocket was a cool handheld unit that had its own line of game cartridges, similar to the Gameboy Family. Its games mostly consisted of cut down, cute versions of SNK Arcade and Home titles like Fatal Fury and Metal Slug. The games all feature chibi artwork and are scaled to fit the systems screen size. The first iteration was a basic black and white system with little appeal. After a year, a new color version was introduced which was much better. While most of the newer games that were released for the color also played on the original monochrome version, there were a handful of games that did not. The NEOGEO Pocket systems and its games were discontinued in 2001.This collection offers 10 games from the Pockets Library. Half of them are based on the SNK fighting games like Samurai Shodown and Fatal Fury. The other half are more platform or adventure oriented with one sports title, Big Tournament Golf, included for good measure. All of the games feature a digital manual, and a 3D box/cartridge you can view. I like how you can even take the cartridge out of the box and even remove its plastic protector case for a better look. Sadly, the menus are very bare bones and there is no artwork or history options included. One interesting option is the ability to play on the different Systems that were available. You can use the Original B/W the Color or the New Color that was supposed to be brighter and faster. You also can choose the different designs of the console that were released acting as bezels. These bezels can be turned off if you find them distracting, and the size of the screen can be altered to your liking.As for the actual games, they all seem to be emulated perfectly. They look, sound and perform exactly like their originals. For comparison, I checked some of these ports against my own NEOGEO Pocket and found everything was identical, right down to the system animation that plays when you start a game. Going over the included games quickly we have SNK Gals Fighters, a one-on-one fighter with an all female cast of fighters (sans the final boss, but I wont ruin that here). Samurai Shodown 2, King Of Fighters R-2, The Last Blade, and Fatal Fury First Contact are all great representations of their Arcade Counterparts. Metal Slug 1st and 2nd Missions are great side scrolling action games that are similar to the original arcade games, but provide their own charm with different modes. Big Tournament Golf is a competent golf title but only slightly similar to its big brother Neo Turf Masters. Rounding out the collection you have Crush Roller which is ok, but forgettable and Dark Arms 1999 which might be the worst overhead shooters Ive ever played.This brings me to one of my only complaints with this collection, and its kind of a big one. Many games like Sonic The Hedgehog, Pac-Man, and Cotton are all missing. As well as the first Samurai Shodown and King of Fighters games. While I can understand that some were not included due to licensing issues, many of the first party SNK games not being included is a mystery. Perhaps they have more collections planned for the future, or maybe some DLC. Overall, I like this collection (with the exception of Dark Arms) but I feel more of an effort could have been made to get some missing titles added.NEOGEO Pocket Selection is a good collection for those who were fans of the System and those who are curious about the system. While the selection is a bit lacking, all of the games play well and offer great fun and challenge. Its lack of extras and bare bones presentation may put off some, but many should be able to look past that and enjoy the games they have included. Some games like Dark Arms and Crush Roller are a miss, but others will keep pulling you back even after you beat them. Even with its shortcomings, I can recommend this collection to anyone looking for some nostalgic challenge.", "date": "October 27, 2021", "grade": "B+"}