{"name": "Horror Tales: The Wine", "ref": "https://gaming-age.com/2021/10/horror-tales-the-wine-review-for-nintendo-switch-ps5-xbox-one/", "text": "Last time I played a game from Carlos Coronado was in 2018 when I played  and was mostly indifferent towards  Infernium, a creepy horror game where you wandered around a gorgeous, mostly empty town trying to avoid enemies and solving puzzles. Now hes back with Horror Tales: The Wine, a totally different creepy horror game where you wander around a gorgeous, mostly empty town trying to avoid enemies and solving puzzles.Im being reductionist, of course. Even if superficially the two games have a fair amount in common, dig even the tiniest bit beyond those descriptions and you quickly discover theyre fairly different. Whereas Infernium had a supernatural feel running through it, Horror Tales feels a little more grounded, being set on an island in the Mediterranean. It certainly has some supernatural elements, but between the crumbling buildings, the scavenging rats, and the overwhelming feeling of death and decay  thanks in no small part to the omnipresent splashes of blood-red wine  it feels like youre trapped in a real-world nightmare (albeit one that shares a bit of DNA with Dishonored). Mind you, some of the real-world feeling may come from the fact that the game is built around dealing with a pandemic, which is kind of on the nose after the past eighteen or so months.Horror Tales is also just a better, more balanced game. Even though you cant fight the enemies here, which was also the case in Coronados previous game, at least in Horror Tales you have a good shot at outrunning them. Further, theres no set limit on how many times you can die, which was one of Inferniums dumber design choices, which means youre not constantly feeling like youre fighting a losing battle.And good thing, too, because Horror Tales has some pretty solid puzzles, as well as a surprising amount of platforming. It never feels impossible, but it always challenges you, but in a good way, so that you feel like youve achieved something every time you get past an obstacle. I hate to go back to Infernium again, but the difference is clear: that last game had an inscrutable internal logic, whereas here, its generally pretty clear what you need to do, its just a matter of doing it.If Horror Tales has a flaw, its that its much too reliant on jump scares. I know that theyre a well-established part of any horror game, but at times here it feels a little too formulaic.Even with that minor issue, however, Horror Tales: The Wine is still a very good horror game. If you want to escape our current pandemic world for one thats infinitely creepier, its definitely worth checking out.", "date": "October 14, 2021", "grade": "B"}