{"name": "Quake", "ref": "https://gaming-age.com/2021/09/quake-review-for-nintendo-switch-ps5-4-xbox-series-x-one-pc/", "text": "Unlike a lot of people of my generation, I dont have any fond nostalgic feelings towards Quake. I was vaguely aware of it back when it first came out, but it fell into the same big bucket of games that also included games like Doom, Wolfenstein, and Duke Nukem 3D  which is to say, first-person shooters that didnt interest me all that much at the time.Given my antipathy for gaming nostalgia, you might think that Im not a fan of this Quake re-release 25 years later. But youd be wrong: even if it shows its age, this is still an exceptionally good shooter.To be sure, it looks and sounds very much like it came out in the mid-90s. The graphics are practically unchanged, and if you have a picture in your head of any of those 90s FPSes, with their weirdly flat-looking monsters and blocky, blurry backgrounds, youre basically picturing this game. Couple that with the fact it was scored by Trent Reznor, and its hard to think of how the game could be any more of its time.But even if it looks dated, it still pulls off a creepy vibe better than any number of games that have come since then. In fact, while I wouldnt say Quake looks realistic, it definitely feels gloomier and creepier than any of those games I mentioned above. Theres something about the way the monsters lurch around, often rising from the dead, that creates a sense of tense dread.And, of course, it helps that Quakes action is still top-notch. Theres a reason why FPSes have been imitating Quake (and Doom, and Wolfenstein) for the last few decades, and its because it makes it so fun and so easy to run into a room, guns blazing, and blast away armies of monsters. Its a well-worn formula by now, but its not hard to see why it was so much fun at the time  I mean, its still so much fun.Obviously, if youve played Quake at any point in the last 25 years, theres probably not a pressing need for you to pick it up on current-gen systems  its basically the same game here that you couldve played at any time in the last few decades. But if you want to see a seminal first-person shooter thats aged surprisingly well, be sure to hunt this one out.", "date": "September 29, 2021", "grade": "A-"}