{"name": "Cultist Simulator: Initiate Edition", "ref": "https://gaming-age.com/2021/09/cultist-simulator-initiate-edition-review-for-nintendo-switch-pc/", "text": "The most important thing to know about Cultist Simulator: Initiate Edition can be found in the fine print on its eShop page. BE WARNED! it says. This game has no tutorial  part of the challenge is figuring out how to play. Its hard, but keep trying, and youll master it.Im incredibly skeptical of that latter part  and not just because of my well-established, long-standing aversion to modern board games that require a lot of reading. At least with games like Wingspan or Catan, they dont just include tutorials, its also easy to see how you eventually get good at them (provided youre even the tiniest bit more patient than me, which honestly isnt difficult).With Cultist Simulator, I just dont see it. Its an obscure game that makes zero effort to make it obvious what you need to do. Theres a manual, of sorts, but its functionally useless, written in a tiny font that doesnt tell you much even after you zoom in. In the games defense, its clear what the game wants you to eventually do  build up a Lovecraftian cult  but theres zero indication of how you get to that from the games very first step (which involves you working a dead-end menial job).Ill admit that a big part of why Im bitter about Cultist Simulator is that my playthroughs ended with me dying dozens of times, and I never once figured out why. Cultist Simulator throws all kinds of cards your way, and gives very little indication as to what any of them do. Even if you set it so that you only see the cards that are eligible to be played in any situation, youre still likely to be playing the same cards over and over again in the hopes that one of them will unlock some unknowable next step. (And even when I did unlock next steps, the end result was inevitably that Id get stuck in an unbreakable loop of putting down the same cards until, out of nowhere, Id die.)The crazy thing is, despite my constant frustration with Cultist Simulator, I still wouldnt say that I hated it. Its stylish, its got an interesting look and feel, and, even with my ineptitude, its pretty apparent that theres a very deep game to be found here  if you can just unlock it somehow.", "date": "September 28, 2021", "grade": "C"}