{"name": "Scrap Garden", "ref": "https://gaming-age.com/2021/09/scrap-garden-review-for-nintendo-switch-ps4-xbox-one/", "text": "Scrap Garden is simultaneously incredibly straightforward and incredibly odd.At first glance, it basically seems like your standard low-budget indie 3D platformer. You play as a robot, you wander around a world collecting gems, you ward off the occasional enemy, you solve fairly easy puzzles. It may not be directly copying anything, but its parts will all feel very familiar.At the same time, though, its a very strange game. Just watch its trailer, and count the number of genres and tonal shifts you see. It may not be perfectly reflective of the game, but its not far off, either. You play as a robot in a post-apocalyptic world, and then dragons get involved, and you have to navigate your way down rapids, and there giant rats and spiders, and there are on-rails sections and 2D platformer sections and all kinds of other stuff thrown together in a seemingly haphazard way.Adding to the weirdness, theres also a narrator who sounds like hes speaking to you through a tube and underwater. Couple that with a hazy, blurry look, and Scrap Garden feels sort of like a half-remembered, not-totally-coherent dream.With all those disparate elements, Im a little disappointed the game isnt more memorable. Rather than going over-the-top bonkers and leaning into its innate strangeness  for better or for worse  Scrap Garden is mostly bland and forgettable. Even its boss fights have no sense of urgency  youd think, for example, that running around a small crop of land while some giant worm tries to burst through the ground and squash you would get your heart pounding, but instead you walk around at a leisurely pace and wait for the worm to bang itself into environmental hazards.Obviously, there are dangers in leaning into being weird  not only can it be alienating, lots of games arent half as strange as they like to think they are. But Scrap Garden has a deeply oddball heart beating at its core, and its too bad that the game mostly ignores that in favour of its dull, competent respectability.", "date": "September 22, 2021", "grade": "C+"}