{"name": "Madden NFL 22", "ref": "https://gaming-age.com/2021/08/madden-nfl-22-review-for-xbox-series-x-ps5/", "text": "Tom Brady and Patrick Mahomes not the way I wanted to start this years Madden review, but here we are. Both Brady and Mahomes grace the cover of this years Madden and this review is not starting off on the right foot. As the resident Gaming Age Madden reviewer for the past five years you may know my dislike of Tom Brady and love for the Denver Broncos. That love also ties me to hate Mahomes and the Chiefs as they are in the Broncos division and by association I can NEVER root for them. So EA really didnt do right by me with this years cover (I mean come on, no Peyton Manning edition the year he goes into the Hall of Fame!?). I guess theres always hope for the Madden curse to return (kidding).Now that we got the cover situation out of the way lets talk about the actual game. My Madden reviews are becoming much like the Madden game year after year; very much the same. As someone that doesnt write a whole lot of reviews for the site anymore, I still take pride in the handful of titles I choose to cover and Madden will always be one of them. Every season I want to give EA the benefit of the doubt and hold out hope for a new or much improved experience, and every year Im let down, so far at least. Madden 22 this year launches on the previous gen and current gen (its not considered next gen anymore right?) at the same time. Last season, as I mentioned in my review for Madden 21, you received a free upgrade to the next gen version once they dropped and we didnt circle back to discuss it.On the surface Madden 21s upgraded next gen version is extremely similar to this years Madden 22. The same menu interface of the past season is back and you would be hard pressed to tell the difference between the two if they were next to each other in a Highlights magazine, like whats different in these two images? Many of the options and game modes are identical and I honestly didnt expect much difference. Since we didnt cover last years upgraded next gen versions, I want to talk a bit about how Madden plays on the current gen consoles. EA provided us with a code for Xbox Series X/S and I am fortunate enough to have both consoles in my home. While playing on the Series X you have the option of playing in performance mode which will give you the best FPS, or image quality mode which is will give you the best graphics. Having jumped between both, I would recommend playing on performance mode (which is generally my setting for all games that have similar options). The game is silky smooth on performance mode and while its true that in image quality mode the graphics are a bit improved, its not enough to choose it over performance in a sports game where gameplay is king. I do also want to mention that this option does not exist on the Series S. This was the first time I saw differences in the menu options between the Series X and S, like the graphic settings is not even available to look at on the Series S.Lets get into some of the new additions to Madden 22 because I actually really like them (bet youre surprised to see that). Right when you get into exhibition mode and pick your teams youre given the option for game planning. This gives you options for what you want to focus on, both on offense and defense. So if you want to focus on inside runs, you may see a boost on how your running back hits between the tackles, while taking a hit in how well he runs to the outside. On the other hand you could focus on short passes, which will cause the pocket to collapse more quickly. The same is done on the defense side of the ball. So if you focus on medium passes you could leave yourself exposed on the running game. I really like these strategy additions. You also arent tied to your choices for the whole game. Say youre getting smoked on the ground, Derrick Henry is stiff arming you out of your shoes (hey Josh Norman), at half time you have the opportunity to adjust all of your game plan settings and focus more on stuffing the run.Another new addition this year is the Momentum bar. This addition seems to be a bit polarizing in the online community, but I really like it. I think about playing with friends and how making momentum could really mean something. As you build your lead or lose your lead, you will see a swing on the bar above the score. At the start of the game this is more of a home field advantage and it swings each way depending how the game progresses. It includes gameplay changes like the player might not see his receiver routes or even receiver button icons after calling the play, hot route limitations, icing kickers and more. While playing the computer you see momentum shift, but unless its the computer with the momentum there really isnt much of a difference on the players end. Playing with friends is where this is to be really enjoyed. I did not see an option to turn it off which could be part of the reason people are not happy with it, but that could always be patched in later. For me I think its a cool addition that adds a bit more when youre trying to make a comeback against a friend and Mr. Mo is sitting on his bench.Outside of those additions, Madden 22 is very much the same experience it was last season. Minor tweaks here and there, but ultimately the same game modes and extremely close gameplay. Unfortunately, the 2K return to NFL games was delayed so Madden is once again without competition. And as Ive said countless times, without competition I dont see Madden ever really drastically changing. So theres always hope for next season if 2Ks arcade style NFL game comes out and is as good as some of the old 2K Visual Concepts stuff. Having said all that heres the returning modes; The Yard, Ultimate Team, Franchise, Superstar KO, and Face of the Franchise (which now does allow you to play your career from college to the pros as a linebacker).EA could always add additional modes after release like they previously did with Superstar KO, but you dont buy a full-priced game on the chances of an unknown additional mode. Another year of me hammering on like a broken record, but EA is not breaking any new ground and you should know this already. Until they really shake up the core of Madden (and really all their sports titles) theyre going to continue to get middle-of-the-road review scores. I definitely enjoy the additions of the momentum bar, the game planning, and the 4K 60 FPS, but those more than likely arent all thats important for casual fans or fans that dont own a 4K TV with a Series X or PS5. If you havent picked up Madden in a few years, theres nothing glaringly wrong with this years release and I would recommend it. On the other side of the coin, if youre a diehard and you play every year and might even have the free next gen release from last season, Id say this year is a safe skip and just download this seasons roster.", "date": "August 24, 2021", "grade": "B-"}