{"name": "Lost at Sea", "ref": "https://gaming-age.com/2021/08/lost-at-sea-review-for-ps5-xbox-series-x-pc/", "text": "I dont have any issues with games that are artsy. I dont have any issues with walking simulators. But Lost at Sea is obnoxious enough that Im ready to reconsider both positions.Its pretty clear that the game has grandiose ambitions and wants you to Feel Things (capitalization absolutely necessary, since this game has deep thoughts). You can tell this because it uses the (not really) John Lennon quote Life is what happens to you while youre busy making other plans right on the games intro screen (not to mention all its storefronts), and the whole game is about a person coming to grips with an emotionally challenging time in their life. (Spoiler: its a partner with dementia, because thats the clichd thing to do, and Lost at Sea is nothing if not clichd.)You do this by wandering around an island hoping to stumble across items from your past. When you find them you have to solve puzzles so you can unlock them and bring them back to different moments in your life, which in turn triggers an image with some faux-deep reflection. Somehow, though, even that description makes Lost at Sea sound much more interesting than it is. For starters, the puzzles arent particularly challenging or interesting. In fact, calling them puzzles is stretching the term as far as it will go  were talking about things like asking you to bounce higher and higher on a trampoline, or playing musical chairs. If you find any of the puzzles difficult, theres something wrong with you.Of course, the bigger issue here is finding the puzzles. For one thing the game equips you with a compass thats mostly useless. It may point you towards your objectives, but more often than not it feels like a vague suggestion than a useful tip. Further, the items you have to find are all basically glowing points of light. While thats fine, everything here has a weird glossy sheen, which means its awfully easy to see a glimmer in the distance, slowly walk across the island to reach it, and then find youve walked all that way for nothing.Even worse, you have an enemy of sorts here: a dark cloud that comes out of nowhere and sends you back to your last save point. You can try to outrun it, but theres no rhyme or reason to when it will catch you or when it will let you be. While Im sure its symbolic, it adds nothing to Lost at Sea beyond being a really annoying obstacle that simply prolongs the agony of playing the game.It would be nice if there was some redeeming quality to Lost at Sea, but I really cant think of anything. The voice acting is forgettable, though its hard to tell if this is because of the voice actor or because shes trying to make the best of a lousy, barely existent script. Likewise, the music is completely forgettable, to the point I have to keep going back to the game just to remind myself its there.In other words, Lost at Sea is the worst kind of bad game: one thats just plain boring. You cant even take enjoyment from its lousiness. Its competently done, but its a dreadfully dull experience, and for all the games efforts to make you feel something, the only emotion its likely to evoke is boredom.", "date": "August 17, 2021", "grade": "D"}