{"name": "Left-Right: The Mansion", "ref": "https://gaming-age.com/2019/03/left-right-the-mansion-review-for-nintendo-switch/", "text": "For about five seconds, the idea at the heart of Left-Right: The Mansion is an interesting one. Unfortunately, the moment you think about it any more deeply than that, it pretty much all falls apart.Or, at least, thats what I would have expected. The fact that this game exists in a fully realized form would suggest that, apparently, its major flaw never revealed itself to anyone behind the game at any point in the development process. Which, after having played it, kind of baffles me, because its a glaringly obvious problem.So, what is the idea? As the games name implies, youre faced with a series of doors, and you have to pick the left one or the right one in order to move forward. Pick the incorrect one, and you get sent back to the beginning. In order to make it to the end of the level, you have to memorize the order, and to beat the level, you have to pick the right side from which to attack the boss.It all sounds like an interesting concept, right up until the point that you discover that theres no rhyme or reason behind which door to pick or  its all random. There are no hints to be gleaned or patterns to detect. Its just page after page of having a 50-50 chance of guessing the right door, with the occasional 50-50 chance of picking the right attack thrown in to break up the monotony. I suppose it could be fun if you were the gambling type and youre able to convince yourself that random chance is fun, but otherwise, itll all start feeling pointless pretty quickly. If anything, this fact is underlined and driven home by the inclusion of a challenge mode, where you see how many correct guesses you can make in a row.The thing is, it wouldnt have taken much to tweak Left-Right so that it became worthwhile. Its visually appealing, with as much story as a game like this needs (youve run after your dog into a creepy mansion). If they had just made it so that there was any kind of skill involved in picking the right door  literally any skill whatsoever  it could have redeemed the whole thing. Instead, Left-Right: The Mansion just feels like a seemingly endless, monotonous game of chance, where the only way to win is to simply not play.", "date": "March 6, 2019", "grade": "C-"}