{"name": "Epistory  Typing Chronicles", "ref": "https://gaming-age.com/2021/08/epistory-typing-chronicles-review-for-nintendo-switch-pc/", "text": "Epistory  Typing Chronicles started its life as a PC game, and I have no doubt that its solid reviews on that platform are well-earned. Given that its a typing game  and an imaginative one at that  it seems like the sort of thing that would work really well on a platform where you have a keyboard.On the Switch, though? Given that the Switch quite clearly doesnt have a keyboard, the game kind of stinks.To be fair, Epistory tries its hardest to overcome that not-insignificant drawback. Right at the start of the game, it helpfully informs you that Joycons have been detected, and it strongly encourages players to hook up a USB keyboard. If you dont have a USB keyboard, though, youre kind of out of luck.The game tries its best to compensate for that by changing the words you have to type into a series of button combinations using the D-pad and face buttons, but that makes for a pretty poor substitute, since  and this should be pretty obvious to most people  random button combos arent at all like words. Its easy to type progressively more challenging words as enemies bear down on you from all sides since most people have a pretty good idea of keyboard layouts, and typing words is practically second nature. Even if youre extremely familiar and adept at pressing different button combos, its just not the same, nor is it as fast  nor, worst of all, is it anywhere near as enjoyable.While Ive never played the PC version, it still feels like this change fundamentally alters Epistory, and not in a good way. For one thing, your point totals  and, in turn, your ability to upgrade  multiply depending on how quickly you can type words; button combos dont feel the same (though Ill admit thats personal preference). For another, one of the appeals of Epistory on PC is that the words youre typing often have some connection to what youre seeing on the screen. Button combos, again, dont have that.Worst of all, though, it feels like the combat doesnt translate as well. Your character dies after a single hit, and you need to start over from the last save point. While that seems fair when youre quickly typing in words, when its simply random buttons  with some enemies requiring multiple different combos, and with multiple enemies coming at you at the same time  that seems blatantly unfair, even if Epistory apparently has adaptive difficulty.Its really unfortunate, because I feel like Epistory has a lot of potential to be great. Its papercraft world is gorgeous, and the voiceover narration has a lot of charm. But no matter how good those things may be  and how good this game probably is when you play it on PC  the fact of the matter is that Epistory is a lousy fit for the Switch.", "date": "August 4, 2021", "grade": "C-"}