{"name": "Helheim Hassle", "ref": "https://gaming-age.com/2021/08/helheim-hassle-review-for-ps4-xbox-one-switch/", "text": "Helheim Hassle owes a pretty big debt to the Monkey Island seriesThat, in and of itself, isnt anything crazy. After all, The Secret of Monkey Island came out more than thirty years ago, and in the subsequent decades its influenced lots and lots of adventure games. So adding one more to the list wont take anyone by surprise.What is surprising, though, is that Helheim Hassle isnt an adventure game  at least not strictly speaking. It has some adventure game elements, which is a big part of why the comparison seems so obvious, but its actually a puzzle-platformer. Im sure that there are other Monkey Island-influenced games that dont fall under the point-and-click adventure umbrella, but theyre uncommon enough that it still feels like a break from the norm.Mind you, Helheim Hassle might have been a better game if it had stuck to its adventure game influences. The puzzle-platforming here isinteresting, for lack of a better descriptor. The game stars a pacifist viking named Bjrn, who accidentally died a seemingly heroic death and wants to avoid going to Valhalla at all costs. To do this, you help him navigate through a series of platforming puzzles  which, naturally, you can only solve by popping Bjrns appendages off his body and using them, sometimes independently, sometimes in tandem.As mechanics go, as I said, its certainly an interesting (albeit kinda gross) one. The problem is that the execution is hit-or-miss. As the puzzles get more complicated, you need to start switching back and forth between different appendages, as well as mixing and matching them together, and rotating from one appendage to the next can be a bit of a chore. While the game is generally forgiving enough to allow you to work your way through the puzzles, there are still a few points where youre facing a bit of a time crunch, and at those moments, you come to curse the many different limbs you have to coordinate.That said, the games sense of humour is generally more than enough to carry it through those rough patches. Helheim Hassle has jokes coming at you at every turn, as Bjrn and his companion Pesto (also known as Pestilence from the Four Horsemen of the Apocalypse) constantly comment on everything going on in the world around them. Given that its a pretty bizarre, fourth wall-breaking world, the opportunities for comments are endless, and the game does a good job of keeping things entertaining no matter the circumstances.And really, thats what makes it so easy to like Helheim Hassle. As a puzzle-platformer, its got some issues. But as a Monkey Island-style adventure game trapped in the body of a puzzle-platformer, its interesting  and funny  enough that its more than possible to overlook those flaws.", "date": "August 3, 2021", "grade": "B"}