{"name": "The Ascent", "ref": "https://gaming-age.com/2021/07/the-ascent-review-for-xbox-series-xs-xbox-one-and-pc/", "text": "The Ascent drops this week on Xbox Series X/S, Xbox One, and PC, bringing with it an action-packed, cyberpunk infused, RPG adventure from developer Neon Giant. Its also worth mentioning that this is another day one Game Pass release for Xbox owners, so if youre at all on the fence after reading this review, it cant hurt to try the game for yourself. That said, I also really enjoyed my time spent with the game, and having it available on Game Pass day one is an absolute steal with this one.If your vision of a cyberpunk world is the rain drenched neon streets of Blade Runner, filled with garish holographic corporation logos, advertisements, downtrodden denizens roaming the streets and so on, then chances are youll love the visual design of The Ascent a great deal. It absolutely breathes life into what I envision a dystopian cyberpunk future to be, and there is so much detailed, fantastic scenery in this game that youll really be putting that screenshot button to the test on Xbox Series X.Its also a world thats absolutely alive with life, filled to the brim with NPCs as you make your way across the various sectors that make up a pretty large overall map. Granted, you dont interact with them much outside of the assigned quest givers you encounter, but they do react a bit when you bump into them, and if you start up a firefight in the middle of crowded street, theyll react appropriately, running away screaming as you take on various corporate goons and robotic menaces. Its one of the neater effects that I think The Ascent really nails, and helps make the world feel alive even though youre viewing it in a sort of top-down isometric way.The Ascent is also filled to the brim with action. As an indent (indentured laborer) working for The Ascent Group (think megacorporation), youre stuck in the middle of a mess when The Ascent Group essentially goes offline and defaults, making it ripe for corporate takeover in a not so peaceful manner. As the story unravels, youll take on a series of jobs from a variety of eclectic characters in an attempt to unravel the mystery of what happened to your former employer. In doing so, youll come across a variety of different weapons, augmentations, and other skills necessary to overcome a variety of enemies that swarm at you from every side as you move from zone to zone, following quest markers and uncovering new side missions along the way.The story of The Ascent is interesting enough, but does get a little bogged down in its own lore and unique terminology in a way that sort of reminds me of my first attempt at reading William Gibsons Neuromancer novel a long time ago. Unlike that book, The Ascent at least gives you a codex, helping you understand the difference in the types of A.I., the various factions, and other terminology thats not exactly common in everyday use. You can absolutely follow the moment to moment story beats well enough, but any lengthy moment of dialogue did start to see my interest wander a bit.Thankfully, all the moments in-between kept me pretty enraptured until the final credits rolled. Combat in The Ascent sees you equipped with two different weapons that you can swap between, culled from a variety of weapons youll either loot or purchase along the way. Weapons can have different properties, like fire or energy based projectiles, so its useful to have two different weapons since enemies will likewise be weak against particular types. When using a controller, youll aim using the right stick, visualized on screen by a laser sight, while moving with the left stick and firing your gun with the right trigger. To throw a little twist into this tried and true set-up, The Ascent also allows you to adjust the height of your shot, meaning you can aim your gun up by holding down the left trigger, allowing you to shoot over waist high objects in the environment that can also be used for cover. This works really well, and gives The Ascent a more tactical feel to its action than just being a straight runngun style shooter.In addition to your primary weapons, you can also gain and equip augmentations, which are essentially special abilities that work off of both a cooldown timer and an energy meter. These powers can vary quite a bit, ranging from a simple A.I. ally that will attract enemy fire, to spider robots that will seek out enemy targets and explode on contact. In addition, youll also have a tactical ability that charges over time, and even have some limited hacking skills via the ICE mechanic that allows you to take control of turrets or momentarily stun enemies. Youll need all of this as well, since The Ascent throws enemies your way often, and in large quantities as well. Thankfully theres a number of environmental hazards you can also take advantage of, leading to some impressive explosions in battle.As you complete missions and mow down enemies, youll gain experience and level up your created character, allowing you to gain skill points that can be poured into a variety of different categories. When I finished the game at level 28, I was able to fully max out 4 different categories, in part thanks to the random skill points Id also collect as loot throughout the world. However, there were other skill categories that I didnt even touch, offering additional reasons to play through the game a couple of times in order to mix up your skill specialties a bit. These skills also feed into 4 different attribute types, which can have a further effect on the strength or duration of the augmentations you equip. So if you have an augmentation youre particularly fond of that is focused on Cybernetics, youll want to put your skill points into the categories that are tied to Cybernetics.As far as issues go, there are a few things that stood out during my time playing The Ascent. My understanding is that there is a day one patch planned, which I dont believe was applied to the version of the game I was playing on Xbox Series X, so some technical things might get ironed out. I did have a couple of game crashes that occurred, but that also helped to highlight how frequent the autosave function works, in that I didnt lose any real progress on both occasions. I did have one severe framerate issue that lasted for a few minutes, with a pretty noticeable dip that didnt seem to be brought on by anything in particular. I certainly had encounters later in the game with a greater quantity of enemies, NPCs, and explosions going on and zero framerate issues, so again I think I could chalk this up to a probable bug. I also had enemies warp around or disappear on occasion, and had a memorable boss encounter where the boss spawned multiple times leading to a very quick death.If I have any real complaint outside of the occasional bugs mentioned above, its that the side quest structure and suggested level to complete seemed a bit out of whack. There are at least a couple side quests, one that you obtain pretty early, that will direct you to go to a particular zone that you wont get access to until later in the game. However, the side quest doesnt really tell you this, itll give you a general marker to follow, but when you hit a particular door or elevator in order to proceed, you cant advance until youve come across that zone in the main story. This isnt a huge deal, but I was left wondering if this was by design or a bug until I played more of the game, at which point Im pretty certain its by design. Im also not a huge fan of the world map design, I found it somewhat hard to read considering how many vertical levels there are to different zones, and wish I had the ability to set my own waypoints to aid me hunting down the right floor that a particular icon is on.Also worth mentioning that while The Ascent does feature online and offline co-op, I havent had a chance to really try the online co-op prior to launch. The game is absolutely fine as a single player experience, which is why Im willing to post this review now, but when I tried online co-op I was only able to create a lobby which nobody joined, or invite players to the lobby. I had no option to try and join or search for open lobbies, which I assume is a pre-launch issue. If youre really enamored with the idea of playing this game co-op, Id wait a bit more until it has been properly field tested to see how well it works.Despite some of the more minor issues listed above, there was very little that was able to pull me away from The Ascent in the past week or so that Ive been playing, and its certainly a game Id like to revisit post launch with a fresh character so I can toy around with different builds and loadouts a bit more. Again, its an absolute no-brainer if youre a Game Pass subscriber on Xbox, but even if youre looking to purchase the game outright, its absolutely worth checking out.", "date": "July 29, 2021", "grade": "A-"}