{"name": "Oceanhorn 2: Knights of the Lost Realm", "ref": "https://gaming-age.com/2021/07/oceanhorn-2-knights-of-the-lost-realm-review-for-nintendo-switch/", "text": "Oceanhorn 2: Knights of the Lost Realm is really influenced by Legend of Zelda.Call that stating the obvious, call that lazy reviewing, call that what you will  thats still the most important thing there is to know about this game.I mean, its hardly surprising. The first Oceanhorn was both very good and very indebted to Zelda. Somehow, though, Oceanhorn 2 takes the mimicry to a whole other level. Everything about it, from the character designs to the combat to the jars and bushes carrying hearts seems like it was lifted wholesale from Nintendos iconic franchise.To be clear, thats not inherently disqualifying. In fact  as I feel like Ive written on many occasions before  for some weird, contrarian reason, Im much more fond of Zelda-likes than I am of the original series itself, so Oceanhorn 2 being so blatant about its inspirations sort of counts as a plus for me.Plus, it doesnt hurt that its a pretty solid game in its own right. The story is much more engaging than the first time around, as is the combat, as are the puzzles. Oceanhorn 2 also feels more fully-fleshed out, thanks to the switch from the first games isometric perspective to this ones full-on 3D world. Theres also the addition of a few side characters to your party, which means that youre not always solving puzzles and exploring the world on your own.Still, even I can acknowledge that this switch brings the game much, much closer to Breath of the Wild, and I dont know that Oceanhorn 2 really benefits from that comparison. Its nowhere near as good-looking, for starters, and the combat  while better than the first game  doesnt feel as fluid as it does in Breath of the Wild.Of course, saying its not as good or as well-made as Breath of the Wild is something that can be said about a lot of games, so, again, there are only so many marks you can dock for that. Oceanhorn 2 wears its influences pretty clearly on its sleeve, and it does so in a way that doesnt always do it any favours, but if you can ignore that and accept it on its own terms, youll find a game thats pretty enjoyable in its own right.", "date": "July 13, 2021", "grade": "B"}