{"name": "Fly Together!", "ref": "https://gaming-age.com/2021/06/fly-together-review-for-nintendo-switch/", "text": "I played Fly Together! solo. Given that the game describes itself on its eShop page as multiplayer game of explosive airplane action, you might think that would be an impediment to enjoying the game. That, however, would be entirely incorrect.I mean, Im not going to discount the notion that Fly Together! is much more fun if you play it with others. Theres a whole battle mode, for example, thats built around multiplayer that I, obviously, didnt touch. On top of that, the game is built around chaotic air traffic control, and I suspect that the chaos  and, thus, the fun  increases when youre trying to coordinate your planes movements with those of other people.But even so, I still found a way to have a blast playing Fly Together! all by myself.The core of the game isnt much different from the type off air traffic controller games that have been popular since the beginning of mobile gaming (if not earlier). You have planes, you have airports, and you have people you need to transport: its all exactly what youd expect.But even if its a well-worn formula, Fly Together! still stands out by virtue of how well it plays within the confines of the genre. You have to account for rogue air transport planes and fighter jets, mountains, air currents, tornados, and all kinds of other obstacles. On top of that, there are a good number of different planes available to unlock, and the further in you get, the more you have to sub new planes in and out depending on the demands of the level. Add in the usual three-star ratings to be earned in each level, and you can see why the game demands that you replay each level until you get it just right.As I said up top, Fly Together! was clearly meant to be played, well, together. And I have no doubt that its even more fun when you play with people. But the fact is, its still totally worth picking up, even if you just want to play solo.", "date": "June 23, 2021", "grade": "A-"}