{"name": "Sonic Colors: Ultimate", "ref": "https://gaming-age.com/2023/03/sonic-colors-ultimate-review-for-pc/", "text": "When Sonic Colors: Ultimate made its debut on Steam, the press release announcing the news promised stunning upscaled visuals, additional features, a new game mode and enhanced gameplay. Now that Ive played itIm skeptical.Or, at least, Im skeptical about the claim of stunning upscaled visuals. Because theres something seriously wrong with how Sonic Colors: Ultimate looks here. The game looks all wrong, with everything looking muddy and the colours all bleeding into each other. If this were a case where you could play around with the settings and turn off the bloom effect or something, it might have made the visuals more tolerable, except this is a pretty barebones port on that front, so all you can do is change the screen resolution (which makes it look considerably worse) or play around with the brightness (which only makes the muddiness darker or brighter). I dont know if Id say it makes the game unplayable, but at the very least, it makes it difficult to play the game for any extended period of time. And thats unfortunate, because in every other respect, this is a pretty fun game. As Chris noted in his 2021 review, Sonic Colors: Ultimate is probably the best the series has ever been in terms of mixing 2D and 3D action. Whether youre running across the screen from left to right or soaring around a 3D world, it always feels like youre moving smoothly at top speed. Given that the series even struggled with this Sonic Frontiers,  more than a decade after Colors first released on the Wii, it really underlines how much of an achievement Sonic Colors: Ultimate was  and continues to be.Part of the reason why Sonic Colors works so well is that it adds to the usual gameplay formula. Here Sonic is charged with rescuing an alien race, the Wisps, from the clutches of Dr. Eggman, and in return the Wisps give him special powers like being able to travel via laser beam, or switching blocks from solid into rings. While the main goal is still rushing through the levels at very high speeds, adding these new powers adds a new element to exactly how you approach and attack each level. But again, to get Sonic Colors: Ultimates fun gameplay on PC means putting up with graphics that are, at best, an eyesore. Given that there are plenty of other options for playing the game, it may not be a trade-off you want  or need  to make.", "date": "March 3, 2023", "grade": "B-"}