{"name": "Mass Effect Legendary Edition", "ref": "https://gaming-age.com/2021/06/mass-effect-legendary-edition-review-for-pc-xbox-one-ps4/", "text": "Mass Effect has been held up as the standard for what an RPG can and should be for more than a decade, and for good reason. The massive Sci-Fi franchise showcased just how much impact a narrative based game could have on the players. Millions of fans have been inspired by Commander Shepard and the crew of the Normandy, and Mass Effect has been a huge part of the general conversation around video games for years. Unfortunately, Mass Effect was starting to show its age, as all games eventually do. Mass Effect 1 in particular struggled as time went on, both because of the age of the game and the improvements that subsequent entries made to the gameplay. Now with the Mass Effect Legendary Edition, a lot of that aging has been mitigated and the franchise is even more approachable than ever.Mass Effect 1 is the game that benefits the most from the changes in the Legendary Edition. Not only is it the oldest of the games, but it had the densest and most difficult to approach mechanics. Combat could be problematic, and there were occasionally issues with crouching behind cover, and melee was automatically triggered by shooting when you were close enough to the enemy. The Legendary Edition fixes that, and brings the combat and controls more into line with the rest of the franchise.Visually, the upgrades in the Legendary Edition are mostly positive. It is not the massive overhaul that some other games have benefited from recently, but it is more than enough of an improvement to justify the purchase. Mass Effect 1 again specifically benefits from the changes, although at times the newly revamped lighting and adjustments call attention to blemishes that were hidden in the shadows before. The upgraded visuals also call attention to how sparse and bland some of the environments are. A more traditional remaster/remake would have added in appropriate environmental upgrades and foliage, while the Legendary Edition is working with simply upgrading existing assets, not adding new ones.Playing Mass Effect in 4K is a treat, no matter which one of the games you are playing. I was able to maintain 4K/60FPS on a very middle of the road PC, and know that players on console have reported strong visuals as well. Speaking of the PC, there are not as many graphics options available as veteran players might think, with the options being streamlined and cut down to the bare necessities. This never felt like it wasnt enough though, because the Legendary Edition itself has limited how much tweaking is needed. These are still relatively old games, and the ability to run them all at almost max settings on virtually any PC in at least 1080p and in most cases 1440p makes messing with a lot of the minutia unnecessary.Overall Mass Effect 1 is still the roughest in the series, but it is way smoother to play with the upgrades in the Legendary Edition. Inventory management is still a chore, and some of the exploration still drags, but overall the focus on simplifying things allows the story and character moments to really shine. I had forgotten just how much of an impact the decisions you make in Mass Effect 1 have on the rest of the trilogy. Virtually every encounter has long lasting ramifications for your story, and it has been so long since I last played the entire series, I am going in with relatively fresh eyes. The Legendary Edition has given me a chance to play through one of my favorite game series of all time like it is new again.Mass Effect 2 was a massive jump for the series, and it was the game that originally got me hooked. There was a lot less that needed to be changed or upgraded here, and I spent less time looking at/for differences and more time just soaking in the story. Mass Effect 2 stands up against any game that came before or after, and is still a masterclass in worldbuilding, storytelling, and character development. It takes the groundwork laid by the original game and grows it all exponentially. The combat improvements are less noticeable coming from the Legendary Edition version of 1, but they are still there. Visually, all three games in this collection play pretty much the same, so you do not have to worry about tweaking settings between one game and another.Mass Effect 2 takes everything that worked in Mass Effect 1 and improves on it, while ditching virtually everything that didnt. I personally feel that it is the best in the series, and was a success that will not be replicated again. On top of the incredible base game, Mass Effect 2 has the best DLC of the series, and Lair of the Shadow Broker is one of my personal favorite pieces of DLC of all time. All of the DLC is available immediately, which helps it fit into the story a bit better, and is my preferred way to experience the entire package.The consequences of your decisions in Mass Effect 1 are much more keenly felt when moving straight into Mass Effect 2. You are much more aware of who is and isnt still with you, and you have a greater understanding of what is going on among your crew. Mass Effect 2 still feels like an experience ahead of its time, even though it is more than a decade old. Playing through it again in the Legendary Edition cements it in my mind as one of the greatest games ever made.Being the most recent game in the Collection, Mass Effect 3 feels the upgrades the least. It is still easily accessible and played on PC, as well as relatively easy to access on console. Although many people disliked or even outright hated the way it ended, I never felt like it was bad. I enjoyed the original ending, and I enjoyed the Extended Cut that they released later. This is included in the Legendary Edition, so if you were one of the fans who originally preferred the Extended Cut, you have it here too.One of my favorite parts of Mass Effect 3 was the multiplayer mode, and that has unfortunately been cut entirely from the Legendary Edition. I spent countless hours playing the co-operative multiplayer when Mass Effect 3 originally launched, and I would have loved to dive back in with the Legendary Edition. The omission feels odd, with the inclusion of so much else in this release. It is truly my only complaint with the Legendary Edition, but it feels like a relatively large loss. Perhaps my circle is small, but virtually everyone I know who picked up the Legendary Edition mourned the loss of the multiplayer.Overall, I do not feel like I need to spend a lot of time trying to convince anyone of how great these games are. They have been hailed as some of the best in the industry for a decade, and virtually everyone with a passing interest in games is familiar with them. I do want to make sure I stress how simple, but fantastic the upgrades in the Legendary Edition are. Sure, I could lament the lack of a real remake, or get nitpicky with the things that werent fixed, but ultimately I do not feel the need to do so. These games still hold up today, and while the visual improvements do not make the games feel Next-Gen, they definitely bring the games up to date and make them more than playable. The Mass Effect Legendary Edition is the perfect way for both longtime fans and series newcomers alike to experience one of the finest franchises in gaming history.", "date": "June 14, 2021", "grade": "A-"}