{"name": "Through the Darkest of Times", "ref": "https://gaming-age.com/2021/05/through-the-darkest-of-times-review-for-nintendo-switch-ps4-xbox-one/", "text": "As you can probably guess from its name, Through the Darkest of Times isnt exactly a happy game. Its about the German resistance in World War II, and its pretty unflinching in its portrayal of everyday life in Berlin during Hitlers rise to power. There are surely some more depressing topics for a game to tackle, but I cant think of what they might be off the top of my head.What sets Through The Darkest of Times apart from most other WWII games is in how mundane it is. This is no Saboteur, giving you a hands-on opportunity to shoot down Nazis wherever you may find them. Rather, you start the game as a single, ordinary person, and you have to recruit new members to your underground group so that you can perform such radical acts as meeting potential supporters at a school or a church, or going to a wedding to raise money to keep your operations going. Theres the odd opportunity to carry out bigger acts, like spraying graffiti on a wall, gathering intel to hand off to spies from other countries, or, if youre lucky, blowing up a bomb somewhere, but for the most part, you and your group are just struggling to get by. Even if the game offers you chances to take action, most of the time you have to stick with being reactive, if not passive, if you want to keep morale up and live to see the next day.This feeling of passivity is reinforced by Through the Darkest of Times gameplay. Its a mixture of resource management, turn-based strategy, and visual novel, as you make your way through four chapters of twenty turns each. You read about the people your character knows and meets during his/her journey, and you carefully assign members of your group to different tasks, balancing the demands of the task with their notoriety, your morale, and your funds. Its not fun, but its not really designed to be.Even so, I wouldve enjoyed (or at least appreciated) Through the Darkest of Times a lot more if my actions seemed to have any impact on the story. Obviously thats part of the bleakness of it all  youre just a small band of resistance fighters up against a whole country  but still, it often felt as if the game was completely ignoring my actions from turn to turn. One moment one of the members of my group was crushed because hed been fired from a job that allowed him to spy on Nazi bigwigs, and then a few turns later he was excited by news hed gathered that day at that very same job. Another time, after my little group had lost a few members due to death and defection, my character was still greeted like a hero at one meeting for having built up such a formidable group of resistance fighters. For a game built around telling a story, it really takes you out of it when the story doesnt seem to follow any kind of consistent logic.Ill also note that Through the Darkest of Times is a little heavy-handed at times in its political messaging. There are a few points where the game really goes hard on having Hitler himself talk about making Germany great again which isnot exactly subtle. This is further reinforced when characters go on about being antifascists, and when an American journalist pops in to talk about how many of his countrymen would be just as susceptible to such rhetoric and feelings. I mean, history certainly likes to repeat itself in some ways, but that doesnt mean that the game doesnt lay it on a little thick sometimes.Given that Through the Darkest of Times is built around telling a story, having obvious narrative problems  whether in terms of continuity, hamfistedness, or whatever  represents a bit of an issue. There are still some interesting ideas to be found here, and the setting alone makes it feel like few other games, but if you go in expecting something groundbreaking, you may find yourself disappointed.", "date": "May 31, 2021", "grade": "B-"}