{"name": "Rain On Your Parade", "ref": "https://gaming-age.com/2021/05/rain-on-your-parade-review-for-nintendo-switch-xbox-one-series-x/", "text": "I want to make one thing perfectly clear about Rain On Your Parade, before I say anything else: I liked it. Its a fun, cute, silly game, and Ill always jump at the chance to play more of those.The thing is, it not only knows that its a cute, fun, silly game, it also doesnt hesitate to remind you of that at every turn. Theres a certain amount of winking self-awareness here that prevents Rain On Your Parade from being as wonderful as, say, Untitled Goose Game or Donut County.I mean, Im sure there was some amount of calculation that went into both of those games, too. But the difference is that where it didnt feel quite as overt in those games, Rain On Your Parade is almost constantly trying to force its way into your heart and your social media feed at every turn. On top of the goofy story about a cloud who dreams of making it to the mythical land of Seattle, theres a bug (who really looks more like a worm) who reminds you to share any bugs you may find, and a photo mode that encourages you to share your favourite screenshots from the game, and a dressing room where you can personalize and share your cloud.And the forced attempts at going viral dont stop there. Theres a Metal Gear Solid parody level. And a zombie level. And boss fights. And an RPG level. And a villain who speaks only in rhyming couplets. And a meta level where the developers complain about having to include exactly 50 levels. At some point, it all feels like a little much.I think what makes it annoying is that, as I said, I actually really enjoyed it. My patience wore a little thin in places  particularly in tacked-on boss fights  but I never reached a point where I put the game down and never wanted to play it again.This is because, if you set aside all the virality-seeking trappings, Rain On Your Parade has quite a few good points too.Take its core concept: youre a cloud who wants to ruin peoples days. Even if youre a resolute optimist, thats pretty fun. And as the game slowly gives you more powers, it gets even more enjoyable, as your cloud can start to mix in lightning, and snowstorms, and tornados. Its kind of hilarious to play on the moon, and launch the space rover into the distance. It was fun rampaging through a TV studio, turning people into snowballs and hurling the little snow boulders down the stairs. I smiled as I played a Katamari-like level where I pulled a little black hole around a movie lot, sucking up everything.As much fun as I had with Rain On Your Parade, however, I still keep going back to how the games desperate desire to be liked was somewhat off-putting. Its unfortunate the developers didnt have more confidence in their abilities to make a fun game without all the viral bells and whistles, because even without them, theres something here thats well worth playing.", "date": "May 19, 2021", "grade": "B+"}