{"name": "Days Gone", "ref": "https://gaming-age.com/2021/05/days-gone-review-for-pc/", "text": "Days Gone marks another in an increasingly long list of former PlayStation exclusive games getting PC releases. Horizon Zero Dawn, Detroit Become Human, Death Stranding, Beyond: Two Souls, and now Days Gone. This ever-growing list is amazing, and continues to give me hope that some of my absolute favorite PlayStation exclusive titles like Bloodborne and God of War may one day make their way to PC as well. Days Gone might be my favorite of the ports so far, simply because I feel like way too many people slept on this game.For those who are not familiar, Days Gone is the (formerly) PlayStation exclusive zombie apocalypse, third person shooter from 2019. If you did not check it out when it launched, you would seem to be in the majority. I feel like a lot of gamers skipped out on actually playing Days Gone, and a lot of major gaming publications gave it middle of the road scores. GameSpot gave it a 5/10, IGN gave it a 6.5/10, and GamesRadar+ gave it 3.5/5. These are not necessarily bad scores, and I certainly dont fault the journalists for their reviews. I think each of them have great points and analyze some very real flaws with the game, but I personally felt like Days Gone was a much better experience.Days Gone puts you in the shoes of Deacon St. John, a former outlaw biker turned scavenger who is doing his best to survive with his friend Boozer after the loss of his wife. You learn early on that there is a possibility that his wife actually survived, which sends Deacon on a hunt to find her. The zombies in Days Gone are called freakers, and they are the extremely fast and aggressive Dawn of the Dead type zombies, and they attack in packs. One of the biggest talking points prior to the games release was the hordes of attacking freakers that were shown in all of the trailers. In practice, Days Gone managed to deliver an intense experience that mostly lived up to the hype and promise.All of the elements of a smash hit were there, but the overall reception was lukewarm to say the least. I know quite a few people went in expecting an experience more akin to the other big PlayStation exclusive zombie apocalypse game, The Last of Us. While The Last of Us was an absolute masterpiece that I believe has forever changed the medium, and shown just how much depth a video game story can convey, Days Gone was just a good, fun game. The gameplay wasnt as tight, the story was nowhere near as breathtaking, the characters were not as memorable (although Sam Witwer is fantastic as Deacon). The comparison to The Last of Us might not have been a fair one, but it is the one that I saw made most often. I did not feel any need to compare the two, and I believe that my experience was better for it. I went in with tempered expectations, and those expectations were exceeded.Now that Days Gone is coming to PC, I hope that even more players can get their hands on it and experience something they might have missed a few years ago. Not only is the game great, the PC port itself is great. Of course, everything on PC is relative to the system you have, but Days Gone runs incredibly smooth on even a mid tier PC. I am lucky enough to be in a position where I can try games out on multiple PCs with vastly different power. Days Gone performed great across the board. Lightning fast load times are always a welcome improvement when coming from last generation consoles. While the PS5 and Xbox Series X offer incredibly fast load times now, the PS4 definitely still chugs along a lot slower.Days Gone on PC comes with a standard array of adjustable settings to tweak the performance and achieve exactly what you want. The field of view slider is another strong feature a lot of folks look for when it comes to games on PC, with the increase in Ultrawide monitors and other peripherals that can take advantage of the setting. Everything that you would want in a PC game is here, and feels like it was there all along.Ultimately, if you played Days Gone and it didnt click with you before, it probably wont now. Like I said, it is not a perfect game. The story is not very deep, side characters can be a joke at times, the game tends to meander on its way to the real plot points, etc. None of this is changed with the PC release, but the performance is leaps and bounds beyond what it was on the PS4. If you never had a chance to play it back in 2019, or just skipped out on it for whatever reason, the PC version is the absolute best way to play Days Gone.", "date": "May 18, 2021", "grade": "B+"}