{"name": "Chronus Arc", "ref": "https://gaming-age.com/2019/02/chronus-arc-review-for-ps-vita-ps4-xbox-one-switch/", "text": "I dont want to suggest that all of Kemcos RPGs are more or less the same, but I was looking at other Kemco games Ive reviewed in recent years, and I was struck by the fact that you could take any number of those screenshots, and a good proportion of them could just as easily have come from Chronus Arc as they do from their original games.The overworld maps? Almost identical. The old-school RPG graphics? That could describe any of these games. Turn-based combat? You know it  though its important to note that, unlike Kemcos last outing, Revenant Dogma, Chronus Arc returns to the days of 2D battle screens, rather than 3D.Admittedly, not everything this game borrows from its predecessors is all bad. Like many other Kemco RPGs, Chronus Arc feels like it avoids some of the genres usual narrative tropes by virtue of the fact that the main characters all seem to like and respect each other. Every time two characters interact, I realized I was subconsciously ready for them to be jerks to each other for no reason  and every time, I was pleasantly surprised by the way they demonstrated fondness and affection for each other.That said, there is one area where Chronus Arc feels a little different: in its difficulty spikes. I remember other Kemco games as being fairly well-balanced, with the difficulty gradually increasing the further in you got. Here, by contrast, the game starts coming at you pretty hard just a few dungeons in, to the point that I died and had to use one of my saves very early on. Thankfully, Chronus Arc allows you to save as early and often as you want, so I didnt lose too much, but it was still surprising to die at all as quickly as I did.That oddness aside, however, Chronus Arc is pretty much exactly what youd expect from a Kemco RPG. Its not going to wow you with anything new, but its solid enough that you wont be too disappointed should you find yourself playing it.", "date": "February 22, 2019", "grade": "C+"}