{"name": "Toree 3D", "ref": "https://gaming-age.com/2021/05/toree-3d-review-for-nintendo-switch-pc/", "text": "Heres arguably the most important thing you need to know about Toree 3D: its only 99 cents.Do the graphics look kind of cheap? Yes, but the game only costs 99 cents. Is it short? Yep, but again, its only 99 cents. Does the story make no sense, and does the game end rather abruptly? Yes and yes againbut have you seen that price?That said, I dont want to make it seem like Toree 3Ds only redeeming feature is its low price. I dont know if youd taken a good, long look through the eShop lately, but theres all kinds of dreck and shovelware to be found for a buck or two, and most arent even worth the space on your memory card, let along actual money. Toree 3D, by contrast, is actually pretty fun, low price or not.I mean, the low price certainly helps you overlook some things that would be issues in higher-priced games. As I said, the graphics are nothing special, and will instantly bring to mind the earliest days of 3D platforming  not just in the fact you can see every single polygon, but in the garishly hideous colours, too. The controls, too, can be a little finicky, and youll frequently find yourself fighting with a camera that never quite goes where you want it to go.But even with those issues  and maybe even a little bit because of those issues  Toree 3D is still surprisingly decent. The levels are just the right length, and understand how to challenge you without being sadistic about it. Further, even if the whole game is somewhat short, you can still challenge yourself by going back to try and collect every star, and you also unlock new characters on finishing the game on top of that. Even the platforming is a lot better than many other 3D platformers that cost several orders of magnitude more.Like I said, there are all kinds of really terrible games lingering around the outskirts of the eShop, trying to sucker you in with low prices before they instantly reveal their awfulness. Toree 3D may look like it belongs with those other bottom feeders, but if you give it a chance, youll probably be surprised and kind of impressed by what you find.", "date": "May 6, 2021", "grade": "B"}