{"name": "Tetris 99", "ref": "https://gaming-age.com/2019/02/tetris-99-review-for-nintendo-switch/", "text": "Nintendo Direct events always come with some expectations, usually involving Nintendos tried and true franchises. Smash Brothers, Animal Crossing, Metroid, if one of these properties dont show up in the Kyoto based companys prepared media presentation, fans will take to social media to showcase their disappointment. However despite fan expected bullet points, these showcases often come packed with surprises that no one sees coming. From the announcement of the Year of Luigi, Bayonetta 2, Dark Souls Remastered, Nintendo Directs often will give you announcements you never knew you wanted. The latest edition which occurred in February 2019 proved to be no exception as Nintendo revealed that one of gamings beloved puzzle game would be coming to the switchas a battle royale game.After a lengthy segment about the the latest Fire Emblem title, a very familiar silhouette of a puzzle piece appeared on screen and the presenter declared Iconic Puzzler Arrives  Last Player Standing Wins. The world was introduced to what should have been a no-brainerA Tetris Battle Royale. Dubbed Tetris 99, it pits you against 98 other players in a winner take all match. Your playfield is flanked by 49 tiny screens on each side, with each of these tiny screens representing your opponents. You create lines to send garbage to an opposing player of your choice that you selected with the left analog stick, or a player who fits the profile that youve set with your right analog stick. Like any good battle royale, theres no manual explaining the games mechanics leaving players to figure it out as they play.As long as you have a steady connection, you will have no problem getting into games. In fact I would dare say my average wait to get a game started would hover around 10-15 seconds. This version of Tetris features the ability to hold pieces and to perform T-Spins (which was something I finally decided to look up after hearing about them so much in the past but never did). Given this is a multiplayer game where there could be only one winner I find myself releasing myself of silly self imposed limits that I put on myself when i play Tetris such as not taking advantage of the hold mechanic. Youll need to utilize every advantage if you want to be the last man standing.Presentation wise, the game is very minimalist and clean. The main game mode, your stats as a player and options are the only thing you have in the main menu. The playfield features calming blue tones, although the game is anything but calming. You will catch glimpses of light flying about as other players send trash lines to other competitors. If youre being actively targeted a yellow line will be drawn between your playfield and the your nemesis field. Play well enough and you might earn the ire of a lot of players, making your screen look like that iconic poster for John Wick 2 where the titular character is in the center with guns pointed at him from all angles. Sadly I dont know what being #1 is like, the closest Ive ever gotten was 2nd place on my second gamebut I hope to get to that summit one day. The stats screen seems to imply that other modes will be added to the future, and during the Nintendo Direct it was mentioned that there will be events so even if the original game mode gets stale (Im not sure how thats possible), but this title will have support moving forward.", "date": "February 21, 2019", "grade": "A+"}