{"name": "Outriders", "ref": "https://gaming-age.com/2021/04/outriders-review-for-xbox-series-x-ps5-pc-ps4-and-xbox-one/", "text": "Outriders, a new third-person shooter from the developers at People Can Fly, just recently launched on most major platforms and Ive been spending the last couple of weeks shooting it out in this fun but flawed online game. With its emphasis on loot and multiple character upgrade paths, theres a little Borderlands DNA mixed in with Gears of War (and maybe even a bit of Diablo) but I dont think Outriders is easily comparable to any or all three of those games either. It does, thankfully, feel pretty unique, enough so that I was compelled to finish up the story and check out the end-game content, and plan on revisiting the game down the road.In Outriders youll take on the role of a player-created Outrider, who is essentially an explorer stuck on a planet that was meant to be humanitys escape from a dying Earth that turns into a hellish, nightmare experience. Youll battle it out with other remnants of humanity fighting over what scraps they have left, along with a host of alien bad guys and monsters as you make your way through the 20ish hours or so the campaign will take to complete on your first playthrough.There are side missions in addition to the story missions, which unfortunately are not varied enough to feel exciting, but are easy enough to finish that theres not much point in skipping them. Id also argue that the story isnt bad, but mostly because I kind of enjoyed the weird cast of characters you collect as you advance through the game. Some of the voiceover work is a little odd, line delivery being either intentionally or unintentionally hilarious at times, but I didnt find myself wanting to skip through cutscenes, which is a good thing overall.As mentioned above, Outriders is a third-person shooter, and at the onset feels pretty similar to Gears of War, but that changes quite a bit as you begin to gain more abilities for your selected character class. There are four classes to choose from, each with unique abilities and skill trees, and they all feel pretty varied and worth toying with to find one that matches your playstyle.Outriders tackles health regeneration in a unique way among the different classes, requiring you to kill enemies to gain small amounts of health in different ways based on the class you select. For instance, if you opt to go the Pyromancer route, youll need to light enemies on fire before they die in order gain health regen. Thankfully, most of your abilities are focused on doing just that, which is par for the course on most of your class options. This ends up turning Outriders into a more run-and-gun experience once you gain access to the full ability list, meaning youll spend less time in cover and more time rushing around chaining together kills to stay alive. This works really well, and makes the constant combat encounters feel fun and fresh throughout.I also think the loot mechanic of the game does a pretty good job of being the carrot on the stick that will keep you coming back for more. Loot rarity falls into the standard common, uncommon, rare, epic, and legendary categories found in other loot-focused games. In order to up your chances of finding better loot in Outriders theres a World Level system, which can make the game harder but increases your chances of finding legendary loot and also increases the overall level of loot that drops, and your ability to equip higher-level loot. There are multiple World Levels to choose from, 15 in total, but youll have to do well enough at your current World Level in order to unlock the tougher challenges, which helps keep the whole system balanced.That said, there is room for improvement with Outriders, especially when it comes to the online side of things considering this is an online-only experience. Ive not had a great deal of trouble with general server stability since launch, and Ive played on both the PS4 with the code Square Enix provided and also on Xbox Series X via Gamepass. Outside of a handful of issues in the first weekend, I can start up my own game and get going well enough. However, trying to join in-progress multiplayer games is an absolute slog, even with crossplay turned off. My experience so far has mostly been failed games before they even start. Also, the lack of lobbies or an available list of games to choose from seems like a severe oversight, especially when trying to engage in the end-game expedition mode.Other issues stem from the user interface. You can break down items for crafting materials via your menu, and have a handy option to select all of each rarity type when doing so. But if you opt to sell items to a vendor instead, youve got to use R3 for each item you want to sell, and often have to click that analog stick button twice just to get it to register. I also think both the mini-map and main map in the game are essentially useless, with no compass or real ideal of direction given. This isnt too much of an issue when the waypoint system is working, but when it comes to tackling sidequests Ive had multiple issues with the waypoint getting stuck on finished objective points, which means you need to clumsily run around to find where you actually want to go next or need to warp around to different points on the map in order to reset the bug.Still, despite its issues, I mostly enjoyed my time with Outriders, and with a few more updates and tweaks I think itll be at a point where Id like to go back and play more of the end-game content or roll another character class. Id say its a harder sell at full price for $60 right now, but its more of a no-brainer to try out if you have the option to do so on Xbox platforms via Gamepass.", "date": "April 22, 2021", "grade": "B"}