{"name": "Rip Them Off", "ref": "https://gaming-age.com/2021/04/rip-them-off-review-for-nintendo-switch-xbox-one/", "text": "My feelings towards Rip Them Off went through three distinct stages.First, I couldnt figure out what I was doing at all, so I obviously didnt enjoy it all that much. It was obvious the game was an interesting twist on your standard tower defense formula, where your goal was to set up shops that could take in as many passers-by as possible, and you have to quickly upgrade as they go by in order to meet your daily quotas. The thing is, there are different-coloured starting points and different towers, and the game does a lousy job of explaining what the differences are, burying you with lots of text where the easier thing would have been to just let you play.My second stage is when I realized that all that explainer text was useless, and that I could just play around with different combinations of towers/shops in order to maximize how much cash I was earning. It was here that the game started to get really fun  not only was Rip Them Off offering a unique take on tower defense games, it wrapped it up in an aesthetically pleasing package with a nice jazzy soundtrack. I was hooked, and found myself losing an hour and there as Id try to squeak in a quick play session.Unfortunately, this enjoyment all-too-quickly gave way to my third and final stage: discovering the game crashes constantly, and having to restart every level or so. At first I didnt mind, since I was still enjoying what I was doing. The odd crash here and there was a small price to pay for such a fun puzzle game.But then the crashes started happening every single level, and my ability to overlook that fact took a nosedive. Sure, Rip Them Off was fun, but when that fun got interrupted every ten or fifteen minutes, I cant say I continued feeling very charitable towards the game.Dont get me wrong, if it didnt crash, Id still be raving about it. Its not often you see the tower defense genre not just rethought in such an interesting way, but also paired with a lively soundtrack and sleek visuals. But factor in Rip Them Offs literal game-breaking technical performance, and suddenly, it becomes impossible to recommend the game.", "date": "April 6, 2021", "grade": "C+"}