{"name": "Shady Part of Me", "ref": "https://gaming-age.com/2021/04/shady-part-of-me-review-for-nintendo-switch-ps4-xbox-one/", "text": "The more I played Shady Part of Me, the more I felt like I was playing a game of Spot the Influence. Theres a bit of Limbo there, some pieces of Braid over there, a heavy dose of Contrast scattered throughout, maybe even some Lost in Shadow or Little Nightmares if youre looking hard enough and/or youre so inclined.I know that none of those games invented what they did. Ideas like rewinding time, controlling multiple characters, and playing with shadows have all been around for years, in varying ways, and none of those games I mentioned own them. Its just that Shady Part of Me brings together a whole bunch of really great influences, but then doesnt do much in the way of developing its own distinct identity.I mean, it certainly tries. Its a story of a young girl and her shadow trying to escape some kind of institution. The art is dreamlike, and the music is understated and creates the right kind of atmosphere. On top of that, Shady Part of Me does a good job of making the 2.5D environments interesting, adding in MC Escher-like twisting stairs and rooms made of playing cards to overcome the drabness of a mental hospital. The puzzles arent incredibly challenging, but they at least keep the game moving forward.The problem is that once you get past the aesthetics, theres nothing here that hasnt been done before, and better. If our heroine gets stuck in the light, you rewind back to when shes safe and try over again. She can influence her shadows world by playing around with objects that are reflected into the shadow realm. And even if you just look at the aesthetics, its not as if the game invented the idea of making a world thats simultaneously dark and dream-like, to say nothing at the idea of using a platformer as a metaphor for working through mental health issues.And thats what makes it hard to get all that invested in Shady Part of Me. No matter what good things it has to say or how nice it usually looks, it never does so well enough that you can overlook how obviously it borrows from other sources. Itll be fine if youve never played any of those influences before, but otherwise, youll just be thinking of games like Limbo, Braid, and Contrast.", "date": "April 2, 2021", "grade": "B"}