{"name": "Crash Bandicoot 4: Its About Time", "ref": "https://gaming-age.com/2021/03/crash-bandicoot-4-its-about-time-review-for-ps5-xbox-series-x-switch/", "text": "I have to admit that I approached Crash 4 on the PS5 with some trepidation. While I know that my colleague Paul loved the games PS4 version, I didnt come to it with the same kind of history with the franchise. I never played any of the games the first time around, and when I tried my hand at the N. Sane Trilogy, I was kind of indifferent. Couple that with my general aversion to nostalgia-tinted games, and you can see why I may not have had sky-high hopes for enjoying the game.Turns out, I should have been more optimistic. Crash 4 is an outstanding entry in the series that doesnt require that you know everything  or anything  thats come before it in order to get the most out of it. Its a wonderful 3D platformer that just so happens to be the revival of a once-iconic franchise, and I loved it.Mind you, I wasnt very good at it. Actually, thats putting it mildly: Im terrible at it. The only reason I was able to keep at it was because Crash 4 offers a modern mode thats a little more forgiving as far as checkpoints, and it offers unlimited lives.Still, the fact I kept at it even after dying dozens of times every single level should tell you just how good this game is.A big part of why I loved it is because it never feels like youre always doing the same old thing. For starters, Crash occasionally gets different abilities that change how you play  and not just jet skis and rail-riding, but suits that change your surroundings and help you fly. On top of that, there are plenty of bonus levels and a couple of different modes to help switch things up. And on top of that, while you spend the bulk of the game playing as the eponymous marsupial, every so often the game switches up your character, and those levels add on an extra layer of complexity.The other great thing about Crash 4 is how varied the levels look and play. A lot of effort went into creating distinctive worlds, and they help the game constantly feel fresh and fun.Really, that could be the tagline for Crash 4: fresh and fun. It may be based on a franchise that started a few decades and generations ago, but this new entry feels resolutely modern. Its a wonderful addition to a series that youre sure to enjoy, regardless of whether youve been waiting for it for many years, or youre coming to Crash Bandicoot for the first time.", "date": "March 29, 2021", "grade": "A-"}