{"name": "Tony Hawks Pro Skater 1 + 2", "ref": "https://gaming-age.com/2021/03/tony-hawks-pro-skater-1-2-review-for-ps5-xbox-series-x/", "text": "Yes, Im old enough to remember the release of the original Tony Hawks Pro Skater waaayyyy back in September of 1999 on the PlayStation  so I definitely have some history with the popular franchise across many platforms. Also, as a skater in my younger years, there really wasnt a great videogame representation of the sport  though I played the hell out of 720 in arcades, Skate or Die and T&C Surf Designs for the NES, California Games for the C64, and anything else I could get my hands on. So Activision and Neversofts Tony Hawks Pro Skater was groundbreaking for fans of the activity, not because it tried to accurately simulate skateboarding (it definitely did/does not), but because it made for an enjoyable easy-to-play yet tough-to-master gaming experience which nailed the culture and aesthetic of the time.As Dustin already glowingly covered in his review of the current-generation release of the remastered Tony Hawks Pro Skater 1 + 2, theres absolutely a ton of content to dig into from the first two classic games and a whole lot more thanks to the brand new account-level challenges to complete, online and local multiplayer, a plethora of customization and unlockables, and more bells and whistles than we probably even needed.The core of the game is the same though  pick a pro skater (or create your own) and let loose in a location for 2 minutes, knock out specific challenges to unlock more locations and rewards, rinse and repeat. The gameplay loop is just as addictive as before, and even more so now since theres just so much content here. While the THPS1 levels/locations are more memorable to me personally, I do overall prefer the sequel thanks to the more interactive elements and creative environmental designs. Regardless, having 17 levels to play through in a single game, as a solo player or with friends as a crew, will keep players busy for quite a while. Oh not to mention the extensive Create-a-Park functionality, which allows users to design their own levels to play and share with the community, and theres even challenges and rewards associated with that.The current generation release of Tony Hawks Pro Skater 1 + 2 (PS4 Pro, Xbox One X included) made for an already great looking game thanks to updated, polished visuals, a smooth framerate and dramatic lighting and effects. The PS5/Xbox Series X|S pushes it a bit further with either an insane high performance framerate option with 120fps at 1080p resolution for those with displays that can handle it, or the standard, more detailed native 4K resolution option at 60fps (my configuration). The Tony Hawk games are not exactly aiming to be photorealistic but the amped up horsepower of the new consoles do a great job in showing off the games interactive environments with enhanced lighting, shadows, reflections and textures, along with always hyper smooth skating action.Playing on the sun-kissed and highly detailed Venice Beach location from Tony Hawks Pro Skater 2 with near blinding levels of HDR lighting, then the dim moody warehouse of the first game really shows off the diversity of the games visuals and environments. This next-gen version also features super quick loading times (which I abused quite a bit during competition levels), precise spatial audio (so you can really hear those annoying NYC cabbies attempt to run you down from behind.. over and over), and for the PS5 versions specifically some haptic feedback/adaptive trigger effects for the DualSense controller. I have to say though, not fully utilizing the integrated speaker for truck grinding, board sliding and various localized board sounds seems like a missed opportunity.Anyway, the fact that the Tony Hawks Pro Skater franchise has withstood the test of time is a testament to the care that Neversoft put into the original game over two decades ago. If youre a veteran skater or just someone looking for a fun skating experience and have access to a next-generation console most certainly consider checking out Tony Hawks Pro Skater 1 + 2.", "date": "March 26, 2021", "grade": "A"}