{"name": "Summer Catchers", "ref": "https://gaming-age.com/2021/03/summer-catchers-review-for-nintendo-switch/", "text": "Even if Summer Catchers originally debuted on PC a few years ago, I would 100% believe it if someone told me it was originally conceived of as a mobile game.That probably comes off as a bit insulting, andwell, it should. Summer Catchers is essentially an endless runner where frustration is baked into its core gameplay, and not in a good way. Its a game where you can see where it would make you pay to win, and where theres a big gap in how it works because that pay to win model isnt present (or, at least, its not in the Switch version). Im not suggesting that Summer Catchers would be better if it was pay to win, but at least then it would make sense.Instead, what we have here is basically a stage-based endless runner where you have to swap parts in and out as youre going along. Certain parts only work for certain obstacles. For example, a jump will help launch you over a snowbank or a field of jagged ice chunks, but does no good if you need to chop down a tree or outrace a monster. You can only have three parts available at any given time  and thats where the problems start.First off, swapping parts in and out is basically done at random. You can buy more of certain parts before a level begins, but once youre racing along, its entirely random what the game will give you. On top of that, each level has special parts that will help you achieve a task, except again, you have no control over when those special parts will pop up. And to round out Summer Catchers major issue, you can only swap out one part at a time, and then you have to wait for the swapping button to recharge  and that may only take 10 seconds or so, but during that time youre also likely to pass a couple of obstacles for which those parts may have been useful.See what I mean about the pay to win gaps? Its not hard to imagine some enterprising mobile developer giving players the option of paying to reduce the wait time, or increasing the number of onscreen slots, or any number of fiendish ways to make players pay more. And again, to be clear, Im not saying that Summer Catchers would be better if it was pay to win, but at least then it would make some logical sense. Instead, youve got a game thats built almost entirely around randomness rather than skill, and that takes a lot away from it.Which is a shame, because its also easy to see how Summer Catchers couldve been phenomenal. Its about a young girl, Chu, whos tired of the winter and wants to see the summer, so she sets off on a trip to the ocean, which is where the summer is hiding  which is something I totally get, as I look outside and see the temperature stubbornly sit around -10 degrees. Along the way she makes all kinds of animal friends, and her interactions with these new characters are always fun. Between her friendliness and her indomitable spirit  not to mention some gorgeous pixel art graphics and a peppy soundtrack  its impossible not to root for her.Or, at least, it would be if the game didnt get in its own way with terrible design decisions. Summer Catchers does some things very well, but because its burdened with gameplay that seems like it was rejected from a not particularly fun mobile game, it never hits the heights that it could have (and probably should have).", "date": "March 17, 2021", "grade": "B-"}