{"name": "Sackboy: A Big Adventure", "ref": "https://gaming-age.com/2023/02/sackboy-a-big-adventure-review-for-pc/", "text": "I had a brief moment of panic when I started playing Sackboy: A Big Adventure on the Steam Deck: as the PlayStation logo flashed across the screen, the game basically shuddered to a halt, and I could practically see each individual frame as it went by. As much as Ive always loved LittleBigPlanet and as forgiving as I can be of poor performance, not even Id be able to overlook something like that.Then the game starts up, and everything is completely fine from that point on. And thank goodness it is, because Sackboy: A Big Adventure is on Steam is every bit as delightful as it was when Jim reviewed it as a PS5 launch title.The interesting thing about Sackboy is how much it feels like an extension of the other LittleBigPlanet games, even though it ditches the series usual 2D perspective in favour of being 3D. While this change can sometimes be pretty momentous  think of how differently a 2D Mario game plays from a 3D Mario game, or of how different 2D vs 3D Sonic games are  in this case, it doesnt feel like youre playing a completely different type of game. For better or worse, its basically how youd imagine LittleBigPlanet would play if it had an extra dimension to play with.Seeing as I loved LittleBigPlanet, as far as Im concerned thats only a good thing. Its amazing to see the handcrafted look of Sackboys world fleshed out a tiny bit more  and at the same time, its also a relief to see that developers Sumo Digital achieve this without sacrificing any of the love that characterized the world created by Media Molecule. There are also plenty of bubbles and stickers to collect here, which is great if youre the kind of person who enjoys seeking those out (and, in this context, I am).At the same time, there are also some nice improvements. For starters, the jumps dont feel as floaty as I remember them feeling in LBP. While its not like Sackboy is a precision platformer that requires exact jumps every time, its still a welcome change that you have a better idea of exactly where youll go when you jump somewhere. Additionally, the music is also a big highlight here. I cant say that the scores or soundtracks of any LBP games ever stood out to me, whereas Sackboy does a fantastic job of mixing together well-known songs like Uptown Funk with original music, and all of it fits in perfectly with the games vibe.Just about the only complaint I could think of for the game is that its online multiplayer isnt well-populated given that its not exactly setting the charts alight  but a) its fun in single-player, and b) thats the sort of thing that could be fixed if Sackboy had the popularity it deserves. Do your part to help with that by checking it out, and get a pretty wonderful 3D platformer in the bargain.", "date": "February 21, 2023", "grade": "A"}