{"name": "Haven", "ref": "https://gaming-age.com/2021/03/haven-review-for-xbox-series-x-xbox-one-ps5-ps4-switch/", "text": "Even though Haven was in development well before the pandemic started, its hard to imagine a game that feels more of the moment than this one. After all, were talking about a game about a couple trapped together in a fairly isolated location, doing the same chores and eating the same meals day after day. I dont know about you, but if I were to describe what Ive done the past year, that wouldnt be too far off.Obviously, there are differences. I mean, the two lovers here have a planet to themselves (plus the odd creature/monster), not just a house/apartment, and theyre trying to repair their ship rather than doing fairly mundane desk jobs from their living room. But still, the whole vibe of your world being mostly reduced to one other person definitely speaks to me.And  perhaps most relevantly for this pandemic year  Haven is also a testament to how important it is to share your social isolation with someone you not only love, but also like being around.Because that, more than anything else, is what Haven is all about. Its built to show the relationship between a young couple, Yu and Kay, which means the bulk of this game  and certainly its best parts  are simply about them being a couple, whether that means sitting around their kitchen table, snuggling up in bed, or walking around their planet, all the time talking.This actually represents a pretty big risk on the part of the developers. Haven lives or dies based on how believable it makes that core relationship  and, given how shallow most games are when it comes to depicting believable relationships, you can see why that might be a challenge. In this case, though, Haven pulls it off exceedingly well. Between the shared in-jokes, the references to their past (both individually and as a couple), and the way their emotions are so intertwined, this game is better than most not just at making you care about the characters, but at making the characters seem like they care about each other.In fact, because Yu and Kay are so compelling even the mundane daily tasks they do together are a lot more engaging than they have any right to be. Zipping around the planet and cleaning up messes, gathering food, and capturing flow threads wouldnt be fascinating by themselves, but add in Yu and Kay talking while they do so, and its better than it has any right to be.Just about the only place where Haven falls down is when its at its most game-y. Much of their planet is covered in a purple-red substance called rust, which turns otherwise peaceful creatures into hostile monsters. When Yu and Kay find those monsters, they fight them in battles that consist of holding down directional buttons on the D-pad, and then firing until they can pacify and cure the animals. Its not very interesting to do it the first time, and then the game makes you do it a whole bunch of other times. It never gets any better or more enjoyable, either.Which is a shame, because its the one drawback to an otherwise fun, unique game. But even with that one strike against it, Haven does everything else so well that its easy enough to overlook it. Haven is the rare game that excels at making its characters seem believable and human, especially when it gives them nothing more to do than just being themselves. The end result may feel a little familiar for anyone whos lived through the past year, but that doesnt make the game any less worthwhile.", "date": "March 12, 2021", "grade": "A-"}