{"name": "Kaptain Brawe: A Brawe New World", "ref": "https://gaming-age.com/2021/03/kaptain-brawe-a-brawe-new-world/", "text": "Before I played Kaptain Brawe: A Brawe New World, I never realized just how much I associated voice acting  or, at least, a specific type of voice acting  with adventure games. Whether its Monkey Island, or Day of the Tentacle, or even more recent games like Gibbous or Tangle Tower, as far as Im concerned the one common thread is that they all feature what I think of as 90s cartoon voice  which is to say, knowing, a little (or a lot) sarcastic, prone to breaking the fourth wall.Kaptain Brawe doesnt feature any voice acting  like, not even a few canned lines here and there. It still has the adventure game sense of humour (at least as that was defined by LucasArts back in the 90s) but all its jokes are text-based  as is everything else, for that matter. And I have to say: while I cant say that I love 90s cartoon voice, those jokes work a lot better with voice acting than without. Simply reading them off a screen makes the games humour lose a lot of its oomph.And if you were looking for a sense of whats wrong with Kaptain Brawe in a nutshell, the last two paragraphs capture it pretty well. It has most of the elements youd expect in a point-and-click adventure, but they all feel kind of bargain basement.The visuals, for example, are merely alright. The game lacks any kind of distinctive style to call its own; it looks serviceable, rather than memorable. The one exception to this is in its choice of fonts, which are best described as retro space age, and not in a good way. None of the text stands out well against the background  which is unfortunate, since, as weve established, text is all youre getting here.Likewise, the gameplay is exactly what youd expect. The puzzles arent insane and dont require any crazy leaps of logic, which is nice, except the game isnt very long, either, so that means youll be able to race through it quickly  the only variable being whether you opt for hardcore or casual mode, the latter providing plenty of hints to help you on your way.Would my feelings towards Kaptain Brawe be any different if it featured voice acting? Its quite possible  after all, its hard not to imagine that it wouldve given the characters and the game more of a personality, which would make it a lot easier to get into. As it stands, however, it doesnt, which means were left with whats on offer here  and that, unfortunately, isnt enough to make the game stand out.", "date": "March 4, 2021", "grade": "B-"}