{"name": "The Nioh Collection", "ref": "https://gaming-age.com/2021/03/the-nioh-collection-review-for-ps5/", "text": "There have been a few new words coined in the world of videogames that describe a game using other game titles such as Metroidvania and Soulslike. Metroidvania, for example, came from Castlevania: Symphony of the Night (one of the best 2d side scrolling adventure games ever), which combined the trademarked side-scrolling Castlevania action with the exploration of a Metroid game. Soulslike on the other hand describes a game that is trying to emulate a title from the Souls series (Demons Soul or the Dark Souls trilogy), which are known as being tough, very grindy and offering a lot of trial and error exploration in a 3rd person perspective. That description definitely fits Nioh, which offers the difficulty and exploration of a souls game with the lightning fast and smooth combat that Team Ninja is known for.The original Nioh came out on PS4 in 2017 with Nioh 2 following-up in March 2020. Here it is March of 2021 and Sony Interactive Entertainment and Team Ninja have released a remastered Nioh Collection that includes both games for PS5. It has been not even a year out and the publisher and studio are asking gamers to shell out money for a game that they may have purchased and isnt even a year old on a new platform. While some of the improvements on the game might make it seem worth it to purchase the upgrade, you might want to hold off if you already own Nioh 2.In the first game, players play an Irish samurai named William. Why is William in Japan? Great question. It is 1600ad and Elizabeth I is at war with Spain. England has found the upper hand using a magical golden stone called Amrita. This is found in abundance in Japan. At the start of the game, William describes that he was a supplier of Amrita to the queen but his usefulness has run out. The queen has decided that, in order to keep their weapon a secret, anyone who supplied the crown with Amrita must be executed. So, off to the Tower of London with William.Aided by a spirit, William manages to break out, during the breakout, learns of plans to steel Amrita from Japan. Just before he manages to gain his freedom, the spirit helping him escape is captured and taken to the island nation.Nioh is played in a set of missions which are self-contained stages that are large and sprawling. Each has their own secrets to uncover, items to find and enemies to kill. This time period in Japan, the clans were at war and the violence and bloodshed have brought Yokai, demonic spirits, to the island. William must navigate through the warring clans if he hopes to rescue Saoirse, the spirit that guided him through the Tower of London.William has access to a wide variety of weapons during his time in Japan. Dual swords, katanas, spears, etc. Each weapon has their own strengths and weaknesses. Spears, for example, have a longer reach than dual swords, but have a much slower recovery time. There are different stances as well, taking a high stance in battle increased damage but also increases recovery time from an attack. A low stance are quick, lower damage attacks on enemies.Nioh 2 is a prequel of sorts, taking place in 1500 Japan. In this game, players create their own character. Just like the first game, Nioh 2 has a variety of weapons that can be used. Of course, there are improvements to the battle system, as players use the various types of weapons, they earn skill points in that weapon which unlocks new abilities. Also in Nioh 2, as players run into some of the more powerful Yokai, they can drop a Soul Core, which can be attuned at a save point. Once a core is attuned, players can use a special ability of the Yokai that was defeated.Both games have fast, smooth combat. Niohs version of a stamina is called Ki, is depleted whenever an attack or dodge action is committed. After Ki is expended in an attack, there will be a brief circle of light that swirls around your character and then flashes. This is known as a Ki pulse. If you hit a button at the right time, Ki is restored faster and the closer you are to perfect the more Ki is restored. Managing Ki is a large part of combat, and if you run out of Ki, especially when blocking, you are left incredibly vulnerable.Nioh 2 adds skill points for each weapon type and as weapons are used, skill points are earned. Each skill point adds a new ability that can be used while this weapon type is equipped. Furthermore, as new skills are learned, they can be equipped to determine the fighting style that suits players best.Leveling up in both games are similar whereas players spend Amrita, its version of souls, to increase stats. Every time a stat is increased, the character levels up and each stat increase is progressively more expensive. This doesnt matter which stat that is increased, the cost to increase strength five times compared to increasing five other stats once is the same. If players die in either game, all Amrita is dropped where they fell. To recover everything, players must find their former grave and collect all the Amrita, and in the case of the second game Soul Cores, by touching their gravesite. If they die again along the way, it is all lost.Load times in the remastered The Nioh Collection are very fast as compared to the originals to the point of the game loading faster than I can read everything thats on the screen while loading. On the original PS4 version this wasnt a problem as load times where pretty long. Graphically, the Nioh 2 remaster was better than the job done with the original. The environments are very well done, the opening areas of both games take place in a combination of run down little towns and the occasional run through a wooded area. They are done well, with the exception of the first game, there was some noticeable pop up, not from objects at great distance, but even objects that where only a few feet from William. For a game that was made four years ago on the PS4 and remastered for the PS5, this seems like a major miss.Overall Nioh and its sequel are a worthy additions to the Soulslike genre, both games are fun and incredibly challenging and the Yokai look every bit the part of a Japanese demon. The biggest issue with this collection is the popup on the original Nioh, though aside from this it is a good collection. Also if you already own Nioh on the PS4, make sure you are playing the PS5 version by clicking on the options button and selecting the PS5 version (the first time I launched Nioh on PS5, I was playing the PS4 version). Also, of note, if you have the PS4 version of Nioh 2, you can upgrade that to the PS5 version for free, but the original game you will have to purchase in order to get the remastered edition.", "date": "March 3, 2021", "grade": "B+"}