{"name": "Capcom Arcade Stadium", "ref": "https://gaming-age.com/2021/02/capcom-arcade-stadium-review-for-nintendo-switch/", "text": "Capcom has always been one of my favorite game companies. As of late, they have been focusing on the Resident Evil series as well as Monster Hunter, leaving many of their classic franchises on the back burner. But in a surprising move, Capcom decided to revisit many of their classic games and put them into a pretty packed compilation for fans and new players to enjoy, is it the perfect collection of classic goodness? Well, yes and no, read on.The actual Arcade Stadium download is free on the Nintendo eShop, and you get 1943  The Battle for Midway for free. In order to get the complete experience, you need to download 3 10 Packs of games. The Packs include classics like Commando, Ghouls N Ghosts, Section Z as well as Street Fighter II and Final Fight. You can check out each pack on the eShop to see the full list of games offered. The good thing about this is if you dont like certain games offered in a certain pack, you dont have to download that pack, but on the flip side, you may get stuck with some games you dont want because a certain pack has a few that you do want to play. I think it would of been much better to let us choose what games we wanted rather than have them in packs, but fans will most likely enjoy most, if not all of the games available.Once your packs are installed, you can enter the Arcade and customize your experience for each title you own. For starters, you can change how you view the game, either on a simulated arcade cabinet, or zoomed on your screen with a variety of filters. You can even have a slight curve to the screen as if you were playing on a CRT monitor. There are also borders with various artwork, and the ability to make the game 16:9. The effects are nice, and not too distracting from the game play, just something extra to play with. Once you set your controls to your liking, you can jump in and out of any game at your leisure with save states, or if you are out of practice, you can utilize the rewind feature and avoid those cheap deaths. No online co-op sadly, as the online features are limited to leaderboards, but this is something they could easily add in the future. As you play through the games, you earn a currency called Caspo to increase your leaderboard rank or Class. The more Caspo you accumulate, the higher the class you enter, and more rewards are unlocked. I havent seen any rewards that effect the actual games, just more boarders and avatars for your gamer card. Since it really doesnt unlock anything of importance, most players will overlook it.Controls are not too bad, but it is much better to play these with a Pro Controller over the Joy Cons. Playing with the Pro, you feel like you have way more control over the action, while the Joy Cons seem to be less responsive especially on fast button presses and combos. You can get by with just Joy Cons, but you might want to invest in something that will give you a better grip. Visuals are just as classic as ever, they all look great but suffer a little in the sound department. It seems some sound effects on games like Forgotten Worlds and Vulgus dont sound right at all. Also, Mercs and Trojan, two classics that definitely appeared on US shores, only appear as their Japanese Versions which is very strange, as all of the games (except these two) feature both regions versions.While Capcom Arcade Stadium is a good collection, having everything broken into packs, the weird sound issues on some games and the omission of some US versions take a few points away from it being perfect. The Class System and the online leaderboards are OK, but I think online co-op would of been a better choice in that area. Also, I feel the currency earning system (CASPO) could have been used for more like unlocking art galleries and music tracks. Still even with those little speed bumps, Capcom Arcade Stadium is a fine collection of classic games that many people will enjoy. I can recommend this to any classic arcade fan looking for an old school challenge or someone who wants to get acquainted with Capcoms colorful past.", "date": "February 26, 2021", "grade": "B+"}