{"name": "Freddy Spaghetti", "ref": "https://gaming-age.com/2021/02/freddy-spaghetti-review-for-ps5-ps4-xbox-series-x-xbox-one-switch/", "text": "Freddy Spaghetti falls into the same (and admittedly very broad) category that also encompasses games like I Am Bread, Octodad, and Surgeon Simulator. I dont know if theres an official name for the genre  does knowingly stupid count?  but, for lack of a better term, lets call them QWOP-a-likes.In other words, its one of those games where the controls are intentionally difficult/poorly-implemented, and it covers up any shortcomings it may have with humour (or humour, depending on how you look at it).Obviously, your mileage will undoubtedly vary on these games. Some people give them all kinds of love, whether ironically or not, while others cant stand the very idea of them. Personally, I fall somewhere in the middle  I think theyre fun for a couple of minutes, but they also lose my attention very quickly. This is certainly the case with Freddy Spaghetti, where you play as a sentient piece of spaghetti. Named Freddy, obviously.At first, its kind of fun, as you navigate the eponymous pasta around the house and into the outside world. Freddy is a bit of a jerk, too, destroying flower beds, setting off car alarms, and running from the police/hangry mobs. And the controls here arent as frustrating as they are in some of its forerunners. You control both ends independently, so it takes a minute or two to figure out how to make Freddy move, and then you always have to fiddle around at the end of each level to get Freddy into the goal, but its never impossible to figure out.But the levels start feeling repetitive pretty early on. There are only so many ways you can make a piece of spaghetti move from point A to point B. Plus, even its not exactly the same as I Am Bread or Octodad, Freddy Spaghetti is still very similar to those games  and since theyve both been around for the better part of a decade, it makes this one feel awfully derivative.Its kind of weird to use that word, derivative, to describe a game where your character is a piece of uncooked pasta. But thats just the world we live in. If Freddy Spaghetti had come out ten years ago, it might feel fresh and new, but now it just feels a little stale.", "date": "February 17, 2021", "grade": "C-"}