{"name": "Steins;Gate Elite", "ref": "https://gaming-age.com/2019/02/steinsgate-elite-review-for-ps4-switch-pc/", "text": "Steins;Gate Elite can only be called a game in a very minimal sense. Actually there is barely any actual gameplay here at all. You basically are here to experience a story of mystery, strange technology and magical powers that will keep you hooked for the duration, and keep you coming back to see every possible outcome.SGE follows a rag-tag band of tech-savvy young students who discover the means of changing the past via email using a modified microwave oven. Their experiments in pushing the boundaries of time begin to go horribly wrong as they become entangled in a conspiracy surrounding SERN, the organization behind the Large Hadron Collider, and a fellow named John Titor, who claims to be from a dystopian future. Almost every scene is crafted extremely well and will keep you hooked throughout this strange and somehow compelling story.As stated above, there is no real gameplay to speak of. You dont control one character who interacts with others and you are not on your own to uncover any mystery. What we have here is visual novel that is based on the Anime series of the same name. The series got a brief release here in the states but this was my first time experiencing this strange story. From time to time, you are faced with different choices that can affect the outcome of events. The choices you make, regardless of how insignificant they may seem, will determine how the story will unfold. At times, you will be alerted with Tips about some of the things the characters are talking about.These tips will explain some of the more confusing things that pop up throughout the story in greater detail. Any scenario you experience is told through fantastic, fully animated scenes that are written just as well as they are animated. No matter the path you choose (when you are given a choice), you will witness a captivating story. I really dont want to spoil the story here by going into great detail but all I can say is that multiple playthroughs are encouragedSince there is really no gameplay to speak of, your only control will be the X Button. 95% of SG:E is reading text and simply watching events unfold. Literally anyone that wants to experience a great Anime with stellar writing will be able to dive right into this without hesitation. You may have some issues with handing the cell phone menu, which is a bit strange to navigate. But, you will get the hang of it the more it comes up to use.Visually, the presentation is stunning. Everything is fluid with superb musical score to accompany almost every scene. Voice acting is top notch and really fits every character you will meet. Voices are Japanese, which is a good thing because I couldnt imagine this being dubbed. This feels more like a theatrical type of Anime with a huge budget behind it. The attention to detail really shows. Even the static scenes with not much going on are incredibly detailed.I can recommend Steins;Gate Elite to anyone who wants to experience a fantastic visual novel with multiple endings. I cannot, however recommend this if you are hoping for full interaction or solid gameplay because there really isnt anything like that here. Outside of a few button presses here and there, there is no game to be played. I am not usually a fan of visual novels, but I didnt feel bored with this one. Check this one out if you love science fiction stories that captivate.", "date": "February 14, 2019", "grade": "A"}