{"name": "Hitman 3", "ref": "https://gaming-age.com/2021/01/hitman-3-review-for-ps5-xbox-series-x-ps4-xbox-one-switch/", "text": "I went into Hitman 3 with pretty absurdly high expectations. The first one in the current trilogy was one of my favourite games of all time, and then the second one may just have topped it. Even though its only January, I fully expected this one to wrap up the #1 spot on my year-end GOTY list, 11 months early.Im sad to report that I came away feeling a little disappointed.Thats not saying it wont be at or near the top of my list come December  its far too early for that, and 2021 isnt looking super-promising at the moment. And thats not too say its a bad game, not by any stretch of the imagination. Its just that Hitman 3 is missing the things that made me love the past two Hitman games so much.Or, to be more precise, its completely lacking the sense of humour that set the other games apart. I know that sounds like a weird critique to have for a game thats literally built around a guy who kills people for a living, but Hitman and Hitman 2 were, in their own way, hilarious. Sure, its pretty dark humour when were talking about beating someone to death with a blueberry muffin, or even watching as Agent 47 pretends to be a real estate agent and cant figure out ways to talk about a house that dont involve killing someone, but nonetheless, they made me laugh out loud.In Hitman 3, by contrast, theres none of that, no subtle wink here and there that lets you know the developers are aware of some of their games inherent absurdity. Im not asking for Saints Row-style, over-the-top constant jokes, but it felt like every single mission here required Agent 47 to be  and look  deadly serious. No impersonating ravers or wearing silly mascot costumes, this time out its all security guards, private detectives, and, in one mission, a completely different hitman. The latter, I guess, is sort of funny if you think about it, but at the same time, you can see how different a tone Hitman 3 takes just by looking at its training mission and comparing it to the missions here. In the training mission, which is borrowed from the previous game, you have to kill a double-agent, and the game essentially walks you through killing him via faulty ejector seat. While morbid, its also pretty funny, especially when no one seems to notice. None of the many, many kills here reach that level of inventiveness.But, again, I dont want to say that there arent all kinds of ways to kill your targets in Hitman 3. The game still gives you plenty of options for offing the bad guys, whether youre electrocuting them with a puddle of water, pushing them off the top of a fictional Dubaian skyscraper, or giving one of them an exploding golf ball  among the many, many options in every level  but because everything here is presented so seriously, its hard to revel in the more absurd ways people in this game die.The other issue with Hitman 3 is that it occasionally feels a little broken. I know that weird ragdoll physics are ingrained in the games DNA, but Im talking about actual, game-breaking bugs. In the games first mission, Agent 47 was tasked with killing (or at least injuring) someone, taking a picture, and then giving the picture as evidence that he should be escorted to a private meeting with his actual target. I took out the target, I took a picture, I brought it to the bad guys assistantand then she stood there, staring at me, while the game said to follow her. Eventually, the option just vanished, and it said Id missed my window of opportunity. Other times, the game would freeze up as it tried contacting the server, and Id be forced to close the game entirely and restart. It didnt happen so often that it prevented me from enjoying the game, but it was still there enough to notice it.Despite all that, though, Id be lying if I pretended I didnt enjoy Hitman 3, on the whole. Im not someone who usually enjoys stealth or waiting around in games, and yet, Id finish a level and suddenly realize an hour  or more  had passed, entirely because I was sneaking around, skulking in the shadows and waiting for people to move. And then, after the level, Id want to go back and see how I do it again from a different angle. One of the great things about Hitman and Hitman 2 was how both games game you small, enclosed worlds with a seemingly infinite number of ways to go about your task, and that level of freedom is in full effect here. You could sink hours and hours and hours into every level, and I imagine youd still be discovering new things in every playthrough.And thats what makes Hitman 3 worth playing, no matter what flaws it may have. Sure, its overly serious, and sure, my experience had a few blips along the way, but ultimately, it allowed Agent 47 to do his thing  and finish up this part of his story  in a way that felt true to this reborn version of the series. It may not be my favourite entry in the series, but its a good way to finish things off, and for that reason, its well worth your time.", "date": "January 27, 2021", "grade": "A-"}