{"name": "Super Meat Boy Forever", "ref": "https://gaming-age.com/2021/01/super-meat-boy-forever-review-for-nintendo-switch-pc/", "text": "Going into Super Meat Boy Forever, the first big follow-up to Team Meats well-regarded hit Super Meat Boy, I was certainly aware that the gameplay had transitioned into what is commonly known as an auto-runner. If youre not familiar with the term, you might be more familiar with notable games in the genre, like BIT.TRIP RUNNER or even Nintendos attempt with Super Mario Run on iOS and Android platforms. And knowing that this was Team Meats approach with Super Meat Boy Forever, I was kind of wary of how that change would factor into one of the more precise, demanding, yet fun platformers of our time. Thankfully, having spent some time with Super Meat Boy Forever over the holidays, I think it handles the change really well.While not having direct control over Meat Boy, Bandage Girl (or a host of other unlockable characters) can feel a bit off at first, youll quickly realize that the lack of direct input on the direction youre running doesnt make for an easier or less precise experience. Instead, youll quickly realize that youre meant to focus on timing jumps, slides, and air punches in an effort to overcome an increasingly difficult slew of obstacles. In fact, the more I played, the more I came to realize that Super Meat Boy Forever was virtually a puzzle game in a platformer format.Stages in Super Meat Boy Forever are compromised of chunks, basically level sections that can be interchangeable within worlds, allowing some randomization and uniqueness even after youve completed the story. Its a form of randomization in levels but not necessarily approached in the same way that other games, roguelikes in particular, have done so in the past. Youll start to recognize how stages are broken up by the death checkpoints, which youll likely encounter a few of. This approach offers up some additional replay value when attempting to clear prior stages, while also keeping the overall challenge fresh.Likewise, the controls feel very precise, and jump physics feel in line with what the original Super Meat Boy offered. Meat Boy will slide up walls as you jump towards them, allowing you to momentarily slow your descent while attached, so you can time your jumps around obstacles and other dangers. He can also duck and slide under things, and can perform mid-air and slide punches to take out enemies. Mid-air punches are usually used to string together more difficult leaps and navigate large gaps or other dangers. It all works together extremely well and feels remarkably satisfying when you pull off a difficult sequence.Id also like to point out that I found most of the boss encounters in Super Meat Boy Forever to be really well done. Bosses were not always the strongest point in the original Super Meat Boy, and its definitely one area that I think Forever handles better. Each boss encounter feels unique and memorable, and makes use of the platforming mechanics in unique and challenging ways. The boss fights ended up being one of my favorite things about Super Meat Boy Forever, which was not something I expected going in.All in all, I think Super Meat Boy Forever is a really great follow-up to the original game by Team Meat, but also understand that the auto-run mechanic may take some getting used to. If youre willing to spend more than an hour with it, running through a handful of early stages and tackling the first boss encounter, I think youll start to feel the rhythm of the game, and come to appreciate the puzzle approach to the way the level chunks are designed. Its a really satisfying experience and one that shouldnt be missed in the post-holiday game release slump.", "date": "January 13, 2021", "grade": "A"}