{"name": "GONNER2", "ref": "https://gaming-age.com/2021/01/gonner2-review-for-xbox-one-switch/", "text": "As if its name wasnt a big enough hint (GONNER, goner  get it?), GONNER2 lays out what you should expect very early on: you dont just press A to start the game, you press jump to die. Because if theres one thing youre going to do a lot of in GONNER2, its die. And die, and die, and die.This is by design. Its a tough-as-nails roguelike platformer, which means that not only is every level constantly trying to kill you, its basically changing every time you play it. Moreover, the game is designed so that the path to the exit doesnt become visible until you get close to a wall, so while youre shooting at the enemies coming at you from all sides, youre essentially also trying to solve a maze.Like I said: its tough-as-nails. And thats without even getting into the way losing items leads to one-hit deaths.Its also without getting into the fact there are no tutorials or explanations here. You have to figure it all out on your own. On the one hand, I get that the game wanted to be as tough as possible. On the other hand, GONNER2 is already plenty hard, so I feel like even a brief introductory level where you learn the basics wouldnt have taken anything away from the game.Bizarrely, despite the toughness, what really sticks out in my mind when I think of GONNER2 isnt the action, but rather how it looks. Im pretty sure that insane psychedelic fever dream isnt a genre or a style, but I cant think of any other way to describe the visuals here. There are flying eyeballs and you enter new levels by being swallowed by worms and the colours are all over the rainbow andits just craziness. Its gorgeous, in its own way, but its still nuts to look at.For most people, though, I think the insane difficulty will be what they take away from GONNER2, not the insane visuals. Which means that if youre looking for a platformer or a roguelike that will truly test your abilities, its most certainly worth your time.", "date": "January 11, 2021", "grade": "B"}