{"name": "Bugsnax", "ref": "https://gaming-age.com/2020/12/bugsnax-review-for-ps5-ps4/", "text": "Bugsnax has so many great things going in its favour. Its cute, its funny, its got great voice acting, it looks great, and its got a very good story at its heart. And yet, despite all that, I dont love it as much as I want to.Part of this, Ill admit, is for kind of silly personal reasons. Its a game about capturing bugs that also happen to taste delicious, and then feeding them to the fuzzy inhabitants of Snaktooth Island as snacks. As someone who doesnt believe in eating living creatures, or in hunting in general, Ill admit to having some qualms about Bugsnaxs core gameplay loop. Like I said, its a silly, personal complaint.The bigger issue, though, that more people may identify with, is that the games bug hunting isnt all that fun. Most of the bugs simply move around in the same set pattern, so its a matter of scanning where they walk, setting a trap, and then capturing them. Now imagine doing that hundreds of times over the course of 5-6 hours, and you can see why it may get old pretty quickly.That said, as long as you have some patience for repetitive tasks, the rest of Bugsnax is pretty great. As I said, its pretty cute, with the fuzzy inhabitants of Snaktooth Island being some of the most adorable creatures Ive ever seen in a game. And the world around them is equally wonderful, in everything from the wide variety of bugs to the colourful regions that make up the island.On top of that, the characters are incredibly well-realized. The voice acting is top-notch, and the game manages to give every single character you come across a surprising amount of depth. The game has also got a fantastic sense of humour, and its funnier than most other games Ive played.And the story  thats where Bugsnax really shines. I dont want to give away too much, but Ill say that it hooks you in from the get-go with a pretty stellar mystery, and then it turns everything on its head with a final act twist that makes everything even more interesting. It shouldnt be a surprise that a game that has such great writing in its characterization and jokes also has great plotting, but it still puts Bugsnax way ahead of most its competition.Its just a shame that the core gameplay here is so dull. Everything else in Bugsnax would make it a strong GOTY contender, but the sheer repetitiveness of the games main task drags it all down. Still, given how high the rest of the game flies, theres only so far down it can go  and as it stands, that still means youre left with one heck of a game.", "date": "December 31, 2020", "grade": "B+"}