{"name": "Ghostrunner", "ref": "https://gaming-age.com/2020/12/ghostrunner-review-for-nintendo-switch-ps4-xbox-one/", "text": "In retrospect, I should have known that I wasnt in for a good time with Ghostrunner on the Switch when the game struggled to get through its opening credits sequence without stuttering. Im not usually one to care about frame rates and whatnot, but when action thats supposed to be smooth and high-speed is moving at a crawl across the screen, thats never a good omen.Needless to say, those technical issues are a constant through the game. No matter what youre doing, Ghostrunner seldom feels like its working quite the way it should. The graphics can rarely keep up with the action, and it was pretty common for in-game action to slow to the same kind of crawl I experienced during that opening cinematic. Likewise, while the game occasionally looked dazzling (more on that in a few moments), more often than not the game struggled to show everything on the screen the way it was meant to be displayed, resulting in grainy visuals that were at odds with the sleek, futuristic aesthetic.These issues extended to the gameplay as well. Ghostrunner was clearly designed to be a fast-paced action game, a neat take on what Mirrors Edge did so well a few years ago with swords added to the mix, along with an insane level of difficulty. On the Switch, however, it doesnt quite work. Because of the stuttering, youll regularly find that you cant react quickly enough to pull off what the game wants you to do. On top of that, because the graphics are so hit-and-miss  and because its bizarrely common to make some things on the screen so miniscule youll barely be able to make them out  it regularly felt like I died without having any idea why.To be fair, some of this is how the game was designed. Youre meant to be constantly moving through the world in a flurry of swords and crazy parkour jumps, and youre expected to keep doing levels over and over until you can get every move just right. Its not the sort of gameplay that appeals to me, but I get why it would appeal to others. On the Switch, however, Ghostrunner doesnt just cross the line from intentionally super-hard to super-hard because the performance sucks, it launches itself so far over that line that you can barely see it on the horizon.This is a shame, because every so often Ghostrunner performs exactly as it should, and you can see how much fun the game can be (and, realistically, probably is on more powerful platforms). It can be super fun to run along walls and across, dodging bullets and slicing through your enemies. The story  your typical dystopian futuristic cyberpunk mumbo jumbo about authorities and freedom and all that  may not be anything memorable, but that hardly matters when youre soaring through the air, your blades gleaming as they reflect the metallic world around you.", "date": "December 18, 2020", "grade": "C"}