{"name": "Katamari Damacy REROLL", "ref": "https://gaming-age.com/2020/12/katamari-damacy-reroll-review-for-ps4-xbox-one-switch/", "text": "Ill forever have a soft spot for the Katamari series. After years of only playing sports games on consoles, it was chancing upon Katamari Forever on PS3 in my local librarys collection that made me realize just how weird and wonderful video games could be. Since then, Ive periodically gone back to the series, including a replay of the Vitas Touch My Katamari earlier this year.As such, it should come as no surprise that Im a big fan of Katamari Damacy REROLL. Its a chance to see where the franchise got started, and to revel in the pure strangeness that is the King of all Cosmos making his son roll the universe back together after said King accidentally destroyed everything during a drunken bender.And if youre somehow a newcomer to the serieswell, that last sentence will tell you everything you need to know about Katamari. Its one of those games where youre either fully on board with nonsense, or youre not.It goes without saying that I totally am. Katamari Damacy REROLL may not have quite the same number of features as the other games that have come in the series since the original Katamari Damacy was released back in 2004, but that also means its Katamari in its purest form. You start with a small ball, you roll up bigger and bigger items, and before long youre rolling up animals, people, cars, and houses. Its absurd, but its the best kind of absurd.It can, Ill admit, also be a little bit frustrating. It wouldnt be a Katamari game if you could just roll that ball around without also fighting with the camera and the controls, and you can see the origins of that here. Trying to roll in a straight line is next to impossible, and youll inevitably get stuck in between objects and on corners. Its just what this game does.But as far as Im concerned, the good of Katamari Damacy REROLL far outweighs the bad. No small frustrations can compete with the sheer joy that is seeing arms and legs and cars and wings and dogs flailing around, as the crazy music in the background. Katamari Damacy REROLL doesnt add much (or anything) to the formula it created 16 years ago, but when it started out this well, it really doesnt need to.", "date": "December 17, 2020", "grade": "A-"}