{"name": "Best Friend Forever", "ref": "https://gaming-age.com/2020/12/best-friend-forever-review-for-nintendo-switch-pc/", "text": "When I started playing Best Friend Forever, part of me wanted to hate it. Its soeverything. Its a dating sim set in Rainbow Bay, a little town thats inhabited almost exclusively by quirky, stylish twentysomethings spend all their waking hours with their pets. If youre not in the right mood  which I wasnt when I started playing  its twee-ness will be cloying and stupid to the point of being unbearable.And yet, somehow, by the end of my time with it, I found that I was feeling sort of fond of it. I wouldnt say I loved it or anything, but I was no longer hoping the games twist would be that a nuclear bomb dropped on Rainbow Bay and obliterated everyone in the town. Progress!Seriously, though, Best Friend Forever has a way of sucking you in through its combination of story and pet training simulation. The former is fairly generic  your character has moved to Rainbow Bay in search of a new start, and when they arrive they find a group of other dog lovers that they can try to woo  but its open enough that you can make the plot your own. You get to create your character, you get to choose their appearance and orientation, and you get to decide who you want to go after and how hard you want to go after them. Its all done at a relaxed pace, and as long as you can stomach some navel-gazing philosophizing, it drifts by pretty unobtrusively.The other half of the game is where Best Friend Forever differentiates itself from every other dating sim out there. In addition to looking for a life partner, youre also taking in a rescue pup and helping it learn to love and trust a human again. Admittedly, you do this in the most surface way possible, wherein every week you set a couple of tasks to do with your dog to raise the pups levels of happiness, smarts, fitness, etc., before you move on to interacting with the other dog owners/available humans of Rainbow Bay. However, even if its not that deep, its still hard not to get at least a little attached to your little fur baby.In fact, I think thats what ultimately won me over to Best Friend Forever. Even though Im a cat person, spending a couple of hours with your dog in Rainbow Bay is enough to get you invested in its success  and by extension, in the game. The other people were tolerable (okay, a couple tolerable, most were still pretty annoying by the end), but I was really rooting to see my rescue pup become more comfortable around people. That may not mean that Best Friend Forever is a success as a dating game, but if youre after a pet-raising sim, its a nice way to pass a few hours.", "date": "December 15, 2020", "grade": "B"}