{"name": "Tropico 6", "ref": "https://gaming-age.com/2019/10/tropico-6-review-for-xbox-one-ps4-pc/", "text": "Ive always enjoyed city-building games more in theory than in practice. Like, I love the idea of a game like Sim City or Cities: Skylines, where you get to build a city from the ground up, but when it comes time to play it, I quickly discover that Im terrible at paying attention to details, and my cities invariably end up on fire, without basic utilities, and generally terrible places to live.So you might expect that I have the same issue with Tropico 6. I mean, I expected Id have the same issue with the game. I figured Id be wooed by the promise of ruling my own island dictatorship, and then discover that, when it came time to actually play the game, Id quickly lose interest and give up.Then I found myself playing Tropico 6 until the wee hours of the morning, completely losing track of time, and even dreaming about it. If thats not the sign of being deeply immersed in a game  and, also, addiction  I dont know what is.It helps, I think, that even though Tropico 6 borrows quite a bit from the likes of Sim City, its not just restricted to city building. Even in sandbox mode, the game lets you to work towards a goal, by allowing you to set some kind of winning condition. As someone who struggles with open-ended gameplay, that meant a lot.And, of course, it helps that the meat of the game is built around missions, whether its simply giving you a quick intro into how you came to be ruling your island paradise after throwing off your colonial oppressors, or any of a number of scenarios that range from prohibition to nuclear testing. Better still, the game doesnt force you to play any one way  you get a starting point and it tells you where to end up, but everything in between is up to you.It also helps that this game is shockingly easy to play with a controller. Despite the fact that there are tonnes of menus here and all kinds of decisions to be made about where to place buildings, I never found myself wishing for a mouse and keyboard or a touchscreen. I could mostly do what I wanted to do, which made enjoying Tropico 6 a breeze.Ill note, however, that mostly is in that last sentence for a reason. As much as I loved this game, I did have a couple of minor performance issues where the game would seize up for a couple of seconds, even though I have an Xbox One X. It was never game-breaking, and its not as if a game like this relies on instinct or quick reactions, but its still an issue that bears mentioning.It wasnt enough to take away from my love of this game, however. Tropico 6 is fantastically addictive, and worth checking out regardless of whether youre into the minute details of urban planning, or if youre more a big picture kind of person. Whichever it is, youll find plenty to love here.", "date": "October 9, 2019", "grade": "A"}