{"name": "ATGames Legends Ultimate Arcade Cabinet", "ref": "https://gaming-age.com/2020/11/atgames-legends-ultimate-arcade-cabinet-review/", "text": "If youve ever wanted to own your own arcade machine, you had to shell out big bucks and allocate a lot of room in your house for one. That was until Arcade1Up came on the scene with a line of affordable (and smaller) licensed arcade cabinets. Until now, no one really challenged 1Ups hold on the home arcade scene, until unlikely rival ATGames came along with their Legends Ultimate Cabinet.For the price of one higher end Arcade 1Up machine, that may give you up to 6 different titles, the Legends Ultimate Arcade comes packed with 150 arcade titles, and 150 console titles right out of the box. Its closer in size to a full size arcade cabinet from the days of the old school Arcade, but can still fit in most homes and apartments with very little trouble. After building the system using the easy to follow instructions, you power it up and PRESTO, your very own arcade in your home!Once you get everything set up. You are given the option to play 300 classic games from the arcade, Atari 2600, Sega Genesis and Super Nintendo. Games from each category make up the total of 300, and everything is licensed and optimized to run just how you remember them. The fun doesnt stop there, as this cabinet is online. Yes, you can download and stream new games from ATGames servers and take advantage of an ever changing library. All of the online functions are in beta at the moment, with a pay system in the works so these games can be downloaded and kept on the hardware. But, for now, its all free and works without restrictions.Other major highlights with this cabinet is its awesome control box. You get an 8-way joystick that feels better than most next gen fight sticks on the market. A spinner for games like Tempest and Breakout, and a trackball for some Centipede or Crystal Castles action! If you are unsatisfied with the 300 games this machine comes packed with, and the library of streaming titles, then the Legends Ultimate gives you the ability to add your own ROMS via the USB slot. ATGames provides all of the software needed to get your own games recognized, and, since adding unlicensed games isnt technically allowed, they point you in the direction of some help to get things going. It is a feature they promote, but they hide it behind a small amount of DIY searching on the Internet. Certain ATGames Flashback Consoles like the Flashback Legends Can be connected to the machines HDMI Port and USB, so you can run games on those units through the Legends Ultimate, using the screen and controls.", "date": "November 27, 2020", "grade": "A"}