{"name": "A Short Hike", "ref": "https://gaming-age.com/2020/11/a-short-hike-review-for-nintendo-switch-pc/", "text": "I dont know when I last played a game that made me feel as happy as A Short Hike does. Everything about it is absolutely perfect, from the characters to the gameplay to the little world it inhabits, and I had a massive grin on my face from beginning to end. I havent put serious thought into my year-end ballot for our Game of the Year list, but Im pretty sure this will be right near the top.The basis of A Short Hike is right there in its name: youre playing as Claire, a young bird whos gone camping with her aunt, who decides to take the eponymous short hike to the top of a mountain. But within that very simple premise, theres a lot more to do than simply going from Point A to Point B.The game takes place in a provincial park (that would be the Canadian equivalent of a state park) on an island, and the park is full of people for Claire to talk with and secrets for her to uncover. I didnt exhaustively explore every nook and cranny of the island, but during my short time with the game, I helped a rabbit find his lucky headband and race a turtle, I found a couple of secret passageways, I helped a frog build a sand castle empire, I had a parkour race with another bird, and I found tonnes of buried treasure.Obviously, none of that sounds that exciting on paper, but in practice, every single one of those actions  and plenty more beside them  were incredibly charming. The dialogue is wonderful, with plenty of humour and heart, and lots of care went into making every single one of these characters memorable.Literally the only complaint I could imagine anyone having about A Short Hike is that its a little short, and that you can reach the top of the mountain in about an hour, or ninety minutes if you really stretch things out. But honestly, the brevity works. Its a short hike, and it would feel like the game was trying too hard if it tried to artificially lengthen whats an otherwise perfect experience.Because yes, Id say that A Short Hike really is a perfect experience. Its easily one of the best games Ive played this year, and I loved every single moment.", "date": "November 27, 2020", "grade": "A+"}