{"name": "Blind Men", "ref": "https://gaming-age.com/2020/11/blind-men-review-for-ps4-ps-vita-xbox-one-switch/", "text": "Blind Men kind of reminds me of Jisei: The First Case HD. Not because of the content  more on that in a moment, but Ill say the two games couldnt be any more different in that respect  but because of the format. Both arent just visual novels from Ratalaika Games (which in turn means theyre both easy Platinum trophies), both are short visual novels in which you can see every ending on offer, without even skipping, in less than two hours. Theyre more visual novellas, to be honest, and as someone without the patience for the endlessly repetitive dialogue you find in many visual novels, that brevity really appeals to me.Besides that, within these two hours, Blind Men offers a bunch of fun, quirky stories that you dont usually find within games like these. The game centres around Keegan, a young man trying to follow in his uncles footsteps and become a supervillain feared by all. His plan to become a supervillain gets sidetracked at his first big scheme, when he finds himself surrounded by a couple of hunks, at which point he becomes torn between his ambition and his attraction.In other words, Blind Men is basically an otome game, only a) with gay characters, and b) its not nearly as hung up on the whole romance angle as most other games in the genre. Admittedly, the downplaying of the whole gay angle may be because Blind Men doesnt want to get pigeonholed as an LGBTQ game, but even if thats the case, the game is far more compelling than most otome games because it gives the characters room to develop, rather than making them all the bland stereotypes that seem to populate most games of the genre.The end result is like a weird take on Cold War spy movies, with a jaunty soundtrack, competing global organizations, and lasers. Obviously, given were talking about a subgenre within a subgenre, Blind Men isnt going to be for everyonebut for those to whom it even sort of sounds appealing, its well worth your time.", "date": "November 26, 2020", "grade": "A-"}