{"name": "Costume Kingdom", "ref": "https://gaming-age.com/2020/11/costume-kingdom-review-for-ps4-pc/", "text": "Costume Kingdom isnt exactly what youd call original. Its basically a Pokmon clone with a Halloween skin, and its all done so lazily that its hard to give the game any credit whatsoever.Now, when I say that this is a Pokmon clone, understand that Im not someone whos played a tonne of Pokmon. Like, in my entire life Ive played maybe  maybe  two hours of any Pokmon games, and the bulk of that was a few months ago when I decided to try out Pokmon Shield. So for me to notice that another game is completely ripping off Pokmon, you know weve got to be talking pretty blatant thievery.And worse, were not even talking about very good thievery. This is a game where a) the monsters youre collecting are called Hallowmon, and b) one of the Hallowmon is an owl-like monster called Owly. That should give you some idea of the level of originality were talking about here. Whats more, there also wasnt a whole lot of work put into creating Hallowmon. You collect a team of six over the course of the games short playthrough, and in total you encounter around ten different types of monsters.Thats not to say that you only encounter ten Hallowmon, total. No, youll spend the bulk of your time here engaging in random turn-based battles with the same ten Hallowmon over and over. Its not clear why there are so many battles, since its not as if you need to train up your Hallowmon  they only go to level 20, and the XP is given so freely that youll be able to max out your whole team long before youre anywhere close to the end.This, in turn, means that the game gets absurdly easy very early on, since your team of Hallowmon is so overpowered compared to everything else you encounter (save for the final boss battle, which Ill get to in a moment). In fact, not only are you overpowered compared to all the other Hallowmon, theres no limit on how much energy your attacks use up, which means you can just use your most powerful attack every single turn. Im all for easy games, but Costume Kingdom takes it to ridiculous extremes.The game also has a few other major failings that need to be mentioned, just so you can have an idea of how thoroughly bad it is.First, the camera is atrocious. It doesnt quite know what to do when you walk behind a wall, so it just stays trained on the wall, and you cant see yourself at all. Thankfully you can usually just continue walking and come out the other side, but every so often Id have to wiggle around my thumbstick just to come back into view.The other bizarre thing about Costume Kingdom is that you can finish the game without actually beating the final boss. Im not going to spoil the ending, but right at the very end you come to a diverging path. Take one side, and you take on the final boss  who, it should be noted, is significantly more difficult than any other enemies youll have faced in the game to that point. After losing to him once, I decided to see what lay on the other side, only to discover that Id accidentally blocked off the other ending. You cant make multiple saves here, and if you go back to the main menu youll find the end game blocked off entirely, which means youre only other option is to start over from scratch  which, given how thoroughly lousy everything here is, wasnt the most enticing option.Really, just about the only thing Costume Kingdom has going for it is that theres no Pokmon on the PS4 (though, Ill note, there is a Digimon game or two). So if youre insane and want to experience Pokmon without going to the trouble of buying a Switch, I guess this is the game for you? That, however, would be an absurd course of action, since Costume Kingdom is very, very bad. Save yourself the trouble, splurge on a Nintendo system, and just get Pokmon instead, because this game certainly isnt worth anything.", "date": "November 16, 2020", "grade": "D"}