{"name": "Paradise Killer", "ref": "https://gaming-age.com/2020/11/paradise-killer-review-for-nintendo-switch-pc/", "text": "Paradise Killer is easily one of the most stylish games Ive ever played. Everything about it oozes cool: the graphics, the music, the characters, even the story.But heres my problem: I hate it.I realize this is kind of irrational of me. As I just said, the game undeniably has style. The thing is, though, because its so incredibly focused on being stylish, enjoying it means liking that style. And to be totally honest, it kind of nauseates me. I find the graphics garish, to the point I feel like my eyeballs are being assaulted. The characters, too, are so over the top in their looks that I find it kind of repulsive  and it doesnt help that what little voice acting there is in this game is obnoxious little snippets. And the musicI dont know, most of the time I have no issue with icy synths, but here, coupled with everything else, I find it more grating than anything else. (And to that last point, I dont mind the Paradise Killer soundtrack when I hear it independent of the game, so I think its entirely the games visual aesthetics that rub me the wrong way, and the music is just collateral damage.)The weird thing is, its not like there arent plenty of other games that have a similar look. Between the stylized characters and the gaudy colours, its not hard to see hints of Suda51 and the Danganronpa series, the latter of which Im a huge fan. And yet, packaged like this, it literally made me feel kind of ill.To some extent, this may be the point of Paradise Killer. The game is set in some alternate dimension on the verge of collapse, where demons have corrupted everything to the point that the dimensions inhabitants are dying off and being reborn in their next, more perfect dimension. Theres a sense of rot and decay just beneath the surface, and the main character  Lady Love Dies  is there to solve a murder mystery and allow the end of the world to come about. So in that sense, the whole last days/hangover feeling may be entirely intentional.Beneath all the ugly/stylish trappings, you have an open-world mystery game, where you have to search for clues, question suspects, and figure out whodunnit. In that sense, the game is fairly rewarding, and it even challenges you in a way that most other games of this ilk dont, in that it leaves the who of the whodunnit up to you, and makes it clear that the decision of who to convict is in your hands. Given how frequently most mystery games only offer one path to a solution, its intriguing to see a game that takes such an open-ended approach.", "date": "November 10, 2020", "grade": "B"}