{"name": "Pic-A-Pix Pieces", "ref": "https://gaming-age.com/2019/02/pic-a-pix-pieces-review-for-nintendo-switch-ps4-ps-vita/", "text": "Confession: when I was putting together my personal ballot for our Best Games of 2018 list, I found myself with at least one surprising inclusion: Pic-a-Pix Colour. Not that I didnt like it  I most definitely did but it still would have looked out of place to anyone amidst Red Dead Redemption 2 and Hitman 2 and Spider-Man and whatnot. Nonetheless, it was there. In fact, according to PlayStations handy 2018 Wrap-Up, it was my second-most played game last year (I suspect the fact I platinumed it on both PS4 and Vita probably helped)  and thats not even counting the fact I solved all its puzzles on the Switch version, too.All of which is to say: I was more excited to play Pic-A-Pix Pieces than you might expect. Whats more, I was very, very pleased to discover that Pic-A-Pix Pieces manages to live up to my expectations, and then some.What makes it work is that its essentially Pic-a-Pix Colour, but tweaked just enough to feel different. Like its predecessor, Pic-A-Pix Pieces is a picross/nonogram game, where you fill in a grid with different colours to create a picture. The twist this time around is that youre only solving part of a whole picture with any given puzzle  so while the game says it only has 10 pictures included, each of those pictures is made up of several different puzzles. As you can imagine, this makes the game ever-so-slightly harder, because individually none of the puzzles look like anything, which makes guessing the patterns more difficult.Now, do I love Pic-a-Pix Pieces so much that Im ready to proclaim it one of my very (very, very) early GOTY contenders? Probably not, since theres still a long time and a lot of games to go in 2019. I can, however, say with certainty that after playing the heck out of this game on the Switch, Im going to pick it up for the Vita and PS4 and do it all over again on those platforms too. If thats not an endorsement, I dont know what is.", "date": "February 1, 2019", "grade": "A"}