{"name": "G.I. Joe Operation Blackout", "ref": "https://gaming-age.com/2020/10/g-i-joe-operation-blackout-review-for-ps4-xbox-one-switch-and-pc/", "text": "G.I. Joe Operation Blackout was released this month for consoles and PC, and marks the first time weve seen a new G.I. Joe console release since the movie tie-in G.I. Joe: The Rise of Cobra back in 2009. Kind of surprising considering Ive always felt like G.I. Joe is one of those evergreen 80s properties, but I suppose thats also a bit of my own nostalgic love for the franchise altering my perception a bit.That said, I dont think G.I. Joe Operation Blackout is going to be any sort of revival for the brand unfortunately. Its not all bad, but once I finished the campaign I thought the overall experience was pretty mundane. Its worth noting that this isnt a big AAA release by any means, budget-priced at $39.99, its a bit more in line with old licensed games that were more prevalent in the PS2 era. Some of those games were pretty good, and there are positive things to say about this one too, but perhaps not enough to sway most people.Heres what I think works in G.I. Joe Operation Blackout. Theres a pretty solid roster of playable characters available in the game split between both Cobra and G.I. Joe. Most fan favorites make the cut here, including Snake Eyes, Duke, Scarlett, Lady Jaye, Cobra Commander, Storm Shadow, Destro, Baroness, and a few more. The character designs are seemingly culled from the most current toy line, which are all pretty good I think, and look well enough in-game. The voice acting feels like reasonable facsimiles of the classic cartoon, for instance, whoever voices Cobra Commander does a pretty good Cobra Commander.I also genuinely enjoyed the story. Its as close to a normal G.I. Joe episode (maybe a two-parter) as youd expect to see. Basically, Cobra launches an assault on the U.S.S. Flagg, the Joes are scattered around the globe trying to fight back, and Cobra is attempting to dig up pieces of a relic that will allow them to mind control everyone on the planet. The banter feels spot-on between characters, theres some classic Cobra in-fighting, and overall I found the story to be the highlight of the campaign for me.Unfortunately, playing the campaign is a little less enjoyable. A lot of this comes down to how everything feels. The controls are responsive, but this is a third-person run and gun type of shooter, and the shooting feels kinda flimsy and overly reliant on soft locking on to targets. And melee combat never feels great, theres no weight to your strikes and no indication that youre even connecting with an enemy when you swing. Enough so that I pretty much never used melee attacks, which is a bummer when controlling someone like Snake Eyes or Storm Shadow.Also, missions tend to become repetitive early on. Mission objectives usually consist of clearing out spawning waves of enemies, moving forward just a bit, and then repeating the process. Theres very, very little variety between enemy types. And stage locations will start to repeat again and again. The arctic themed level, in particular, seems to come up far too often. There are a few on-rails driving stages thrown in the mix, but again, theyre mechanically repetitive, as the two vehicles you drive feel identical to each other and youre effectively going through the same motions in all stages.I think youd have to have an awful lot of love for G.I. Joe to get much enjoyment out of Operation Blackout, and even then, I cant see this being a game that someone will pick up and play again and again. There is an option for local co-op and multiplayer, and there are a series of collectibles to gather in each stage with a couple of unlockables. There are also modifiers you can enable after completing a mission, which lets you run through the mission again with things like unlimited ammo, increased health, and so on, which would be neat if the stages themselves were any fun to begin with. I wish I could wholeheartedly suggest checking out G.I. Joe Operation Blackout, but I dont think a solid roster of playable characters and an enjoyable story is enough to put up with the lackluster gameplay.", "date": "October 23, 2020", "grade": "C"}