{"name": "Disc Room", "ref": "https://gaming-age.com/2020/10/disc-room-review-for-pc-switch/", "text": "They say in space no one can hear you screamsadly Im not in space and my neighbors are getting a sporadic doses of loud profanity emanating from my home as I play the latest collaborative effort from Terri Vellmann, Doseone, Kitty Calis and Jan Willem Nijman, Terri Vellmann. Yet despite the vitriolic chatter, I am thoroughly enjoying myself.The year is 2089, an enormous disc has appeared in Jupiters orbit. As a scientist you set off to explore the disc and unravel the mysteries it holds. Upon entry you are greeted by discs which endlessly bound across the room. Your prospects are dim as you get cut down by these serrated nightmares, but yet that is not the end. In fact its only the beginning as a door mysteriously opens after you have been revived. It seems science is going to hurta lot.In a set up that is extremely reminiscent of the arcade classic Smash TV, you control your scientist in a top down single screen room, bobbing, weaving and generally trying to avoid the discs which will endlessly careen even as you lay severed on the ground. Each room has an objective that you must complete before a new path is opened. Some of these objectives are as simple as staying alive for X amount of seconds, others build on an accumulation of discoveries you made in previous rooms such as being killed by X types of unique discs. As you make your way through the structure youll eventually run into discs that actually grant you abilities which could make you survive a little bit longer. However each these 6 power up has its cost, from freezing the room timer to actively decreasing the room timer each time it is triggered, but trust me youll want to equip an ability as it could make the difference between opening a new path or endlessly banging your head against the wall in failure.The gameplay is extremely snappy, you can restart as quickly as you die, and it definitely entices you to do one more run, giving you the false hope that you could indeed complete an objective in your next attempt. Despite only having 57 rooms the game is anything but short. You will die a lot and your progress will be impeded often, however the developers leave plenty of options to tune the game to a difficulty that is not crippling for the player. On the other hand for the player who thinks the game is too easy, the devs also accounted for them by providing 8 challenges which will test any persons mettle. The constant presence of a leaderboard also helps with replayability as I know replayed rooms more than necessary just to one up my sole friend who also had access to the title early (I will topple all your scores, Noah!).Whether it is unraveling the mystery of the disc, trying to last over 20 seconds each room, or completing its Pokedex-ish compendium of discs, or completing the 8 hardcore challenges Disc Room packs a lot for a variety of players. It seems Devolver Digital has been a beacon of light in an otherwise dreary 2020, putting out another title which will likely land on my personal year end list. So lets hope well see the scientist cross over in another Devolver published title where hell be grabbing a crown.", "date": "October 22, 2020", "grade": "A-"}