{"name": "Ori and the Will of the Wisps", "ref": "https://gaming-age.com/2020/10/ori-and-the-will-of-the-wisps-review-for-nintendo-switch/", "text": "Ori and the Will of the Wisps released earlier this year for Xbox One and Windows, and last month it was ported to the Nintendo Switch. Back in March when I originally reviewed the Xbox One release, I indicated that it was an early contender for game of the year. And now, having played through the game again for this Nintendo Switch version review, Ill 100% stand by my earlier statement. Its an absolute joy of a game, one of the best examples of a Metroidvania platformer on the market, and its no less fun to play through a second time.I wont rehash my original review, but its worth pointing out that this Nintendo Switch version of Ori and the Will of the Wisps is honestly more technically sound than the game was when it originally launched on the Xbox One back in March. Im sure the game has been patched and improved on that platform as well, but I was really amazed at how well the Switch version of the game ran here. I had no real technical hiccups to speak of. The framerate was incredibly smooth, even in harrowing chase sequences that saw occasional hitches on the Xbox One at launch. Its a serious technical marvel how well this game has been ported over to less powerful hardware.I also played a chunk of the game via handheld mode and on a Switch Lite with no real issues to report. The controls felt great and responsive in any mode, and its certainly nice having access to the game on the go. Outside of a reduced resolution, youd be hard-pressed to find any significant difference between the Switch version of Ori and the Will and Wisps and the Xbox One version of the game.On the other side of that, this is a pretty straight port of the game all things considered. Theres no notable bells and whistles in the Switch version that cant be found on the Xbox One. Thats certainly not a bad thing if youve not played the game, but if youve already bought or played through it on Xbox One or PC, the biggest draw here will be the ability to play via handheld mode. Still, the fact that it works and looks as good as it does is a pretty decent incentive to experience it all again.Absolutely pick up Ori and the Will of the Wisps if you havent had a chance to experience it so far. Its still one of the best games Ive played all year, and its a real standout amongst any Metroidvania style game Ive ever played. Its definitely a joy to play, and no less so on the Nintendo Switch.", "date": "October 21, 2020", "grade": "A"}