{"name": "Panasonic SoundSlayer PC Gaming Speakers impressions", "ref": "https://gaming-age.com/2020/10/panasonic-soundslayer-pc-gaming-speakers-impressions/", "text": "I had the privilege of attending the virtual Panasonic Press Event for the official unveiling of their new SoundSlayer Gaming Speakers for PC, as well as getting my hands on a review unit before it releases to the public. On paper, the Panasonic SoundSlayer is designed to be a replacement for gaming headphones, built to sit under your monitor and deliver immersive, 3D audio without the negatives that headphones bring during extended play sessions. Developed in partnership with Square Enix, this is a speaker designed specifically for gamers. The SoundSlayer has three distinct audio modes, Role Playing Game (RPG), First Person Shooter (FPS), and Voice (designed for adventure games). After playtesting with several different games, as well as listening to music and watching TV across different settings, I have not found a reason to use any mode aside from the FPS mode. This mode activated the 3D sound setting and manages to achieve a solid imitation of true Dolby Atmos, which is impressive for such a small, single speaker.The SoundSlayer has two full-range drivers, two tweeters, and an internal subwoofer that it uses to achieve 2.1 channel audio. It connects to your PC via HDMI cable and allows for 4K HDR passthrough to your monitor. This is great for people with limited HDMI ports and allows you to use your monitor and the soundbar with just one port being used on both the PC and the monitor. You can also connect a phone via Bluetooth, which works as you would expect.Overall, the SoundSlayer manages to avoid falling into the RGB trap and is a sleek soundbar that doesnt scream GAMER to everyone who walks past your desk. This makes it easy to move it into a living room or a bedroom to use with a TV, which also works wonderfully. I have a bonus room in my bedroom, where I have a TV, my PlayStation 4, and some recliners. It is a relatively small space, and the SoundSlayer works great for both games and movies up there. The small size makes it really easy to carry it from place to place, and the HDMI passthrough makes it easy to set up. This convenience is a big selling point but also leads to one of the bigger problems. The SoundSlayer provides solid, high-quality sound for its size, but it is still ultimately limited by that size. Audiophiles will still prefer more depth of sound, and competitive FPS gamers will prefer headphones that give them the advantage that true 3D audio brings in a game like Call of Duty.While the SoundSlayer does provide some level of surround sound and 3D audio, it only works when it is turned up and directly in front of you on a desk. The depth of the speaker will make this difficult for some gamers, and I had to remove the wrist wrest on my keyboard and move it closer to me in order to fit the bar between my keyboard and my monitor. In addition to the depth, the HDMI passthrough can become troublesome when you are not actively playing a game. If the SoundSlayer doesnt detect any audio for 20 minutes, it shuts off. This causes your monitor to turn off for a few seconds while it transitions from passthrough with audio to passthrough without, then if you turn the speaker back on you get the same waiting time while it reconfigures itself. If you are sitting and reading articles on the computer or writing one like I am doing right now, you will need to either leave the SoundSlayer off or have some audio playing while you read. Although this is a small complaint, it frustrated me every single time it happened.The actual performance of the SoundSlayer in FPS mode is definitely the biggest selling point here, as it should be. The SoundSlayer manages to really immerse you in whatever you are playing, with solid audio performance. Destiny stands out as one of the best games I was able to check out on the SoundSlayer. The Sci-Fi sounds really popped, the guns and the spaceships specifically. The audio surrounds you, although you do not get the directional precision you will get with headphones, and I still recommend using those for Crucible matches.", "date": "October 6, 2020", "grade": null}