{"name": "Prehistoric Dude", "ref": "https://gaming-age.com/2020/10/prehistoric-dude-review-for-ps4-xbox-one-switch/", "text": "Prehistoric Dude is the fourth game that Ive played that was developed by lightUP, and its exactly what youd expect based on the previous three. Much like Milos Quest was a love letter to top-down puzzlers from the NES days and Super Wiloo Demake was an homage to that eras platformers, Prehistoric Dude is heavily indebted to the early days of the Metroidvania genre. Much like both of those other games, though, just because Prehistoric Dude doesnt bring anything new to the table doesnt mean that its not worth playing.Admittedly, a big part of why I enjoy it so much is that I dont usually have a lot of patience for Metroidvanias, and Prehistoric Dude is awfully short. You can get the Platinum Trophy in well under an hour, and even if youre the type who needs to finish 100% of a game, it will only take you an hour or two more. The world the eponymous caveman inhabits isnt that big, and it gives you a map right off the bat so you can see exactly where youve been and where you need to go to backtrack. Basically, think of it as a Metroidvania for Beginners.Like I said, though, its fun, though it definitely has a couple of irritating idiosyncrasies. You unlock gloves that help you cling to ledges pretty early on, but its never quite clear when youll actually grab a ledge and when youll whiff on it entirely. Similarly, you have health and stamina meters, except they dont seem to refill at any consistent rate.Eventually, though, those issues fade into the background as you get used to them, and  at least in my case  I found it was pretty easy to enjoy the game. The map is just big enough to be interesting without being intimidating, the enemies are plentiful enough that you always have to be on your toes, and the loot drops are constant enough that even if you die dozens of times, youll always have pretty much everything you need.You can probably tell from the above that Prehistoric Dude isnt all that challenging. But thats only an issue if you want your retro games to be tough as nails. Prehistoric Dude is for when you want a Metroidvania platformer that doesnt require a whole lot of thought  and when you want that, its just about perfect.", "date": "October 6, 2020", "grade": "A-"}