{"name": "Demons Tier+", "ref": "https://gaming-age.com/2020/09/demons-tier-review-for-ps4-ps-vita-xbox-one-switch/", "text": "Ive got to hand it to Cowcat. Demons Tier+ is the fourth game from the French developer, and, as someone whos suffered through each of the previous three games, its nice to see that theyre slowly but surely improving. They started out with an entirely forgettable adventure game, followed that with a hideously ugly platformer, and their last outing was a middling twin-stick shooter. Demons Tier+ is easily better than all of them.Obviously, thats not a high bar to clear, but Im really not trying to damn the game with faint praise. Its got a couple of minor hiccups here and there, but on the whole, its a fairly enjoyable twin-stick shooter.What makes it work so much better than its predecessor  which, as I noted above, was also a twin-stick shooter  is that Demons Tier+ has things like a story and a personality. I mean, the story is your basic heroes save the world from monsters kind of thing, but thats a vast improvement over the last outing. Likewise, the game  which takes place mostly underground in a series of caves  looks kind of cool, as you scour each dimly-lit floor for monsters and treasure by floating candlelight. That means you can never quite see what lies beyond the edge of your vision, which is normally something that bugs me, but Demons Tier+ manages to make it work.In this regard it helps, I suspect, that the gameplay is much more interesting. Theres RPG-style skill progression after you clear out each floor, which means you can decide how you want to build up your character. There are different objectives on each floor, which means you never know whether youre going to have to clear out all the monsters, open all the treasure chests, or whatever other tasks the game sets for you. You have a variety of attacking styles at your disposal, which means you can vary it up if you want to.I only really have one complaint: much like its predecessor, Demons Tier+ has an eyesore of a PlayStation Store icon that in no way reflects how the game actually looks. This may seem like a small thing, but given that the developers second game really was an eyesore, you can see why it might be cause for concern.", "date": "September 21, 2020", "grade": "B+"}