{"name": "Slayaway Camp: Butchers Cut", "ref": "https://gaming-age.com/2019/01/slayaway-camp-butchers-cut-review-for-ps-vita-ps4-xbox-one-switch/", "text": "I feel really, really conflicted when it comes to assessing Slayaway Camp: Butchers Cut.See, when it all worked, it was insanely fun. The puzzles were clever, the soundtrack was top-notch, and the whole package was put together really well. Ill explain these things each in a little more detail in a moment, but I just want to say upfront that I really enjoyed playing the game.Unfortunately that phrase when it all worked is doing a lot of heavy lifting in that sentence. Because the sad truth is, Slayaway Camp: Butchers Cut  at least on the Vita  doesnt work nearly as often as it should, and even when it does, there are still major performance problems with its performance.The biggest issue is obvious: this game crashes a lot. As in, it was rare for me to be able to do more than ten puzzles in a row before the game would experience a bug and be forced to shutdown and restart. I had some stretches where the game crashed after every single puzzle. By even the most lenient standards, thats pretty unacceptable.Whats more, even when Slayaway Camp isnt crashing, its got some serious performance issues. Load times are abysmal: it takes a few minutes for the game to start, and then a few minutes to load up a puzzle, and then a few minutes more if you quit a puzzle or want to return to the main menu for any reason. The music in intermittent: sometimes itll play, other times it wont, and there doesnt seem to be any rhyme or reason to when it will work. Perhaps worst of all (well, second worst, after the crashes), there are constant stutters and skips  particularly bad during the post-puzzle screens, when you have to time a button press just right in order to get more coins.Basically, Slayaway Camp only barely functions. Which should make it a slam dunk in terms of recommending versus not recommending it, right?Wellits not so simple as that. Because the fact is, I really enjoyed playing it between all those crashes. The puzzles are deceptively simple, with you sliding your little serial killer around a board in pursuit of his/her victims as the game places more environmental obstacles in your way the further in you get. It soundtracks this (some of the time, at least) with spooky noises and sound effects that really add to the horror movie atmosphere the game is going for. To top it all off, Slayaway Camp does a great job of making gory horror palatable for even the most squeamish by packaging it within Minecraft-esque graphics.All of which is to say: Slayaway Camp will force you to choose between performance and play in a way that most other games wont. If you can abide performance issues  again, lots and lots and lots of performance issues  the gameplay here might be strong enough to make up for it. But those issues are serious and occur with enough frequency that I wouldnt blame anyone for not thinking this game is worth all those headaches.", "date": "January 28, 2019", "grade": "B"}