{"name": "Neptunia: Sisters vs. Sisters", "ref": "https://gaming-age.com/2023/02/neptunia-sisters-vs-sisters-review-for-playstation-5/", "text": "Despite being a fairly long-running series, I dont believe I have ever crossed paths with a Neptunia game before, but having played through Neptunia: Sisters vs. Sisters, I dont think Ive been missing much. Everything about my time with Neptunia: Sisters vs. Sisters was absolutely mundane, and while largely inoffensive, its not an experience Id care to repeat any time soon. Im sure this series has its fans, and perhaps some of the earlier games have been of a higher caliber than this, but as someone new to the series I can safely say youre not missing out if you continue to skip the Neptunia series with this latest release.Like the previous games, Neptunia: Sisters vs. Sisters is chock full of references to gaming consoles, gaming history, and cute anime girls representing both of those things. In this entry, youll take on the role of protagonist Nepgear, who after an accident wakes up in the future along with a few of her friends and finds her world has been significantly changed. Part of that change stems from the introduction of the rPhone. This device has made a significant impact on the world of Gamindustri, in addition to a monster uprising dubbed Trendi Outbreaks, and the disappearance of certain goddesses including Nepgears own sister.As Nepgear, youll put together a three-character party and be tasked with exploring the various regions of Gamindustri which is split into a number of different areas. Each area has a few branching paths, fast travel points, and various monsters to battle. Neptunia: Sisters vs. Sisters is an action RPG, so no turn-based battles, instead youll have direct command over one character while being able to switch between other party members on the fly. This ability to switch party members plays heavily into combat encounters, and chaining together multiple party members can increase your overall damage output during a fight.Unfortunately, the actual combat is kind of dull, as youll just mash your attack button to perform about 4 attacks, switch to another party member, repeat, and so on. Theres some unnecessary depth to the combat, you can swap out skills as you level up and gain new abilities, and some skill types feed into others in interesting ways, but all of that feels largely unnecessary since the difficulty in Sisters vs. Sisters is slight overall. Its much easier to just spam attacks and switch party members once your action points are exhausted than it is to worry about skill synergy, and the game doesnt do much to reward you for toying with your various abilities.The mundane combat is matched by the environments you get to explore, which consist of a lot of the same types of locations across multiple maps, with very little difference in environments or monsters to encounter. Youll get your bog standard biomes that youve come to expect in a lot of RPGs, and while the gaming world setup to Neptunia sounds interesting on paper, Gamindustri itself is pretty bland and doesnt quite lean into the concept hard enough beyond the playable character designs.Likewise, nothing about the music, visuals, or story really stood out either. Everything works, and the dialogue is no worse than Id expect out of this type of fan-service game, but it doesnt really shine in any particular way either. I cannot overstate how bland I found Neptunia: Sisters vs. Sisters to be, I was actually pretty surprised by how bored I found myself hour after hour. I can safely say that youd be fine avoiding this one, and if youre a fan of the series, youd probably still do well to steer clear of this entry.", "date": "February 1, 2023", "grade": "C-"}