{"name": "Death Stranding", "ref": "https://gaming-age.com/2020/07/death-stranding-review-for-pc/", "text": "In my original review for Death Stranding, I gave it a solid A+, the highest praise we can give a game here at Gaming Age. I can tell you now that the PC version holds up to that high praise and then some. The increased frame-rate, the ultrawide support, the new Half-Life, and Portal themed content, it all serves to further elevate this already incredible game.The world was a simpler place when Death Stranding initially released. Coronavirus was a relatively unknown threat, people could go see friends and family without risking exposure, the world was generally a much more open place. Fast forward to the PC release, and the concept of reaching out and connecting with others around you, and connecting people in their bunkers has never seemed more appropriate. I am not typically one to wax poetic about how video games mirror real life, or how their releases coincide with current events, but this one is just too spot-on not to mention it. Connecting with friends and family in whatever way possible right now is huge, and that feeling is not lost during the trek across America in Death Stranding.Performance enhancements are the big change coming to Death Stranding in this PC version. 4k, 60fps, native ultrawide support, all of these serve to elevate both the gameplay and the cutscenes. All told, your journey through Death Stranding will bring you roughly 10 hours of cutscenes, so having them run in a smooth, locked 60 frames is amazing. Loading is also virtually non-existent, but that is not much of a change from the PS4 version, which also loaded rather quickly on my PS4 Pro.The gameplay remains the same, albeit upgraded. You spend your hours as Sam Porter Bridges (played by Norman Reedus) delivering cargo from place to place. After the launch of Death Stranding on the PS4, the loudest critics compared the entire game to a massive side-quest, which while not necessarily wrong, is not the way I would choose to look at it. There are so many little facets to the deliveries, and so much of the game is designed around traversing the world and enjoying the environments, I never felt like I was just doing a fetch quest.Keyboard and mouse are supported, but I am still more partial to the controller for a game like Death Stranding. It just feels more intuitive, and since it was built originally on the PS4 and around that system, using my PS4 controller with my PC just felt more natural. I also have over 100 hours of experience playing this game with that controller, so newcomers may prefer the keyboard and mouse.Death Stranding was not, and still is not, an experience for everyone. I do not blame players who look at this and determine that it is just not for them. If you do take a chance on it though, I would strongly recommend you push through the first three chapters. I am not a fan of the deal with it until it gets good mentality that some games present, but I feel like the payoff with getting through the tougher initial hours is well worth it. Everything is confusing at first, nothing makes sense, and all of these crazy words and acronyms get thrown around, but I promise, everything DOES get some type of explanation as things go on.The PC release brings with it some awesome new side-quest tie in content from Half-Life and Portal, which is a great little aside for PC gamers to find. Other than that, unfortunately, there is not a whole lot of new content here to bring players who already beat the game back for seconds. If you really loved Death Stranding like I did, playing through it again on a better system is a worthy experience and something I looked forward to ever since the PC version was officially announced. For players that really liked it, but dont necessarily have the time or interest to simply play the same game over again, there is probably not enough here to justify another full $60 on what is essentially the exact same game.", "date": "July 28, 2020", "grade": null}