{"name": "Deadly Premonition 2: A Blessing in Disguise", "ref": "https://gaming-age.com/2020/07/deadly-premonition-2-a-blessing-in-disguise-review-for-nintendo-switch/", "text": "Ill start this review out by saying that I enjoy Deadly Premonition 2: A Blessing in Disguise a fair amount despite a whole host of flaws that make absolutely loving the game a pretty difficult thing to do. It also makes it a difficult game to suggest to other people at least in its current state. Deadly Premonition 2 still needs a lot of work done to it in order to feel technically sound, and while the developer and publisher have made clear they are working on issues but when those kinks get ironed out is anyones guess. To their credit, while writing this review, at least one patch did land that seemed to solve one significant bug I kept encountering, so there is hope that Deadly Premonition 2 will end up in a better state down the road.Do you need to play the original game in order to enjoy the sequel? Not necessarily. I think the original is a slightly better game overall, I liked the Twin Peaksy setting of Greenvale more so than the southern Le Carre, but mechanically both games are sort of on par with each other. Deadly Premonition 2 is both a prequel and sequel to the original game, moving back and forth between the year 2005 and 2019, and while it plays upon certain elements of the first game, the majority of the featured cast is brand new. The only confusing aspect of the game would come from the lead characters name in the prequel vs. modern-day setting, and the ending would be a little rough without a Wikipedia plot readthrough of the original game. Other than that, I think you could work your way through the plot of DP2 without much trouble.The 2019 side of Deadly Premonition 2 is almost entirely story focused. It features two FBI agents questioning lead character Francis Zach Morgan, who is in pretty rough shape at this point. This section of the game generally serves as a lead-in for each chapter, as current day events are causing Francis to revisit his memories from 2005, involving a not-quite solved case from his past. The majority of the actual gameplay will come from the 2005 section of the game, featuring the open-world setting of Le Carre, Louisiana. Here Francis York Morgan will spend most of his time, wrapped up in a murder mystery revolving around what appears to be an appalling cult sacrifice in an otherwise sleepy sort of southern town.Much like the original game, Francis encounters an eclectic assortment of characters in Le Carre, both friendly and otherwise, as he continues his investigation. Its this weird assortment of characters, including Francis himself, that ultimately makes Deadly Premonition 2 worth playing. Everyone has a very distinct personality or character quirk that makes them stand out and remain memorable, no matter how minor their role in the game might be. And while I found most of the side quests featured were fairly mundane to outright boring, I still did a large number of them, simply because it led to more reveals and info about the citizens of Le Carre.That said, the actual part where youre playing Deadly Premonition 2 leaves a lot to be desired. I like the fact that the game does feature a number of locations to visit and areas to explore, but doing so often feels like a chore just because the game runs so poorly in its current state. The outdoors areas absolutely chug, with huge framerate drops and straight-up half-second freezes. Indoor areas fare better, but if youre in one of the handful of otherworld areas fighting enemies, you can expect the game to temporarily get hung up just about any time an enemy warps in or disappears after being killed.All in all, Deadly Premonition 2: A Blessing in disguise is definitely a mixed bag. I enjoyed the story, love the characters, and Im happy to see more of Francis York Morgans weird adventures. But actually playing the game to get to the good stuff never feels great either. Technical improvements would help a lot, but wouldnt completely solve the mundane mission design, tongue-in-cheek fetch quests, or subpar combat encounters. So altogether, I cant wholeheartedly recommend this game to everyone. I think youve got to come in with a willingness to look over a lot of issues just to get to the good stuff, and considering how many amazing games are available right this second, thats going to be a pretty hard sell.", "date": "July 24, 2020", "grade": "C+"}