{"name": "Bohemian Killing", "ref": "https://gaming-age.com/2020/07/bohemian-killing-review-for-nintendo-switch-pc/", "text": "Bohemian Killing isnt a great game, but its built around a great idea: what if you played a courtroom drama where you know youre guilty, but you have to prove your innocence? Its basically a reverse whodunit mystery, where you know exactly who did it, but your goal is to make the judge think it wasnt you.Dont worry about spoilers there  Im not giving anything away in that last paragraph. Bohemian Killing lives up to its name in its first few seconds: your character is in a hallway holding a knife, he opens a door, and then he stabs a woman to death. Theres no doubt about who the murderer was. But just a few moments later, you find yourself in court, and you have to defend yourself against a charge thats very clearly true.Again, the underlying idea here is fantastic. Youre given the timeline of events that led up to the murder, and you have to walk the judge through what really happened. You rented a room at the hotel next to your apartment? Theres a perfectly good explanation for that, your honour. The accused, Alfred Ethon, was seen entering his apartment covered in blood? Maybe it was a really bad shaving mishap, maybe he got beaten up for being a Roma (or, as the game prefers, Gypsy) by a couple of Parisian hoodlums. And what about the murder victim, your friends maid? Maybe shes not as innocent as she seems, you know.Better still, the game almost takes place in real time. The events  not counting the trial  happen over the course of three hours, and you have to account for your whereabouts the whole time. Sometimes time speeds up when you read a newspaper or make a phone call, sometimes time drags on as you have to wait for the next major plot point in the testimony to occur, but for the most part, youre responsible for making the story unfold in a way that proves (or at least suggests) your innocence.Unfortunately, despite the great premise, the execution  pun not intentional  is far from perfect. Bohemian Killing has a major problem with load times, for starters. Its nearly impossible to open a door in this game without triggering a loading screen. Seeing as virtually the entire game consists of you walking between a hotel and the apartment next door, with doors to both, along with doors to your rooms, you can see how loading screens after each door opens might lessen the dramatic tension.The other major issue is that sometimes the game just flat out doesnt work. One time I fell down a hole, and found myself trapped in complete darkness with no way out. Another time, the judge started talking to me during my testimony, paused mid-sentence, and then nothing else would work. In both cases, I was forced to restart the game from the beginning. It may not be a long game, but it still felt tedious to have to go back and try all over again.Still, its a mark of the strength of Bohemian Killings underlying idea that I was willing to retrace my steps anyway. As someone who loves murder mysteries, its always fun to see someone try something new  and even with its flaws, Bohemian Killing does exactly that.", "date": "July 9, 2020", "grade": "B"}