{"name": "Woodle Tree 2: Deluxe", "ref": "https://gaming-age.com/2020/07/woodle-tree-2-deluxe-review-for-nintendo-switch-ps4-ps-vita/", "text": "If were grading Woodle Tree 2: Deluxe on a curve, theres a pretty reasonable argument that its an A+ game. After all, the first Woodle Tree is one of the very worst games Ive ever played on the Switch  a glitchy, buggy, broken mess that feels a lot longer than its hour-long runtime by virtue of the fact everything about it is terrible. By being miles better than that, Woodle Tree 2 feels like a generational leap forward.In isolation, though  or, I guess, if you compare it to any of the other 3D platformers the Switch has to offer  Woodle Tree 2 isnt quite as much of an achievement. Stacked up against games that are actually competent, its flaws are much more obvious.Take the games world, for starters. Sure, youre not falling through platforms and walking through walls at every turn like you were in the first game, but it still happens enough here that its noticeable. On top of that, the camera seems to exist independently of the world, and its awfully easy to swing around to an angle where you find yourself looking through walls. Strangely, though, these weird angles dont exist when the eponymous Woodle walks into small buildings  in those cases, the camera remains stuck outside.Woodle Tree 2s controls also dont do it any favours. Woodle doesnt seem to have any kind of weight to him, which makes jumping rather difficult  you never can tell exactly where youre going to land. Given the amount of jumping from platform to platform you have to do here, you can see why that may be an issue. Similarly, he doesnt seem to put any weight behind his attacks, which means that you can never tell if one of your swings has connected with an enemy, or if theyve just started walking away on their own.(That, of course, is another of the games issues  the AI is pretty stupid. While one or two enemies do seem to notice when you come near, for the most part they just keep on walking back and forth, indifferent to whether your blows have made contact.)Theres also the problem of how same-y the world looks. Yes, its cute, and yes the open-world is massive, but theres so little variety here that youre likely to forget where youve been already. It doesnt help that the game doesnt do a great job of saving your progress  there are a reasonable number of checkpoints, but it seemed to me that every time I died, all the collectible berries seemed to reset, which meant lots and lots of backtracking.Its a sign of how terrible the first Woodle Tree was that, even with all these issues present in Woodle Tree 2, it still represents several massive steps forward. Really, that probably means you shouldnt get either one, but if you absolutely have to get one of the two (for some inexplicable reason), Woodle Tree 2 is definitely the one to get.", "date": "July 6, 2020", "grade": "C+"}