{"name": "Thy Sword", "ref": "https://gaming-age.com/2020/06/thy-sword-review-for-ps4-ps-vita-xbox-one-switch/", "text": "Really, if youve ever played any of the many, many retro-tinged platformers out there, youve basically played Thy Sword. Its got all the hallmarks of the genre, from the 8-bit graphics to the chiptunes music to the high level of difficulty. Theres not a whole lot you wont have seen before.That said, there are a couple of twists here worth mentioning. One of them is fairly basic: the levels are all procedurally-generated, which means that every time you die  and you will die plenty, for reasons Ill get into shortly  its not like you can just remember what you did wrong and adjust accordingly. No, you need to try your luck at another level entirely. Its worth noting here that Thy Sword also takes a somewhat confusing approach to your progression through the game: when you die, you have the option of retrying. Selecting yes starts you back at the first level of your given world; select no, however, and you get kicked back to the title screen, where you have the option of continuingwhich takes you back to the level in which you died (though only numerically the same level, not literally, since again these are procedurally generated levels).The other twists are a little more interesting, though. First, you have the option of playing as either a Barbarian (who has more power) or a Valkyrie (who has arrows to go along with her sword). While this is hardly a ground-breaking innovation, I dont recall these games giving you multiple ways to play the first time around (or showing that kind of gender inclusivity for that matter), and its a nice change of pace.Secondly, Thy Sword gives you an instakill move right off the bat: a twirling sword move that allows you to decapitate even the toughest of enemies. That said, it requires perfect timing and spacing to pull off  start your attack too close to your enemy, and youll go rushing past them harmlessly, and find yourself wide open to attacks. Coupled with the different options for who you want to play as, and its fair to say that Thy Sword is relatively adventurous, as these kinds of games go.Its still pretty generic, though. Thy Sword may be different from the dozens and dozens of other games that fit within its genre, but its only a slight difference. In the big scheme of things, its still a platformer with ideas and a look that first came into fashion a couple of decades ago. Whatever your thoughts are on games like that, this game will do nothing to dispel them.", "date": "June 29, 2020", "grade": "B-"}