{"name": "BioShock Remastered", "ref": "https://gaming-age.com/2020/06/bioshock-remastered-review-for-nintendo-switch/", "text": "BioShock has always been one of my gaming blindspots. It originally came out at a time when I wasnt really into gaming, and even after I finally got a PS3 many years ago, I still never went back and played it for more than an hour or two. As such, you can imagine how happy I was when news came that the game would be making an appearance on the Switch. A little nervous, too, since the Switch couldnt handle a game like Close to the Sun, which was basically BioShock: The Walking Simulator, but still, I was keen to properly experience the game for the first time  while also hoping that the game could run properly on the Switch.Turns out, I had nothing to worry about, because BioShock Remastered runs just fine. Oh, and its an amazing game, aswell, as almost literally everyone in the world except me couldve already told you.Chances are, you dont need me to tell you why this game is so phenomenal. But for someone looking at the game with fresh eyes, its a pretty impressive achievement, even more than a decade after it first came out. Where some classics are very much of their time, theres something about a game set in a failed Objectivist utopia that seems particularly timely today, probably in a way that it didnt even back when the game was first released.Political commentary aside, the first thing you notice about BioShock Remastered is that its stunningly gorgeous. Few games have ever matched it for creating such a thoroughly fleshed-out world, and its Art Deco-inspired sunken city is breathtaking. Even playing the game on a handheld  as I did, for my entire playthrough  I was constantly awed by how good the game looks here. There was the odd time where I had a bit of trouble pinpointing exactly where a security camera or a gun turret was located due to a slight lack of detail, but on the whole, I would put BioShock Remastered up against pretty much anything else the Switch has to offer.The gameplay has aged equally well. While its a little disconcerting to realize that the game places so little emphasis on aiming or jumping (and dont even think about running), this was only something I noticed after the fact. Otherwise, the combination of exploration and combat is expertly pulled off here. Ive always struggled a little when it comes to balancing multiple types of guns, and here I was not only able to switch from wrench to shotgun to pistol with ease, I was also able to smoothly switch back and forth between the guns on one hand and the quasi-magical plasmids on the other. I realized this at some point during the game when I was fighting a Big Daddy to rescue/kill a Little Sister, but I havent seen many games that make fighting boss-level enemies so straightforward.And speaking of Little Sistersagain, I realize Im about ten years late to the party here, but its still impressive to see a game that judges you for your actions. It may be a little less unheard of now, but the way BioShock does it still packs an emotional wallop.Really, though, the whole game packs a wallop. BioShock Remastered is one of gamings all-time classics, and whether youre experiencing Rapture for the first time or simply interested in revisiting it, youll be pleased to learn that the Switch version is every bit as solid as its counterparts on other consoles.", "date": "June 23, 2020", "grade": "A"}