{"name": "Deliver Us The Moon", "ref": "https://gaming-age.com/2020/06/deliver-us-the-moon-review-for-ps4-xbox-one-switch/", "text": "It doesnt take long for the big flaw in Deliver Us The Moon to make itself known. Just a few minutes into the game, youre walking through a door, going from one room to the next  nothing too momentous. Then, mid-stride, everything freezes. And stays that way for about five seconds.If this just happened once, it would be an odd glitch, easily forgotten about. Unfortunately, however, it happens every time the game saves. Multiply that one moment of freezing to every couple of minutes over the course of the 5-6 hour game, and you can see how it would very quickly go from odd to annoying. It disrupts the flow of the game, and takes you out of the story.This is especially bad for a game like Deliver Us The Moon thats all about its story, and all about immersing players in its tense, desolate world. Its a walking simulator where youre on a mission to (as the title implies) the Moon, and its on your shoulders to save humanity. For the most part, youre floating or bouncing or wandering through an abandoned space station or a seemingly empty lunar colony, trying to find resources and figure out what happened to the previous inhabitants. Youre driven by the sense of urgency that comes with needing to save the planet.Or, at least, you would be driven by a sense of urgency if you werent constantly being pulled out of the game by the freezing.Its especially a shame in this case, since wed be talking about a pretty solid game otherwise. The story is told in fragments, via all kinds of clues that have been left behind. Its not a new approach, of course, but it works when its done well, and its definitely done well here.On top of that, the puzzles here add to the game in a way that feels organic. Theres always the risk in games like these that the puzzles will feel forced, or out of place. Thats not the case here. Just as the story is always (in theory) pushing you on to the next task that you need to do to stay alive, the puzzles always always feel like theyre a natural part of that urgency, as you carry out tasks that, presumably, are necessary to getting a space station or a lunar colony up and running.Again, though, its hard to maintain a real sense of urgency when technical glitches conspire to diminish that urgency. With slightly better performance, Deliver Us The Moon could have been one of the best games of the year. As it stands, itll have to settle for being merely intriguing.", "date": "June 18, 2020", "grade": "B"}