{"name": "The Elder Scrolls Online: Greymoor", "ref": "https://gaming-age.com/2020/06/the-elder-scrolls-online-greymoor-review-for-pc-ps4-xbox-one/", "text": "If you have played The Elder Scrolls V: Skyrim at any point throughout its impressive, nearly 10-year lifecycle, chances are it made an impact on you. Skyrim is one of those games that will forever be talked about due to the massive influence it had on open-world RPGs, storytelling, and arrow to the knee memes. For players like me, who remember going and standing in line at GameStop for the midnight launch on 11/11/11, there are fond memories attached to the game that have nothing to do with the game itself. I met one of my very best friends standing in that line, talking about random Elder Scrolls nonsense. I am not alone in this, there are stories everywhere of people coming together around Skyrim, and it has become a massive pillar of video game culture and even bled into other pop culture spheres.The influence that Skyrim has had on the video game industry cannot be overstated, so it is not surprising that ZeniMax used Skyrim as the cornerstone of their whole new year roadmap The Dark Heart of Skyrim. Sure, vampires are cool, and werewolves, and witches, all of that can work fine in an expansion, but the return to SKYRIM is what makes Greymoor such a hot ticket new chapter. There is, of course, the ability to access parts of Skyrim in the base game, but this chapter really brings players home to the frozen northwest portions of that land, and lets them experience familiar places that some of them invested hundreds or thousands of hours into, but 800 years earlier. Ruins you came across in Skyrim are still thriving temples, dungeons you ran through are now populated centers of civilization. While this aspect isnt exactly consistent across the board, with some small towns looking exactly the same as they do 800 years in the future, it still ends up being a mostly awesome addition to Greymoor.The main storyline centers around a vampire invasion, stemming from Blackreach. Blackreach is a sprawling labyrinth underneath the city of Solitude. It is spoken about as a myth among normal city dwellers and surrounding townsfolk, but it very much real. While Western Skyrim has the expected grey-toned, dreary feel that Skyrim had, Blackreach is a beautiful and strong departure, with bright hues of green and purple, from the massive glowing mushrooms to the giant gemstone formations. In addition to the stunning beauty of the natural environment, giant gothic castle formations and sweeping underground courtyards bring a sense of menace and life to the underground caverns.While the actual storyline is short, predictable, and sometimes tedious, it is not bad. The lackluster quests are elevated by the outstanding companions, with Lyris Titanborn making a triumphant and much-needed return, alongside a new vampire companion Fennorian. Both companions have a character arc, with their motivations and actions changing and evolving throughout the quests. Superb voice acting and well-written dialogue further increase the feeling that these companions mean something. Svana and the High-King Svargrim on the other hand, lack most of what makes Lyris and Fenn so great.While the main quest falls a bit short, side quests continue the Elsweyr tradition of excellence. Some truly memorable NPCs, alongside some unique and engaging quests, give life to the extended Greymoor experience. I found myself particularly fond of The Maelmoth Mysterium which will have you tangling with curmudgeonly Mages Guild librarians, journeying to the famed Kilkreath Temple in its prime, and solving puzzles and illusions all throughout. Almost every side quest felt meaningful and unique enough to warrant doing, with very few random fetch quests and simple kill 10 monsters quests that seem to be the easy way out with most MMORPGs.The adjustment to the Vampire skill-tree is the biggest mechanical change that Greymoor brings to ESO. While mostly positive, it comes with some setbacks as well. Depending on your stage of vampirism, different NPCs will react differently to you. As you climb the skill tree you will get stronger, but once you reach the final stage, NPCs will no longer speak to you. This can be reversed with time and certain potions, but the potions are not exactly readily available. Increasing your level comes from feeding on random NPCs and enemies, and Greymoor overhauled the feeding animations, making it much more fun and exciting to sneak up and feed, similar to how the Blade of Woe in the Dark Brotherhood works.If the Vampire skill-tree is not something that interests you, that is alright. While Greymoor does make it more enticing, and the entire main quest is built around vampires, there is no pressure or need to pursue that tree if you dont want, the entire Chapter is able to be played without every dabbling with Vampirism.The biggest negative comes in the form of launch hiccups. Now, it is important to remember that the final, polishing weeks and the actual launch of this Chapter all came during the Coronavirus quarantine, and the dev team was all working remotely. This certainly gives reason to allow some leeway in terms of launch performance, but massive crashes, 1-2 hour long queue times, and rendering problems that cause the textures in the entire world to fail to load lead the charge of post-launch issues. Again, nobody needs me to tell them how wild our world has been in the past few months, and I completely understand why those issues were present, but I also feel that delaying the PC launch to coincide with the console launch on June 9th might have made for a smoother launch. As of the time of this writing, all of the issues have been mostly patched out, with the sole exception being random spots of no texture popping up here and there.In addition to the main quest, and the plethora of side-quests, there is plenty to do in Western Skyrim. Harrowstorms are this chapters version of the Dark Anchor events you have seen in various forms and under various names before. Delves, public dungeons, and several nostalgic points of interest all put some more meat on Greymoors bones. The public Labyrinthian dungeon is another highlight, with a great location and some memorable bosses within.Though Greymoor may not be a groundbreaking new chapter for ESO, it is yet another step forward. With how rocky the launch was, it is wonderful to see ZeniMax continue to create great new content, and although the main quest is nothing to write home about, it kicks off the year-long Dark Heart of Skyrim event and holds a lot of promise.", "date": "June 16, 2020", "grade": "B"}