{"name": "John Wick Hex", "ref": "https://gaming-age.com/2020/06/john-wick-hex-review-for-ps4-pc/", "text": "I was really excited to play John Wick Hex, but not for the reasons you might expect.See, Ive never seen any of the John Wick movies. Literally the only things I know about them are that they star Keanu Reeves, and theyre action films. Also, I think there may be three of them?No, what really got me interested in John Wick Hex was the fact it was developed by Mike Bithell. Bithell is the man behind Thomas Was Alone and Subsurface Circular, which are two games I hold in very high regard. Knowing Bithell had worked on this game, too, made me keen to check it out.I should have remembered, however, that he was also the man behind Volume  which I certainly found to be good enough, but not something thats stayed with me ever since. That, more or less, sums up my feelings towards John Wick Hex, too: its good for what it is, but I dont think its a must-buy like either of those other games I mentioned above.In fact, the Volume comparison goes even beyond that, since the two games are kind of similar. Theyre both top-down games where stealth is pretty important, and you need to plan out your next moves as you go along.Of course, John Wick Hex involves much more shooting. Like, a lot more (which I assume is in line with the movies). As you go through each level, your goal is to kill everyone who stands between you and the exit. The game is too stylish to be described as bloody, since there are shadows everywhere and your enemies crumple to the ground in artful poses, but the body count here is astronomical, and the game doesnt shy away from supplying you with all the firepower you need.That said, youve got to be strategic about using that firepower. Its not just a matter of emptying out your clip and reloading. Rather, you have to pick up guns as you go along, and when you run out of bullets, you have to start using fists to make your enemies drop their guns. This strategy extends into other facets of the game, too  different poses allow you to move in different ways, and you need to constantly be thinking about the angles at which youre exposed. Luckily, the world around you pauses as you consider your next move (shades of Superhot), but that only adds to the suspense, as you try to figure out how to shoot multiple enemies converging at you from different angles.Does this make for a faithful representation of John Wick? As I said, I have no idea. Id feel much more confident in saying its not the best Mike Bithell game possible, but I imagine thats a much less meaningful statement for most people, judging by box office totals compared to the broader cultural impact of Thomas Was Alone. As such, Ill split the difference, and say that John Wick Hex is a solid strategic action game thats great if youre in the mood for skulking around in stylish shadows and killing lots and lots of bad guys.", "date": "June 8, 2020", "grade": "B"}