{"name": "The Forest Quartet", "ref": "https://gaming-age.com/2023/01/the-forest-quartet-review-for-playstation-pc/", "text": "Heres my problem when writing about The Forest Quartet: its clearly designed to make you feel things, being a game about processing grief. But when I was finished, I just felt like shrugging and moving on to the next game in my backlog. Its got its heart in the right place, but I dont think it comes close to living up to what it wants to be.A big part of this, I think, is that it intertwines its story and its gameplay, but neither of those elements are particularly well done enough to be interesting. The eponymous Forest Quartet are a jazz quartet who have just lost their lead singer, and the game is about the remaining three members battling their personal demons so they can reunite for one last concert. Each of the three short levels features the members being interviewed and talking about their issues.To this end, the action on the screen reflects their struggles. One of the members is battling anger issues, so you have to solve puzzles to put out flames. Another is fighting depression, so you have to solve puzzles that light up the darkness. You do this by controlling the spirit of the lead singer, who flies around a dreamlike world. As I said, though, neither the narrative nor the puzzles are enough to carry the game. While The Forest Quartet features an interesting way of telling you what the members are feeling  and I dont want to downplay this, since the voice acting in those interviews sounds incredibly natural and realistic  you only get the barebones of a story, which wasnt enough to make you care about any of the characters, nor did it tell you why or how their late lead singer helped them fend off those demons.Similarly, none of the puzzles are even remotely challenging. I understand that the game didnt want to distract too much from the story, but most of the time the puzzles were so linear you didnt even have to think about what you were doing. During the 90 minutes or so that it took me to finish the game, I can think of two points where I was stuck: one was when the game glitched and a necessary part of a puzzle vanished into thin air, and the other was when I missed the path forward because it was too dark. In both cases, all I needed to do was start the game from my last checkpoint and my issue was resolved. If the gameplay had been a little more challenging or the story a little more engrossing, it might have been enough to make me forget about the problems with the other part of the games/story equation, but as it stands, it just left me feeling a little bored.Even from an aesthetic perspective, The Forest Quartet leaves something to be desired. The visuals are okay, and making the ghost of the lead singer a beam of light (and occasionally butterflies) is sweet, but there arent any areas of the game that are very memorable. And for a game about a band, the music is awfully forgettable. You dont really hear the bands music until the very end of the game  which may be part of why I struggled to connect to the story  and when you finally do, its nothing special.I feel like a heartless philistine for saying any of this  as I said up top, The Forest Quartet clearly has its heart in the right place, and any game that gets people thinking about overcoming their own demons is a good thing. But as a game, theres just nothing interesting here.", "date": "January 24, 2023", "grade": "B-"}