{"name": "Asdivine Menace", "ref": "https://gaming-age.com/2020/06/asdivine-menace-review-for-nintendo-switch-ps4-xbox-one/", "text": "As Ive written so, so, so many times before, you dont get a lot of variety from KEMCO RPGs. Truth be told, the only reason Ive stuck with them this long is because theyve been consistently released on the Vita, and Im nothing if not a sucker/completionist. Asdivine Menace marks my first time playing any of the Asdivine games  and any KEMCO game  on a non-Vita platform. It wont surprise you to learn that the experience is exactly the same, regardless of what platform you play it on.After all, were talking about games that draw pretty much exclusively from late 80s/early 90s JRPGs. (Occasionally theyll take tentative steps towards 3D graphics, but those havent gone well.) Its not like they need to be played on powerful machines to get the full experience. What you see here is what you couldve gotten on pretty much any platform in the past few decades.Not only is Asdivine Menace another KEMCO JRPG, its also the fourth game in the Asdivine series, which means you really, really should know what youre getting here. You play as a god whos irresistible to the ladies despite the fact hes kind of a jerk, and hes wandering around his creation for some reason to do with a great evil. Along the way he gets into turn-based battles  and lots of them, it should be noted. I had the battle frequency set to normal, and it felt like I couldnt move my characters more than a few steps outside of a village without tripping off some battle. Youre allowed to make the fights automatic, but given the sheer number of them, it doesnt seem like it makes a huge difference.The truly bad news about Asdivine Menace, though, is that there are microtransactions. This isnt the first KEMCO game to feature them; I think that would be Wizards of Brandel. However, Brandel at least made up for that by being surprisingly funny (even if I dont know if that was wholly intentional). Asdivine Menace isnt, and it doesnt have anything else to make up for the fact its trying to hit you up for money on top of paying for the game  and it even unironically talks that up during one of the many dialogue scenes.As Ive always said, KEMCO RPGs exist within a pretty narrow band  theyre never great, but theyre never terrible. Theyre really just the same game repeated dozens of times with minor tweaks, and Asdivine Menace is no different. As far as Im concerned, however, the microtransactions are a step too far, and youre probably better off getting one of the other KEMCO games that falls closer to the good-ish side of the spectrum.", "date": "June 1, 2020", "grade": "C-"}