{"name": "Balthazars Dream", "ref": "https://gaming-age.com/2020/05/balthazars-dream-review-for-ps4-ps-vita-switch/", "text": "Balthazars Dream starts out so promisingly: you get to choose which dog you want to play as. Even as someone who falls resolutely in the cat person camp, Im not going to turn up my nose at a game that gave me the choice of playing as a pug, a German Shepherd, or a border collie (to name just a few of the options).Unfortunately, its all downhill from that point on, as technical and control issues mar what otherwise could have been a pretty competent platformer.For starters, jumping is a little inconsistent. Sometimes your pup can leap across huge chasms, while other times, they can barely move forward, regardless of how much youre pressing the D-pad. On top of that, you sometimes have to factor in the pups fright level (for example, when they get spooked by a vacuum cleaner), only its never clear what the fright will do to them  sometimes my dog just stood there, seemingly unaffected by the passing vacuum, while other times the nearby vacuum sent the dog immediately jumping to its doom. Platformers are challenging enough when there are clear, consistent rules; without them, they become impossible to enjoy.Mind you, even if they had been consistent, I think technical problems still wouldve ended up dragging this game down. Save points were the obvious  and most frequent  example. In theory, you can use fire hydrants as a save point. In practice, I never could tell when the game would let me use any given hydrant, and it ended up being total, random luck. There were also issues any time it switched over from dialogue between the dog and his boy to action, as thered be a moment where everything would freeze up for a second. Unfortunately, the freeze was never immediate, and usually allowed you to take a few steps, so if you happened to be moving in that moment, youd suddenly jump forward  which, again, is a major problem in a platformer.The most annoying parts, though, would be when I would get stuck in impossible situations. There was the time I got trapped by a vacuum clear, and could neither jump away from it nor intentionally walk off a ledge. Instead, my pup was simply trapped until I quit and restarted from the last save point (which, annoyingly, was quite a ways back). Similarly, there are tables that occasionally serve as steps to higher platforms. These tables drop almost immediately after you touch them  and much to my chagrin, one time I got trapped between a bunch of tables, all of which fell down any time I grazed their legs, which, again, meant I had to quit out and restart.Actually, scratch all that: the most annoying part of Balthazars Dream is that a lot of care and attention went into it, and with a few tweaks it could have been much better. The way items like hydrants and vacuums play such a key role show a real commitment to the dog theme, and the overarching narrative  about a dog sitting at the hospital bed of his master in a coma  couldve been heartwarming.Instead, though, youre left with a game that cant get out of its own way. In the end, it doesnt matter how cute Balthazars Dream couldve been; when you have a platformer where the jumping is a pain, no amount of adorable pups will save it.", "date": "May 21, 2020", "grade": "C+"}