{"name": "Ghost Sweeper", "ref": "https://gaming-age.com/2020/05/ghost-sweeper-review-for-xbox-one-switch-pc/", "text": "You dont need to look very hard to see where Ghost Sweeper got its inspiration. Its basically Solomons Key, only with slightly updated graphics and gameplay.Now, theres nothing inherently wrong with being wholly indebted to an 80s puzzle-platformer. Its hardly the most original thing, but Im not going to judge people for love letters to their influences.Its just that lifting everything wholeheartedly from a 30+-year-old game and then slapping a new coat of paint on it doesnt make for a particularly interesting experience. The biggest problem with Ghost Sweeper is that its boring and repetitive. There are plenty of great games that borrow heavily from the 8-bit era, but theyre great because they do something interesting. This gamedoes not.A big part of why it doesnt is that it feels incredibly clunky. You have to build a path around levels, picking up a key along the way, and all the mechanics feel incredibly dated. Your character can jump, but not high and not far. They can also create and destroy blocks to help them climb around, except because your characters movement is so clunky, and the levels are so poorly designed, the often feel more like obstacles than helps.I should also note that the new coat of paint I mentioned two paragraphs up is pretty poorly done, too. Rather than embracing its retro heritage and going all in 8- or 16-bit graphics, or trying to update the games look so that it feels a little more modern, instead its just plain ugly. While the music fares a little better  its as spooky as youd hope for from a ghost-themed game  its still not enough to redeem everything else here.Honestly, I cant figure out why anyone would want to buy Ghost Sweeper. I mean, its a free phone game (with in-app purchases, of course), and, better still, you can also play Solomons Key itself in your browser right now. Im all for supporting indie games, but when they do as little as Ghost Sweeper does to build on their inspirations, theres really no point to playing them.", "date": "May 18, 2020", "grade": "D+"}