{"name": "Moons of Madness", "ref": "https://gaming-age.com/2020/04/moons-of-madness-review-for-ps4-xbox-one-pc/", "text": "A Lovecraftian horror game? Well, theres something new. I wonder what it will be like?Okay, that was needless snark in that last paragraph. While Moons of Madness follows in the footsteps in other recent games that draw on the works of HP Lovecraft (particularly Conarium), I dont think theres any denying it has substantially higher production values than any of them. Even if those games I linked in the previous paragraph were, to varying degrees, alright, none of them really stand out in my memory as being particularly well-made. Moods of Madness, by contrast, looks very nice. Everything looks crisp and clean, and, at least from a visual perspective, it delivers on its promise of being a cinematic experience.Pity, then, that the gameplay is so tedious. You spend a huge chunk of time here carrying out menial tasks, and many of them seem like theyre as drawn out as possible. You dont just go to the canteen to get a cup of coffee, you go to the canteen, pick up your cup, insert it into the coffeemaker, turn the coffeemaker on, fill your cup, take it out, drink it up, and do it again  while also pausing to eat dehydrated food. You find that a room has flooded, so you dont just have to turn the sprinklers off and drain the room, you have to wander through hallway after hallway, occasionally adjusting screws and knobs, finding canisters, manually turning off sprinklers, and then inserting the canisters into a machine and adjusting their flows so that everything drains properly. You dont just put on a spacesuit and go outside, youwell, you get the picture. Any time Moons of Madness has the choice of making players take one or two steps to carry out a task, and making players take half a dozen or more steps to carry out a task, it opts for the latter. It may be the more realistic option, but it really drains away the dramatic tension.And to be sure, there is dramatic tension to be found. The game opens with a creepy walk through the ravaged halls of your Mars base, and culminates in a moderately frightening (if, in retrospect, somewhat predictable) jump scare. Even if nothing else quite matches up to those opening moments, Moons of Madness still has the odd moment of genuine creepiness  but nearly all of them lose their impact thanks to the fact youve had your senses dulled by the seemingly endless repetition.Given how nice it looks, I suspect that if you were to strip out most of Moons of Madness gameplay  such as it is  you wouldve been left with a very solid (if somewhat short) horror walking simulator. Instead, all you have here a somewhat scary horror game that manages to drown itself in a whole lot of pointless busywork.", "date": "April 27, 2020", "grade": "B-"}