{"name": "Epic Word Search Collection", "ref": "https://gaming-age.com/2020/04/epic-word-search-collection-review-for-ps4-ps-vita-switch/", "text": "Pretty much everything you need to know about Epic Word Search Collection is right in its title: it features a couple of word searches, and all of them are pretty epic. Its not exactly complicated.That said, I dont think the name properly conveys exactly how massive these puzzles are. There are only four word searches included in Epic Word Search Collection, except all four are enormous: each one contains approximately 1,500 words. That, quite frankly, is insane. The game tries to make itself seem a little more digestible by breaking each mega-puzzle down into grids with sub-puzzles in each (i.e. the Food puzzle has a baking section, and a meat section, and so on), but even so, were still talking about puzzles with 100 words in them. 100 word puzzles would be sizeable in their own right, and this game has sixty-four of them.As you might expect, there are some challenges in translating puzzles of that size to the screen. Only so many letters can show up on your screen at any one time, and even with the word list constantly updating to tell you which words have letters in the puzzle portion youre viewing, youll frequently run into the challenge that youll only see a single letter from most of those words.On top of that, even with the Vitas touchscreen, highlighting longer words is still a challenge. Theres no easy way to scroll and highlight at the same time with your finger, which means that while the shorter words are no problem, the longer ones are a little more difficult. You have to use the D-pad, which is a solution, but a pretty inelegant one.Nonetheless, if were grading Epic Word Search Collection based on how well it delivers, well, epic word searches, I dont think theres any disputing that it does what it sets out to do. It may not be replace the old pen and paper variety, but if youre looking for a good time-killer  and these days, we all are  itll do the trick.", "date": "April 22, 2020", "grade": "B"}