{"name": "Gigantosaurus: The Game", "ref": "https://gaming-age.com/2020/04/gigantosaurus-the-game-review-for-nintendo-switch-ps4-xbox-one-pc/", "text": "Ive got to admit that Im not at all familiar with Gigantosaurus. The only kids in my life are a niece whos into Paw Patrol and Disney Princesses, and a nephew whos too young to care all that much about TV, so I dont know anything about (re-checks Wikipedia) Mazu, Tiny, Bill and Rocky.So I cant tell you how faithfully Gigantosaurus: The Game is to the series lore. I can, however, say that if you do have a young one whos into the series  or even a young one whos just getting into video games  then it seems like this might be a good fit. Its a 3D platformer with a little bit of kart racer mixed in, and, for the most part, its easy enough that even the youngest aspiring gamers should be able to get the hang of it without too much difficulty.Thats not to say they wont be challenged at all. There are enemies to be found here, whether were talking about aggressive bees, scary (but not too scary!)-looking raptors, and other baddies that mean theres the gentlest difficulty curve possible. Every level is built around recovering dino eggs, and theyre scattered enough that theres lots of game here to play, but also plentiful enough (and helpfully marked on your map) that you wont be spending hours fruitlessly searching for invisible eggs. Moving around is a breeze, for the most part (with one exception Ill get to shortly), which is nice, because the map is actually surprisingly large.Theres not too much to say about the karting side. You race between levels, and, as near as I can tell, they dont seem to have anything to do with the rest of the game. Theyre there, and theyre okay. As is the case with the platforming, the karts control pretty solidly, and the levels are forgiving without being too easy.The bad news about Gigantosaurus: The Game is two-fold. First, even if its better than your typical licensed shovelware, there are parts where it seems like the game isnt even trying. Scenery will pop in and out of existence right in front of you, which makes it a pain when youre trying to move around and you cant because an invisible tree is in your way. Its a common enough problem that I noticed it, but not so big a problem that it actively ruined my enjoyment of the game (and, for what its worth, I mostly enjoyed it).The bigger problem with Gigantosaurus: The Game is more of an existential one. Its fine for what it is  but, if youre looking for a good kart racer or 3D platformer, there are better options out there. On the Switch alone, theres Super Mario Odyssey, of course, but also plenty of other decent games of this ilk. Even if youre thinking strictly in terms of PS4 or Xbox (and I kind of am, since I liked this game enough that I want to pick it up for my niece to follow up on my Paw Patrol and kids PS4 controller at Christmas), there are still games like Yooka-Laylee or Tearaway that are higher quality.But that doesnt mean you shouldnt get your kids Gigantosaurus: The Game ever, only that there are other games you should get for them before this one. Its hardly a must-play, but if youre looking for ways to get your kids hooked on gaming at a young age, this one might be the way to start.", "date": "April 15, 2020", "grade": "B"}