{"name": "Final Fantasy VII Remake", "ref": "https://gaming-age.com/2020/04/final-fantasy-vii-remake-review-for-ps4/", "text": "I still find myself surprised that Final Fantasy VII Remake has actually seen the light of day, and even more surprised that it also ended up being pretty darn good. I also love that the word Remake doesnt just apply to the visuals, music, or battle system, but also to the overall world-building, plotline, and characters youll encounter over the course of 35 to 40 hours spent with the game. Regardless of how familiar you are with the original PS1 Final Fantasy VII, youll find yourself being surprised by the Remake throughout, and for me at least, I found those surprises were often a lot of fun.One thing that Final Fantasy VII Remake does really well is that it sort of eases you into the new stuff. The initial chapter, wherein our heroes storm their first Midgar reactor, essentially plays out like the intro for the first game. Cloud and Barrets introduction, their antagonistic relationship, is pretty much the same throughout these early moments. And while the combat system is certainly different, Final Fantasy VII Remake doesnt necessarily overwhelm you at the onset of the game. Its easy to slash your way through the cannon-fodder enemies early on, and you wont really need to put it all together until the first major boss fight that caps off this intro. If youve played the demo then youll know what I mean, but if not, youll find yourself picking up on the action-oriented play style quickly enough.Thankfully, the action focused combat is also a lot of fun. Being able to freely switch between party members, building up their ATB gauges to perform special attacks or cast magic, and then pummeling enemies until theyre staggered (and then pummeling them some more) never gets old. Boss fights can be suitability challenging, but never feel particularly unfair. And if the storyline has removed a character from your party temporarily, you can still switch out gear and materia without the party member present, so youll rarely be at a loss when going into a fight.Visually, Final Fantasy VII Remake tends to be outstanding. Theres a lot of really beautiful sections of the game despite the Midgar slums making up the majority of the available zones. The character models are all extremely detailed, well-rendered, and with excellent animation work behind them. Seeing these familiar characters presented in such a way is a real treat for long-time fans. My only complaint is the occasional issue with texture loading, youll run across doors or other objects that are clearly behind in loading up a texture, which often stands out even more when characters are standing next to a blurry sign or other environmental objects.Likewise, the soundtrack to Final Fantasy VII Remake is equally amazing. Im not sure that Id say the original soundtrack is my favorite in the series, but theres been some real work done on the music for this game that helps to elevate important story moments throughout. The small changes and mixes are just as noticeable, helping to drive home quiet moments just as much as the big action set-pieces. Also, the English voiceover work is extremely well done. Characters like Jessie, Tifa and Aerith probably benefit the most overall, but even Cloud has his moments. I never would have thought that Id care much for the subcast that made up Avalanche in the original game, but the writing and VO work makes these characters feel just as important as the main cast.As far as the actual story goes, again, this isnt quite the Final Fantasy 7 that you may know and love. While only covering the Midgar section of the original game, most events have been greatly expanded on, with a number of changes made throughout. There are even new characters mixed in, like Don Corneos henchman Leslie, or Madam M from Wall Market, that have surprisingly large roles to play.While the early chapters of the Remake are pretty much in line with the original game, youll find that the game toys with your expectations quite a bit. And while I certainly dont want to spoil the ending for those that havent had a chance to play it yet, lets just say it certainly takes some liberties with the source material. Not all of those changes will be appealing to everyone, but I loved all the little twists and turns and Im very curious to see what the next entry becomes. I would argue that there is almost a Stephen Kings Dark Tower-esque feel to the concept here that I can get behind, assuming that future chapters playout in a similar fashion.So yeah, I really found myself loving Final Fantasy VII Remake, to a degree that Im likely going to go back through it on Hard mode (which unlocks post-game) and try to platinum it if I can find the time. Even after 40 hours spent with it Im finding it hard to pull myself away from the game, and I think theres a good chance youll feel the same way too.", "date": "April 14, 2020", "grade": "A"}