{"name": "R.B.I. Baseball 20", "ref": "https://gaming-age.com/2020/04/r-b-i-baseball-20-review-for-xbox-one-ps4-switch/", "text": "Last years edition of R.B.I. Baseball made it seem like the franchise had, at long last, turned a corner. After years of being mediocre at the best of times, RBI Baseball 19 was shockingly competent. As such, I went into RBI Baseball 20 with moderately high hopes.Turns out, I should have tempered my expectations a little bit. While R.B.I. Baseball 20 is clearly better than pretty much every game in the series between its 2014 relaunch and 2018, you can see some of the bad habits that those games featured returning after being mercifully absent last year. The ball physics, for starters, are bizarre. Youll notice this most in Home Run Derby mode, where launch distances are insane (430 feet for a ball that barely scrapes the outfield wall, and some balls being allegedly pulled 600 feat down the line?) and balls that dont make it out on the fly still tend to make it over the wall on one hop. Bizarrely, the game seems to have tried to compensate for this in the regular game modes (which are limited to Franchise, Playoff, and Exhibition), where balls seem to stop dead the moment they hit the ground. Regardless of how you play, however, you still never totally know how a ball is going to react either off the bat or once it hits the ground.Theres also no online multiplayer component, at least on the Switch version (though it is present on Xbox and PS4). While Im not someone who plays online that often, even Ill jump online for a Home Run Derby in MLB The Show, so not allowing that here is a missed opportunity.R.B.I. Baseball 20 also shows that the series hasnt quite figured out how to make its player movements look natural. Youll notice this every time a player has to throw across the diamond, or when they try to field a ball. That said, its definitely better than it used to be, and it was a pleasant surprise to discover that fielders now move independently of each other  no longer do they all run off the field in sync, or chase after a ball in sync, or do anything in sync. Mind you, the flip side of this is that players tend to ignore the ball unless theyre directly involved in the play, so this sudden independence only goes so far in the right direction.You can see that the game tried to add a little more realism in other parts of its arcade experience, but not quite as successfully. There are new controls this year for both pitching and hitting, and I dont think they quite serve the intended purpose. On the hitting side you can now hold the swing button down for more power, except, as far as I can tell, it wreaks havoc with your timing, it looks weird (your batter starts their swinging motion, and then freezes), and it doesnt add all that much power to your swing. Pitching is a little better, since you have more control over your pitch selection, except its still not very precise  and, whats worse, the classic pitching controls seem mostly useless, with pitches all seeming virtually the same as each other.There are, however, some areas where R.B.I. Baseball 20 has unquestionably improved. Load times are significantly better than they ever have been in the series. Where time used to drag interminably between innings, now the switchovers are fast and painless. Likewise, the game now allows you to skip home run trots, which is only a small step, but a welcome one.If were talking about things like reduced load times as a big plus, I think its clear that R.B.I. Baseball 20 isnt the (relatively) smashing success that R.B.I. Baseball 19 was. But it still points to the game making an effort to improve, which clearly wasnt the case up until last years outing. Whether that will help the series next year when MLB The Show stops being a Sony exclusive remains to be seen, but for now, at least it means that anyone who wants a baseball game outside of the PlayStation ecosystem wont have to suffer through a game thats a complete write-off.", "date": "April 10, 2020", "grade": "B-"}