{"name": "Paper Cut Mansion", "ref": "https://gaming-age.com/2023/01/paper-cut-mansion-review-for-nintendo-switch-pc-playstation-xbox/", "text": "If we were to judge games solely by the amount of thought and care that went into them, Paper Cut Mansion would be an easy GOTY candidate. I mean, Im sure most games have a lot of care put into them, but in Paper Cut Mansions case, its especially obvious because of its papercraft-style graphics. It genuinely looks like someone went to the trouble of cutting out every single piece of the game and pasting it all together, which makes it easier to imagine how much work mustve gone into making it. (Disclaimer/aside: I have no expertise on this whatsoever, so I have no idea how much more work is involved in making a game look handmade compared to, say, making it look like voxel art, but because papercraft in real life is more work, my brain is tricked into thinking the same goes for video game papercraft.)On top of that, theres clearly been a lot of thought put into the games world and its systems. Its a roguelite where your character, Toby the police detective, has been turned into paper and is exploring a mansion for clues as to how to get out of it. The game provides you with a clue board, and you have to try to piece everything together  and, thankfully, despite the fact that when you die you lose everything and need to start over, the clues remain and allow you to piece the solution together.To add to the creativity, theyve also added three different levels of reality within the mansion. Theres a NeoCortex dimension, where you search for clues and solve puzzles; theres a Reptilian Complex dimension, where you fight (or run away from) monsters; and theres a Limbic System dimension, where the focus is surviving against the elements as the mansion suddenly turns icy cold. Its a pity, then, that despite all the thought that went into creating Paper Cut Mansion, the developers forgot the most important thing: making it fun to play.To be fair, part of the problem may just be Switch-specific. The hardware struggles to run the game, with plenty of stuttering, especially when you transition from one dimension to the next. It diminishes the creepy vibe the game is going for when everything freezes for a second or two before starting up again. Further, everything feels sluggish, whether were talking about Toby slowly moving around the screen or the on-screen cursor seemingly taking forever to point to objects youve picked up. The bigger problem, though, is that the gameplay gets really tedious very quickly thanks to how repetitive it is. Its great that, in theory, every run through is different  or it would be if you didnt run into the same characters explaining the same mechanics to you over and over and over again. Likewise, even if the rooms themselves may vary, the quests and the objectives dont, so youll still feel like you arent seeing anything new after a couple of runs. Its really too bad that the gameplay doesnt come anywhere close to matching the inventiveness, because, as I said up top, Paper Cut Mansion is just brimming with ideas. Theres a huge gap, unfortunately, between coming up with something cool and making it work, and unfortunately its not a divide that this game is able to bridge.", "date": "January 11, 2023", "grade": "C"}