{"name": "Nerved", "ref": "https://gaming-age.com/2020/03/nerved-review-for-ps4/", "text": "Ill give Nerved some credit: it doesnt do a bad job of creating a spooky atmosphere. Seeing as its a horror game, that means its halfway to being a good game.Unfortunately, it doesnt do much else, so halfway to being a good game is about as far as it gets in that direction. In fact, I strongly suspect that the reason they were able to create a spooky atmosphere is the same reason that the rest of Nerved isnt very good: a notable lack of technical polish.To make up for that on the graphics side, they went back to the same trick that so many horror game designers from twenty years ago used: they shroud everything in fog. You can barely see more than a few feet in front of you, which is a fantastic way of making everything feel tense and nerve-wracking. You never know when some monster is going to come out of nowhere and kill you. Like I said, its a very solid base upon which to build a horror game.Unfortunately, to be worthwhile, a horror game needs more than a spooky atmosphere. It needs things like a plot, Nerved is distinctly lacking in. Case in point: heres the description straight from the PSN storefront: Nerved is first person horror game, about a paranormal investigator couple and their latest adventure in the Bitterwood Forest. This last case that they have chosen to persuade, will deliver a charnel impact on the couples fate, both personally and professionally.I have no idea what a charnel impact is, but from the rest of it you can tell that youre playing as one half of a paranormal investigations team. Exceptthe other half only shows up intermittently during the opening minutes of the game, before the plot sets into motion and she disappears. This would be fine, except a) when she does appear, shes like Creepy Watson, hovering right next to you no matter where you go, and b) at other times, shes not there at all, but you can hear her speaking to you as if shes right next to you. Im not sure why she randomly disappears and reappears, but Im pretty sure its not intentional.Whats more, when she is around, you get a first-hand look at more of the games lack of technical polish (or, to be less nice about it, the total lack of skill involved). Basically, she lookswrong. Like, kind of like a person, but at the same time, not at all like a person. Describing it as the uncanny valley doesnt do it justice, because that implies the game is somewhere between clearly reality and clearly a game, and she doesnt look anything like a person, and no one would ever mistake her for one. The best comparison I can make is that the characters in Nerved look like what would happen if really ugly 2D models were somehow turned into 3D renderings.A side effect of this is that when the monsters do start showing up, they hardly look much worse. Theyre also vaguely humanoid, which would be a lot more unsettling if it werent for the fact that your love interest looks just as off-kilter.For me, though, the real lowlight of Nerved was in the sound. Early on, theres a scene where the main character is supposed to be getting attacked by some mysterious force, which sets the events of the rest of the game into motion. Unfortunately, the voice acting is so bad that the main character sounds more like hes upset that hes stepped in something gross than he sounds like hes being savagely beaten. Likewise, the sound effects that accompany his beating are unintentionally hilarious, sounding kind of like a boot stepping in mud repeatedly, rather than whatever is going on during that scene.With all these underlying technical flaws, it should come as no surprise that the gameplay isnt particularly well thought out either. Right off the bat, for example, youre told you need to go find your cabin, except the game doesnt give any indication of where that is. Its only once you start randomly pressing buttons that you figure out how to get a map on the screen. Likewise, the game never tells you how to run, so the first time a monster starts at you, youre a sitting duck (that mostly goes for when you can run as well, but at least once you know how to do it, the attacks come less frequently).In fact, Id say it was almost like clockwork: every time Nerved wanted me to do anything, it wouldnt actually say how to do it. In some circumstances, this could be because the game was trying to mirror the helplessness of the character on-screen. In this case, though, I think it was just some combination of forgetfulness and a lack of know-how.And yet, even with all these flaws, as I said up top, I have to give Nerved credit for doing one thing surprisingly well  creating the right environment for a horror game. No matter that literally every other aspect of it is bad, it still does that one thing right. Its not enough to make the game worth checking out, but it is enough to say the game isnt a complete failure.", "date": "March 27, 2020", "grade": "C-"}