{"name": "MLB The Show 20", "ref": "https://gaming-age.com/2020/03/mlb-the-show-20-review-for-ps4/", "text": "Even though MLB The Show is far and away my all-time most-played franchise, Ive got to admit that I was feeling kind of indifferent towards the game going into into MLB The Show 20. Some of this, of course, is because, like every other sports league in the world at the time of this writing, we have no idea when games will start again, which makes it hard to get that excited about baseball.Even before that, however, I was feeling kind of meh on the whole thing, in part for reasons largely outside of the MLB The Shows control. The current MLB commissioner doesnt seem to like the sport very much, and seems set on pushing the league towards some kind of confrontation with players. The leagues treatment of minor league players is abysmal, and the way theyre trying to reduce the number of minor league teams seems counter to getting more eyeballs on the game. I wasnt even going to be able to watch many games this year, on account of the fact my favourite team decided to black out their games across Canada. Couple all that with the fact that MLB The Show games seen to follow a pattern of only making substantial improvements every other year  with some big new modes debuting in last years game  and you can see why I may have gone into MLB The Show 20 with a distinct lack of enthusiasm.What sustained my lack of enthusiasm even after I sank several hours into the game, though, is that MLB The Show 20 feels even more like a roster update than usual. This shouldnt come as a huge surprise: after all, the top new feature on the games own website is Gameplay Engine & AI Overhaul. Thats important, I guess (and, to be fair, the ball does seem to come off the bat better than it did last year), but it hardly seems like the kind of thing you hang your hat on.But for the most part, MLB The Show 20 is more tweaks than anything else. You can set up a custom online league, and Diamond Dynasty has added in another mode, Showdown, to get you to spend more money in-game offer you more opportunities to build up your teams. If youre into those things  and, truth be told, Im not  thats cool, but neither does anything to make MLB The Show 20 feel like the kind of really big step forward it needs.In fact, as far as Diamond Dynasty goes, I was kind of dismayed to see that last years Moments mode  where you get to play famous moments in baseball history  took a step back. Last year, the game made an effort to kind of tie things in to baseball history. This year, by contrast, it just seems lazy, simply dumping one or two famous players into the modern rosters, making the screen black-and-white if its a particularly old moment, and calling it a day. If you were being charitable, I guess, you might see it as the game trying to settle the debate of What if old players like Mickey Mantle were competing in the modern era? Would they be as good? More likely, though, youll just see it as the game throwing in a new mode last year and then keeping it in just out of habit.You can see the same kind of copy-paste jobs all over MLB The Show 20. Road to the Show  which, up until last year, was always my most-played mode  is, as far as I can tell, identical to last years version, notwithstanding promises that this years version is more RPG-like than ever. Maybe Ive just played far, far too much of RTTS over the last decade, but I cant say that I noticed anything all that new or different (or interesting).The Franchise mode is equally frustrating. The game makes a slight nod towards innovation by letting you replace an existing team with a new one of your own creation, but youll soon find that its nowhere near as fun as it seems. There are some tools for customizing the look of your new team, but if, say, you wanted to replace the Rays with the Expos, youd soon see that no one in the games community has quite figured out how to perfectly recreate their iconic logo  and, unfortunately, the game didnt feel like simply including a few logos out of the box. On top of that, instead of allowing you to create a new stadium, youre stuck in the same park of the team youve replaced, which lessens a lot of the appeal. Personally, Im still wishing MLB The Show would take a page from other sports games (or even one of my all-time favourite games, All-Star Baseball 2004) and let you start a full expansion mode and build your team from the ground up, but that; I guess, isnt in the cards.I will grudgingly admit, at least, that this years March to October is a step up from last years version. While its mostly the same  you play key moments over the course of a season  at least this year you get to play around with the rosters a little, setting your trade targets and identifying where you want your team to improve. Its not exactly a huge step up, but as someone who loves roster tinkering, I appreciate that I could at least do a bit of it.One interesting mode, however, doesnt make for a must-play game. Dont get me wrong, MLB The Show 20 is still very solid. I have no doubt that itll probably be my most-played game of this coming year, like it has been every year for the past ten years or so. Its a good enough game this year, like it was a good enough game last year, like it was a good enough game in 2018, like Im sure itll be a good enough game in 2021 on the PS5. But considering that MLB The Show was once the gold-standard for sports games, simply being good enough seems like a lot of wasted potential.", "date": "March 19, 2020", "grade": "B-"}