{"name": "Where Angels Cry: Tears of the Fallen", "ref": "https://gaming-age.com/2020/03/where-angels-cry-tears-of-the-fallen-review-for-nintendo-switch/", "text": "The thing that surprises me most about Where Angels Cry: Tears of the Fallen isnt that its bad. After all, a couple of months ago, I played Eastville Chronicles: The Drama Queen Murder from the same publisher, and calling that game mediocre was being a little charitable. That their next outing is no better would be about what I would have expected.No, what really shocks me is that Where Angels Cry is noticeably worse, even though, in a lot of respects, it tries so much harder to be better.For example, it tries to have animated cutscenes. The thing is, the animation is terrible, and the characters all look bizarre. You know how some of the best games come so close to escaping the uncanny valley? Where Angels Cry is the opposite of that  the characters here generally look like theyve just started the downwards descent into the uncanny valley, and the results are horrifying.Theoretically, the voice acting should be a little better, since its people speaking rather than not-so-great animators trying to draw people. The thing istheyre not. Maybe its just because the dialogue is so wooden and stilted, the voice actors cant help but sound like theyre aliens using human speech for the first time. In a way, I suppose, this fits with the disturbingly humanoid characters, but its still very unsettling, and not in the way the developers probably intended.Given that Where Angels Cry is a hidden object game, its kind of a given that the graphics and voice acting are no better than average (and thats being generous). Youd think, however, that at least the hidden object puzzles would be tolerable. But, somehow, on that score, youd be wrong. The puzzles are few and far between, and when they do show up, theyre very short and very basic, and even by the standards of the genre, theyre ridiculously easy.Theyre coupled with minigames that are equally unchallenging. You put statues in order, or you move a boat from side to side, or you do whatever other boring little tasks the game can come up with, and none of them add anything to the overall experience. As someone whos averse to huge challenges in games, Im not saying I want Where Angels Cry to become impossible, but it would have been nice for the game to show a little bit of life somewhere.Instead, we have a game that looks awful, sounds just as bad, and whose boring gameplay cant make up for those drawbacks. Even if you go in with fairly low expectations, Where Angels Cry wont manage to come close to clearing that low bar.", "date": "March 2, 2020", "grade": "D+"}