{"name": "Far-Out", "ref": "https://gaming-age.com/2020/02/far-out-review-for-xbox-one-pc/", "text": "Its kind of weird that Far-Out has such a goofy-looking Microsoft Store image, because that doesnt represent what the game is like at all. As near as I can tell  which isnt much, as Ill explain shortly  its a tough survival game with nothing in the way of lighthearted comedy, which is the exact opposite of what that picture seems to be going for.Admittedly, its quite possible that I missed out on some laughs, seeing as I spent most of my time with Far-Out not having any clue what to do. It promises that its going to give you a really old-school challenge, with no map arrows, no one will lead you and tell you what to do. This is entirely accurate, as evidenced by the fact that pretty much everything I did in this game happened either by chance or because I resorted to a walkthrough video to tell me the most basic information imaginable.In my defense, Far-Out is incredibly dark  literally. I could never see where I was going, which meant I spent most of my time stumbling around, pressing whatever buttons I could find in the hopes they would lead to something. This, in itself, was also a problem, since not only could I not see where I was going, the act of pressing buttons is absurdly hard here. You have a tiny little reticule that doesnt like to stay in one place, and the only way to press a button is to be aiming your reticule directly in the middle of it. While that may not have been an issue for the game when it was first released on PC a couple of years ago, its much more of a challenge when you have a controller instead of a mouse.But back to the darkness for a moment: I know thats sort of the point, since you wake up alone on a spaceship with no knowledge of whats happened. Its a well-established horror/survival trope. But still, thats no excuse for making everything here as impossible to see as it is. When youre having to resort to tutorials in the first couple of minutes because essential keycodes are completely illegible, its probably a sign you need to improve your contrast and brightness options (or, at least, make them more legible).If you want a challenge, I guess that does the trick. But still, if its a challenge youre after, you should be getting it from whats going on in the game, rather than battling with basic settings. Far-Out may have a good game buried somewhere deep inside, but to get to it you have to fight through all kinds of poor design choices. Youre better off just replaying Alien: Isolation again, and getting a much improved version of what this game is trying to be.", "date": "February 24, 2020", "grade": "C-"}