{"name": "SEGA AGES Shinobi", "ref": "https://gaming-age.com/2020/02/sega-ages-shinobi-review-for-nintendo-switch/", "text": "The original Shinobi graced arcades way back in 1987. Most gamers, like myself, became familiar with it when it was ported to the Sega Master System a year later and may have never seen the arcade version. Well, thanks to the SEGA AGES line of games on the Switch, you can not experience this great game with some interesting additions!In Shinobi, you are Joe Musashi and you must rid the world of an organization known as Zeed. A bunch of children have been taken hostage in several areas and you must fight your way through hoards of Grunts and Ninjas to rescue them. The goal of each area is to rescue all of the children, make it to the exit of each area and eventually fight and defeat the boss. Once an area is cleared, you move on until you complete all areas. You have a variety of weapons to help you through each area, such as your Shurikens and Ninja kicks, which are your main weapons, but as you rescue the hostages you power up with a sword (for close range attacks) and a pistol, which deals double damage. Rescuing all hostages in a stage rewards you with a bonus stage where you have to defeat all the ninjas with shurikens in a first person perspective. Beating all the Ninjas awards you with Ninja Magic that you can use in the next stage which usually consists of a screen clearing attack, or can be used to deal massive damage on a boss.The SEGA AGES port is handled by M2, who are masters of recreating these classic games to modern consoles. The emulation is spot on, everything looks and sounds just like it would in the arcade. This port contains some added features like the ability to play in widescreen (if you are into that), and a variety of screen boarders and scanline options for that classic arcade feel. One border in particular has you playing the game on a digital version of the arcade machine. You can also play with just a black boarder, which is my preferred method, but I like that they give you some good options.One more feature added to this port is the AGES Mode. Here, Joe can take a few hits before he loses a life, and he also has increased attack power. This makes the game super easier for new players, since the original game has one hit deaths and a difficult level higher than most games of that era. Playing through this mode a few times will prepare you for the more challenging original mode when you are ready.M2 did a marvelous job porting Shinobi to the Switch. Everything feels like you are playing the original arcade game with nothing removed. The game has been ported to many platforms over the years in many forms. This one really does feel like the best port out of all of them, though as I found it hard to put it down long enough to write this review. The addition of AGES Mode is great for new players who have never seen or heard of this game before, but most classic gamers will prefer the challenge of the original. At $7.99, this is a no-brainer purchase for the Switch! A fantastic port of a fantastic arcade game, which you can pick up and play anytime. Sega, please keep these SEGA AGES releases coming!", "date": "February 21, 2020", "grade": "A"}