{"name": "Double Cross", "ref": "https://gaming-age.com/2019/01/double-cross-review-for-nintendo-switch-pc/", "text": "While were certainly not at a loss for 2D action platformers this generation, I think its still worth celebrating when a good one comes around, and Id classify Double Cross from developer 13AM as a good one. It carries a Saturday Morning Cartoon aesthetic to it that I appreciate, with a character design and storyline that feels like something slightly out-of-time, but in a way that this 80s kid can certainly enjoy. Its also fun, with some challenging levels, interesting mechanics, and a lot of variations between stages thatll keep your interest up throughout the campaign.You take on the role of Zahra, a member of RIFT, the Regulators of Interdimensional Frontiers and Technology, a task force assigned with patrolling various dimensions and making sure everything stays in relative order. At the onset of the game youre introduced to the various members of RIFT, their headquarters, and given a brief overview of how the group works. Things go awry from there, and Zahra is tasked with investigating the elusive masked villain thats working to destroy RIFT and sort of ruin Zahras life in general. Again, its very much in line with the classic cartoon motif of my youth, and generally the story is lighthearted and comical in a way I enjoyed.From RIFTs HQ, Zahra can access a variety of worlds via an interdimensional portal. Each world has its own unique environment, and typically features some sort of mechanic or gimmick that is exclusive to that world. Each world consists of multiple sub-levels, culminating in a final stage that unlocks when the previous ones are completed. You can switch between multiple worlds and the stages within whenever you please, allowing you to change up the order in which you complete them. Also, each stage has a number of stars next to it which dictates the overall difficulty, giving you a more guided approach if you prefer. Last but not least, every stage has items to collect that will help Zahra level up, giving her access to both active and passive skills that can be equipped into three different slots at once.One of the biggest tools in Zahras arsenal comes from the ability to grapple onto various points scattered throughout stages. From there she can launch herself forward, often chaining grapples together to cross larger distances, gaps, and other hazards. A lot of stages make use of this mechanic but in various ways, and often grappling will lead to hidden areas or shortcuts through zones. Its handled pretty well, even if there are moments of frustration due to limited control over which way Zahra is flung. Its all position based, so instead of dictating direction with the right analog stuck, Zahra is thrown forward based on where she was standing or falling prior to initiating the grapple. This is mitigated by slowing down time for a limited period when you initiate the grapple, but there are certainly scenarios where you miss in a way that doesnt feel entirely your fault.There are a few other quibbles I have with Double Cross, most of which seems to be technical problems that can likely be ironed out. Playing the Nintendo Switch version of the game, Id encounter the occasional framerate hitch along with the occasional freeze-up that would resolve itself, or get resolved by hitting the home button and coming back in without closing the game. These issues felt more prevalent in handheld mode than when docked, but certainly occurred both ways. They werent frequent, and thankfully the game never crashed, but the issues were certainly noticeable during the more intense platforming sections of the game. Again, ideally these issues can be worked on, but they are worth mentioning. Id also note that something about wall-jumping would occasionally feel off, when Zahra would be connected enough to a wall in order to slide down it, but for some reason wouldnt bounce off when the jump button was hit. This wasnt a consistent problem either, which made it a little more baffling to me.That said, I think theres enough charm and fun to be had with Double Cross to overlook the issues I had. The level designs are extremely varied and pretty smart, with fun puzzles that feel unique and make good use of the environments in each world. The grappling mechanic gets a lot of use, but in a way that feels fresh throughout the game. Id definitely suggest checking out Double Cross when you get a chance, and think youll find that its a 2D action platformer worth your time.", "date": "January 10, 2019", "grade": "B+"}