{"name": "Kentucky Route Zero: TV Edition", "ref": "https://gaming-age.com/2020/02/kentucky-route-zero-tv-edition-review-for-ps4-nintendo-switch-xbox-one-pc/", "text": "Kentucky Route Zero is the kind of game that leaves a lasting impression. Despite being a story-focused, text-driven adventure, the individual sequences youll encounter across its five different acts and interludes will absolutely stick with you. It does a splendid job of marrying its unique visual style to an eclectic, largely ambient soundtrack, introducing various themes and ideas that arent often touched on in gaming. All in all, its an absolutely stunning accomplishment by developer Cardboard Computer, and something that I would highly urge everyone to discover for themselves.On its surface, Kentucky Route Zero plays out like a point-and-click adventure game. In that aspect, its a little more akin to something like the Telltale series of titles in that it doesnt focus so much on puzzle-solving or item collecting, but more on interacting with different objects and characters. Doing so will unlock additional dialogue moments, observations from the various characters that join your group, and serve as a way of building upon the surreal setting of the game.While that might not sound overly compelling to folks that have played similarly styled games, I can honestly say that I doubt youve played anything like Kentucky Route Zero. It has one of the most stunning visual identities Ive ever seen in a game. The way it makes use of background and foreground elements to frame scenes and create familiar yet almost supernatural locations is something that stood out to me the entire time I was playing. The atmosphere of the game is akin to a fever-induced David Lynch dream sequence, oftentimes jumping from one fantastical location to another in a way that doesnt entirely make sense, yet still somehow works.For example, the opening act of the game introduces you to Conway, a truck driver tasked with one last delivery of antique goods to an address that no-one has seemingly heard of before. When the game beings youre given an overhead map of roads and highways, just a bunch of white lines on a stark black background, with small wireframe icons that indicate landmarks as you move a wheel icon along those paths. Some locations youll have limited interactions with, prompting a bit of text and maybe a dialogue option or two. Other locations are a little meatier, like the home of Weaver Marquez, allowing you to step out of the truck and move around a bit.It doesnt take long for Kentucky Route Zero to pierce its own thin veil of reality, and before long youre embarking on a series of events that will guide you down the titular, tunnel-like Route Zero, introducing you to an increasingly odd cast of characters and castoffs that seem at ease with their unusual surroundings. As you progress through the various acts, youll come across a growing group of characters that move along through the story with you, picking up the reigns of Conways core task while embarking on their own individual journeys. Youll learn the individual plights and desires of these characters, largely centered around being on the brink of poverty and disaster, at odds with electric skeletal debt-collectors, small-town flooding, unemployment, broken families, death, grieving and more.As I mentioned earlier, part of what makes Kentucky Route Zero work so well is the absolutely amazing soundtrack and overall sound design of the game. I didnt start using headphones when playing until around Act III, but I would strongly recommend the use of headphones unless you have access to a solid home stereo system. There are a lot of really great background ambient noises throughout the different locations youll uncover that really helped immerse me into the world of Kentucky Route Zero, and theres a number of standout musical moments that honestly deserve your full attention. Kentucky Route Zero is a really remarkable marriage of sound and sight, unlike anything else Ive ever played.", "date": "February 3, 2020", "grade": "A+"}