{"name": "The Vanishing of Ethan Carter", "ref": "https://gaming-age.com/2020/01/the-vanishing-of-ethan-carter-review-for-nintendo-switch-ps4-xbox-one/", "text": "Mentally, Ive always slotted The Vanishing of Ethan Carter alongside games like Firewatch, Gone Home, and What Remains of Edith Finch  which is to say, walking simulators that show the very best of what the genre has to offer. Looking back at when I first played it, it was around the same time as Everybodys Gone to the Rapture, and just a few months before any of those other games. It naturally just kind of became part of that pantheon of genre highlights in my head, I guess.Heres the thing, though: whereas those games have stood up to repeated playings  in the case of Edith Finch, to spectacular effect  now that Im playing Ethan Carter again, if Im being totally honest, I dont totally get why I held it in such high esteem.Sure, it still does a good job of creating a creepy atmosphere. It may not look quite as sharp on the Switch as it does on other systems, but it by no means looks bad, and, besides that, this game isnt meant to be a graphical powerhouse. Its meant to be a mystery, and I found that the abandoned houses and big empty spaces that make up the game are every bit as mysterious as they were the first time around.The major difference that I noticed this time, however, is that the game does a lousy job of living up to its stated goal of being a narrative experience. Like, it says that right in the opening sequence that thats what the game is meant to be. And yet, unlike those other games I mentioned above that do a good-to-great job of telling a story, The Vanishing of Ethan Carter comes across more as a vague, disjointed idea than a solid narrative that needs to be experienced. Where those other games kept things tight by, at the very least, pushing you in a certain direction, Ethan Carter gives you those aforementioned big empty spaces and basically expects you to stumble across everything it needs you to.To be fair, thats not the worst way of telling a story. Found art  in whatever genre you want  can make for a pretty compelling tale. In this case, thought, it feels like youre just wandering around, looking for dead bodies and puzzles to solve. Theres no sense of urgency, no feeling that youre pushing the story forward in any way. In fact, its entirely possible that you can miss huge chunks of the story entirely, unless youre in the mood to painstakingly cover every bit of ground, trying to find all kinds of little clues.", "date": "January 31, 2020", "grade": "B-"}