{"name": "Mad Games Tycoon", "ref": "https://gaming-age.com/2020/01/mad-games-tycoon-review-for-nintendo-switch-xbox-one-ps4/", "text": "The challenge facing Mad Games Tycoon is the same challenge that faces every other game development simulator: it has to measure up to Game Dev Story. And like every single other game development simulator, it features the same fatal flaw: it doesnt measure up to Game Dev Story.I dont want to say that Game Dev Story is absolutely perfect or anything, because its not  they are definitely places where it could be improved. But it did everything you could want out of a game development simulator so well  and gave you so much control over what you did, and made it so incredibly user-friendly  that its hard for most other aspirants to its throne to come close to matching it. And, unsurprisingly, Mad Games Tycoon is no different.Thats not to say it doesnt try, though. Mad Games Tycoon sets you down in 1980 (or more recently, if youd prefer), and gives you free reign to build a studio as youd like from the ground up. Not only do you have to hire your staff, carry out research, do contracts to make extra money, and, of course, develop games, you also have to literally build up your office. Youre responsible for the layout, the features, even the furniture.Its also worth noting that Mad Games Tycoon is significantly more difficult than Game Dev Story. While the gameplay loop may seem similar  develop, marketing campaign, contract work, repeat  this game is much more challenging. The critics are significantly harsher, fans are much more fickle, and sales are much harder to come by. If your biggest beef with Game Dev Story was that it eventually becomes too easy, youll find that complaint resolved here.I cant say that these changes do much for me, though. Part of the joy of Game Dev Story was how it streamlined some of the more onerous tasks associated with the industry; while Mad Games Tycoon allows you to get more down in the weeds, thats not exactly a selling point. Likewise, even if Mad Games Tycoon is harder, that doesnt necessarily mean better. Theres not much feedback on how you can get better or why things happen the way they do, which makes it feel like youre playing in a vacuum, rather than in a real world.The biggest difference, though, is that Mad Games Tycoon is lacking when it comes to presentation. This is a pretty ugly-looking game. In its haste to give players a more detailed world, it forgot to make a world that youll actually want to look at as you get sucked in  whereas, by contrast, Game Dev Story is brightly-coloured and bursting with life.", "date": "January 8, 2020", "grade": "C+"}