{"name": "MechWarrior 5: Mercenaries", "ref": "https://gaming-age.com/2019/12/mechwarrior-5-mercenaries-review-for-pc/", "text": "The MechWarrior games have been around for a long time. Starting in 1989, Dynamix made the first video game based on the popular Battlemech tabletop roleplaying game. Many games have come out using the MechWarrior name since. Some on console, most on PC. The latest entry MechWarrior 5: Mercenaries is a long time coming. Fans of the series have been waiting more than 15 years for a new mainline MechWarrior game and now its finally here!The universe of MechWarrior is made up tons of complex story and politics. The lore can be exceptionally confusing to new players or anyone who hasnt played MechWarrior games before. Some of it is explained in game and players dont need to know the intricacies of the different factions at play in order to enjoy the game.At the start of the game, players are put into training with a newly repaired mech. Partnered with your Father they put the mech through its paces. During the training exercise, unknown forces attack your base and attempt to capture your Father while looking for coordinates that they believe he has. During the getaway, your father is killed, and you are put in charge of the now almost destroyed Mercenary unit. In order to get away from the star system, Commander Mason, the player, starts a new mercenary unit and is able to escape with the new name. Now, Mason is tasked with putting his mercenary group back together and getting revenge on those who killed his father.Once the beginning act is over, the game really opens up. After leaving the system, there is a short tutorial on how to travel around the galaxy, and where to go to get parts, mechs and pilots. Many star systems have missions and its up to the commander to decide where to go and which missions to take. Travel costs time and money as your ship cannot make interstellar jumps to other systems and must buy passage on a jump ship. Repairs and refits also take time, when mechs are damaged in battle, repairs and refits can be made between most missions. This all costs time and money. If you are in a system that has battles going on, the repairs cost more and take longer.Managing mechs can be somewhat confusing. Many aspects of each mech are customizable, from the amount of armor on each section to the weapons and storage of ammunition on the nuclear walking tank. When parts are destroyed, players must go in to customize and completely refit the mech, removing the destroyed parts and replacing them with parts from inventory. Make sure you have plenty of spare parts. It took several missions to figure out how to replace bad parts and repair at the same time. In order to do so, players need to go into the customize mech portion, replace the bad parts and on the right side click on repair all. Otherwise on the overview there is just a repair mech which will not replace destroyed parts, just fix parts that can be fixed. Overall there is a ton of customization options for all of the different mechs.Money is the number one enemy early in this game. There is a laundry list of things players need to spend money on from repairs to travel, plus every quarter they need to pay their crew and upkeep on the mechs themselves. In order to avoid upkeep on mechs, players can put them in cold storage, but that makes them unavailable to place on missions.Missions are played out with up to 4 mechs in your group, or lance. In order to fill those spots, players must have enough pilots and mechs to fill the lance or go short handed. There is also a weight restriction to the missions. Each mech can weigh up to a certain number of tons and as missions get harder, the tonnage limit goes up. When picking mechs for a mission, the ton restriction must be observed, if that means 4 medium sized mechs instead of 2 large mechs, that might be a trade off you are willing to make. There are many kinds of missions and many kinds of worlds. Everything from assassinations to defending outposts and mining colonies to raiding other mercenary outfits. As contracts are completed, reputations among the different factions change. If completed successfully, a faction will like you more and give you more rewards. Also, when selecting contracts from factions that like you, Commander Mason can negotiate a better rate on pay and salvage for the contract. The more salvage points you have the more that can be salvaged from the battlefield, up to and including mechs that where disabled in the fight.There are also contracts that can be taken that are multiple missions long. Be careful with these as repairs cannot be made between missions. Pilots and mechs can be swapped, but no repairs can be made as the missions need to be completed one after the other right away. Make sure you have enough mechs and pilots when you take on these missions.Missions can be played in first person or third person view. Controlling the mech will take some getting used to. It moves like a tank, so moving the mouse turns the torso of the mech and the keys on your keyboard turn the feet. There are two different keys for lining up the torso with the legs. Turning the legs can be slow and cumbersome, depending on the size and speed of the mech. Turning the torso can also be a little laggy, but it is realistic since turning a torso of one of these machines is like turning the turret on a tank. One will move the legs in alignment with the torso and vice versa. Weapons are fired in groups. Which are assigned during mech setup. Each group can be fired with one button. Most weapons are just point and shoot, missiles need a lock on.The environments look good and are rather diverse. Ive landed my lance on everything from a frozen tundra to a forest to a chemical wasteland. The loading can be a little long when first loading up the game. Something that the developer did do that was particularly cleaver, once a contract has been accepted, mission loadout is displayed. While choosing the mech and pilot to match, the mission is being loaded in the background. This is handy and shortens load time once the mission has been chosen and the players dont have to sit and wait for the game to load.MechWarrior 5 will not win any awards for the best-looking game, it still is no slouch. Explosions are bright and flashy, and damage can be easily seen on units. Destruction of buildings in a game like this is a must, and MechWarrior 5 does not disappoint. Some mechs are big enough to walk through a building, or wall while others need to use weapons to destroy structures. Either way its very satisfying to do especially when the mission is to destroy structures. On the flip side, when protecting structures, make sure you watch where you step.Co-op is available in the game as well, you and up to three friends can play almost the entire campaign together. In order to do so, whomever is running the game must have enough mechs and pilots for all their friends or some people might have to wait in a spectator mode while the other players play out the mission. This is a little disappointing as the other players cannot bring in their own mechs they have customized, however, understandable as it would be extremely difficult to balance the game out with the different tonnage restrictions and making players go back to find a mech that would fit in the mission from their game.", "date": "December 12, 2019", "grade": "B+"}