{"name": "Updated Google Stadia impressions", "ref": "https://gaming-age.com/2019/12/updated-google-stadia-impressions/", "text": "The idea of streaming games has been enticing since the technology advanced enough to support it. There are pros and cons, of course, but the concept of instantly playing a game without downloading, or being concerned about the power of the hardware running it, is very cool. These services have come and gone with very little blockbuster success. The latest competitor to step into the ring is Google with their service, Stadia. While the concept is still novel, Im not sure its going to cause sweeping conversion amongst the gaming community.These impressions are based on the Stadia Founders edition, put to use over multiple platforms and a handful of games. The platforms tested were a PC through a Chrome browser on a 24 1080p monitor, the included Chromecast Ultra connected to a 55 LG C9 OLED 4K HDR TV, and a Pixel 2 XL phone. The games tested were Destiny 2: The Collection and Samurai Shodown (both included with the premium membership), and Trials Rising and Assassins Creed Odyssey (codes provided by Ubisoft).Very first impressions were actually quite good. I had to start on the PC since my invitation came before my hardware. I was able to log in quickly, and within seconds I was playing Samurai Shodown. That was super cool and satisfying. Shutting down Samurai Shodown and launching Destiny 2 was equally as fast, and its all done from a slick and streamlined user interface.The question Im most often asked is, How does it play? In my experience, I can honestly say it plays just fine, very well at times. In over a week, Ive never had any major issues with extreme lag or mangled graphics that made me remember that the game was streaming. Inputs felt pretty natural, graphics were great at first sight, and for the most part it felt like playing locally.While first impressions were great, the luster slowly started to fade. Once the giddiness of playing recent releases on a streaming platform, I really started to notice the gameplay and graphical issues. During initial playtests, I was just sampling all the games, running, jumping, shooting, pulling off special moves, clearing early Trials tracks. Everything seemed fine. It wasnt until I returned and played each one of these games for a length of time, actually focusing on missions, fights, and race times, that I started feeling frustrations. Frustrations that honestly are not acceptable if Stadia was meant to be your main platform for gaming.I did a graphical comparison, first, between the Xbox One X and Stadia, both running in 4K HDR. As noted, at a glance, both games look phenomenal. Upon closer inspection, the Stadia version was not running at the same level of quality as the X1X version. Edges were not sharp, textures looked muddier, and lighting appeared inferior.While I can live with the graphics downgrade, as they werent terribly significant, the controls are another story. Initial impressions felt very playable, but again, playing for real left a lot to be desired. The first time I really noticed the issues was hopping on and riding a Sparrow. I was crashing from one side wall to the other unable to make smooth turns. This didnt seem right, maybe it was getting used to the new Stadia controller. Then I started noticing how badly I was over-aiming while shooting. Fine tuned controls were a serious issue, and the barely noticeable lag between input and visuals ended up making gameplay incredibly frustrating. While gameplay appears smooth, under the surface its hiding some dead reckoning and other tricks that keep up appearances but hamper playability.I am a huge fan of the Trials series, spent countless hours clearing every extreme track in the original, but I havent kept up with the newest entries. I was excited to get back into Trials with Rising. My initial run through the beginner tracks was fun. I enjoyed the new progression system and costume and bike loot. I felt super rusty, but kept pushing through.Just like Destiny 2, I started to realize my rust wasnt the only thing making my runs difficult. I wouldnt consider myself a phenomenal Trials player, but like I said, I did tackle all the original extreme tracks. I know how to feather the throttle, how to carefully lean my bike to tackle near impossible walls and hills and bunny hops. I got to a point early on in the progression, where I was just having way more trouble than I should have been having. Its that same smooth gameplay feeling but with underlying issues. Its a catch-22. The techniques making it smooth are actually taking the fine tuned controls out of yourcontrol. I never made it far enough, but with a precise game like Trials, I dont think I could ever clear some of the intermediate to hard tracks.This is a game Ive played a lot of on X1X, and the Stadia experience was just as good in every way. If there are graphical difference, they were harder to see as opposed to Destiny 2.As far as the gameplay, precision control is far less of a concern compared to other games. Exploring, playing through missions, and combat all felt as good as local play. This was the best experience of the launch games I played.Im a fighting game fan but hadnt played the new SamSho yet, so this one is a little harder to judge as a streaming title. It was extremely playable. Gameplay is less combo dependent compared to other fighting games, but that doesnt mean that precise input timing isnt necessary. Im just not at a high enough level to be counting frames where it would matter. As a casual player, this was another very good experience.My experience was also different on different display devices. Playing on the PC was quick and easy, just open Chrome and go. It worked with any controller, wired or wireless that I threw at it. The 1080p display on my laptop was the least impressive graphically, so I didnt use it once I received the Chromecast and Stadia controller. The Chromecast Ultra hooked to the LG OLED was pretty easy to set up and looked far better than the laptop. I only used the Stadia controller in this use case, and it performed as one would expect from a dual analog controller. Surprisingly, I think my favorite way to play so far is the Pixel 2. The small screen makes the graphics a non issue. They look incredible in the small space. Theres also some subconscious forgiveness for the imprecise control since its more like a casual, mobile solution. It may have been a trick of the mind, but it honestly felt like the most responsive of all the combinations I tried.", "date": "December 12, 2019", "grade": null}