{"name": "Close to the Sun", "ref": "https://gaming-age.com/2019/12/close-to-the-sun-review-for-nintendo-switch-ps4-xbox-one/", "text": "Under the right circumstances, I could imagine Close to the Sun being an absolutely incredible experience. Its a Bioshock-influenced walking simulator with some genuinely creepy horror elements: if that doesnt get you at least a little interested, I dont know what would.Unfortunately, playing Close to the Sun on the Switch is decidedly not the right circumstances. In fact, I feel quite confident that playing Close to the Sun on the Switch is about as terrible a way to play it as I can possibly imagine.Ill be blunt: this is a bad game, entirely because the Switch isnt nearly powerful enough to pull off what the game wants it to do. Dont get me wrong, I love my Switch, its my go-to platform, and Ill never complain about it getting too many games. But theres no way this experience could possibly be classified as enjoyable.The graphics are a very big part of this. Right off the bat, from the very first scene, you can see the game struggling to render everything thats meant to be on screen. That first scene takes place in a very small room, and even then, things look a little blurry, and if you try and move at all it gets even worse. From there, as the game opens up, its all downhill. Everything looks jagged and indistinct. The game can barely show you whats right in front of you, and if its in the distance, forget it  itll pop into view quite abruptly, and youll notice the sudden appearance of massive objects where there were none before.This could maybe be salvaged if Close to the Sun at least controlled well, but it doesnt. By default, you move along at a crawl; even once you figure out how to run (because this game is lousy about telling you how to do anything), youll still feel like youre only on a brisk walk. Given the game occasionally asks you to run for your life, you can see why this is a bad thing. Even picking up objects and trying to rotate them is next-to-impossible  which, again, is something the game asks of you occasionally  since they move as if theyre stuck in molasses.Its all especially frustrating because I could imagine Close to the Sun being a great game. You can tell that, on the right platform, the Bioshock/art deco influences would look absolutely stunning, and would help make the creepy story  about a woman trying to rescue her sister off a ship from the clutches of a mad Tesla  all the more riveting.But again, the Switch is not the right platform for Close to the Sun. The right platform would be one that could actually show whats going on without it feeling like your console was about to burst into flames and melt down. If you do have one such non-Switch platform, you may be inclined to check this out, but if the Switch is your only option, steer very clear of Close to the Sun.", "date": "December 10, 2019", "grade": "D+"}