{"name": "Lil Gator Game", "ref": "https://gaming-age.com/2022/12/lil-gator-game-review-for-nintendo-switch-pc/", "text": "I feel like every year this happens every year: after I submit my ballot for our Game of the Year list, I always find a game that I wish Id included on my ballot after the fact. Last year it was Suzerain and Loop Hero; this year its Lil Gator Game.On the one hand, my defence would be that it didnt come out until the very end of this year, and I had no idea a game that came out in mid-December would wow me as much as this did. That said, its pretty similar to games like Haven Park and A Short Hike, and seeing as I was a massive fan of both of those games, I shouldve had some clue that I couldnt finalize my list until I played Lil Gator Game.Still, even knowing how much I enjoy similar games couldnt have prepared me for how much I like Lil Gator Game. Its one of those games that I cant think of enough superlatives for. Its cute, its funny, its engaging, its inventive: basically, its just a really fun, really enjoyable game that deserves to be played and experienced by as many people as possible.  Its not hard to explain why its so good, either. Youre playing as a little alligator trying to convince its older sister to put her textbooks away and come play. You achieve that by exploring the island shes taken you to, where youd already gathered a bunch of friends in the hopes of creating a massive quest for the two of you to play together. The whole game is spent meeting new people and carrying out quests like race down this hill as fast as you can, or pop those balloons, or climb this tree.Obviously, its not the most challenging game in the world, nor is it the most linear game  but its not meant to be either of those things. Its intended to recreate an idealized version of childhood, where your only real concern is squeezing in as much playtime with your friends as possible, and where you can turn pretty much anything into a fun game. Obviously, its a little more difficult being a kid than that, but Lil Gator Game makes it all seem so much fun. And, consequently, its also so much fun to play. Unlike some games that try hard to be good-natured and relaxing but actually arent, Lil Gator Game is exactly what it looks like on the surface: a sweet, adorable game that never feels like its trying too hard to be either of those things, but thats guaranteed to win you over all the same.", "date": "December 29, 2022", "grade": "A+"}