{"name": "Stranded Sails  Explorers of the Cursed Islands", "ref": "https://gaming-age.com/2019/12/stranded-sails-explorers-of-the-cursed-islands-review-for-ps4-xbox-one-switch/", "text": "I dont know when I last loathed a game as much as I despised Stranded Sails  Explorers of the Cursed Islands. Sure, there are plenty of games in recent memory that I havent enjoyed because of how broken they were, but Stranded Sails feels like it reaches a whole new level of awfulness. Whereas some of those other games that left me cold could at least be commended for their ambition, Stranded Sails is a boring, unambitious Harvest Moon/Stardew Valley clone that, despite not attempting to do anything new or interesting, still fails miserably at what it sets out to do, and is irreparably flawed to boot.Its premise sounds so simple. Like I said, Stranded Sails takes its cues from Harvest Moon and/or Stardew Valley, so its basically a farming game, albeit with a dose of Zelda thrown in for good measure with its mute-ish protagonist and the slight focus on exploration. The twist is that the game is set following a shipwreck, and your character, your father, and your shipmates have to make an island inhabitable. Despite this grim premise, the whole thing is presented as being all brightly-coloured and kid-friendly, with nothing to suggest the incredibly frustrating horrors that await anyone foolish enough to play it.And oh, what frustrations there are. Its not just that the game crashes  although multiple online reports suggest that if you waste enough time on the Stranded Sails, that happens too. No, what really makes it reach a whole other level of terribleness is that there are all kinds of bugs littered everywhere that make it so that youll likely have to quit the game and start over well before you can get anywhere close to dozens of hours. Case in point: very early on, I had to help build houses for my fellow castaways. This involved finding a rope to help create one of the basic items. So I found it, combined it with another scavenged item, put it in my inventoryand found that it had suddenly vanished. Despite wasting another half hour scouring every inch of the island, there were no other ropes to be found, so I quit the game, erased my save file, and started over.My next playthrough, I got a little further in, and reached a point where I had to start cooking for my crewmates. This involved searching for various seeds, and then planting, watering, and harvesting them. Sounds straightforward enough, right? I thought so, too, except after I planted and watered them, I napped  more on that in a moment  only to wake up and find that the seeds were gone: gone from the ground, gone from my inventory, and gone from the game. So, once again, it was back to the old quit-erase-start over maneuver.Im not going to go through every time I had to quit, erase, and start over, but it essentially took me six hours to get through the first hour of Stranded Sails, entirely because of the games own technical issues. Im all for not forming firm opinions after only playing a game  particularly a long game  for an hour, but when it takes six-plus hours just to get through one hour of gameplay, Im taking that as a sign that the game in question is simply not interested in having me play much more. (Admittedly, theres something to be said for saving early and saving often  but in this case, Stranded Sails also believes that, since it saves your progress constantly, and always overwrites its previous saves, which means youre pretty much stuck with the broken state in which youll find yourself.)Plus, its not like what I did experience suggested that Stranded Sails wouldve been some incredibly gem if only everything had worked properly. Were talking about a game where one of the core mechanics is napping. This is because the game doesnt just give you a stamina metre, it uses it in the strictest way possible. Taking a step? Youre losing stamina. Running? Youre losing even more stamina. Digging a hole, and planting seeds? So much stamina lost. Rowing a boat? Itll take you three in-game days to explore a couple of small sandbars, since youll be out of energy by the time you reach each one. Every time you run out, the game helpfully deposits you back in your bed, where you then sleep for a day or so to regain your stamina  which you then lose as soon as you take a few steps outside, because its that type of game.In this respect, Stranded Sails is one of the oddest games Ive ever played. It looks and plays like it wants to be some kid-friendly introduction to farming and exploration, and then it hampers everything by insisting you take plenty of naps, and it punishes you if you dont. Its hard to imagine a way to drag the action down more than constant, regular, forced sleeping.Actually, I can totally imagine a way to drag things down more: by being so buggy, that you force players to constantly erase their progress and start over. Thats what you get if you subject yourself to Stranded Sails. This is a mediocre game at the best of times that drags itself down to being entirely horrible thanks to its own terrible choices and design, and theres really no reason why you should subject yourself to it.", "date": "December 2, 2019", "grade": "F"}