{"name": "My Memory of Us", "ref": "https://gaming-age.com/2019/11/my-memory-of-us-review-for-nintendo-switch-ps4-xbox-one/", "text": "My Memory of Us is a game about the Holocaust. Its not some battlefield drama with World War II as a pretext for killing as many people as you can, but rather a game that focuses on the genocide itself  or, at least, as it was experienced by a pair of children living in a ghetto in some unnamed country. There are some allowances made here and there (which are significant, and which Ill get to in a moment), but if youre going to play it, you should be aware that youre in for some heavy subject matter.Theres nothing wrong with that, of course. Indeed, its kind of neat to see a game tackle the Holocaust head-on, since the atrocities themselves arent usually what games focus on. Theres no doubt that the creators hearts were in the right place when they made this game.And yet, its those allowances I mentioned that make the whole game kind ofiffy. Rather than having the actual Nazis as bad guys, here the genocidal forces are led by the Robot King, who sends his evil robots into war, and once he conquers the country he immediately starts painting a subset of people red. The reds are then rounded up into ghettos, discriminated against, and sent to concentration camps.While I get the metaphor, and that My Memory of Us didnt want to show the horrors of the literal Holocaust, at the same time it all feels kind of glib. I have no doubt that the game was made with the best of intentions, and if you just focus on the story without thinking about its deeper implications its undeniably heart-wrenching and affecting and deeply emotional.But at the same time, turning Nazis into robots that are beings of pure evil feels like it minimizes what they did. What makes the Holocaust so horrifying wasnt just that millions of people died (though, to be clear, thats horrifying all on its own), it was that it was people committing mass murder on such a massive scale: humans planned and carried out those atrocities against their fellow humans  their neighbours  based on a murderous, dehumanizing ideology. Simply saying they were pure evil almost gives them a pass, because it means you dont have to think about the terrible excuses and leaps of logic people made when they were committing those atrocities; it means you dont have to think about the fact that Nazism didnt take root because people were evil, it took root because there were decisions made and actions taken (or not taken) that allowed it to come to pass. I dont want to say, Nazis were people too!but, I mean, they were, and thats what makes the Holocaust such a chilling part of human history.And none of those objections even get into the way My Memory of Us deals with the victims of the Holocaust themselves. I suspect that the game is trying to make you think of how random and capricious genocide is, how its all based on completely arbitrary distinctions, by having the robots in this game divide the population up into Reds and non-Reds. The problem is, the Holocaust wasnt really random. I mean, sure, when you start looking at all the different sub-groups the Nazis targeted, from the Romani to Slavs to Roman Catholics to Freemasons, you get the classic paranoia that typifies most totalitarian states. But that ignores that the biggest group of victims  those 6 million or so Jews  were a pretty clearly identifiable minority group that had been scapegoated for thousands of years. Making them the arbitrary victims of a madman ignores all that history in favour, again, of something that sounds great until you think about it for a moment. The fact that the game even borrows from Schindlers List by making it all monochromatic except for splashes of red here and there makes it feel like the developers watched that movie, saw how effective the use of colour was in emphasizing certain points, but missed what was going on.To be fair to My Memory of Us, Im putting way too much thought into all this. Its designed to be a simple meditation on young friendship during wartime. And it is that  you see the young boy and girl having fun before the war, you see the girl separated, and then you see the way they work to overcome that.On top of that, the game provides you with a number of puzzles to solve and platforming obstacles to overcome. None of them are particularly challenging, but they dont need to be  this is a game where the story takes centre stage. I mean, it even has Patrick Stewart turning in an avuncular performance as the games narrator, which is a pretty sure way of making you focus on the broader narrative instead of the details of specific puzzles.But as I said, if you really focus on the narrative, I dont think youll necessarily draw the same conclusions that My Memory of Us wants you to draw. Its a well-intentioned, well-made game that tries to convey the horrors of genocide  but, in the process of doing that, may just accidentally minimize them.", "date": "November 25, 2019", "grade": "B-"}