{"name": "Call of Duty: Modern Warfare", "ref": "https://gaming-age.com/2019/11/call-of-duty-modern-warfare-review-for-ps4-xbox-one-pc/", "text": "I think youd be safe in thinking of Call of Duty: Modern Warfare, as a bit of a reset button for the long-running FPS franchise published by Activision. After all, Black Ops 4 tried to go with an MP focused product that certainly seemed successfully, but if youre like me and actually enjoy playing through the campaign year-after-year, you couldnt help but feel like last years release was off somehow. So now eschewing the numbering system for sequels, loot boxes, and even paid DLC content, theres a lot in Modern Warfare that feels very much in line with what made people love the series to begin with.As the name implies, Call of Duty: Modern Warfare is set in modern times, featuring weaponry, characters, and world events that dont feel far removed from 2019. Yes, the campaign is fictional, but the use of Russians as a bad guy isnt exactly far fetched, and the unfortunate reality of constant combat in the middle east isnt exactly new. Thats not to say that the campaign isnt entertaining, I actually thought it was pretty good, instead its a more grounded approach then weve seen out of most modern Call of Duty games.Call of Duty: Modern Warfare is split into three modes. A 14 mission single-player campaign, competitive multiplayer, and a co-op mode that brings back SpecOps in-lieu of the more traditional Zombies. The campaign falls in line with the standard length and difficulty of most Modern Warfare games, roughly 6 to 8 hours in length and not too challenging on normal with a host of additional difficulty options for experienced players. The campaign does have some excellent set-pieces though, particularly the early civilian filled Picadilly Square or the multiple missions that involve night vision and limited stealth. Seriously, the night vision filter in this game is absolutely amazing, elevating the already excellent environments and character models into something as close to real as the series has managed thus far.The multiplayer mode, as you might expect, remains one of the most robust modes in any modern first-person shooter out there. Youve got a Quickplay option which can be further filtered down into a variety of modes like Team DeathMatch, Domination, Search & Destroy and more. You can check or uncheck the modes youd like to see pop-up in Quickplay, and can effectively make a single-mode playlist if youd prefer. However, you can also choose from a variety of single-mode hoppers too, like the new NVG which provides a realistic mode without a mini-map, increased headshot damage, and night-vision to boot. Or you can opt for large-scale combat with Ground War, which also introduces various vehicles and a much larger player-count than a normal map.Multiplayer progression is entirely tied into leveling up via experience from kills and completing matches. As mentioned before, loot boxes are gone, so youll gain items and cosmetics by completing daily challenges and missions. These will run the gamut of basic goals, like x number of kills with assault rifles, completing or winning public matches and so on. Leveling up will unlock additional weapons and killstreaks while leveling up weapons separate from player XP will unlock attachments. There are multiple attachments for most weapons, offering up a host of loadout options to customize. My only real complaint so far has been that daily challenges have been bugged for me, not showing completion towards goals without resetting the game entirely. Its been difficult to tell if kills and so on are actually being tracked, but I feel like Im rarely completing challenges when I know I should be. However, the more permanent missions seem to work O.K. so Im unsure what the issue is. You could also argue that balancing needs to be done, and spawns could probably be adjusted a bit. I have a hard time hammering on these issues at launch, since I dont think Ive played a modern Call of Duty game at this point that doesnt have similar issues at the start, but if youre brand new to the series its worth keeping in mind that you may find yourself falling victim to an unfair kill or two prior to significant updates.The only dud of a mode for me has been SpecOps, which Ive honestly found a bit boring. I enjoy the idea that its tied into the campaign story a bit, but its also not particularly vital in that regard either. Which is good, because Ive not enjoyed my limited time spent on the mode so far. In SpecOps youll team up with 4 other players, using your loadouts from competitive multiplayer and earning experience that feeds into unlocks for both modes. Youll also gain access to a class type, which essentially gives you a limited bonus that works off of a timer.There are four maps to tackle, each with a bit of story tacked on. You and your friends will then attempt to complete a series of objectives, generally revolving around killing a harder enemy, hacking (controlling) a point on the map, or trying to rescue a hostage. Its a lot of the same types of objectives over and over, while you face off against hordes of progressively harder enemies. It just doesnt feel particularly fun, and the occasional bug, like not being able to use your consumable ammo/grenade re-supply abilities at random, is frustrating. Its just not the mode for me, and certainly not compelling enough for me to pull away from the competitive MP.Still, its hard to complain about the rest of Call of Duty: Modern Warfare. On a lot of levels its a back-to-basics approach for the series that works, with an engaging, entertaining campaign, great visuals and voice acting, some classic Modern Warfare callbacks, and a strong multiplayer mode too. If youve been away from the series for a long time, this would make a pretty good year to jump back in.", "date": "November 5, 2019", "grade": "B+"}