{"name": "Death Stranding", "ref": "https://gaming-age.com/2019/11/death-stranding-review-for-ps4/", "text": "There is a whole lot to unpack in this review for Death Stranding. Going into launch, I feel as though players know less about this game than any game in recent history. The biggest question I have seen swirling around the internet is what do you actually DO in Death Stranding. I am here to try and shed some light on that, without spoiling the multitude of secrets that the game holds. So with that in mind, lets talk about Death Stranding.The Worlds greatest delivery manYou play Death Stranding as Sam Porter Bridges, who is played by Norman Reedus of Boondock Saints and The Walking Dead fame. All of the big characters in Death Stranding are motion capture renderings of their respective actors. Most of those actors also provide the voices for their characters, with the exception of Guillermo Del Toro and Nicholas Winding Refn. The credits for Death Stranding look more like a roll of film credits, not so much a video game. Even with all of the big names in Death Stranding, Norman Reedus really stands out. He truly IS Sam Porter Bridges. He brings the protagonist to life in a way I have only ever seen done by Naughty Dog with The Last of Us and the Uncharted series. He brings depth, and nuance to his character that is on par with what one would expect from film acting. During the cutscenes, I found myself forgetting more and more that I was NOT watching a movie, starring near photo-realistically animated versions of famous actors and actresses. I cannot stress enough how amazing the performances are across the board, with talent like Mads Mikkelsen, Troy Baker, Lea Seydoux, Margaret Qualley, Lindsay Wagner and, in a truly stand out performance, worthy of individual recognition, Tommie Earl Jenkins as Die-Hardman.Incredible acting and talent aside, lets look at the actual gameplay loop in Death Stranding. It is very difficult to boil things down to one simple mechanic, as throughout the game, it will change and evolve one piece at a time. If I had to choose one aspect to focus on, at least at first, it would be the deliveries. Sam is a Porter, which is essentially a post-apocalyptic delivery man. He works for the Bridges corporation, giving him his name Sam Porter Bridges. These deliveries are carried on your back from one civilized outpost to another. That is the start of Death Stranding. You are thrown into the deep end of the story with no life-jacket. Acronyms like BT and BB will be thrown around wildly, characters all have weird names like Fragile and Deadman, you know the world is in disarray after an event called the Death Stranding and if characters die and dont get burned within so many hours, their bodies create a massive explosion called a voidout. You hear about characters traveling to their Beach, and you meet the President of the United Cities of America who tells you about a Chiral Network. On and on it goes, and unless your name is Hideo Kojima, you really have no idea what is happening or being talked about. I advise patience, do not go online searching for what things mean or trying to figure out what is happening, because it is ALL made clear throughout the course of the game. Death Stranding is a slow burn, and it leaves the player in charge of paying attention and connecting the dots or strands (Ha!) as the game goes on.A lengthy journeyAnd on it certainly goes. When the final credits rolled on Death Stranding, I had clocked just shy of 72 hours of playtime. In true Kojima fashion, Death Stranding has some of the longest cutscenes in gaming, so some of those hours were spent watching cutscenes. In those 72 hours though, I spent a lot of time doing what are called Standard Orders. Deliveries in Death Stranding are divided into three categories, Sam Orders- Main Quests. Standard Orders-Side Quests and Lost Cargo- Which I will cover in the multiplayer section. To simply complete the main story, doing minimal Standard Orders and pushing, it should take an average player around 50 hours to reach the end. I am sure there will be players that come in quite a bit shy of that, and there will be some that take much longer just to reach the end. It will all depend on how hooked you are on the gameplay loop.The core of that loop remains the same throughout Death Stranding, delivering cargo. The cargo you are tasked with delivering, as well as the challenges you will face along the way and the tools you will use to accomplish those deliveries will change drastically as time goes on. There IS combat in Death Stranding. A third-person action/shooter-style combat system emerges as time goes on, but it is by no means the core of the gameplay in Death Stranding. In addition to combat encounters in-game, Death Stranding has boss fights, which all vary wildly, and which I cannot really speak about in detail without spoiling things. While combat is not the focus of Death Stranding, Kojima Productions brings to it the level of polish you would expect of them. However, combat is not a mechanic that you will be using for your first third of the game, and it is introduced one step at a time.All of Death Stranding can be described in that way, one step at a time. You start with the simple goal of carrying something from one place to the next, and it slowly evolves as the game progresses. The world that you have access to, the tools that are available, the complexity of what is required of you, it all starts small and grows bit by bit. This slow drip of new mechanics and options keeps the game fresh and exciting. As soon as I found myself getting even a little bit fatigued, something new popped up and brought me right back into the game. The pacing is perfect, with each new gameplay element coming in at exactly the right time.Combat itself can be divided into three unique categories. First, is combat against the MULEs. These are men who were once Porters, but fell into madness and now rove the land, attacking other Porters and stealing their cargo. At first, you really have no way to fight them, and it is best to avoid their camps all together until the story demands you run into them. Once you start fighting them, non-lethal takedowns and non-lethal firearms are introduced. The MULEs are not out to kill you, simply incapacitate you and steal your cargo.The second category is combat against BTs. These are the semi-disembodied spirits of departed humans, albeit much more powerful than a standard person. When you come to a BT infested area, you will be notified with a short cinematic where your odradek (shoulder-mounted scanner) pops up and begins flapping wildly in the direction of the nearest BT. Your BB (the fetus in the pod on your chest) will also cry and begin to become distressed as you get close to them. Scanning the area around you is the only way to see the BTs, which appear as fuzzy shadows of a human, floating in the air connected to an umbilical cord. In your initial few hours, to my knowledge, there is no way to defeat a BT. Once you begin crafting Hematic Grenades from your blood (and eventually firearms loaded with blood bullets) you can begin to fight back against the BTs.The final category is boss fights, which ends up being a combination of all the other combat types, depending on which boss it is. These I will not be discussing, in an effort to avoid spoilers, just know that mechanically, each boss is unique and VERY cool. I cannot stress enough how much combat is NOT the focus of Death Stranding, but if it is something you love and choose to seek out, there is an endless supply of areas and enemies you can face, you simply have to seek them out.A more connected AmericaOne of the biggest story hooks in Death Stranding is your mission to connect the United Cities of America, which replaced the more familiar United States of America after the Death Stranding occurred. That connection extends beyond the story though, in what Kojima Productions called the Strand System. This is a very loose multiplayer system that is in place to allow players to help each other out. As a player, if you come to an obstacle like a river that needs to be crossed or a cliff that needs to be scaled, you can use in-game tools like ladders or climbing ropes to traverse them. After doing so, you can choose to dismantle the tool you used to recover resources, or you can leave it. If you leave it, there is a chance that it will show up in another players world, allowing them to traverse that same obstacle without using their own tools.If you place a particularly helpful object down, the player on the other end may feel generous enough to award you some Likes. These likes accumulate as the game progresses, and they are the rewards you earn for completing most of your cargo deliveries. At the end of my time with Death Stranding, I had amassed just shy of 1 million likes. The likes act as experience points of a kind. After each mission, the number of likes you earned is broken down into categories, and those categories level up individually based on what you did.The categories are broken down into a five-point star, Cargo Condition, Cargo Volume, Delivery Speed, Bridge Link and Miscellaneous. As you level up each point on the star, you increase abilities relating to that category. As you level up the Cargo Volume point, for instance, you start being able to carry more and more weight without being over-encumbered. The Bridge Link is the point that relates directly to your interactions with other players. The more likes you get, the faster that point will increase and grant you new abilities.In addition to the small tools, large structures can be constructed and left for other players to use. Generators to charge vehicles, small storage lockers, bridges, roads and even safe houses later in the game can all be crafted and used by other players. These become incredibly helpful as you traverse rougher and rougher terrain, with safe places becoming fewer and farther between. As I mentioned above, the third delivery type is Lost Cargo. As you travel through the world of Death Stranding, you are going to lose cargo. Whether MULEs steal it from you, or a rushing river sweeps you off your feet and washes your cargo away, or you choose to simply drop a delivery halfway through in favor of picking up something else, it is going to happen. When it does, and you travel far enough away from that dropped cargo, the game will notify you that it has become available for delivery by other Porters. That means that it has left your world and is not showing up in the game for countless other players.Choosing to pick up and successfully deliver Lost Cargo to where it needs to go is a great way to get likes early on. Delivering the cargo awards you likes from the player who originally dropped the cargo, strengthening the strand you have with them. The stronger your strand, the more you will see things from them in your world. Finally, and probably most importantly, you will start seeing dropped items from other players as well, specifically during tough fights. During my first boss fight, I was woefully underprepared, but as the fight progressed, I started seeing shadows of other players pop up and offer me grenades and blood bags for health.The more you connect with other players, the more help you will receive. As you level up, you can form Strand Contracts with players that you find especially helpful. These make it so that you are more likely to share world states with that person, seeing more of their structures and dropped gear, and vice versa. This makes it important to not only seek out and award likes to helpful players but to BE that helpful player, so others will choose to make Strand Contracts with you.An environment worth savingWhen it comes to being invested in the environment around you, several things come into play. First and probably foremost in our age of high-end visuals and photorealistic landscapes, would be the graphics. Death Stranding does NOT disappoint in that regard. I do not think it is a stretch to say that Death Stranding has one of, if not the best looking environments of this generation. The graphics enhanced on my PS4 Pro were breathtaking, with each new area bringing a new level of wonder to the world around you. In addition to simple technical quality, the actual diversity and quality of the individual environments play a big part as well. Death Stranding takes you from lush, flat greenlands to giant, snow capped mountains, with everything in between. Each of these environments is fully realized, with proper lighting, weather and environmental effects. Running across an open field covered in lush green grass barely taxes your stamina, making for relatively easy deliveries, while trudging through waist deep snow on a mountain pass drains your stamina quickly, and you must keep your balance to prevent falling. In addition to the terrain, the temperature has an affect on your stamina and ability to move and carry cargo.Stamina and inventory management are both central to the core gameplay in Death Stranding. Stamina drains in two ways, short and long term. As you wade across a river or traverse particularly difficult terrain, your stamina drains. This refills immediately upon ceasing whatever stamina draining action you were doing. As time progresses though, and you do more and more things that drain your stamina, your bar begins to deplete, thus decreasing your max stamina. This is regenerated through sleeping in your private room, or by taking a healthy swig from your canteen of Monster Energy Drink. An in-depth balance and control system has also been implemented, adding another layer to the already deep gameplay. As you load more and more cargo up onto your back, you begin to lose your control over the load. The higher and heavier you stack things, the more it will affect you. If you run around a corner too fast with a high stack of cargo, you will begin to stumble and fall over. When this happens, you have to hold the opposite trigger to try and maintain balance and right yourself. If you succeed, awesome. If you fail, you will tumble over, spilling cargo on the ground and damaging the goods, sometimes irreparably. Also, occasionally fatally, as I learned when transporting an Antimatter bomb, which promptly exploded and left me staring at a death screen.Death is not the end, however! Sam is what is known as a repatriate, which is defined as the process of returning an asset, an item of symbolic value or a person  voluntarily or forcibly  to its owner or their place of origin or citizenship. In Death Stranding, this means that you do not permanently die. If you die in-game, you are thrust into a deep body of water, where your disembodied spirit must seek and find your body and reinhabit it, bringing you gasping back to life in the place that you fell. While this is a cool mechanic, I did not find the chance to experience it very often, as Death Stranding was not a game where death came frequently for me, at least when playing on Normal.A story to rememberAbove the environments, above the gameplay, above the acting and all of the incredible mechanics and designs, sits the story. Death Stranding is the most interesting and unique story of this generation. Hideo Kojima and the team at Kojima Productions have created something incredibly special with Death Stranding, and I encourage everyone to hold off watching videos or streams to experience it for themselves. That story is certainly elevated by all of the things mentioned above, particularly the acting, but at the core, it is that story that allows all of the other elements to shine in the way that they do. Things will not make sense at first, Death Stranding is a very slow burn in terms of story and gameplay, but dont give up on it. Dont become frustrated in the opening hours as things get thrown at you left and right, it will all make sense later in the story.Death Stranding represents a perfect marriage between plentiful and varied gameplay, as well as long, well rendered and incredibly deep cutscenes. It is important that anyone looking to this review to make a purchasing decision understands that. Death Stranding starts slow, and there are no shortcuts. It is not along the lines of an interactive movie experience like Detroit: Become Human, but there are a lot of times where you might just set the controller down and watch for 15-20 minutes. If that kind of gaming experience is not for you, then you may want to look elsewhere for your Game of the Year.ConclusionI was hooked from the first time I saw the title screen until the credits rolled 72 hours later. Death Stranding is immensely satisfying, and everything I could have hoped for and more from Kojima Productions. In a year that brought us a new From Software title (Sekiro), a new Obsidian RPG (Outer Worlds), a new Borderlands and a new Kingdom Hearts game, the Game of the Year competition was already a bit crowded. Death Stranding definitively plants itself at the forefront of modern gaming and is a true contender for Game of the Year. One minute you can be in the middle of delivering a pizza to a doomsday prepper in his shelter, the next minute you can find yourself fighting a giant biomechanical sludge lion, hitting him with grenades full of your own blood, all while the fetus in the pod on your chest uses a form of echolocation to help keep tabs on it. All of this while the entire world melts around you into a sludgy mess. Death Stranding is the definitive Hideo Kojima experience, and a genuine, one of a kind gaming experience.", "date": "November 1, 2019", "grade": "A+"}