{"name": "Wavetale", "ref": "https://gaming-age.com/2022/12/wavetale-review-for-playstation-xbox-pc-switch/", "text": "Heres a sign of how good Wavetale is: my only complaint about it would be its price. As enjoyable as it is  and make no mistake, its very enjoyable, and Ill get more into that in a moment  its also a little short for its $30 price tag. Seeing as its much easier to lower a price than it is to fix a bad game, and Wavetale does everything else so well, it seems silly to heavily penalize it for something that could so easily be changed.Because in every other respect, Wavetale is an absolute joy. Its a game where youre exploring the watery ruins of a post-apocalyptic world, but it makes that exploration so much fun that you cant help but get swept up in the sheer fun of it all. To a very great extent, this is because traversal is so simple and so smooth. Despite the fact Wavetale expects you to cover huge distances with no means of fast-travel, they make it incredibly easy. You can surf across the top of the waves at top speed, then launch yourself into the air where you use your fishing net to glide through the air, and then chain it all together using the odd well-placed hook. Theres an incredible fluidity to all the jumping and diving and soaring, and it makes it easy to get swept away in the action.It also helps that Wavetales world is a gorgeous place to explore. Though it starts off dark and shadowy, as you cleanse the shadows from the world it gradually gets brighter and more colourful. Between all the shades of blue in the sea and the swirling mass of colours in the sky, it quickly becomes apparent that this is a beautiful game.Not only that, the world has just enough secrets to make it interesting. While Wavetale isnt teeming with people, you stumble across them every so often, and they all give you some insight into their lives, usually along with some optional side quest that you should be able to complete in the course of carrying out your main objective. It gives you incentive to explore just a little more, and it extends the length of the game without making it feel padded. I know that the lack of padding may turn some people off. Further, the combat and puzzles arent exactly difficult, either, so Wavetale isnt the sort of game you should turn to if you want to be challenged.But if you just want a game thats a joy to play, this is it. Between the beautiful colours, the relaxing gameplay, and the thrill of gliding and soaring through the world, theres enough to make Wavetale well worth your time.", "date": "December 23, 2022", "grade": "A-"}