{"name": "State of Mind", "ref": "https://gaming-age.com/2019/01/state-of-mind-review-for-ps4-xbox-one-switch/", "text": "Im trying not to be too flippant or dismissive when it comes to State of Mind, but Im finding it really hard.This is because its a stupid, shallow game dressed up in technobabble and pretending to be smart and insightful. Its the kind of game that confuses surliness and angst for character development, and that never met a trope it didnt like. It labours under the delusion that because its long, it has something to say. Basically, its the video game equivalent of a first-year philosophy essay written by someone whos not anywhere near as intelligent or clever as they undoubtedly think they are.Thats not to say State of Mind doesnt have any ideas  it has plenty of those, involving AI and transhumanism and privacy and corporations. Unfortunately, all of these ideas have been presented in more original ways with more interesting and insightful things to say by media ranging from Blade Runner (the obvious touchstone here), to the Deus Ex series, to VA-11 HALL-A, to The Matrix.  What really bothers me about the game is its complete lack of subtlety. State of Mind is the kind of game where the Kurtz corporation is omnipresent, and where a suspiciously clean, shiny-looking main character is named Adam Newman. I appreciate that the games creators are proud of themselves for having a passing acquaintance with Heart of Darkness/Apocalypse Now and The Bible (not to mention the other media listed above), but I dont think itd be possible for them to telegraph the games intentions any harder.Worse still, having established very, very early on how the story is going to unfold, State of Mind then proceeds to spend 12 hours or so telling its story in painfully dull detail. I get that people want to feel like theyre getting their moneys worth, but theres a lot to be said for the ability to tell a story in a succinct manner  doubly so when the alternative is, apparently wandering around a point-and-click adventure thats two or three limes longer than it needs to be, and triply so when one of the other main characters, Richard Nolan, is an obnoxious jerk.I really cant emphasize that last part enough. Even if everything else about State of Mind were perfect, Nolan is unpleasant enough that he would single-handedly drag the game down. As fun as antiheroes can be, theres a fine line between charming rogue and total douchebag, and theres never a moment in the game where Nolan even comes close to falling on the right side of that divide.If State of Mind has any kind of saving grace, its that it has one heck of a visual style. I dont know if it was a deliberate stylistic decision or merely a cost-saving measure to hide the fact the developers didnt have the budget to create a dazzling world of the future, but for whatever reason, the game looks like a vision of a world where the polygonal games of the PS1/N64-era didnt give way to smoother 3D graphics, but rather just started looking smoother. In the wrong hands, it couldve made the game look incredibly dated, but, impressively, State of Minds developers managed to imagine a futuristic polygonal world that looks kind of cool.", "date": "January 3, 2019", "grade": "C-"}