{"name": "Rest in Pieces", "ref": "https://gaming-age.com/2019/10/rest-in-pieces-review-for-nintendo-switch/", "text": "One of my biggest pet peeves about games making the jump from mobile to console is that you can occasionally see the gaps exactly where the in-app purchases used to be. (I mean, its worse when they pull an Asphalt 9 and just leave all the in-app purchases in the game, but I digress.) Some games figure out a way around that change by altering their gameplay accordingly, but others do not, leaving big, gaping holes that dont entirely make sense.Rest in Pieces, unfortunately, is a perfect example of the latter.First, a quick explanation of how Rest in Pieces works. Think of it as a slight twist on the endless runner formula, where instead of running, youre controlling characters whove been transformed into porcelain figurines by various monsters, and who are swinging from side to side by their little strings. Their goal is to reach light three times, which in turn frees them from their figurine prisons. Do this 18 times, and you save all 18 characters.The problem with this is that you need to pick up gems in order to unlock new characters  and, as you can probably guess already, those gems are dealt out very sparingly. In the mobile version, of course, this is a means to getting players to shell out real money in order to buy bushels of gems to save yourself the hassle of improving. Here, however, there are no in-game purchases, which means that youre stuck grinding your way through the same levels over and over again, hoping youll be able to eventually scrape together enough gems that you can buy the next character, and move on to the next challenge.Dont get me wrong here. Im not saying that Id like it if Rest in Pieces had included in-game purchases on top of its purchase price; that would be ridiculous. I am saying, though, that it would have made sense to be a little more generous with the in-game gems, since this isnt the sort of game that lends itself to grinding.That said, I dont mind spending a bit of extra time with Rest in Pieces. For one thing, even if the gameplay doesnt have too much in the way of variety  different figurines have different weights, so you occasionally have to switch up how wide you sway, but it doesnt vary all that greatly  its still pleasantly hypnotic to watch your figurines sway from side to side. Further, the games got a wonderfully creepy aesthetic. Because it doesnt have to do too much, it allows the monster at the top of the screen to be all dark and scary-looking, while the environments may be in shadows, but they still look super ominous.Still, I have limits on how much I want to see the same places over and over again. Its not hard to imagine Rest in Pieces being tweaked just so (i.e. being more generous with its coins) in a way that solves its problems, but as it stands, its too stuck on its mobile roots to live up to its full potential.", "date": "October 25, 2019", "grade": "B-"}