{"name": "The Lost Child", "ref": "https://gaming-age.com/2018/12/the-lost-child-review-for-ps-vita-ps4-switch/", "text": "Its never a good sign when the most interesting thing about a game is its backstory. But that, unfortunately, is the case with The Lost Child. Its the sort-of sequel to El Shaddai: The Ascension of the Metatron, a 2011 action-platformer from Sawaki Takeyasu that was very heavy on religious themes (as the religiously-inclined may have gathered from the title). Its been a long time since I thought about El Shaddai and an even longer time since I played it, but I do remember that it was a) visually impressive, and b) pretty dull.One of those things can also be said about The Lost Child  and as a dungeon-crawler, one guess as to which one it is. (Spoiler: its not that interesting a game to look at).The Lost Child falls into repetition pretty quickly. Once it dispenses with the backstory something involving heaven and hell and angels and demons and The Chosen One  it quickly throws you and your the busty, scantily-clad angel companion into dungeons, where you grind your way through endless hallways, engaging in turn-based battles with demons and occasionally stumbling across booby-trapped treasure. While theres certainly a lot of plot, as evidenced by the fact everyone you meet at first seems to speak in expository paragraphs rather than anything like normal dialogue, quantity seldom equals quality, and thats definitely the case here.To their credit, the battles are actually slightly different from the usual DRPG fare. Unlike most games, where you build and manage your parties using other characters, here you and the angel have the option of capturing all the demons you encounter, purifying them, and putting them to work fighting alongside you. Consequently, as you make your way through the dungeons, youre also constantly upgrading both your skills and those of your monsters and juggling monsters in and out of your party. Its an interesting twist that other DRPGs would be wise to consider.That, however, is the only thing interesting about The Lost Child. No matter how many different demon allies you can create, at the end of the day it still feels like the game is one long procession of dark hallways punctuated by incredibly frequent (and, to the games detriment, incredibly repetitive) battles, with the odd stilted conversation that will make you eager to get back into the battles. Much like its predecessor, The Lost Child ends up being long on ideas, but short on fulfilling them.", "date": "December 13, 2018", "grade": "C"}