{"name": "The Gardens Between", "ref": "https://gaming-age.com/2018/12/the-gardens-between-review-for-ps4-xbox-one-switch/", "text": "I have no way of proving this, but I feel like The Gardens Between was born when someone heard the phrase two steps forward, one step back and they let their mind wander a little.After all, thats basically what this game is: a bunch of puzzles that consist entirely of moving two young friends backwards and forward in time. You make them run forward, and one grabs a lantern; you then rewind them a little, and the other changes something about the course in front of them. Repeat many, many times until theyve reached the end of the level, and then repeat and repeat and repeat again for the next two hours: voila, you have The Gardens Between.For the life of me, I cant figure out if I like it or not. There is, to be sure, a lot to like. For one thing, its gorgeous. The game is set in some dreamlike world where two friends run around a mini-mountain full of all kinds of childhood trappings  dinosaurs, computers, VCRs, and all kinds of other knick knacks that are sure to trigger feelings of nostalgia, particularly for people of a certain age. Everything looks bright and crisp and clean, and even the levels that take place during nighttime still jump off the screen.Even some aspects of the game that may seem less-than-stellar actually work in The Gardens Betweens favour. Theres not much of a plot, but there doesnt need to be one  this game is more about evoking feelings of childhood, rather than relaying them. Likewise, its a pretty short game, the kind of thing you should be easily able to beat in two or three hours, but thats only a problem if you want every game to give you dozens of hours of content  and The Gardens Betweens developers clearly had a short, intimate story they wanted to tell.At the same time, though, its a good thing that they didnt try to stretch it out, because even for that short running time, it feels like they do all there is to do with the concept (particularly within these confines), and then some. While the puzzles are interesting, theyre also not all that difficult, and by the end of those two or three hours, itll almost certainly feel like the game has started repeating itself.But thats where a short play time is a blessing. The Gardens Between is good enough to get you interested in what it has to say, and smart enough to know exactly what to bow out. Its not perfect by any means, but its the kind of game thats aware enough of its limitations that it doesnt need to be. Go into it expecting a fun little diversion rather than an all-time classic, and you should find just enough here to make it enjoyable.", "date": "December 12, 2018", "grade": "B+"}