{"name": "Just Cause 4", "ref": "https://gaming-age.com/2018/12/just-cause-4-review-for-ps4-xbox-one-pc/", "text": "San Esperito, Panau, Medici, you think after toppling 3 dictatorships Rico Rodriguez would hang up the grappling hook, sit on a remote beach, beer in hand and enjoy some time to himself. However that would mean the series is over and you know that isnt going to happen. Just Cause 4, the latest entry in this open world series pits Rico against an industrialist/dictator on the brink of unleashing a weather control weapon upon the world. Featuring a new engine, dubbed the Apex Engine will Just Cause 4 be Ricos grandest and most beautiful adventure to date?First impressions are always important and unfortunately this title takes a huge tumble. The initial in-engine cutscene is quite jarring, lighting is off, some of the textures look muddy and weird. The character models look like theyve all had way too much plastic surgery. The characters pupils look glassy and lifeless. It was quite surreal to sit through most cutscenes in Just Cause 4. However once youre in control Rico, things get better. In the right hands Rico can run, jump, shoot with the best action heroes the 80s had to offer. Which is strange that unlike the previous outings where liberating a region would consist of destroying every brightly red explosive fixture in an enemy base. A sizable amount of Just Cause 4s missions involve turning on a generator, shutting down a generator or getting to a terminal to let a remote hacker hack something, or escorting a local hacker to hack a terminal. Identifying objectives can be a hassle as the game does not make any attempt to filter non-mission related elements when you pull up the games AR mode.Ricos grapple is still the star of the show and paired with the wingsuit and parachute is still one of the best methods of traversal in the game. So the team at Avalanche looked to augment it by adding new gadgets to it. The results are somewhat mixed. The gadgets can be fun to use and highly customizable, but in the heat of combat, managing the loadouts to ensure youre using the right gadget adds unnecessary complications that will likely get you killed. I cannot tell how many times I wasnt able to flip a switch because I somehow attached a booster pack to a switch. I got to a point where I would just have one of the three loadouts completely devoid of gadgets so I can complete missions without worrying about using the wrong gadgets.No one really comes to Just Cause for story, but the team makes an effort to shoehorn one in there. Promotional materials hyped up the existence of Gabriella Morales, the leader of the Black Hand, which apparently was the mercenary group Rico has encountered in his previous adventures. Despite all the buildup, Gabriella is relegated to in cut scene appearances and her storyline dissipates as the game progresses. Another major plot point of this game was Ricos fathers role in developing the weather weapon. Just like Gabriella, this almost feels like a McGuffin.Weather was a big bullet point in the games marketing and like other things about this game is hit or miss. The extreme weather is there, but its appearances are limited and nothing like the extreme weather seen in another Avalanche title, Mad Max. The implementation is rather static and once you gain control of the equipment that can manipulate those weather systems, youre not able to weaponize it, so the only point of reactivating the inclimate weather is just if you wanted to see something that isnt the standard day/night cycle.Despite the negatives regarding plot, the weather elements, visuals and some ui issues, theres still a very large and fun sandbox found in this title. I still will start the title to just to tackle the hundred plus challenges as well as trying to ensure I am on top of the leaderboard against my friends on the feats the game tracks. Im sure Rico will still have more countries to liberate and hopefully the team will have gotten a handle of the Apex Engine.", "date": "December 11, 2018", "grade": "B-"}