{"name": "The Long Reach", "ref": "https://gaming-age.com/2018/12/the-long-reach-review-for-ps-vita-ps4-xbox-one-switch/", "text": "If The Long Reach existed in a vacuum, itd probably seem pretty interesting. The fun of 2D horror games are that they show that the power of horror doesnt come from jump scares or gore, but rather moody tension and strong stories. The Long Reach is no slouch when it comes to tension and plot.The thing is, there are so many other games that have covered this ground before that its hard not to see The Long Reach as being just another entry in a long line of 2D horror games with retro graphics and a creepy atmosphere. Just off the top of my head, in recent years theres been Lone Survivor, Claire, Home, Uncanny Valley, The Count Lucanor, and Poltergeist, and I know Im forgetting quite a few others. While not all of them were good, they still exist, and The Long Reach doesnt do anything so well that it manages to transcend its peers, let alone stand out.That said, even if it doesnt do anything spectacularly, that doesnt mean it doesnt do anything right at all. In terms of creating and maintaining a spooky atmosphere, its not that far behind Lone Survivor. It has a strong score, and it makes good use of darkness and shadows to hint at monsters lurking just around the bend.Unfortunately, its problems are also equally obvious. The Long Reach has a bad habit of undercutting its tension with humour; while theres obviously a long history of horror games and films using jokes their advantage, here they have a tendency of draining all the fright out of a scene. Similarly, the fact you have to click on everything in order to see if it has a use means that youre spending more time thinking about how the game wants you to solve a puzzle than you are on the (fairly creepy) mystery.Again, none of this makes The Long Reach a bad game, by any means. But it also means that if you want to see the class of 2D horror films, you need to check out Home or Lone Survivor. If you want to see what else is out there in the genre, thats when you can think about The Long Reach.", "date": "December 10, 2018", "grade": "B-"}