{"name": "Conga Master Go", "ref": "https://gaming-age.com/2019/10/conga-master-go-review-for-ps-vita/", "text": "Ive never been very good at rhythm games. This, I assume, is because I have almost no rhythm. As such, youd think Id be terrible at a game called Conga Master Go.Luckily for me, while Conga Master Go is all about music and building up the longest conga line imaginable, its not a rhythm game. Rather, a better way to think of it is as an heir to the classic Snake game, where you build a longer and longer line the further in you get. There are a few major differences, but Snake is a much better starting point from which to consider this game than, say, Rock Band or Hatsune Miku.In other words, the goal and the gameplay of Conga Master Go is actually fairly simple and straightforward. You start off going into a club all by yourself, and your enthusiastic dancing is so infectious that everyone on the dancefloor cant help but gradually join in. You pick up dancers simply by going around and around them until they hop in line behind you. Where the game differs from Snake is that your line can cross itself, which can lead to the funny spectacle of dozens of dancers surrounding a holdout as they conga him into submission.The other area in which Conga Master Go differs from Snake is that you have obstacles here that actively worth against you. Theres a momentum bar, for starters, that gets harder to keep up the longer your line gets. There are janitors scrubbing the floor whose wake of suds can make you careen out of control, muscle-bound idiots who punch you for getting too close, waiters whose bottle service will make you slightly inebriated, and, inexplicably, pigs, whose presence in your conga line will severely decrease your momentum. There are also banana peels littered all over the place, which will send you flying away from wherever you intend to go.Its important to note that Conga Master Go isnt a particularly deep game. What you see in the first level is what you get for the rest of the game, even if it gets more difficult the more clubs you visit, as the number of people you need to get increases at each stop. Theres an endless mode, but its basically the same as story mode, only it takes place in a single club. (Also, story nome is a misnomer, since theres not a plot to be found here.)But even if its not deep, its still very fun. The music is catchy and the gameplay is addictive, and it all adds up to make Conga Master Go one of the more enjoyable games Ive played in awhile.", "date": "October 4, 2019", "grade": "B+"}