{"name": "Punch Line", "ref": "https://gaming-age.com/2018/11/punch-line-review-for-ps-vita-ps4-pc/", "text": "The more I play Punch Line, the more it seems like the platonic ideal of a Vita game. By that, of course, I dont mean that its the handhelds best game. No, I mean that if you were to try to describe a game that single-handedly captured everything there was to know about the system, itd probably look something like this. Its Japanese, its a visual novel, its pervy, its about high school students  and, if you can look past the surface, youll find a game thats surprisingly good. If that doesnt describe, like, half the games on the Vita, I dont know what does.Ill talk about the first part of that description first. As youd expect from an M-rated visual novel, Punch Line isnt the kind of game youd want to play in public. It follows one Yta Iridatsu, a high school student who dies moments into the game because of reasons, and who discovers in short order that a) he, as a ghost, he gets massive nosebleeds and faints at the sight of girls underwear, and b) if he sees underwear twice, he gets too excited, which in turn causes the world to be destroyed by an asteroid. As you can probably guess, this means Punch Line features all kinds of scenes involving girls in short skirts, and it constantly manufactures reasons why they need to be bending over.Im not going to lie, it can all feel pretty juvenile.As I said, though, its important to look past the surface. Do that, and youll find that Punch Line is actually a little more complex than it sounds. This is because its made up of two parts: a visual novel, through which the game tells its story, and what it calls trick sections, which are essentially puzzles that have to be solved. The trick sections recall games like Ghost Trick, where, as Ytas ghost, you have to set in motion a series of events that help you achieve certain outcomes  i.e. you knock item A off a shelf, which sends a person to room B, where in turn they find item C that reminds them to go visit someone else. It requires a lot of trial and error to figure out the right sequences, but thats what makes the game worthwhile. Admittedly, while youre doing all that you have to avoid seeing the game from angles that provide you an unobstructed crotch view, but if you can look past that  and from the games point of view you should, since it ends the world  there are some pretty challenging puzzles to be found here.Whats more, the visual novel sections arent as bad as you might expect. Theres undeniably a lot of yelling and gratuitous upskirts, but at the same time, the game has an intriguing mystery at its core, and the animated cut-scenes look far better than nearly any other visual novel Ive ever seen.If this all seems like an odd combination  a fan service-heavy visual novel with occasionally impressive visuals and shockingly good puzzles  its worth noting that Punch Line is the work of Ktar Uchikoshi, whos better known for being the creator of the Zero Escape series, which featured the same mix of drama and challenging puzzles. While the two dont seem to have much in common beyond a creator, once youre aware of the connection, suddenly you start to suspect/realize that theres more at play here than meets the eye.Of course, getting to that point requires overlooking a lot of stupidity involving underwear. And Im not going to lie: you may feel embarrassed to be playing Punch Line precisely because of that. If, however, you can make it to the puzzles, you may just find theres something here worth checking out.", "date": "November 30, 2018", "grade": "B"}