{"name": "Sunless Sea: Zubmariner Edition", "ref": "https://gaming-age.com/2018/11/sunless-sea-zubmariner-edition-review-for-ps4-pc/", "text": "To fully appreciate Sunless Sea: Zubmariner Edition, you have to be a certain type of person. You have to be someone who adores text-based games with a Victorian Gothic aesthetic. Moreover, you have to be someone who is really into open-ended gameplay, and who doesnt mind if a game has no interest whatsoever.Iam not that type of person.Dont get me wrong, I can totally see how someone could fall in love with Sunless Sea. It may not offer much beyond a top-down view of a boat moving around a vast, seemingless endless sea in terms of its graphics, but it manages to wring every bit of tension from that scenario with minimal light, dark colours, and aggressive enemies who can appear at any time.On top of that, its writing does a good job of ratcheting up the tension, by giving you just enough detail to understand the horror of what youre watching (particularly when it mentions in passing that you have the option of eating a crewmate whos just died), but not so much that it hits you over the head with it. Likewise, the music is sparse and minimalistic, but finds a way of using this minimalism to its advantage. Its perfect for setting the tone Sunless Sea is trying to achieve, and its so good that Im listening to it via the games title screen as I write this review.The downside of this minimalism extends to the gameplay as well, which is where the Sunless Sea kind of loses me. Its not that the game is necessarily difficult in terms of its mechanics, but it also doesnt go out of its way to explain anything, either. Given that were talking about a game thats upfront about your death being the one constant (because every time one of your captains die, you continue playing as whoever succeeds him/her/them), it almost feels like the game is being difficult just for the same of being difficult. And to be sure, some people will love that. If you like endless death served up with a generous helping of moody Victorian horror, then Sunless Sea: Zubmariner Edition should definitely be on your radar. If that doesnt grab you from its description, however, be warned that youre probably not going to find the game itself any easier to pick up.", "date": "November 26, 2018", "grade": "B"}