{"name": "Call of Duty: Modern Warfare II (campaign)", "ref": "https://gaming-age.com/2022/11/call-of-duty-modern-warfare-ii-campaign-review-for-pc-playstation-xbox/", "text": "As someone who has been playing Call of Duty since the original Modern Warfare trilogy, it has been quite a ride watching the way this series has evolved over time. Characters in the stories each game or series told came and went, but the old Modern Warfare characters are the ones that always stuck with me in my mind. Sure- Mason, Woods, and co are an amazing story themselves in the Black Ops series, but Ghost, Captain Price, Gaz and Soap are the  Call of Duty characters of note. Why? Im not sure. Maybe its because they were the first trilogy, the first venture into less narrow storytelling for Call of Duty games. Or maybe, its just a beautiful adventure thats hard to forget, with so many twists and turns and Hollywood blast moments that youll always remember how unique some segments are.This is a fact that has managed to stick around in the revival of the Modern Warfare series. I felt wary about it back in 2019, when the previous Modern Warfare game released. Oh no, you mightve heard me say to myself at the time, theyre trying to shoehorn in a character that already has a finished storyline. But that worry was thankfully unfounded. Modern Warfares story was a masterpiece in military action movie storytelling, with just as many memorable missions as old Call of Duty 4 had. By the time you got to the ending of the first game of the new series, it had you feeling great. Wanting to see whats next; and then they drop the names of all your favorite characters from 2007. Price reads them off one by one- Gaz, Soap, and Ghost. Ooh boy, let me get to that next story, the gangs all there.I will attempt to avoid any spoilers that I could possibly drop in this and just give you a question posited as from you and an answer. You ask Is the campaign worth playing?. I say Absolutely. You not only should play it, you must play it. I will go into further details below, but still be avoiding talking about anything that would constitute spoilers, so dont be worried to read through if you havent played any yet.Now, Modern Warfare II is here, after waiting 3 long years since the ending cutscene of the original release. Was it worth it? Oh god, yes. Any fears I had 4 years ago, hearing about the reinstatement of major characters that hadnt been seen in 9 years is at this point totally smashed in the ground. This campaign was such a beautiful piece of work throughout. Through cinematics and gameplay alike, honestly- this might be one of the most Hollywood blockbuster feeling video game stories Ive played. All of the characters have more personality than theyve ever had, and the dynamics between them are great. For the larger part of the story, the four main characters are separated into two teams of two. Soap is with Ghost, and Gaz is with Price. Each duo has their own group of side characters, and bounce in and out of being a full team of four.The two duos share a similar dynamic between their given partners, each with one playing the old, seasoned vet and one playing the new guy role. Gaz and Soap being the new guys and Ghost and Price being their revered selves. Soaps role has him semi-star-struck by working alongside Ghost, which provides a lot of humorous quips throughout the length of the campaign. Honestly, as much as Price is the old favorite, I think Ghost took it away in this story. Ghost as a character is much further expounded upon, allowing him to have an actual personality beyond that edgy cool guy that wears a skull mask that he was in the OG Modern Warfare trilogy. I mean, he still kind of is that as well, but the other characters do at least acknowledge and question him about always wearing the mask this time around. Throughout my time with the campaign, it felt like each mission was doing its best to one-up the last by trying to have the most memorable scene. The graphical quality and cutscene camera work that Modern Warfare II is able to squeeze out in the modern day is nothing short of astounding at many turns. Even outside of cutscenes and graphical flashiness, the unique mechanics available in each mission was surprising to encounter each time. There are a lot of memorable mechanics that have not really been a thing in previous CoD titles that Im just going to avoid mentioning because you need to experience them for yourself. Also of note, there is a lot less linearity to the missions this time around. Its not full-blown freedom of choice or pathing, but the way you approach situations has a lot of variability allowance. Many missions have segments that you can sneak through and take out enemies silently, or choose to go loud and run and gun. If you need to clear out a building, use the new climbing mechanic to get on the roof, open the ventilation, and chuck a tear gas grenade in. Bust through the skylight and get everyone before they can recover. Or maybe instead, sit prone up the hill and work on taking out all of the enemies one-by-one Hitman style. You only have one path of progression, but how you choose to tackle it is much more open than Call of Duty has ever allowed in the past.So my closing remarks are to say please, please play this campaign. You are doing yourself a disservice if you dont play this if youre someone who likes action movies. The multiplayer will be there waiting for you, and season 1 doesnt even come out until November 16th anyway. Youve got plenty of time to plow through this story before all of your friends leave you in the dust, being 8th prestige while youre stuck at work. Speaking of, we will be releasing a separate review regarding the multiplayer for Modern Warfare II, so keep an eye open for that in the upcoming week as Tyler and I grind through the levels.", "date": "November 4, 2022", "grade": "A"}