{"name": "God of War: Ragnark", "ref": "https://gaming-age.com/2022/11/god-of-war-ragnarok-review-for-playstation-5/", "text": "While not as shocking of a change as 2018s God of War reinvention, God of War: Ragnark has proven itself a fantastic follow-up over the 40+ hours Ive spent playing it. Ragnark, like a good, traditional sequel should, expands upon ideas and mechanics from God of War in ways that feel like a natural evolution of the 2018 game. Kratos and Atreus journey across the Nine Realms is fully realized here, making for a fantastic visual and gameplay feast that is sure to please the many fans that God of War: Ragnarks predecessor gained.Ragnark picks up shortly after the events in God of War, with a slightly older Atreus, and a somewhat more fatherly Kratos, but not without their fair amount of familial strife. Their relationship has improved, but isnt completely mended, and is now being tested as the Nine Realms are fully engulfed in the results of Fimbulwinter, the precursor to the world ending threat of Ragnarok. Fimbulwinter gives the developers the opportunity to change the landscape in interesting ways, casting Midgard into a deep winter, but affecting other realms visited in the prior game in different ways, allowing for new gameplay mechanics and twists on familiar locales. It works well, and while youll likely see locations you recognize from the last game, the changes made to the world keep everything feeling fresh and new.The general open-world design elements from God of War are also present in God of War: Ragnark, so while each realm is its own, separate location that youll travel to via Dwarven backchannels, each of those realms have open areas to explore, with side quests, mini-bosses, puzzles, collectibles and more. This is in line with the prior game, and hasnt changed up a ton here. For the more open areas youre given some mode of faster transportation, like a boat or sled, but youre also able to traverse most maps on foot, and the map function itself will highlight points of interest that you can have added to your compass.That said, the general map for each realm is my one big gripe about God of War: Ragnark, and was often a point of frustration for me. It very much feels like a form over function kind of thing, where the map provides some understanding of your general location and highlights points of interest, but does a poor job of representing different points of elevation, blocked paths, and also lacks the ability to place your own markers. If youre looking to go back and pick up collectibles, or revisit areas once youve gained new abilities, it will start to feel cumbersome overall. Likewise, I found the compass function to be a poor substitute for an always on-screen mini-map, as it would often go haywire when I got too close to an objective marker.On the plus side, combat in God of War: Ragnark is still amazing, and the wonderful tossing mechanic for the Leviathan Axe remains intact and a central part of gameplay. Without being too spoilery, youll gain access to a few new functions, and the skill trees for Kratos and his companions are fun to unlock, giving you a whole host of neat abilities to keep combat encounters fresh and entertaining. The companion aspect in Ragnark is even more fleshed out this time around, allowing for a few guest spots throughout the adventure in lieu of Atreus and his bow slinging, which was fun to see. Again, I dont want to go into too much detail due to spoilers, but theres some fun surprises here.Likewise, puzzle solving remains a big element, much like the prior game, with tons of environmental puzzles to solve. None of these are particularly challenging, but do play around with your various combat abilities a bit, and while the game does offer the occasional helpful tip from your companion, it still requires you to think a bit in order to solve an obstacle. That said, if youve struggled with timing on certain puzzles in the prior game, or had trouble seeing what you can interact with, youll also be happy to see there are a number of accessibility options that can affect all sorts of gameplay mechanics, including the puzzles. Its nice to see this stuff included for people that need them, and its great to see these options utilized by more developers in this generation cycle.Finally, its also worth noting that God of War: Ragnark looks absolutely amazing on PS5, and runs extremely well. There are essentially 4 video options, and while none explicitly state what framerate they are targeting, youll be happy to see you dont have to sacrifice much in the way of visual fidelity to achieve an FPS above 30 here. If youre wanting something beyond 60 FPS, youll also have that option provided your display set allows it, which is something that feels and looks amazing for a console game of this magnitude. .I came away from God of War: Ragnark very impressed with what the team at Santa Monica Studio were able to put together, and I think you will be too. Its a fantastic sequel to one of the better game releases on Sony hardware in the past decade, and delivers fully in every meaningful way, making this a true showcase game for current-gen hardware. It also doesnt skimp out in the gameplay department, offering up lots of hours of enjoyment, while pacing itself out in a way that puts a lot of other open-world style games to shame, keeping you hooked throughout. Id highly recommend checking out God of War: Ragnark when it drops on November 9th, you will not be disappointed.", "date": "November 3, 2022", "grade": "A-"}