{"name": "Starlink: Battle for Atlas", "ref": "https://gaming-age.com/2018/10/starlink-battle-for-atlas-review-for-nintendo-switch-ps4-xbox-one/", "text": "When Ubisoft showed off Starlink: Battle For Atlas at E3 2017 I paid little attention to the game. It looked like a simplified No Mans Sky combined with the declining toys-to-life category and I really wondered how this game was going to be compelling enough to draw interest from the gaming crowd. A year later, at E3 2018, the game was shown again, but this time it had a new hook for Switch owners: Fox McCloud and gang would have starring roles in the space epic. My interest was piqued, but I still wasnt sold. My biggest concern was that the game would be short and that content would be locked behind having to buy new ships, pilots, and weapons.Still, the more footage I saw of the game, the more enticing it became and so when the review copy came in I jumped at the chance to dive in. Over the last three days Ive put in over 25 hours into it and I have to say that Ubisoft definitely has a winner with Starlink, and if you enjoy exploring, building up bases, and upgrading your characters, ships, and weapons as much as I do, the addicting gameplay mechanics will keep you glued for days and weeks on end.Lets address the elephant in the room right away. No, you dont need to go out and drop tons of money on the toys to enjoy Starlink. If youre buying a physical version of the Switch game, youll get one starship (the Arwing from Star Fox), two pilots (Fox McCloud and Mason), two weapons (the flamethrower and the frost barrage), and the grip that holds the Joy-Con controllers and the ship.If youve played games like Skylanders, youll know that there are certain advantages to having specific elemental attacks. Heat and Cold are packaged in, but there are also Kinetic, Stasis, and Gravity powers. These come in handy against specific enemies as well as to destroy blockades made out of crystals and to open specific canisters. Now, you may wonder what happens when you come across an area thats blocked off and you dont have the right elemental weapon to blast it open. In most cases there will be canisters in the vicinity that contain various energy powers that you can pick up and then throw to blow up the obstruction or to solve some of the games puzzles.If you do own the physical toys, its as simple as taking off one of the guns on your ship and snapping on the one you want to use! Its fast and easy and fun  so if you can afford the physical game and some extra toys I think its the way to best enjoy the game. Alternatively you could purchase the digital deluxe bundle pack version of the game ($79.99) that includes six ships, ten pilots, and fifteen weapons. This is only five bucks more than the physical edition of the game and is by far the best value.Customization is a key component throughout the entirety of the Starlink experience. Whether youve got the physical toys or youre playing the digital version, you have a wide array of options available to you. You can add on up to three different wings on each side of the ship, each of which will not only make the ship look unique, but also have a direct impact on its stats, like defense, speed, or energy. From there you pick which weapon you want to equip on each wing. If youre using the Arwing and decide to not place any weapons on a wing, youll have access to the standard laser cannons. Of course you can utilize any pilot with any ship and each pilot has his or her specific skill trees and abilities to consider. Each character has a special that must charge up to activate. For example, Fox calls in one of his teammates to fly in and attack the enemies, whereas Judge lets you slow down time to really deal some damage (great against bosses). The more you use a pilot, the more experience theyll earn and youll be able to unlock other traits.On top of all this, each part of your ship (both wings and the ship itself) can level up and get stronger. Plus, youll find all sorts of ship and weapon mods scattered about the various planets. These are one of the main collectibles in the game and youll be able to slot them into each weapon and ship you own. They will offer up stat boosts, like better defense, faster rate of fire, less time to recharge boosters, better handling, increased elemental damage, and the list goes on and on. These mods have different tiers, and if youve ever played a game like The Division or Destiny, youll be familiar with the colors: white (common), green (uncommon), blue (rare), yellow (epic), and orange (legendary). Your base of operations, a huge ship called the Equinox, can also be upgraded by spending points you earn for various tasks, and one of the perks allows you to morph the mods to the next tier if you have three of the same ones. I fell into a massively addicting loop of constantly enhancing my mods so I had the latest and greatest stat boosts. Yes, theres a surprising amount of depth to this game that I absolutely didnt expect. Although it might sound a little daunting, the game does a good job of doling out the information in piecemeal so it never feels overwhelming.Unique to the Switch version are the Star Fox story missions. I must say Ubisoft has done an admirable job of integrating these characters into the cinemas and weaving them in and out of the story beats. I can sort of tell at times where theyve been spliced in, but its great to see they get their own missions to go on and its not just window dressing. I played most of the game as Fox and with the Arwing and its simply a blast to play. Many of the moves youre used to, like the barrel roll and the 180-degree flip are here in all their glory. New functionality, like the ability to activate an energy shield comes in handy, and if pulled off just right you can even deflect enemy shots back at them.Unlike the traditional games in the Star Fox series, Starlink is not an on-rails shooter. Instead, its an open-world exploratory game. Youll be able to hover or fly around one of a handful of planets while you blow up crates, loot chests, scan wildlife, pick up local minerals and fruits, and of course take down bad guys. Whats really cool is that you can take to the air at any point and if you keep your nose pointed at the sky youll seamlessly launch out of the atmosphere and into space (no load times). Once there you can activate your hyper drive to reach distant planets, but along the way youll have to avoid asteroids and pirate traps. Tons of space junk and derelict spacecraft litter the galaxy so you may want to explore those areas to obtain higher-end mods and other goodies.One of my favorite things to do in games is to explore every nook and cranny, and with multiple worlds to discover, I found myself absolutely obsessed. There are items littered about everywhere to collect. Most of them are resources of some sort that can be used to upgrade facilities that youll find on each of the planets. Observatories will reveal more of the map for the region and they accept anything organic for study. By finding things like fruit and vegetation and then turning it in at an observatory youll be able to earn more money and also work toward upgrading the facility (up to level three), which increases the range of the radar and also your standing with the civilization on that planet. There are also refineries that will let you turn in materials like metal parts and minerals. If you manage to upgrade these structures, theyll continuously work to earn you money and the more of these that you bring online and level up, the richer you become  which helps with upgrades. As you progress the story, youll reach a point where the Legion (the bad guys) and the indigenous people are waging battles against one another on each planet. A gauge will appear alongside the worlds to show you who is currently winning, so you may have to return from time to time to assist the resistance.Part of what makes Starlink so fun to play is its impeccable controls. Simply put, maneuvering the ships is easy and enjoyable. The combat is frenetic and exciting and the controls never get in the way  something so many other games have problems with. The ability to change your weapons on the fly (simply changing them on the toy or via a menu screen if youre playing digital) works well and part of the joy is discovering how each weapon works with the other. One of my favorites is to use a gravity weapon, which creates a big energy bubble, and then to shoot either a heat or a cold weapon into it to create either a fire or frost vortex, which can do massive damage to a host of enemies trapped inside! Space combat can be a little trickier since enemies can fly at you from any direction. I recommend equipping the Levitator or the Frost Barrage since the missiles track the enemies, making them easier to hit. The point is, you can come up with a number of different strategies just by messing around with the various load outs at your disposal, so experiment away!Just like The Division and Mario & Rabbids, Starlink runs on Ubisofts Snowdrop engine, and the Switch handles it extraordinarily well. The graphics are impressive both in handheld and TV modes. If Im being nitpicky there is some pop in here and there and sometimes texture resolution takes a split second to adjust, but for the most part the game is strikingly beautiful. Each planet has its own distinct look and the colors are striking and the lighting is fantastic. There were several times where the sun was rising or setting and the light was so bright that I couldnt see what was going on and for a split second I forgot the Switch doesnt have HDR technology. Little details like the jet thrusts coming off the sides of the ship when you turn and the particle and distortion effects under you craft as you hover above the ground show the extra care that went into the visuals. This is one of the best looking games on the Switch and its even more impressive when you consider the open world nature and free roam aspect of the entire thing. Im sure the PS4 and Xbox One versions look even better with the extra horsepower, but the extra missions and Star Fox tie-in more than seal the deal for me.Most of the time the game doesnt have some amazing epic score playing in the background. Exploring the planets usually results in ambient sounds and softer music. However, if you get into a major fight the soundtrack really kicks into gear and the main theme song that plays during some of the cinemas often swells up and is quite good. All of the voice acting by the main characters is great, although there are a few aliens that sound a bit disturbing. The game makes excellent use of surround sound throughout and I often could tell where an enemy was attacking from just from the sound of the laser blasts. I really appreciated the Star Fox theme playing when you call in your team for assistance and all of the main crew sounds like they should. Combine the audio and visuals with HD Rumble and the game has some of the best production value on the system.With an entertaining story, precise controls, captivating gameplay, and worlds that are enticing to explore, Ubisoft really knocked it out of the park with Starlink. Add in the Star Fox characters and unique missions, and youve got one of the best games of the year. Small little quibbles, like repetitive enemy design, similar tasks and missions on each planet, and an almost laughably non-scary villain do little to detract from an otherwise amazing game. Although some might expect this game to be aimed squarely at a younger audience because of the toy tie-in, I thoroughly enjoyed the adventure and would recommend to anyone who relished in exploring new worlds, collecting items, and leveling up skill trees. While there are high action sequences and puzzle peppered throughout the game, I played at a more plodding pace, more concerned with liberating each planet as much as I could before moving onto the main quests. This did make me a little overpowered in some cases, but I never found it to be a grind like No Mans Sky was.I cant say whether or not you should buy the physical edition or go digital. I guess it boils down to how much money you want to invest in a single game. If you can swing it, the novelty of the toys is compelling and its pretty fun to see how it all works and interacts with the game. Regardless of which version you purchase, Starlink: Battle For Atlas will provide one of the best console space shooters in years, and is now my favorite Star Fox game of all time.", "date": "October 15, 2018", "grade": "A"}