{"name": "Wandersong", "ref": "https://gaming-age.com/2018/10/wandersong-review-for-nintendo-switch-pc/", "text": "Melding music, art, writing, and design into one beautiful packageWandersong is one of the most appealing games on the Nintendo Switch. But at the core, there are some mechanical issues that hold it back.To write about Wandersong is to gush over the score, a hugely consistent and just-whimsical-enough set of tracks that draw you into the story featuring a barely-competent bard tasked with saving the world. It pairs with the bards own singing, a gameplay mechanic used to solve puzzles and occasionally fight enemies.Its this mechanic that defines Wandersong, with its immense amount of charm elevating the game past its already-super synergistic storybook art and sarcastic writing styles. But its also this mechanic that reveals the biggest weakness: the gameplay is largely half-baked.Maybe its because the switch analogue sticks are tiny, maybe its a lack of design foresight, but singing the more complex songs in the game is more a chore than a challenge. This is thanks to a highly-forgiving-to-the-point-of-ignorant system that lets you move from note to note and not hit any all that well but still succeed. I tried, and as long as I kept somewhere near to where the game wanted me, there was no possibility of failure.Its a shame, too, because the game is artistically polished to a point most indies never get near. Storybook visual elements are consistently, sensibly, and perfectly designed. The sound design and soundtrack are spot-on. All of this with a script thats clever, able to tug at the heartstrings a couple of times, and knows exactly what it has to do to keep the tone. Even the gameplay mechanic, when used, changes the environment enough that the music lives and breathes in the worldIf theres one thing that could have taken this from alright to great, the game could have treated its mechanic as an actual puzzle instead of a gimmick. More Zelda-style instrument playing than Moonwalker-inspired song and dance.", "date": "October 9, 2018", "grade": "B-"}