{"name": "FIFA 19", "ref": "https://gaming-age.com/2018/10/fifa-19-review-for-ps4-xbox-one/", "text": "At this point, you more or less know what to expect when it comes to FIFA. Thats hardly a bad thing, obviously, seeing as what to expect is the best sports game around. The on-field product continues to be stellar, with both action that captures the feel of the real thing, and production values that put the competition to shame. On top of that, you have all the bells and whistles that FIFA usually has: a deep career mode, that allows you to be either a player or a manager; all kinds of online options that include seasons, clubs, and friendlies; and, of course, the Ultimate Team (which Ill admit right now Ive never touched, but which seems to be a popular feature for many people).And, as if that wasnt enough, FIFA now has the UEFA Champions League license, which means that you can lead the likes of Paris Saint-Germain or Manchester United to European glory. Even if, like me, your appreciation of the beautiful game only goes as far as FIFA video games and then the World Cup every four years, thats a pretty impressive amount of content that you know going in will reliably live up to a certain high standard.The reason I said you more or less know what to expect is that FIFA also has The Journey, their single-player story mode that sets the franchise apart from its sports game competition. While the first two years of Alex Hunters journey to global soccer superstardom have been stellar, that was no guarantee that FIFA 19 would continue that trend. After all, one of the biggest reasons the NBA 2K series is now a shell of its former self (this years uptick notwithstanding) is that its single-player mode mostly became a vehicle through which 2K could sell Virtual Currency for real dollars. And even if EA resisted the siren song of monetizing The Journey, there was no guarantee that it would live up to the high standards set by its first two instalments.Not to immediately kill the suspense or anything, but: it absolutely does. In fact, this years version of The Journey is its most ambitious yet, broadening its scope not just to feature the conclusion of Hunters story, but also interweaving in plots featuring his half-sister Kim and his friend Danny Williams. With all those balls in the air FIFA 19 does run the risk of having The Journey feel overstuffed, but its to the games credit that it never really comes off that way.Which means, of course, that even in the one area where FIFA 19 could have gone wrong, it doesnt. And that, in turn, means that, much like last year, regardless of what you want out of a soccer game, FIFA continues to deliver an incredible, all-around experience.", "date": "October 3, 2018", "grade": "A"}