{"name": "Astro Bot Rescue Mission", "ref": "https://gaming-age.com/2018/10/astro-bot-rescue-mission-review-for-playstation-vr/", "text": "For those of you who have played around the the Playroom VR app on PS4, you probably remember a mini-game called Robot Rescue, a fantastic little 3D platformer that really showed what VR on the PS4 could do with this genre. Now, that mini-game has become a full fledged action platformer by the name of Astro Bot Rescue Mission. The premise is the same as the original, but that is in no way a bad thing!As the game begins, you see your little robot friends just cruising through Virtual Space, when a weird alien attacks their ship. Robots and ship pieces fly all over the VR universe and its up to you and Astro Bot to set things right. You will travel across 6 virtual worlds, each with 4 areas to get through and explore. in each area you have to rescue your little friends that are scattered throughout the level. Sometimes they can be seen directly in front of you, but other times they are hidden and you have to explore to find them. If can hear their little cries for help as you progress that means you are close and you may have to physically look down, to your side, behind you or even around corners to see where they are. Looking around also helps you see traps and platforms so you can maneuver Astro Bot safely through the level. There are even some enemies and obstacles that you physically have to headbutt to defeat.The amount of interaction here really makes you feel like you are really in the world you see through the lenses of the VR headset. Adding to the interaction are devices you can collect that will give you certain tools to help Astro Bot progress. Things like a Grappling hook for pulling away walls or making tightrope bridges, or a water gun for making flowers bloom into platforms.Your goal in each stage is to rescue your friends. Rescue enough in each level and you unlock the boss battle of that world. These Bosses are massive, and you can really feel their scale when you compare how small Astro and his buddies are to them. Defeating them all comes down to learning their patterns and finding their weak points. If may take you a few tries to defeat them, but they dont throw anything too demanding at you. If you dont rescue enough friends to unlock the boss, youll have to go back into a completed level to find more. Some of your buds are really well hidden so dont be discouraged if you dont find them all in your first playthrough. Also hidden in many levels are Chameleons that can unlock challenge missions you can play whenever you want. There are 26 challenge stages in all and offer a wide variety of fun and challenging events to beat. Well worth the search if you ask me!Visually, Astro Bot Rescue Mission is stunning. Its virtual reality environments really give you a sense of depth and a feeling of actually being in this world with Astro Bot. There are times where I got nervous looking down the poor guy balancing on a narrow platform about to fall off. There are even places that can trigger some claustrophobic feelings while moving under low vaulted ceilings and through some tight corridors. Sound is a bright and cheerful sampling of upbeat music and sound effects that can really put you in a good mood. This is one game you will want to have headphones for, as the music and sounds comes from all directions, even behind you.Control is, for the most part, spot on. I say for the most part as there are some problems with the controller tracking from time to time. It largely doesnt effect gameplay unless you are trying to use one of the controller devices like the water gun, or trying to line up the virtual controller into a connect slot in order to activate a device. You can reset tracking at anytime, but it seems to go weird at random times and isnt the fault of the camera or the controller. A minor gripe that is easily ignored while playing this excellent game!Astro Bot Rescue Mission is an extremely fun and engaging game, and a dynamite addition to the growing PSVR library. At $39.99, it is an absolute bargain for what you get here. Once you start playing you will find it hard to stop. Games like these are the reason why I love PlayStation VR as much as I do. Its a simple concept that works on so many levels here. If you have a PSVR system, Definitely check this one out, I cant recommend it enough!", "date": "October 2, 2018", "grade": "A"}