{"name": "Assassins Creed Odyssey", "ref": "https://gaming-age.com/2018/10/assassins-creed-odyssey-review-for-ps4-xbox-one/", "text": "I wouldnt go into Assassins Creed Odyssey expecting another major shift in design from the series compared to Assassins Creed Origins. This is very much a game built on the groundwork from last year, and akin to how Assassins Creed: Brotherhood was a more refined, complex version of Assassins Creed 2. Odyssey keeps all of the RPG elements along with the loot and gear rarity system, and makes some changes to the Phylakes (now just Bounty Hunters) system from Origins. That said, this isnt a complete rehash, The new player characters are pretty great, the main plot and subplots surrounding them are entertaining, and the world feels a bit more varied than what Origins had to offer. Overall, the more I played of Assassins Creed Odyssey, the more I enjoyed it.This entry centers around one of two characters, Alexios or Kassandra. Youll choose between them at the beginning of the game, but are not able to switch between them like you could in Assassins Creed Syndicate. There are story reasons for this though, which become more clear a little later in the plot. Both hail from Sparta, and yes, you even get a battle torn from the pages of 300 to start out the game. I ended up selecting Kassandra, and found her voice actress to be pretty fantastic overall.The opening island of the game serves mostly as your tutorial area, teaching you the basics of combat, gear, and exploration. You can opt for a more guided experience at the beginning of the game, but if you choose exploration, youll instead need to pay attention to your map a little more. In exploration mode, youll often be given a quest objective that gives you a clue on where to look, like north of a particular city, the middle of a forested area, etc. Once you get close enough, youll get a little notification, and can then send your player characters eagle into the sky to highlight objectives. The eagle mechanic works just like Assassins Creed Origins, and I couldnt discern any real difference with this function.One thing that the opening island does well is introduce the new dialogue choices, and gives you some idea of how thatll affect the game down the road. Early quests can you have save, kill, steal, or otherwise influence various NPCs during main quests or side quests. Sometimes this will result in changes to events later on, like a slighted enemy will join up with another enemy you encounter later, or you may be able to recruit and woo an NPC to join your ship crew. One early example is a side quest involving a few sick people that are about to be quarantined by sword after soldiers burned their village. You can opt to intervene and save them, and down the road youll find out what consequence that action has. Other characters will reference your choices here and there, which adds to the effect of making you feel like your decisions matter.Combat and mobility are pretty much identical to Assassins Creed Origins. You can attempt to dodge and trigger a small slow time effect, or parry weak attacks and throw your enemy off balance. Harder enemies are generally shielded, and certain enemies are tagged essentially as elites/bosses with more health/damage. There are some changes to skill tree options, which are divided up into Hunter, Warrior and Assassin. Each class has its own damage number, and gear will add bonuses to one on more stats in addition to standard dps and armor stats. I specced more towards Assassin than anything else, which in turn gave me abilities focused on poison damage, stealth, and even neat skills like a ranged leap to target where I could chain an additional enemy for a stealth kill. Theres honestly a lot of options in the skill tree overall, and in combination with gear perks you can differ your playstyle quite a bit.As I mentioned before, the roaming bounty hunter feature from Origins returns in Assassins Creed Odyssey. They act almost like the wanted system in GTA. Make enough people mad, either through theft or violence, and someone in the world will put out a contract on you. Your wanted level can go up to five, meaning youd have five bounty hunters roaming around trying to kill you. Theyre not as hard as I remember the Phylakes being in Origins, but theyre also pretty varied with unique stats, names, and droppable gear. In addition, youll encounter mercenaries out in the world at random that you can opt to fight and earn gear from. Also, if your wanted level is high, you can either pay off the bounties via menu, or hunt down the person who put the bounty on you. If you successfully kill them, the bounty goes away.Ship combat features a bit more heavily into Assassins Creed Odyssey, which is understandable considering the region of the world this time around. Combat is effectively unchanged, youll generally either being able to ram, shoot arrows, or toss javelins at opposing ships until they sink. Disable a ship and you can board it, allowing you to collect some treasure in addition to the standard crafting loot. Ships can be upgraded with materials, increasing damage, speed, and ability to equip more Lieutenants, which are earned via quests or by subduing enemies instead of killing them.Essentially, theres a ton of stuff to do In Assassins Creed Odyssey. While Origins was certainly a long game with lots of activities, Odyssey feels like it blows Origins out of the water in that regard. Thankfully, a lot of those activities are generally fun. Even if things like side quest objectives get a little repetitive, at least the rewards for completing things often feels worth while.Id definitely suggest taking a look at Assassins Creed Odyssey, even if youre not sure you need another AC game in your life so soon after Origins. Its a pretty great experience overall, and outside of some the standard open world bugs youd expect in a game this size, I really dont have any major complaints here. I ended up enjoying it more than Origins, and I really liked Origins. Im not sure that I want a third game like this next year, but as far as follow-ups go, Assassins Creed Odyssey is pretty fantastic.", "date": "October 1, 2018", "grade": "A"}