{"name": "Capcom Beat em Up Bundle", "ref": "https://gaming-age.com/2018/09/capcom-beat-em-up-bundle-review-for-switch-ps4-and-xbox-one/", "text": "Its rare that we see something announced and then released so quickly, with little to no inclination that its coming out, but thats pretty much how this collection, the Capcom Beat em Up Bundle, went down. Best guess is that it was going to be a part of the delayed Nintendo Direct, but I kinda dig that nobody had any real idea this was coming. I dig it even more considering its a nice collection of arcade classics, two of which havent seen any sort of release in North America before. Its a also a solid slice of the overall beat em up genre from the 90s, and worth checking out if you have any affinity for these classic 2D brawlers.The collection consists of 7 games, starting with the original Final Fight, The King of Dragons, Captain Commando, Knights of the Round, and Warriors of Fate. The final two, Armored Warriors and Battle Circuit, are the two inclusions that are new for the West. Theyre also arguably the best titles in the collection, and pretty much worth the $20 price tag by themselves.In addition to the actual games, youll get the option to switch between the English and Japanese releases, check out extra art materials including some design documents, sketches, arcade cabinet artwork, and character designs. This material isnt quite as extensive as the recently released Street Fighter collection, but it is certainly fun to flip through for history buffs.You can also play online or offline with multiple players, dictated by however many characters each game supports. Offline play works really well, online play.not as much. Online isnt necessarily busted, and I appreciate the support for both lobbies and active game searches, but my overall experience across the various titles was spotty at best. If youre hosting a game, players joining will cause the game to momentarily freeze up as they load in, and if you get someone with a less than stellar connection, frames will move into the single digits. Its a frustrating experience to say the least. I definitely could get some decent online match-ups going, but lag was more of the norm for me.As far as the actual individual titles go, I figured Id toss in some brief impressions with this review for anyone thats not super familiar with each entry. Personally, most of my experience with these games comes from the various ports, mostly the SNES versions of Final Fight, Knights of the Round, and Captain Commando. I think Ive only ever played the arcade versions of Final Fight and Captain Commando in an actual arcade, so some of this was new to me as well.Final Fight: This is sort of the granddaddy of the collection, its the oldest title, and in my mind one of the biggest reasons the beat em up genre became so successful in the late 80s and early 90s. That said, it also sort of shows its age compared to the rest of the games in the list. Its a little slower, the enemies and attacks are a little more basic, and it tends to be the cheapest from a difficulty standpoint in later levels. Still worth checking out for nostalgia, but probably not the game youll play the most of in this collection.The King of Dragons: This was one of the titles I had very little experience with going in. I believe it did get a SNES port as well, but I cant remember this ever being on my radar. That said, I really enjoy this one. It feels a bit like a precursor to the Dungeons & Dragons games that Capcom would release much later. It features character classes, a leveling system, and even equipment upgrades. It also feels like a beat em up you can realistically get through on a single playthrough with enough effort, making it a bit more of a rarity. Yes, I know there are plenty of people that can complete beat em ups on 1cc, but Im talking about normal people you weirdos.Captain Commando: Ah yes, the old Capcom mascot. This a fun beat em up, very colorful, with weird characters, and has a couple elements that remind me of the Konami TMNT arcade game. It also makes use of dashing and dash attacks, helping introduce an element of mobility that the two previous titles in the collection lack.Knights of the Round: Now this was a SNES classic for me. Arthurian legend boiled down into a 2D brawler? Yes please. Obviously the arcade version is just that turned up to 11. It also features a character leveling system similar to the one seen in The King of Dragons, but alas no equipment. Also, the roster is a bit limited, making it more akin to Final Fight than the other titles contained here.Warriors of Fate: I feel like I had never heard of this game prior to this release, so this was definitely new to me. Its essentially a feudal Japan themed beat em up, featuring a bit more story beats than I can remember seeing in other beat em ups from that era. Its actually a pretty fun game, with rideable horses, various enemies, and some neat characters to choose from.Armored Warriors: Hoooooo boy. This might be my favorite game in the collection. Think Titanfall if Titanfall were a 2D beat em up. This is a brawler designed around giant mechs just battling it out, destroying other mechs, snatching up their parts, and then customizing your own ride. Youll find rocket launchers, tank treads, vulcan guns, and more. Also, I appreciate the detail of tossing in disposable human sized enemies that just run around the giant mechs for you to essentially stomp on. Seriously, this is a super fun game.Battle Circuit: This is basically a better version of Captain Commando in my book. It has super weird characters and enemies, neat boss designs, a currency system that allows you to buy upgrades at the end of a stage, a variety of power-ups, and the most involved combat system in the collection. If you just enjoy the actual punch/kick mechanics of a beat em up, its sort of hard to top Battle Circuit.If you couldnt tell, Im going to definitely suggest checking out the Capcom Beat em Up Bundle. Its a solid collection of classic games that are pretty well represented here. It has some flaws, the online side being the most egregious, but that doesnt take away from the package all that much. Its also priced fairly, something that unfortunately doesnt happen enough when it comes to retro collections. So yeah, definitely give this one a go.", "date": "September 20, 2018", "grade": "A-"}