{"name": "Figment", "ref": "https://gaming-age.com/2018/09/figment-review-for-nintendo-switch-pc/", "text": "If you were just going by graphics, Figment would appear to borrow a lot from Bedtime Digital Games previous outing, Back to Bed. After all, much like that game, Figments graphics draw heavily from the colourfully surreal work of Salvador Dali, with a little bit of Escher thrown in for good measure. There are slight differences  which can basically be boiled down to there being even more Escher here than last time  but, from a purely artistic point of view, the games have quite a bit in common.Look any deeper than that, though, and youll quickly realize theres more to Figment than that. For one thing, theres the subject matter. Back to Bed was about getting a guy back to bed. Figment, by contrast, starts with the voiceover of a father getting distracted while driving with his daughters, leading to tragic results. From there it explores the nature of grief and memory. As you can imagine, its pretty heavy stuff, leavened only by the vivid colours and bizarre landscapes.On top of that, Figment features multiple musical interludes. I want to emphasize this point, because its so out-of-the-ordinary: this is a game where characters frequently break into song to explain who they are and what they want to do. None of the songs are great, to be sure, but their mere existence signals that there arent many games out there like this one.Unfortunately, theres one area where Figment follows in Back to Beds footsteps: the gameplay. Its undeniably better, in that the controls are fully functional here, but the puzzles here are still seldom very difficult, and tend to be of the go here, get this, bring it back to move on to the next area variety. Figment does add in combat, which adds a bit of a wrinkle, but Id be lying if I said that the game was drastically improved by the ability to hack and slash away at the nightmarish enemies.That said, in the long run, I imagine itll be those nightmarish enemies I remember about Figment, not the so-so puzzles and combat. As a game, I could basically take Figment or leave it. But as an experience  as a surreal musical that explores some pretty dark places  Figment is definitely different than almost anything else out there.", "date": "September 18, 2018", "grade": "B"}