{"name": "Donut County", "ref": "https://gaming-age.com/2018/09/donut-county-review-for-ps4-pc/", "text": "Donut County is short. It has little to no replay value. It feels like it squanders a great deal of its potential. And yet, Donut County is still one of the best games Ive played this year.All of that may sound contradictory, but its really not. Even if you can easily beat the game in a couple of hours, and even if theres no reason to go back and replay it unless you want to add a Platinum Trophy to your collection, and even if it felt like there was much more that the developer could have done with the premise, I still had a big grin on my face the entire time I was playing it. No matter what flaws (or, more accurately, flaws) it may have, the most important thing to know about Donut County is that its incredibly fun.It all starts with the games basic premise. A raccoon named BK runs a donut delivery service thats actually a convoluted mechanism through he steals the titular countys trash. He does this by sending holes to everyone who orders donuts from his company, which get larger and larger as more objects fall in. Its your job to control the hole, and to figure out the order in which the entire landscape needs to be gathered up.If youve ever played a Katamari game, the premise probably sounds familiar. And yet, Donut County still feels entirely original. A big part of why is that Donut County isnt quite as devoted to absurdism as Katamari. I mean, it is absurd, but theres also a clear plot here, with a fun story filled with interesting characters who experience emotional development. The jokes here come from the way those characters interact, and you derive some satisfaction from seeing how their relationships evolve.Really, though, youll probably derive even more satisfaction from destroying an entire county. You start small, sucking down rocks and shrubs, before gradually working your way up to a houses, hills, and theme parks. Its so much fun that you cant help but wish that the game had gone full-Katamari and expanded its scope to encompass literally everything  but, at the same time, it wouldve been hard to give the plot any semblance of coherence if the raccoons were creating a black hole that swallowed up the universe. In this case, I guess, its good that logic won out over sheer destructive power.Admittedly, this logic is also why the game is so short, and why you probably dont need to go back and play it again after youve finished it. But at the same time, Id rather play a great 2-3 hour game than a repetitive one that wears out its welcome over 10+ hours. You may only get a few hours out of Donut County, but theyre a few great hours.", "date": "September 17, 2018", "grade": "A"}