{"name": "NBA 2K19", "ref": "https://gaming-age.com/2018/09/nba-2k19-review-for-xbox-one-ps4-switch/", "text": "Iwas not a big fan of NBA 2K18.Actually, thats putting it far too mildly: I loathed NBA 2K18 with a burning passion. As far as I was  and still am  concerned, it was a microtransaction machine masquerading as a basketball game, a pay-to-win disaster in which everything that had ever been good about the series was made secondary to squeezing players for every penny 2K Sports could get out of them. You had to pay for extra haircuts in Create A Player mode, for crying out loud  and you couldnt even preview them first! No matter how solid the basketball itself was, everything surrounding it was a broken, unbalanced mess.NBA 2K19, thankfully, is not a mess.Dont get me wrong: 2K still tries to get you to buy in-game currency with real money at every turn. That, unfortunately, hasnt gone away. But, on the bright side, its not quite as prevalent here as it was in last years game. There are more opportunities to earn Virtual Currency (VC) naturally, which means you dont have to spend hours in the gym and on the practice court, doing reps and drills over and over and over again, just to get your player up to a level where hes not an embarrassment on the court. You still can, of course, and the game never fails to remind you that you can just buy VC to skip over all that, but it doesnt feel as mandatory.That said, just because I dont despise NBA 2K19, I wouldnt go so far as to say that I love it. While its undeniably much improved, its still got its fair share of issues. Take, for example, MyPlayer  the mode which, as someone who resolutely sticks to single-player, matters more to me than any other. The good news is that it no longer feels like one long ad for VC and various brands. However, even if the characters are drastically more interesting than they were last year, theyre still generally pretty unlikeable (a description that includes the main character), and theyre all part of a story that doesnt make a whole lot of sense, and whose Prelude (which, really, is the thrust of the narrative) features a final act twist that doesnt even make sense in the context of the game. Im not going to complain about it too long or too loudly, but its definitely a step down from likes of NBA 2K16 and NBA 2K17.Ill also pause for a moment and thank the game for inadvertently providing moments of hilarity. Case in point, part 1: for some reason, I randomly decided my MyPlayer was going to be an Asian guy  not realizing that the first chunk of the game is set in a Chinese league. The hilarity came when my player was walking down the street in Shanghai, and was suddenly swamped by fans who mistook him for one of his black teammates from college. Case in point, part 2: when one of the main characters teammates  and the games nominal villain  asks him if he would understand something better if it was said in Chinese. In normal circumstances, it was undoubtedly intended to be a jab at the main characters time in China; with an Asian player, it came off as kind of hilariously racist.I had a similar love/hate relationship with MyGM. On the one hand, I love that the game allowed you to essentially built your franchise from the ground up, and added a storyline to boot. It wasnt a MyPlayer-level storyline, but it was still a narrative, and Ill give 2K credit for making that effort. That said, given the level of control the game gives you over your team, I was a little disappointed to discover that the game assigns your team its Coach, its Assistant GM, its Trainer, and a number of other staff members. I get that they had their pre-rendered animations ready to go, but it was still a little disappointed in a mode that was otherwise pretty enjoyable.And speaking of enjoyable: it probably goes without saying, but the basketball itself is, as youd expect, excellent. Even in the depths of last years disgraceful effort, NBA 2K has always shone at providing a true-to-life on-court experience, and this year is no different. The players move and perform naturally, and they almost feel like youre controlling real flesh and blood players, rather than just video game imitations. Setting aside whatever other issues I may have or have had with the game, when it just allows you to get on the court NBA 2K19 is a reminder of how much fun basketball can be.That said, I still think this series has some ways to go to get back to the very high heights it once achieved. While 2K clearly learned from last year, they had to fix so many problems that they still have some ways to go before they can truly call themselves the standard for sports game. But its important to look on the bright side: NBA 2K19 shows that none of last years problems broke the game permanently, and theres hope for the game to return to its former glory sooner rather than later.", "date": "September 12, 2018", "grade": "B"}