{"name": "Lost in Harmony", "ref": "https://gaming-age.com/2018/09/lost-in-harmony-review-for-nintendo-switch/", "text": "On paper, theres no reason why Lost in Harmony shouldnt work. Its part endless runner, part rhythm game. Theoretically, theres nothing inherent in either genre that should prevent it from meshing nicely with the other. In fact, done well, its not hard to imagine how the two genres complement each other nicely.Thats how it should work, at least. In practice, Lost in Harmony plays like an endless runner where the developers decided to add rhythm game elements at the very last second, but forgot to make any changes to accommodate the new genre. There are endless runner bits, and rhythm game bits, but the two bits seldom, if ever, overlap.This might have been fine if one or both of the bits were decent on their own, but this isnt the case either. Take the endless running. Whether youre playing Kaitos Adventure or M.I.R.A.I.s Escape  more on what those two choices entail in a few moments  youre controlling characters who are skateboarding/running towards the screen, and you have obstacles coming at you from the front and from behind. Unfortunately, when the obstacles are coming at you from the front, its hard to get a proper sense of when theyll suddenly appear on the screen, and when theyre coming up from behind its difficult to tell how fast they are. Further, in Kaitos case, you have the added challenge of him carrying his friend on his back, and the two of them together are large enough that they occasionally block your view. It makes for an experience where, far too frequently, it feels like the game is actively working against you.That said, the endless running is far preferable to rhythm part of the game  largely because theres so little rhythm to Lost in Harmony. Occasionally the music syncs up with the action, but these moments are few and far between, feeling more like happy accidents than intentional design choices. There are also changes in how the game asks you to match the beats that come off as a little sudden: one moment youre gliding along a shimmery line, the next youre expected to tap the A/B/X/Y buttons in time withsomething near the beat, sometimes. As I said, the implementation is a little off.Speaking of abrupt shifts, however, nothing in Lost in Harmonys gameplay has anything on the difference between Kaitos Adventure or M.I.R.A.I.s Escape. In the latter, youre playing as a robot escaping from a lab; in the former, youre playing as a young kid helping his friend deal with cancer. No matter how cute Lost in Harmonys developers tried to make M.I.R.A.I., or how much they try tug at the heartstrings, it just doesnt compare or match up with the heaviness of childhood cancer.Even if it did, though, it wouldnt address Lost in Harmonys core issue, which is that the gameplay just isnt that good. The endless running lacks decent timing, the rhythm is pretty arrhythmic, and the two halves just never feel like they gel together.", "date": "September 7, 2018", "grade": "C"}