{"name": "We Happy Few", "ref": "https://gaming-age.com/2018/08/we-happy-few-review-for-xbox-one-ps4-pc/", "text": "Looking back at my review of Contrast, Compulsion Games first release way back in 2013, Im struck by how much of it could also apply to Compulsions latest, We Happy Few. A great E3 teaser trailer; an incredible art style; a well-crafted story: all of those descriptions applied to Contrast, and all of them apply just as well to We Happy Few. Unfortunately, so, too, does one last description that I purposely left out of that last paragraph: lacklustre gameplay. Because just like Contrast felt as though it was missing something in that regard, so, too, does We Happy Few fail to live up to the high standards it sets everywhere else. Admittedly, in We Happy Fews defense, very few games could live up to the expectations the game established for itself way back when it was first revealed. Its E3 2016 teaser trailer seemed to promise some glorious combination of Bioshock and 1984, and it was hard not to be excited for it.Whats more, the game undeniably deserves praise for living up to at least part of that promise. We Happy Few looks spectacular. In fact, it looks even better than Contrast ever did  where Contrasts Art Deco world looked a little too glossy to be lived in, We Happy Few melds that style with a heavy dose of 60s psychedelia, and the results feel much more fully realized. The world of Wellington Wells mostly feels like a living, breathing place. In this respect, We Happy Few is helped immensely by the fact it has a well-developed story. The game is set in an alternate universe where England was left to fend for itself in World War II, and eventually fell to the Nazis. Things pick up here a few decades later, where, even though the Germans have (possibly?) left the British Isles, England has essentially become an island thats split between totalitarianism and anarchy. Controlling a few different characters, you gradually uncover more and more of the story, and all the terrible truths it contains. Without giving away too much, Ill say that, a) its not a particularly happy story, and b) its a strong enough plot that, if you judge games solely by their narrative, youll be quite pleased with what you find here.The thing is, however, games are more than just their narratives. There are all those pesky gameplay considerations you have to take into account, and on that front, Im not sure that We Happy Few delivers. For starters, its a procedurally-generated survival horror(-ish) game, which doesnt really mesh with such an involved narrative. Youll frequently find yourself getting really involved in whats going on, only to discover that you have to worry about things like finding food and getting enough sleep. (It also doesnt help that the procedural generation leads to quite a few places that are inhabited with similar-looking people, where your conversation options are limited.) Similarly, given how much care was put into the rest of the game, it feels weird that much of the combat  when youre not either hiding or running  basically comes down to swinging your weapons wildly until you kill the other people. In a game thats so intricately made, it feels oddly inelegant. Which, to circle back to what I said at the beginning of this review, is something that also could have been said about Compulsion Games first outing too. Thankfully, We Happy Few isnt nearly as broken as Contrast was, but its still frustrating that a game that looks and sounds so good doesnt play all that well.", "date": "August 29, 2018", "grade": "B-"}