{"name": "Persona 5 Royal", "ref": "https://gaming-age.com/2022/10/persona-5-royal-review-for-ps5-xbox-series-x-switch/", "text": "The Persona games have, for the most part, been excellent examples of JRPGs (Japanese Role Playing Games). Since Persona came to the PS2, Atlus has a record of re-releasing them with extra content  such as Persona 3 Fes and Persona 4 Golden for example. Persona 5 is no different. Originally released in 2016 for both the PS3 and PS4, Persona 5 was already a masterpiece. However, true to form with other games in this series, Atlus released Persona 5 Royal on PS4 in 2019. Now, they are re-releasing the re-release on the PS5, Xbox Series X, PC and Switch.Persona 5 Royal picks up the story of a high school student who has a criminal record. His crime? Hurting a powerful, politically connected person while protecting a woman from an assault from him. Because of your crime you are kicked out of school and sent away to live with a friend of the family to go to a different school. None of the adults in this game treat you with any amount of respect at the beginning of the game, and it will take several hours for you to start making any traction in that direction. In the opening scene of the game you are arrested, though the game doesnt tell you what you have been arrested for, you were caught breaking out of a casino. Most of the story is told as a flashback during your interrogation. While not my favorite plot device, after the first few hours of gameplay you almost forget that it is a flashback. As per usual in Persona games, not all is what it seems.Since the third Persona game, the experience has been social sims mixed with RPGs. Time passes automatically as players do things in the game world: going to school, spending time with friends, exploring the games dungeons, known as palaces, etc. And as time passes opportunities come and go. Friends are only available on certain days, or depending on the weather. Balancing school, hanging with friends, studying to increase your knowledge and continuing with your quests all must be managed. Focus on one too much and the rest will suffer. Why do any of those things when all you have to do is beat the palaces and continue the story you ask? Improving things like bonds with confidants, and stats like proficiency give you in-game rewards.There are status scores that are used outside of combat such as Knowledge, Proficiency, Guts, Charm and Kindness. As these level up, more options are opened to you and there are certain people you cannot speak to until you level up these stats, and occasionally you will get bonuses to leveling up your confidant level as well. For example, early in the game you are given a paper bag from the weapons store owner and are asked to return it later. When you do, you are given the opportunity to ask what was in the bag, and if your Guts level isnt high enough, you cannot ask  which could cause you to miss out on something useful.Deepening the bond between confidants, like Panther, gives bonuses as well. For example, if Panthers link is high enough, there is a possibility that in battle she can go immediately after you do as a free action. When crafting new Personas, extra experience or abilities will be given to them the higher the bond ranking is. For characters outside your party, it might be the Doctor down the block that, as you visit her and increase the bond level between you two, new medicines are made available to you.Leveling up these stats takes time, and to increase your Charm for example, you need to work at a part time job, or to level up Kindness, you can clean up the caf that the person who is caring for you owns. Proficiency is the stat that you will see an immediate result in. When this gets leveled, you can craft more items in the same amount of time as before. Crafting gets you useful single-use items like lockpicks that can unlock chests. There are at least a couple of different ways to upgrade all the different stats all of which require time to pass in the game.Persona 5 Royal is a turn-based RPG at heart. During a fight, on a characters turn, the fight pauses until a decision is selected, such as a basic attack or utilizing a Persona. Think of a Persona as the thing that gives fighters their abilities and spells. If an enemy is hit with a weakness, they are disabled, and the character that hit them can go again. If all bad guys are disabled, you get to do one of four things: You can do an all-out attack  this is an attack where all characters attack all monsters on the field and do a large amount of damage; Talk to the monster which allows you to try and accomplish one of three things  get money from them, take an item from them, or have them join you as a new Persona. If you do any of these three actions, you must navigate a short puzzle of conversation, if you fail, the fight continues, and upon success the fight ends.The extras in Persona 5 Royal are apparent almost right away. The intro has the new playable character, and she is sprinkled in the story throughout before she joins a good ways in. The biggest new items at the start of the game are the Will Seeds hidden throughout the palaces, and when all in a palace are found, they become an accessory that can be equipped. Later, after the palace is completed, they can be upgraded by a new shop thats only available in the randomized dungeon called Mementos. Later in the game new areas that have shops and places that you can hang out at open up, and some of them are new to Royal. There is even an additional palace and a full new semester at the end of the game none of which I can tell you about aside from they exist. Is it worth going through the game all over again to get to the major changes? That would depend. Did you like Persona 5 originally? If so then absolutely, this new version of Persona 5 is worth it.In regards to visuals, Persona 5 Royal for the new platforms looks great! The stylized way the characters look are awesome. Everything is cel shaded and looks like an anime and most of the costumes are pretty cool, and exceptionally thief-like, except Panther, who wears a bright red leather suit. The soundtrack to the game is amazing as well, and all of the different tracks fit very well with the locations, and especially the battle music of which there are several different tracks. Ranging from smooth jazzy beats to awesome rocking songs with vocals, the music is amazing and I find myself listening to the soundtrack quite a bit. (It is currently available on Apple Music and other services)Now comes the big question, is the upgrade from the PS4 version worth it? Atlus has said that there is no upgrade path for owners of the PS4 version, so if you want the PS5 version you will need to buy it all over again. If you dont have a PlayStation system, but you do have an Xbox Series X|S, Switch or PC and are a fan of JRPGs, you should buy Persona 5 Royal no questions asked. It was also available via Xbox Game Pass on day one, and if you subscribe, download this game and play it. For PS4 owners it is a little trickier. The graphics upgrade, especially to 60 fps, make the game absolutely sing during fights. The colors are super vibrant and the game runs smooth as silk. If this was the only upgrade, I would probably say wait until it comes down a bit. However, they included a TON of DLC including extra costumes for characters and equipable items. Some of the costumes will actually change the background music of the fights to the games where the costumes are from. If you are a fan of Persona 5 and are looking to go back through it, this is the definitive way to do it!Persona 5 Royal is definitely an amazing role-playing game experience. The story is engaging and most of the characters are fun with colorful personalities to match. The battle system can be deeply engaging and almost a puzzle to figure out how to navigate. Collecting the Personas can be quite addictive as is playing with merging the Personas. This game is a must buy for any JRPG fan.", "date": "October 21, 2022", "grade": "A"}