{"name": "Disease -Hidden Object-", "ref": "https://gaming-age.com/2018/08/disease-hidden-object-review-for-nintendo-switch-xbox-one/", "text": "I wanted so very much to like Disease -Hidden Object-. Its been awhile since Ive played a really good hidden object game, and, given that the phrase appears right there in the games title, I had high hopes.And, for the first couple of levels, I was pretty happy with what I found. A straight-up hidden object game, with an enjoyably creepy mood, a mysterious story, and puzzles where the objects to be found made sense, rather than standing out by virtue of their incongruity. It was a little annoying to discover that you couldnt zoom in, which would have been useful for some of the smaller objects, but, all in all, Disease -Hidden Object- was delivering exactly what I wanted.Then I discovered the games, shall we say, idiosyncratic logic.When Disease -Hidden Object- is just asking you to find objects (hidden ones, at that), it works. When it branches out, however, and asks you to solve puzzles, the whole thing falls apart. It demands that you make leaps of logic that, as far as I could tell have no grounding in reason  nor, for that matter, are even vaguely hinted at by anything else in the game. Im still not sure how I cleared certain levels. As far as I could tell, I just clicked around the screen, until, magically, it said I was done. Judging from other peoples playthroughs, I dont think that my experience was unique, either.Im not sure why Disease -Hidden Object- sometimes devolves into these random clickfests. It could be that something got lost in translation, or it could be that I just missed something. Whatever the explanation, I know this: if it had just stuck to the hidden object part of its name, it couldve been one heck of a game. Instead, its half very good hidden object game, and half thoroughly nonsensical puzzle  and, unfortunately, those two halves dont quite match up to being a worthwhile whole.", "date": "August 14, 2018", "grade": "C"}