{"name": "Haimrik", "ref": "https://gaming-age.com/2018/08/haimrik-review-for-ps4-xbox-one-pc/", "text": "Haimrik seems like it should be right up my alley. Its part word game and part puzzle-platformer, and those are two of my favourite genres. Unfortunately, as promising as Haimrik sounds on paper (pun only somewhat intended), its actual execution leaves a little to be desired.This is largely because of the games limitations. Generally speaking, its story goes that the titular main character discovers a magic book, which keeps pulling him into its story and sending him on quests. He uses the storys words to fight enemies and solve environmental puzzles. Its undoubtedly inventive, but, at the same time, it also starts feeling repetitive pretty quickly. There are only so many times you can will a sword into being and then use it to hack away at enemies before it starts feeling old.More broadly, it doesnt take long before the game starts feeling like one fetch quest after another. Plot points lead into missions to find another object, which in turn leads to the next plot point, which leads to the next mission. I know that most games  most stories, for that matter  are similarly linear  but it feels more obvious here than in most other places.The other reason why the execution leaves a little to be desired is much more personal: it kind of grosses me out. Opening the book requires that Haimrik slash open his hand, leading to a bright splash of red against the otherwise monochromatic, sepia-toned world. Even worse, when hes inside the book, deaths  his and those of his enemies  are rendered in gory detail. There are lots of eyeballs and brains and viscera to be found here, and, if youre like me, it may turn your stomach a little.If, however, youre not put off by a bit of blood and guts, and you dont mind some repetitive storytelling, Haimrik does have its positives, too. As I said, its a fairly inventive game  using words to harm opponents isnt new (Letter Quest and Spellspire are two recent games that spring to mind where words were your weapons), but having them come to life the way they do here sets the game apart. Further, theres a decent amount of puzzle-solving to be done here. Haimrik doesnt just allow you to conjure up dynamite to throw at enemies, it asks you to think of how you can set an enemy on fire, and then put him out before hes able to reach the pile of explosives that will also kill you (answer: barrel plus tar, followed by torch, followed by barrel plus water).Id be lying, of course, if I said that I found the puzzles that compelling. And the fact that they almost always lead to more gore (albeit hand-drawn gore) is more than a little off-putting. But still, if youre in the mood for a puzzle-platformer/word game thats different from pretty much everything else out there, Haimrik may be an interesting investment.", "date": "August 13, 2018", "grade": "B-"}