{"name": "The Legend of Zelda: Links Awakening", "ref": "https://gaming-age.com/2019/09/the-legend-of-zelda-links-awakening-review-for-nintendo-switch/", "text": "Did you ever look through your Gameboy games and think they would be perfect if put on a modern platform with stylized graphics? Because Nintendo sure did! And the decision to bring a remaster of Links Awakening for Nintendo Switch turned out to be a very good choice with the games portable history and an overlooked Zelda game that will be a new experience for many!So this will be a game that does not take place in Hyrule with Link being caught in a storm at sea and washing up onto KoholintIsland. And nobody has ever left this island! But that doesnt mean you wont try and the adventure to wake the Wind Fish and escape becomes your new journey.This is refreshing in how simple the game is when compared to modern games. But it is also refreshing for being a very different take on 2D Zelda when the games were not fully defined with platforming and familiar characters from other series. You will be taken back to a game made decades ago but still having lots of puzzles and being a solid experience. The updated graphics and music really show how the original game was just awesome at its core and still delivers today.And the game does look gorgeous! Everything looks toy-like and very colorful with a very flattering presentation. Even with bringing the original map into 3D the island still feels very alive and just fun to explore. Its even fun to lose all your rupees in the Trendy Game shop!But there is one big drawback and its my main complaint with the game being the slowdown when entering new areas. It does only happen for a couple seconds before returning to normal but this never ceases to be jarring and if such things bother you then it might be a dealbreaker. We dont know if it will be fixed with a patch in the future but the issue is there for the entire game.But I find the performance problems confusing because outside of this the entire game is very polished. It also has a simplistic visual style that must be pushing the Switch harder than the graphics look like they should. And with the original being such a feat on the GameBoy without such problems its sad to see some tradeoffs in this day.That being said there are lots of little tweaks to the original game that are appreciated. The shield and running are now assigned to the shoulder buttons and your map is very useful with being able to pin markers like in Breath of the Wild. Also new is a dungeon making extra where you can make custom dungeons with rooms that you will collect and even open a time attack mode. These can be transferred to any Zelda amiibo if you like doing that but I just like that we have a mini Zelda Maker to play with.I was also very happy to see the inclusion of content from Links Awakening DX which had the optional Color Dungeon. Clear this and you can find yourself overpowered for the game! And with all the additions and attention to detail the only thing missing is support for the Gameboy Camera and printer! Well and some menu options to change volume or adjust the screen.The music is also very good and stands out with full instruments which bring classic tunes into their full glory. If youre one of the longtime fans of Links Awakening then youre in for a real treat with how they handled the music on Switch!Whether you know Links Awakening like the back of your hand or have never played then you will be in for a treat. This was a great game back in the day and still is! The only thing holding it back are the distracting framerate problems and even being less sensitive to these things it was noticeable to me. I dont think its game breaking but might be for some. For anyone else they will find an adventure once lost to time and now back in all its glory!", "date": "September 27, 2019", "grade": "A-"}