{"name": "Wolfenstein II: The New Colossus", "ref": "https://gaming-age.com/2018/08/wolfenstein-ii-the-new-colossus-review-for-nintendo-switch/", "text": "When we first reviewed Wolfenstein II: The New Colossus, we gave it a solid A and said it was better than ever. Here we are 8 months later with a port for the Nintendo Switch, sitting down once again to watch good old BJ Blazkowicz murder his way through droves of Nazis with impunity. It is important to point out first and foremost; this will not look as good on the Switch in either mode as it will on any other console. The textures are not as sharp, the movement is not as fluid and the framerates are not as high. The Switch performs noticeably better docked, but it is still not on par with a standard PS4 or Xbox One, let alone a Pro or a One X. If you are seeking out the highest quality graphics and visual fidelity, the Switch port is not the way to go. If however you are like me, having already played the game and simply wanting to add a portable option, the Switch port is solid.Wolfenstein II: The New Colossus is a truly outstanding game on all fronts. The story and the characters are all rich and memorable. The campaign takes about 12 hours to get through, and is visually astounding throughout. This is the biggest issue with the Switch version. There are times that the game looks like a modern game being played through a filter that makes it look like an old 360 title. This is ultimately bearable, but is a little frustrating. Unfortunately with the hardware limitations on the Switch, this is not really a surprise. Similar to Skyrim and Doom before it, this is certainly not the definitive edition of Wolfenstein. The major pro for it though is the fact that you can take it anywhere and play it anytime. I cant see myself ever sitting and playing Wolfenstein II docked and at home on the TV. If I want to do that I will play it on my PC or use my Steam Link. On the go though, on a plane ride or out somewhere with some time to kill away from my console, I definitely got into some serious Nazi killing action.The other big question when it comes to porting a AAA title, and specifically a AAA shooter, to the Switch is how the controls work out. Playing in handheld mode with the Joy Cons is pretty good once you get used to it. I would strongly recommend using a Pro controller if you have one, but you will not be unable to play if you do not have one. Motion controls are also available, but you can choose to turn them off if you want.Wolfenstein II: The New Colossus is an absolute must play for anyone who enjoys that genre at all. As for the Switch version, it is a bit of a mixed bag. If you only own Nintendo consoles and never use anything else, get it. If you are looking to play the game on the go and the Switch is your preferred gaming console, get it. If you have other consoles and you only use your Switch now and then, and want the best experience possible with Wolfenstein II, go a different route and experience it for the first time the way the developers intended.", "date": "August 9, 2018", "grade": "B-"}