{"name": "Tempest 4000", "ref": "https://gaming-age.com/2018/07/tempest-4000-review-for-xbox-one-ps4-pc/", "text": "In the Arcade, Tempest was one of my favorite shooters. Its simple concept and fast paced action makes it a perfect quarter muncher. Its a game that every classic gaming fan knows of and either hates or absolutely loves. Now, the latest incarnation of Tempest is here with Tempest 4000. Does this latest version live up to the legacy of the original, lets find out!If you dont know what Tempest is, it was one of the first games to use Ataris Color-QuadraScan vector technology in the Arcade. Its graphics were made up of colored lines and shapes making it look quite simple, but allowing a lot of action to happen on screen at once. In the 1980s, this technology was used in many other classic Arcade games like Star Wars, and Asteroids. The objective is to survive as long as possible and score as many points as possible by clearing the screen of enemies that have appeared on the playing field. The players ship can rapid-fire shots down the tunnel, destroying any enemies within the same segment. You also have a Superzapper bomb, which destroys all enemies currently on the playfield if the action gets too crowded. The gameplay in Tempest has almost never changed with every new incarnation of the game. Most people may know of the ports that were released on the Xbox 360 a while back, but there were ports for the Atari Jaguar and the Sega Saturn under the name Tempest 2000, and even a version for the often forgotten Nuon DVD/Game player under the name Tempest 3000. Its previous versions are why this one is called Tempest 4000, since designer Jeff Minter wanted to keep this release as true to its roots as possible. Almost nothing has been changed from the original formula, making this a treat for classic gamers, but may put off some hardcore players.As you begin, you can select from a few different modes. Pure Mode give you 3 lives and turns you lose against enemies. Survival Mode gives you a stock of 8 ships with no ability to earn 1-ups. There is also Classic Mode that skips the tutorial levels and begins you on level 2. You can pick up score bonuses and power ups throughout each level that will help you battle the relentless onslaught of baddies on screen. After each level, you can earn more points by shooting through fast moving rings of light that award you bonuses the more centered you manage to keep your ship through them. Tempest 4000 sports 100 levels in all, and it will take practice and skill to even reach level 20. Enemies get faster and tougher as you progress, so most players may never see past level 25. Gameplay is simple, and fast. You will end up dying multiple times without even knowing it on some levels since everything can be hectic.Control is very simple. Each level is either a tube or a flat surface with enemies coming at you from the horizon. You have to zoom around or across the playfield back and forth while shooting just about everything and collecting different power-ups. Some power-ups you can get will help you in each level, like a particle laser that hits more enemies than your regular shot. A jump power up that can get you out of danger if the enemies are close to reaching you, and an AI Droid that can help you shoot.The biggest draw of Tempest 4000 is its mind numbing visuals and pumping soundtrack. This overall style goes back to Tempest 2000 that was so popular that even a separate Soundtrack CD was produced and became more popular that the actual game it was based on. The graphics here have been pumped up and display in stunning 4K if you have the appropriate TV or Monitor. The entire time you are playing, you will be mesmerized by what you see and hear. Mix this with the classic gameplay and you are in for a good time.Tempest 4000 is a fantastic version of a true classic. However, no matter how stunning it looks, or simple it plays its definitely not for every gamer out there. Those looking for a legitimate challenge will find it here. Those looking for a deep story or engaging quest will not find anything like that. Its a simple shooter designed after the tried and true classic Arcade gameplay. Being the Classic Gaming fan that I am, I had an absolute blast playing this, but it might be hard to persuade other gamers to take a look. The price is good at only $19.99 and is even available on Disc for the Xbox One and PlayStation 4. I can highly recommend it to any gamer out there. Simple, yet super fun.", "date": "July 26, 2018", "grade": "A-"}