{"name": "High On Life", "ref": "https://gaming-age.com/2022/12/high-on-life-review-for-xbox-series-xs-pc/", "text": "High on Life released this week for Xbox and PC, marking developer Squanch Games first foray into the AAA console first-person shooter field. Much like their prior releases, High on Life is still pretty comedy focused, which comes as no surprise considering the studio was founded by Justin Roiland of Rick and Morty fame. That said, its also a pretty competent shooter, with open world elements, unique ideas, and generally fun mechanics rounding out the humorous, oftentimes outlandish, storytelling elements. All in all, its a pretty fun romp, and one thats easy to suggest considering the game is widely available now via Xboxs Game Pass program.High on Life puts you in the role of a fledgling galactic bounty hunter intent on taking down the G3 Cartel, an intergalactic group of drug making aliens that are using various life forms, including humans, to create powerful drugs. The game is structured around a series of increasingly difficult bounties to take down top G3 members, a mission that will introduce you to new locations as you progress through the story. Along the way youll find and equip guns called Gatlians, which are also sentient beings, that provide the majority of the dialogue for your otherwise silent protagonist.If youre at all familiar with Rick and Morty, then youve got a pretty good idea of what to expect from the humor here. While the humor can get a bit hit or miss in High on Life, I found it worked for me more often than not. And while Justin Roiland does voice the first Gatlian you acquire, there are plenty of other comedians and notable voice actors that provide voices in the game, enough so that its not simply a thinly-veiled Rick and Morty game. Also, if you find the idle gun chatter to be a bit annoying, there is a setting that can tune it down for you.High on Life isnt just a simple run and gun style shooter either, it emphasizes movement quite a bit, giving your character additional abilities to move around the various stages in different ways. Youll gain access to a dash and mid-air dash, a grappling hook, jetpack and more throughout the game. It also adopts the Metroid-esque formula found in a lot of open world style games, in that youll often encounter sections that are inaccessible until youve acquired a new skill or upgrade, and revisiting those sections can lead to additional areas or loot.Guns can also be upgraded by spending in-game currency, including alt-firing modes that change up their abilities. While there arent a lot of weapons to choose from, the weapons themselves are all pretty unique. Your starting Gatlian, Kenny, is a pretty simple single-shot style pistol, but has a special glob shot ability that can knock enemies into the air, whereas a Gatlian named Gus functions as a shotgun, but can also pull enemies inward or can unlock an alternate ability to strip enemies of their shields. So despite the relatively low number of guns available, youre given inventive ways to take down enemies, which helps keep combat fresh throughout the adventure.As far as complaints go, the performance on Xbox Series X was a little rough prior to the day one patch that hit on the 13th, which has certainly improved the framerate issues I was encountering. I was a little surprised to see that High on Life has limited graphic options in settings, no option to prioritize framerate over visuals or vice versa, which was disappointing. While colorful, I also found some of High on Lifes textures looked a little flat, not something that is overly noticeable but when youre in the city environments it stood out a bit more to me. One other technical issue that seems to have persisted after the patch is that the game occasionally shakes the screen when control of the player character is taken away from you, mostly noticeable when youre being slid into place while interacting with an object, or when youre sliding along a grapple line between two points. Its a pretty rough effect that happens often enough to make it noticeable, and ideally this is something thatll get ironed out in future patches.Id also argue that youre stuck with the initial weapon, Kenny, for maybe a bit too long in the beginning. Since its effectively a non-automatic pistol it makes your initial enemies and bosses feel like bullet sponges, something that becomes less of an issue as you advance with upgrades and additional weapons later on. But those early couple of hours can feel a little bit tedious gameplay-wise, and its something youll have to power through a bit to get to the good stuff later on.", "date": "December 16, 2022", "grade": "B+"}