{"name": "Captain Toad: Treasure Tracker", "ref": "https://gaming-age.com/2018/07/captain-toad-treasure-tracker-review-for-nintendo-switch/", "text": "Heres Captain Toad: Treasure Tracker for the Wii U. Wait I mean the Nintendo Switch! Yeah its a lame dad joke but with so many ports from the Wii U library making the Switch this year you might forgive a little confusion. But hey, at least theyre quality games that Nintendo is choosing and that means a lot of great stuff you might have missed if you didnt own a Wii U is now available on a cooler system. So if youre like me then youre not complaining about a chance to revisit some of these gems, and thats just the case with Captain Toad.If youve never played Captain Toad: Treasure Tracker then Ill give you the history. The idea of these little puzzle levels were originally bonus rooms on Mario 3D World which were so well-liked that Nintendo decided to make a while game out of them! We then got Treasure Tracker, where your goal is to explore each level and get to the gold star. Sounds simple right? Well so does filing my taxes but try explaining that to my kids. There are all kinds of hazards, enemies, and puzzles sitting between you and your beloved gold star.Each level is just as adorable as Toad himself. Theyre full of great details and meant to be viewed from a variety of angles to see what kind of secrets are hidden away. Youll be wanting to constantly look around too, since every level has 3 gems to collect and also a special objective you can try to accomplish. This adds a good amount of replay value which I dont mind, since completing a level usually takes just a couple minutes and I really enjoy just kind of being in them.Moving Toad feels great. He feels a little slow as usual but sometimes you want that level of control, but its possible to run and this speeds things up. This also feels more precise with the Switch joycons than I remember, but I might be imagining things. Overall the controls are well balanced for the game and as usual its a good challenge. I think maybe Toad wouldnt weigh so much if he sold some of all that treasure hes hoarding. You think after collecting all these gems that hed just retire. I know I would!Visually the graphics are simple and cute. I usually love how the Switchs portability makes games more accessible but here it almost feels like the levels are too small on the little screen. This game was made to be seen on a large screen and while it was never an issue to play on the go, I would say that far-away views in Treasure Tracker are nearing the limits of what a game should do on the Switch. This is strange to me since I havent felt this way about anything else on the Switch library.Everything else is carried over just like you remember it. Im sure there are some changes we arent aware of, but one new addition is a two-player mode which was lacking on the Wii U. Its similar to how other single player games handle co-op, with the second player being able to move the camera and throw turnips instead of being their own character. We also get some new locales from Super Mario Odyssey. Both of these additions help make this feel like more than just a port, but I wouldnt blame you for holding out if you just bought the game for your Wii U.Just like youd expect, Captain Toad: Treasure Tracker is the complete package on the Switch. Its a straightforward port with a couple add-one that dont feel stapled on, but as always the real draw is having a game on a console with more staying power and appeal than the Wii U offered. If youre not familiar with Captain Toad then definitely check this out, but if you had the game on Wii U then youve probably already made up your mind about if youll be migrating the recent ports over to the Switch. Either way you cut it, this is a great game and a definitive port.", "date": "July 22, 2018", "grade": "B+"}