{"name": "Defenders Quest: Valley of the Forgotten DX", "ref": "https://gaming-age.com/2018/07/defenders-quest-valley-of-the-forgotten-dx-review-for-ps-vita/", "text": "Tower defense games arent exactly known for their stories or their characters. Maybe you could try to argue for Plants vs. Zombies, but apart from that the genre tends towards tends towards plots and characters that are either interchangeable or non-existent. To be clear, thats an observation, not a failing of the genre or anything, since tower defense games arent expected to have those characteristics.Defenders Quest: Valley of the Forgotten DX represents a concerted attempt to change that. Its not only got a story told via cutscenes (a medieval fantasy that involves a half-dead woman fighting monsters and recruiting an army), it also wears its RPG influences on its sleeve, with character progression and a surprising amount of customization options.Is this story interesting? Not really  at least not to me. The cutscenes arent great either, with the main characters looking like they stepped out of a generic webcomic. Still, given that graphics and story generally arent the reason why you play a tower defense game, Defenders Quest deserves a very moderate amount of praise for at least making the effort.What really matters, here and in any other games of this ilk, is the combat. And on that frontDefenders Quest is exactly what youd expect. The difference, I guess, is that you have characters in place of towers, but they fulfill the same general roles: berzerkers specialize in close-range attacks, while archers are better for ranged combat. That aforementioned half-dead woman replaces the traditional castle, and she also has magic you can use from time to time.In other words, despite its RPG trappings, Defenders Quest isnt all that far from your typical tower defense game. Kudos to its developers for wanting to give it a little something extra, but in the end, the game is more or less what youd expect.", "date": "July 2, 2018", "grade": "B"}