{"name": "AI: The Somnium Files", "ref": "https://gaming-age.com/2019/09/ai-the-somnium-files-review-for-switch-ps4-pc/", "text": "When writing about AI: The Somnium Files, its tempting to just point to the games director  Kotaro Uchikoshi, who is probably best known for the Zero Escape series  and say that if you were into his previous stuff, youll enjoy this too.And, to be fair, thats not totally wrong. Like those games, AI: The Somnium Files is built around a pretty intriguing mystery. Also like those games, there are branching storylines here, so you never know just what ending youre heading towards, and there are plenty of puzzles that need to be solved.However, if you go into this game expecting anything like the visual novels that made up the Zero Escape trilogy, youll be a little disappointed. AI: The Somnium Files has much higher production values, and even if the game shares some DNA with those visual novels (particularly the third one in the series, Zero Time Dilemma), the end result is much different.Starting with, obviously, the fact that its not a visual novel. If anything, its a really stylish adventure game, where you wander around small locations, searching for clues and trying to figure out what happened in order to unlock the next area. Admittedly, most adventure games dont feature AI characters that help you explore dreams and memories, but thats what makes AI: The Somnium Files stand out.It also stands out with pretty heavy doses of sex and violence. Like, the first two sections of the game feature: a) a young woman whos had her eyeball ripped out, and b) the main characters AI partner comes to life as a busty woman, and things just escalate from there. Obviously, a lot of this will seem pretty par for the course based on the Zero Escape Trilogy (or even tame if you compare it to the Danganronpa series, which definitely influenced this game a little), but its definitely worth noting that this game earns its M rating.", "date": "September 24, 2019", "grade": "A"}