{"name": "BlazBlue: Cross Tag Battle", "ref": "https://gaming-age.com/2018/06/blazblue-cross-tag-battle-review-for-nintendo-switch-ps4-pc/", "text": "Arc System titles have always had a reputation of being systems heavy fighting games (I still dont know what Roman Cancels are) with very dense storylines (i.e. youre going to need flowcharts). Visually stunning and always fun to spectate, their titles tend to have a very high barrier to entry. Revealed at the conclusion of the EVO 2017 BlazBlue: Centralfiction tournament, BlazBlue: Cross Tag Battle is the latest spin off in the BlazBlue series. Coming off the critical acclaim of Dragon Ball Fighter Z, will Cross Tag Battle continue the momentum for Arc System Works to unseat Capcom as the premiere fighting game developer around?An unknown force has been monitoring various universes and due to a system error, a false plane of existence called the Phantom Field has been generated. Populating this Phantom Field with the denizens from four universes, they are forced to participate in the Keystone Scramble Tag Battle. Each team has to take a Keystone that was assigned to them to a goal, proving their heroism. The winners will return to their home dimension while the losers are sent to an unknown fate. Obviously things dont appear as they seem and the various fighters look to unravel the mystery of the Phantom Field and find a way back home.In addition to select members of the BlazBlue cast, Cross Tag Battle managed to pull characters from two franchises that have ties to Arc System Works and one making their fighting game debut. The two franchises with existing ties are Persona (Arc developed the Ultimax series of fighting games) and Under Night In-Birth (which Arc published their titles). RWBY, the property developed by the late Monty Oum is the series which makes its fighting game debut. Unlike the original series which had a 3D Cell shaded look, the characters of RWBY are redrawn to match the anime aesthetics of the other series. This title also serves as a good introduction to those who have not followed the series, as this title had prompted me to explore animated series which RWBY originated from.The story mode isnt as long and tedious as one found in Dragon Ball Fighter Z. It also has a way of not taking itself seriously so much in that most characters seem to act in a derpy and non-canonical manner, however it doesnt detract from the experience.The fighting system seems to be extremely simplified. Moments for special moves to not get more complicated than the quarter circle movements, which appears to be Arcs attempt to bring in new players. This change does not hinder the game from being played at a high level as you will be more than able to find streams of matches which matches the intensity and chaos of other Arc titles. A complaint about the games fighting system is high requirements needed to execute the Astral Heat moves. The place where youll most likely see this instant kill moves would be in practice or tactics mode, as its unlikely you will see these moves in regular play.Another dock against the title on the switch is actually not the fault of Arc, but rather the on Nintendo itself. Both the joy con and the pro controllers d-pads are not good and it actually hindered my ability to execute special moves, and this games moves have been drastically simplified to begin with. The only saving grace for this platform is 8bitdo controllers d-pads are way better and I was able to play a lot better while using them.The base title came with twenty characters, heavily leaning on the BlazBlue roster, the announcement of the first season ofDLC saw additional twenty characters announced. In predictable fashion the internet revolted at the notion of having to an additional 20 dollars to fill out a roster which consists of characters which are basically rehashes from Arcs other titles. Arc managed this outrage well by offering the rest of the RWBY cast for free and offering the 1st fighter pack free for a limited amount of time. While I understand that a crossover title should have a large roster, this current base roster was more than sufficient to create an adequate amount of combinations. A second season has been promised, and if you pay attention to some of the clues dropped, characters might not necessarily be from the four series that are currently featured.It seems to be a viable fighting game nowadays you need to have online play. BlazBlue Cross Tag Battle delivers this. The matches I had online ran smoothly and the only concern was number of concurrent players online. Arc uses capped online lobbies to pool players together, their transparency in this instance also shows a slightly disturbing trend. Of the eight types of lobbies, only one had players, barely making it to 10% capacity. I understand why this is, besides the upcoming Smash Bros, fighting game enthusiasts tend to flock to the other major platforms available currently. While this title appears to have a bright future ahead, I dont think that future will be on the Switch.With BlazBlue Cross Tag Battle Arc has delivered yet another enjoyable experience which cements them as a premier fighting game developer. The game manages to be simple enough that beginners can enjoy, but supply enough systems to sate veterans of the genre. Unfortunately the Switch is not the hardware where you would get the most out of this title. If you have your eyes set to the road to EVO, perhaps consider picking this title up on the other platforms it is available on. If you are not set on finding FGC fame, then as long as you are willing to invest in a better controller you will find a perfectly acceptable addition to Switch game collection.", "date": "June 25, 2018", "grade": "B+"}