{"name": "Dark Souls Remastered", "ref": "https://gaming-age.com/2018/06/dark-souls-remastered-review-for-pc-ps4-xbox-one/", "text": "There is not a whole lot that I can say about Dark Souls that will be new material for anybody. Even the most casual of gamers have heard of the franchise in some way, whether they have ever played for themselves or not. Ever since Demons Souls I have been among the most die hard fans of the franchise. From collectables to tattoos, the Souls franchise has had an impact on me for the past decade. I was in the middle of a playthrough of the Prepare to Die edition of Dark Souls when the remaster was announced. There are not a whole lot of negatives that a Souls fan can find with the first game in terms of content, but boy are there some performance issues that stand out today. Even with mods like DS Fix, the game was certainly dated on PC and some areas were near impossible to get through without it looking like stop motion animation. Massive framerate drops in areas like Blighttown and The Depths were bosses of their own in a game already full of them. The remaster promised smooth framerates and improved connectivity, and it delivered in full.I played the retail release of Dark Souls: Remastered on PC post launch so I was fully able to experience both the improved online component and the outstanding new visuals. I also play on a Samsung CHG90 49 inch monitor with a 32:9 aspect ratio, which few games natively support without some tweaking. Dark Souls: Remastered takes full advantage of my monitor to glorious effect.Cutscenes are slightly zoomed in, but nothing terrible and nothing you would notice if you hadnt seen them enough times normally to have them burned into your brain. The actual game suffers from no such thing and managed to astound me every time I loaded up to play. I never noticed any framerate dips and my always reliable counter held a steady 60 everytime I took note of it. In addition to the base game, Dark Souls: Remastered includes the Artorias of the Abyss DLC. If you never played it before, it is still probably my favorite piece of Souls content. Every boss is a tough as nails fight that will require patience and stellar timing, the areas are beautiful and diverse, and the amount of lore packed into such a small area is incredibly rewarding. It also introduces a PvP arena, which got a bump from 4 players to 6 players in the remaster. Dedicated servers make these connections much smoother and easier to accomplish and maintain. Invading in the DLC is also one of the best aspects. The remaster uses a matchmaking system much closer to that of Dark Souls III, (which is about the only true function that they changed aside from the covenant system) and the game is all the better for it. Dark Souls: Remastered matches you up with players of like level, so invasions are typically fair for both parties. The DLC is perfect for this because typically you are a late game player invading other late game players, which is where the real fun tends to be. I spent many hours just invading and being invaded for some great PvP battles and experiences.", "date": "June 19, 2018", "grade": "A"}