{"name": "Papers, Please", "ref": "https://gaming-age.com/2018/06/papers-please-review-for-ps-vita-pc/", "text": "Clerical work isnt normally the kind of thing youd associate with intense, high-stakes drama. As anyone whos ever worked a menial office job could tell you, usually the only thing you have to worry about  aside from mind-numbing tedium  is papercuts.As Papers, Please shows, however, context matters. If youre working in your standard 9-to-5 job, theres not really a lot riding on you getting every single detail right. If, however, youre working at a border, checking every little detail on every passport and visa and work permit, where there can be tragic consequences if even just one wrong person gets through, things get a little more serious. And if you happen to be doing your job in an totalitarian dictatorship, where the governments penalties for acting improperly tend more towards the gulag than written reprimands, suddenly every document you check becomes a matter of literal life and death.Its a different way of looking at the gamification of mundane tasks, but it works spectacularly well.Admittedly, as a technocratically-minded public servant with a lifelong interest and a couple of degrees in politics, this kind of game is basically my dream come true. Its fascinating to think about how rules and regulations shape our society and our interactions with government, so its amazing to see a game like Papers, Please that gives such thought experiments life.That said, you dont need any kind of higher education to appreciate this game. Theres a lot of drama inherent in this premise, and it plays out with every person pleading to go across the border, with every bribe you get offered to turn a blind eye, with every broader socio-political act that gets filtered down to the rules you have to follow (or not) in your day-to-day job. On top of that, you have to consider how much weight to give the needs of your in-game family  looking the other way and allowing a husband and wife to remain together may make you feel better about yourself for a moment, but it could also mean that you have to forgo heat or food for a couple of days. Papers, Please is the kind of game where there arent necessarily any right decisions, and it makes for a compelling experience.As a sidenote, its also interesting to consider how the broader social and political context shapes how you perceive a game. After all, Papers, Please originally came out on PC in 2013. Id argue that, notwithstanding the fact that the game was still released in a post-9/11 world, the politics of border security are vastly different today than they were five years ago. While Papers, Pleases in-game politics  based loosely on East and West Germany, circa 1982  have their own intellectual and emotional considerations, you also cant help but interpret them through the lens of today, which in turn is undoubtedly different than what developer Lucas Pope intended when he initially created the game. Whether you think that strict border controls are the greatest thing ever or an affront to basic humanity, youll undoubtedly find your beliefs and perceptions clashing with the in-game demands.I know that reviewing daily regulations and double-checking birth dates and passport numbers sounds like its the most mind-numbing work ever. And, in real life, you may be right (though having known people who worked at borders, Id argue otherwise). In Papers, Please, however, theyre tasks that are every bit as weighty as any gun battle or puzzle, and they make for a uniquely enjoyable game experience.", "date": "June 18, 2018", "grade": "A"}