{"name": "Street Fighter 30th Anniversary Collection", "ref": "https://gaming-age.com/2018/05/street-fighter-30th-anniversary-collection-review-for-nintendo-switch-ps4-xbox-one-pc/", "text": "Street Fighter 30th Anniversary Collection is exactly what it purports to be, a collection of some of the best fighting games that Capcom has to offer over the past three decades of the hallowed Street Fighter series. Ranging from the original arcade release of Street Fighter to Street Fighter III: Third Strike, chances are if you have a favorite in the series (outside of IV and V) its in this collection.One thing that stood out to me with this collection, and what so many anniversary ports tend to mess up, is how much supplemental material and history is packed in. Granted, there could always be more, but I definitely enjoyed the effort from Capcom and developer Digital Eclipse here. You can check out a snippet of info for each game from the game select menu, which highlights changes between different versions of each game, along with some minor bits of trivia. But you can delve even further via another menu option, which gives an interactive timeline and a fair amount of behind-the-scenes art and additional text that expands upon each Street Fighter title. Theres also character bios for each selectable character across every game in the collection, which was fun to brush up on.The actual ports are also fairly well done, but I wont go out on a limb and say these are arcade perfect. From my somewhat casual and basic memory, the general feel of each title seems intact, but thered be more work than Ill ever have time for to go in and test each character input, review animation frames and so on. Give the game a couple weeks, and the fighting game community will likely be able to delve in here, so if youre concerned about whether the ports are arcade perfect, Id wait for their assessment. However, if youre a casual fan of the series and just want to play against friends or strangers, Id say each game is well represented in this collection.While each game features its traditional arcade single player mode, Id imagine the big draw for most folks here is whether or not the online side of Street Fighter 30th Anniversary Collection delivers. Id say, now that the game is out in the wild, that it mostly does. Youll definitely run into issues with lag and poor connections, but I was pretty surprised at how smooth most of my online match-ups were. Across all four titles that are online enabled (Street Fighter II Hyper Fighting, Super Street Fighter II Turbo, Street Fighter Alpha 3, Street Fighter III: Third Strike) I rarely ran up against a match that ran poorly, and had zero trouble finding an opponent quickly.If Ranked Play isnt your thing, the four titles also feature lobbies and player matches. Via lobbies you can group up with three other players to create your own room, or join the rooms of strangers already in progress. You can also search by connection strength, to help give some indication of the overall quality of a game in progress. This isnt amazing functionality at this point in regards to fighting games, but having functional lobbies up and running at launch is maybe a bit better than I was expecting considering the fiasco that Street Fighter V ended up being.Id definitely urge you to give Street Fighter 30th Anniversary Collection a go if youre like me and grew up playing these games either at home or in the arcade, and want a little taste of nostalgia to go along with your modern day fighter. Most of the games in this collection still hold up really well today, and Capcom / Digital Eclipse have done a real solid job in putting this port together. The additional bells and whistles are a nice touch for those that like to dig into the history of an iconic series, and having online modes at launch that actually work are always a plus. Definitely give this collection a shot, even if youre more of a casual Street Fighter fan than an enthusiast.", "date": "May 30, 2018", "grade": "A-"}