{"name": "Detroit: Become Human", "ref": "https://gaming-age.com/2018/05/detroit-become-human-review-for-ps4/", "text": "With the rise of advanced artificial intelligence, machine learning, chatbots, digital personal assistants, self-driving vehicles and lifelike robotic entities, a game such as Detroit: Become Human could not have come at a better time. Humans are becoming increasingly reliant upon their digital devices, especially as said devices start taking on more human-like traits. Voice synthesis has come a long way in a very short time, as has untethered humanoid movement  to bring to a light a few very recent examples. While it will likely take decades to pull off Detroit: Become Human/Ex-Machina/Westworld-style proof of concept androids, were nearly entering the uncanny valley in many other respects. So yeah, the topics in which Detroit: Become Human focuses on are pretty relevant.Detroit: Become Human follows a trio of CyberLife android characters (just known as Androids in the context of the game to keep it simple) Kara, Connor and Markus as they go about their daily lives, assisting humans in one way or another in the city of Detroit in the year 2038. While Kara and Markus are more standard personal assistant type androids, meaning they live with a family, help do errands, take care of the household needs, etc., Connor is a police detective prototype in which we, as the player, get a little more insight into during the events of Detroit: Become Human.The game is broken up into days and players rotate through the android characters each subsequent day  depending on outcome of their respective branching storylines. The game kicks off with Connor sent in to defuse a high tension situation where a personal assistant Android deviant (one which stops following orders) holds a little girl hostage on the roof of an apartment building and threatens to jump. From there, we meet Kara and Markus and learn a little bit about their lives, backstories and functions. Needless to say with androids taking many of the available jobs in Detroit, it doesnt take long to realize that more than a few humans have become resentful, hostile and downright abusive towards them. As human-on-android crime steadily increases, some androids appear to be break out of their loops and become emotional, which leads to a number of suspicious incidents branching out across the city.And oh what a branching experience Detroit: Become Human can be. Decisions and actions made all throughout a playthrough can affect the storyline of Kara, Connor and Markus quite significantly. While many of the choices required by the player can be somewhat passive, with no pressure to perform an immediate action, there are more than a few times in which there will be an intense, action-oriented sequence or a branch that may require spontaneous decision making that can also greatly influence the events of the game. Detroit is, for the most part, relatively slow paced, giving players ample opportunity to scan explore their surroundings, gather clues or make decisions. But when the action or timed sequences kick in, you better be paying attention or face the usually negative and potentially permanent consequences. For those players not keen on those type of Quantic Dream-trademark button combination and QTE gameplay sequences, the studio has thankfully included a Casual mode designed to make Detroit a more accessible and less sweaty experience in those instances. Id expect that most of us Quantic Dream veterans will likely choose the default Experienced mode, and I feel that either way, thats the way it was intended to be played.After each day/story chapter is complete, players can see the exact path through the scenario they have taken based on the decisions they have made, choices they have unlocked, and actions they have performed. Its a safe bet that some players will likely want to redo the scenario and aim for a better/different outcome right away, though doing so takes away from the permanence and gravity of the experience. As with most interactive dramas-style titles, theres no right or wrong way to play Detroit: Become Human, and a good portion of the story is shaped by making those difficult choices  for better or for worse. When finishing up a scenario Detroit: Become Human presents players with a handy flowchart/decision tree to compare each and every choice/action with friends and the rest of the community to see what others have done. The feature is seamless and really well done and puts into perspective how extensive the story branching can be. It also adds a lot of replayability, which is likely the main reason it exists. Your actions also earn you points which can be utilized to unlock a number of items in the extras menu, including an art gallery, sound test, movie clips and more. The adventure is surprisingly long  again depending on the choices and actions you make  and Its definitely fun to go back after playing through the entire story to see how the other scenarios play out.Controls and gameplay mechanics in Detroit: Become Human are a refined blend of Heavy Rain and Beyond: Two Souls, with character movement and controls resembling those in Beyond with some Heavy Rain-influenced clue gathering/mystery solving. Quantic Dream has certainly streamlined and tweaked the whole experience for Detroit: Become Human, which can be especially seen in the polished user interface. The game uses literally every DualShock 4 functional imaginable including the speaker, touchpad and motion controls. The studio has a knack of making sense of what would normally seem like random button presses and controller motions as intuitive actions that your characters perform on screen. I personally enjoyed the control schemes in previous QD games and I also enjoy them here.Whats totally new, gameplay-wise, in Detroit: Become Human is the ability to simulate actions or recreate past events on a timeline before performing them  since Kara, Connor and Markus are androids after all, and it seems like something they could easily do. Connor for example, after collecting enough clues, can piece together crimes that have occured, which is a pretty handy skill with him being a police detective model. Markus, during some action and exploration sequences, can stop, scan the environment and calculate a safe path to navigate through potential hazards. My only knocks regarding the gameplay is the relatively slow walking pace of the characters and the occasional confusing input sequence or camera angle.Quantum Dream is known for crafting some gorgeous looking games, and seeing as Detroit: Become Human was created from the ground-up for the PS4 and PS4 Pro, you better believe that its a visual showpiece. Characters, and the faces especially, are just ridiculously good looking. Were finally reaching the point where were approaching crisp photorealism in faces which are still just outside of the uncanny valley. The hair rendering isnt the best ever, yet the eyes, facial animation, realistic complexions and subtle skin imperfections are top notch. Android, human, it doesnt matter, they all look fantastic. Upon booting up the game players are presented with Chloe, the android assigned to welcome you to the Detroit: Become Human experience, which serves as the title screen of sorts. Those familiar with Quantic Dream know how much they love their impressive title screens and this one in particular doesnt disappoint at all. The game looks fantastic on a stock PS4 and even better on a PS4 Pro at 4K with HDR.The environments are similarly impressive, with super realistic materials, dramatic lighting and particle effects all around. There are few flat looking areas and textures here and there, although nothing that ruins the overall experience. Since it is a Quantic Dream game after all, youll be sure to find a creepy, dilapidated suburban house or two and a couple of nighttime rainstorms for good measure.Considering the sheer amount of voicework in the game, its pretty important that the script and acting is up to snuff, and they are, for the most part. The main cast does fine work and its a huge improvement over the awkward English voiceovers in Heavy Rain thats for sure. Theres still a small handful of unnatural sounding lines though nothing that left a lasting impression. The soundtrack, with distinct themes for each of the android characters, does its job admirably and kicks in when action or the drama picks up.After spending hours in open world adventure titles and first person shooters as of late its nice to take a step back and switch things up with an interactive drama palate cleanser such as Detroit: Become Human. With a modern, relevant topic that is sure to elicit some discussions, its an enjoyable ride worth checking out.", "date": "May 24, 2018", "grade": "B+"}