{"name": "LEGO Bricktales", "ref": "https://gaming-age.com/2022/10/lego-bricktales-review-for-nintendo-switch-pc-playstation-xbox/", "text": "Its been interesting to watch LEGO games re-find their footing over the past year. The venerable block-maker has pivoted away from the franchise tie-ins that had come to define the brand (at least when it comes to video games) over the past fifteen years or so, back towards games that are focused on using LEGO bricks and minifigs themselves. Of course, the results have been a mixed bag. While LEGO Builders Journey was fine, LEGO Brawls was abysmal  and now, we have LEGO Bricktales, which falls somewhere in between the two.I mean, Bricktales probably falls closer to Builders Journey because of the simple reason that the two are very similar games. Both are about being presented with challenges, and then solving them with LEGO blocks. The difference is that LEGO Bricktales is substantially larger. Where Builders Journey felt like it featured a bunch of tiny individual worlds, Bricktales has a story involving a massive amusement park featuring five different biomes. The good news about being so huge is that the game really gives you an opportunity to build to your hearts content. Not only does it offer you puzzles, it also allows you to go back once theyre solved and spruce up your solution in a sandbox mode. If you love building LEGO in real life, Bricktales clearly strives to recreate that experience.Theres a downside to being a much bigger game, however: while theres more to do, it also gives plenty more opportunity for the games weaknesses to reveal themselves. Specifically, you soon find that the controls are incredibly frustrating. Placing little bricks in a 3D environment  the easiest, most natural thing in the world, if youve ever played with real LEGO  takes on a new level of difficulty when youre trying to do that using thumbsticks and a D-pad. Likewise, manoeuvring your camera into the right position can be a huge pain, and you never quite see where youre trying to go. You can look from the side, or the front, or at an angle; you can zoom in and out: you can move your camera around as much as you want, but youll always find it in the slightly wrong position. Still, even with those pretty major flaws, theres no denying that LEGO Bricktales gets awfully close to capturing the feeling of playing with LEGO. Its not quite there yet thanks to the challenging controls, but if you can overlook that, theres fun to be had here.", "date": "October 12, 2022", "grade": "C+"}