{"name": "Monster Prom", "ref": "https://gaming-age.com/2018/05/monster-prom-review-for-pc/", "text": "Dating Sim games have gotten an image overhaul in the last couple of years. Starting with Hatoful Boyfriend in 2011 and last years Dream Daddy, these titles have slowly removed the stigma that dating sims solely exist as adult oriented titles. Beautiful Glitchs Monster Prom looks to take that baton and keep it going in that direction with their multiplayer dating sim.Spooky High School is a fictional high school where monsters of all kinds attend school (but probably not classes). Its three weeks before Monster Prom and you are tasked to court one of the six most popular people in school. The lineup includes the jock werewolf (Scott), the aloof mer-princess (Miranda), the goth vampire (Liam), the ambitious gorgon (Vera), the demonic bad boy (Damien), and hard partying ghost (Polly). At the end of the three weeks will you be dancing the night away with the monster of your choice or wallow in loneliness? The gameplay for Monster Prom was heavily influenced from The Yawhg, which is a choose-your-own adventure title which tasked you to take on a looming threat. Every week comprises of three phases. The day and night phases involves going to a part of the school to adjust improve a stat, and have a random encounter with a potential paramour. This encounter can further improve your stats as well as your standing with them if you can pass the stat check based on the choice you picked. For example, If your Intelligence stat isnt high enough the harebrained scheme you recommend will fail resulting in one of the objects of your desire to like you less. In between the day and lunch period is lunch, which provides an opportunity for you romances some monsters. Multiplayer adds two additional phases, the weekend which allows a player to either boost or sabotage another players standing with a monster and a phase where you play an ice breaker game to determine turn order for the next phase. After the three weeks has passed and you finally pop the question, you hope youll have the right stats and a high enough affinity with a character that theyll say yes. With over twenty plus endings and over two hundred possible events each play through will hardly look like another. The games strongest points are the art direction and its writing. The characters are designed as generate as much fan art, fiction and shipping debates as possible. Even with its limited amount of assets presented in game I cant help but find myself wanting to peer deeper into the lives of the students of Spooky High School. It would be extremely hard to not find a character to gravitate towards even if they are minor characters. The writing can at times be overly raucous and zany, relying on pop culture references a bit hard, but despite presenting what appears to be high school caricatures, with several playthroughs you will discover their lives are more complex and nuanced that one would be led to believe. Their usage of call backs often times got audible chuckles, such as an offhand remark about griffin spaghetti by a character which jogged a memory of an A storyline that played out in a previous playthrough.The game does have its flaws, it shipped with a non-functional online multiplayer mode, however I would not say it hampers the experience too much as I more than enjoyed it as a single player title. Multiplayer for this title would probably be best suited as a local affair that way you can see the look of disdain amongst as you block their possible move or sabotage. The credits also showcase a pretty impressive voice cast, internet favorites such as Arin Egorapter Hanson, SungWon ProZD Cho and accomplished voice actors such as Christina Vee and Christine Marie Cabanos. So it was odd that their contribution were just small vocal quips, granted one of the more enjoyable parts of the fun is reading the dialogue with your own canonical voices. Some other oversights were the lack of a gallery mode or a scenario replay mode. With the wealth of events the game contains, it wouldve been nice to reenact some of them without having to do a full playthrough and praying the scenario comes up. A gallery mode with the art featured in the game wouldve been a nice walk down memory lane of your adventures in Spooky High School.As someone who did not attend his own prom, something about Monster Prom just clicked and made me really invested into learning more about these monster young adults and their fates before the big dance. I found myself immediately starting a new session after a rejection in hopes of finally getting the monster of my dreams to finally say yes. The sheer amount of events and possible outcomes meant it would be hard for me to get bored. Its definitely a title which is as fun alone as it is with a group. To close Id like to chime in the Bae Ballot that the team at Beautiful Glitch is holding to determine who the True Bae is. The answer is Polly Geist, cause if she wasnt why would she be on the icon on all of Monster Proms social media presence as well as the game itself? #TeamPolly!", "date": "May 21, 2018", "grade": "A-"}