{"name": "No More Heroes 3", "ref": "https://gaming-age.com/2022/10/no-more-heroes-3-review-for-xbox-playstation-pc/", "text": "Back in my early GameStop days in 2007,  when the Nintendo Wii was in its early stages of release I recall a wave of different games making noise in a very busy 2007/2008 holiday season.  One such title was a stylish, grindhouse-y hack & slash game from the creator behind Killer 7 (Goichi Suda aka Suda51) that caught my eye. 15 years later, I was very excited to jump on the chance to play the latest installment of the No More Heroes franchise: No More Heroes 3. It is the 4th game of the series (3rd in the mainline series) & picks up after the events of Travis Strikes back. The start of No More Heroes 3 is very, very confusing. The game starts with a monologue from our hero Travis Touchdown talking and playing an old game called Deathman that he played as a child. Its the first example of the many different genres of gaming appearing in this game. The game then cuts over to an animated parody of E.T, this is where we meet Damon and the games villain FU. The animated cinematic pays homage to the beats of E.T. except, FU shares the secrets of the universe with Damon when he leaves. FU returns back to earth with a gang of Assassins looking to destroy planet earth. Thats when the insanity of No More Heroes takeoff. Going back to the previous titles Assassins Ranking System you are tasked with climbing the leaderboards and killing your way upwards.The gameplay of No More Heroes 3 beats stays consistent with other entries of the series. Travis needs to mindlessly defeat enemies in ranked battles littered throughout Santa Destroy and its neighboring surrounding areas. You are met with designated matches, horde-like defense battles, and mini-bosses galore, to reach the goal of making money to enter your next boss battle. Each mini-boss and squad battle has unique powers that should provide a challenge throughout the game. I found myself tired of the different combos of the same enemy and about 60% of the way through the game felt that I was just doing the same thing to get to this boss battle. Thats where the mini-games came in. I am a sucker for doing odd jobs in video games. I jumped at the opportunity to unclog a toilet or mow a lawn. There is one particular Kaiju fighting mini-game that I loved. The game also provides you with a slew of different collectibles from random aliens giving you t-shirts, to collecting different trading cards and scorpions to make into delicious ramen. My favorite mini-game would have to be retrieving the children of your talking feline sidekick Jeane.Travis uses his trusty beam Katana to beat down the bad guys. You still use a lewd motion to recharge your beam, but it is lost on this Xbox Series X version of the game. There are added additions to the game that makes the combat feel fresh but run into the same receptiveness problem I felt with the gameplay. The Death Glove gives him four special moves: A dropkick, a circular AOE that acts like a mini turret, a slow-down effect, and a Jedi-like force push. When Travis kills an enemy, a quick time event appears on the screen that leads to a bonus slot machine that rewards you with random power-ups or rewards. Later on, in the game, it gives you the ability to summon a mech suit. The experience of the game is presented to you like a Netflix-style show. Each boss book ends each different episode of the series. With intro and outro themes. It even gives you a countdown to the start of the next episode. After meeting each boss for the chapter, youre treated to a mini Takashi Miike podcast. You then go exploring the different open-world levels of each island. This is where I think the game stumbled a bit. There are a lot of open-world levels that have little to nothing to do with them. Just large open spaces and even with these updated graphics from the switch port of the game, it still feels and plays a little dated. The boss battles do make up for it. Each boss has a different gameplay element to it and really blends up the genres here. We get different parodies of games and movies which I think is a nice touch. The load times are okay for todays standards and it does take a bit of time when traveling from island to island. There are still weird texture pop-ups here and there and sometimes in combat, the action buttons arent responsive. The music in No More Heroes 3 is fantastic. A well-blended selection of Jazz and hip-hop mixed with the perfect battle music to get you ready for your showdown with each levels bossNo More Heroes 3 is a welcomed good time for fans of the series and may be a little hard to get into for new fans. Its crude humor remains the same (taking a dump activates your save files), but there is something very punk rock about this game that Suda51 has given us here. If you can look past its clunky visuals and repetitive gameplay, youre in for a treat. This an excellent send-off for Travis Touchdown and his friends.", "date": "October 6, 2022", "grade": "B"}