{"name": "Burly Men at Sea", "ref": "https://gaming-age.com/2018/04/burly-men-at-sea-review-for-ps-vita-ps4-switch/", "text": "Heres a list of words Id use to describe Burly Men at Sea: quirky, whimsical, charming, stylish, adorable, heartfelt, creative, and delightful.Based on that list, youd probably think Im head over heels in love with the game. After all, those are generally pretty positive adjectives. While some people may not love quirk and whimsy, when coupled with the other words, 99% of the time youre probably talking about a positive experience. And yetI dont think I love Burly Men at Sea as much as that list might suggest.Dont get me wrong, it has a lot going for it. Everything about the game seems designed to please, from the brightly-coloured graphics, to the upbeat music, to the unique controls, to the interesting cast of characters, to the heartwarming story. Taken individually, those are all pretty fantastic ingredients. For that matter, taken altogether, they make for a pretty fantastic combination.At least, its pretty fantastic the first time around. The second time its still fantastic, if a little repetitive. The third time, the fantastic-repetitive scale starts balancing out a little more. And so on, and on, and on, as you play the game multiple times in order to discover all that it has to offer.If we were talking about a game where playthroughs took hours to complete, that might not be an issue. But when were talking about Burly Men at Sea, where a playthrough can be over in a matter of minutes, and you can see how the repetition might start to add up. What seems magical the first time or two wont be quite so magical when youre experiencing it for the fifth or sixth or seventh time.Again, Burly Men at Sea is most definitely not a bad game by any means. Its bursting with invention and imagination, in everything from the way you drag the screen around to move the titular burly men, to the music thats largely built around vocally-created sounds, and all points in between. If youre looking for a unique experience, Burly Men at Sea offers it  but, at the same time, dont be shocked if its an experience that wears thin before youve seen everything the game has to offer.", "date": "April 25, 2018", "grade": "B"}