{"name": "Bethesda Pinball", "ref": "https://gaming-age.com/2018/04/bethesda-pinball-review-for-nintendo-switch/", "text": "For this latest Pinball FX3 review I will be looking at 3 new tables based on videogames from Bethesda for the Nintendo Switch: Fallout, DOOM and Skyrim all bundled up as Bethesda Pinball. They are available now through the Pinball FX3 app which is free from the eShop.Read on for our impressions of the new tables and for the whole bundle.Some really interesting concepts here. You dont begin playing this table in the traditional way, instead you being by creating a character like you would in Fallout 4. Its not as detailed as the game its based on, but rather a simplified version where you select your gender, and assign points to certain attributes. As you play the table, you can level up and increase your stats to unlock more bonuses and increase your scoring when hitting certain jets and targets. A lot of animations going on during play, but nothing gets in the way of the playfield too badly. Hardcore Fallout 4 fans will find many things to love here, as its a great use of the source material. Overall, a very fun table!Table Grade: AYou begin this one by selecting your skill level like you would in a traditional DOOM game. The harder your level, the more points you can earn and more skill shots become available. There are some instances that can make the ball act erratically and you may miss some shot you though were perfectly lined up, but with practice, you can score well into the millions on a single ball. I would have liked to see some more animations during play, but what is here is very well done. Definitely not boring, but could have used a bit more open space in the playfield. Solid gameplay, fun and very high scoring, just a little cramped.Table Grade: B+This table borrows a bit from Fallout, as you create a character as you do on that table. There is more to the character in this one, as you can find armor, weapons and items that all effect how you play. There are guards and monsters you have to fight, you even have magic and a health meter. Tons of animations here as you play, with dragons breathing fire all over the board, and many great skill shots to pull off. You will score major points by completing quests and finding loads of items. One thing to note for Switch owners, if you are playing in vertical tablet mode, switch orientation so the Right Joycon controls the flippers, as you cannot exit the equipment screen using the Left Joycon for some reason. There is a lot to like about this table, and I am sure I just scratched the surface of what can be discovered. Excellent use of the source material.Table Grade: ABethesda Pinball is a solid download for Pinball FX3 and fans of these games should get this pack right away. I, for one, cannot wait to see what Zen Studios comes up with next. If this pack is any indication, were in for some great surprises.", "date": "April 23, 2018", "grade": "A-"}