{"name": "Pinball FX3  Star Wars Pinball: The Last Jedi", "ref": "https://gaming-age.com/2018/04/pinball-fx3-star-wars-pinball-the-last-jedi-review-for-xbox-one-ps4-switch/", "text": "For this latest set of Pinball FX3 reviews we will be looking at a pair of new tables created by Zen Studios which are based on the latest Star Wars movie The Last Jedi. This Star Wars Pinball pack contains The Last Jedi Table and the Ahch-To Island Table.Read on for our impressions of both new tables and for the whole bundle.[Eds Note: And please forgive Chris for not actually seeing The Last Jedi if you can.]I have to be honest and say, right off the bat, that I did not see The Last Jedi. So My knowledge of the film is somewhat limited. That being said, this is a fun little table that offers some nice bonuses and super quick gameplay. The front of the playfield is somewhat cramped by awkwardly placed jets, but if you manage to aim for the second level, you can score mass points in mere moments. A perfectly timed skill shot right when you launch the ball can increase your score by a million or more if you hit it just right. Some bonus missions appear throughout play, like a massive TIE fighter attack, can be very distracting and you will miss a few shots while this is going on. Other bonus missions completely change the playfield, and are equally as distracting when your trying to keep a ball in play. Theres a lot going on here from the moment you launch a ball, and things very rarely gets calm. Voices arent taken from the movie (as far as I can tell) and mimics are used again, as in JAWS and Back to the Future. Its a good table for some fast and furious action, but may put off some fans with its intensity.Table Grade: B+Where The Last Jedi table is a thrill ride that may be too intense for some players, Ahch-To Island is largely the opposite. This is a quiet and calm table with very little animation and distracting missions. A nice open playfield allows you to keep track of your ball for the majority of the time its in play. Jets are spaced nice and offer nice some nice bounce. Not a lot of scoring opportunities or bonuses to be found, so it will take some time to rack up some high scores. The voices that play throughout are again mimicked and there some long conversations that can take place between Rey and Luke, but overall nothing that happens distracts from gameplay. Theres a very tranquil song that plays in the background and everything feels calm and collective. Comparing this table to The Last Jedi, its like night and day. Like The Last Jedi, its a good table with some fun gameplay, but may put off players looking for fast and furious action.Table Grade: B-This pack provides 2 sides of a Star Wars coin. One side is intense and furious with gameplay, while the other keeps everything calm and slows down the pace. I suppose you could say we have a Dark Side (Last Jedi) and a Light Side (Ahch-To Island) of Star Wars Pinball with this package. Overall, what you get is very good and presented well. If you liked the movie, then you will find all of your favorite references throughout both tables. If youre like me, and never actually saw the latest Star Wars films, then you have some quality pinball action you can have fun with. This pack is a solid edition to the Pinball FX3 app!", "date": "April 17, 2018", "grade": "B"}