{"name": "Chaos;Child", "ref": "https://gaming-age.com/2018/04/chaoschild-review-for-ps-vita-ps4/", "text": "When it comes to most Japanese visual novels, in my experience the unpleasantness is rarely visceral. A lot of the time its entirely to do with the characters  as in, they tend to be thoroughly unpleasant people, and having to read an entire story centred around them is equally unenjoyable. Other times, its because theres somelets call them questionable attitudes towards sexuality, particularly, to say nothing of gender representation.And then theres Chaos;Child, where there were parts so ridiculously gory, I literally had to turn the game away myself from feeling sick.I mean, I probably should have expected this. The game is centred around a high school student whos taken it upon himself to solve a series of grisly murders, it would have been weird if it was all sunshine and rainbows. Still, I wasnt expecting Chaos;Child to document so many of those murders in such stomach-churning detail. As someone who gets squeamish at the sight of a little blood, Id be lying if I said there that this game wasnt too much for me.Still, I always try to remind myself that just because its not for me, it doesnt mean its not for anyone. In fact, its quite obvious that there are plenty of people to whom Chaos;Child will appeal. Fans of grisly mysteries will, obviously, love it, as will anyone who loves visuals that depict said mysteries.Beyond them, though, this game seems made for visual novel fans who want to see where theyre impacting the story: there are points where you get to decide whether you want to see the happy (well, happier) version play out, or a more negative delusion, or the truth. No points for guessing what I tended to pick, but its still interesting to see how this game plays around with players perceptions and gives them more agency over what they see.Would I said that I enjoyed Chaos;Child? Clearly not, and I feel like I should go drink a gallon of ginger ale and some plain crackers to settle my stomach after playing it. But if you like a bit of blood and gore with your mysteries, its probably something you owe yourself to check out.", "date": "April 4, 2018", "grade": "B"}