{"name": "Iconoclasts", "ref": "https://gaming-age.com/2018/03/iconoclasts-review-for-ps-vita-ps4/", "text": "Its not often that you see distinctive authorial voices in video games. Sure, you have the odd Japanese auteur, and there are indie voices like Will ONeill, whose world view comes through in every game he writes, but for the most part, theres not a lot of room in games for singular visions.Iconoclasts is another exception to that rule. Created over seven years by Joakim Sandberg, its a game where one persons ideas come shining through at every turn.The most obvious place you see this is in the story. Set in some kind of dystopian future, Iconoclasts weaves together an engaging plot involving religion and personal loss, told through the lens of a teenage girl grieving the loss of her father, while also fighting against an oppressive regime. The game is full of well-written characters with believable emotions and motivations, and its obvious that Sandberg had a clear vision for where he wanted the story to go.While the gameplay, the design, and the graphics are a little less unique, theyre still decent enough that they dont distract from the fantastic story. In fact, as a Metroidvania-style platformer, Iconoclasts does a good job of incorporating elements of the story into its design: one of your characters weapons is a wrench, which she also uses to literally unlock new areas, while her gun is used to blast away rocks that block her path in addition to blasting away enemies.Where Iconoclasts falls a little short is in making it clear what it expects of you in places. It uses little signs to convey instructions, but a lot of the time these illustrations make no sense, and you have to puzzle things out for yourself. Its obviously never impossible, but there are certainly places where it feels like it may as well be.Still, as the creation of one man after seven years of development, its hard to fault Iconoclasts for being a little challenging in places. If thats the trade-off to be made for a story as strong and distinctive as this, its well worth it.", "date": "March 30, 2018", "grade": "B+"}