{"name": "Yakuza 6: The Song of Life", "ref": "https://gaming-age.com/2018/03/yakuza-6-the-song-of-life-review-for-ps4/", "text": "I really dig Yakuza 6: The Song of Life despite it feeling like a somewhat smaller game than Yakuza 4 and 5. I thought maybe stepping back from the multiple protagonist angle of those entries would feel like a step back for the series, but the focus on series hero Kazuma Kiryu actually feels like the right move, especially considering how personal the story is for the history of the character. The opening events involving his now grown-up ward Haruka propel things forward at a quick pace, which helps make up for some of the more meandering moments found in the previous entries.Thats not to say the experience isnt on-rails by any means. Youll still be given ample time to explore the streets of Kamurocho and other areas throughout. Youll also find plenty of the traditional side activities like Mahjong and Hostess Bars, along with new activities like Live Chat and managing your own local baseball team. Theres plenty to do in Yakuza 6, with almost all activities benefiting Kazuma by aiding his overall stats and abilities in some way. So even if youre wasting time in the arcade playing Virtua Fighter 5, youll still see a bit of progression via side goals thatll help when you finally decide to progress in the story.Likewise, the trademark beat em up style of combat feels largely familiar, with slight changes. The game engine incorporates physics for inanimate objects, so Kiryu or enemies can occasionally topple over, kick, and interact with objects around them differently than before. Also, youre no longer confined to an arena box when fighting out on the streets, you can freely run around and let enemies chase you in order to get some breathing room. One thing to note is that Yakuza 6 does feel a little easier than some of the previous entries, even when compared to newer titles like Yakuza Kiwami and Yakuza 0, but you can adjust the difficulty if youre feeling overpowered early on.Story is generally the appeal of the Yakuza series for a lot of people, and I dont think Yakuza 6 disappoints. As I mentioned before, this is a fairly personal tale for Kazuma Kiryu, despite the involvement of the Tojo clan, the Korean Mafia, and Chinese Triads. Theres a lot of wheels spinning the plot at all times, but its never difficult to follow or understand. If youre new to the series, or have only played through Yakuza 0, there is an optional catch-up video built into the game menu thatll run you through the storyline up to Yakuza 6. But even without that, its honestly not difficult to follow. My only real complaint is that little of the supporting cast outside of Detective Date and Akiyama make much of an appearance here, so Majima fans should prepare for a little bit of disappointment.While youve got until April to wait, Id definitely suggest checking out Yakuza 6: The Song of Life, whether youve checked out every entry to date or not. Its a pretty solid Yakuza tale, and it builds upon the progression and combat systems from the previous games pretty well. The side stories are fun and weird (sentient cleaning robots?), and theres still a hefty number of side activities to explore. Its a great looking game with some minor technical issues, and will likely provide the average player with dozens of gameplay hours. I have zero idea where the series goes from here, but I hope well see more outside of the Kiwami remakes in the near future.", "date": "March 23, 2018", "grade": "A-"}