{"name": "Attack on Titan 2", "ref": "https://gaming-age.com/2018/03/attack-on-titan-2-review-for-ps4-xbox-one-switch/", "text": "The great thing about the first Attack on Titan game  which I helped my colleague Benny review when it came out a few summers ago  was how open it was to newcomers. Whereas a lot of anime-based games seem to delight in rewarding hardcore devotees, Attack on Titan was fairly accessible for newcomers.Im pleased to see that Attack on Titan 2 continues on in this spirit, doing a good job of presenting the story simply, in a way that, once again, wont scare off people who dont have a clue whats going on coming in (or even people who, say, havent thought about the series since they played that first game). Admittedly, this may mean that it rehashes all kinds of plot points with which diehards will be well-acquainted, but, hopefully, theres still plenty here, story-wise, that such fans will be able to appreciate.And if they cant, the good news is that Attack on Titan 2 is not only a very good game, but also one that improves in every way on its predecessor.None of these improvements represent major leaps forward, mind you. Instead, Attack on Titan 2 seems to take the incremental approach: it recognizes the first game worked pretty well, and it tweaks things here and there to make them even better. The graphics, which were pretty nice the first time around, look incredible here. In particular, the eponymous titans, which looked absolutely disgusting in the first game, have an added layer of menace this time around. The way they pop off the screen really makes them seem like (literally) enormous threats, rather than just weird sorta-naked giants.Where the game really shines, though, is when it comes to combat and movement. The main objective is still to hack away at the titans limbs before delivering the death blow to the nape of their neck, but it feels much bloodier and more satisfying this time. This is largely because the characters control so much more smoothly than they did in the first Attack on Titan game. Soaring through the air and whipping around titans is incredibly fun, to the point that people should be actively hoping that the team working on the upcoming PS4 Spider-Man game is watching and taking notes.Does this mean that Attack on Titan 2 is essential? Probably not, though as anime-based games go, its probably got to be considered the gold standard (unless Im overlooking something incredibly obvious). But if youve ever heard about the series and wanted to see what all the fuss was about, its hard to imagine a better entry point, while series veterans should love that its got style and action to spare. As far as sweet spots go, thats a pretty impressive one to hit.", "date": "March 21, 2018", "grade": "A-"}