{"name": "Oure", "ref": "https://gaming-age.com/2018/03/oure-review-for-ps4-pc/", "text": "Its not hard to tell what games Oures creators are trying to invoke. Take something artsy, like Journey or Rime, add in a dose of Shadow of the Colossus, and youve got a pretty good idea of what theyre going for.What theyre going for and what they achieve, unfortunately, are two different things. Youll spend the bulk of your time with Oure flying around as a dragon, either collecting orbs that serve too much of a purpose (you use them to unlock certain things, but at no point does it feel like anything other than mindless collecting) or solving environmental puzzles that consist entirely of flying near landmarks. Neither is particularly challenging, and the sheer repetition of it gets old pretty quickly.Things arent helped by the fact that it often feels like Oure is working against you. The camera is stiff and unresponsive, and prone to the most unhelpful angles imaginable. Likewise, the controls will become a chore really quickly when you realize your dragon doesnt fly so much as she glides  and not even particularly well, since the moment you let up on the controls, she immediately sinks like a stone. Given that there are a great many spots where you need to fly upwards, you can imagine how much of a chore this soon becomes.The good news, if there is any, is that the Shadow of the Colossus aspect of the game isnt too bad. The boss fights  though perhaps boss puzzles would be the more accurate term  consist of your character soaring through the air on top of a giant titan, periodically latching onto weak points and solving fairly simple puzzles. If ever theres a point during which Oure achieves the epic feeling that it tries so hard to cultivate throughout, its during these titan spots.Unsurprisingly, though, the problems that exist throughout the rest of the game exist here, too. The camera angles become even more of a pain, particularly when youre trying to weave your way around small obstacles on the backs of a titan  its awfully difficult to situate yourself, let alone latch onto a weak spot at just the right moment, when the camera remains stuck behind walls and resolutely refuses to move. Similarly, if flying is a chore elsewhere in the game, its downright painful here, especially when you have to try and weave your way around those aforementioned walls while timing it so that you arent flung into the air and forced to play catch-up when the titan speeds up. And, of course, the repetition problem exists here, too  it may be cool to be soaring atop a titan the first couple of times, but it still finds a way to get old fast.To some extent, Oure reminds me a lot of AER, another flight-heavy that seems like a bit of a wasted opportunity. In fact, they almost feel like two halves of a really great game: where AER was great at the flying bits but not so great at giving you something interesting to do, Oure sucks at the flying bits but has something moderately compelling to look forward to with its titan sections. Unfortunately, for now the two games remain separate, doomed to be incomplete without the other present to fill in its weak spots. Until the day when Heavy Spectrum and Daedalic Entertainment get together and make a really great flying game with a purpose, then, youre stuck with whats on offer here  and right now, thats not enough to make Oure worth your time.", "date": "March 21, 2018", "grade": "C-"}