{"name": "Yomawari: Midnight Shadows", "ref": "https://gaming-age.com/2018/02/yomawari-midnight-shadows-review-ps-vita-ps4/", "text": "If you played Yomawari: Night Alone, it probably wont surprise you to learn that its successor has no qualms about shocking players right off the bat. After all, that first game  and be warned this sentence will venture into very mild spoiler territory for something that happens in the first couple of minutes of Night Alone  started off with the shocking death of the main characters dog. If Yomawari: Midnight Shadows didnt do something a little upsetting in its first few minutes, it wouldve been a surprise.Even knowing that, however, I have to say that the beginning of Yomawari: Midnight Shadows is pretty messed up. I wont go into details, but be aware that its hard to imagine how an unsettling horror game like this couldve set the tone any better than it does.Ill also say that, despite that shocking beginning, in most respects Midnight Shadows is pretty much identical to Night Alone  which is both good and bad.Its good because Midnight Shadows shows, like its predecessor, that it knows how to set a deeply unsettling mood. The flickering shadows at the edge of the screen, hiding who-knows-what monsters and enemies. The sparse score, that throws in the faintest sounds to keep you ever so slightly off balance. The fact that, when death comes  and its pretty much inevitable, since thats just how these games work  itll probably come out of nowhere, and it will be marked by a splatter of blood across the screen. All of these are ingredients for a pretty solid horror game.Unfortunately, like its predecessor, Midnight Shadows has all these great ideas, but it doesnt seem to know what to do with them. The game still consists entirely of your on-screen characters very slowly walking around neighbourhoods, looking for clues and hiding whenever monsters come close. As I wrote about Night Alone as well: Im the last person who can complain about so-called walking simulators, since thats one of my favourite genres, but with Midnight Alone, it often feels like the flaws that get ascribed to that genre are actually more applicable here.To be sure, there are worse things for a game to be that unsettling and spooky  especially if, obviously, were talking about a horror game. Its just that it doesnt take long before you wish that Yomawari: Midnight Shadows would deliver more than a creepy feeling, and, like its predecessor, its a wish that never quite pays off.", "date": "February 15, 2018", "grade": "B-"}