{"name": "Headliner: NoviNews", "ref": "https://gaming-age.com/2019/09/headliner-novinews-review-for-nintendo-switch/", "text": "Ive been playing Headliner: NoviNews almost non-stop over the last day. During my time with the game, Ive started a revolution, gotten the Prime Minister shot, exposed a massive conspiracy, and helped launch an alcoholic drink that may actually be an opioid. Ive also caused a small local business to go under, fallen in love with a co-worker, saved a man from crushing poverty, and helped my brother become a famous comedian.Justnot all at the same time.See, while Headliner is ostensibly a game about the news, and about the power of journalists and editors to shape the world around them, its really about choices. You can choose to promote the new energy drink, and in the process keep sponsorships for your news channel flowing  but doing so means that people will become addicted, and youll have a mass suicide on your conscience. You can push for universal health care, which will help your brother get the psych meds he needs to stay healthy and functioning  but that may also lead to drug shortages, which has an indirectly deleterious effect on your love life. There are all kinds of intersecting plots at work in Headliner, and opting to publish any one story will have all kinds of consequences, seen and unforeseen, and you quickly learn that its impossible to have everything turn out just the way you want.What makes it so fascinating  and why Ive spent almost every waking minute of the past day playing it  is that the plots are so interesting, and the characters are so well-written. You cant help but want to help out your brother, and your co-worker, and the friendly shopkeeper, and nearly everyone else you meet, since theyre all so friendly and interesting, but you cant please everyone, and inevitably something goes wrong. On top of that, you quickly see how big, macro-level policy decisions have all kinds of effects at the micro-level, and you cant help but want to shape those decisions in a way that helps the people you love.Of course, just as in the real world, thats not how it works. And even if some of the policy decisions here seem questionable if viewed through a critical, real-world lens (i.e. the game takes a very clear pro-free market view towards health care thats not really borne out by reality), at the same time, the way you still have to balance real-world interests between a bunch of less-than-perfect outcomes undeniably rings true.I do have a few minor quibbles with Headliner, to be sure. There are a few spelling and grammar mistakes here and there, which are more noticeable because this is a game thats all about words and language. Theres also a slight bit of disregard for details, like when the game shows you six people preparing to jump to their deaths, and then someone you speak to references the five people who just killed themselves.But these really are minor quibbles. The fact Ive spent the past day playing and replaying Headliner shows how addictive it is. In fact, even as Im writing this, Im eager to go back and try out some different choices to see how that impacts the game. Thats not something that happens very often, at least in my experience, and its why this game is easily one of the best Ive played in a very long time.", "date": "September 16, 2019", "grade": "A"}