{"name": "Gigapocalypse", "ref": "https://gaming-age.com/2022/09/gigapocalypse-review-for-switch-playstation-xbox-pc/", "text": "Gigapocalypse is an odd mixture of games. You wouldnt think theres an intersection between Rampage, Tamagotchi, and clicker games  and yet, here we have a game that combines all three.And you know what? It mostly works. Its always fun to play as a monster laying waste to cities, and in the case of Gigapocalypse, you get three different monster options (each corresponding to a different difficulty level), and six different cities to destroy. Thats a lot of destruction.Mind you, it takes awhile for the destruction to build up to anything fun. At first your monster will struggle with even reaching the halfway point of the first level, and it takes a bit of time to improve their stats to a point where they can reliably ruin everything in their path while also absorbing all the attacks that come their way. This means that theres a lot of grinding to be done.Unlike most games, however, the grinding in Gigapocalypse is all at the beginning. At some point, youll improve your monster to the point that theyre practically indestructible. It doesnt matter how big the buildings are in front of you, or how many knives are stabbing at you from the ceiling, or how many projectiles of all shapes and sizes are flying your way: youll take it all, and keep moving forward without even breaking your stride.And what will you be doing as you move forward? Thats where the clicking comes in. Gigapocalypse is an autoscroller, which means that your monster automatically moves forward. However, to fire off its attacks, you need to constantly tap the screen, shooting off lasers or firebeams or whatever in the direction of whatever you want to incinerate. While you cant do much at first  like I said, theres a lot of grinding you need to do before you get to that  eventually, youll find yourself tapping all over the screen as youre confronted with a plethora of moving targets.(Its worth noting, unfortunately, that the more targets  and the more items in general  there are on screen, the worse Gigapocalypse performs. In fact, things got so bad at one point that the whole thing slowed to a crawl, and I was forced to quit the game entirely and start again from the main menu. Most of the time it wasnt quite so bad, but its undeniable that the further into the game you get, the worse it performs.)As for the Tamagotchi aspect of the game  thats actually wholly separate from everything else. In between stage selection, as youre bumping up your monsters attributes, you also have the option of playing with a baby version of your monster. You can feed it, pat it, clean up after it, even spruce up its living space. It doesnt add a whole lot to the game, but its still pretty cute.As much as I enjoyed Gigapocalypse, however, I wouldnt say that I whole-heartedly recommend it. For one thing, its really hard to imagine playing it with anything other than a touchscreen (though a mouse might be a decent alternative). At the same time, though, the performance on the Switch isnt the greatest, to put it mildly. So the window for enjoying it is awfully narrow. Still, if youre okay with compromising here and there, it makes for a pretty fun time.", "date": "September 26, 2022", "grade": "B-"}