{"name": "Raiden V Directors Cut", "ref": "https://gaming-age.com/2018/01/raiden-v-directors-cut-review-pc-xbox-one-ps4/", "text": "If youre anything like me then you love a good SHMUP. And if youre really like me, then you like the definitive version of a good SHMUP even more! Yes, sometimes it does pay to be patient with the latest releases, and thats exactly the case for Raiden V Directors Cut.So all this means that Im also playing Raiden V for the first time. You could probably say it has nothing to do with patience but that this game got past me back when Raiden V released. Since UFO Interactive provided us a copy to share for the Directors Cut release, I said why not see what I missed? Well from what Ive played, I really missed a gem with this one.While I wasnt really following the story, I always enjoy a game that has lots of radio chatter. It really makes you feel like the mission has a purpose and your team will back you no matter what. Every now and then Id catch a bit of what was happening with the mission, but just knowing that there are updates to how the mission is going makes you feel good and ready to take on the next enemy.With that being said, Raiden V is another entry in the good old Raiden series. Lots of nice weapons to experiment with and different ships as well. I especially love the plasma shot. Even in its lowest form, it just wipes the floor with enemies on screen while they try to get a shot in. At power level 10, its almost no contest for anything standing in your path. Good luck, suckers!Its been a while since Ive played a Raiden entry, so I cant remember which weapons are carried over and whats new here, but theres almost no bad choice unlike some SHMUPS. Other weapons are standard spread shots, and some interesting choices like the prism which deploys an actual gem that changes the direct laser weapon into spinning blades of death. The prism is tricky, but I bet I can get it under my belt with more practice. I like interesting shots like this and had fun experimenting with whats on offer.I also like how when you stop firing, any onscreen items will be pulled to your ship. This is a great tradeoff to give players who are hoping to get a higher score. Sure, you dont have to do this, and youre probably better off just getting comfortable with enemy patterns before you start lowering your guard.I dont really care for the music, but the game looks and runs great. Lots of colors and exciting effects keep the action going. The controls are also good out of the box, and UFO Interactive provided a Steam key for us to check the game out on PC. It ran smooth on my computer with no issues, slowdown, or crashes.Some other great features are co-op, always a good time if you have a friend nearby. The game also has an alternate special attack called Cheer, which unloads missiles across the screen for a while. I love this as its like having a second bomb on hand.Another part of this game that will add variety are the branching paths on each stage. For example, you may think youve seen everything France has to offer, but just like in real life you really havent if youve only played the level once. Maybe I should visit sometime", "date": "January 6, 2018", "grade": "B"}