{"name": "Culdcept Revolt", "ref": "https://gaming-age.com/2018/01/culdcept-revolt-review-3ds/", "text": "My first experience with the Culdcept series of games was with the Xbox 360 release of Culdcept Saga nearly a decade ago. As a pretty big CCG/TCG fan, it was one of the better attempts at creating a video game collectible card game, and stood out as unique with its Monopoly-esque board game mechanics. While the game didnt necessarily stick with me at the time, I didnt want to pass up the chance to revisit the series with the more recent release of Culdcept Revolt on the Nintendo 3DS.If youve not played a Culdcept game before, heres what you can expect from Culdcept Revolt. Youll craft a deck of cards, divided up between monster units and spells. Monsters come in four different colors, which become important when you actually start to play them on the field. Spells are generally one-use cards, either granting more dice rolls to move around the board with, fixing dice rolls to specific numbers, or granting buffs/debuffs to monster units in play.The board in Culdcept is represented by a playing field divided up into a series of squares. The actual layout can vary from one battle to the next, but each square is meant to be a land. Lands are then meant to be controlled, and if an enemy player stops on a land you control, they will pay a toll to you. The money earned from tolls will allow you to play more cards (all of which cost currency), so that you can control lands, play more cards, etc. The loop isnt hard to figure out, and even if you have zero experience with collectible card games youll have little trouble figuring out what to do.In order to win, you just need to achieve a certain currency goal. As the story mode of the game begins, that number is generally around 8000. This might seem like a lot at first, but once you start to deploy monsters, you can then spend currency to level up the land the monster sits on, which in turn will ratchet up the price of rent when an opposing player lands there. It doesnt take long for rent to become pretty expensive, so battles dont last nearly as long as you might think.However, the overall difficulty does ramp up, and games become more complicated with new card types, more varied board layouts, and even matches that feature more than two players. This is all a plus though, as the base, opening difficulty is pretty easy and can make the game feel a tad boring at the onset. Culdcept Revolt also opts to break its tutorial into pieces at the onset of the game, which also doesnt do a great job of drawing you in at the beginning.That said, once the story progresses, theres a lot to enjoy. You can customize your deck of cards however you want, and even create multiple decks if you so choose. Youll gain access to packs of cards with varying degrees of card rarities as you play, and you can generally earn enough in-game currency by finishing matches to purchase one or two packs of cards after every match. Yes, the content of the packs is random just like real-life card packs would be, but I never felt like I was getting the short end of the stick when it came to the cards I had available.As an added plus you can opt to play against real players online, or go back and play against A.I. opponents youve previously defeated. This helps you fine tune your deck creations, and just gives you an alternate source of in-game income for purchasing more card packs, instead of hitting your head against the wall again and again against the same opponent.I honestly have very few complaints against Culdcept Revolt. The story isnt particularly mind-blowing, you play an amnesiac hero that joins a small resistance, which is certainly a well-known video game trope at this point. There are no real startling revelations to speak of, and the cast of characters feel pretty forgettable. Im also not a huge fan of the art style of the sprites and environments throughout the game, but a lot of that just comes down to personal taste. On the plus side, I think the card artwork is pretty solid, but the UI that surrounds the card artwork isnt great either and sort of makes the cards themselves feel cheap.Regardless of those issues, I definitely think Culdcept Revolt is a neat game, and worth checking out on 3DS. There definitely arent a lot of games out there that emulate the experience of a deck-building CCG, and certainly none that employ the other board game elements that the Culdcept series does. If youve ever been curious about the series, I would certainly suggest starting here.NIS America provided us with a 3DS code for review.", "date": "January 2, 2018", "grade": "B"}