{"name": "Wulverblade", "ref": "https://gaming-age.com/2017/12/wulverblade-review-nintendo-switch-ps4-pc/", "text": "The American education system has never been known for ensuring their charges are imbued with adequate knowledge of world history. Generally the average Americans grasp of British history consist of the following events, freeing ourselves from King George during American Revolution, saving their asses in World War 2 and having them save us in World War 3(Ok maybe that last one didnt happen). Perhaps the folks at Fully Illustrated/Darkwind Media got the memo and maybe it mightve been their onus for developing Wulverblade. A side-scrolling beatem up with a historical tinge, Wulverblade makes its debut on the Nintendo Switch with versions on other platforms coming soon.Wulverblade takes place in the British Isles in 120AD. The Roman empire has been expanding their empire across Europe. Having reached and conquered the southern region, the Roman 9th Legion beginnings their march northwards. Standing in their way is a hardy band of Northern tribesmen, looking to take the battle to them. You take control of one of 3 characters, each with their specialities. Caradoc is your balanced fighter, Guinevere the speed character and Brennus the power character. The trio will cut their way through a variety of collaborator Britons with the goal of eventually taking on 9th Legion.The gameplay is fast paced and brutal, enemies will come at you from both sides and in large numbers. They will not stand still while manhandle their allies. Archers will intelligently hang back and take pot shots at you with their arrows. Shielded enemies will block your blows, allowing their compatriots to flank and hit you. Those hits are often pretty hard, I find myself losing a life after 4 or 5 enemy blows. There are enemies who can call artillery to fill the skies with arrows to impede your progress.That is not to say you are helpless. Caradoc and crew can give as well as they can take. Arms and heads will roll (strangely enoughno legs ever get lopped off), and to give insult to injury, you can pick up these dismembered limbs and decapitated heads and throw them back at their surviving allies.Visually Wulverblade uses a very dark color palate. Most of the stages take place at night, torches are plentiful in these Northern British Isles. That is not to say it is dull looking game, on the contrary the blue warpaint on the player characters really help them stick out.Another thing which made this stand out from your run of the mill brawler is the amount of attention to detail and extras the development team put into the extra. Menus with blurbs describing the history of some of the weapon pick ups and the locales which Caradoc and his crew travel through are definitely fun to go through after you are done lopping the heads of the invading Roman hoards.Alas my gripes with the game are minor, given there are three playable characters, why wasnt there an option to have 3 players simultaneously? Other brawlers have this feature and there is even a sequence in which the player not selected joins you in the battlefield. This is definitely something which would help even the odds a bit. This feels like an oversight which could possibly be corrected on releases on other platforms. Another thing which felt frustrating was the sheer amount of decapitations left the battlefield a little cluttered. Often times I would find myself throwing limbs when all I wanted to do was pick up some health or tried to do a follow through with a parry. The frequency which that occurred was somewhat of a point of frustration.Overall Wulverblade came out of left field and was a thoroughly enjoyable experience. It cartoony art design is quite pleasing and the gameplay is solid. Though who would enjoy history will find a bevy of content after all the battles are done. This title will surely find its place in history.", "date": "December 6, 2017", "grade": "B+"}