{"name": "Astral Chain", "ref": "https://gaming-age.com/2019/09/astral-chain-review-for-nintendo-switch/", "text": "In a console landscape of re-releases, remasters, and years-after-the-fact ports from PC, Astral Chain both stands up as a wholly new gameand a throwback to PS2 era action games.Yes, fifteen years ago, when the focus of mainstream gaming wasnt on super-cinematic experiences. When action games either decided to throw a single wacky mechanic at a workmanlike game, then slapped a coat of paint overtop that either wound up being a samey military theme or Neon Genesis Evangelion.Thats all it took. Gimmicks like environmental destruction, physics manipulation, and innovative movement design started making small dents in the overall zeitgeist of action gaming.Alongside was Devil May Cry, which begat a long line of descendants and copycats that were obsessed with combos and looking cool. Descendants, as some of the creative talent from that franchise went on to work on Bayonetta.And for the longest while, those two worlds never really intersected much. Until now, wherein both of those paths intersect in a game that both has a general focus on combos and a wacky gimmick in the tethered Chimera named Legions.Seriously, its a game where you can get ahead by tangling enemies in a chain that attaches your character to a handcuffed monster.Thats baffling.But it works. It works fantastically. And the Legions, even though their effectiveness outside of combat is limited to adding abilities youd just have imbued in your character otherwise, are a welcome partner. In-combat, they provide a huge asset. Figuring out how to use them is key to advancing in the game, and working on timing hits to force sync (roughly a tag team move) attacks starts to open things up.Visually, Astral Chain owes a huge debt to Neon Genesis Evangelion (as referenced before), given the Legions designs and berserk nature draw heavy inspiration from the aforementioned anime. Its impressive to see a game take a design element and run so far with itand be so consistent on the way there. Very little inside Astral Chain doesnt look good, and every level has some visual flair which makes it feel unique.That said, the storyline is Lacking. Its generic to the point of parody, and only really acts as a window dressing in-between levels. The levels are good enough to make you not feel bad for starting to skip dialogue, but manwhen you can call every story beat from the time the game is first booted, theres an issue.Moreover, game concept and design aside, the camera in Astral Chain is ofttimes the most difficult villain to defeat. Sometimes it wanders into a corner, sometimes it turns on its own, sometimes it just refuses to point at what youre targeting. There feels like a missed point here, and it definitely cuts into the relatively thick layer of polish PlatinumGames put on the game.But I have to give Astral Chain a lot of respect. Its a concept, a theme, and a design philosophy that feel a little datedbut are delivered really well. A rare breed, and one thats welcome.", "date": "September 11, 2019", "grade": "B+"}