{"name": "Gear.Club Unlimited", "ref": "https://gaming-age.com/2017/12/gear-club-unlimited-review-nintendo-switch/", "text": "Almost another year of gaming is in the books as we get ready to close out 2017. What a year its been for video game software and hardware. From the release of the Xbox One X, to simply amazing AAA and indie titles released throughout the year, something is certainly clear. 2017 was indeed a year for gamers.With that said, my list of coverage grows shorter as I finish up playing and testing any games and/or equipment for the year. I wanted to check out something that I normally wouldnt cover. I thought it would be a great opportunity to maybe find something that may be somewhat of a gateway into a genre that I would normally not play.Thats where Gear.Club Unlimited comes in. GCU is a new racing game for the Nintendo Switch that was originally a mobile game. At first glance, I was concerned because any time Ive played a racing game on my phone, it wouldnt last more than a few races. The primary reason was they were usually Free to Play. The entire category is a mixed bag to me. I have had my fair share of spending real currency in some of these games, but it really takes away from the experience.In the case of GCU, Im happy to report that none of this is a concern. What makes the game even more enticing is the fact that its the Switchs first racer. This was one of the selling points to me as if Im going to dip into a new genre, it may as well be in a way that I can play whenever. Much of my time with GCU was in handheld mode, due to the work commute.In my review for LA Noire, it was mentioned that I wasnt crazy about the driving mechanic when using the Joy-Cons, primarily from a design standpoint. I guess from extended play and now the introduction of a game that focuses on the use of the triggers, my hands have gotten used to it and playing feels smooth.Something I enjoyed about it was the ability to play solo and still have a sense of accomplishment in between sessions. The primary mode in the game is single player and focuses on you earning money by winning races. As cut and dry as that sounds, the game does a good job of making it more interesting. As you win races, you earn starts and unlock new areas on an ever-expanding map that looks to give you tons of hours of gameplay.Im not one for customizing cars in any racing games Ive played, but GCU found a way to make it interesting with having you build your own Performance Shop which you can customize to your liking. In the early hours you will need to be conscious of your layout as you start with limited space to work within. As you rank up, you will unlock more space and really tweak it to your liking.At its core, GCU is a racing simulator, but is very accessible and playable in short sessions. Its important to note that because, when I played 10 plus hours, it didnt once feel that way. In no way am I a car enthusiast, but Eden Games has me more interested in making my car look great and be at its top performance.The main drawback for me was the overall difficulty of the races. For the first couple hours, I felt the races were way to easy which helps for the sake pf progression but doesnt help with a sense of accomplishment. However, once you get a couple hundred stars, the difficulty spike increased exponentially and left me frustrated and forced me to take a significant break from the game entirely. This alone can be a deal breaker for a veteran to the genre. With that said, GCU to me, is best as a filler game to play in small increments when playing solo.Other than that, the only real tough sell is the price point knowing that you can play the mobile version for free. The other side of that is you need to keep in mind that there are microtransactions on the mobile version which if not careful, you could easily spend more than the cost of the Switch version, which is Unlimited meaning no microtransactions.At the time of this writing, there werent any other games to compare to since its the first racer on the system. On the plus side, its coming from a reputable developer known for the Test Drive series. There are a couple other racers coming within a couple weeks and well see if they can maximize the value in having a game like this on the Switch. As someone that isnt a racing fan, spending many hours with it may have opened Pandoras box into another genre that will add games to my eternal backlog of games. Bravo Eden Games, Bravo.", "date": "December 1, 2017", "grade": "B"}