{"name": "Tokyo Xanadu", "ref": "https://gaming-age.com/2017/11/tokyo-xanadu-review-ps-vita/", "text": "Try as I might, Ill never totally understand why so many Japanese games seem to love to mix in social systems. Or, more accurately, I think I understand why they do it (the Persona games do it, and people love them, so a lot of imitators over the years have tried to imitate the formula down to the letter), but I just dont understand the appeal. Having lived through high school once, I have no desire to ever navigate through those fraught social interactions ever again, whether in real life or in games. Making it a mandatory, huge part of so many games baffles me.Tokyo Xanadu involves a very, very heavy social component. Youre not just building relationships with the various people around your school, youre also juggling a few part-time jobs that place demands on your time. That means that while the game may describe itself as a massive action RPG, the more accurate description would be massive action game/life simulator.Id be lying if I said I enjoyed running around Tokyos various districts and high schools, chatting with passersby and carrying out menial tasks. It advances the plot, sure, but it fits in firmly with the bad tendency some JRPGs have of telling (and telling, and telling) rather than showing. The characters generally arent interesting enough to merit all the exposition they get, and, as is frequently the case, that fast-forward button will look mighty tempting a few hours in.That said, when the game let you loose in a dungeon and youre hacking and slashing away at various monsterslets just say all my complaints fall away.Actually, lets say more than that: the action in Tokyo Xanadu may be a little spread out for my tastes, but when its on, its pretty fun. The animations are pretty seamless, and its possible to build up some pretty extensive combos just through mashing your buttons  which, I admit, is more of a selling point to me than it probably is to many other people. Likewise, the dungeons are logically laid out, which isnt so great if you just want to explore, but its pretty good in terms of building up to the boss battles at the end of each one.Its just a shame that theres so much talking in between all that. As I said, I understand why its there, but that doesnt make it any more enjoyable. However, when the action is as fun as it is in Tokyo Xanadu, its something Im willing to put up with.", "date": "November 29, 2017", "grade": "A-"}