{"name": "Bodycheck", "ref": "https://gaming-age.com/2017/11/bodycheck-review-ps-vita/", "text": "If youre a fan of sports games, itd be understandable if youve moved on from the Vita (assuming you were even there in the first place). We havent seen an entry from MLB The Show in years. There was one Madden game. EA stopped porting over FIFA roster updates quite awhile ago. Apart from Active Soccer 2 and, in a weird way, Drive Girls, there hasnt been a lot on the handheld in recent years.Into that void steps Bodycheck. Its been in development for years, which shows an admirable amount of dedication to the platform. And Id like to say that this dedication has paid off, and that Bodycheck is an amazing sports game that shows what the Vita can do, butwell, its not that good.I mean, its not a bad game. In some respects, its kind of reminiscent of Rocket League: a bunch of players (human, in this case) hurling a ball around an enclosed field with only a vague idea of where its going, hoping to fling it into the opponents net at the other end. When it works, it has the same sense of enjoyable chaos that has made Rocket League such a success.The thing is, though, it very rarely works. For starters, the controls are kind of a baffling mess. The tutorial consists of a single static screen, and nothing is particularly intuitive. If you mash a few buttons youll be able to get the hang of the game, more or less, but it seldom feels like the game demands much skill or precision.On top of that, the general layout is extremely hard to get a handle on. Your view is limited to only a small portion of the screen, which makes it a constant challenge to figure out where your teammates are and how much further you have to reach the opponents net. In general, Id just cross the centre line, take a few steps, and fire the ball at the goal, and Im not sure whats worse: that this is what my approach devolved into, or that this approach actually worked more often than not. On defense, it was even more of a crapshoot: its impossible to tell which player youll suddenly control, so you just press everything rapidly and hope hat, eventually, youll control the player nearest the ball or the opponent.", "date": "November 27, 2017", "grade": "C+"}