{"name": "Discovery Tour: Ancient Greece", "ref": "https://gaming-age.com/2019/09/discovery-tour-ancient-greece-review-for-pc-ps4-xbox-one/", "text": "Americans are often accused of being uncultured, barely aware of the history and the goings on of those outside of their borders. As someone which went through the education system here in the US, I sadly have to concur. We are not incentivized to learn anything that doesnt benefit our lives in the day to day. Thankfully like slipping in vegetables into a delicious steak dinner the team at Ubisoft has devised a genius way to hide learning into their IPs.Starting with Assassins Creed: Origins the Discovery Tour DLC opted as a way to allow players to further learn about ancient egypt without the need to get their hands bloodied. Discovery Tour by Ubisoft: Ancient Greece is the installment that is meant to enlighten players on the backdrop which Assassins Creed: Odyssey takes place in. Utilizing the maps and assets from the main title, the title offers 30 guided tours which covers topics such as daily life, politics, warfare, the arts, culture and even myths. On the tour, the player will travel to a number of stations which a video will play providing details of subject matter. At the end of the tour, the player can reconvene with a historical figure and take a small quiz to see if they retained the information presented.Knowledge isnt the only reward for going on these excursions. Completing tours, uncovering discovery sites will unlock player as well mount skins, so that you can customize who will represent you as you traverse through the Grecian isles. Studious players can find themselves galloping along these dirt roads on a Pegasus. My gripe about this experience is that it needs a rather modern PC to run and thus hinder the reach of the title. At 20 dollars, the cost of the standalone version of this title is cheaper than a trip to the museum, however owners of Assassins Creed: Odyssey will get this experience free. Which would make the latter option is probably the best method of getting this content. These Discovery tours are a great addition to a very well-known series. My hope is that the team at Ubisoft finds a means to do these tours for previous settings for the series, such as Jerusalem, Renaissance Italy and even Colonial America. Perhaps if VR revolution were to take hold, it would come full circle if Ubisoft can incorporate VR into these tours thus finally getting players the full Animus treatment. For now, those looking to do more than take a hidden blade to the Templars should definitely give this tour a look.", "date": "September 11, 2019", "grade": "B"}