{"name": "Mary Skelter: Nightmares", "ref": "https://gaming-age.com/2017/11/mary-skelter-nightmares-review-ps-vita/", "text": "In some respects, what you get out of Mary Skelter: Nightmares isnt all that different from, say, Demon Gaze, or Operation Abyss, or Stranger of Sword City. Its a first-person Japanese dungeon-crawler with turn-based combat, with your typical cutscenes that feature various characters sliding onto and off of the screen. From that perspective, it doesnt break much new ground.The thing about Mary Skelter iswell, its kind of insane.Some of this, admittedly, is in the distinctly Japanese, kinda-pervy definition of insane. Case in point: the male main character, Jack, can support the female characters by shooting his blood onto them with his Mary Gun. (There are just so many squicky things going on in that sentence, its hard to isolate just one.) Additionally, of course, this wouldnt be a JRPG unless the female characters clothes fell off for some reason; here its because too much monster blood can corrupt them, and cause them to go into a violent, scantily-clad rage.Other crazy aspects of the game are significantly less cringe-worthy. For example, the story is absolutely bonkers, and brings together Jack from Jack and the Beanstalk, Alice in Wonderland, Red Riding Hood, Sleeping Beauty, and a number of other fairytale characters. True, the characters themselves never grow beyond stereotypes and archetypes, but the plot  in which theyre trapped in a sentient dungeon  is over-the-top enough to make that easy to overlook.Ive also got to give Mary Skelter: Nightmares credit for using a colour scheme that you dont usually see outside of the early 90s. Neon pastels are a nice change of pace from drab greens and greys (which seem to be especially predominant in games of this ilk), and it gives the game a different, Hot-Topic-but-in-a-good-way kind of vibe.Beneath it all, of course, you mostly have a pretty standard dungeon-crawler; if youve ever played one before, youll know what you have coming up here. That said, the dungeon here is significantly more interesting than most I can name, since certain monsters actually chase you from time to time, which forces you to move quickly unless you want to be stuck in an unwinnable battle. Its a neat twist, and the game is much more interesting for it.Of course, the same could be said for nearly everything going on in Mary Skelter: Nightmares. As I said at the beginning, there are many ways this game couldve come off as just another Japanese DRPG. To its enormous credit, it avoids all those pitfalls, and makes an interesting game in the process.", "date": "November 16, 2017", "grade": "A-"}