{"name": "Warhammer 40,000: Darktide", "ref": "https://gaming-age.com/2022/12/warhammer-40000-darktide-review-for-pc/", "text": "Warhammer 40,000: Darktide, which I will only be calling Darktide from here on, is Fatsharks latest game in their Warhammer, but its Left 4 Dead series. This is the first foray into the universe of Warhammer 40K for it, but it still somehow retains a lot of similarity to the Vermintide games. The formula remains much the same, although Im not sure Im a huge fan of some changes made to it. The 1.0 release seems to be a bit light on content, but its still pretty fun none-the-less.The game has you choose from one of 4 classes, all of which can use mostly the same weapons and largely have a difference in what theyre best with and their abilities. There is some level of customization for the character you create, including planet of origin and backstory choices, but I have yet to see how this comes into play, if it does at all. You can essentially boil it down to the 4 standard classes of any RPG, so to put it simply Ill just say that you can choose from effectively a Fighter (Zealot), Tank (Ogryn), Mage (Psyker), and Ranger (Veteran). Matches always require 4 players, but there is no requirement for there to be 1 of each class or anything like that.Despite being a futuristic fantasy setting, melee weapons take heavy precedence over the guns a lot of the time. If for no reason other than that swinging a melee weapon mows down a crowd, while a shot from your rifle only takes out one or two. This isnt to say the guns are useless they certainly have their place. Many enemies snipe from afar and a veteran can do well to take out the enemies plinking away at their companions pushing forward. The one complaint I have about the system of guns, however, is that honestly it feels like the veteran class is pretty useless up until you get some later game perks. Since anyone can equip most guns, anyone on the team can opt to just kill the sniper, eliminating much of the the purpose of the class. This does get better in later levels, but earlier on as a veteran, you can feel like your existence is pointless. Sorry, you can probably tell which class I chose.The missions do not have any sort of linearity and exist in a strange revolving door space. There are a handful of currently active missions to everyone that cycles over time, and there is no linearity to them at all. Each mission has a linear objective within, but there is not a set path to navigate between each mission and there isnt much in the way of progression beyond leveling up and getting better gear in general. One of the things I find is somewhat missing in the system of missions is being able to play solo. You MUST play with other players, there is no option not to. You can only play in a squad of 4 and if you do not have 3 friends, you have to take a random player.Much of the gameplay is a hack and slash Left 4 Dead adjacent style, with equipment and healing stations scattered about. Special enemies that trap you and all. Its the same formula Vermintide used, which isnt a bad thing, but youre probably already used to this if youve played the Vermintide or Left 4 Dead series. Hopefully as more updates and content roll out, the game adds more content to keep this fresh, as running the same handful of missions over and over does stagnate eventually.All in all, Warhammer 40,000: Darktide is pretty enjoyable, but definitely lacking on content at launch. Theres a really good launching point presented at the moment and I expect the long term lifespan of Darktide will be great. There are a few small bugs to work out, but nothing I encountered that was unforgivable. I dont think theres much you havent seen here before, other than maybe the setting, but its fun nonetheless.", "date": "December 14, 2022", "grade": "B"}