{"name": "Nioh: Complete Edition", "ref": "https://gaming-age.com/2017/11/nioh-complete-edition-review-pc/", "text": "The announcement that Nioh, the ultra-hard, Samurai action RPG from Team Ninja and Koei Tecmo was going to be released on PC came out of nowhere. The original game released in February of this year exclusively on the PlayStation 4. The Dark Souls/Ninja Gaiden inspired RPG was incredibly well received, but something that the community largely assumed would remain a PS4 exclusive, not unlike 2015s smash hit, Bloodborne. Then out of nowhere, they announce not only a port, but a Complete Edition coming to PC, and coming soon! The Complete Edition includes the base game, as well as the three-story expansions that came to the PS4. This looked to be the definitive version of an already amazing game, but I tempered my excitement, mostly due to being bit by PC ports too many times in the past. Unfortunately, I ended up getting about 50% of what I wanted here, with the game still being absolutely fantastic, but the port ending up with more issues that I had hoped.To start things off, there is NO mouse support. None, like at all. You cannot navigate a menu with a mouse, much less play the game. Keyboard support exists but is an absolute nightmare. If you want a challenge similar to that of playing Dark Souls III on a Guitar Hero guitar, play this game with a keyboard. If not, the controller is your only real option. This doesnt hurt me greatly, I am a controller player primarily with everything, but if you are a keyboard and mouse gamer, this is frustrating. Partly because it is inconvenient to be forced to play with something you are not used to and partly because it is yet another in a long line of ports to come to the PC but not actually support PC players. I understand the frustration coming from someone like that, and they are not wrong. Nioh has two options when booting in Steam, either play Nioh: Complete Edition or run Nioh: Complete Edition launcher. If you run the game without running the launcher first, you will be greeted with a windowed game screen and locked graphics properties. Running the launcher allows you to adjust these settings but without any real freedom or explanation of what their settings mean. Rendering Resolution and Screen Resolution are two totally separate settings, again with no real explanation why. High Medium and Low are the only choices you have, leaving you wondering what the resolution settings all mean and forcing players to mess around in game to see which setting works best for them. This is another problem, as it means you will be switching back and forth between launcher and game just to adjust simple graphics. This simply isnt good. At no point should that much effort go into changing the settings, especially in a game that, admittedly, doesnt even look that great no matter what you do. Locked 30 or 60 fps can keep things smooth, but there is no way to really get that WOW factor here. The game quite honestly looks old, not like something from earlier this year. It is mostly given a pass on the PS4 due to console limitations and the fact that the game really doesnt NEED super high-end graphics. They are good enough and the environments are all dark and dreary, which makes it feel better than it really is sometimes. On the PC, however, I was hoping for some real improvements, not just a slightly smoother sister experience to the console.During my first day with the game, I experienced pretty consistent crashes and stuttering, but a few driver updates and playing with the settings calmed that down pretty quickly. I still have framerate drops at absolutely random times throughout the game. Sure, this could be my PC struggling to run it, but at the same time I look at what I can achieve with a game like The Witcher 3 and am left wondering what could possibly be giving me these issues with Nioh: Complete Edition on my end. Ok, negatives about performance and ports out of the way, lets talk about the game itself. As the resident Souls-Borne expert here at Gaming-Age I was beyond thrilled to get to dive into yet another soul-crushing, curse-inducing, ultra-hard RPG. Having attained all of the achievements across the three Dark Souls games and getting the Platinum Trophy on Bloodborne, something new to test myself against was refreshing. Team Ninja does an amazing job of taking elements that make Souls such a massive hit and adding in elements of Ninja Gaiden and other difficult games for a really balanced, different experience. If you try and approach combat in Nioh like Dark Souls, or even the much faster Bloodborne, you will find yourself Freed from this mortal coil more times than you might expect. Combat is fast, but also highly tactical. Each fight has to be approached with care and planning has to take place prior or else, again, you will experience a quick death.Combat comes with three stances, present with all weapon sets. High, mid and low stances all operate differently and have pros and cons, with times to use each throughout the game, sometimes all three in one fight. High does the most damage but leaves you vulnerable to attack and makes movement and dodging slower. Mid stance gives you wide, sweeping attacks with decent enough power and defense. This is where I found myself spending most of my time, with combo transitions into High for finishing moves or to get some extra damage in, but staying mostly in Mid. Low stance is the fastest, but weakest in terms of actual damage per strike. Where players take advantage of this is in the Ninja class, with low stance being perfect for landing a dozen quick blows and rolling out of the way. This is a lighting fast, glass cannon stance when used in conjunction with the right build. These stances bring a whole new level of depth to the semi-familiar combat system and really sets Nioh apart from the titles released by From Software. Enemies are diverse and varied, not as much as the titles I mentioned previously but still enough to keep the surprises coming. The bosses in Nioh are a definite strength, with memorable fights scattered throughout the entire game and extremely difficult yet mostly fair mechanics. Nioh as a whole feels like the easiest of this family of games, but it is definitely not an easy game. Online co-op makes a strong return, with the ability to summon jolly cooperators to assist with levels and boss fights present in exactly the same fashion players have come to expect from these games. The biggest departure from the Souls family comes in the form of level design. Instead of a giant, interconnected world to explore you have levels, selected from a map with level descriptions and difficulty markers along with recommended levels. To replay an area you have to choose to replay that mission, then either reach the end of said mission or use an item to quit out to the map, either costing you all of your currency or keeping it depending on the item you use. This makes farming levels more of a chore but allows for more specific replay value. If you hated a particular area or boss, you can replay the entire game for the most part and simply skip the unwanted area or boss.Assigning a grade here is exceptionally difficult. I would like to judge the game based on its own merit, PC port notwithstanding, unfortunately, this is a review for the Complete Edition, which is the PC port. If you have ever praised the sun, or if you have any fear of the old blood, Nioh is an absolute must play. A fantastic and deep combat system, coupled with great boss design and a difficult yet fair effort/reward loop put Nioh right up there with its not so distant brothers in Dark Souls and Bloodborne. If I were to assign a score to the game, simply for its content it would absolutely be a solid A. Unfortunately, even though it is the Complete Edition, this is not necessarily the superior version of the game. If you only play games on PC, this game is still a no-brainer to pick up, but if youre like me and have consoles as well as a computer, I think the PS4 may still be the place to play Nioh.", "date": "November 9, 2017", "grade": "B-"}