{"name": "Destiny 2", "ref": "https://gaming-age.com/2017/11/destiny-2-review-pc/", "text": "[Eds Note: The Destiny 2 PC review is an extension of our original Destiny 2 review, here.]PC gamers have gotten what they have clamored for since September 9, 2014, Destiny on the PC! Granted, this is Destiny 2, and it comes to us a full month after its release on consoles, but still. ITS HERE! So lets dig in shall we?For starters, please note that this is in no way a review of the game. Our own Craig Majaski reviewed the full game at launch back in September where he gave it a solid A grade, saying At its core, Destiny 2 takes everything you loved about the original and cranked it up to 11. The graphics are flashier, the sound effects are louder, the content is meatier, and the overall experience is better.. This article is simply an addition, reviewing the performance and features on the PC (a PC copy of which was provided by Activision).Why do people play on PC over console? Everyone you ask is probably going to have a slightly different answer, but for me its graphics quality. Beautifully rendered 4K games and astounding 60 frames per second or more make PC gaming the clear winner when it comes to visual fidelity. The downside here is the amount of money it takes to get a truly out of this world machine, and the amount of upgrades you will inevitably need every few years to keep up with the demands of current games. For many, that barrier to entry is too high, and thats ok. For those of you crazy like me though, Destiny 2 will really show you where all that money has gone.Destiny 2 is one of the most visually impressive games that I have played since converting from primarily consoles to PC about a year ago. In that time I have stretched the legs on my rig a few times, but Destiny 2 is the first game that really made me feel like I had something special. Smooth movements, no screen tearing, 60 FPS wonder is what Destiny 2 delivers flawlessly. I did not experience any graphical bugs or hiccups and could not be more impressed with how things run.Linking Destiny 2 with the Battle.net launcher worked great, pre-loading and launching was flawless the minute the game went live. Servers have been well maintained and populated, I have not found a shortage of players so far in either the story or the Crucible content. Slightly higher than average load times when returning to the hub world pop up from time to time, but are spotty if anything. Clan linking and connecting with friends is simple and intuitive, with no issues to speak of right now. The connecting of your Bungie and Blizzard accounts was a nice touch and made finding your friends that much easier.As for the content, not much has changed since the launch on console. Strikes still allow 3 players to connect and play, with the Nightfalls remaining tougher versions of said Strikes. I have not had the chance to play a Raid yet, as it has not become available on the PC, but I will be taking my first one on later next week with my group of six.", "date": "November 2, 2017", "grade": "A"}