{"name": "Spyro Reignited Trilogy", "ref": "https://gaming-age.com/2019/09/spyro-reignited-trilogy-review-for-nintendo-switch/", "text": "I went into Spyro Reignited Trilogy with no small amount of skepticism. Sure, it got rave reviews on its initial release on PS4 and Xbox One  including from our own Tyler Nethers  but it feels like a lot of the time those raves are fueled by a heavy dose of nostalgia. As someone who never played any of the Spyro games the first time around (I was strictly a Mario Kart + sports gamer back then), I was fully prepared to find myself underwhelmed.Turns out, I should stop being so cynical, because Spyro Reignited Trilogy is utterly delightful.I know Im probably preaching to the choir, since I may be the last person in the world to learn that the three Spyro games here  Spyro the Dragon, Spyro 2: Riptos Rage! and Spyro: Year of the Dragon  are really, really good. But Ill still go ahead and say it again, since it bears repeating for any newcomers to the series. If you only know Spyro from his recent incarnation as the mascot for a toy-collecting game, all three titles here will be eye-openers for you.I mean, they were for me. There arent many 3D platformers out there today that play like this, with smooth controls, an easy-to-operate camera, and worlds that are fun to explore. All of those things sound like they should be simple to pull off, and yet all kinds of modern takes on the genre fail (or at least fall a little short) on delivering the kind of fun that the Spyro Reignited Trilogy delivers with ease.Now, its entirely possible that the Reignited part of the games name is doing a lot of heavy lifting. As I said, I didnt play these games the first time around, so for all I know, the versions on here are entirely reimagined and rebuilt from the ground up, and bear no similarity to the original games.But even if they did, so what? Spyro Reignited Trilogy is still a blast. If youve been pining for the chance to replay these games for decades, I suspect itll live up to your most cherished memories  and if, like me, youre new to the series, youll easily understand why these games were so beloved in the first place.", "date": "September 11, 2019", "grade": "A"}