{"name": "Monster Hunter World: Iceborne", "ref": "https://gaming-age.com/2019/09/monster-hunter-world-iceborne-review-for-ps4-xbox-one/", "text": "Monster Hunter World: Iceborne is the recently released end-game expansion for Monster Hunter World, bringing with it a number of new monsters to hunt, variants on the existing monsters, new weapons, armor, items and more. Its a significant expansion overall, taking an already lengthy experience and building upon it even more. Its also easily some of the most fun Ive had this year and something that Ill continue to play as we head into the Fall and Winter season.For Monster Hunter fans, the Iceborne expansion is similar to the G-Rank level that previous Monster Hunter games have had, essentially higher difficulty hunts with better rewards, including armor and weapon upgrades. But along with a higher difficulty, you also get a brand new area with Hoarfrost Reach, a new hub location called Seliana, an improved Gathering Hall, and a host of new story and optional missions to tackle. In particular, the new Gathering Hall and hub location are marked improvements over the previous areas, giving players the ability to access the armory, resource center, your house palico, the melder and more within a short distance, eliminating the need to move between different hubs or across different levels within the same hub. It streamlines the process between hunts, which is certainly appreciated.Another big addition comes from a new equipment item called the Clutch Claw. Available from the beginning of Iceborne, the Clutch Claw is a slinger attachment that fires a grappling claw towards monsters, allowing you to quickly mount them. This isnt a standard mount, instead, your hunter attaches to wherever the claw landed, allowing you to attack that spot with one swipe or shot, and expose a temporary weak point. From there, any hit you land on that specific area will cause bonus damage, opening up options that go beyond just striking the head, tail, or other typical built-in weak spots. In addition, you can claw onto exhausted monsters, turn them around, and run them into a wall to knock them down, creating new openings. The claw is also balanced against overuse, as enraged monsters will automatically shake you off and cause damage, and they typically become enraged after youve successfully triggered them to charge into something.The new hunting area of Hoarfrost Reach is, as you may have guessed, mostly a snow/ice focused area. As far as map size, it feels similar to the other four areas already featured in Monster Hunter World, and its easy enough to memorize where youre going after a few trips into the map. The beginning section of Hoarfrost Reach is mostly snow-covered, which has a slow-motion effect on your hunter, and looks pretty neat overall as you trudge through the tundra. As you progress further up the map, youll come across a more frozen wasteland, covered in ice. There are a few new items, like hot peppers to gather, which will, in turn, allow you to create hot drinks necessary to stave off the stamina depleting cold effect present throughout the map.Hoarfrost Reach is also home to new monsters for Monster Hunter World, such as Barioth, the mammoth-like Banbaro, and the snow swimming Beotodus. Of course, there are other new monsters that will show up throughout the game in all five areas, including variants on existing monsters like Viper Tobi-Kadachi, Nightshade Paolumu, Fulgur Anjanath and many more. Most of the variants give new monsters elemental or status effect attacks they didnt previously have, and change up their design and behavior somewhat. They are certainly all tougher, featuring more health, stronger attacks, and overall feel quicker than before. Difficulty starting out in Iceborne feels mostly like the Tempered Monster fights youd take on in the post-game content of Monster Hunter World, but thankfully youll be able to quickly upgrade armor and weapons to give you some advantage. As you progress through Master Rank, the difficulty level raises, ideally as your overall skill improves.Without spoiling anything about the end-game, the post-story portion of Monster Hunter World: Iceborne is also pretty significant and fun. Its also more engaging than hunting down decorations in the base game, which is what made up most of the end-game content previously. If youre already down for the loop of hunting and capturing monsters for loot, endgame just gives you a more streamlined method of doing that almost endlessly, while also giving you new upgrade materials for high-quality gear.I absolutely love this expansion and considering that Monster Hunter World is one of my favorite games of this generation, its been great to have this excuse to revisit it. I look forward to playing more and more, and Im excited to see what type of content updates Capcom rolls out in the future.", "date": "September 10, 2019", "grade": "A+"}