{"name": "Middle-Earth: Shadow of War", "ref": "https://gaming-age.com/2017/10/middle-earth-shadow-war-review-xbox-one-ps4-pc/", "text": "The more I play of Middle-earth: Shadow of War, the more Im left wondering: am I missing something? Did I play the same game as everyone else?Because reading through a lot of the pre- and post-release coverage Shadow of War, theres been quite a bit of focus on loot boxes. I mean, just look at the games user score on Metacritic: an overwhelming number of people apparently had their experience with the game ruined by loot boxes.But heres the thing: Ive played Shadow of War for a crapload of hours. I think Ive gotten a pretty good sense of the game. And if it werent for the aforementioned press coverage, I honestly dont think Id have noticed those loot boxes.Dont get me wrong: theyre available. But Ive seen what absurd monetization and microtransactions look like, and quite frankly, this just isnt it. When youve endured a game that makes you pay for a new haircut and tattoos, being asked if you want to spend a few dollars to level up doesnt seem quite so egregious.It helps, I suspect, that the alternative here isnt all that painful. You can also increase your stats by grinding your way through a seemingly endless amount of orcswhich, under normal circumstances, is something I might find annoying, but which is an absolute blast here.This can be attributed to two things. First, the combat is amazing: just as Shadow of Mordor borrowed liberally from the best parts of Batman and added swords, Shadow of War refines what it did well in the previous game and builds on it. Slicing through gangs of roving orcs is a breeze, and the counter system works as perfectly and as smoothly as Ive ever seen.Secondly, the nemesis system  another highlight from Shadow of Mordor  returns, and its even more addictive now than it was the first time around. Shadow of War never lacks for low-level bosses for you to brutalize, and theres nothing quite so satisfying as tracking down some grunt who got lucky and finished you off, and then exacting your bloody revenge.On top of that, Shadow of War seems a little more interesting visually. Its been awhile since I played it, admittedly, but my most vivid memories of playing that game involve the colours brown, grey, and green. Things still look bleak here, but they at least work from a wider palette.Oddly enough, while I love nearly everything else about the games graphics, theyre also the source of my biggest problem: Talions face looks a little too much like the botched Ecce Homo restoration from a few years ago. Luckily you dont have to see Talions face too often, but when you do, its a jarring reminder that its always possible for an otherwise amazing game to have a few flaws.And speaking of flaws, if youre a hardcore Tolkien fan, I should point you to this article if youre wondering how faithfully Shadow of War is to its source material. It didnt really bother me too much, since my connection with the material only goes as far as having read the books and watched the movies, but I imagine that if you really, really want to experience Tolkien, this probably isnt going to do it for you.", "date": "October 20, 2017", "grade": "A"}