{"name": "Jupiter & Mars Definitive Edition", "ref": "https://gaming-age.com/2022/09/jupiter-mars-definitive-edition-review-for-meta-quest-2/", "text": "When I first heard about Jupiter & Mars, it had just been released for the PlayStation VR (our original review here). I had some interest in checking it out due to it reminding me of a VR Ecco The Dolphin, and although it was not an actual sequel to Ecco, it sure did look like a spiritual successor. Now I finally had a chance to check it out on the Meta Quest 2 in the form of Jupiter & Mars Definitive Edition, and I have to admit, I regret not checking it out sooner.The game is set in the distant future on Earth, where Humans are long gone. Global Warming has submerged whole cities underwater and all kinds of buildings, technology and rubble are left submerged, leaving aquatic life struggling to survive. The Elder Whales task Jupiter & Mars with destroying a network of machines that are causing trouble for the inhabitants of this new human-less Earth. Yes, at its core Its a environmental message disguised as a game, but its not that heavy handed. The subtle eco-friendly message starts out tame, but youll be gently reminded of the message the further you play through the story. Your main goal is to find the machines you need to deactivate. Along the way you will use echolocation to find hidden objects in rocks and clams and also find hidden paths. You also have a Pulse beam that can help you with stinging jellyfish blocking your way, and rescuing trapped sea creatures.Interaction with the undersea world is surprisingly limited, with most unique and interesting objects you discover are just there, and offer nothing but their presence. You can look at them, swim up to them and thats about it. This is somewhat disappointing as I feel so much more could of been added. Later on in your quest, you will have to deal with some light stealth missions that can be a bit of a pain. You fail if you are not hiding behind something that makes you invisible to the electric orbs floating around. There were a few too many of these sections for my tastes, in fact it seems there was very little enemy encounters outside of those orbs and some random jellyfish.You can unlock new abilities as you progress. Once I got the power-up to destroy tougher barriers, I was able to do some light backtracking to discover more hidden objects and paths from previous levels. This adds a sort of Metroidvania aspect to expand the overall playtime, but it seems a little slow and tacked on. I had to do quite a bit of swimming through a lot of nothing and would find it a bit tiring to move on and would have to take a break.Even if I was getting a bit tired, I had some gorgeous visuals surrounding me that really helped to lose myself in the massive underwater world. There is so much to view and check out, that sometimes youll just find yourself checking out your surroundings and casually swimming around just taking everything in. The lighting and water effects are beautiful while the animations of everything around you are close to perfect. Some things here and there may look a little odd, and I did experience some occasional clipping and glitches, but nothing that completely took me out of the experience. The ambient undersea sounds and the relaxing music only add to the whole package, and brings a calming feeling even when you are having any kind of trouble with certain tasks.Jupiter & Mars Definitive Edition is a rather enjoyable experience with some mild quirks that can be overlooked in the long run. I would of liked to have a little more interaction with more of the environment outside of just opening doors and hiding from electric orbs, but overall, it was a fun and interesting adventure. While not perfect by any means, I can still recommend this for anyone looking for a VR game that can offer a little challenge and splendid visuals. If you have a PSVR or a Meta Quest 2, its worth a look.", "date": "September 20, 2022", "grade": "B+"}