{"name": "Dishonored: Death of the Outsider", "ref": "https://gaming-age.com/2017/10/dishonored-death-outsider-review-pc-ps4-xbox-one/", "text": "Any excuse to get back into the Dishonored series is a good one, and Death of the Outsider is no exception. I was thrilled to return to the dark, desolate streets of Karnaca once more, with all new characters and abilities to experiment with. Death of the Outsider places you in control of Billie Lurk, a young woman helping her dying mentor complete one final task, killing the Outsider. This premise is not overly complex or nearly as intriguing as the two full games, but interesting enough to keep you motivated to finish the 6-8 hours of gameplay before you. Narrative is sparse but good, with the story laid out for you at the beginning and not much time for filler in between.Along with the new character in Billie you get some powerful new abilities to help you complete your task. Each of these follow along the same vein as something Corvo used but with a twist. Displace is the replacement for Blink, Foresight for Dark Vision and finally Semblance, which allows you to take the identity of someone else and hid in plain sight after taking them out. These abilities are all interesting and hold a value of their own, but none of them are earned or fought for. You get them all at once and together, which leaves very little to work for during the rest of the campaign. This, coupled with a lack of upgrades or a progression system beyond the completion of the story leave players with very little to work for.The biggest change that veteran players will notice is the lack of a Chaos system. Lethal and non-lethal are both viable playstyles, and you are not penalized for choosing one over the other. This makes decisions feel as though they matter much less than in the full games, but allows a bit more freedom within the confines of this much shorter experience. This also allows for the completion of all of the contracts within the expansion, without having to worry about messing up a non-lethal playthrough for yourself unless you impose such rules upon yourself. The lack of the Chaos system really encourages players to find their own way through and gives them the freedom to make mistakes without feeling like they HAVE to reload a save.Level design is where Death of the Outsider really sets itself apart from the previous games. Everything here is meticulously crafted, nothing is out of place or thrown in just to fill space or time. The city feels alive, with the NPCs all living and working in a real space as opposed to being simple plants. Each area you encounter is unique and enjoyable, with some interesting facet to explore or a new contract to complete. Additionally, you can choose to play the game over again in Original Game mode that allows you to use all of the abilities from Dishonored 2, as well as a custom difficulty mode that lets you change several aspects of the game making it harder for yourself.", "date": "October 6, 2017", "grade": "B-"}