{"name": "Axiom Verge", "ref": "https://gaming-age.com/2017/10/axiom-verge-multiverse-edition-review-nintendo-switch/", "text": "Im a huge fan of Metroid. Im also a huge fan of Castlevania. Knowing this, you can probably imagine how excited I was when the Metroidvania type games started coming up in the world. And if you can then just check out that Youtube video of the kid who gets a Nintendo 64 on Christmas and just goes nuts! it was kind of like that, but a guy about 30 years older and still in PJs.This is the genre that Axiom Verge falls under, and it leans more toward the Metroid part of things. Its also not a new release, as Axiom Verge is the more expanded version of an indie game from about a year ago. It was a huge hit with gamers, and notably made by Tom Happ. Thats right, just one guy with a love for classic gameplay.So here it is on the Nintendo Switch, and its every bit as good as it was when it released last year. Those looking for a good throwback game with good map exploration and fun weapons and abilities will be pleasantly surprised by how much Axiom Verge gets right. I mean just look at it! In a glance its a Metroid love letter.You start off as Trace, a scientist who by finds himself in a creepy cave area with no idea of how he got there, but with a voice in his head giving him some guidance to get started. Once you finally get to meet the person talking to you, things kick off and you begin unraveling mysteries about just what the heck is going on.Of course whats really going on is a lot of shooting and platforming. The game gives you a bunch of toys to play with which like any good Metroidvania will grant the ability to further explore areas you previously couldnt get to. Theres also an ongoing electronic soundtrack that kind of makes me feel like Im in a dance club. Im not sure how I like this music, but the quality of the audio is great.And as much as I love 16-bit games, something about the art here feels ugly at times. The sprite work is really cool with certain bosses and areas, and then at other times I feel like Im playing an NES game because the textures are dull in comparison. This is just my personal taste and you may feel differently.This game has also been out on systems including the Vita, PS4, and Wii U, but as you know with the Switch its the best of both worlds in terms of portability and ways to play. Axiom Verge is a great game to take out with you and play a little bit, or really dive into on your couch at home. I like this kind of game for the Switch and its a great fit for a versatile platform.", "date": "October 5, 2017", "grade": "B+"}