{"name": "Battle Chasers: Nightwar", "ref": "https://gaming-age.com/2017/10/battle-chasers-nightwar-review-ps4-xbox-one-pc/", "text": "I was definitely a 90s X-Men kid growing up, so naturally that eventually transitioned into becoming a Joe Madureira fan when he took over penciler duties on the title. And of course I followed the guy when he made the jump to Wildstorm/Image for his creator-owned Battle Chasers series. Then, like others, I was pretty bummed out when the series never saw completion. From there I sort of lost touch with Madureiras work, and didnt really take notice again until Darksiders rolled out back in 2010.Still, remembering Battle Chasers was unresolved, I remained a little dejected that the comic series would likely never be picked up again. So when Battle Chasers: Nightwar was announced, I was pretty damn excited to see how things would pan out.Battle Chasers: Nightwar is essentially an old-school RPG with turn-based battles, loot, equippable perks, crafting, fishing, and some exploration. The dungeons and overworld maps are displayed from an isometric, top-down style view. The overworld consists of a series of map points that you can move between, with occasional monsters to encounter and battle. There are also towns, side quests, vendors, and a few optional dungeons to uncover. Basically theres a fair amount to see and do in Battle Chasers: Nightwar, so much so that youll have little trouble keeping busy with the game.The battle system is pretty basic on the surface, but the unique abilities of your party members, and the moderately tough enemies, make for some interesting encounters. Most characters boil down into standard RPG class archetypes with a few twists. But each character will have a list of attacks and abilities to unleash, which grows larger and larger the further into the game you get.Another key component of the battle system is the Overcharge function. Essentially, standard attacks can generate overcharge, which provides a single battle boost to your mana pool. Provided you build up enough overcharge, you can start to fire off the stronger abilities that cost mana free of charge. Theres a give and take to this system that adds a nice layer of strategy to even basic encounters, which helps keep things interesting.Dungeon exploration is also a key component in Battle Chasers: Nightwar. When entering a dungeon for the first time youll have the option of choosing a difficulty, which in turn will dictate the overall quality of loot you might obtain. Dungeons consist of a series of rooms that are tied together in a grid-like fashion. Each room will typically contain a few enemies, along with treasure, the occasional puzzle, and maybe a fishing spot or crafting table. Later dungeons will also incorporate traps and other obstacles, which can damage your heroes out of combat. To help, every character has a set of dungeon abilities, like Calibrettos ability to heal your party, or Garrisons ability to quickly dodge a trap or other hazard.I also really dug the look of the dungeons, and the environment in general. The overworld might be a little plain and flat with its map-style layout, but the actual dungeons have a ton of detail packed in. Theres a fair number of optional lore pick-ups to flesh out the world of Battle Chasers, and the battle animations are fantastic. Even the animated cutscenes are pretty solid, and I really took joy in seeing Joe Madureiras creations come to life here.So what doesnt work? Battle Chasers: Nightwar had some definite technical hiccups on the PS4. Over the span of a 4 or 5 hour play session one day, the game crashed at least 3 times. Over the course of the game Ive had multiple crashes, which are certainly annoying. Thankfully, the game is pretty liberal with its autosave system, so I rarely lost progress outside of a battle or two.The framerate also takes a dive at certain spots, theres a rainy area that you encounter after the first few dungeons that really made the game chug, but those sequences are few and far between. Loading is also an occasional issue, sometimes Id have a battle load in for about a minute or so before actually starting, but that wasnt too frequent. While I dont think any of these technical issues are game-breaking, they can still really hinder an otherwise enjoyable experience.Other issues felt like random bugs. For instance, theres a side quest at the Tavern around level 10 or so thatll task you with clearing out slimes that have infested the basement. Theres a sequence, which I assume is for the boss, where you enter a room and game breaks to a little scene with bits of slime dropping down all around you. However, what happens next I have no idea, because I never gain control of my character again and have to quit the game. Every. Single. Time.On a less aggravating note, I think the inventory system is pretty messy, especially considering the amount of things youll pick up while playing. Battle Chasers: Nightwar has a fairly robust crafting system, which in turn means youll pick up a lot of resources to use for crafting. While your inventory window does allow for pages upon pages of resources, gear, potions and so on, it still feels a little too cumbersome and clunky to navigate with a controller. Its also easy to lose track of resources that can be used, like skill point books and crafting recipes. And unlocking your crafting options can take time (and money), so youll be stuck with a whole host of resources early on that you cant really do much with.To go along with that, the initial progression in Battle Chasers is a little too slow for me. It takes a number of battles to level up characters, despite those battles being pretty frequent. Thankfully I enjoyed the combat, but as impressive as the battle animations are, I did get to a point where I wished I could skip them to speed things up a bit. Theres a little too much wind-up in most of the animations, enough so that youll definitely get a little burned out after a few hundred fights.", "date": "October 3, 2017", "grade": "B"}