{"name": "Pokkn Tournament DX", "ref": "https://gaming-age.com/2017/09/pokken-tournament-dx-review-for-nintendo-switch/", "text": "I remember way back in the day when Pokmon Stadium came out on the Nintendo 64 and it was the closest thing to a real Pokemon battle that my teenage mind could grasp. I mean fighting with the pocket monsters was cool and all, but just think of what it could look like with the power of the Nintendo 64! Unbelievable!Oh how naive I was. It wasnt until Smash Bros. with Pikachu and Jigglypuff that I really got a taste for how much potential there was with these characters in a fighting game. Fast forward to the Wii U and a collaboration between Nintendo and Bandai Namco brought us Pokkn Tournament. Finally, the dream of getting down and dirty in a Pokmon stadium had come to life, and we werent disappointed.The only disappointment was that this was on the Wii U. Not that you could tell from how much we liked Pokkn in our original review. I love Nintendo as much as the next guy, but lets be real. A good game on the Wii U was a waste of a good game. Few people owned the system and nobody I knew ever wanted to play it despite some quality stuff on there.Well once again with Pokkn Tournament DX we can thank our lucky stars that some of the better Wii U exclusives are seeing ports to the Switch. Theres just no comparison to having the right tool for the job.So youre probably wondering if this is just a port or if the developers went the extra mile to add some things? Well the answer is yes! Yes for adding a little extra content at least. Pokken Tournament is still the same game on a technical performance scale. It does have a small bump in resolution to render at 720p natively and is at a solid 60 fps unless you play in the new split-screen VS. mode which just about halves the frame rate. No thanks! Ill stick to single screen just like Im used to.One new addition are daily challenges. These are fairly straightforward, such as winning two matches with a specific type of Pokemon. It adds a little variety and is fun to check in each day just to see what the challenge has to offer and play a half hour or so.There is also something called team battles where youll choose three Pokemon who will build your party to fight against an opponent. This works out so that you have to defeat your rivals party instead of a best-of-three match like most fighting games use. Its a nice change of pace.Everything else is still in tact, as I mentioned. Theres the single player campaign which has some story and follows your path as you rank up in the tournaments while learning about Shadow Mewtwo. Its worth mentioning also that all characters are unlocked from the beginning here. No need to complete the story to get your hands on Mewtwo this time! Were also treated to some roster additions from the arcade which is a good addition. Still, I think Ill stick with Gengar. Yeah hes a jerk, but sometimes you want a jerk to handle a fight.", "date": "September 23, 2017", "grade": "B+"}