{"name": "Collar X Malice", "ref": "https://gaming-age.com/2017/09/collar-x-malice-review-ps-vita/", "text": "Ill say this for Collar x Malice: it knows how to grab a players attention. The game immediately lays all its cards on the table: a neighbourhood in Tokyo is being terrorized by a group of criminals whove been kidnapping citizens and broadcasting some of their murders live on TV. To combat the threat, the government quarantines the neighbourhood and issues every citizen living inside the zone a gun. Youre playing as a young cop, new to the job and trying to figure out what to do. One night your character gets abducted during an investigation, wakes up with a collar around her neck, and learns that shes suddenly at the mercy of the aforementioned terrorist organization, who can kill her at any time via the collar.Naturally, the game is a romance novel, and your goal is to successfully woo one of the male characters.Okay, thats misrepresenting things a little. Technically, youre also trying to solve the mystery, which means that you have to carefully read the clues that present themselves, and hope that, somewhere along the way, a wrong turn doesnt lead to your death.But really, youre trying to romance someone, and the murder investigation is the vehicle through which your courtship takes place.Ill freely admit here that your read of Collar x Malice will depend largely on your attitude going into it. Personally, I got turned off the game almost instantly by the fact that it takes the whole damsel in distress trope brings it to a whole new level: no matter how capable the protagonist (who you can name if you so choose) may occasionally be, the fact is that a) the plot where the game picks up is kickstarted by your character being thrown into mortal peril, and b) any tension that exists does so largely because the threat of death is hanging over your head at every turn. Im not saying that a game cant ever endanger its protagonists (indeed, Ive played some fine examples, even within the otome genre, where thats the case), but Collar x Malice does it in such a hamfisted manner right out of the gate, its hard to take anything else seriously after that.Its also a little annoying that the game is also populated with the usual visual novel stereotypes  by which I mean everyone is kind of a jerk, and they cant interact without insulting each other. I know that thats just accepted at this point, but given that these types of games are all about matching your character up with one of her suitors, it never fails to boggle my mind that all the options are so unpleasant. Again, your mileage here may vary.Of course, no matter how much the actual characters and gameplay may bother me, I cant deny that Collar x Malice is just oozing style. Given how same-y so many of its ilk tend to be, its kind of neat to see a game that embraces a different aesthetic. I dont think Id call it cool, necessarilybut at the same time, I wouldnt quibble with anyone who wanted to, either.", "date": "September 20, 2017", "grade": "C"}