{"name": "Active Soccer 2 DX", "ref": "https://gaming-age.com/2017/09/active-soccer-2-dx-review-ps-vita-ps4-xbox-one/", "text": "If youre a soccer fan and a Vita owner, your choices have been rather limited if you want to play your favourite game on the go. EA pushed out a few FIFA reskins before giving up the ghost in 2015, and since then theres just been pretty much nothing: one or two vaguely soccer-themed PlayStation Mobile games somewhere along the line, plus another, more full-fledged title that was so bad, we should probably collectively agree to pretend it never existed.In other words, the situation has been pretty dire.This is what makes Active Soccer 2 DX so special. Its by no means a great game  Ill get to its issues momentarily  but, at least, its something. It comes close enough to a proper soccer game for the Vita that, at this point, Im happy to take it.I should emphasize, to be sure, that its a pretty barebones experience. The modes are limited: you can play as a franchise, you can play an exhibition game, or you can practice. Unsurprisingly, theres no FIFA license here, which means no real teams or real players  just teams with the same colour schemes as real ones, and players with vaguely similar names to real ones (Liomel Mezzi and Neimal, anyone?).Performance-wise, things are no better. The graphics are reminiscent of what you wouldve seen 20 years ago: a top-down view of the pitch, with players just a few tiny pixels on the screen. Load times border on atrocious: going from one screen to the next requires waiting a few beats here and there. The music is pretty repetitive outside of matches, while the in-game sounds are almost non-existent. Active Soccer 2 DX isnt about to break into the FIFA/PES duopoly, is what Im trying to say.And yet: I enjoyed it. Or, at least, I enjoyed it enough for what it was. Im not under any illusions that its about to displace either of its more well-funded, well-developed brethren, but I do think that, if given a chance, players will be pleasantly surprised. In contrast to, say, the game that should not be named, the controls are intuitive, the design is simple enough to work well on the Vita, and the franchise mode is full-fledged enough that youll never be lacking for things to do.", "date": "September 15, 2017", "grade": "B+"}