{"name": "Catan", "ref": "https://gaming-age.com/2019/09/catan-review-for-nintendo-switch/", "text": "For most people, the big drawback with Catan will be obvious: theres no local multiplayer. Given were talking about the classic board game, you can probably see why that would leave some unhappy.Not me, though. You see, Im horrifically bad at Settlers of Catan. This isnt false modesty  I really am legitimately terrible beyond belief at it. I once played it with friends, and their response to my abysmal performance was (and I may be paraphrasing here): We didnt know it was possible to score so few points in this game.In other words, Im in no hurry to play the game with anyone else. I dont want to inflict that on other people. And, in a way, Catan on the Switch seems geared towards players like me. Players who dont necessarily care whether they can play the game with others, but who are eager to try out all kinds of different scenarios at different difficulty levels, and who want to be able to play the game solo wherever they may go.From that perspective, Catan has a lot to offer. There are about two dozen different scenarios here in the single-player campaign, which should keep most people occupied for a decent amount of time. And once youve gotten through all those, you can also build their own scenarios, which seems like a pretty decent amount of value, as these things go.(I also appreciated the campaign from a personal perspective, since not only did it allow me to keep my suckiness confined to my immediate vicinity, it also allowed me to figure out the game a little more. Im still bad, but I think Im a ever-so-slightly less bad now.)Obviously, though, that doesnt mean much if you want to play Catan with friends. Given the game is otherwise pretty solid, that seems like a major oversight, and Id understand why itd be a deal-breaker for some people. For others, though, so want to experience Catan solo, it makes for an experience thats pretty hard to beat.", "date": "September 6, 2019", "grade": "B"}