{"name": "Knack II", "ref": "https://gaming-age.com/2017/09/knack-ii-review-ps4/", "text": "I unironically found Knack to be a pretty good PS4 launch title. Sure, as action platformers go, it wasnt a flashy game by any means but it was built upon a solid gameplay foundation and the colorful family-friendly theme made it a nice alternative to other launch window titles at the time. Besides the lengthy story campaign and relatively replayable chapters, what really defined Knack for me was couch co-op mode that allowed for a second player to jump in at any time and assist in playing through the game. It was a simple addition that essentially made the game worth playing for my kids and I, and in Knack II, its still an important part of the experience.The original Knack has a kind of legendary following in certain circles. Some gamers dismissed it as a by-the-numbers action platformer, while others appreciated the gameplay depth and challenge offered by the higher level difficulty settings. I was in the latter camp, mostly. Knack II really doesnt stray too far from the action, or the platforming, or the safe storyline, setting and theme of the first game. It does build and improve on every aspect of the original, and throws in an enhanced, very enjoyable 2 player co-op experience too.Its great to see Mark Cerny and Sonys Japan Studio identify and build on what players liked about the first game for this sequel. Knack (the character and the game) is bigger and better, and the developers seemed to be rather self-aware when they decided to produce a second game in the series. Knack II almost strives for a sort of Uncharted vibe, with Knack, Lucas, Ryder and friends circling the globe to help put a stop to the sudden goblin uprising around the world. Theres some treasure to track down too.The mostly arena-style combat sequences are nicely paced and actually require a bit of strategy, especially at higher levels. In the sequel, Knack slowly unlocks a significant number of new moves and techniques, primarily via collecting relics during the game (by destroying objects, finding chests) and unlocking them on a simple upgrade tree. The new techniques become immediately useful, especially in the case of co-op play where additional tag-team moves can be unleashed as well. I appreciated how Knack II handled the possibly asymmetrical skill levels of its players by allowing a defeated player to respawn back in after a short time  as long as the other player can survive for a few additional moments. Checkpoints are also more than fair, and needing to replay long or difficult sequences isnt common.The platforming, exploration and puzzle solving in Knack II are straightforward and are suitable for pretty much all skill levels. There are some simple QTE action sequences in there too, which conveniently takes into account if there are 2 players. Although its really at its best with a partner, Knack II is perfectly playable as a single player experience and it is there where its easier to appreciate the depth of gameplay. As I did in the original, I played through most of the game with my son, and we had a blast devising gameplay strategies, searching for treasure/upgrades, and pulling off some impressively well coordinated boss takedowns. Being veterans of the series, the Hard difficulty setting was just about perfect.Knack II is a very nice looking game and is even enhanced in a few ways for those with the PS4 Pro and/or a 4K HDR display. It checks all the right boxes for family-friendly game in terms of visuals too: Colorful environments, destructible objects, cartoony characters, big robot suits, nonviolent action and so forth. Most of the more taxing visual effects are probably reserved for Knack himself though. Since hes made up of lots of geometric objects (relics in this case), and can grow and shrink at will depending on the situation at hand, there are times when there are dozens of these relics scattered everywhere. Double that if youre playing with a partner, so the engine has to be able to cope with rendering the environment, enemies and Knack(s) in all his various forms and sizes. Long story short, Knack II isnt the greatest looking game out there, but it does what it needs to and holds its own.", "date": "September 7, 2017", "grade": "B"}