{"name": "The Metronomicon: Slay the Dance Floor", "ref": "https://gaming-age.com/2017/08/metronomicon-slay-dance-floor-review-ps4-xbox-one-pc/", "text": "Sometimes the marrying of two distinct game genres just works, and I think The Metronomicon: Slay the Dance Floor is a pretty great example of that. Billed as a Rhythm-RPG, Metronomicon takes the combat mechanics of popular RPG titles like Final Fantasy, and combines that with a control method akin to Dance Dance Revolution or PaRappa the Rapper. Featuring a whole host of indie and chiptune musical tracks, its a surprisingly robust indie release on Xbox One, PS4, and PC that I definitely think is worth checking out.The basic concept is this. Youll put together a 4 person party and take on a series of battles set to individual songs across multiple worlds. Each battle pits your party against a number of monsters, usually featuring a mini-boss, and youll deliver spells and attacks as you hit successive notes in time with the beat. Each character has a vertically scrolling list of directional inputs above them, and these lists are broken up into tiers. Completing the first tier of musical notes for one character might unleash a basic, minor physical attack, but completing tier 2 could deliver a strong, AOE fire spell.You can also customize your party to some degree. As you advance through the story, youll gain new characters with unique abilities. As you level up, those characters can gain even more abilities. You can then change the order of those abilities in order to increase or decrease their effectiveness, which is where the aforementioned tiers come into play. Also, as you finish battles youll gain gear to equip, which will also improve base stats, increase elemental resistances, or just have unique modifiers attached.Theres really a lot of neat, RPG mechanics stacked on top of the rhythm input gameplay in The Metronomicon: Slay the Dance Floor. And thankfully that rhythm based gameplay works pretty well. I played this exclusively with a controller on PS4, but it does feature Rock Band 4 guitar support as well. However, a controller worked just fine. With four directional inputs being used you can opt to either use the D-Pad, face buttons, or a combination of the two, in order to execute the scrolling inputs. You can also customize the controls quite a bit in order to find a layout that works well for you.I also really dug the musical selection in The Metronomicon, even if there were a lot of artists I wasnt that familiar with. Theres a pretty large list of songs to check out, featuring artists like Perturbator, Shiny Toy Guns, Jimmy Urine and more. And one neat addition to the settings is the ability to turn on a feature thatll actually let streamers and YouTubers know which songs the developer obtained streaming permission for in order to avoid copyright strikes or playback issues, which is something I dont think Ive seen in a game before but seems like a solid enough idea for those that enjoy broadcasting.As far as things I didnt dig about The Metronomicon: Slay the Dance Floor, theres not a lot. I wasnt entirely sold on the actual character designs, I enjoyed the monster artwork quite a bit, but the design of the player-controlled party didnt stand out as much. I do like the overall look of the game, it nails the neon-infused party atmosphere its going for, and melds well with the music selection. I also thought the story side was a little bland. The humor fell flat for me, and the voice work wasnt particularly noteworthy. I appreciate the attempt at voicing the dialogue, but I think it hurt more than it helped.The only other issue I had was that I felt like the UI could be improved just a bit. Some of the messages were a little small and difficult to read, which is likely less of an issue on the PC with a monitor. But a bigger issue with the UI, at least for me, was being able to tell what status effects were currently benefiting or plaguing my team, and what element the enemy I was fighting was strong against. It certainly isnt impossible to see these things, but the icons could be bigger, and maybe positioned a little closer to the scrolling inputs so the player doesnt need to take their eyes off the action as often.", "date": "August 31, 2017", "grade": "B+"}