{"name": "Everybodys Golf", "ref": "https://gaming-age.com/2017/08/everybodys-golf-review-ps4/", "text": "It took Sony long enough, but they finally renamed their popular Hot Shots Golf franchise in North America to what its known as in the rest of the world: Everybodys Golf. The updated moniker tells players all they need to know about the game, so Everybodys Golf is a much more fitting title. It really is, and has always been, a pick-up-and-play golf game for everybody and anybody.Ive been a lifelong fan of the Hot Shots Golf series so reviewing Everybodys Golf was a pretty easy task for me. I mean, Ive put in countless hours perfecting my videogame golf swing since the very first iteration on the PlayStation over 20 years ago, and that familiar three-button-click gameplay has never really become stale.With colorful courses and characters, simple yet surprisingly deep gameplay and oodles of replayability, Everybodys Golf for the PS4, like its predecessors, is the very definition of a pick-up-and-play game. I personally have a soft spot for the PSP and PS Vita versions, just due to the portability factor, but I have never even mildly disliked a single installment. Clap Hanz has tried out a few different swing options and gear that affected character stats in the past, but otherwise each subsequent game has never really undergone much in the way of an evolution. With its shift to more online activities and the addition of light MMO and RPG elements, Everybodys Golf may be the most dramatic change in the series so far. Dramatic in this instance should be used sparingly at best.Everybodys Golf is stocked with content, and whether or not you play the game online or offline, your player progress and profile is always linked to both. Every round of golf you partake in earns your character experience  as in every club in your bag will increase in stats the more you use it and the better you play. The stat increase is across all club types and characters you use too, so theres no grinding of different equipment sets or alt character slots which was a thoughtful decision by the developer. The more you play the game, the better you get, which is reflected in both your personal gameplay skills (hopefully) and the skills of your on-screen avatar. This is important to note as you attempt to be competitive online, since all those stats and abilities youve earned carry over. Throughout your golfing career there are also coins to be earned or found, which are utilized as currency at the shop to pick up new character customizations, Turf War warp tokens or items such limited use golf ball upgrades. Theres also DLC content in which players can pay real money for, but I wont get into those.Speaking of characters, Clap Hanz more or less dumped the motley crew of quirky characters and stereotypes for a character creation/customization tool. Many fans will be sad to see some of their favorites not make an appearance in the game in their original form, but seriously, the character customization options are surprisingly robust, and more importantly, quite easy to use. My kids and I spent hours (not an exaggeration) filling the 8 character slots with various family members, representations of SpongeBob characters, an anthropomorphized version of our cat and more. And this was before unlocking tons of new content and character options. Seeing the wide variety of player-created characters online has been an amusing experience so far.In terms of gameplay, Clap Hanz and Sony decided to keep it as simple as possible by only offering the original 3-click swing (at least at this time) to players. I sometimes preferred the advanced swing option in some of the more recent installments and it sounds like it was ditched to keep the gameplay on a more level playing field in an online environment. Regardless, its still an intuitive system, and at the same time, one with a significant amount of depth. There is one change worth pointing out  putting also now requires a 3rd click, which can add to the stress of reading a green. Flubbing a putt seems rare, though its not impossible if youre distracted.Single player tournaments are still the bread and butter of the game with player progression tied to an increasingly difficult set of tournaments and CPU matches as you work through the tiers. Theres no star/crown system in Everybodys Golf though and progress is mostly made by earning XP and defeating a trio of unique Vs. characters per rank, which then unlock new modes and abilities. Experienced players (ahem) can toggle on Serious Mode before each single player tourney to earn even more XP/coins per match. While there can be a wide variety in the rules for these rounds (different size holes, timers, weather conditions, etc.), theres not as much variation in tournament match types as in previous games. Thats where online modes come into play.Previous Hot Shots Golf/Everybodys Golf games had some super fun online modes on both the the PS3 and PS Vita. Lobbies you could hang around in, daily tournaments you could register for, and more. Everybodys Golf expands on that by offering a selection of open world courses that players (from around the globe) can drop in on to either socialize, or more importantly, play against others and/or scour the environment for bonus items and coins. Along with the 9-hole open course mode, theres also a fun new Turf War mode which has 2 teams of players running all around a course taking control of holes during a period of 10 minutes. Score a birdie or better and youll earn points for your team and then youll need to run (or warp) to another contested hole to assist in taking control there and increasing your team score. Once the time runs out, scores are calculated and the win is awarded to the red or blue team. Its a simple, yet frantic and fun twist on competitive golf thats for sure.Once you rank up a bit on the single player side and unlock the fishing mini game and golf cart (kart?) racing, then the fun really begins. At 8pm ET/5pm PT every day, known as Golf Island Time, the online world refreshes with a new selection of challenges and collectibles. We waited a bit until after launch to publish this review to see how the online experience would hold up and to give ourselves an opportunity to take on the rest of the world. Needless to say (even without the rollout of the upcoming International Tournaments feature) online has held up nicely and were enjoying getting our butts kicked by the rest of the hardcore players so far. Pro tip: dont get involved in any online gameplay right before the world resets or youll be kicked out of your instance and possibly lose progress.So visually Everybodys Golf is, as mentioned earlier, bright, cheery and colorful. Its not the most visually stunning PS4 game out there, though in 4K and/or HDR, it has its moments. The base game runs at 30fps, although if you have a PS4 Pro theres the option to unlock the framerate. The result, in 4K at least, smooths out the performance while on the course but causes some funky visual issues outside of the gameplay. Call me a monster, but I settled on the higher 4K resolution setting with a locked 30fps framerate over the 60fps setting, and Im sticking with it. I do appreciate the various options though, and hope that all developers make an attempt to do so for PS4 Pro players.", "date": "August 30, 2017", "grade": "A-"}