{"name": "Cladun Returns: This is Sengoku!", "ref": "https://gaming-age.com/2017/08/cladun-returns-sengoku-review-ps-vita-ps4/", "text": "Cladun Returns: This is Sengoku! is one of those games that I appreciate more than I actually enjoy. Like, Im glad that it exists. Its a fast-paced, twitchy dungeon-crawler, the sort of thing thats perfect for playing on the Vitaand yet, at the same time, it kind of bores me.I dont think these two sentiments are mutually exclusive, either. I genuinely believe that Cladun Returns has a great concept, and that it executes it exceedingly well. The game places a premium on getting in and out of dungeons as quickly as possible, to the point that the game gives you a timer and a reward for beating your previous best times. Everything about is fast-paced, from character movement, to attacks, to your options for moving around the hub world (more games should utilize fast travel as wel as this one does), and the dungeons are small enough that you can legitimately squeeze them in during even the shortest commutes. The game is somewhat reminiscent of The Binding of Isaac, only with the key difference that theres no roguelike shenanigans going on here  the dungeons stay the same, because again, the focus here is speed. (Its also worth nothing that Cladun Returns is far less scatological, which is something I  and my squeamish stomach  appreciate.)Cladun Returns also manages to incorporate the past without being indebted to it. Unlike a lot of other retro-tinged games that use their pixels as an excuse to punish anyone foolhardy enough to play, Cladun Returns simply looks and sounds like an 80s refugee. Thats not to say the game isnt challenging  because it definitely can be  but, again, the emphasis here is on speed, not sadism.So, why am I so reluctant to say that I enjoy it? In part, its actually because the levels are so short. Consider the math: you can beat a dungeon in a couple of minutes. The main game takes abou 25-30 hours to complete, and side quests can add on dozens more hours. In other words, even if you dont spend a lot of time in any one, specific dungeon, you still have to do lots and lots of grinding.The Cladun Returns other problem, in my eyes, is its controls. Given that youre expected to quickly grind your way through dungeon after dungeon, youd think the game would have an easy-to-use battle system. Instead, your heros stabs and slashes are incredible imprecise, and you sometimes need to get right up against a monster to ensure youre swinging your sword in the right direction. Ive definitely played worse, and it adds to the games retro-ness, but its clearly an area that could be improved.", "date": "August 30, 2017", "grade": "B-"}