{"name": "South of the Circle", "ref": "https://gaming-age.com/2022/09/south-of-the-circle-review-for-nintendo-switch-playstation-xbox-pc/", "text": "South of the Circle is the second game Ive played in the last few months where you could feel the intense desire for critical accolades practically emanating from the screen. Much like The Magnificent Trufflepigs a few months ago, everything about the game felt calculated to win praise. Its got a voice cast that features actors and actresses from TV shows and movies like Bohemian Rhapsody, Game of Thrones, and Downton Abbey. Its eShop description brags about the games (m)asterfully executed cinematic feel, how its beautiful aesthetic and nuanced writing underlines its sweeping cinematic scope, and says that its a game for  audiences that seek emotional and heart-wrenching moments with a game.Its got ambition, in other words, and it thinks it has something to say.To the games credit, its much better than The Magnificent Trufflepigs. South of the Circles voice cast all turn in excellent performances. Its minimalist art style  which owes a debt of gratitude to films like Waking Life  looks gorgeous. It does a good job of constantly pushing the story forward  where some walking simulators get a little too meandering for their own good, South of the Circle always feels like its moving you along towards the next plot point. The problem is, not all the plot points make a whole lot of sense. The game certainly wants you to think that they do  and, whats more, they want you to think that your choices make a difference in the outcome  but at the end of the game, you quickly realize that nearly all of it is extraneous fluff. There are all kinds of threads involving the Cold War and the South Pole and academia and Communist agitators and abusive parents and romance, but barely any of them make any difference on where the story winds up. The game wants you to think its all connected, and to South of the Circles credit the voice acting is nearly good enough to cover up gaping plot holes, but when you get to the grand reveal at the end, its hard not to respond with a shrug and feel like youve just wasted three hours.", "date": "September 15, 2022", "grade": "B-"}