{"name": "Unknown Fate", "ref": "https://gaming-age.com/2019/09/unknown-fate-review-for-nintendo-switch-ps4-xbox-one/", "text": "Lets start with the good about Unknown Fate: it looks fantastic. Its set in some dark, nightmarish world, and you can see the care that went into making every nook and cranny look scary and ominous.Unfortunately, games are designed to be played, not simply looked at, which is a bad thing for Unknown Fate, because the moment you start interacting with that dark, nightmarish world, everything falls apart.Things are so bad, in fact, that its hard to think of anything that Unknown Fate does well  or, for that matter, even halfway competently. Its a puzzle game where the puzzles require zero thought. Its a walking simulator where the simple act of moving is a pain. It involves combat, but it makes actually fighting enemies a chore. The checkpoints are few and far between. And, to top it all off, it crashes constantly.I wish I were exaggerating about any of this, but Im not. The puzzles require lighting up various parts of the world around you, but theres not really any thought that goes into it. Youre just shooting at pretty clearly-identified targets. At its most challenging, you stand in one spot, flash a light, andwell, thats it. The toughest part of any of the puzzles is figuring out where to stand so that you can flash in the right spot.At least when youre doing puzzles, though, you dont have to move  which is good, because never have I seen a game that could be described as a walking simulator where walking so tedious and awkward. You trudge along at a sluggish pace, with little indication of where youre supposed to go next and no way to move faster. You regularly have to jump from platform to platform, except the jumping is so wretched, you barely move, and youll regularly have to take a few attempts just to figure out exactly where the shortest distance is between the end of one platform and the beginning of the next.Youll find similar difficulties when Unknown Fate decides to throw a few enemies at you. The combat here is simple: you flash a light that knocks the monsters over, and then you shoot at the glowing bulbs at the ends of their tails. The problem is, you have to fire your light just so, or else the hit wont register and the monsters are back up and attacking. Theres no aim assist or anything, which is a lousy design choice by itself, but compounded by the fact youll be doing that flash-and-shoot move a lot, and at a certain point, youll start wishing the game could just be a little more forgiving.Actually, no, Ill rephrase that: at a certain point, well before then, youll start wishing the game would simply work the way it was supposed to. Because that, I think is Unknown Fates biggest problem. I lost track of the number of times I was forced to restart the game when it became apparent that something had gone wrong. I fell through the world and got stuck in the middle of darkness. I interacted with an object, and everything froze. A puzzle would simply just glitch, and not work, and leave you stranded with no way out. And then you go to pick up where you left off, and find that the game has dumped you well back from where you just were, because who needs autosaves or checkpoints when you can just have a bunch of random respawn spots that are never made very obvious?", "date": "September 4, 2019", "grade": "D"}