{"name": "Splatoon 2", "ref": "https://gaming-age.com/2017/07/splatoon-2-review-nintendo-switch/", "text": "One of the greatest success stories of the Wii U, and believe me there are very few, is how well Splatoon was received by Nintendo fans. Sales for the unique third person shooter were massive, with nearly one in every three Wii U owners purchasing a copy. Thats not bad at all for a brand new IP, and even more impressive when you consider that the game was a massive hit in Japan, where typically shooters have a hard time selling. Thats no doubt why Nintendo fast tracked a sequel for the Nintendo Switch  to continue to propel sales of the system and reintroduce the series to a whole new audience.When the original Splatoon arrived on the Wii U, it was a fairly anemic package. There were only a handful of stages to play, a small assortment of weapons and gear, and many wondered if Nintendo shipped an incomplete game. In reality, it was an innovative game rollout, where every couple of weeks something exciting would appear in the game: a new stage, a new weapon, fresh gear, and even new gameplay modes. This allowed gamers to constantly revisit the game to check out the enhancements, and indeed, it kept the game in the gaming press week after week.With the release of Splatoon 2, many wondered if Nintendo would just copy and paste the rollout from the original. Fortunately, they are taking some of the best parts of that strategy  free updates for the next 12 months (including new gear, stages, and weapons), but have also loaded the game with plenty of stuff to do right from the start. In fact, all of the modes that were later added to the original game are already included in this version  no need to wait to play things like Tower Control and Rainmaker (well cover these in a bit), plus some new stuff to discover in solo play as well as the all-new Salmon Run.The game begins with a simple tutorial level to help you get your bearings with the controls. Youre soon zapped straight into Inkopolis Square, where you can roam around and chat to the various vendors and check out the various modes offered in the game. At the start youll be walled off from doing most things except either the single player campaign or online Turf War. Its up to you to decide where youd like to spend your time. If youre a veteran and played a ton of Splatoon, it might be best to just jump right into Turf War and battle it out online. Here its a team of four versus four in a three-minute grudge match to try and cover the most ground in your teams ink. Whichever side has the most painted at the end of the three minutes is declared the winner  earning them bonus points. Even if you lose you still get points based on how much ground you were able to cover throughout the match. These points are important because they will go into your experience bar and level you up. Your main goal should be to get your character to level 4 as fast as you can so you can unlock some valuable items at the vendors and also open up Salmon Run.Salmon Run is perhaps the biggest addition to Splatoon 2, and indeed one of my absolute favorite activities to play. Many games have a mode like this, which is commonly referred to Horde Mode (taken from Gears of War). Heres how it works: You and up to three other people form a team and must work together to gather Golden Eggs and return them to your basket. It wont be easy though, because there are waves of enemies that will come out and try to take you down. If you or your teammates fall in battle, they can still move around slowly waving a small flag. Simply pelting your teammate with some ink will revive them so they can rejoin the action.There are waves of normal enemies (which look disgusting by the way), and then the horn will sound and a boss will come out. Each boss has a weak spot or technique to take it down. Youll need to cooperate with your team to destroy the boss as quickly as possible. Once defeated, the boss will drop some Golden Eggs that you and your team must pick up and return to your basket. Everything is timed, and theres a minimum amount needed to proceed to the next round. If you fail to meet that requirement, the game will end and you wont get much in the way of rewards.Each round youll be given a random weapon, so you never quite know how its going to play out. This is a great way to try out the various items in battle. The bosses are all unique and fun to go up against, at least at first. As you rank up the mode becomes even more chaotic with two, three, and sometimes more bosses all roaming the area all at once, wreaking havoc. This mode can become quite intense, but its oh-so-thrilling when your team is able to pull off a victory. Lots of small things can impact your round, like the tide rising or falling, shrinking or enlarging the playfield. Fog can settle in, making it more difficult to see where things are. I highly recommend playing this one with some friends if you can, as its more fun when you can voice chat with them (you cant voice chat with people youve never played with before).Speaking of chat, lets just get this out of the way right now. Splatoon 2 is the first game that utilizes Nintendos new Switch Online phone application. This means that if you want to play a private game, you can create a room and invite your friends to chat with you. Between matches everyone can hear everyone else, but as soon as a match begins, the audio cuts to only the team youre on. This makes sense in theory, but in practice its kind of disappointing. The Switch really needs a system-wide party chat system, like PS4 or Xbox One have. Dont automatically restrict who I can and cannot talk to at any given moment  thats really lame. Its bad enough the chat has to go through an external device, but the functionality is so restricted that Ive just been chatting with friends through the PS4 party chat. Its easier and I dont have to worry about being cut off mid-sentence. The first Splatoon had no voice chat options whatsoever, so at least Splatoon 2 gives you some (very rudimentary) options. Nintendo really needs to figure out some better ways to implement this if theyre going to be taken at all seriously with online chat.I will say the SplatNet 2 portion of the app is great. It keeps track of various stats, like how many wins and losses, favorite stages, weapons, etc. It also allows you to purchase special gear not being sold in the game, which is pretty awesome. The bottom line is the Switch Online App is not essential to playing this game, but it does offer some nice enhancements with less than desirable options for voice chat.As I mentioned earlier, some modes of play are locked until you rank your character up. Youll need to play a bunch of Turf War to rank your character up to level 10 before you can play Ranked Battles. This is where you get access to Tower Control and Rainmaker. Both of these modes were added to the original game over time, but they are included right off the bat in Splatoon 2. Tower Control has you riding a moving tower into enemy territory. Rainmaker is sort of like Capture The Flag  you must carry the Rainmaker weapon to the enemy base. Both are fantastic modes to play and offer up different ways to strategize. Since these modes are already included in the game, I do wonder what else Nintendo has up their sleeves in the coming months.One of my favorite parts of the original Splatoon was the single player campaign, and once again its superb. Like many shooters, the campaign wont take you too long to blast through  probably about 5 to 7 hours. This time around the game has you using specific weapons on each stage the first time you play it. But, the cool thing is that you can go back and replay the stages with any of the weapons youve unlocked in that mode. This can often change some of the way the course is designed in order to accommodate your load out. The story isnt anything too important and youre not going to get cinematic set pieces like and Uncharted game, but the various levels are extremely well designed and are somewhat reminiscent of what you might find in a Super Mario game. Theres a ton of platforming and secret finding and it seems like each new stage has something new and exciting to offer. Boss fights are especially crazy; really testing the skills youve learned to put them down.Splatoon 2 has really been designed to get you to login as often as possible. The gear that you wear, like shirts, hats, and shoes, all rotate in and out of stock quite regularly. Each piece of gear has an attribute that can help you in your online battles. Different pieces will have varying numbers of open slots. As you earn experience while wearing the gear, youll level the item up, which will then randomly place a perk on that piece, giving you even more power. This is all random, but there are ways for you to reassign perks to gear, at a cost of course. Basically, theres a ton of customization and rewards for those that put the time in. Oh, and if youre intimately familiar with the original game, youll be happy to see some of your favorite weapons make a return, like the NES Zapper, but youll also be excited to hear that new weapons, like the Dualies, are made available to change up the game. All of the old Special Weapons have been removed from this game and replaced with completely new Supers. Weve already seen some of whats on the way, including an umbrella that can shoot ink and block incoming fire and a giant hamster ball that you can run around in, squashing the competition!One of the greatest things in the first game was Splatfests. These return to Splatoon 2, and they have each player choose a side (the first Splatfest had gamers choose between ice cream and cake, and the second one is ketchup versus mayonnaise). Then, during a specific weekend your team battles it out and whichever team wins will get special items to help them customize their characters even more. The first game had them taking place at night with fireworks and everything, so were hopeful that returns this time around. Again, this is one more activity to get gamers to keep coming back for specific events.In fact, even Turf Wars and other modes are constantly changing. The levels you play on rotate every two hours so youll be randomly playing between two different courses during those blocks of time. Each activity (Turf Wars, Rainmaker, and Tower Control) will have unique sets of levels that are accessible during those two hours. While I appreciate the randomness to the whole thing, it is kind of disappointing that we cant just pick a level on our own. Games like Mario Kart 8 Deluxe allow this, so its a bit perplexing why we cant here. The other downside is that my favorite mode, Salmon Run, is only available during specific times during the day. Usually its up for 12 hours at a crack, but there have been times Ive logged on only to find out its not up and running. Im not sure why this is the case, but I hope Nintendo rethinks this strategy and makes it available at all times. Granted, if you have a group of people together locally you can play this mode anytime you like, but that sort of defeats the purpose of online.Splatoon 2 definitely looks and performs better than the original Wii U game. The graphics are presented in full 1080p with 60fps, and the game is filled with all sorts of little enhancements. Im particularly fond of the sparkly ink used in the campaign mode  glitter makes everything better! When playing all of the various modes, the paint has been vastly upgraded with more reflections and different consistencies. You can actually see the paint ooze down walls now and the game is super colorful and fantastic to look at. Its almost like youre living inside a 90s Nickelodeon TV show. Ive played mostly on the TV, but even when playing in handheld mode the game holds up with rock-solid frame rate and spectacular visuals.The original game was famous for its unique, yet addicting music  and the trend continues here in Splatoon 2. The entire soundtrack is filled with Squid singing and its just as awesome as before. Even though I was playing some of the same stages over and over again, the music never once got on my nerves. Its upbeat and catchy, and somehow manages to complete the weird experience. Theres still no voice in the game, but theres the Animal Crossing-like jibber jabber noises that come out of the various characters when theyre speaking. Its cute and doesnt really detract from the experience.Whether youre new to the Splatoon series or a repeat customer, Splatoon 2 has enough to keep players entertained for hours on end. Theres enough variety in the different modes of play, and the solo campaign is almost worth the price of admission alone. The new Salmon Run is gloriously fun and the promise of even more weapons, gear, and modes make this game an easy recommendation to all Switch owners. Really the only glaring issues at launch are the cumbersome and lackluster voice options via the Switch Online App, and perhaps the lack of multiple new modes to play in for veteran gamers. I can see some longtime players experience a been there done that in Splatoon 2, but the formula works so well and the game is so much fun to play that I dont think that will be a major concern for most players. Be a kid (or a squid) again and have some fun!", "date": "July 31, 2017", "grade": "A-"}