{"name": "Utawarerumono: Mask of Deception", "ref": "https://gaming-age.com/2017/07/utawarerumono-mask-deception-review-ps-vita-ps4/", "text": "Utawarerumono: Mask of Deception may try and sell itself as a visual novel-SRPG hybrid, but thats not really an accurate description. Sure, it possesses a few SRPG elements, but in the overall scheme of things, were talking about less than a quarter of the game. More than anything else, Mask of Deception (not to be confused with Utawarerumono: Mask of Truth, its sequel, which is due out in a few months) is basically a visual novel that just so happens to give players a little more opportunity for interaction than most of its peers.Actually, thats not the only way that Mask of Deception stands out from other visual novels. It also does that by being surprisingly good, with a some legitimately funny humour and interesting characters.I say surprisingly because the game has its root in Japans erotic gaming scene  thanks for that info, Wikipedia!  and the words legitimately funny, interesting characters and porn-based game dont usually go together. In fact, if were being really honest, in my experience humour and strong characters are also missing from most visual novels in general (or at least the ones that have been localized on the Vita), so for Mask of Deception to succeed on those fronts counts as a pretty impressive feat.Dont get me wrong, Mask of Deceptions main character still kind of sucks. As seems to be de rigueur for visual novel protagonists, hes rude, abrasive, insulting, obnoxiousbasically the last kind of person youd want to spend time reading about. On top of that, the story kicks off from one of the most generic starting points possible: an amnesiac wakes up in an unknown world, and gets rescused by a pretty girl.And yet, against all odds, the game overcomes these overused starting points and turns out to be good. The main character is very quickly surrounded by relative likeable, interesting characters who arent walking tropes, while the plot unfolds with a decent amount of depth. Most importantly, though, the game is more than willing to deploy humour the deflate the heros overblown ego; there were points where I actually laughed out loud, which isnt a reaction I often have. To be clear, the jokes were just dumb slapstick, so were not talking sophisticated comedy or anything, but as far as Im concerned, the fact the game wasnt afraid to include a few moments of levity is a major plus in my books.Another, equally important plus: the battles. I wouldnt describe them as ground-breaking or anything  theyre your standard turn-based combat  but they provide a nice break in the action every once in awhile. Admittedly, its usually once in a very long while (there were times where I went well over an hour between fights), but they add to Mask of Deceptions world, and make it so that players have more to do with the game that simply pressing X to advance the text.", "date": "July 28, 2017", "grade": "A-"}