{"name": "Pyre", "ref": "https://gaming-age.com/2017/07/pyre-review-ps4-pc/", "text": "Developer Supergiant Games does it again with this weeks release of Pyre, a stand out RPG/Arcade sports mix of a game from the folks that brought you Bastion and Transistor. Its easily one of the best titles Ive played so far this year, and certainly one of the most original. Its strengths are many, and quite frankly, Im having a hard time mustering up any particular shortcomings with this one. And I dont think Im overselling it one bit, I definitely believe that Pyre will be pretty high up on most folks top ten list come the end of 2017.So what is Pyre? Its difficult to directly compare the game to anything else. On one hand its definitely an RPG. Youll have a party of unique characters, culled from different races like humans, demons, bird-people, sea creatures, etc. These characters will level up over time, gaining access to unique skills as you play. You can also purchase or find talismans to equip, that will further enhance those characters. And theres a whole lot of text to read through, which is thankfully well-written throughout. The world building done in Pyre is absolutely phenomenal for an original, non-franchise type of release, so much so that it sort of puts to shame other long-running, well-established RPG releases from earlier in the year.But Pyre certainly doesnt stop there. The actual combat side of Pyre is more akin to an old-school, arcade style sports game. Think about your old 8-bit and 16-bit hockey or basketball titles, and then imagine how that would play out today. Thats sort of the base of Pyres core gameplay. Youll build a 3-person/creature team out of your available roster, which will face off against another 3-person/creature team. Each team has a goal to defend. A single orb is placed in the middle of the playing field, and youll jockey for control of the orb as you attempt to land it inside the pyre (think goal) of the opposing team.Each character will differ in size and strength. Some characters are pretty nimble, able to expend a large amount of stamina to bound around the field. Other characters can fly for a limited time, taking to the air in order to pass by ground defenders. And then theres larger, lumbering characters that cant move quickly, but can cover a large patch of ground with their imposing aura, capable of temporarily removing opposing players from the playing field. Theres even more to the give and take mechanics of battle in Pyre than Im delving into here, but it is definitely safe to say that Pyre does not lack depth in its mechanics.Pyre is also a visual/audio treat in numerous ways. The soundtrack, much like the Supergiant titles that have come before it, is fantastic. Theres a number of unique tracks featured throughout the game, some with haunting vocals, that will likely stick in your mind well after youve finished the game. And the visuals are equally stunning, with fantastic renditions of different fantasy areas that feel ripped from the page of a more colorful, fantastical rendition of old school Heavy Metal magazines. Its like looking at Franzetta filtered through copious amounts of LSD. Seriously, some of the zone maps are some of the most beautiful renditions on modern consoles.And then of course the story is really well done. The basics are that you play the role of a non-combatant, often referred to as the Reader. Reading is a skill that most characters in the world of Pyre do not possess, and as such, youre sort of the default leader of your group as you direct your team towards the next Rite, or battle, as you advance through the world. That world is referred to as the Downside, where those that are exiled from the Commonwealth are forced to tread as they partake in Rites of their own, all in an effort to make it back to the Commonwealth and some degree of glory.The thing that really sells me on Pyres story, though, is the sheer amount of lore and world-building that is expertly woven in-between the text. You wont be pouring over endless dialogue boxes here, in fact, you can generally get from one battle the next quite quickly. But theres a lot of optional material woven into the text via pop-up annotations that you can optionally highlight, which in turn add more context to the current events. Its completely optional, but so well written that I would definitely discourage skipping through it.", "date": "July 27, 2017", "grade": "A+"}