{"name": "Valkyria Revolution", "ref": "https://gaming-age.com/2017/07/valkyria-revolution-review-ps-vita-ps4-xbox-one/", "text": "I should admit up front that I never really got into Valkyria Chronicles. I played the sequel a little on my PSP a few years ago, but Id be lying if I said I remembered much about it beyond the battle system (turn-based) and the vague recollection of its plot and setting (basically, Europe circa World War II, but not). Consequently, I cant say that I share in the displeasure a lot of people feel with Valkyria Revolution over its fidelity  or lack thereof  to the series, since I just dont know it well enough to be annoyed.In fact, I suspect that this lack of familiarity (and, more importantly, my resulting lack of expectations) actually helps me enjoy Valkyria Revolution more than I may have otherwise. Im not going into it with anything in the way of preconceived notions about how the characters should act, where the story should go, or how everyone should fight. All that makes it much easier to enjoy on its own terms.It also doesnt hurt  at least in my eyes  that the combat went from being turn-based (which I generally have a harder time appreciating) to something closer to hack & slash (which I generally love). I know a lot of people enjoyed those original Valkyria Chronicles games specifically because of the strategy involved in guiding your forces across a battlefield, so I get that the change here may come as a significant and unwelcome departure, but personally I found the shift made the game much, much more accessible. I know that Im basically admitting here that I like that they dumbed things down, butwell, thats the truth. I could try to argue that theres a little more strategy here than in, say, any of the Warriors games, since theres also an action wheel that can pause time while you decide whether you want to augment your attack, plus your attacks are spaced apart by a short cooldown period, but lets be honest: its much closer to the Warriors games than it is to Valkyria Chronicles.Ironically, while Valkyria Revolutions combat may be much more accessible, its story and plot are far more demanding. The game launches with, essentially, an hour-long cutscene. Youll get a few moments of action here and there, and you can skip some of its scenes if you want, but if you want to understand whats going on for the next thirty hours or so of playing time, you should be aware that youll be given a whole lot of talking right off the bat.(You should also be aware that if you want to save your progress, your first opportunity doesnt come up until after that first hour. This was something I discovered only after turning the game off after my first 45 minutes of playing time; its also how I discovered both the ability to skip scenes and that the load times  at least on the Vita  occasionally feel like eternities.)Id like to say that its at least interesting talking, but thats not the case. Its endless exposition, coupled with long digressions into random characters talking, with a little bit of bonus explanations of the impacts of economic policies. Its a lot of world-building just for world-buildings sake, and I cant say that the game feels like its better for it. In fact, given that much of the dialogue is delivered by talking heads  or worse, delivered by someone not pictured, as you stare at the impassive faces of people listening to the speaker  Id say that it actively harms the game.", "date": "July 20, 2017", "grade": "C+"}