{"name": "Nex Machina", "ref": "https://gaming-age.com/2017/07/nex-machina-review-pc-ps4/", "text": "If youre unfamiliar with Housemarque, then maybe its because youve played one of their eye-searing shooters that was so intense that it wiped the whole experience from your memory, Men in Black style. Or maybe you just havent heard of them. Who can even say?After tinkering with voxel-based rendering in the side-scrolling Resogun, theyve returned to twin-stick shooters with a layer of voxel paint in the world of Nex Machina. According to the games description, theres even ray-tracing and morphing tech in here! Its easy to see why theyve continued the voxel style, as it adds a lot of dynamic quality to how environments organically react to all the chaos and gunfire.The first thing you may notice is that the environments are a little dull, but youll quickly forget this as all the enemy fire and your own shots light up the screen just plenty. Even though the visuals are simplified, there are times where so much is happening that gameplay will still become overwhelming. This is less so on the easier mode, but good luck trying to jump into Nex Machinas deep end without learning to swim first.In the game, there are a handful of worlds that are broken down to small areas with enemies to kill and little guys to rescue. This may sound easy enough, but there are hidden secrets in destructible objects, such as levels, extra lives, or even secret guys to rescue. Why are they hiding? Dont they want to be rescued?!Well its your job to make sure nobody is left behind, so it helps to shoot at every surface just in case there are secrets waiting to be discovered. Youll get an eye for what objects can be destroyed, and over time will probably memorize level layouts. Completionists will have a great time trying to cover all their bases, but the thing is that once youve destroyed the last enemy in an area, youre transported to the next one. This happens whether youve collected everything, and I still dont know how I feel about having to leave one straggler behind as it stalks me just so that I can scour every last nook and cranny. Its cost me a life a few times, and then I have to replay the area again which at times may cost you even more lives.The controls are really simple, with a dash and special weapon assigned to the shoulder buttons. Youll have to collect the special weapon (of which there are six), and some of these have properties that can destroy enemy shots. My favorite is the sword, combined with the power-up of triple dashing and you feel like a badass ninja flying through enemies like confetti.Dashing is great for phasing through enemy fire and lasers, as youre temporarily untouchable. My biggest gripe with Nex Machina is that it spends most of the game training you to dash through all the pink enemy shots and laser fields, then in the last couple worlds introduces a version of laser that will kill you no matter what. This is really confusing, as its almost the same color of enemy shots, and your muscle memory will betray you over and over again since your impulse is to dash through that kind of stuff. I really dont like the last two worlds because of this.The boss fights are also not that fun. All of them eventually break down into a mess of bullet hell fire that youre expected to dodge while shooting the boss. This would be great if your guy had better controls, but theyre just not up to task. Bosses will also move faster than you, and even charge or take cheap shots at times. Housemarque just released an update to Nex Machina which includes game balance fixes, so its possible some of these issues will be addressed down the road.You cant avoid this, so youd better have some extra lives or a shield, otherwise youre a goner. And since you lose power-ups each time you die, you can find yourself with a range of fire thats too short, resulting in a lot of frustration with tougher foes. Another solution is to play with a friend. Theres local multiplayer in here, nice!", "date": "July 13, 2017", "grade": "B+"}