{"name": "Final Fantasy XII The Zodiac Age", "ref": "https://gaming-age.com/2017/07/final-fantasy-xii-the-zodiac-age-review-for-ps4/", "text": "The latest in a long line of HD remasters, Square Enix has finally decided to release Final Fantasy XII on the PlayStation 4. If youre like me and somehow didnt play this game when it came out on the PS2, then youre in for a real treat. If youre not like me and did play the original release, then you probably already know this game is worth your time.I dont really know why I missed out on Final Fantasy XII back in the day, but Ive owned a copy for years. At one point, I went to play it and couldnt change the horizontal camera controls. Whatever games I was playing at the time must have really screwed me up because I couldnt adjust to the camera in FFXII and had to set it aside. Thats no longer a concern, as the remaster includes the option to change both the horizontal and vertical axis.As it turns out, enough time has passed that I no longer needed to make any camera adjustments, but its totally possible now. Anyone who had this issue can now fully enjoy Final Fantasy XII with nothing holding them back!Now that weve covered my brief history with the original game, lets see what Final Fantasy XII The Zodiac Age has to offer besides more customization in the games settings.The most obvious change is to the visuals. This is a total HD remaster, and the work has paid off. One example is that I remember being kind of repulsed by Vaans torso texture back on the PS2, but its been redesigned here. He no longer looks like he took an acid bath, and these refinements are present throughout the entire game. The team who worked on this took full advantage of the opportunity to give the entire game a visual facelift.As for the audio, its kind of a mixed bag. I say this because while the music has been kept in tact, so has the games voiceover work. The first time you hear anyone talk, youll be wondering if Square Enix used a time machine to go back to 2006 and just get the voice work straight from its compressed DVD source. Its a shame that more couldnt be done for the voices in this game, since the sound effects and score shine so much.There were a good amount of times where Id be playing the game, enjoying how pristine its graphics and sound are, and then a character has something to say which just sounds awful in contrast. I got used to this over time, but theres not much you can do about it. Well, maybe you could play the original game and all the audio would be of the same quality, but who wants to do that? Just look at how pretty it is on the PS4!The game even defaults its music to a great updated orchestral version of its original score, although it offers the original tracks for those who want the experience to be more like it was back in the day. I liked both versions, and really enjoy the discrete transition between them when changing over. A part of me wished there was an option to change the visuals between their original appearance and the remaster (as seen in the Halo Anniversary remake), but thats not too important to worry about.The game plays just as it always has, with the infamous gambit system and real-time targeting. I found myself using a speed multiplier to move more quickly through dungeons, and this can be toggled on and off with the L1 button. This was offered in the International version of Final Fantasy XII, and I like that a things can be sped up to get through any dull parts, then slowed down to enjoy the pace as it was meant to be.The other major inclusion is the Zodiac Job System from the International version, which has twelve license boards for you to level up your party with. This adds a nice level of depth to what the original game provided. You can also control guest characters, those who are present at parts of the story, but may not be permanent additions. These must have really satisfied those who played the International version, because I found them to feel like natural parts of the game in The Zodiac Age. Maybe I just like having more ability to interact more with my party.My only other complaint with the game is that while there are a variety of technical improvements, the process of creating save files seem to take an eternity. There were many times where I would become impatient waiting for the game to present me with more dialog about where I would like to create a save, then find myself accidentally saying No and having to wait for more menus to load. This takes place on the PlayStation 4 interface, but I feel like other games get you through this process much quicker. The Zodiac Age instead is just dragging its feet. This is a really minor complaint, but it may bother some people like it did with me.", "date": "July 11, 2017", "grade": "A"}