{"name": "Ever Oasis", "ref": "https://gaming-age.com/2017/07/ever-oasis-review-3ds/", "text": "Ever Oasis is Nintendos blend of casual town sim and casual RPG for the 3DS, a perfect combination for anyone looking to relax with a cute handheld game this summer. It also begs the question of whether theres such a thing as too laid back in games. In the case of Ever Oasis, its definitely interested in testing those limits. Whether thats too complacent depends on the person, but my experience with the game was similar to its ratio of genres: about 50/50. Does that mean that only half of the game is good? Not at all. Its more like I was interested in what the game had to offer for about half of the time. The other half is just okay.Players will start out by creating a character, choosing a gender (this changes the default name between Tethu/Tethi), and adding some light customization before beginning the story. The plot is that there are oases throughout a desert world which is mostly lifeless thanks to an evil force called Chaos. The main characters brother is a chief of one of these oases, and after a short introduction to the oasis, he has to battle a Chaos attack which overpowers him and sends you off on a journey of your own.From here, players will begin to create their own oasis. Its your duty as part of the seedling race, after all. Make your oasis blossom! Passerbys will become new residents, and a Chief of the oasis, you will manage all the shops that they want to run in order to provide an income. Residents are capable of more than generating revenue, as they will have special abilities which can be used to progress through quests in the outside world, and can also be assigned to fulfill tasks that players may not have time for later in the game.For the most part, managing the oasis is the Harvest Moon half of the game, where restocking the needs of shops, blowing sand off roads, and tending to the garden scratch that itch of keeping up with a digital zen garden. There are also elements of Animal Crossing with the progression of the towns growth and all the personalities of each new resident. These interactions are paper thin compared to the series they draw inspiration from, probably because as mentioned earlier this is only half of the game.Going out into the desert world is necessary for players to overcome Chaos. At first, the game starts off at a slow pace with many areas locked off, requiring special abilities to access. As players continue, residents of the oasis can be added to your party and be used to explore the world, gain a leg up in combat, and provide side quests to expand aspects of the town such as leveling up their shop.In many ways, this is a spin on Zeldas gameplay. Dungeons have light puzzle elements, lock-on combat, and lots of secrets youll need to return for. The party management is even part of the draw, as you will be quickly switching between your party of three to use the most useful character. This is a good time for the most part, but the game quickly hits a ceiling on its own structure. It all begins with the Aqua Gate, a fast travel/bookmark ability that allows players to instantly teleport to the oasis at any point in the world.Just like how players can assign residents to tasks around the oasis, Ever Oasis tries to accommodate to players by cutting down on time-wasting elements. Like that chest behind the special door? You cant get there without a specific party member who Metroid-style rolls into a ball to access the lock. Instead of having to walk all the way back to the oasis, you can use the Aqua Gate to quick travel and swap out a party member.Thats all well and good, but once you open the door, it turns out there are rocks you can mine. Well, theres no one in your party who can do that, but luckily the Aqua Gate will let us get back in a jiffy. All hail the Aqua Gate!The problem is that the game relies on fast travel to solve its gimmicky party structure, and a good deal of the game will be spent quick-swapping party members until you start to gain residents with more expanded abilities. This ends up being a huge time waster. I even clocked it, and generally you can expect to take 43-45 seconds to fast travel into the oasis, change out a party member, and travel back into dungeons. A good part of this waiting is watching all the animation, but its the equivalent of a really long load time just to complete a dungeon without missing too much. Even then, there are areas youll have to return to once you get a resident who can finally take down all those cobwebs blocking off paths or something.Ever Oasis is otherwise a cute and relaxing game. The visuals are bright and colorful, and the music isnt half bad. It plays a lot like 3D Zelda as far as an action game goes, and doesnt have a great amount of difficulty to it. I usually wouldnt fault a game for this, but it gets boring quickly with the limited gameplay. You can even craft weapons and items, but who needs healing when your partys HP is restored any time you teleport back into town?The main problems with Ever Oasis are the abuse of fast travel, and how the combination of surface-level town and RPG gameplay come together in making a game with a really linear pace. Its so steady that aside from customizing a couple things in your town, Ever Oasis plays out so predictably that it feels more like going through the motions than actually having an adventure, or running a town you feel invested in. I really would have liked to see more of an emphasis on the residents as your main assets, but they just end up being hired hands for busywork that makes everything you used to find interesting feel more like padding.Its hard to fault a game for being mediocre, but Ever Oasis never reaches the potential for ideas it brings to the table. If youre looking for a game that doesnt ask much of you, then Ever Oasis might be just the right speed. I ended up playing it to wind down in the evenings because the gameplay became so routine. Otherwise, you may end up getting impatient and moving on to something else in no time quick.", "date": "July 6, 2017", "grade": "B-"}