{"name": "Spellspire", "ref": "https://gaming-age.com/2017/06/spellspire-review-ps-vita-ps4-xbox-one/", "text": "Given my love for spelling and word games, it should come as no surprise that Im totally obsessed with Spellspire. I meanyou kill monsters through the literal power of words. How cool is that?If you clicked on the link in the preceding paragraph, youll note that this exact same description could be applied to a game that came out just last year, Letter Quest: Grimms Journey. Like Spellspire, that game was all about progressing through monster-infested dungeons, your vocabulary your only weapon at your disposal. However, theres also a key difference between the two games: where Letter Quest grew pretty repetitive pretty quickly, Spellspire never falls victim to that same trap. It recognizes that the key to any good RPG is allowing players to level up their skills. So it is here: by killing monsters with your words, you earn coins, which in turn you can use to buy new items, which in turn require more coins to strengthen. Its an addictive circle, and its one that doesnt get old because of the array of items on offer.It doesnt hurt, either, that theres some strategy involved in defeating the different monsters. Sometimes you need to freeze them, sometimes you need fire, and sometimes you need poison: by consistently mixing things up, Spellspire keeps you on your toes.Ultimately, though, what matters most in a word game is how easy it is to spell words. It sounds simple, and it sounds obvious, but the fact that not every spelling game can pull it off shows that its harder than it seems. Luckily, Spellspire succeeds on this front  particularly if youre playing the game on Vita, where letters can easily be dragged and dropped using the touchscreen. The letter tiles are big enough to read, but small enough that you get a decent selection at every level, and placing them (and, just as importantly, taking them off) is as intuitive as can be.", "date": "June 22, 2017", "grade": "A"}