{"name": "Fate/EXTELLA: The Umbral Star", "ref": "https://gaming-age.com/2017/06/fate-extella-umbral-star-review-ps-vita-ps4/", "text": "Im not even going to pretend I know whats going on in Fate/EXTELLA: The Umbral Star. Its my first time playing any of the Fate/ games, and somewhere between the overly affectionate android who keeps calling you Praetor and the introduction of something to do with digital shells  which is to say, very, very early on in the game  I found myself completely lost. Its not exactly the kind of storyline you can pick up as it goes along, to put it lightly.However, where my lack of familiarity with the series meant I was at sea when it came to understanding the story, it also made it possible for the game to come out of nowhere and shock me with how fun its gameplay was. All I knew going into Fate/EXTELLA was that it was in some way related to Fate/Extra, a PSP dungeon crawler that I never got around to playing on account of lack of interest in turn-based battles. I assumed this would be the same as its handheld predecessor.I assumed wrong. So very, very wrong.See, the games that most directly influenced Fate/EXTELLA arent turn-based dungeon crawlers, but those from the various Warriors franchises. Youre hacking and slashing your way through thousands of enemies, you have a map you have to clear according to certain conditions, and every so often you get to use special power-ups. The only way it differs from Samurai Warriors or Dynasty Warriors is that any pretense of reality is gone, replaced by the aforementioned impenetrable storyline  but seeing as I barely pay attention to the plot as it is in your typical Warriors game, that didnt bug me at all.If I were to compare Fate/EXTELLA to one specific Warriors game/series, though, it would have to be the One Piece Pirate Warriors games. While Fate/EXTELLA isnt quite as insanely over-the-top, it nonetheless shares with those games a fondness for vivid colours, distinctive characters, and a sense of fun that the Samurai/Dynasty Warriors games sometimes lack.", "date": "June 16, 2017", "grade": "A-"}