{"name": "WipEout Omega Collection", "ref": "https://gaming-age.com/2017/06/wipeout-omega-collection-review-ps4/", "text": "Sigh Im still a bit upset that Sonys Studio Liverpool (and Psygnosis before it) is no longer with us. A large part of my love for the PlayStation brand, back in the day, was due to WipEout and WipEout 2097/XL for the PlayStation One. The studio, with help from visual designers The Designers Republic and a killer electronic soundtrack by CoLD SToRAGE, The Prodigy and The Chemical Brothers (among others), really nailed the futuristic, hover racing aesthetic at the time. Coupled with an often zen-like gameplay experience, WipEout was kinda the perfect combination of intense racing and combat action. Unsurprisingly, that formula is still nearly as relevant today as it was 22 years (!!) ago.If youve played WipEout HD, the WipEout HD Fury expansion for the PS3 and WipEout 2048 for the PS Vita, then youve played damn near 100% of what is available in WipEout Omega Collection for the PS4. Of course the titles are now remastered for 4K and super polished all around, but the general gameplay experience is relatively unchanged. Although youll get a near constant 60fps, dynamic 4K resolution for PS4 Pro players, eye-searing HDR support, and the ability to use the superior DualShock 4 controller. On a Samsung 65 KS8000 UHD set, the visuals are rather godly for the most part  even WipEout 2048, which was remastered from a PS Vita game.WipEout Omega Collection is packed with content which is divided up into 3 campaigns, one for each of the respective games covered in the collection. In total, there are 26 reversible circuits, over 45 ships and several modes. The grid-based game progression, with medals and points earned depending on which WipEout campaign youre playing, is essentially identical to what was found in the original releases. Theres no intermingling of progress, content or unlockables across the campaigns, so players are getting the pure experiences there, for better or for worse. Unlocking new ships, ship variations and circuits isnt terribly difficult at first, though there is most certainly a steep curve for those who are looking for silver or gold medals.The Race Box mode returns too, with the ability to configure standalone, offline single or (2 player) split-screen races. And yes, theres also an online mode which supports 2  8 players across all three WipEout games. The mode is straightforward and offers enough bells, whistles and options to keep most competitive players happy for a few hours or more. WipEout, for me, has always been about zoning out and perfecting my times and skills offline rather than online battles, but it never hurts to have the option available.The developers included enough control customizations in WipEout Omega Collection to make the game appealing to whomever wants to play, so gamers new to the franchise and Anti-gravity Racing League veterans will feel at home. Those who are really struggling can even opt to turn on the Pilot Assist feature, which sacrifices some top speed for safer controls. Its a useful tool for racers still learning their way around some of the more complex courses, though the chances of earning a gold medal are low if not impossible with it enabled.Depending on the campaign, there are several race types that may be presented to pilots and are required to make forward progress through a circuit. From the more passive, trance-like Zone Mode, to the explosive Eliminator/Combat or Detonator Modes (not to mention Single Race, Speed Lap and Time Trial in between), theres just enough variety to keep players hooked. There are no new courses present in WipEout Omega Collection, although there is a brand new Tigron team, which is pretty damn competitive.Whether or not you love the gameplay (and there must be some out there who do not), theres no one who can deny how great looking and sounding the WipEout games are. Visually, WipEout Omega Collection is obviously the very best the series has looked so far, in every way possible. The lighting, the framerate, the particle effects, the user interface and the sheer amount of detail packed into each and every race circuit and ship is still pretty much unmatched in the genre. Whether or not you get to experience the collection in 4K HDR or just plain old HD, there is plenty of eye candy to feast on. Oh, and load times are super quick too.The soundtrack kicks all sorts of ass too, and Sony dipped back into the licensing pool for electronic tracks from Swedish House Mafia, The Prodigy, The Chemical Brothers and DJ Kentaro, to name a few. There are a few of the classic tracks which didnt make the cut for whatever reason, though were sure that players with a Spotify account can queue up one of many custom playlists made just for the game. WipEout Omega Collection looks and sounds as a WipEout game should.", "date": "June 6, 2017", "grade": "A-"}