{"name": "Mr. Shifty", "ref": "https://gaming-age.com/2017/05/mr-shifty-review-nintendo-switch-pc/", "text": "With the Nintendo Switch just under two months old, its been great to have a steady amount of quality indie titles release for the console. Mr. Shifty just so happens to be one of those games. The premise is pretty straight forward. You play as a thief, attempting to steal a dangerous Plutonium from an evil chairman in his tower, which makes up the levels.The top down visual style is similar to Hotline Miami, but the graphics are more in line to a comic book, artistic approach vs the retro look that Hotline incorporates. Other than these couple of traits, Mr. Shifty is its own game with a unique and entertaining mechanic. The gameplay is easy to learn but difficult to master.Your main weapons are your fists and the ability to teleport a short distance in front of you, allowing you to get past swarms of guards, laser traps, or simply appear behind your enemies to take them out quick. At first the game feels like its holding your hand, almost making Mr. Shifty seem invincible. Dont fret, because thats a short lived feeling.One way to make the game challenging is you have a one hit death. In some levels, the enemies are extensive and you may find yourself franticly teleporting only to run out of your allocations of teleport juice. In order to make sure you are strategic with the ability, youre able to use it five times before the meter runs out and has to replenish.Outside of the fisticuffs youll be able to pick up items in each level and use them to take out any obstacles in your way. Besides fighting off hordes of enemies, you will have to avoid laser traps, and dont worry theyre plentiful. This is another portion of the game that proves, if you can master the mechanics, then you have an entertaining challenge ahead of you.One of my biggest issues with the game has to be how it runs on the Switch. There are framerate drops at the most inopportune times, which makes the experience frustrating. This doesnt happen often, but when it does, it takes you out of the moment. I spoke with a colleague at GamerXVault.com about his time with the steam version and reported that the performance didnt suffer in the same respect. Be sure to keep an eye out for his review as well in the near future.", "date": "May 26, 2017", "grade": "B"}