{"name": "Ultra Street Fighter II: The Final Challengers", "ref": "https://gaming-age.com/2017/05/ultra-street-fighter-2-final-challengers-review-nintendo-switch/", "text": "Triple R (resident remaster reviewer) is back to review one of the strangest remasters Ive ever done. I used the quotation marks on remasters because this isnt quite a new remaster, its more like a port of a remaster with some sprinkles of new stuff oh, and the game is over 20 years old. That convoluted explanation is almost as convoluted as the title of the game, Ultra Street Fighter II: The Final Challengers, but that has become expected from the likes of Capcom. Being the Switchs first fighting game that isnt a NEOGEO port, is kind of a big deal. I feel like Street Fighter is really setting the bar for future releases and that probably isnt a good thing.Let me elaborate a bit on my previous statement, Ive been playing a ton of Injustice 2 on the PS4 (which is fantastic) and unfortunately for Nintendo, it just doesnt have the power under the hood of the Switch to be able to run Injustice 2 or any modern console NEW fighter. So Ultra Street Fighter II might be just the beginning of the fighter ports of previous generations, I just hope they arent all twenty plus year old titles that they try and sell for $40. Speaking about the price point, before I go into the actual game, I think its really ridiculous that they are charging $40 for this release and its really a slap in the face of hardcore Street Fighter fans. Now having said all that, I wouldnt mind a port of Ultimate Marvel vs Capcom 3, or any of the previous entries in the series (Maybe a trilogy collection hmmmm) on the Switch. The portability of taking those games anywhere and being able to play them with friends on the go is enough of a selling point to move past the fact that the games are previous generation ports and not the new hotness, like Injustice 2 (can you tell I really like it?).Now lets talk some Ultra Street Fighter II. The port is essentially the HD Remix that was released on the Xbox 360 and PS3 years ago. We have a few added modes, which I will speak about a bit later, some art galleries, and TWO new characters. The game can be played with the new HD graphics and updated sounds, or with the original graphics and/or sound effects. The gameplay is exactly like you would expect it, if youve ever played a version of Street Fighter II in the past 20 years. Some notes about playing it on the Switch; the game looks stunning in handheld mode, almost feels like playing youre in an old arcade, but without the scanlines and much much better graphics. While playing in handheld mode is awesome, using the joy con D-pad is definitely not. If you dont want to play with the analog stick, youre going to need to buy a pro controller (which honestly you should own already anyway).Way of the Hado, is the biggest and also strangest addition to the game. Its a first person mode where you control Ryu and use the joy cons like Wii remotes and make hand motions to perform moves on swarms of enemies. Yep, just when you thought the Wii was dead and motion controls died with it, Capcom resurrects them (like they try to do with many of their franchises). This is a pointless mode and gimmick in my opinion and belongs in 2007, so this add-on is only 10 years late to the party. Expect to try it once, if that, and never go back to it (expect to maybe show friends how you can look like a fool). Along with the Wii of the Hado is a new co-op mode where you and a buddy (or AI) play handicap matches against the computer. While it is unfair two on one, in an event to even the odds, your team shares the same health bar. Unfortunately like the motion madness mode, this is just another throw away, and not a real reason to keep playing. The game will also feature online play, but as of writing this review the mode was not yet live. That feature is said to be patched in at launch (a growing trend in Switch releases).", "date": "May 24, 2017", "grade": "C"}