{"name": "Warlocks Tower", "ref": "https://gaming-age.com/2019/08/warlocks-tower-review-for-ps-vita-ps4-xbox-one-switch/", "text": "As popular as retro-looking games are, its rare for a game to capture both the aesthetics and the gameplay of games from decades ago. Thats why Im pleased to report that Warlocks Tower nails both perfectly.Visually, of course, this is obvious. The graphics arent just somewhere in that nebulous space between 8- and 16-bit, everything seems to be two-toned, and nothing is particularly intricate-looking. If someone were to show me footage from the game and tell me that it belonged to some lost Game Boy game, I would have no trouble believing that.But the other stuff feels like it comes from a Game Boy title, too. The gameplay is basic enough that its easy to pick up, but it gets very difficult very quickly. Warlocks Tower is a dungeon-crawler of sorts, where you have to move your character  a delivery boy trying to deliver a letter to the eponymous warlock  across a grid, avoiding enemies and traps while reaching the door within a set number of moves. It doesnt take long for the formula to show just how complex it can be, and if you can solve it all without resorting to any kind of aids or walkthroughswell, youre definitely better at these sorts of things than I am.What really feels like a throwback, though, are the details. The story, for starters, feels like an uncomplicated throwback to earlier days of gaming, as does the teenage boy protagonist. Likewise, the sense of humour  sarcastic and knowing  has a very 90s feel to it. These may not sound like much to differentiate Warlocks Tower, but in practice, you really notice the difference.Do any of these things make Warlocks Tower essential? Probably not. But if you want a retro-inspired game that actually looks, feels, and plays like something from a few decades ago  and that is pretty enjoyable while it lasts as a bonus  you could do a lot worse than picking this one up.", "date": "August 29, 2019", "grade": "B"}