{"name": "Sniper: Ghost Warrior 3", "ref": "https://gaming-age.com/2017/05/sniper-ghost-warrior-3-review-pc-ps4-xbox-one/", "text": "Sniper: Ghost Warrior 3 is a game built entirely on the backs of others that have come before it. There is really nothing here that causes it to stand out among the other shooter/sniper titles that we have seen in recent years. A basic premise, loose story and lack of real options yet past the campaign cause Sniper: Ghost Warrior 3 to hold no real grasp on players and give no incentive to continue playing. The experience that is there is not bad by any means, but falls firmly within the Average category.Sniper: Ghost Warrior 3 has you playing as a Marine sniper in the country of Georgia, and thats about all you need to know. The paper thin story is a hodgepodge of your standard action movie tropes, with none really standing out and giving the story an identity of its own. A missing brother, a revenge story, a long lost lover with a healthy sprinkling of patriotism is all present across the campaign with none more prevalent than the others. I will also say that in a game that was clearly going for an accurate portrayal of United States Marines, some glaring mistakes are made which could have been easily prevented with the help of a Military Advisor or really any prior service Marine.Stepping away from the story, gameplay is actually pretty good. You can clearly see the improvements from previous entries in this franchise, and a true step toward being a AAA contender. The framework is here and you can see the talent at work behind the scenes. Combat is good, bordering on great, be it sniping or a more run and gun mentality. Every style of play is viable in Sniper: Ghost Warrior 3. Skills are broken down into three trees; Sniper, Ghost and Warrior (clever, I know). Each of these skill trees has you focus on a different style of play, or you can choose to be a bit of a jack of all trades and level in all of them. No matter how you play, youre going to have some fun. A plethora of gadgets and traps make playing as a Ghost a blast, creeping among your targets and taking them all out silently is incredibly satisfying. Playing as the Warrior allows you to run in guns blazing and not feeling underpowered. Enemies dont take a full magazine to put down, with a few well-placed shots doing the job. As the title suggests though, Sniper is the true way this game was intended to be played. A bullet-cam not unlike Sniper Elites serves to show you the visceral effect of your bullets, but even this feels like it is a step behind where Sniper Elite was with their third entry.Technical issues are where I found my immersion broken and my experience soured. I played this on a PC with more than enough horsepower to run this game a few times over itself, but technical problems and outrageous load times plagued every step of my journey. When I say that you should prepare to wait for close to five minutes to load into some areas, I am by no means exaggerating. These load times make the launch of Bloodborne look smooth and easy in comparison, and they are not few and far between. Once loaded in, things speed up and deaths and checkpoint loading is substantially faster, but still not fast by any means. Character models look good at certain times, then a moment later a face looks like the melted faces from Raiders of the Lost Ark. At one point I walked up to a group of faceless opponents with nothing but weird tan/grey emptiness where a face should have been. Environments suffer from similar issues, with the ground actually falling away at one point and my whole game crashing. These are technical bugs that I would expect in an alpha, not post launch. I waited to write this review until after launch in hopes that some of these were going to be fixed last minute, but they were not.Delving into expectations for this, multiplayer was not only expected, but a big part of what was going to set this entry apart from previous iterations, but right before launch it was made clear that there was not going to be multiplayer until an as of yet undetermined point later on is its life. This was a bummer for me and several others, who might have been able to overlook some of these issues if there was more to delve into here and more content, but there is not. In a statement I received today from Marek Tyminski, CEO of CI games he stated that Only once we feel that proper headway has been made on the system performance, will we begin adding extras such as the much-requested multiplayer component. This suggests that we have a ways to go yet before multiplayer becomes a reality.", "date": "May 1, 2017", "grade": "C+"}