{"name": "Guardians of the Galaxy Tangled Up in Blue", "ref": "https://gaming-age.com/2017/05/guardians-galaxy-tangled-blue-review-ps4-xbox-one/", "text": "Telltale has completed a comic book trifecta. Starting with the Walking Dead, followed by Batman and now its first Marvel Comics entry; Guardians of the Galaxy. When the partnership with Marvel was first announced, I expected it to be a large Marvel universe story arc or a Spider-Man story. Guardians of the Galaxy was an unusual pick, I originally thought, but after playing the first episode, I kind of get it. Guardians of the Galaxy is the new hot Marvel commodity, they also have never based a game off the team. The team dynamic lends itself well to this game style and coming off Telltales Batman game, it was quite refreshing.Telltales Guardians of the Galaxy, like Batman, goes its own way (deliberate music pun). While the game and soundtrack are clearly inspired by the mega hit movie, it doesnt follow the story directly, nor is it an origin story. Expect minor spoilers in this review, because there isnt a whole lot to talk about gameplay wise, since all the Telltale games play nearly identically. The Guardians kickstart the adventure on the hunt for Thanos, and rather than have long drawn out waiting for Thanos to appear (cough MCU cough), we track him down almost immediately and were off to the races. This is all within the first 15 or so minutes, so I didnt spoil any major happenings.The character models are hit and miss; personally, I like the design choices for Drax, Rocket and Groot. While Starlord isnt terrible, I think I just expected it to resemble Chris Pratt a bit more (even though the game has nothing to do with the movies). Lastly, Gamora is the worst of the bunch, I dont care for the rings around her eyes like a green raccoon and she just seems out of place when shes on screen with the rest of the team. The voice acting is all pretty good, and most even sound like their movie counterparts (which I think was deliberate), but again Starlord is missing the Chris Pratt vibe, despite the dialogue seemingly written based on Pratts movie interpretation of the character. The story seems to be off to a good start, but its tough to know for sure since this is just 1/5 of the actual game. Having said all that, Im somewhat disappointed with it; I wasnt wowed or hooked with the story like I was with Telltales Batman, Game of Thrones, or Back to the Future (my top 3 Telltale games). Im excited to see the Marvel universe play out in Telltale adventure games, but this interpretation of Guardians of the Galaxy story seems to be too much by the book. Telltale does have the benefit of the doubt though, since this is just episode 1.Telltale fans and Marvel fans wont be disappointed with the first episode of Guardians of the Galaxy, but they might have expected more from it. The soundtrack is a perfect example of this; it uses licensed music just like the movie, but it almost seems like B-sides. Clearly the game didnt have the same budget of the movie or the same people who picked the music, because it just doesnt seem to be on the same level as the movie, and lets be honest, these comparisons are inevitable. Telltale announced they would be working on a Marvel game nearly 2 years ago, and I guess they decided if it aint broke, dont fix it, because they didnt take any chances with this release.", "date": "May 1, 2017", "grade": "B-"}