{"name": "Puyo Puyo Tetris", "ref": "https://gaming-age.com/2017/04/puyo-puyo-tetris-review-ps4-nintendo-switch/", "text": "Puyo Puyo Tetris: Two great tastes that taste great together! Oh wait, thats a Reeses Peanut Butter Cup but the sentiment still applies here. Sega and Sonic Teams mashup of two of the best puzzle series out there  Tetris and Puyo Puyo  works on many levels and is certainly very worthy of attention for fans of either of the long-running franchises.Tetris predates Puyo Puyo by five or six years, and while Compile/Segas own puzzle creation wasnt a clone by any means, it wasnt difficult to spot some of the influences and also appreciate the twists on the block dropping formula. Puyo Puyo Tetris does a very nice job embracing similarities and the differences of the titles while still respecting the unique aspects of each.  The end result finds a way to balance out and mix together game elements and mechanics of both franchises in such a way as to keep Puyo purists and Tetris traditionalists happy.Marketed as a frantic, four-player puzzle mashup and a fun-to-play, fast-paced, competitive party game, Puyo Puyo Tetris definitely fits into both of those descriptions quite well. With a plethora of modes for 1 to 4 players and robust online play  including a ranked Puzzle League system and leaderboards  the game will keep block dropping puzzle players very busy for a long while. Even the little Story Mode, which takes a number of colorful, long-winded characters across a few different acts is challenging and enjoyable for the few hours it takes to achieve 3 stars in each chapter. Theres also a separate Challenge Mode with even more levels to take on.The real meat and potatoes of Puyo Puyo Tetris is obviously the competitive and co-op multiplayer, which supports 2 to 4 players online or locally, with real or CPU players in nearly any combination you can think of. You can keep it simple with traditional play modes for either Puyo Puyo or Tetris, or go completely crazy with various twists on the usual scoring mechanics in Party or Big Bang modes to bump the pace and excitement up a couple of notches. Theres also Fusion and Swap variations which combine both Puyos and Tetriminos into one board, which while a little confusing at first, ends up being a pretty wild experience. The online experience, which was sparsely populated pre-release, appears to be well thought out with many ways to create games, browse for other like-minded players and initiate some casual or competitive play.  Were definitely excited to jump into the lobbies once enough players get their hands on the game to fill out some of the rooms.Its impressive (to me at least) how Sega figured out how to balance the scoring and block interactions when some players choose to stick with Puyos and others select Tetris pieces during the same match. After playing on both sides a number of times its still hard to pick an obvious winner. It certainly boils down more to player preference and skills than any inherent advantages of triggering an massive Puyo chain or achieving a perfect clear Tetris. Speaking of skills, Puyo Puyo Tetris goes out of its way to teach players a number of intermediate and advanced techniques that even long-time players and fans possibly didnt know about or were unable to perform consistently. The non-interactive tutorials run through quite a lot of the various techniques including sandwich, GTR, tailing for Puyo Puyo and T-spin, 4-wide and back-to-back scoring and matches for Tetris.  Sega also reproduced quite a few of these tutorials and published them on  their YouTube channel as well.Puyo Puyo Tetris is ridiculously bright and colorful and mostly follows the candy-colored Puyo Puyo aesthetic, with art and characters that inhabit that universe including Arle, Amitie, Carbuncle, Ringo, Popoi and some newbies. When coming from much darker, more serious game experiences, Puyo Puyo Tetris is a visual palate cleanser thats for sure. As for audio, prepare your ears for plenty of upbeat Puyo tunes and  voice samples during menus, cutscenes and gameplay.  Just playing through the assortment of Puyo Puyo Tetris game modes will earn players credits which can be used to purchase unlocks that are utilized to customize the game experience in one way or another, both offline and online. These include alternate character voices, an assortment of new Puyo and Tetromino designs, BGM selections and more. Its nothing game changing, but the extra customizations does provide for a little more replayability.Were assuming thanks to some unique licensing issues with Tetris, Puyo Puyo Tetris has some weird availability restrictions and pricing in North America. For the sake of this review, we were thankfully able to download the PS4 version, but other gamers will not have that luxury. In this region, Puyo Puyo Tetris for the PS4 will only be available at retail for $29.99. The Nintendo Switch version on the other hand is also being offered at retail for $10 more (with some cute bonus keychains) but also digitally, via the eShop, for $29.99. The PS Vita version? Nowhere to be seen in North America in any form, which is a shame to the highest degree. Does any of this negatively impact the games review? No. But not having the convenience of a digital copy for the PS4 could be a little irritating for those who like to go all-digital these days.", "date": "April 25, 2017", "grade": "A"}