{"name": "Steins;Gate 0", "ref": "https://gaming-age.com/2017/04/steinsgate-0-review-ps4/", "text": "The first Steins;Gate game is widely seen as one of the greatest visual novels of all time. Pretty much everyone who played it raved about the characters, the plot, the themes  you name it, someone, somewhere probably thought it was praiseworthy.Iwasnt a fan. It wasnt that I hated the game as a whole so much as I found main character Rintaro Okabe to excruciatingly obnoxious. It had some fine ideas, but I felt they were weighed down by the fact that you had to read about those ideas through the filter of a boorish, misanthropic jerk.Steins;Gate 0 is, if anything, even more widely praised. And, naturally, Im even less of a fan of this game than I was of the original.My problem, not too surprisingly, is pretty much the same as it was the first time around: Rintaro Okabe is still unbearable. In fact, if anything hes even more unpleasant now, since the tragedy that befell him in one of the first games endings has given his personality an annoying emo tinge on top of the misanthropy. Much like last time, the net effect when hes narrating is that youre hearing a fantastic story through the most grating filter imaginable.Luckily, somewhere along the line someone realized that they didnt need to follow the first games formula all that strictly, and that they had more characters through which they could tell their story that Okabe. Consequently, this means you get a look at the story from a few different perspectives, all of which are far less obnoxious than what you experience through Okabe, and all of which make the games exploration of time travel and A.I. much more compelling.Or, at least, itll be compelling to people who loved the world of the original Steins;Gate and are desperate for more. If you dont have that background, then Steins;Gate 0 will seem mostly incomprehensible to you. It makes the occasional half-hearted stab at explaining what youre reading, but for the most part, this story is all about moving things forward. Not only that, it does so through the kind of massive info dumps that tend to typify some visual novels  and your mileage will undoubtedly vary in terms of how much you like that sort of thing.", "date": "April 20, 2017", "grade": "B-"}