{"name": "Seagate (SSD) Game Drive for Xbox One impressions", "ref": "https://gaming-age.com/2017/04/seagate-ssd-game-drive-xbox-one-impressions/", "text": "Hard drive space has become such an important value to gamers this current generation. Games are increasing in size each day with better graphics that can sometimes take a decent amount of time to load. There is always the gamer that needs the space due to having a large library of physical and digital games (me), and gamers that want the best possible performance out if their consoles HDD.Thankfully Seagate has been there for Xbox One gamers for the last couple of years with 2TB and 4TB external HDDs that were even themed for certain games like Gears of war 4 and Halo Wars 2. These drives were made with the gamer in mind and simply provided that extra storage that the internal drive couldnt fulfill. What I liked was how the Gears of War 4 drive came with DLC for the game which was a nice touch.But what about the gamers that compete online or simply want their games to load faster and have an overall better performance? Seagate quietly came to the rescue on this front as well this past holiday with their external Solid State Drive. This is a drive that comes at a cost both financially and storage wise.For those unfamiliar with the difference between standard HDDs and SSDs, here is a simple comparison for the two types:Seagate Game Drive for Xbox HDD  Up to 4TB capacity lets you store 100+ Xbox One games. Load games at a similar speed as your internal drive.Seagate Game Drive for Xbox SSD  Load games faster and transition quicker between levels. (Up to 25% faster. Games vary.) Store 15+ games and more downloadable content.In the world of PC gaming, HDDs are one of the most important components to a gamers PC. Without a high performing drive, everything suffers on the performance side, not just games. The same can be said for the Xbox One and the Game drive. The model that Seagate released is 512GB, which as most know, isnt a whole lotta space. Essentially youre doubling the storage that came with the console.This is where preference comes into play. This drive isnt for the causal gamer. Its for the hardcore performance nuts that play a small amount of games and need them to play as best as possible. For games like Call of Duty, and Overwatch, every second counts. This drive Is great for those gamers because they will get the reduced load times and level/menu transitions they have always wanted.My time with the Drive was mostly used for Dead Rising 4 since they were released around the same time. I may not be the Hardcore gamer that plays online and needs quick load times, but who doesnt want their game to work better? Dead Rising 4 is a game with a lot going on at once. Between the thousands of zombies, to the large open world map, the load times could be a drag.When I initially began playing, I spent the first couple of hours with the game installed on my Seagate Gears of War external, which as I said works as well as the internal, which is full. Once I setup the SSD drive, I reinstalled the game to it and immediately saw a drastic improvement on the install. There was close to a 15% increase in download/install speed.", "date": "April 19, 2017", "grade": null}