{"name": "Orcs Must Die: Unchained", "ref": "https://gaming-age.com/2017/04/orcs-must-die-unchained-review-pc/", "text": "Let me preface this review by saying that I was not a long time Orcs Must Die player prior to my chance to play Unchained. I had the opportunity to go out to Robot Entertainment and play Unchained for a full day prior to its launch, and have spent the better part of the week since my return playing the beta, because thats how hooked I am. I will freely admit that Orcs Must Die: Unchained (Hereafter referred to as OMD:U) was not on my radar prior to this review, so I was going into this as close to blind as I could be. I remember playing the original OMB back in the day, but couldnt tell you a thing about it. After really getting into Unchained however, I cant help but feel regret for not having the chance to get into it more in its previous iterations. OMD:U is fantastic! I have never played a game where you can actually see and feel the passion that the development team has for their game and gaming as a whole more than this one, and it pays off.OMD:U takes the basic approach to tower defense games, adds in a deeply thought out action element with a splash of MOBA ideology and mixes it all together to devastating effect. Most games that try to balance that many elements run the risk of losing their identity, but OMD:U knows exactly what it is. You play as a hero with one central goal, kill orcs. Well, orcs, giants, goblins and anything else the game throws at you. This is done a number of ways, from traps and environmental hazards to your personal weapons and hero abilities. Each level finds you defending a rift from the rampaging hordes of enemies, either by yourself or with friends. Enemies scale based on how many players you have, so difficulty is consistent regardless of how many people you have with you.The best word I can use to describe OMD:U is fun. There is no part of this game that feels like a chore, or the typical grind you get from other similar titles. The prologue is full of wise-cracks and humor while also managing to teach you literally everything you need to have a grasp on to be successful. The starting hero that you play this with is a balanced, ranged character. There are two main classes of character, ranged and melee. Each plays different and has deep subsets that you can really get into with time. Healers, tanks, DPS and CC are all viable play options, you just have to learn the heroes and figure out who fits where. OMD:U will launch with 16 playable heroes, three of which are available for free right away.If that last sentence gave you pause, I completely understand. For those that dont know, OMD:U is a free to play game. That has become a very contentious phrase among gamers in the last few years, and for good reason. For every hidden gem in the free to play genre there are 99 examples of why it sucks and is designed to take advantage of the compulsive gamblers and gamers that dont know how to manage their funds. I personally have a bad taste and a good bit of bad will toward a lot of free to play games and the micro-transactions that inevitably accompany them. OMD:U however is the true exception. In all of my time with this game thus far, I have at no point felt the need to spend my money to progress the game. Everything that can be purchased that relates to gameplay is able to be unlocked through gameplay. The only thing I will spend money on are vanity items that I choose to purchase because I think they look cool and feel almost like I am enjoying the game so much that I owe it to the developers to spend some money.The guys at Robot said something interesting, and I am paraphrasing, but the general idea was to be generous, care about your players and your fans, and let the success follow. Make this a game that everyone can truly play and be successful at for free and offer fun, cool things for purchase to make it financially viable after you take care of your players. These are all gamers, these are all passionate people who care about YOU and the experience you are able to have playing their game. This is evident in every bit of OMD:U. No company keeps a game in beta for as long as they have without caring. They could have released a short beta, listened to feedback and launched right after that but they didnt. They have tweaked certain things and drastically changed others, all in the name of making a great game, which they succeeded at. This is not a freemium game. This is a great game that just happens to cost nothing to play.Lets talk about content and game modes. OMD:U consists of two main modes, Survival and Sabotage. Survival is your basic mode, able to be played in single player or in three player co-op. If you are familiar with any other Orcs Must Die games, this will be familiar to you. The three player co-op is what really makes OMD:Us take on this mode unique and enjoyable. Coordination among teammates to pull off a near perfect defense is an absolute highlight of this mode, and of the game in general. Difficulty increases with your level and with the number of players, so it is always a challenge, but also always fair.Sabotage is where OMD:U really makes a new name for itself. This is a unique mode where you and two other players work to defend your rift from the enemy, same as survival, but now another team of three is actively trying to aid the orcs in getting through your portal. While they are doing this however, you are also trying to aid their orcs through. Confused yet? I was at first too, but soon came to understand and really enjoy this mode. Each team is on their own map, and you never actually see your opponent. At the beginning of each round you draw your consumable cards, which are the cards you use to hinder the other team. This can range from a wave of orcs to a mana drain spell that cripples your opponent temporarily. Learning how and when to use these consumables means the difference between success and failure in Sabotage. This mode manages to stay both competitive and fun, even when I was losing I was thoroughly enjoying myself. At no point did I feel the competition outweigh the enjoyment, and I am usually the most competitive person around. OMD:U manages to make you feel like a winner, whether your team actually wins or not.", "date": "April 18, 2017", "grade": "A"}