{"name": "The Disney Afternoon Collection", "ref": "https://gaming-age.com/2017/04/disney-afternoon-collection-review-ps4-xbox-one/", "text": "I miss a simpler time, watching afternoon cartoons and not having to worry about work and bills. For those of you like me, who miss these simpler times, The Disney Afternoon Collection is here for your nostalgic needs. Capcom put together this unexpected collection and I must say, its a pleasant surprise. Capcom rereleasing games is all too common, except these rereleases are games that havent been released since their original availability for the NES. Included in this set are six classic games from the 8 bit era and theyre all based off 90s Disney cartoons; Darkwing Duck (when theres trouble you call DW!), Rescue Rangers 1 & 2 (Ch-Ch-Ch-Chip n Dale), DuckTales 1 & 2 (its a duckblur), and Tale Spin (OHHHHH E-AAAAA). If you cant already tell, I was and still am a big fan of these shows.Digital Eclipse (who also developed the Mega Man Legacy Collection) put together a nice set with the Disney Afternoon Collection. Like I said earlier, these games coming out in 2017 as a compilation is a real nice surprise. I havent played these games, besides DuckTales, since they were originally released for the NES. Like many rereleases of classic games, this set includes a few different presentation styles (like original, full and wide) and even some filters (like for old tube TVs and monitors). It also features save states and a really cool rewind feature. These classic NES games are old shoe leather tough and the rewind feature is a welcome addition that lets you rewind gameplay (that was tough to figure out). Playing through these games for the first time since I was a child and being able to rewind stressful moments make for a far less stressful experience than I recall from my childhood. Now I know that the rewind feature might seem like blasphemy to some gamers, but to them I say; you dont have to use it and Im playing these games for the nostalgia and to enjoy them (enjoyment being the key).Also, they included a few new modes. Each game features a Time Attack and Boss Rush Mode, which are all pretty self explanatory (speed run and continuous boss fights). We also have the expected music and visual galleries (Disney Museum) for each game. While expected, its something I particularly enjoy, as the 8 bit versions of music from the cartoons are some of my favorite tunes from that era. The visuals also goes a bit above and beyond to include advertisements, character art and the usual concept art. While I wish there was a few more titles included in the collection, I dont hold it too much against them, since these games are being rereleased for the first time (unlike the constant Mega Man rereleases).", "date": "April 18, 2017", "grade": "B+"}