{"name": "I Am Setsuna", "ref": "https://gaming-age.com/2017/04/i-am-setsuna-review-nintendo-switch/", "text": "We have a review for the PS4/PC version of I Am Setsuna, and you can read that here. While the Nintendo Swtich version is no different content or gameplay-wise, we thought we would do a second review from another perspective. The premise of Setsuna being a sacrifice, and her journey to give her life in order to stave off the monsters that plague the world is well covered. So lets get right into it.As an RPG fan, it warms my heart to see games like I Am Setsuna being made. The art style is timeless. Simultaneously, it looks new, yet doesnt feel the need (or have the budget and team size) to push the envelope on the graphics. Not all RPGs need to look like Final Fantasy XV with monster budgets. A good art style goes a long way. With that in mind, Setsuna is a perfect fit for the Switch on the go. Its moderate in length (20ish hours) and visuals are perfect on the small screen. I was thankful it was there at launch.There is a good and bad to the classic feel of Setsuna. I love turn based games, and I still feel like so much can be done within those confines without having to move to an action-based, real-time RPG. Unfortunately, while the Chrono Trigger combat is ripe with nostalgia, it feels a bit tired and boring for me in 2017. There are two systems added to try and spice up the combat, but neither succeeds. One is Singularity, which changes the state of the battlefield (such as increased ATB gauge speed), but these are a non-factor as they are completely random. I dont think I even saw Singularities more than a couple dozen times the entire game. The other is Momemtum and their associated Flux. While Momentum is a staple in combat, it becomes as rudimentary as Attack. Flux just felt like an afterthought.The Flux system seems like a great idea, but it was executed poorly. The skills in Setsuna are equippable in items called Spritenite. Flux is an additive buff that can be unlocked on a Spritenite, giving the skill extra power, such as more damage or increased chance to crit. There are a few issues with the way it was implemented. First, in order to even have the possibility of a Flux occurring, you need to equip an accessory. These accessories are limited in which Flux they can unlock. Managing the accessories to open up different flux possibilities seemed like a waste of time to me. This is in part due to the fact that Flux feels inconsequential. Never in the battles did I feel like, wow, that crit Flux totally saved me. Lastly, Flux has a chance to randomly unlock when you use Momentum. Theres no fanfare though. If you recall in a game like Front Mission 3, when a new skill randomly unlocked on a mech part, it felt like a big deal. In Setsuna, it just mentions that a Flux unlocked in the post battle screen. Taking all that into account, I didnt even pay attention to Flux for the second half of the game, and I ended up fine.The story and writing in Setsuna is what kept me going, as I wasnt very invested in the combat, and thats ok. Its a somber tale for sure, perhaps too much so. I grew attached to the characters though, which is important. The twists along the way elicited true surprise. The world felt a bit small considering the scope of the events taking place, but they did a great job keeping me off balance with what was truly the source of heartache in this world, or as you would say in Buffy, the Big Bad. The mystery and desire to know kept on to the very end of the game, and therein lies my biggest issue. Without spoiling anything, the end disappointed me greatly. Everything was in line, well told, and set up for a fantastic ending, only to have something completely quirky and out of place happen, which ruined my overall experience of the game. No doubt about it, Setsuna wants to pull your heartstrings, almost to a fault. The game is just depressing. Its almost sad just for the sake of being sad.", "date": "April 11, 2017", "grade": "B-"}