{"name": "This is the Police", "ref": "https://gaming-age.com/2017/04/this-is-the-police-review-xbox-one-ps4-pc/", "text": "As a prologue to this review, I would like to make sure that gamers are aware that This is the Police is an incredibly story-heavy and driven game. You will be watching cutscenes in a comic book style at the beginning/end of almost every day and these cutscenes can be rather lengthy but can be paused if you were to need to leave and care about not missing where the story is going. It should also be noted that you are able to skip individual dialogue lines in cutscenes, meaning that if you read faster than they talk, these cutscenes can go by much faster. Anyhow, onto the actual review.In This is the Police, you play as Jack Boyd  a long-term Police Chief stuck in the middle of a town riddled with corruption. At the beginning of the game, Jack is given the news that today is the day that the Mayor is forcing him into an early retirement. He is given 180 days until his job is finished, and he will be forced to hand it down to his successor. The beginning of those 180 days is where you come in. You will assume his role and hold your police force together for those 180 days when you will finally be able to retire.The actual gameplay boils down to managing your two shifts of officers  alternating between each shift every other day, and responding to incidents happening in town by sending what you feel is an appropriate number of officers to respond without any injuries occurring. A good portion of these incidents will be dealt with without your intervention, but some of them require your input on decisions that will end the situation in one of a few ways. For example, I had a situation where a few ladies were fighting and I had to choose whether my officers would step in between them and break it up, or use a taser to pacify the more violent woman.What is unfortunate about these events in which you get a choice is that most of them are laid out as A) make the sensible choice, B) make the abuse of power choice, or C) make an incredibly stupid choice. I dont think I had any of these events give me a decision that I didnt immediately know the answer to. For reference, I think the last choice on the fighting women was to pull a gun and fire a warning shot.In fact, this is where the game kind of falls apart. In what should be one of the best aspects of the game  the choices  they decided to make many of them extremely obvious or downright pointless. There is a point very early on where you are asked to support the mafia or stay in the role of your character and refuse. The problem with these choices that seem like they should have an effect on the story is that most of them just seem to have a scripted pathing that leads to the same result no matter what you chose. Did you choose not to support the mafia? Well looks like youre joining anyway after your hand is forced.There are a good number of other ways that choices just dont seem to matter much even outside the storyline choices. At maybe 3 days in, you are given a notice that a racist gang is taking over the city, and demanding that you fire all of your black police officers. The mayor hears their requests and demand that you immediately do as they ask. Doing this will lose a large chunk of your default officer lineup, so I decided against it despite it being a primary objective. At the deadline for the task, I was fined a minuscule amount of money and didnt receive much in the way of other consequences. It feels strange that they have tasks that are seemingly so politically charged that end with you receiving a slap on the wrist.", "date": "April 10, 2017", "grade": "B-"}