{"name": "Superdimension Neptune VS Sega Hard Girls", "ref": "https://gaming-age.com/2017/04/superdimension-neptune-vs-sega-hard-girls-review-ps-vita/", "text": "Ill be honest: I barely have any idea what happened in Superdimension Neptune VS Sega Hard Girls. I mean, I played it, and I have a rough idea of how the story starts off, but if you were to ask me for details about any of it beyond that Id quickly be at a loss for words.In my defense, its not exactly the easiest game to explain. The Hyperdimension Neptunia series is pretty impenetrable at the best of times unless you have an encyclopedic knowledge of everything to do with video games, and I say that as someone whos played, by my count, eight games from the franchise. This time out, makers Idea Factory decided theyd up the impenetrability factor by adding in Sega Hard Girls, a team of girls who, per Wikipedia, apparently occupy the same what if gaming consoles were also people? space that describes the Hyperdimension Neptunia universe, but with that line of thinking only applied (as you might guess from their name) to Segas home and handheld consoles.Now, is knowing everything there is to know about the Genesis, Game Gear and Dreamcast a prerequisite for playing Superdimension Neptune VS Sega Hard Girls? As is the case with the other Hyperdimension Neptunia games, definitely not (good thing for me, since I was a staunch Nintendo kid growing up). But it will certainly help you get some of the more arcane and obscure references. Moreover, Superdimension Neptune has the same approach to characters and tutorials as the other games in the series, which is to say: theres more characters (many of whom look pretty identical) here than youll be able remember, and theyll overload you with information on screen after screen after screen.Unfortunately, Superdimension Neptune VS Sega Hard Girls resembles mainline Hyperdimension Neptunia games in more than just this respect. I say unfortunately because in general, my rule of thumb when it comes to the series has been that the mainline games are generically bland JRPGs, while the spin-offs  with their attempts to bring in outside influences as diverse as pop idol manager simulators and Dynasty Warriors  are the ones worth playing. Superdimension Neptune may look at first glance like its part of the spin-offs (and I suppose from a canon perspective, it is) but in execution this is as mainline as these games get.Which is to say: it features lots and lots of grinding through turn-based battles in dungeons, with a goal of leveling up your characters to get them ready for even more turn-based battles and even more dungeons. It doesnt do anything new, but it does falter in one area where the other games succeeded: gone are the enemies who double as instantly recognizable nods to gaming history, replaced by baddies who just look bizarre (who, to be fair, may be references to Sega games and memes of which Im simply not aware).", "date": "April 7, 2017", "grade": "C+"}