{"name": "PaRappa the Rapper: Remastered", "ref": "https://gaming-age.com/2017/04/parappa-rapper-remastered-review-ps4/", "text": "Has it really been 20 years since PaRappa the Rapper debuted on the original PlayStation? It certainly doesnt feel like it, but this odd and unique fan-favorite hit North America around the tail end of 1997, and if you ask most people for their opinions on their favorite music games from that time, Id imagine PaRappa the Rapper is at the top of those lists. Its a damn near perfect combination of quirky hip-hop beats juxtaposed with unique and stylistic visuals that hooks into you with the opening lyrics from Chop Chop Master Onion, and never really lets go. And thankfully, that remains true even today, with this newly remastered version of the game for PlayStation 4. Theres a pretty clear difference in both visual quality and audio quality when comparing PaRappa the Rapper: Remastered to its PS1 or PSP releases. Sony has done a really great job of sprucing up this version of the game, and most importantly the timing of player inputs doesnt seem to be impacted by weird latency issues or other problems. PaRappa plays and sounds just like I remembered, which is a huge plus for any rhythm game remaster. The short, animated cutscenes are about the only thing that doesnt shine brightly here. I imagine theres only so much they can do with the source material for those bits, but they do look a little rough by modern standards. Also, there were some small edits that had to be made to early dialogue, references to trademarked words that had to be removed completely. Its a minor edit overall, but noticeable when you first encounter it.Along with the enhanced sound and video, the game incorporates two control/play options that are newer. One is a Feel the Beat mode, wherein the DualShock 4 will vibrate in line with the beat to help you time your button presses more accurately. Theres also a See the Beat option, which highlights the player input on-screen in a more significant way, allowing you to understand when and where your timing is off. Considering PaRappa does have some unforgiving input windows, I think both options should help newcomers a bit more. My only real complaint here is that I wish there were more, or any, supplemental materials accompanying the game. For a 20th anniversary release, it feels like Sony could have really blown this one out a bit more, with behind-the-scenes content, concept art, vignettesor anything really. PaRappa the Rapper: Remastered deserves a bit more than what Sony gives it here, and thats certainly disappointing for this fan of the original.", "date": "April 3, 2017", "grade": "B+"}