{"name": "Effie", "ref": "https://gaming-age.com/2019/08/effie-review-for-ps4/", "text": "Ive been wracking my brain to come up with something  anything  to say about Effie, and Im about ready to admit defeat. Its a fairly unremarkable 3D platformer that doesnt stand out in any way, for better or for worse.To be sure, being merely average isnt the worst thing in the world. Having played all kinds of broken and lousy platformers, the fact Effie simply works is certainly a moderate accomplishment.But thats about all that you can say for it. The platforming is nothing special, and theres nothing about any of the levels that sets them apart in any particular way. The game is bright-looking and pleasant to look at, but, again, theres nothing here visually that makes Effie distinctive. Theres a forgettable story, with the only distinguishing feature that theres a narrator who occasionally makes a snide comment (though those lose their impact when youve heard the same one for the dozenth or so time). The combat is pretty generic, and doesnt require anything in the way of finesse  one heavy attack, one light attack, and you can swat away nearly every enemy save for the bosses simply by mashing the buttons until youve beaten them all.If theres anywhere where Effie stands out one way or another, its in those boss fights. See, thats where the game suddenly decides to challenge you, after mostly failing to do so for the rest of every level. The difficulty spikes verge on the unfair, with enemies suddenly becoming much tougher and the environments themselves suddenly becoming much more deadly. Given how easy the rest of the game is, it makes for a pretty jarring contrast.Not enough of a contrast to make Effie interesting, though. If youre a 3D platforming addict who needs a fill right now and youve played everything else, it may be enough to fill the time, but otherwise, it feels like there are plenty of other games you could be playing instead.", "date": "August 27, 2019", "grade": "B-"}