{"name": "The Last of Us Part I", "ref": "https://gaming-age.com/2022/08/the-last-of-us-part-1-review-for-ps5/", "text": "Im maybe one of the few players that picked up the 1st The Last of Us Remastered for PS4 (our review here) and didnt even play it. This could be the main reason for my genuine excitement to revisit the lives of Ellie and Joel from a new perspective on a modern console platform. I mean this is of course literally from a technical and visual remaster standpoint, but also as a father, in which I was not one at the time of the original release.I think many will feel the most important aspect of this review is if the suggested retail price of $69.99 is justified for this The Last of Us Part I, as there seems to have been a major divide in this leading to the release so I will tell my side based on my time with it.The original The Last of Us game, now almost 10 years old, was a truly memorable experience for me simply from a storytelling perspective. Yes, the gameplay was fresh and worked well with a blend of action, stealth, and crafting, but as much as I enjoyed my time with the original there was not much replay value for me.Despite having a multiplayer component, at the time I didnt try it as I wasnt a fan of playing online. For this release, this feature is not included so we are focusing on the single player experience. For anyone looking for our initial review for the original PS3 release, you can read it here.The first thing I will speak about is why the game will always leave a mental imprint on me. Minor Spoilers if you are someone experiencing this game. The death of Sarah in the introduction when the outbreak happens was a gut-wrencher and I remember first experiencing that scene. This was just the beginning of the rollercoaster of emotions Neil Druckmann and his team would bring to the forefront.Now take that, and now experience it as a parent of a six-year-old, and Im in a glass case of emotions, and this alone is a point to revisit The Last of US Part I. This is the type of story that can have a different emotional impact and is worth retelling and revisiting, and on top of that you get the game rebuilt from the ground up which will be met with various expectations.For me, visually this remake helped give me the desire to go back to Part II after the PS5 patch that was added to improve the visuals and framerate. This also had me question why we didnt see a full fledged PS5 upgraded release but now have one for Part I. I bring this up because, at first glance, the sequel looks better between the framerate and lighting.This is not to discredit the work done with Part I, but I encourage to set your expectations appropriately. The Last of Us Part I is a fantastic version of a beloved release and in the world of constant remasters and remakes, every developer approaches it differently. Here, it looks like the visuals and mechanics have indeed been improved and the inclusion of the haptic feedback with the Dual Sense is a nice addition when using different weapons respectively.As a single player game that has been released now for the third time, I feel many know what to expect from the gameplay mechanics, so I wont spend too much time on this as it has not changed much since the initial release. The controls were always solid and the balance between intense action and tense stealth against human and clickers alike is once again faithful to the source code.During my 15 hours playing through the main campaign and finally experiencing the previous released DLC Left Behind, the presentation is best experienced with the lights down and volume up or headphones on. The atmosphere works its best when you are truly immersed in the game. Of course $70 is a lot of money for any game and it is not new in the industry for this generation, so it really comes down to the type of game you want to play. Single player will always be my favorite game experience and when you can play one with an amazing story, I find myself double and sometimes triple dipping in revisiting. (Hell, I have played just about every iteration of Resident Evil 4 and that has been released in the double digits)The last thing I will speak about is the character models, and this is something that not all games of this caliber get right. Naughty Dog has always been able to perfectly capture the emotions the actors bring to life and having the chance to see these characters with updated models is refreshing. In many cases, its hard to step back to a older game from a previous generation when you are spoiled with the latest release such as The Last of Us Part II. To be able to go back to the original The Last of Us with a very close visual retelling to the top notch sequel is nothing short of magnificent.", "date": "August 31, 2022", "grade": "A"}