{"name": "Slain: Back from Hell", "ref": "https://gaming-age.com/2017/02/slain-back-hell-review-ps-vita-ps4-xbox-one/", "text": "Its not hard to tell what Slain was going for: an ultra-hard, extremely gory platformer that owes an equal amount of debt to Castlevania and Ghosts n Goblins. That it ends up being more or less that is commendable, considering how many games have a gap between ambition and execution.Unfortunately, thats about all thats commendable about Slain, since even if it succeeds at being what it wants to be, the fact is there are lots of other games that aim for the exact same spot, and where the finished product is a lot more interesting and enjoyable. Volgarr the Viking is just one recent example that springs to mind when I think of really fun, ultra-hard, ultra-hard platformers, and Im quite certain that its not the first to cover that particular terrain.So where does Slain fall short? In a lot of the same ways that it did when it first came out on PC, basically. Its a combat-heavy game where the combat isnt very good, which means that in the one area where it needs to excel, it doesnt. The weapons feel bulky, the attacks feel awkward, and slashing your way through countless horrors is never as fun as it should be.In part, of course, this is because of the games ridiculous difficulty. I get that Slain doesnt want to go easy on players, but its designers seem to have forgotten that its possible for a game to be simultaneously unforgiving and enjoyable. Just take the aforementioned Volgarr the Viking, for example: its enemies are relentless and it makes you sweat for even the tiniest of advances, but it never feels unfair. In Slain, by contrast, everything feels unfair: the seemingly random difficulty spikes, the overpowered enemies, the underpowered weapons. Its possible for a game to be incredibly difficult but still totally balanced, and Slain never seems to figure that out.The one thing it has figured out, though, is what it wants to be. Slain lathers on the gore with gusto, and everything is covered in a heavy layer of blood and guts. On top of that, its got a very loud soundtrack that seems like it was tailor-made to score blood splatters and exploding bodies.", "date": "February 13, 2017", "grade": "C"}