{"name": "Air Race Speed", "ref": "https://gaming-age.com/2017/02/air-race-speed-review-ps-vita/", "text": "There was a moment during the Nintendo Switch reveal, in the midst of one of its hype reels for upcoming games, when people briefly went crazy over the possibility of F-Zero being reborn on Nintendos new hybrid console. It was quickly revealed to be an entirely different futuristic racing he game called Redout, but it made plain just how many gamers pine for the rebirth of the now decades-old franchise.All those people need to buy a Vita and check out Air Race Speed ASAP, because if its not quite F-Zero reborn, its still the next best thing.To be sure, its not a 1:1 comparison. Theres no multiplayer aspect to Air Race Speed, for one thing, which means that if youre going to enjoy it  and you will  youll have to do so solo. In fact, theres not any mode to the game other than time trials, so the Race part of the title requires a little imagination on the part of the player.Beyond that, though, if youre looking for a futuristic racer thatll get your pulse pounding, Air Race Speed will do the trick. The vehicles are sleek little spaceships that extremely handle well, the courses are challenging without being impossible, and the whole time trial/star rating thing means that, particularly on the Vita, it lends itself perfectly to replayability. In isolation, each of these things would be great; taken together, they make for a genuinely fun game.Its all helped, of course, by the fact it looks phenomenal. Given how tricky some of these courses are, Air Race Speed would be sunk if the graphics couldnt keep up with the gameplay. Impressively, not only do they keep up, everything looks amazing in the process. Even as the world is flashing by you, theres never a hiccup or a glitch: it looks crystal clear, and ensures that even if youre pushing your ship to the limit, youll never be faced with a hangup that causes you to crash into a previously unseen object.", "date": "February 6, 2017", "grade": "A"}