{"name": "Blossom Tales II: The Minotaur Prince", "ref": "https://gaming-age.com/2022/08/blossom-tales-ii-the-minotaur-prince-review-for-nintendo-switch-pc/", "text": "It would be really easy to look at Blossom Tales II: The Minotaur Prince and call it a clone of a clone. After all, its not all that different from the first Blossom Tales, which itself wasnt all that different from the original Legend of Zelda games. Theres not a lot of originality going on here, gameplay-wise.As accurate as that would be, though, it would also be oversimplifying things. While the gameplay isnt anything new, Blossom Tales II is still brimming with personality. Much like the first game, youre guiding Lily the Knight through a bright world, full of colourful enemies and interesting environments. Also like the first game, the story here is framed by a grandfather telling his granddaughter a bedtime story, which means you get plenty of interjections, while the addition of a grandson into the frame story means more asides and debates over how the story should unfold  which, in turn, means you get to change details here and there when the kids are in disagreement.That said, while Blossom Tales II has some personality of its own, if youre looking for originality, look elsewhere. If you want to imagine a world where games stopped evolving past 1993 and Links Awakening, this is how that world would look. If youve ever played any top-down RPG from the last 30+ years, youll know exactly what to expect here. Whats more, not even the plot is immune to a bit of obvious borrowing: theres heavy echoes of Labyrinth, given that the games plot kicks into motion when the games heroine wishes her brother would get taken away by the Goblin King Minotaur Prince.But even if Blossom Tales isnt all that original, that doesnt make it any less fun. The world is fun to explore, the puzzles are fun to solve, and the story is engaging and enjoyable. It may not make you forget its obvious influences, but at the very least, it does right by them, and tries its best to live up to their sterling reputations.", "date": "August 29, 2022", "grade": "B"}