{"name": "Bethesda Pinball", "ref": "https://gaming-age.com/2017/01/bethesda-pinball-review-ps-vita-ps4-xbox-one/", "text": "I ignored Zen Pinball 2 and its (many, many) tables for the longest time. Part of it was because of that parenthetical aside in the last sentence; with so many different tables, I had no idea where to begin. Part was because of a lack of interest  and truthfully, lack of skill  in pinball generally. Part was a bad experience with one of Zen Studios forays into non-pinball games. Basically, I had all kinds of reasons for never even giving the game a chance.And then the Bethesda Pinball tables showed upand, well, Im wondering what other tables to play, because Im kicking myself for having missed out on everything so far.Whats odd is that Id never considered myself a huge fan of any of the Bethesda titles included here. Sure, I have respect and admiration for the likes of DOOM, Fallout, and Skyrim, and Ive spent my fair share of time with each, but I wouldnt put them anywhere near a list of my most favourite franchises. And yet, it seems that when you add pinball to the mix, I suddenly love everything about them.Take Skyrim pinball, for example. Were talking about a table that successfully incorporates dragons! Like, fully animated dragons, that swoop in and set the table on fire! If youre been playing other Zen Pinball tables all along that may not seem like the most impressive thing, but for a newcomer like me, thats not the kind of thing Id ever expect out of these games. That Zen Studios were able to include those in a table in a way that seems completely natural says a lot about how well its done here.The same goes for DOOM and Fallout. The latter includes some neat vault missions, plus the opportunity to buy goods and services in a way that seems both true to the games and true to what youd expect out of a pinball game. Likewise, DOOM has all the trappings of that iconic FPS, but somehow translated over to pinball. Its not the kind of thing that makes much sense when you read it, but when you play it, it all comes together in a pretty amazing way.", "date": "January 9, 2017", "grade": "A"}