{"name": "Final Fantasy XV", "ref": "https://gaming-age.com/2017/01/final-fantasy-xv-review-ps4-xbox-one/", "text": "I have always looked forward to new Final Fantasy releases. Since the release of Final Fantasy IV on SNES, Ive been in love with the series. And for the most part, that love has been pretty well rewarded with a number of great entries. That said, I wasnt sure what to expect with Final Fantasy XV. Considering that this game was originally not meant to be the next numbered Final Fantasy, and that it has taken a number of years to get off the ground, it seemed like the poster child of troubled development. So I was willing to keep my expectations in check, something that doesnt happen very often for me when it comes to this series.With that I mind, Ive come away from Final Fantasy XV feeling pretty good about the whole thing. Theres issues when it comes to pacing, story, and plot, but by and large actually playing the game has been an enjoyable experience. The battle system is certainly unique, focused primarily on action with a dodge/parry mechanic for defense. Its not easily comparable to any other Final Fantasy title out there, and while the game does feature a wait timer, I honestly only ever found that useful for the built in Libra scanning effect that it offered. My only real complaint with the combat system stems from the god-awful camera, especially in dense foliage or tight hallways. And I wish the magic system was just a tad more traditional. Being locked into Fire/Ice/Lightning spells for the majority of the game is a little too restrictive.The general look of Final Fantasy XV is pretty great as well. The open-world setting is well realized, with plenty of areas of to explore, optional dungeons, lots of towns and NPCs, and a decent variety of monsters to fight. This is one area where the development team really took the complaints about Final Fantasy XIII to heart. Yes, FF XIII did open up in the late-game areas, but with Final Fantasy XV the open-world is more or less available from the start. Youll be locked out of certain zones until the story progresses, but even then, theres really no shortage of space to explore.I do have a handful of complaints about the open-world setting. Most NPC related side-quests are pretty repetitive. Youll be gathering up supplies or killing enemies for the most part, which isnt unusual for the genre. But the number of missions that revolved around heading to a spot on the map, and then looking within a circular area for a small, glistening item managed to get old pretty quick. The frog lady quests in particular were a huge annoyance, culminating in a final side quest thats virtually impossible to complete without some sort of guide. These types of missions become a bit of a chore early on, and unfortunately theres far too many of them.Visually Final Fantasy XVs open-world is really striking, featuring large open plains, volcanic mountains, dense forests, and a handful of indoor environments to explore. Theres some solid draw distance on a standard PS4, and while the game does chug at points, it ran a bit better than I expected it to. I think the art design, particularly when it comes to monsters, is pretty good. Enough so that I really wish the game featured some sort of catalogue or bestiary to look over some of the designs a bit more. My only real complaint on the visual side is how bland your group of four heroes are, especially compared to the villains. Foes like Aranea are decked out with cool looking armor yet youre stuck with some bog standard leather pants and jacket get-up that only changes a bit towards the tail end of the game. It just came off a little bland to me, especially since youre stuck looking at these four dudes for 30 plus hours.As far as story goes, I think the initial idea the game presents, of a prince on a road trip with his best buds to join his soon-to-be bride for their wedding, is fairly well realized in the opening hours. Of course the story twists and turns a lot in a short amount of time, and becomes more of a revenge tale as the game progresses, but being let loose in an open world, having access to a vehicle and long-winding roads, and the ability to set-up camp throughout the outdoors locations helps sell that sense of exploration and journey set-up by the story. And this doesnt really start to fall apart until the last few chapters of the game, which feature some friendly fallout amongst the group, a tiring section that strips away most skills, and some ultra lame Eidolon boss battles that arent nearly as cool as the developers thought. I dont think all of the backend of the game is bad, but I can certainly understand why the fanbase has been pretty vocal in their distaste for it.", "date": "January 8, 2017", "grade": "B"}