{"name": "100ft Robot Golf", "ref": "https://gaming-age.com/2016/12/100ft-robot-golf-review-ps4/", "text": "As a golf game, perhaps the best thing that could be said about 100ft Robot Golf is that its an interesting anime game. And as an anime-inspired game, the best that can be said about is that its an interesting golf game. I dont have PlayStation VR so I cant comment on the games translation to virtual reality, but if the vanilla PS4 version of the game is anything to go by, I imagine its got to be gaudy and pretty nausea-inducing.In other words, 100ft Robot Golf tries to be many things, but I dont know that it really succeeds at any of them.I mean, it doesnt fail at any of them, either. It has moments of fun on both sides of the anime and golf equation. On the latter point, it has a much more intuitive driving and putting system than most other golf games in recent years, and thats despite (or maybe because of) the fact its constantly switching up the mechanics and trying new things. You dont need to worry too much about annoying little things like lies and inclines, which means that its well-suited to casual play. Also, its pretty fun to smash every building that gets in the way of your shots. Its a little less satisfying to use your rockets and bombs, since those dont seem to do much, but hey: youre imitating Godzilla and working on your golf game at the same time, so thats got to count for something. Itd probably count for a little more if it didnt start feeling repetitive so early on, but points for inventiveness, if not necessarily execution.The same goes for the games anime aspects. 100ft Robot Golfs plot is pretty unique, to say the least: a group of people trying to resurrect the titular sport of giant robots playing golf, and doing so by going around the world and recruiting the sports former superstars. I cant say the story drew me in, but then again, neither do most stories  at least this one had the advantage of making me stop every so often to say, Waitwhat? And if nothing else, this game deserves kudos for making one of those former robot golf superstars a team of five adorable corgis who come together, Voltron-style, to form one great robot golfer.I also have to give credit to the games announcers: they have a gift for snark. Like the golfing, some of the lines get a little old after you start hearing them several times, but on that first go-around, youre pretty much guaranteed to at least smirk, if not outright laugh.", "date": "December 15, 2016", "grade": "B"}