{"name": "Exist Archive: The Other Side of the Sky", "ref": "https://gaming-age.com/2016/11/exist-archive-side-sky-review-ps4-ps-vita/", "text": "Even though I wouldnt consider myself a fan of JRPGs or dungeon crawlers, because Im such a dedicated handheld gamer Ive played my fair share of both. As such, I can say this for Exist Archive: The Other Side of the Sky: I genuinely appreciate that it tries to be different from most other games of its ilk that Ive played.I wouldnt necessarily say that means its good. It has some flaws, which Ill get to shortly. I also wouldnt say that its totally original, since Ive read quite a few comparisons to Valkyrie Profile, which unfortunately Ive never played. But compared to so many other blandly forgettable dungeon crawlers, Exist Archive clearly makes an effort to set itself apart.Take, for example, the fact that it covers its dungeon crawling in a heavy layer of Metroidvania-style platforming. In a genre where the viewpoints of choice are either top-down or first-person, side-scrolling feels like a breath of fresh air. I know other games have done it, but not enough that this still doesnt feel like a departure from genre norms.As a consequence of the different perspective, Exist Archive is free to impress in other ways, too. Most obviously, exploration feels different, since you have a little more freedom to move around and look in different directions than you do in a top-down or first-person world. On top of that, this game looks a lot nicer than most other dungeon crawlers Ive seen; perhaps because these dungeons look like theyre set outdoors, you get more brightness and colour than youd see in a dingy underground space.The combat is a little different, too. Yes, its still turn-based, but you can change what youre doing during a turn on the fly. You can switch between characters and attacks in an instant, and the game keeps you involved during guard phases by allowing you to block attacks with a timely button press.Of course, while switching up your attacks and blocking may be fun the first several times, as you settle into a rhythm and get into battle after battle, it starts feeling a little repetitive. In fact, this is just one of many areas where the game feels repetitive: while the Metroidvania-esque nature of Exist Archive opens it up in some ways, it also means that youll have to get used to doing a heck of a lot of backtracking as you keep going back to the same places over and over again to try to reach new areas.", "date": "November 14, 2016", "grade": "B+"}