{"name": "ZyXEL Armor Z2 Wireless Router", "ref": "https://gaming-age.com/2016/11/zyxel-armor-z2-review/", "text": "I need to preface this review with the fact that this is my first time reviewing a router. Not only is it my first time reviewing one, but generally we dont do too many hardware reviews at Gaming Age. I think its fair to tell you now that this review/impressions isnt going to have crazy tech specs and speed comparisons, thats just not my style (or Gaming Ages style). The Armor Z2 is a brand new router thats built with gaming and streaming in mind. You would think that in the internet world we live in now, all new routers would be built with either or both of those functions in mind, but that isnt the case. All routers arent created equal and hopefully this review will help steer you one way or another with the Armor Z2.Currently in my house I have Verizon FIOS internet, cable, and telephone. We also, within the past 6 months, upgraded to their new service called Quantum. We are supposed to get 100mb download and upload speeds with our current plan. Before I drag this out anymore, the Verizon router that is required when you upgrade to Quantum is an utter piece of stinky, months old, decomposed garbage (not the word I wanted to really use). In the short time that weve had Quantum weve already had to have the router replaced and the current one isnt working much better than the first one. The problem with FIOS is, if you want the channel guide and on demand features on your cable, you need to use the router that Verizon supplies. So if you dont use their cable service, you can use any router you would like (if the technician set up the service properly). This is a long way around saying that the Armor Z2 had to be plugged into my existing router to keep the Verizon features I needed on my cable.Straight from unboxing Armor Z2 I noticed a couple cool features on the tech sheet. The Armor Z2 has a couple apps that you can download for your iOS or Android devices. One app is used as a set up for the router. I know that most wireless printers have similar apps and that the Apple Airport devices do as well, but I dont know how common this is among other routers. This is a nice feature for a streamlined set up, except for the fact that I couldnt get the app to find the router (a little more on that later). The other app is a Photo Backup app, with this app you can attach an external storage to the router via USB port and then the app will back up the photos from your device to the external storage. Plugging in a decent sized hard drive and you would probably be good for years. This is a great option as most people dont bother syncing their photos over to a computer very often and this can also help free up some space on your phone after the photos have been backed up.The Armor Z2 features 11ac MU-MIMO which is 802.11ac with some fancy streaming technology. ZyXEL says that the chipset included in the Armor Z2 will prioritize speed based off of what is being used, even if you have many devices connected to the network. I took this as; say 5 people in your house are using the wifi, 4 of those people are on their computers browsing Facebook and e-mail, while 1 person is streaming Netflix on their PS4 The router will designate more speed to the person streaming the Netflix so the stream should be flawless and buffer-free.Upon hooking up the router, I downloaded the setup app like I mentioned earlier. I unfortunately couldnt get the app to find the router (which I attempted a handful of times), but there is a setup website that is listed on the instructions and the router. The set up site was quick and painless; within minutes Armor Z2 was hooked up and ready to go. After using the router for a few weeks I have noticed much better reliability than my FIOS router. I should mention that the Armor Z2 is located on the second floor in my house, while we primarily use the wifi signal down in the basement. For my own experiment, I had my Amazon Fire TV hooked up to my FIOS wireless network and my XBOX One hooked up to the Armor Z2 wireless. I witnessed much less buffering and better picture quality with the Armor Z2 streaming Hulu and Netflix. Downloading games over the wifi also had better results, but it was only slightly better.", "date": "November 14, 2016", "grade": null}