{"name": "MyCharge HubMax Portable Charger", "ref": "https://gaming-age.com/2016/11/mycharge-hubmax-portable-charger-review/", "text": "As a video game journalist, it sometimes becomes a challenge to power manage all the electronic devices we carry. Being on the go at trade shows, conventions and even press events, leaves your mobile devices in peril. Besides the usual phone, tablet and audio/video equipment, I also carry my 3DS along with two to three portable chargers. Yes, I said two to three portable chargers. The reason is because most standard chargers will give you one to two charges, but only one device at a time.This simply didnt work for me, especially with New York Comic last month. I needed something that would be able to charge multiple devices and at a faster rate if at all possible. Thankfully the company MyCharge reached out to me. During the initial launch of Pokmon GO, people were going mad over the game using their phone battery primarily for it. This is where the need for portable chargers surged in the marketplace.For me, it was worthwhile on both ends, as I was playing Pokmon GO on my daily work commute and still needed my battery for the day to day use. MyCharge offers a variety of models for different types of users. They are part of the HUB series and offer four models starting with the mini all the way to the Ultra. The mini is more in line with size and design of a traditional portable charger. The biggest perk from the entire series is its dual cables that are integrated into the charger.One cable is lightning and one is micro USB which are the two primarily used cables on mobile devices. MyCharge asked me to try out of the models and I felt with everything I carry and do, that the Max would be the best fit. The HubMax boasts up to 6x extra battery with Hyper Charge capabilities, up to 65% faster than competitors. These specs seemed too good to be true, so I had to try for myself. Over the last couple of months, Ive used the HubMax at press events, conventions and trade shows.One of the best uses for me was when I covered Call of Duty XP back in Sept. COD XP allowed me to really test out the full capabilities of the charger. This was one of the first events that I had multiple video recording devices. I had GoPro Session with all the bells and whistles and my iPhone, which I use for Live Streams. The battery on both were sure to be recharged at least once each day.At one point, I recorded two Live Streams and some first person Zombie Laser tag footage that ended up being too dark to release. Low and behold it was time to recharge both devices. My friend and I took a break and watched the COD tournament as we charged our equipment. Im used to relying on a portable charger to get me maybe 20% higher in battery in the short time I usually have to sit and wait. With the HubMax, my devices were 20% more charged in half the time that I would usually wait which was astounding.Another plus to the HubMax is its built in power outlet prongs that fold in when not in use. This reduces at least two extra cables that you would normally have to carry. One of the only drawbacks to the beefed up model is its size. For me, I dont mind carrying a larger device, knowing that it reduces clutter in my bag and easier device management when charging. The entire trip for COD XP was three days for me and I was able to recharge my equipment numerous times each day and not once did I need to recharge the HubMax.I had the same excellent experience during NYCC which was also three days. The device actually holds a charge for an extensive amount of time, which is great for people that use it in similar scenarios as I do. When you use it on occasion, it tends to stay in a bag. Thankfully, I recharged after each event was over so when the next time to use it was needed, the HubMax was ready to go. Again, with four models to choose from, there is a device for everyone. With me being a power user, the higher tier is easily the best recommendation. The price points are from $49.99-$149.99 and are well worth the prices.See below for detailed specs and link to purchase.https://mycharge.com/collections/hub-seriesUp to 6x extra batteryIntegratedApple Lightning cableIntegrated micro-USB cableBuilt-in USB portSmart-sense: ensures complete device compatibilityHyper-charge: ultra-fast charging of your devices; up to 65% faster thancompetitorsPower-stay: maintains battery power for up to 1 yearMax-power: maximum power transfer from powerbankto deviceHigh-density battery: the smallest and lightest powerbankSafe-cell: provides the highest level of battery safetyRapid-recharge: powerbank recharges up to 50% faster than competitorsPass Through Charging: will charge the powerbank and connected device simultaneouslyBattery:10050mAh Lithium IonProduct Dimensions:4.6 in x 2.8 in x 0.9 inProduct Weight:1.19 lbs.Output:3.4A sharedChargerCharging Dock", "date": "November 11, 2016", "grade": null}