{"name": "Rock Band Rivals", "ref": "https://gaming-age.com/2016/11/rock-band-rivals-review-xbox-one-ps4/", "text": "The release of Rock Band 4 last fall signified the resurrection of the music genre. Conveniently, Rock Band wasnt the only instrument driven game released at the time; Guitar Hero also made its return to market. The music genre seemed dead from over-saturation when we last saw them and I think it was also in part a fad. So here we are in the Fall of 2016 and a year has passed since the music genre was brought back to life and it didnt quite go as either company planned. Both games had lackluster releases but if I had to pick a clear winner, I would go with Rock Band 4 and the Rivals expansion just shows that Im right in some way. You see, Guitar Hero Live support looks to be dead and non existent, while Harmonix is still supporting Rock Band with a full fledged expansion and new music still being released weekly.Rock Bands DLC model has kept me loyal to their releases. Allowing you to carry over your song purchases across each new iteration is an awesome feature and it gives you an immediate library of songs when you purchase a new title. The amount of songs you purchase will decide how big or small your library is. I was disappointed to find that the release of Rivals didnt include any new songs (preordering the expansion digitally did get you some additional tracks). Selling an expansion at a price point of $29.99 set my expectation at getting some new music to rock out to. Once I settled down from the lack of new tracks, I had a blast with Rock Band Rivals.Rivals introduces a brand new career style mode called Rockudrama. Rock Band never took any real chances with the career modes that were featured in their previous releases. Typically you would play individual songs, then sets of songs that were either custom or preset and you would progress around a map of some sort. Rivals keeps that general format of playing but the real fun happens between the songs. Rockudrama is basically a VH1 Behind the Music for your created player and band, with FMV clips between playing the actual game. Its set up like youre watching the TV show and has all the corny and campy feelings you would expect if you ever watched some of those old VH1 specials. I found myself enjoying the video packages more than playing through some of the set lists (if I had some new music to play with, I might not have felt this way). After playing Rockudrama, Im going to have a hard time going back to any of those other boring career modes of the past music genre games.Also included is the new Rivals mode (clearly there had to be a reason why they named the expansion Rivals). In this mode you set up a group of players and go against other groups of players. Your scores and stats determine the outcome. Now this isnt live multiplayer but rather it calculates your scores and calculates them together with your group and matches those results up with your opponent. This mode didnt do much for me, but I should preface this by saying that none of my friends still play Rock Band and if I had some friends that still played, this mode might interest me more. For someone like me, head to head multiplayer makes more sense, but sadly its not hereyet. Rivals will include multiplayer it just wasnt ready for release. The multiplayer will get patched into the game sometime in December, so you dont have to wait too long (Ill be accepting challenges of We Didnt Start the Fire once it launches).", "date": "November 8, 2016", "grade": "B"}