{"name": "Lego Dimensions  Year 2 unboxing and impressions (part 1)", "ref": "https://gaming-age.com/2016/11/lego-dimensions-year-2-unboxing-impressions-part-1/", "text": "Lego Dimensions  Year 2 takes a very different approach to the annual Toys to Life genre release format. You see, Lego Dimensions second year of sets doesnt require a whole new game and/or starter kit. Using the original starter pack is all thats necessary (and a good amount of storage for the update patch and playset downloads). Im glad Warner Bros. decided to stick with this strategy and continue to build off of one game rather than going with annual releases. The Adventure World selection area (Vorton) now has an expanded area called The Shard. The Shard features all the new Adventure Worlds for Year 2, which happens to include some sets I dont recall official announcements for (Beetlejuice!!). Along with the Shard is a second terminal that pops up next to the original portal; this is where you select the new levels from the story packs and level packs. Finally there are all new Battle Arenas where you can have your minifigures clash.Overall Year 2 so far is more of the same, with expanded franchises that most wouldnt have predicted. Like most Lego titles, you pretty much know what youre in for when you pick one up. So if you enjoyed the original content of Lego Dimensions, youre more than likely going to get a kick out of the new stuff. I do question the release schedule of some sets and how these waves are set up. Wave 1 includes; Ghostbusters 2016 story pack, Mission Impossible level pack, Adventure Time level and team pack, Harry Potter team pack and finally, A-Team fun pack. I assume Warner Bros. was expecting the new Ghostbusters to be a bigger hit than it ended up being, and thats why they went with launching that as their first story expansion. Its to be seen if that strategy worked out, but in my opinion waiting on the second story pack; Fantastic Beasts and Where to Find Them, would have been a better set to lead off with. We shall see how that set sells when its released in a few weeks, we all know the Muggles love their wizards. Outside of that set we also have; Gremlins, Goonies, The Lego Batman Movie, Teen Titans, Beetlejuice (which I mentioned earlier) Sonic the Hedgehog, and a few more. I would have preferred to not have two Adventure Time releases in the first wave, but that could also have to do with my excitement for the sets that arent yet released (and the fact Im not a big fan of Adventure Time).Anyway, I did a short unboxing of a couple of sets the good folks at Warner Bros. sent over to me. I show the mini figures, talk a little about the game, and then theres a time lapse build of the Ghostbuster set that goes onto the portal. Check it out, let us know what you think and hopefully well be back with some more impressions and unboxings when the next wave is released.", "date": "November 4, 2016", "grade": null}