{"name": "Pendula Swing  The Complete Journey", "ref": "https://gaming-age.com/2022/08/pendula-swing-the-complete-journey-review-for-nintendo-switch-pc/", "text": "Its hard to know where to begin describing Pendula Swing. You could start, I guess, with the basics: that its a story about a dwarf hero named Brialynne whos on a quest to retrieve her stolen axe.But that leaves out a whole bunch. Like the games setting, for starters: its not just a game about mythical creatures like dwarves, orcs, and goblins, its also set in an alternate universe version of the 1920s, which means that along the way, Brialynne also runs into flappers singing jazz in speakeasies and people doing the Charleston.On top of that, Pendula Swing also has a lot to say about bigotry, the downsides of industrialization, and all kinds of other social and societal problems. Brialynne isnt just a dwarf hero of legend who slay a mythical beast, shes also a long-widowed lesbian who misses her lost love, who has to confront the fact that her heroism isnt viewed as all that heroic by some of the more downtrodden groups in this alternate universe, and who has to deal with her own racism towards goblins.And, on top of that, it doesnt take long before you discover that Pendula Swing isnt actually about retrieving that stolen axe, its actually lots and lots and lots of sidequests. Brialynne has to talk to every single person she meets in order to find out everything about them, which invariably includes a problem they need her to solve, whether its helping someone find a mechanic, relaying a message to a young activist that her parent wants her home for dinner, or delivering a barrel of illicit alcohol. The more you play the more sidequests there are, which means youll have to exhaust every dialogue option and interact with every single object in order to make sure you dont miss anything.There are two problems with all that, though. One is only a problem if youre an obsessive who likes to finish 100% of a game: thats impossible in Pendula Swing. As the game notes during loading screens, its impossible to get 100%, since helping with some tasks means forgoing others. As someone whos rarely ever cared to be that much of a completionist, that doesnt bother me, but Im sure itd be an issue for some.The bigger issue, though, is that Pendula Swing features some of the worst controls Ive ever experienced. It bills itself as a point-and-click adventure, except theres nothing to point with  theres no on-screen cursor you move around to highlight different people and objects. Instead, theoretically, youre just supposed to move Brialynne around until shes near an object, but in practice, its completely random. You spend a massive amount of time in this game walking around, looking for the one small spot that will allow you to pick the object youre aiming for. Want to go in that door? Then walk four steps in the opposite direction, so that you can pick it while facing away. Want to talk to that person? Walk in a few circles around them, and keep an eye out for the split-second where you can select them rather than, say, the person next to them, or the random, unrelated object somewhere near them.The controls are so bad, in fact, that they outweigh whatever good or interesting or intriguing things Pendula Swing may be trying to do here. Theres a lot going on, and there are all kinds of ideas, but the only way to experience any of it is by dealing with constant frustration, and in the end it doesnt seem worth it.", "date": "August 23, 2022", "grade": "C-"}