{"name": "A Bastards Tale", "ref": "https://gaming-age.com/2016/10/bastards-tale-review-ps4/", "text": "On paper, A Bastards Tale hits all the right notes for what I like in games. Its pixelated, its hard, its medieval, and its unique. It is not, however, a good game. When I first read about it, I was excited. It seemed like it would be a good fit for me and something right up my alley, but upon actually playing the game I was sorely disappointed. The biggest positive I can give here is the art style. The pixelated graphics and extensive backdrops are a throwback to an entirely different era of gaming. A Bastards Tale is a fitting homage to that era with each of its five unique levels that are all vastly different from one another in both look and feel.A Bastards Tale is an old school hack and slash that tries to make a name for itself simply by being difficult and using that to mask the lack of true content or depth. The repeated deaths stretch twenty minutes of gameplay across two hours of frustration. My quarrel with the game is not so much that it is hard, but it is with HOW it is hard. Hard games are my bread and butter when done correctly, this is hard mostly due to poor mechanics, atrocious hit boxes and difficult to decipher enemy movements. Combat is theoretically simple, enemies can swing from the left, right or above and you have to block accordingly using directional buttons. Your attacks are the same and the enemies must also block in the same manner. This would be clever if you were able to see where those attacks are coming from (which half the time is impossible) and if the hit boxes were programmed appropriately. One minute you may be putting a hurt on your enemies with some well timed swings, the next you are completing the same swings and whiffing on thin air.These mechanics make A Bastards Tale so frustrating that it becomes difficult to play. There is a large variety of enemies throughout the game, but instead of looking at each like a new challenge to learn and overcome, you go in hoping your luck holds long enough to defeat each one. From starter enemies like farmers and cows to end game enemies like black knights and sorcerers, death comes often and unfairly. The game keeps a count of your failures for you and displays them often enough that you see the numbers in your sleep. Again, please dont misunderstand. I love difficult video games, but there is a large difference between good and bad difficult.A Bastards Tale has a redeeming price tag however, coming in at $4.99. This is less than some phone apps you can purchase and certainly a reasonable price for two hours of time. People flock to movie theatres to get matinee pricing that doesnt beat that. However you must weigh whether or not you will enjoy that two hours, regardless of how much money it costs you to do so. To me, there just isnt enough content and whats there isnt enjoyable enough to justify spending $0.99, much less spending $5.", "date": "October 27, 2016", "grade": "D"}