{"name": "Rez Infinite", "ref": "https://gaming-age.com/2016/10/rez-infinite-review-psvr-ps4/", "text": "Rez has been around for quite a long time, especially in video game years. It began as a game on the Dreamcast and PlayStation 2 way back in 2001. Simply looking at screenshots or even watching a video doesnt do the game justice. In fact, it can be downright confusing to try and understand whats being presented on the screen unless youre the one holding the controller. Thats the beauty of this game: its an experience like no other.At its core, Rez Infinite is an on-rails shooting game. If youve played the Panzer Dragoon games back on the Sega Saturn youll have an idea of what to expect. The player must move around a cursor on-screen to highlight enemies and shoot them down. Up to eight enemies can be targeted at once for full offensive fury, and youll want to make good use of targeting multiple objects at once to increase your score and to clear the screen of hostiles. All of this shooting is set to a pulsing soundtrack that corresponds to your actions. Its very rhythmic and if youre strapped into the PlayStation VR (PSVR) helmet with a good set of headphones its easy to get lost in its psychedelic game world.Rez Infinite can be played on the TV as well as with the PSVR, so if you havent yet jumped into the virtual reality space you can still enjoy the frantic action. However, it must be noted that theres nothing quite like playing the game fully immersed with the world all around you. With the headset on you can look in all directions and it feels like youre inside some alien computer code program. While the game is controlled with the DualShock 4 controller, highlighting the enemies with the analog stick, as you become accustomed to the camera and the VR setting, it becomes second nature to target enemies just by moving your head and looking at them. In fact, there is a setting that you can turn on called dynamic mode that allows for even faster movement while moving your head that will totally give you an edge over any other control input. For some this might be a bit too jarring and maybe even cause some dizziness, but I found it just fine and my preferred way of playing. The game supports a Move controller as well, which feels more natural than the analog sticks on the normal controller.Graphically the game is surreal with somewhat simplistic looking enemies and backgrounds. The game runs at a smooth frame rate, even in VR, and everything has a blistering pace to it. The game combines strange and colorful backgrounds with Tron-like grids and shapes to create something completely unique. Its not designed to win you over with super detailed textures, and in fact in many ways it looks like it did back in 2001. This isnt necessarily a negative though as the visual aesthetic works great for this type of game.If youve already played the original Rez or the HD version that came out then youre not going to get much new here. Most of this game will be familiar, but there is a new mode called Area X that takes the game off-rails and allows you to fly anywhere you want in the environment. This is an all-new experience and as such the graphics look slightly better and the game is even more intense than ever before. This mode automatically opens after youve played the game for an hour and I can see it being one of the main draws for people who have already experienced Rez in the past.", "date": "October 27, 2016", "grade": "B+"}