{"name": "PlayStation VR", "ref": "https://gaming-age.com/2016/10/playstation-vr-review-compilation/", "text": "With the large amount of PlayStation VRlaunch titles, I only have so much time to dive into each. In this unique review compilation, I will speak about a couple of different VR games/experiences that may or may not be worth checking out.Until Dawn was one of my favorite games in 2015. This isnt the same game I played, but an appropriate change in genre while still keeping some of what made Until Dawn memorable for me. In Until Dawn: Rush of Blood, you are riding a Dark Ride with no end in sight. What starts out as harmless target practice as you get acquainted with the controls, quickly turns into an eerie nightmare right out of a Frightfest movie. There are some decent jump scares and the environment changes often even within the first level.This is one of the better sit down experiences I have had during my time with the PSVR. One word of advice. Make sure your headphones are on correctly. I made the mistake of wearing them in reverse so the scares were even more intense as the zombie clowns I thought were to my right appeared super close to my left.If you have ever been to Disney World and rode the Toy Story Mania ride, this is like that, but for horror enthusiasts. There are evil clowns, and even the killer from the Until Dawn game makes an appearance. Its an excellent budget title for the PSVR and available both physically and digitally. This is a game I recommend to play in short sessions because you can gain some discomfort after a while.Worth checking out: Yes. A very competent rail shooter with efficient jump scares.Motion Sickness: Mild after long sessions.Ace Banana took me back to when the original Wii came out. The motion controls were all the rave and every developer was designing games surrounding the motion controls. Ace Banana is one of those titles. Visually, feels a bit like a tech demo, but plays more like a game that belongs in a compilation of mini games that focus on the VR and Motion Controls. Youre an archer that shoots plungers at monkeys trying to steal your bananas. Pretty simple premise.You have three different levels on the stage that you can warp to with the press of a button. The monkeys come in waves and all shapes and sizes. Some are armored and some are faster than others. As you use the Move Controls as your bow and Plunger, you take the monkeys out and sometimes are even awarded power ups like garlic that floats right in your face but helps keep the monkeys away because, well lets face it, you stink. Eventually after you clear enough waves, you will encounter a boss fight. Not an easy task. Its a fun game with an appropriate price point. This is a great game to have your kids 12 and older try out. Available Digital only.Worth checking out: Yes. A good use of the move controls and PSVR.Motion Sickness: None during my time.This was a game I spent a little bit of time with during my Vive hardware review. It was easily my favorite title for the Vive. Brookhaven is a survival horror themed shooter that heavily relies on the full 360 degree capabilities of VR. The issue with the PSVR port is due to only having the front facing camera, when you turn around and your body covers the move control sensors, you lose your weapons on screen. This seems to be a growing concern with games that rely on you making full 360 movements.Brookhaven is a standing VR game/experience and the premise is pretty straight forward. You need to fight off hordes of zombies and monsters coming from all around you. This is a game I highly recommend to play with an Oculus or Vive to get a better immersed experience. I didnt play too much of the PSVR version due to the camera consistently losing the tracking of the motion controls for me. Just like most VR games, the experience will vary and this is the case with Brookhaven Experiment.On the plus side, on the PSVR version, there is a button that will allow you to turn 180 degrees. Its better than nothing to be honest. The extra sensor for the Vive really makes the tracking much better, and its tough to fully enjoy the game when it worked better on a different VR headset. I hope to get some more time in and see if I can work around the turning around issues. Available digital only.Worth checking out: Worth it for the priceMotion Sickness: None during my time.Job Simulator is another game that I was able to play around with when I reviewed the Vive. And just like Brookhaven Experiment, this is a 360 degree Standing VR game/experience. It suffers from the same issue asTBE, where you could benefit from a 2nd camera/sensor to track the move controllers when turning around. The benefit of Job Simulator vs Brookhaven is you can play mostly within a 180 degree standing radius.Something that drew me to Job Simulator was the types of jobs you can perform. You can work in a convenience store behind the counter and find something accessible in just about every square inch of your counter. Open the drawers and pull out lottery tickets, grab a coin and scratch them to see if you won. You may want to pay for them first lol. I found it a ton of fun to simply throw stuff at your robotic boss because lets face it. Why wouldnt you?There are three other jobs you can do including working in a cubicle which is a bit too familiar. What is great about Job Simulator is how much thought went into what is actually interactive. If you can think about doing it, chances are, you can do it. You do get tasks to actually complete at each job like helping customers, but why would you do that when you can just burn, throw, eat, and just play with everything at your job. Sounds like a win/win to me.Worth checking out: A bit pricey, but I would suggest to check it out.Motion Sickness: None during my time.So far from what I have played on the PSVR, a couple of titles have given me either discomfort or borderline nausea. Do to the symptoms Ive encountered, Im unsure I will be able to properly review them.Driveclub VRYou would think, playing a game that is virtual driving would be the last game to get you sick. From what I have read online, it seems to be the majority of people have had some form of discomfort playing Driveclub. At first, doing a time trial was my way of easing myself into the game based on reports of almost immediate sickness from gamers and fellow editors on other media sites.At first, everything seemed perfectly fine. I was driving at a slow speed to get my self acquainted with the environment. Then, I hit the gas and increased my speed. So far, so good. Finally, I revved into a higher gear and here came the discomfort. I cant fully explain the feeling that I experienced, but it wasnt pleasant. What ended up making it worse was the turns. Remember you are racing at high speed so maybe its because when you turn in the game, your body isnt going with it. Sadly. this happened every time I attempted to play and Imunsure it will get any better for me.Here They LieThis was a game I was looking forward to since its somewhat themed with a horror mindset. The 20 minutes I played consistent of simply walking through a train from car to car with different trippy visuals appearing on the screen which was the beginning of my descent into Nauseaville. Once the crazy visuals stopped, you do some more walking inside what looks like a train depot finding clues about the story which I wasnt able to follow due to being disoriented.", "date": "October 25, 2016", "grade": "A"}