{"name": "Battlezone", "ref": "https://gaming-age.com/2016/10/battlezone-review-psvr/", "text": "If World of Tanks is any indication, theres a big enough fan base for tank warfare games to warrant a game like Battlezone. Whats uncertain is whether or not that same audience will make the jump to PlayStation VR (PSVR) and purchase this title, one of the only games priced at a full $59.99. Normally I dont mention pricing in my reviews, but if youre going to charge more than any other game on the system, I expect there to be reasons to support this decision. Unfortunately for Battlezone, I had way more fun with some of the considerably lower priced games (Batman VR and Rez Infinite say hello).My first-ever experience with PSVR was playing a demo for Battlezone at a GameStop event. I liked what I played and was excited to play the final game. Upon booting up the retail version I was immediately struck by the bareness of the main menu. It looked like something from a PC game circa 1995. Normally games these days will walk you through a tutorial and have an introduction to the game. Instead youre presented with some different gameplay modes with little to no explanation of what youre in for. In my case, I was interested in playing the solo campaign. Knowing little of the game before jumping in, I was surprised to learn that the campaign isnt comprised of well thought out story-based missions, but rather a rogue-like level structure where things can change every time you play. Some players out there will love this decision, but I prefer my games to have detailed level design and implementation. I dont care for the idea that the levels I play could be different from someone elses experience.Starting Battlezone is a visual treat and an immersive one at that. You actually feel like youre sitting inside a tank and you can look all around your environment. Look down to view your radar screen and looking left and right will show more data, like your weapons that are equipped, mission status, and ammo in reserve. Look up to actually see the guns of your tank overhead. Once you launch out of the home base youll be in an arena level that looks like something ripped right out of the movie Tron. The graphics have a neon look to them that is quite appreciable, especially in VR. I really dig the futuristic and somewhat simplistic aesthetic provided by the games engine. In some ways the graphics remind me of older games, like Cybermorph on the Atari Jaguar (now, thats a callback!), except of course much more refined all these years later. I really have no problems with the visual presentation, and I think most people will enjoy the immersive worlds that have been created.Battlezone quickly ramps up in difficulty as the game progresses. There are different nodes that you can choose on a map to play next, each slightly randomized. You will gain upgrades to your tank to decimate foes more efficiently, but man they seem to scale up even faster and the game quickly becomes super challenging. In some ways it feels like its a modern day version of its arcade roots  a quarter muncher at heart that wants nothing more than to deal fast punishment to get more of your money. The thing is, you already spent good money on the game, and even on the easier difficulty levels you can find yourself hanging on by a thread in no time flat. I feel this is a direct result of the randomized levels and enemy placement. If the games levels were individually designed with better care taken to provide a fair challenge it wouldnt become so frustrating so quickly. Its a shame, because the underlying gameplay mechanics and the immersive visuals are so inviting, but the uneven challenge level prevents me from coming back as often as Id like.Some of this difficulty can be absorbed if you have friends that also own the game and play the campaign co-op. Up to four players can venture forth and take on the brutal enemy hordes. The game does slightly scale up with more players, so its not exactly a walk in the park, but it does seem more palatable with others having your back. Having said that, some missions can really drag on for a lengthy amount of time as the computer-controlled enemies can be downright vicious. Also, after playing for even a short time the combat becomes rather repetitive and the mechanics of the game just arent that fun, no matter if youre playing with others or solo. With a game like Destiny, the social component really adds to the experience because the underlying gameplay is rock-solid and enjoyable. The same cant be said for this game.", "date": "October 24, 2016", "grade": "C"}