{"name": "Batman: Arkham VR", "ref": "https://gaming-age.com/2016/10/batman-arkham-vr-review-psvr/", "text": "Lets cut to the chase. Batman: Arkham VRisnt atraditional game. Its a Virtual Reality experience with more control of the environment than most experience releases for the PlayStation VR. Is that a bad thing? Thanks to Rocksteady, I dont think so. Sold both physically and digitally for $19.99, its well worth the investment to get a real appreciation for a proper VR experience. This title alone has helped persuade friends that were skeptical of VR.The play through is fairly short, if you simply follow the main objective, which is to solve the murder of your former sidekick, Nightwing. The reason that Arkham VR works well is for numerous reasons. One being that traversing the locations such as the Batcave, and the streets of Gotham utilize a warping mechanic. What this does is shows you locations on the screen where you can move to with the press of a button. This reduces the somewhat expected discomfort and/or nausea that may occur with other games that allow you to control the characters movements freely.Arkham VR is one of those experiences where its really worth taking your time and enjoying the nooks and crannies hidden all around the areas. Theres also a good amount of repay value in the form of Riddler challenges once you complete the main objectives. Even before you unlock these challenges, there is a ton to find within Wayne Manor and the Batcave that arent needed to progress the story. For me, one of the best parts of the entire experience was being able to put on the bat suit and test some of the bat gadgets, like the grappling hook, which is used to traverse further distances.In the Batcave, theres a target practice area where you can throw batarangs and the mechanic works well. For the most part, its auto targeted with the assistance of some head tracking. Another nice touch is the little Easter eggs hidden around the cave for the hardcore Batman fans. They vary from simple architecture within the cave to a video showing Batmans 2nd Robin, Jason Todds final moments. As a Batman fan, you can appreciate the emersion through the eyes of the Dark Knight.The story ends abruptly, which is disappointing. At the same time, how much should you expect from a $20 title? The scenes you experience while progressing the story are top notch and were a perfect fit for a VR title. At one point, youre in a morgue and have to use one of our gadgets to scan bodies for shrapnel from an explosion at the Penguins hideout. These mechanics also work extremely well with the move controllers, which to be honest, is the best way to experience Arkham VR.Just remember to properly calibrate your location and headset to get the best field of view. Fellow editor, Paul, came by to try it and we didnt fully calibrate the headset location, which caused everything to appear extremely close to him, causing some minor discomfort. All in all, this so far has been one of my favorite PSVR titles and hope more companies take note.", "date": "October 24, 2016", "grade": "A"}