{"name": "Severed Steel", "ref": "https://gaming-age.com/2022/08/severed-steel-review-for-nintendo-switch-playstation-xbox/", "text": "Its hard not to feel sorry for the developers of Severed Steel. They put a few years into their project, they clearly put a tonne of effort into making a fun, stylish first-person shooterand then had the misfortune to release it just a few weeks after Neon White, which is an even more fun, even more stylish first-person shooter. Id like to be able to say that Severed Steel is secretly the better game, but thats just not true: pretty much everything Severed Steel does, Neon White does better. And where Neon White comparisons dont apply, then Severed Steel doesnt quite match up with Superhot either, which is the other games big influence.Take, the example, the fact that Severed Steel is broken up into a couple of dozen micro-levels, where the goal is to get to the exit as quickly as possible. Theyre generally okay, if a little indistinct  and that lack of personality becomes even more pronounced when you look at the way Neon White wraps a full-on story around its bite-sized levels.Likewise, traversal here is fine, but you never get the feeling like youre defying gravity the way you do in Neon White. The jumps in Severed Steel dont feel as high, the dives and dashes feel a little too wild, and the shooting never feels very precise. Its certainly fun to dive and kick and shoot your way through waves of enemies, but its easy to see how they couldve improved upon it.Even the time-slowing mechanic feels like its been done better elsewhere. You definitely feel cool watching time slow down around you as you slide across the ground, but if you compare it to the way a game like Superhot did it  or Max Payne, if you want to go a little further back  suddenly it seems a lot less impressive.None of this means, of course, that Severed Steel is a bad game, or even a mediocre one. Taken in isolation, its undeniably fun to slide and dash around levels, shooting up bad guys, grabbing their guns as they fly into the air, and spinning around to continue your rampage.But Severed Steel doesnt exist in a vacuum. It exists in a world where Neon White (to say nothing of Max Payne and Superhot) not only also exist, but are much, much better options if you want this kind of gameplay. With competition like that, Severed Steel doesnt quite match up.", "date": "August 19, 2022", "grade": "B-"}