{"name": "Mystery Chronicles: One Way Heroics", "ref": "https://gaming-age.com/2016/10/mystery-chronicles-one-way-heroics-review-ps-vita-ps4/", "text": "I like to think of Mystery Chronicles: One Way Heroics as an endless runner masquerading as an RPG. After all, the games core mechanic is that youre going as fast as you can in one direction, trying to outrun the end of the world, and the game ultimately measures how successful you were by looking at how far you went. If thats not the essence of endless runners, I dont know what is.Im simplifying things, of course. The major difference is that here you have some small degree of choice as to how directly you travel in that one direction: while the Shine Raid  that aforementioned end of the world, which is literally just a wall of light  is moving towards you relentlessly from one side of the screen, its up to you whether you just want to boot it in one direction, or if you want to stop and search for loot, battle enemies, and visit the tiny little kingdoms that pop up here and there. On top of that, the easiest mode does have an endpoint  you reach 400km, you beat the fallen angel Alma, and thats it.Theres also a bit of resource management at play here, as you can carry over a finite number of items from one playthrough to the next. Likewise, your personal stats dont reset every time you start a new game, so you can gradually get stronger with each run.On this latter point, however, the fact you can carry things over (be they stats or items) points to how much One Way Heroics wants you to play it over and over again. You can also see that in the roguelike nature of the game, and the promise youll never play the same path twice in a row.Personally, I dont see the appeal. The combat is incredibly shallow (which, admittedly, makes sense, since youve always got to keep that relentless Shine Raid in mind). Managing resources isnt all that fun, since you know youre going to lose most of them at the end of your current run. The worlds  particularly in the early stages  are empty, which doesnt just mean that youre looking at the same dull environments over and over, its also a challenge to take on tougher monsters as you get further and further in.I feel like even the games designers were aware of One Way Heroics shortcomings. After all, why else include cameos with characters from Shiren the Wanderer or Danganronpa? Theyre fun little Easter Eggs, sure, but it seems like they also make it easy to overlook this games lack of interesting content.", "date": "October 19, 2016", "grade": "C-"}