{"name": "Skylanders Imaginators", "ref": "https://gaming-age.com/2016/10/skylanders-imaginators-review-ps4-xbox-one/", "text": "Toys to Life might be a genre on life support, but dont tell Activision that. This years annual Skylanders release is Imaginators. Every incarnation of Skylanders seems to have some gimmick and this year is no exception. Imaginators introduces the ability to create your very own Skylanders. The creation of your own Skylanders is something that I feel could have been introduced already, but it was worth the wait. Thats a really cool feature and Im going to speak more in depth on it later in the review, but Im really burying the lead. Skylanders Imaginators signifies the return of Crash Bandicoot!!! and Dr. Neo Cortex tags along as well.Right from the surprise announcement at e3 that Crash would be joining Skylanders, I was sold. You see Ive been waiting for a new Crash Bandicoot game for more than 10 years. Those Crash titles before the recent hiatus, arent true Crash games in my opinion, so his reemergence has been a long time coming for me. Even though its not a true Crash Bandicoot game, its definitely a step in the right direction. In 2017 we will see remasters from the ground up of the original Crash trilogy and based on how well that sells along with the Crash edition of Skylanders, we should expect to see a brand new Crash Bandicoot title (#CrashBandicoot2020 hopefully it doesnt take that long, but this was my hashtag creation from the beginning of this year, prior to all the announcements).Not every version the Skylanders Imaginators includes Crash Bandicoot and Dr. Cortex. At launch theres a Crash edition that is exclusive to the Sony platforms, which makes logical sense to me, since Crash was the first Playstation mascot before being sold and going multi-platform. Crash and Cortez arent the only special Crash Bandicoot items in the game, youre also treated to a special Crash Bandicoot level once you use either Crash character on your Skylander portal. The level is very reminiscent of the original Crash games and hit a few different nostalgic notes with me. Its not all sunshine and tiki masks though. I have to mention Crashs voice, which sounded to me like the ridiculous gibberish voice that Adam Sandler made in Billy Madison. I couldnt go without thinking of it every single time Crash said anything.Regardless of the voice style they chose for Crash, Activision took a great strategy with this years Skylanders. The game features the same formula as previous games, buy toys, play and level them up, which works for the diehard fans of the franchise and children. While the inclusion of Crash Bandicoot brings back some of the older fans that have been waiting for a new Crash game, like I have. You see, I was content just playing the whole game as Crash and pretending it was a new Crash Bandicoot game that was until I got into the Imaginators aspect of the title.This years Skylanders brings in the ability to create your own Skylander and its rather expansive. It should be said that you will need to buy specifically designed Creation Crystal toys. These toys feature all of the elements like the traditional Skylanders, so when you buy one youre then picking out which element you want your character to specialize in. Once you put the Creation Crystal on the portal the real fun begins. From creating a character class (brawler, gunslinger, sorcerer, etc) to customizing every bit of appearance (looks, gear, weapons, colors, etc), I doubt you will see many people creating the same Skylanders. I wasnt expecting the creation tool to be so in depth and with so many different options. On top of all that you can also create and/or edit your characters on an iOS app. Everything I just mentioned really blew me away but theres one more thing you can do with your created Skylander, if youre so inclined. You can order an actual 3D printed version of your created character! How cool and unique is that? I havent seen how the quality of these toys will be, but I could see a lot of happy children getting their video game custom character as a real toy under their Christmas tree (the custom Skylander will set you back $49.99).Ive played a handful of Skylanders games prior to Imaginators and in my opinion, this years is more of a return to basics. Last years featured the introduction of vehicles, boats and planes. The year before that introduced the gimmick of capturing characters and then using those captured characters. Every year introduced a new gimmick for the series, but this year feels more like a step back to some of the earlier games in the series. That also shouldnt be taken as a negative. The gameplay is tight and better than its been in previous games. I appreciate this return to the series roots, but fans of the series that have huge collections of Skylanders from previous titles might be disappointed. Many of the gimmicks from previous games have been greatly neglected. I was really surprised to see the vehicles from last years Superchargers to be relegated to a Raceway Arena. I enjoyed the varying of gameplay in Superchargers during the driving areas, but I understand it was time to go back to basics and not force people to use toys from years past.The exclusion of old Skylander gimmicks doesnt mean there arent any new character types in Imaginators. A new character type called, Sensei, is added in this years game. Sensei characters are some of the strongest Skylanders and also have the ability to teach your Skylanders new abilities. Each Sensei owned also increases the max level you can level up your other Imaginators to. The Sensei toys are also larger in size than the other Skylanders toys. Overall I wasnt as impressed with what the Sensei class had to offer as I was with the creating of my own characters. One final note on creating your own Skylanders; the items used to create your character are found throughout the games levels and by completing particular objectives. So the character you start with might not look or play the way he or she does by the time you reach the end of the game.", "date": "October 12, 2016", "grade": "B+"}