{"name": "Aliens: Dark Descent", "ref": "https://multiplayer.it/recensioni/aliens-dark-descent-recensione.html", "text": "Even with all its charm and proximity to the action dynamics that are the most popular in the video game market, the Aliens series unfortunately cannot boast a long list of impeccable transpositions, on the contrary, in reality there are more productions that leave something to be desired than those that somehow managed to translate the spirit of the film saga in the best possible way. real that he was violent and ruthless just like the Xenomorphs, but at the same time capable of bringing the atmospheres of Aliens: The Final Clash to the screen. So is the one achieved by the French development team a perfect center? Not really: we explain why in the review of Aliens: Dark Descent. And sorry for the delay. The story of Aliens: Dark Descent Aliens: Dark Descent, Maeko Hayes makes a terrible discovery About twenty years after the events of the Aliens trilogy, a ship leaves part of its cargo on board the Pioneer space station, which apparently consists of sealed containers inside which Xenomorphs are trapped still alive. However, someone tampers with the systems and causes the capsules to open, which quickly transforms the structure into a bloody hell and Facehugger for the people on board. Maeko Hayes, deputy station administrator, thus finds herself living a real nightmare and is forced to make drastic decisions, activating the Cerberus Protocol at the suggestion of a Synthetic (always them!): a security system that aims to destroy all ships that have come into contact with the Pioneer to prevent the infestation from spreading. which however is now taking place on the underlying planet Lethe. About to be killed by the Xenomorphs, as happened to the rest of the crew, Maeko is saved at the last moment by a patrol of Colonial Marines led by Sergeant Jonas Harper and coming from the USS Otago, one of the ships affected due to the measures put in be from the Pioneer and crashed disastrously on the surface of Lethe, unable to resume flight. Initially reluctant to reveal to Harper that she was the one who activated the Cerberus Protocol, Hayes placed herself at the disposal of her new team to remotely coordinate the actions of recovery of the marines, who apparently have no intention of sitting around while the inhabitants of the colonies are slaughtered by hordes of hostile aliens. Will the woman be able to make amends and foil this terrible threat? Aliens: Dark Descent, a raging Xenomorph Characterized by a convincing story well narrated by its interpreters, albeit weakened by a technical sector that shows all its limits precisely during the interlude sequences, showing off very dated graphics in terms of geometries, effects and animations, the campaign of Aliens: Dark Descent appears firmly anchored to the universe and atmospheres of Aliens, and this undoubtedly represents an important advantage for the title of Tindalos Interactive. Structure Aliens: Dark Descent, the composition of the team Aliens: Dark Descent is a strategic game that certainly owes a lot to the XCOM series, especially as regards the hardcore setting, which already at the normal difficulty level confronts us with particularly complicated situations; and for the element of permanent death, which further affects the general tension of our expeditions: losing a marine is a heavy blow, losing one developed and enhanced even more. During the campaign, consisting of thirteen chapters for a total duration that it also varies a lot based on the number of game overs and repeated attempts to complete the missions, but which generally stands at around fifteen hours (not very much for a title of this kind), we will be able to explore a handful of different maps and complete various objectives relatively freely. Aliens: Dark Descent, the screen from which you access the various options In fact, we will have the possibility to dedicate ourselves to the various assignments available in the order we prefer, moving the group of Colonial Marines within the scenario to eliminate possible threats, recover data and materials or save any survivors that we can later recruit. However, if at some point we run out of ammunition or energy, we can board the APC and extract the team prematurely and then return later.The iconic armored vehicle, which is transported to the field by dropship just like in Aliens: The Showdown cannot be controlled directlyta, but he can only be ordered to move from one specific point on the map to another. However, it is always better not to keep him too far away, since his autocannons are a boon when hordes of enemies decide to attack us in the open. Aliens: Dark Descent, the APC provides great support where possible However, we were talking about early extraction: considering the level of challenge of the game, during the first hours it can prove to be an intelligent tactic to collect resources and upgrades before tackling the more difficult and risky tasks, with the possibility of then returning to the same map to complete the remaining objectives, however, taking advantage of a more cunning and better equipped group. Gameplay Aliens: Dark Descent, covering fire In terms of gameplay, the points of contact between Aliens: Dark Descent and the aforementioned XCOM are manifested in a rather evident way, with the hardcore setting of the difficulty and the element of permanent death to characterize our approach very strongly. real-time strategic system developed by Tindalos Interactive. There are undoubtedly some peculiarities, see for example the automatic fire, the stealth mechanics and the fact of managing the team as if it were a single entity, also with regard to ammunition and actions special, which however prevents the abilities of the single marine from being exploited freely and precisely; especially during the most agitated phases, when the Xenomorphs arrive in waves and it becomes necessary to open the extra maneuver menu to slow down time and select the tool we want to use to defend ourselves in the best possible way. Aliens: Dark Descent, the management of light during the exploratory phases However, it is in these situations that the tactical thickness of the game emerges, even if we stumble upon an interface that has a few too many edges and which proves to be practical only using the mouse and keyboard, while with the controller (and therefore on the console) we come across bizarre and unfortunate key combinations (the backbones to select the action while pressing the right trigger to keep the menu open?), often capable of creating a lot of confusion precisely when it should be quick and effective. The rest is a bit ' an obstacle course, because on the one hand there aren't many scenarios and they often have similar assets, but gems like being able to weld a sliding door and perhaps create a temporary shelter for resting, or the ever-present motion detector, show how much deeply and convinced the developers have drawn on the mythology of Aliens and the peculiarities of its retrofuturistic universe. Aliens: Dark Descent, a firefight More importantly, however, is how the whole sense of defiance and permadeath served the tension and atmosphere, because knowing that the stakes are so high, the exploration sequences in the dark of the corridors of an apparently abandoned colony, aiming the light beams of the torches to cleave the darkness whenever possible, manage to generate a not indifferent fear. The glitches that also haunt the experience and the scarce variety of enemies that we will find ourselves facing, an aspect which however is also linked to the reference materials and with respect to which the guys from Tindalos Interactive have moved with great caution, introducing unpublished figures but always with great attention towards the license . Technical realization Aliens: Dark Descent, Hayes and Harper Let's also say that the strategy genre is not known for its extraordinary graphics and that the isometric view tends to literally crush any attempt to enhance certain elements, so it is not surprising that on the purely aesthetic front Aliens: Dark Descent is not a beautiful title .Unfortunately, as previously mentioned, the production value of the game appears low and shows its limits precisely where it could have gone further, namely in the interlude sequences: the polygonal models are quite dated and the animations generally mediocre, although from this point of view for the Xenomorphs some extra effort has been made. Aliens: Dark Descent, still plays of light and shadow Absurdly, it is the lighting system that plays a leading role, and this is how walking through the corridors of the various settlements with our torch turns into a suggestive experience, albeit technologically anything but sophisticated. Which disappoints all the more when you look at PC performance, given that 60 fps at 4K and Ultra presets tend to wobble on an RTX 4070 and there is a lack of support for technologies such as DLSS and FSR, replaced bya simple percentage scaler. Essential for atmosphere and tension, the audio compartment faithfully reproduces the typical sounds of the film saga, from the fire of the iconic pulse rifle to that of the flamethrowers, from the ~beep~ of the motion detector to the frightening verses of the Xenomorphs, seasoning everything with well interpreted dialogues in English (subtitled in Italian) and with a soundtrack that always proves to be adequate.", "date": "2023-07-02", "grade": "7.5"}