{"name": "E' nato prima l'uovo o il Dodo?", "ref": "https://multiplayer.it/recensioni/77372-dodogo-e-nato-prima-luovo-o-il-dodo.html", "text": "The Game is available for download on the DSi Ware service. There was a time when we all went crazy for the imaginary Lemmings to survive; today times have evolved and, ecologically, we must try to save some nice little Dodo eggs. The basic concept of the two titles, and of many others that have been developed in between, is, in fact, the same: to manipulate the environment to try to get from point A to point B small helpless ~creatures~ who have the habit of always seeking death in the stupidest ways... An egg covered in pitch? All the action takes place on a beautiful island, in quite classic settings such as the beach, the forest and the caves. Millions of years ago, a gigantic wave generated two consequences: scattering all the eggs of the placid Dodos and bringing in a very bad crocodile who hates future chicks. Our task is to recover the eggs and defend them from the attacks of the ferocious reptile. The tropical setting and easy story shouldn't mislead you: DodoGo! can be considered a beautiful puzzle for everyone and not just for the little ones. Proof of this is the complexity and difficulty of the second part of the game; if in fact the first worlds are a long and sometimes banal tutorial, continuing with the levels there are so many complications that it requires more attempts to get to the exit successfully. The paths, in fact, can be manipulated with shovels, saws, brushes, ropes, blocks of stone, explosives, fans, dragons, switches; and then you have to consider the wind, fire, water... And much more included in a long list that would make Umberto Eco happy, but our readers much less so. To be avoided, as per tradition, there are countless traps: starting from the obvious physical characteristics of the levels, passing through various small animals such as snakes and tyrannosaurs, ending with flames, chasms and shell-breaking heights. During the game you have the possibility to pause in order to make the best use of the tools at our disposal, but to complicate everything there is the need to carry out actions with the moving eggs. Everything works very well, given that the latter are never very many and that the preparation and programming part of one's strategies is predominant. The actions to be carried out on the move, therefore, do nothing but add a little healthy pepper to the whole. So usually you take a good look at the level, start filling a hole, create a ramp, set fire to a block of wood, all rigorously paused. The next step is to put it back into play and see what inevitable chain effects our actions have led to, if everything has gone well, the eggs are started, with a double tap on the display or with a ~Go!~ yelled into the microphone. Finally, when necessary, some dynamic aspects still have to be corrected in order to arrive at a safe basket. The ~Alien After All~ developers of the game also introduced another concept: the egg mood; in addition to the structural integrity of our shells, we must also make sure that they arrive happy at the finish line. This aspect could have been developed much more, but still adds a few things. In fact, if we drop an oviform from too high, leave it in the water for too long and so on, it starts to deteriorate and we will literally have to cuddle it to make it happy again. In case of a fracture, however, you must provide for the repair with plasters and then with the aforementioned pampering to console him. Nice idea but still a bit immature given that these operations are used relatively little. A further addition to vary a little are the bonus levels: in these the only component of preparation of the paths that must be faced with particular test eggs appears. Along the way you have to collect all the dots present and arrive safely at the exit; these levels are, rightly so, more complex and difficult than the traditional ones and require the full use of intuition and lateral thinking. Successfully passed, different egg avatars and customizations will be awarded. Can a brush set wood on fire? The most surprising thing is how everything manages to be very accessible and clear from the first glances at the level. The very pleasant and very clear graphics and design help a lot even in the most complex situations where the screen is filled with different elements. The level pattern with moving eggs has been cleverly placed on the upper display. A quick glance is enough to understand at any moment if everything is going as it should without constantly scrolling the fieldgame on the touchscreen. The response to the commands is almost always very good, even if sometimes it is unresponsive or unclear. It happens, in fact, not to be able to quickly stop an egg or to cut a rope, but they are quite irrelevant defects to the performance and therefore they are easily forgiven. Even the music and sound effects are very nice with the initial song, where the word DodoGo is hummed! , which you will begin to repeat obsessively with an idiotic smile many, too many times... Finally, a decidedly adequate length is also noted: you will spend several hours there, sometimes splitting your brains, others with a touch of satisfaction for having ~understood ~ immediately the level. Furthermore, many worlds must be repeated to try to get the maximum score, obtained by evaluating time, egg happiness and repairs made. One cannot therefore but be pleasantly surprised by how much a title distributed through the certainly not incredibly exciting DSi Ware can be cured, fun, long-lived and definitely recommended for every player.", "date": "2010-05-21", "grade": "8.2"}