{"name": "La fiera del Tunz Tunz", "ref": "https://multiplayer.it/recensioni/77249-pulse-the-game-la-fiera-del-tunz-tunz.html", "text": "The world is beautiful because it is varied, it is said, and this statement can also be applied exactly to video games, which thanks to the fact that they range between different genres and skill levels manage to ~hit~ a vast group of people, and often create also different currents of thought or real factions that support or not one genre rather than another, and which perhaps become more aggressive when they are in the minority. There is also a certain genre of games that takes root also by focusing on a component, the musical one, which generally is not and must be the most important part in the development of a game, but which has given away some exponents of absolute value, capable of offer real gaming adrenaline and keep you stuck to the screen for a long time. Precisely on these concepts, which have made famous titles such as Rez, Space Channel Five, Lumines and company, is based Pulse: The Game Dutch production that arrives on the iPhone trying to combine music and gameplay in an interesting and enveloping mix. In this case, Dance and Trance music was chosen, perfect from a rhythmic point of view to connect to what is happening on the screen. Rhythm is everything The purpose of the game is easily explained: we have the possibility to choose between six different songs belonging to these musical genres, of increasing difficulty and unlockable only after obtaining a certain score in the previous song. Against the psychedelic background is a line with a central dot that sways on a harmonic trajectory, and you need to tap the iPhone screen as the dot reaches the main music track, in a rhythmic way to increase score, keep multiplier and allow the song to evolve. In fact, at this point, continuing to sustain the rhythm, it is possible to make new musical tracks appear on the screen, represented by straight lines in the upper and lower part, and to increase the width of the drawn line; then near the unreleased tracks themselves, and pressing two fingers at the same time, you access a sort of mini-game where you have to repeat the key combination shown on the screen in sequence, a sequence which if completed successfully allows you to add the sample to the song and therefore ~enrich~ it with effects and backing tracks, making the piece more compelling and pleasant to listen to. The difficulty therefore basically lies in replicating the sequences to add the samples, which become more and more difficult as the available tracks increase, but also in the fact that the width of the drawn line grows, and therefore it becomes fundamental not to make a mistake in the rhythmic sequence and keep adding tracks, also because those already acquired tend to dissolve after a certain amount of time that you get stuck. This is in summary the gameplay of Pulse: The Game, the appeal of which is entirely based on the proposed musical genre and on the ability to be rhythmic in timed iPhone screen pressure. In this case the title works quite well, the difficulty is well calibrated and the music appropriate to the situation. Too bad, however, that the work done in terms of modes present is practically nil, as only the possibility of unlocking and tackling the six songs in sequence, an offline ranking system and the possibility of sharing scores on Twitter and Facebook is available. No multiplayer or anything else, and it's a shame because there would be a lot of potential to offer a much more complete music game and exploit the mechanics in a more convincing way. The tested version is 1.01 Apple Store Links", "date": "2010-05-17", "grade": "7.0"}