{"name": "Un PC per competere con Third Echelon", "ref": "https://multiplayer.it/recensioni/77053-tom-clancys-splinter-cell-conviction-un-pc-per-competere-con-third-echelon.html", "text": "After a few weeks, the fifth chapter of the Splinter Cell series has also arrived on Windows platforms. Let's start immediately by saying that, in terms of game structure, there is no difference compared to the Xbox 360 version tested here: the objective of this article is therefore to analyze the technical sector which, as often happens, benefits from the greater power of computers. The first dutiful note concerns the protection system that Ubisoft introduced with Assassin's Creed 2: even in Conviction it is necessary to remain connected during the game. This obligation has created some problems for us since it has happened on a couple of occasions that the software was unable to connect with the servers of the French company, consequently preventing the continuation of the game. Anyone undecided about which version to buy would therefore do well to also take into consideration this important feature included only in the PC release. The control system Assuming that it is possible to use the Xbox 360 joypad (supported with a lot of Force Feedback), the mouse/keyboard combination is deeply affected by the action cut that has been imposed on the Splinter Cell saga: the four arrow keys are flanked by the fundamental CTRL ( to crouch) and the space bar to which almost all actions are relegated, such as moving from one shelter to another, jumping, opening doors or windows. Then there are a series of other function keys that in our opinion will be used with the dropper, including - thanks to the low difficulty of the title - those for the famous ~make and run~ (E and Q). In previous episodes of the Tom Clancy saga the mouse wheel was nothing short of fundamental because it allowed you to change the speed of Sam's run; now that this feature has been eliminated, it is just used to choose the type of grenades (thrown with the F), while pressing zooms. On balance it is a mapping that you get used to quickly and whose precision, as often happens, offers a better gaming experience than the pad. The game engine The Ubisoft Montreal programmers unexpectedly decided to use the second version of the Unreal graphics engine as a basis for the newborn LEAD engine, integrating it with support for the middleware Havok (for physics) and Scaleform GFX (which allows the use of Adobe Flash applets). At first glance, this decision could dismiss the minimum requirements box; however, those who do not have a latest generation video card could be banned from the framerate drops that are recorded by setting all the details to the maximum. The main cause of this fluctuating behavior is the lack of optimization of the title that many users are complaining about in various forums. We have therefore decided to dissect the graphics sector to try to get the best possible compromise. The advanced menu offers the following settings: Resolution A parameter that is difficult to change especially for those who play with LCD monitors, which perform at their best only in the mode set by the manufacturer. Lowering the resolution is the most classic way to make your system gain performance; in this case, however, this choice is further inadvisable given that those who have a 16:10 monitor (that is, most players who have a widescreen) will not be able to eliminate the annoying black bars that bring the screen to 16:9. A flaw that afflicts various transpositions for PC (how can we forget the first BioShock?) and that we honestly didn't expect to have to report. Shadows One of the more delicate items because it impacts quite significantly on the GPU workload. In one of the greatest representatives of the stealth genre, one would expect to have to immediately select the highest of the four levels of detail in order to enjoy the best experience, however the game structure comes to the aid of those with non-state-of-the-art systems. In fact, one of the peculiar characteristics of Conviction is the loss of color when you are in Sam Fisher's natural habitat, i.e. in the dark. A good part of the game is spent (especially the ~reflective~ one when there is also time to admire the surrounding landscape) in black and white and in this context the shadows tend to disappear, as also witnessed by the screenshots. A good compromise could therefore be to set this option to medium or low, in order to gain some power for other settings; without considering that the real leap in quality is only registered with the maximum level. Details In this case we are not talking about quality of the textures but of the quantity of objects displayed on the screen. This item has three setting levels: the lowest one objectively corresponds to a castrated gaming experience, an exaggerated number of details are removed from the screen and this makes the settings sterile and devoid of bite. The transition from medium to high level, on the other hand, is much more contained, and in some screens it is not even visible. Our advice is therefore to keep the medium settings. HDR and Ambient Occlusion We have decided to combine these two options since their deactivation severely penalizes the gaming experience. HDR is a variable of primary importance and which honestly it would be good not to do without: by deactivating it, the textures become flat and dull. Only to be deselected as a last resort. Identical speech also for theAmbient Occlusion which greatly improves the visual quality: not only for the quality of the textures which become much more vivid and detailed, but also for the activation of some special effects such as steam or smoke. If the video card is recent enough, it is highly recommended to keep this option enabled. AA and AF Conviction noticeably suffers from aliasing, one of Unreal Engine 2.5's most notorious flaws. From the graphics options menu it is possible to choose between three levels of MSAA: if the card allows it, it would be advisable to set it to at least 2X, even if the impact on performance will not be long in coming, especially on older GPUs. In our opinion, avoid the super demanding anti-aliasing at 8X which offers practically identical results to 4X. The anisotropic filter can be set up to 16X as usual: while not weighing excessively on the GPU, we believe it is possible to sacrifice a little detail in favor of the frame-rate without having particularly evident visual sacrifices. Scar tissue A noticeable improvement in the behavior of Splinter Cell: Conviction is to be expected, which seems to suffer especially with ATI cards (in particular, as also indicated by a sticker on the packaging, with the 3000 series) and with SLI/Crossfire configurations. With the very recent 1.02 patch, the Ubisoft game introduces support for multi-GPU configurations (this does not mean that it was impossible to start it with the basic version, but simply that the second card / GPU was not used) resulting in a significant boost for owners of this type of system. Other bugs unfortunately afflict the PC version: among the most frequent we point out the blocking of the mouse cursor and the ~automatic shot~ which starts more often when a rifle other than the one you are holding is selected from the armory. Particularly annoying not only because it empties the magazine in seconds but attracts the attention of the surrounding guards. Final considerations The PC version of the fifth Splinter Cell betrays a lack of optimization of the LEAD engine which turns out to be unjustifiably heavy. Overall, in fact, the visual sector fails to live up to the recent heavyweights in the category and, while not missing some particularly scenic moments, a certain obsolescence of textures and light effects is denoted. Probably the long gestation times prevented the Ubisoft Montreal team from adopting the excellent Dunia (Far Cry 2, Avatar), which would certainly have had a greater impact, and support for the latest DirectX (here instead stuck at version 9) . Nonetheless, the system requirements to be able to enjoy Conviction to the fullest are certainly out of the reach of mid-range PCs, especially when you go high with the resolution. We ran tests with both the system below, obtaining average frame rates which, with all details maxed out (except 4x AA) and at 1680x1050 resolution ranged from 23/25 in outdoor locations to 33/ 35 of those indoors. It should be noted without a doubt that the installation of patch 1.02 has significantly increased (in the order of eight fps) our performance. Another test was conducted on a notebook equipped with Intel Q9000, Radeon 4500 Mobile with 1 Gbyte and 4 GByte of Ram, and in this case to obtain a decent frame rate, always at the resolution of 1680x1050, we were forced to disable full anti-aliasing and setting the amount of detail and quality of shadows to medium. In this way the frame-rate stood slightly below the 30fps threshold, while still guaranteeing a fair playability.", "date": "2010-05-12", "grade": null}