{"name": "Una strana storia noir", "ref": "https://multiplayer.it/recensioni/76909-1112-episode-02-una-strana-storia-noir.html", "text": "Summary of previous episodes. Although it had attracted quite a bit of attention, the first chapter of 1112, an episodic graphic adventure created by the French team Agharta Studio, had left iPhone and iPod Touch owners very dissatisfied. A top-level audiovisual realization and well-characterized characters were accompanied by a very low duration of the game, an inconsistent plot and a bad localization, full of errors and dialogues translated as best as possible. Taking advantage of the criticisms received, the developers have thus tried to pack an Episode 02 capable of putting some patch on the numerous naiveties of the previous chapter. The game is accompanied by a brief illustrated summary, making it unnecessary, but still recommended, to purchase the pilot episode first. The protagonist of the story is once again Louis Everett, the forgetful detective who must have made the players happy with his embarrassing resemblance to Johnny Depp. Again, rather than exploration and solitary puzzle-finding, Agharta Studio's adventure prefers to place more emphasis on interacting with NPCs. It certainly wouldn't be a bad choice, if it weren't for the superficial characterization of the new co-protagonists introduced within the plot: unlike Episode 01, Louis will almost never be able to deepen his ties with them, and almost all the new extras they will appear flat and decidedly uninteresting. Between high (few) and low (many) The goodness of the illustrations, together with the attention to visual and sound details, once again represents the flagship of the French episodic series. The expressions of the characters, and of Louis in particular, will change according to the player's actions and choices, ensuring that in moments of reflection they never look like wax statues. It's rare to find another adventure on the iPhone that is equally captivating to the player's senses, and it's really a shame that it's marred by poor dialogue and such a steamy plot. To overcome the enormous difficulty of the first chapter, the development team has introduced a very useful feature, taken directly from the PC adventures: in fact, just slide your finger on the iPhone screen to highlight the objects with which it will be possible to interact, allowing bring subtle details to the player's attention. Clearly it's a system still to be perfected, since the player's fingers can end up covering smaller objects, but it's certainly a step forward. This does not mean that some scenarios and puzzles are drawn in an incomprehensible way to say the least and that, sometimes, even indispensable objects are hidden within chaotic illustrations. To give the coup de grace we think the total lack of any system of clues, now the inevitable companion of the laziest players or those less awake. After a while, the adventure suddenly comes to an end and the player still hasn't quite figured out the mystery that lies behind room 1112. The thousand knots in the plot have not been resolved and indeed they seem even more confused than before. All the time spent chatting with the various characters now seems futile, wasted. Although the English translation has improved since the first episode, from time to time we still come across poorly localized sentences or even not localized at all. An upcoming update of the application could easily remedy some of these flaws, but by now the guys at Agharta Studio have lost the opportunity to churn out one of the best point-and-click adventures ever to appear on Apple's mobile device. The tested version is 1.0 App Store links", "date": "2010-05-06", "grade": "5.9"}