{"name": "Super Robot Wars 30", "ref": "https://multiplayer.it/recensioni/super-robot-wars-30-recensione-strategico-robot-giapponesi.html", "text": "We had lost hope that Super Robot Wars could ever officially land in the West as well: the series created by Banpresto in the now distant 1991 has never left the Japanese borders, apparently due to a question related to the rights relating to the many anime series represented in the game. but apparently something has changed and the latest episode was released a few days ago on Steam. If you don't know it, imagine it as the dream crossover for a Japanese robot enthusiast: a turn-based strategy in which you can control the various Mazingers , Getter, Jeeg, Grendizer and the entire Nagaian fleet, together with the real robots represented by the huge Gundam universe and the most disparate productions: from Zanbot 3 to Daitarn 3, from Godsigma to Daltanious, from Combattler V to Eva. Super Robot Wars 30, the powerful Mazinkaiser piloted by Koji Kabuto Over the years, the franchise has been the exclusive preserve of those who used the parallel market or resorted to emulators (practically the only way to recover the first chapters at the time), reaching its peak on PlayStation and then crossing a phase of substantial technical refinement but also a progressive rejuvenation of the brands involved. A path that leads us today to the review of Super Robot Wars 30, as mentioned the first episode to make its official debut also in the West, at least in its PC edition on Steam . How is the series doing after more than thirty years and no less than forty-eight iterations? Let's find out together. History Super Robot Wars 30, Koji and Ryoma talk between missions As Super Robot Wars fans well know, the story told in the various episodes, obviously non-canonical with respect to the series involved, assumes that the robots present in the game and their respective pilots somehow belong to the same universe or make their appearance through dimensional passages . This last chapter is no exception, substantially reducing the ranks of the so-called Banpresto Originals, i.e. the real robots (the more ~realistic~ Gundam-style ones, fast and agile but not very resistant and less powerful than the classic super robots) that play central roles within the plot, and reducing them to a single unit presented in the early stages of the campaign. Super Robot Wars 30, the Huckebein 30 is the original robot piloted by the protagonist of the story Setting off on a mission to save the world aboard a huge spaceship controlled by a group of students, a concept that clearly takes up the incipit of Mobile Suit Gundam, we will gradually meet new allies until we form a small army which will force us from battle to battle to select the robots we want to use and those that we will leave in the hangar instead. As mentioned at the beginning, however, over the years the franchise has undergone a process of rejuvenation that we also see at work in Super Robot Wars 30. So here is that the characters created by Go Nagai (who also designed the game logo) are indeed present but in the recent Infinitism interpretation (however without Grendizer and Jeeg), flanked by new entries such as Gridman, J-Decker, Gaogaigar, Code Geass and Knight's & Magic. Super Robot Wars 30, the Great Mazinger Infinity version launches the Thunder Blast The game only has English subtitles, which inevitably makes the many visual novel-style dialogues between the various protagonists heavy, which however narratively represent the strength of the brand thanks to the abundant fanservice. In fact, witnessing the interactions between the various Koji Kabuto, Ryoma Nagare, the pilots of Combattler V and those of Gundam is worth the price of the ticket for enthusiasts. In terms of interface, it is possible to advance the texts quickly by clicking with the mouse or using the controller, or even select one of three available scroll speeds to complete these phases as quickly as possible, where you already have abundant experience with these dynamics and prefer to concentrate on the real action. Contents Super Robot Wars 30, the units released on the battlefield of a mission The Super Robot Wars 30 campaign features two different paths, each with over twenty missions to which, however, numerous secondary tasks are added, the structure of which varies according to the choices made previously. It is also possible to purchase a Season Pass which will further enrich the offer with new robots and new scenarios. Compared to previous episodes, the developers have introduced the possibility of choosing precisely how to move between the various missions, highlighting the most important ones and indicating the values relating to the difficulty but giving us the opportunity to decide which ones to face firstbut instead of following an absolutely linear path. Super Robot Wars, list of series represented in the game Super Robot Wars 30, the tokusatsu Gridman is one of the new entries Super Electromagnetic Robot Fighter V Mobile Suit Gundam Mobile Suit Z Gundam Z-MSV Mobile Suit Gundam Char's Counterattack M-MSV Mobile Suit V Gundam Mobile Suit Gundam NT (Narrative) Heavy Metal L-Gaim The Brave Police J Decker The King of Braves GaoGaiGar FINAL The King of Kings: GaoGaiGar VS Betterman Code Geass: Lelouch of the Rebellion III - Glorification Code Geass Lelouch of the Resurrection Getter Robo Armageddon Mazinger Z: Infinity Mazinkaiser (INFINITISM) Magic Knight Rayearth Gun X Sword Majestic Prince Knight's & Magic SSSS.GRIDMAN Gameplay Super Robot Wars 30, the interface shows the boxes that we can reach in one turn Able to live and thrive (at least at home) for thirty years thanks to the attraction represented by the robots present in the game, without having to worry too much about renewing its formula in any way, Super Robot Wars presents itself at its thirty-year appointment in a form that does not differ much from the origins. The strategic system is in fact the one that fans of the series know well, which emphasizes position and shift management, very simple in its mechanics but with some facilities that allow you to proceed more quickly, or even to use specific skills (see for example the Flash, i.e. the ability to dodge an enemy attack 100%) even after a completed turn: a real heresy compared to the more difficult chapters of the saga. In most cases our goal will be to eliminate all the enemies present within the map, which generates an inevitable sense of repetitive action. During the turn we will be able to move the units and possibly attack by choosing the maneuver based on the residual energy of the target or the remaining Spirit Points, and which precisely determine the ability to perform certain moves. In case of difficulty we will be able to lock ourselves in a parry, reducing the damage, or attempt to dodge by halving the probability of being hit: a concrete occurrence where the robot we control should not be defeated, under penalty of game over. Then there are a whole series of bonuses relating to morale, EX actions and more that we will be able to perform by positioning the units in a certain way and eliminating a certain number of enemies. Graphics and sound Super Robot Wars 30, the Shin Getter Dragon launches a devastating Getter Beam Undoubtedly not the strong point of the franchise, the technical sector of Super Robot Wars 30 relies almost exclusively on the animations of the fights, using for the dialogues a drawing style very close to that seen in various visual novels, with the traits of the characters rather subtle and the sensation of being faced with a product created with a simple editor. We were talking about the animations, however: when we perform an attack, the view changes and shows the robots involved in the fight who, in turn, perform their moves. These sequences spectacularly reproduce what was seen in anime, from atomic punches to gamma rays, and have now acquired a remarkable dynamism. Suffice it to say that in the classic episodes the character sprites remained stationary in their initial pose: a technical compromise that only hardcore fans could accept. Super Robot Wars 30, the interface that activates at the start of a fight and allows you to choose which actions to perform Remaining on the subject of fanservice, during the introductory missions of certain characters you can witness scenes from the related anime, which show for example the first transformation. In any case, when we use a certain robot, its original musical theme is played: a choice here too aimed at satisfying the wishes of the enthusiasts, but which in concrete terms does not make it very good, given that one passes quickly and continuously from one song to another Finally, a few words for the graphic adjustments and system requirements on PC: since Super Robot Wars 30 is a very simple title, it is also possible to run it on an ultrabook with an integrated video card, in our case a Huawei Matebook X, provided lower the resolution to 720p. Clearly those who have a more performing configuration will not have the slightest difficulty in running the title at its maximum.", "date": "2021-11-07", "grade": "7.2"}