{"name": "Chi d la caccia ai cacciatori?", "ref": "https://multiplayer.it/recensioni/76556-vampire-origins-chi-da-la-caccia-ai-cacciatori.html", "text": "Vampires are strong creatures, extremely agile and fast, who feed on blood and can eventually transform their victims both into slaves who blindly obey them and into beings equal to them. In the case of Vincent, the protagonist of Vampire Origins, things went differently: bitten by a vampire, the man transformed into a sort of hybrid who is not afraid of the light and does not need to drink blood to survive. The metamorphosis, moreover, has made him capable of carrying out his job much better, which is precisely that of a vampire hunter. Bad news for bloodsuckers, huh? As mentioned at the beginning, the new product developed by IceHill Entertainment for Chillingo is clearly inspired by the character of Blade, who we have seen starring in three films with Wesley Snipes but who not many people know belongs to the same Marvel Universe in which heroes like Spider-Man, Iron Man, Hulk and so on. The similarities with ~the diurnal~ do not stop at Vincent's characteristics and his abilities, but extend to the arsenal he carries around, consisting of a sword and numerous firearms. All things that in the game we will be able to experience against the hordes of undead and monsters of various kinds that will be sent against us by our sworn enemies. Lightning and thunder of fury Although it was presented a bit like a ~survival horror~, also due to the type of visuals implemented, which show us the action from sometimes improbable angles, Vampire Origins is more of a classic action game, with lots of opponents to eliminate and some objects to collect. Calling certain situations ~puzzles~ certainly seems excessive, and in the same way there is very little to ~survive~, given that our alter ego knows his stuff and manages to eliminate any threat in a few moments, maintaining a certain superiority for the entire (short) duration of the game. The gameplay is basically based on an exploratory phase, in which we have to visit the scenarios and figure out which path to take, as opposed to an ~action~ phase that starts when enemies show up on the screen. Vincent's pistol is initially the only weapon at our disposal, but we soon get the chance to replace it with more effective variants (see the shotgun), albeit with a limited number of shots. The aiming system is extremely simple, perhaps even too much: just touch an opponent to shoot him, or alternatively wait for the system to automatically frame the targets and then press the fire button. However, since the hooking never occurs in a timely manner, the first option remains the best and allows us to conclude the clashes without suffering any damage. The actual vampires manifest themselves during the boss-fights, which unfortunately represent the real weak point of the game: the perspective changes and it seems to be faced with a fighting game with encounters, if it weren't for the fact that the effectiveness of our attacks and our parries is determined by a series of gestures that we must reproduce on the touch screen as quickly as possible. The main game mode is accompanied by a survival, but the duration of the IceHill product is in any case quite poor and not in line with a high selling price (5.49 euros). The technical sector makes a fine show of fairly well-made polygonal models, even if the design of the enemies appears to be at least confusing. The fixed views inevitably translate into static scenarios, and in this sense the developers could have provided the locations with more details or inserted some interactable element. The tested version is 1.0 App Store links", "date": "2010-04-30", "grade": "7.4"}