{"name": "Sentinel: Il Regno delle Illusioni", "ref": "https://multiplayer.it/recensioni/sentinel-il-regno-delle-illusioni.html", "text": "Modern grave robbers The game hasn't started yet and we're already in trouble with the big bad guy! The introduction of Sentinel is rather hasty but effective: it immediately throws us into the heart of the action, without too many compliments. In fact, it is enough for us to know that in the world of Beni, the naive protagonist of the story, mysterious tombs keep the secrets of an ancient civilization that disappeared and attract numerous defilers, eager to discover its treasures or even just to outwit the sentinels. These are entities created by the ancient Tastans, equipped with an advanced artificial intelligence and modeled on the personality of the deceased, placed to guard the technologies and knowledge hidden in the burials. To save his kidnapped little sister, our hero will have to submit to blackmail and venture into the most dreaded tomb of all, number 35, which has so far survived only one man, this Ramirez. He will therefore be forced to challenge its sentinel, the enigmatic and lethal Dormeuse (the sleeper) who, apart from the dubious taste in the combination of colors, is an intriguing and unexpectedly original character. He will also be the only character we will have to deal with during the adventure, so it is better to enjoy it! To save his kidnapped little sister, our hero will have to venture into the most feared tomb of all, number 35... Modern grave robbers The sentry: all houses should have a burglar alarm like this! For the screenplay of Sentinel, Detalion once again relied on the Australian science fiction writer Terry Dowling, already author of the story behind Schizm, and undoubtedly the concept and the unexpected ending contain a spark of genius... it's a real shame that they have not been exploited more. Beni will visit not only the actual tomb but also seven virtual worlds, which represent places dear to the deceased, fragments of her memories: initially only three will be accessible but we will be able to visit them in the order we prefer; we will explore them guided by the Dormeuse herself, who will appear to us as we manage to solve the puzzles, revealing the mysteries of the Tastan civilization to us. For the rest of the time, Beni will be alone with himself, bouncing undeterred from one puzzle to another. The bizarre speeches between the sentinel and the protagonist, the progressive unraveling of the background of the tombs and the windows open on Dormeuse's past are interesting, but a little too thin to support the full weight of the game. Look but don't touch! The intricate tunnels of tomb n 35. Navigation within the worlds of Sentinel takes place like in a 3D shooter: you can move with the mouse or the WASD keys and the cursor is fixed in the center of the screen. The implementation of the Jupiter graphics engine for an adventure is admirable and offers an unusual freedom of movement: we can go around every corner and observe the scenarios from different shots. The only unwanted side effect is seasickness, guaranteed by the exaggerated sensitivity of the mouse. Too bad that the interaction with the game environment is limited exclusively to the interfaces of the puzzles, the only hot spots at the passage of which the cursor comes alive. These, however, offer a good level of challenge and are well calibrated: we will find ourselves deciphering the functioning of bizarre machines, associating seemingly incomprehensible symbols, manipulating codes based on sounds or colors and aligning bridges with obscure mechanics. The average quality of the puzzles is relatively high, even if in the long run it suffers from a certain repetitiveness. Navigating the worlds of Sentinel is like a 3D shooter. Look but don't touch! The first puzzle. Worth mentioning and rewarding is the presence of an integrated help system: by enabling the appropriate option in the game menu, it will be possible to receive more or less explicit clues or advice on solving the puzzles (although sometimes they are rather cryptic, if not misleading). Often it is immediately clear what needs to be done, but putting it into practice is a whole other story. The positive aspect of the Sentinel game mechanic is the non-linearity: if we were to remain immobile for too long on a puzzle that has now shattered our nerves, we could always teleport to one of the other virtual worlds of the tomb and try our luck with a different puzzle... continuing to hurt us but with a certain variety, in short! The downside is that, since the game doesn't allow for any form of interaction with the environment beyond puzzles and doesn't involve dialogue or the use of the inventory, it all comes down slavishly to finding the enigma of shift and to its systematic, dynamic solution which by the waythe vast majority of adventurers are likely to prove frustrating. The average quality of the puzzles is relatively high, even if in the long run it suffers from a certain repetitiveness. Look but don't touch! Unlike what happens in most of the first-person adventures at Myst, the graphic design of Sentinel is more than decent: the settings are sufficiently varied and detailed, some truly remarkable, albeit limited in size. The animations of the backdrops are scarce but well done: to give just a few examples, the clouds that run across the sky, the flocks of birds that fly over distant hills or the jets of lava are quite convincing. The immersion of the player is ensured above all by the three-dimensional graphics engine, which allows surprisingly fluid and natural movements, a little less by the audio effects and the soundtrack, which are not particularly distinguished by either quality or originality. The localization is discreet but the dubbing certainly not the most inspired, if we exclude the sensual and convincing voice with which Dormeuse was graced. Comment Sentinel repeatedly challenges the player to test their logical skills and patience: if this is essentially the kind of stimulation you are looking for, please convert our vote into a well-deserved 7.5. The integrated help system justifies the presence of particularly difficult puzzles, while also allowing less experienced players to approach them, and this is appreciable. Remove the puzzles, however, and you'll be left with a handful of fascinating but completely lifeless environments, aseptic virtual paintings. Especially since one cannot really say that these puzzles, however well thought out, have been integrated into the story in a natural way... one would rather say the opposite, that is, that the story has been integrated into the puzzles in some way. In essence, Sentinel has the same perverse charm as a game of chess and, for anyone who does not derive pleasure from the contemplation of detail and the exercise of logical virtuosity, risks being reduced to an exhausting cerebral tug of war! Pros: 3D engine and full freedom of movement Various and challenging puzzles Integrated help system Cons: Lack of interaction with the environment Sterile and repetitive game mechanics Poor integration of puzzles into the story In the name of Myst One of Sentinel's virtual worlds reproduces an unusual marsh landscape. Sentinel falls into the category of graphic adventures like many other Myst clones, but it should immediately be noted that it has very little adventurous, with the exception of puzzles: in fact, it presents a series of seamless puzzles, sacrificing many of the ingredients dear to fans of the genre - the story has potential but is little more than a pretext to keep the puzzles together, the settings are fantastic but aseptic, practically devoid of elements or characters to interact with. However, the credit must be given to the developers for having created stimulating puzzles and creating scenarios that are sometimes truly suggestive, which is more unique than rare these days! The developers we are talking about are the Polish Detalion, who recently ventured into the arena of first-person adventures with Schizm II, which is also heavily focused on logical puzzles and unjustly ignored by most, despite a decent level of quality. After these dutiful premises and not without some reservations, let's therefore move on to examining Sentinel in detail, in any case certain that this kind of game also has its enthusiasts: those who love racking their brains and putting their patience to the test will certainly find bread for his teeth here...", "date": "2005-03-17", "grade": null}