{"name": "Il JRPG secondo Square Enix", "ref": "https://multiplayer.it/recensioni/76697-chaos-rings-il-jrpg-secondo-square-enix.html", "text": "It seems easy to imagine the typical scenario of a discussion between iPhone detractors and supporters about its gaming capabilities. On the one hand, the first to brand the productions for the Apple device as ~games~ in large percentage and perhaps transpositions from other formats, on the other, the second to enhance their usability, immediacy, the possibility of filtering from the group absolutely exceptional titles and peculiarities that give a precise identity to the cell phone of the bitten apple. Good or bad factors of truth can be found in both points of view, the fact is that the App Store platform is finding more and more support as the months go by, and if it is true that it is not at all easy to discern good titles from productions that are not worth not even the 79 cents at which they are perhaps sold, to help there are comments, evaluations and perhaps reviews like this one that you have begun to read, always if you have come to read this point, or you lovers of votes and comments. When the so-called ~big names~ take the field, then the situation becomes even clearer and more interesting, where the main discriminating factor becomes that of understanding whether we are dealing with commercial operations or a product supported by a higher budget to average. Square Enix, which indeed already has a catalog that is beginning to be interesting on the iPhone, returns with Chaos Rings, which at the same time dispels two myths, that of the numerous remakes/transpositions and of shallow titles. The title produced by the Japanese developer in fact represents an original and exclusive production, which at a slightly more demanding price of  10.49 offers a video game that would not look out of place even on a PSP and DS and which belongs to a genre, that of JRPGs, which despite a decline is still very popular in the ranks of gamers. The union makes the couple Chaos Rings begins with a solar eclipse which for some obscure reason transports five different couples, linked by friendship, kinship and so on, inside a structure called the Ark Arena and where an equally mysterious entity, the Agent, announces them that they will have to fight each other to the death, with the victors receiving eternal youth and immortality. Before each fight, the couples must prove their worth by recovering some rings and artefacts scattered around the world and then face off in a battle to the death, the only way to stay alive. These are the premises of the game, divided into four parts that correspond to as many stories that involve the protagonist couples, deepening their mutual relationship and the reason for their choice; therefore there are also four scenarios that must be completed to complete Chaos Rings in its entirety and access the final part of the story, as also suggested by the appropriate progression menu on the main screen. Longevity more than guaranteed therefore, in our specific test we completed the first scenario in about five hours, to then dedicate another to the secret part unlocked there and then try our hand at a second pair, where obviously we were already aware of all the game dynamics. The gameplay of the Square Enix title foresees the Ark Arena as the central structure where after each dungeon and ~coppicide~ (pass us the purely invented term) clash the protagonist returns to recover energy, buy and sell armor and items with money - here referred to as oz - accumulated. We talked about dungeons because in Chaos Rings they are the settings where all the fights take place, in pure ~grinding~ style, or made up of continuous fights inside rooms where you have to reach the exit. To the delight (or annoyance) of JRPG enthusiasts, the clashes are random and turn-based, while special puzzle rooms add a little variety, where to reach the exit you have to activate gears rather than move some objects within a certain number of movements, puzzles that are perhaps a little out of context, but are appreciable in terms of realization and with the right level of challenge. Those who despise random clashes do not despair, Square Enix in the development of Chaos Rings kept in mind that it is a title intended for a mobile phone / portable console, and in fact there are a whole series of options aimed at lightening the structure and avoid making the game unnecessarily frustrating. Such as when at the beginning of each dungeon it is possible to choose the level of the enemies present inside or thanks to the almost instantaneous acquisition of a skill that allows you to avoid any discounttro during their traversal, except for the bosses. Obviously it is highly recommended to face a large part of the clashes to obtain money, spells and skills, as well as level up, but thanks to these possibilities mentioned above it is possible to face the same dungeon again to find objects lost along the way, also because the map is really indecipherable, the only strong drawback of the game as it seems to have been created by a drunk developer after a night of insomnia. In the light of all these factors, Chaos Rings can therefore be defined in all respects as a JRPG dungeon without any type of exploration or anything else. Having made things clear (you could have done it a little earlier, you will say) it is precisely in the combat that Square Enix has placed extreme care, in order to cushion the basic repetitiveness of this genre of games. As mentioned, each command is given using a turn-based system, we have the classic HP and MP, objects and an invisible ATB bar which determines the order of execution at each turn. Physical attacks need little introduction, magical ones are linked to three different states (water, fire and wind) which according to a circular pattern double or halve the damage done and suffered, and which with special magic can be induced or modified on one's own characters and opponents. A discriminating element in the strategic phase is also the possibility of attacking individually or in pairs, in this case the action becomes unique and for example the enhancement or defense spells are applied to both characters and the attack becomes more powerful; the side effect is that every single enemy assault hits both teammates. This system works very well and adds the variety and strategy needed to ensure constant balance and progression, and keep you stuck to the virtual pad of the iPhone. To close the circle, and as already seen in some Final Fantasy, the spells and abilities are acquired by defeating higher level enemies and obtaining the so-called ~gene plates~, genome codes released by each type of enemy and which can be equipped inside of up to three slots and which return different spells/abilities for each. Here too the strategy lies in choosing the three that best suit your style of play, because going forward you will get several more or less effective ones, which will level up until they reach their maximum. We have not forgotten the first thing that caught our eye following the announcement of the game by Square Enix, that technical sector which in Chaos Rings is certainly one of the most valuable aspects. The characters are polygonal grafted onto two-dimensional backgrounds that are very beautiful to look at, the monsters and above all the bosses are very well made and with a good number of polygons, the attention to detail is as always on the high standards of the Japanese developer and therefore the impact it is certainly among the best ever seen on the iPhone, also supported by a good soundtrack that recalls the echoes and glories of the best JRPG productions. The design of the characters recalls that of Final Fantasy VIII, on the other hand among the authors of the game we have Yusuke Noara, who has put his mouth and pen in several Final Fantasy and is currently working on another portable title, Final Fantasy XIII Agito. Where, on the other hand, there is still work to be done is in terms of animations, still rather basic and not very dynamic, and in the graphic cleanliness, where a little aliasing is noticeable on all the polygonal elements in the camera movements. Factors that slightly undermine the final yield but we are certainly on the right track to have production on a technical level on the iPhone that is close to the best of the reference portable console in this sense, or Sony PSP. The last sore point, in relation to our market, is represented by the fact that Chaos Rings is offered with text on the screen only in English and Japanese, which could represent a small videogame barrier for those who are not accustomed to the Albion language. The tested version is 1.0.0 Apple Store Links", "date": "2010-04-26", "grade": "9.2"}