{"name": "Notti magiche", "ref": "https://multiplayer.it/recensioni/76624-mondiali-fifa-sudafrica-2010-notti-magiche.html", "text": "Tested version: PlayStation 3It would be easy to reduce the 2010 FIFA World Cup in South Africa to a mere commercial operation to take advantage of the spasmodic wait for the world championships, Electronic Arts instead, while not revolutionizing the tested and successful formula of its FIFA 10, offers a title that behind a sometimes surprising aesthetic refinement, adds a good job of cleaning, and more generally of correcting many of the problems that the most attentive users have not failed to point out to the guys at Electronic Arts. To make things clear immediately, the 2010 FIFA World Cup in South Africa is not a decisive evolution compared to FIFA 10 (we'll have to wait for autumn for that), but it can be understood as a revised and corrected version of the tenth chapter, a sort of 10.5 which, however, has all the characteristics to walk on its legs, despite the roster of teams available being limited to national teams only, for a total of 199. Johannesburg here we come! The game modes are those related to the world championships, in the main one it is possible to choose whether to start directly from the final phase, or to make all the regional qualifiers, friendlies included. The beauty of embarking on the possible long journey to South Africa is to be able to test the new features inserted by EA, or rather a decisive home factor and the physical form that is affected by where you go to play. The much-hyped match at three thousand meters of altitude, Bolivia - Argentina really saw the Bolivians run like rockets, arrive first on the ball and in general miss fewer passes. On the contrary, the return between the Argentine friendly walls seemed consistent with the real technical and athletic values put on the field. With a view to fewer teams present, playing all the way up to the final, rather than immediately throwing ourselves into the groups of the final phase, is definitely recommended, also because the simulation of the season often delights us with more or less long injuries, and knowing how to manage at best the team is a source of great gratification when cornered in the most difficult moments of matches. Another novelty of the game is History of qualifications, which sees us engaged in about fifty real scenarios, also linked to the last qualifiers, in which we are engaged in impossible feats, comebacks, draws or victories, perhaps outnumbered or with very little time available, all with a rather high difficulty level, which rarely falls below ~expert~. In addition to the challenges immediately available, divided into the various continental confederations, once a certain score is reached (each scenario gives points for meeting certain main and secondary requirements), those that allow us to relive the World Cup in Germany are unlocked, while in the course of During the next world championships, other real instant scenarios will become available to overturn the recently concluded matches. To conclude the range of game modes available, the Guide your nation has been included, a world version of the career for up to a maximum of four players, in which it is possible to raise a player created from scratch, real or imported from FIFA 10. And since the Electronic Arts sportsman has earned the palm of best simulation on the market, new dynamics have been implemented for penalties that are decidedly more demanding and real than the previous ones. This time, as a tribute to the 360 control, it is possible to aim at every single portion of the goal mirror, and we can also interrupt the Miccoli-style run and feint to send the goalkeeper ~violating~. All of this has a good chance of success if the player has the necessary coldness, which is different for everyone. It's all about pushing the shot button at the right moment, centering the green area of the bar located under that of the force of the shot. The mechanism is initially cumbersome, but just spend some time (which is absolutely recommended) in the appropriate training section to become infallible penalty takers. Curiosity On the online side, in addition to the classic menus to which Electronic Arts has accustomed us, we find the Battle between Nations as the most important novelty, a different world tournament from the usual, given that victories bring points to spend on one's team, with a different attribution of score depending on whether a strong or a weak team is chosen in view of the international ranking. Since the game servers are still closed, it is impossible to know in detail how progression takes place in the long term, but on paper the different dynamics that can arise seem to be harbingers of potential replayability, provgoing and trying again the ~customization~ of his own team. News and fixes Pad in hand, without prejudice to the necessary learning time to master all the peculiarities of the FIFA gameplay, the game demonstrates that most of the promises made during the presentation have been respected. The simulation of the tenth edition, although well done and punctual, was not free from defects, sometimes macroscopic, this time the guys from Electronic Arts have been able to make good corrections, which undoubtedly drastically lower the frustration rate that sometimes arose in the previous chapter from certain recurring situations. What stood out the most in the practice sessions is that finally the goalkeepers stay more on the goal line thus avoiding the lob goals that plagued FIFA 1O. In the same way the prolonged and insistent chest stops by the defenders which resulted in the attackers being able to steal the ball from him seem to have disappeared, at least if you play starting from the expert difficulty level. The airiness of the maneuver and the aggression of the spaces have improved, the tendency to defend high in the defense is a little less, with the result of often witnessing fights in very narrow spaces in midfield, from which to exit by exploiting providential high through balls, or for the most practice the whole series of ~special moves~ that can be performed with the right stick. Another peculiarity that is immediately noticeable is the even greater importance of the physique in the players, which really makes the difference in the tackles or in the speed clashes. If going away on the strait taking advantage of the difference in tonnage and weight is gratifying for the attacker, it is much less so for the defender given that we notice a continuous fragmentation of the action by the referee who will tend to boo every slightest contact, even if carried out with the light tackle button. In terms of likelihood with football played, the artificial intelligence of the opponents seems to offer an up-and-down show, halfway between scripted and all too credible. In various situations we have witnessed teams that for seventy minutes have suffered mercilessly, not very clear-headed, getting everything wrong, raising barricades and pressing frantically in midfield, to then suddenly become elusive and infallible in the last few minutes, in fact changing their attitude so too cheating and open, as if they were following a script. Conversely, we have been pleasantly surprised by teams that seem to take the psychological hit for a goal conceded during their best moment, perhaps during a dominated game, without ever recovering from the discouragement of the goal scored on the counterattack. Speaking instead of the ~physical~ sensations experienced game after game, what was said in the preview is confirmed. Filed, but not completely disappeared, a certain woodiness and heaviness of the movements, coherent however with the simulation setting of the whole. It's not about having increased the speed of the game, it seems that the stop, change of direction and sprint transitions are more fluid, a little more sudden, decidedly more appreciable when you manage to make the most of the potential of the 360  control. The physics of the ball deserves a separate discussion, improved yes, above all in the aforementioned scrums in midfield, which suffer less from fake rebounds and pinball trajectories but still often one is forced to assist in shots, and especially in crosses, that ~Super Tele~ effect, a true trademark of the series. Playstation 3 trophies FIFA World Cup South Africa 2010 awards the player with 43 trophies, including 1 platinum, 3 gold, 7 silver, 26 bronze and the remaining secrets. Those of bronze are obtained with the simple progression in the game, or more demanding for example by reaching the final phase with teams of different caliber. The silver ones, on the other hand, are unlocked by achieving particular results in Lead Your Nation mode, beating all 32 nations participating in the World Cup or scoring within 90 seconds of starting a match. Gold, on the other hand, is the prize for winning the world championship with a ~poor~ team or for winning the world championship in the two main game modes. The footballer's beautician However, where the game has made a decisive step forward is in the graphics sector. Obviously this is not a game engine rewritten for the occasion, but like the corrections made to the gameplay, a lot of work has been done, and well, to improve what was left a bit to be desired in the previous seasonal release. Since this is the World Cup game, starting from the menus, starting from the fonts used, a decidedly less serious, more festive aspect is evident. Everything is more colorful, tribal music and pop songs therethey keep company in the choices (and when deciding which team to use it is possible to listen to the national anthem) and when entering the field in the matches of the world championship, it is all a riot of confetti, fireworks and fans painted with colors of your team. In short, you can breathe the world atmosphere, and even the Caressa - Bergomi duo puts its effort into bringing us body and soul into the world competition, with a good repertoire of phrases that are almost always spot on with the context. It would seem redundant to spend further words on the acclaimed qualitative and quantitative goodness of the game animations, a real plus of the latest FIFA, but to say nothing is to do the developers wrong, who have inserted new ones and who always manage to surprise when the game pops a brand new one out of the cylinder. And since user feedback is not trashed unread, many footballers have been remade from scratch, and now many of those who were previously only pale imitations are finally credible. Obviously not everyone is perfect, seeing Pazzini or many smaller teams is believing, but more generally there was a clear effort to try to improve a sector, that relating to modeling and textures, which was a bit subdued compared to the rest . The same thing can be said for the pitches, which are finally more varied and believable, with striped, circular, squared, rhombus or shaded textures that you can choose during a friendly match.", "date": "2010-04-23", "grade": "9.0"}