{"name": "Slime: Isekai Memories", "ref": "https://multiplayer.it/recensioni/slime-isekai-memories-recensione.html", "text": "The trend is now well established: anime series can represent the perfect starting bases for the construction of mobile RPGs with gacha elements and Japanese publishers seem to never have enough of them, as evidently neither does the public, otherwise there wouldn't be so many, as demonstrated also this review of Slime: Isekai Memories. In this case we are talking about the adaptation of That Time I Got Reincarnated as a Slime, translated into Italian with ~Vita da Slime~, a series created by Fuse and brought into animation by Yasuhito Kikuchi and Atsushi Nakayama with great success all over the world. Bandai Namco has the rights to the videogame adaptation and the rest is easily predictable, considering the structure of the manga/anime: another mobile RPG in which we have to gather allies through a draw system, compose a party and face increasingly threatening challenges in turn-based combat. On the other hand, when an anime has a large and varied cast, complete with the inevitable ~waifu~ of various types, it seems practically made for the construction of a video game of this type. However, let's not dismiss this game in a hasty way, since there are some peculiar elements that stand out even in the midst of the enormous amount of similar games: the main feature of Slime: Isekai Memories is the fact that it combines the classic structure with progressive fights turns, also a system of building and managing a city that manages to vary the structure of the game considerably. It's hard to really find a convincing cohesion between the various parts of this multifaceted title, but for fans of the original series it can be an engaging pastime, while for others it can be an excellent introduction to the story at hand, so it certainly has elements of interest to everyone. Story of a slime In Slime: Isekai Memories the story is told with scenes taken directly from the anime The story of Slime: Isekai Memories is essentially the archetype of the so-called ~isekai~ genre, i.e. the one that involves a protagonist suddenly transported into a world completely foreign to the one to which he is normally a part, giving way to fantastic adventures. Often this world takes on fantasy connotations, but it is not a strict rule: what represents the foundation of the sub-genre in question, which always enjoys enormous success among light novels, manga and anime, is the fact of presenting a character, usually humble and unimportant , in a context completely foreign to his normality but where he can redeem himself by taking part in an adventure with epic implications. In this case Satoru Mikami is a very normal man who, after being stabbed for defending a colleague from a robbery, wakes up in a fantasy world embodied in a small slime. What is practically the most insignificant of monsters soon becomes destined for enormous feats when it is discovered that it possesses particular abilities and manages to contain the enormous power of an ancient dragon, which starts its incredible story. a role of fundamental importance in Slime: Isekai Memories, which in fact represents a sort of transposition of the anime in a partially interactive form. As far as the ~quests~ are concerned, in fact, we limit ourselves to scrolling through the story between screenshots and cutscenes, following the original one of the anime with some original grafts, written specifically for the video game by the authors, allowing in this way to insert also some news for those who already know the story extensively. Even these purely narrative parts denounce the general cohesion problem of the game a bit, given that the quests are limited to presenting narrative moments and compartmentalized combats, with clear breaks between one section and another. Gameplay between fighting and building Slime: Isekai Memories, an image of the cast of protagonists Unlike what often happens with games of this type, the interface is not extremely complex and overloaded with banners and buttons, resulting rather clear and divided into a few legible options, which is certainly a positive thing. From the main screen you can access the various sections that make up the gameplay, i.e. the missions, the construction of the ~world~ and the management of the characters. The combat system is turn-based and is based on the association of identical icons in order to increase the effect of the attack through a multiplier, which by increasing then allows you to unlock ever more powerful attacks. These moves are quite spectacular, merging 3D animations with sequences taken from the anime and creating a really convincing and pleasant effect to see, which tempers if not aI filter the tedium that these clashes tend to create in the grinding phases, which can also be solved through time acceleration and auto-battle, with the obvious nefarious effects in terms of gameplay though. Deeper and perhaps even more interesting is the management aspect, which takes the form of a sort of city builder: with this option we can dedicate ourselves to the construction of our city, which houses the various creatures and populations we house. Slime: Isekai Memories, a screenshot of the city-building mode There are different structures to build with different functions, each requiring a certain amount of resources and time to complete (except going through micro-transactions). The peculiarity of this mode is the fact that you can ~enter~ the 3D city at any time to visit it and talk to the various characters, which has effects on their development and allows you to activate further missions or obtain useful materials.Finally, the management of the characters has the classic importance it holds in RPGs with gacha elements: also in this case we can spend crystals to summon new allies, with different levels of rarity and power up to a maximum of 5 stars. It's still a toss-up, but if nothing else the drop rate isn't too severe (by standards) with a reportedly 4% chance of landing a max-level character. Then there are different evolution systems for each fighter that allow you to lose an enormous amount of time to keep up with the customization. Since there is no push towards multiplayer competition, pay to win is rather avoided, but it is clear that in-app purchases must be used to reach rare characters or reduce expectations.", "date": "2021-11-06", "grade": "6.8"}