{"name": "Caccia grossa", "ref": "https://multiplayer.it/recensioni/76683-monster-hunter-tri-caccia-grossa.html", "text": "Monster Hunter Tri is first of all the result of a commercial consideration, of a quick look by Capcom at the sales numbers in Japan and the consequent choice to exploit the white Nintendo console as a springboard for (re)launching a brand which, in living rooms, it hasn't arrived since the days of PlayStation 2 and in the meantime it has established itself in the 47 prefectures that lead to Tokyo through three incredibly successful PSP chapters. An attention in addressing an already largely loyal user which in any case did not prevent the Japanese developer from building piece by piece a chapter of the highest quality, capable of replicating the formula already appreciated by many and in addition adding a whole series of innovations that can guarantee a better use sitting in an armchair in front of the television and, hopes the developer of Osaka, a finally completed establishment in western markets. The one that has now been released in stores for a few days, including in Italy, is one of the best titles available on Wii and at the same time the furthest that can be mentally associated with a platform that has made Wii Sport its main strong point, an immense game which, not without some contradictions, rightfully fits among the most beautiful of this first part of the year. One hunter, two stories For those who are not yet accustomed to the series, Monster Hunter puts you in the role of a hunter immersed in a world between the fantastic and the prehistoric. The ultimate goal of each game session is therefore to track down, face and then defeat increasingly larger beasts; the uniqueness of the experience, however, is not so much in the dynamics of the clashes themselves, however fantastic, but in the complex of choices and actions that the user is called upon to make in the course of preparing for each clash, in the way he can interact with the game world and the many possibilities it offers. Once the first hours have been completed and the lower level missions have been completed, each new task will therefore have to be carefully prepared, evaluating whether the equipment available can be adequate for the proposed challenge and, if not, dedicating lengthy searches to find what is necessary to forge new weapons and armor or improve the ones you have, collecting herbs and taking the meat of animals so you can provide for your own subsistence. Immersing yourself in Monster Hunter Tri is first of all doing it in its ecosystem, getting to know the dozens of plants, insects, rocks, fossils, animals and situations it offers, so as to exploit them to your advantage during the recurrence of a structure which, inevitably, it repeats again and again ad infinitum but is splendidly supported by a mass of different contents, all or almost all constructed with ingenuity. The multiplayer component returns in this iteration in all its facets and once again represents the heart of the experience, with up to four players who can be within the Capcom servers - in Europe and America without having to pay any monthly fee - and face the missions offered by the Guild of Hunters, divided into six levels of difficulty. The integration with Wii Speak is an added value while the online sector on Wii, even if not at the level of the competition, is far more accessible than that which can be experienced on PSP through complex procedures and software not supplied by the developers. In any case, it was decided to also give dignity to the single-player adventure, where you will find yourself in the middle of a village shaken by a series of earthquakes and other calamities, the only bulwark of the inhabitants who will have to be defended from the dangers of the outside world and help yourself to rebuild what was destroyed during the tremors before the player entered the scene. In single player Monster Hunter Tri develops exactly as when in the company of three other adventurers, if it weren't for a series of additions related precisely to the management of the fishing settlement which acts as a center for the collection of missions and the interaction with non-playing characters: as you progress through the adventure you will be able to satisfy certain requests so as to improve the infrastructure, you will have to manage a vegetable garden and send a ship to sea so as to have further supplies, you will be able to interact with Cha Cha - an odd traveling companion who according to to the mask he wears will help the hunter with special skills - and you will need to furnish the house that you use to keep excess supplies and where you can save them from. Many small additions that added up manage to give enough ideas to fill the absence of a strong narrative structure and not mortify the solo game, further stimulated by the possibility of bringing onlineine, and vice versa, the same character so as to enjoy the progress made on both fronts. A weapon for every need If the structure that underlies the game works, the same can be said of the management of one's alter ego. The third-person camera favors an extremely articulated real-time combat system where the seven types of weapons, not all of which are present from the start and including two-handed broadswords, one with the other engaged by the shield, spears, hammers, crossbows, longswords and the new Changeling Axe, capable of changing shape as needed, offer completely different possibilities both in terms of controls and strategies adopted. In this sense, one of the few weight defects of the product is the inadequacy of the console's peculiar control system: there are many keys and their combinations and they must be accompanied by remarkable precision in the movements, especially when using the heaviest weapons, to the point that Wiimote and Nunchuck represent a very viable option. The Classic Controller is much better, perhaps in the Pro version sold together with some game bundles. Whatever weapon you choose, the ever greater mastery of the controls is achieved hand in hand with increasing difficulty level, showing off a balance that, declined as it is on all fronts of the title, manages to introduce even the new user and then accelerate reaching the heights of complexity of which the series is capable. Growth is as usual unrelated to levels and experience points. In fact, everything passes from the equipment you have, with the armor, weapons and decorations, necessary to have bonuses in combat but not only, increasingly powerful and available as you climb the degrees in which they are divided the quests given by the guild. The importance of the clothes and the offensive tools is functional to the fights but, being the result of the reworking of the materials collected during the raids for the maps, therefore of the experience in its entirety, it almost ends up filling the narrative gap of Monster Hunter Tri: it is as if the story of the player and his exploits were told and made immediately recognizable to all the others precisely by the sets he owns. In many it is beautiful Although it is possible to play in special offline arenas, via split screen, the strong point of the multiplayer experience remains online. The options are quite varied and allow you to choose between different types of servers - normal, based on the Hunter Rank achieved or if you were trying to complete a certain objective - then supporting the choice with an infrastructure that guarantees good customization, which accompanies the user up to the team of four players who actually jump into the action. The city of Loc Loc, the counterpart of the Moga village present in single player, has all the merchants necessary to enhance the arsenal of one's alter ego, while the menus, initially a bit difficult, are designed to manage the high amount of possibilities offered. The chat and messaging have been implemented but are not very usable via virtual keyboard, making it preferable to use Wii Speak if it were in possession. Always moving The hunting environments are again divided into smaller areas, so anyone who has already experienced the level design approach of the series will feel right at home. The player can move from one map to another and so do the animals that populate them, often different according to the needs imposed by the mission in progress, exploiting the all in all limited movement possibilities to create particularly interesting interactions, with some enemies in able to escape to fetch when low on stamina and others migrating to different areas following the day-night cycle. Totally new are the marine environments that introduce a whole series of new monsters and a decidedly original battlefield, with a third dimension for easy-to-master movement thanks to well-studied controls. Visually, the work done is more than remarkable despite the limitations imposed by the console. In fact, Monster Hunter Tri takes advantage of what the Wii makes available to move a good amount of polygons and create environments of a certain complexity, without forgetting suggestive glimpses and panoramas with a visual horizon that are difficult to experience elsewhere. Where Capcom has outdone itself though is on the artistic front. The monsters are a mixture of old and new acquaintances, all absolutely fantastic custodians of a crystalline talent in uniting the charm of pre-historic creatures with an exceptional imagination; just looksome of the new creations made for the deep sea to understand how good the artists have been. Similar speech for weapons and armor, increasingly large and complex, and for the environments that overflow with details, as well as charm. Artificial intelligence falls within a delicate discussion, in the sense that if on the one hand the presence of strict behavioral patterns in the enemies is evident, very unwilling to change according to the user's actions, on the other hand the constant position of inferiority of the player when against more powerful opponents, requires the latter to adapt and not to lead the dance, highlighting any gaps.", "date": "2010-04-26", "grade": "9.0"}