{"name": "Max", "ref": "https://multiplayer.it/recensioni/76430-sam-max-the-devils-playhouse-episode-1-the-penal-zone-max-fammi-la-cortesia-dimmi-cosa-sto-per-fare.html", "text": "Version tested: PC ~Impossible! A gorilla driving a spaceship in the shape of a monkey's head is shooting at the skyscrapers of Manhattan,~ said the detective dog to the talking rabbit. This delusional opening takes inspiration from the first minutes of the game offered by Sam & Max: The Penal Zone, which see us grappling with Sam and Max prisoners of a space monkey determined to overwhelm, steal and annihilate. In short: the usual things that megalomaniac space monkeys do. For a change, the targeted city is New York, which one day someone will sink and say it never existed, like Atlantis. But let's not digress. The first impact you will understand that it was unsettling, but a narrative voice embodied by a character who seems to come out of an Altman film brings us back to reality. We were simply seeing the future, in which we will help a talking alien brain lock up the conquering gorilla in the Penal Zone. At this point, with a dizzying narrative ellipse, the game brings us back to the present, just as a monkey-shaped spaceship lands in the street where Sam and Max live. The duo then find themselves facing their nemesis, who pretends to be well-intentioned. We will therefore live a long flashback until we hang up on the future, which will therefore become the present. But are we sure that everything will go as in the initial vision? We have already met? Ah yes, in the future The desire to dare is clear from the first minutes of the game. The temporal manipulation of history is a promising business card for a series that has reached its third season without giving any sign of wanting to end; even Lost decided to close earlier. However, this narrative cut and stitch, with accelerations and rewinds, is not the only nonconformist gesture of the duo created by Steve Purcell. Now we can in fact take control of Max, who has developed super mental powers for the occasion. On this point, the game seems to want to offer us a vision of what awaits us in the next chapters: the episode opens with a succession of ingenious options for Max. For one thing, thanks to the power of rhinoplasty, he can transform himself into any painted image he sees. in front of him. Let's take an example: there is a bazooka on the spaceship. We choose Max and enter a slowed down first person view. We choose the power of rhinoplasty and transform ourselves into a bazooka with the ~face~ of Max. Insane, yes. But also hilarious. In any case, during the episode we can only use two powers, one of which allows us to teleport near a telephone, while the second allows us to see glimpses of actions that will take place in the future. This is the real, big news of the third season of Sam and Max. Instead, Sam's commands reflect in all respects those of the classic point and click, except for the usual hybrid mouse-keyboard control hated by PC owners. Max's powers also pave the way for a new approach to puzzles, which we must solve by imagining backwards the actions to be taken in order to arrive at the consequences shown by his flashes of clairvoyance. At first it takes some time to get into the new perspective, but then everything proceeds with simplicity and we begin to fully appreciate the open-mindedness of Chuck Jordan, the director of The Penal Zone. However, the adventure is dishearteningly short. Some puzzles are a little more difficult and if you don't pick up the pace immediately it will take you 4 or 5 hours to finish it, but many will finish it in half the time. Definitely little to be able to digest the temporal somersaults of history. Sam & Max: The Devil's Playhouse is the third series of five episodes on the adventures of Sam and Max. The episodes are released on a monthly basis and from time to time you can read the review on Multiplayer.it. The price for the entire series is about 35 dollars if purchased on the developer's site, 32.99 euros on Steam. On iPad, through the Apple App Store, each episode costs $6.99. NOTE: At launch, all episodes of Sam & Max: The Devil's Playhouse are available in English only. Is all that glitters gold? It's not easy to talk about the Telltale series, because the episodes are so short that even revealing two key points of the story means halving the fun. We therefore prefer to spend a few words on the aspect of the game, which is surpassed compared to the past, with much more convincing models and lights. The dubbing of the characters is splendid, but remains in English. And even more than in Tales of Monkey Island or Wallace & Gromit, it is necessary to carefully follow the subtitles and to know the Anglo-Saxon language well to enjoy the cunning and winking speech of the duo. Sam and Max could in fact be a cabaret couplein the flesh, and entertaining a crowd of patrons in a small, smoky theater in New York, they are so close to shouldering each other's lines. Added to their indisputable charisma are the possibilities opened up by Max's powers, a new dialogue interface that replaces sentences with conversation topics, and a story made up of snatches and misdirections. So why, after so many praises, does the vote not touch the upper floors? There are two reasons: first of all, the episode fades in a few hours, which are not an absolute defect even given the price, but as often happens with Telltale games, they whet the appetite and then leave the player on an empty stomach. Second, the story, after a glitzy start, loses a few bumps along the way. In addition, some secondary characters are rather boring compared to the duo of protagonists and Skun'ka'pe, the intergalactic monkey. In short, the impatient wait for the final showdown dominates the episode, which everyone will be able to enjoy regardless of past knowledge of the series. In fact, for old players there is no shortage of references to what happened in the past, but without detracting from the fun of the newcomers.", "date": "2010-04-20", "grade": "7.5"}