{"name": "La foresta oscura di Dante", "ref": "https://multiplayer.it/recensioni/75774-dantes-inferno-dark-forest-la-foresta-oscura-di-dante.html", "text": "Version tested: PlayStation 3 Dante's Inferno has been one of the biggest videogame successes of recent times for EA. While failing to press his Majesty God of War qualitatively and in results, a model to imitate and a more or less declared objective to equal for Visceral Games, given the sale in hand the game starring a heroic Dante who with the great poet actually nothing has to do with it has conquered many players around the world, to the point that Universal Pictures has already secured the rights to make a film adaptation. However, it is undeniable that the success of this production has certainly contributed more than the intrinsic value of the same, in any case more than discreet, an apt advertising campaign and above all the attention, at times morbid, directed by the media towards the product especially after the controversies that arose around to the figure of Alighieri and to the adaptation of the Divine Comedy made by the developers with more than a few ~poetic license~, just to stay on topic, for gameplay and narrative needs. In fact, the software house has made a big effort to try to simplify the general narrative by giving it greater linearity than the book. Beyond the questionable choice or not to readjust Dante's Inferno in this way, and for any other consideration on the subject, we still refer you to the complete review available at this address. Dark forest or thicket? We focus on this expansion titled Dante's Inferno Dark Forest available for PlayStation 3 and Xbox 360 on the respective markets at a price of 400 Points - 4.99 or ~free~ for those who purchased the American Divine Edition of the game exclusively for the console Sony right in the USA. Version which also contains other goodies such as a comment from the developers, a digital art book by Wayne Barlowe (the illustrator who worked on the characterization of the game), the soundtrack and a digital version of the complete translation of the Divine Comedy ad Longfellow's work. In terms of plot, this Dark Forest has little to say: it is the real prologue of the original game. That is, at the moment in the story of the Divine Comedy in which Dante gets lost in the ~dark forest~ before meeting Virgil and descending into Hell. It therefore does not add anything in terms of plot or deepening of the characters. The DLC is accessible directly from the Dante's Inferno main menu and does not require the latter to be completed to be played. Immediately after loading the extra level, the gamer is immediately projected into the game without a cut-scene or other form of introduction. And the dances begin with combos and various attacks. Immediately, or almost immediately, the novelties offered by the product catch the eye. First of all, there are two new types of enemies, namely the siren of the forest, which will appear sculettante in front of our hero as soon as he enters the aforementioned area, and the classic undead knight. Then the skills of the protagonist, all already unlocked and usable, a feature this is counterbalanced by a general level of difficulty slightly above average. Finally a Warth Stone and some unpublished puzzles to be completed in order to continue. However, the latter seem almost placed there at random by the developers just to slow down the player and lengthen the duration of the adventure a bit. Without, however, succeeding: longevity is on balance the real, great Achilles heel of this DLC: the overall duration of Dante's Inferno Dark Forest varies on average from 20 to 30 minutes depending on the skill of the gamer. A pittance considering the cost in money or points of the expansion and above all the potential of the setting, the most fascinating and controversial element of Dante's Inferno. Playstation 3 trophies There are only two, both Bronze, Trophies available in Dante's Inferno Dark Forest. They can be conquered by respectively completing the DLC at least once on any difficulty level for the first, without being defeated even once for the second. Disco Inferno. sigh To the novelties present there is also an unpublished costume which honestly in our opinion the developers could also avoid including in the pack. It is in fact a 70s dress, very similar to the one used by John Travolta in the famous film Saturday Night Fever, a film in which one of the most famous songs of the original soundtrack was Disco Inferno (hence perhaps the link.. .). It is true that it was probably created by Visceral Games with the intention of playing down and making the setting of the product a little less gloomy, but it is equally true that it ends up being a little ridiculous in the context. For thethere is little else to report. The graphics engine is obviously the same as Dante's Inferno with all its pros and cons. At a solid frame rate, detailed bosses made with excellent characterization, fascinating scenography, not so much for the aesthetics themselves, but rather for the settings and views in general, they are counterbalanced by a rather low polygonal detail in the enemies and sources of elementary light and devoid of any decent reflection effect on structures and characters. However, strange to say, it attracts, pleases. We are not talking about raw graphics, but about style and, more particularly, about the construction of a fascinating world, even in its technical limitations. Ditto the audio sector which among other things is limited mainly for the reasons mentioned above (meager plot and very few dialogues) to the sounds and noises of battle or side dishes and to the music that makes up the soundtrack, all of good quality.", "date": "2010-04-21", "grade": "6.0"}