{"name": "Curve tutt'altro che pericolose", "ref": "https://multiplayer.it/recensioni/76328-gti-club-supermini-festa-curve-tuttaltro-che-pericolose.html", "text": "Tested version: Nintendo WiiThe situation of racing games for Wii is not the best, with noteworthy products that can be counted on the fingers of one hand and are always and in any case characterized by an arcade connotation. After all, the idea of creating a real simulation for a console openly aimed at a ~casual~ audience appears out of this world. However, developing an arcade racer of great quality and thickness is still a possible undertaking (SEGA knows it well, which has a good number of them to its credit); and in this case it is a renowned manufacturer like Konami who tries, bringing the latest episode of the GTI Club series to the Nintendo system, which made its debut in the now distant 1996 in the arcade and which allowed us to choose our car from four different models, with an honorable mention for the Mini Cooper. Mini Cooper that we find in GTI Club: Supermini Festa! together with fifteen other classic or production cars, among which the new 500 Abarth, the glorious A112, the Renault 5 Alpine Turbo, the Lancia Delta Integrale, the Peugeot 207 GTi, etc. stand out. Big party Once the game has started, we are immediately presented with the three different modes available (Arcade, Missions, Nintendo Wi-Fi Connection), supported by the ~Garage~ item, in which we can customize our cars by applying the components earned through racing. In this case, we can adjust the height of the suspension, choose a livery from those unlocked (but not freely modify the paintwork), change the rims with sporty variants and apply aerodynamic appendages with more aesthetic than functional value. Whichever mode is selected, the intention of the developers to understand this new episode of GTI Club as a product dedicated to multiplayer, both locally and online, is immediately clear. Each game can in fact be played together with three friends via split screen, or through a series of different online challenges, always for a maximum of four players. Once the Nintendo Wi-Fi Connection is activated, the choice turns out to be quite varied, offering us all the variants available within the Arcade mode and the Missions mode. As for the latter, we have ~collect the coins~, or rather a race in which we have to collect as many coins as possible within a track, trying to hinder our opponents in any way; ~target hunting~, which is based on the same competitive spirit, but in this case the targets that we manage to hit with a tomato-shooting cannon (yes) mounted on the car count; ~tomato war~ or a variant in which we simply have to hit the other players with the cannon just mentioned, in which whoever scores the most points wins; ~drive the ball~, an absurd group race in which you have to push a huge soccer ball with your car in the middle of the city, between ups and downs, to make it pass the checkpoints to the finish line; ~football~, in which we have to push a big ball into the net trying to score more goals than our opponents. The Italian Job As for the further seven challenges of the Arcade mode, they add to what has already been listed two different elimination races (~pass the bomb~ and ~take the prize~) based on collision and time limit, a variant of team soccer by two and what ultimately turns out to be the closest thing to a normal speed run: ~avoid traffic~. Unfortunately, even in the latter case, the typical facets of tournaments are completely missing, so the game is an end in itself and the only element of progression consists of the unlockable prizes and the possibility of accessing extended versions of the tracks. While wanting to consider GTI Club: Supermini Party! a sort of ~alternative~ racing game, designed for bizarre multiplayer challenges rather than offering the classic and ~basic~ elements of its genre, the lack of support from an adequate technical sector weighs heavily on the enjoyment of the experience . Firstly, the frame rate appears too unstable and prone to drops, creating major problems with the motion-detecting controls: the car's reaction when we turn the Wii Wheel is immediate, but the judder makes everything very confusing and sloppy. Secondly, the polygonal models of the cars leave much to be desired in terms of detail and behavior on the road, and they move within scenarios devoid of interactable elements, based on the very old GTI Club tracks and therefore anything but ~fresh~. Switching to cel shading would probably have guaranteed greater fluidity (essential in any Wii game) and more cheerful and incisive graphics: a pityto.", "date": "2010-04-14", "grade": "5.0"}