{"name": "Un'espansione per Drake", "ref": "https://multiplayer.it/recensioni/75186-uncharted-2-il-covo-dei-ladri-unespansione-per-drake.html", "text": "Few expected that even the multiplayer mode of Uncharted 2: Il Covo dei Ladri, added almost only for completeness and totally ancillary, would have conquered such a large and loyal slice of users, but it is obviously a mode in the making, subject to repeated adjustments, corrections and modifications. And Naughty Dog seem to have painstakingly monitored the evolution of their product and the response of the gaming community, which often makes the difference and directs the developers on the right path. The triptych of patches released in the last period, from update 1.04 to 1.06, has for example decisively influenced the design of the two maps included in the Drake's Fortune Multiplayer Pack, which seem to want to stem some issues that have been controversial for some time, such as the phenomenon of ~camping~ (that is, the search for suitable points where to position oneself and wait with the patience of a hired sniper for the passage of the unfortunate person on duty). But with this in mind, is it worth buying this Additional Content? Ruins... The additional content is called Drake's Fortune Multiplayer Pack precisely because the two maps included are based on some settings of Uncharted: Drake's Fortune. The Flooded Ruins is the map inspired by Chapter 10 of the first Uncharted, and it's also the one we liked the most. Technically, the work done by Naughty Dog is amazing: the setting is very accurate both in terms of general design and details, such as the splendid touch of class of the crashed and burning helicopter, with the blade still swinging, or of the storm which takes place during the game, between lightning, thunder and the eerie hiss of the wind, all in a pouring rain. Unlike most other maps, The Flooded Ruins is asymmetrical, a feature that makes it much more interesting to play, and is crammed with obstacles and buildings to climb or use as shelter, so much so that it seems almost crowded in certain points. It's practically heaven for players who like to hide out while waiting for the best opportunity to charge. However, some points remain little traveled, as they are too open to fire from snipers stationed in the raised areas. It is certainly a map designed for melee players, but which also leaves a certain leeway and inventiveness to the ~campers~. Playstation 3 trophies Purchasing the Drake's Fortune Multiplayer Pack also unlocks twelve new Trophies for playing Uncharted 2: Among Thieves in modes where you can meet the requirements. The challenges offered by the eleven Bronze Trophies vary from completing three Co-op modes on Hard to winning fifty matches on Objective, the Silver Trophy requires the killing of at least 2,500 opponents in competitive modes. ... and deposits The Facility, on the other hand, is inspired by Chapter 18 of Uncharted and is an ingenious, fairly symmetrical map that definitely discourages ~camping~ due to the amount of elevations, hiding places and obstructions to the line of fire. The map focuses on close quarters combat and sneak attack, encouraging player mobility and exploration. Some mobile elements move to the upper levels temporarily preventing you from shooting from one point of the room to another, a rather ingenious idea that the most skilled will be able to exploit properly. The original setting has been faithfully reproduced and expanded with numerous details and details that make it truly a feast for the eyes; it is especially characterized by numerous gray areas to be strategically exploited, even if in a certain sense they are an advantage for the characters with darker clothes. Like The Flooded Ruins, The Facility is also very large, almost double the size of those already available, and can be played in all competitive modes but also in Arena mode. In addition to the maps, the new Trophies and some unpublished Medals, the players who purchase the Drake's Fortune Multiplayer Pack will also have access to six new ~skins~, i.e. characters to choose for the games: in addition to the original versions of Nate and Elena, also added Gabriel Roman, Navarro, the mercenary Javier and the nice Eddy Raja.", "date": "2010-04-06", "grade": "8.0"}