{"name": "I Puffi - Missione Vilfoglia", "ref": "https://multiplayer.it/recensioni/i-puffi-missione-vilfoglia-recensione.html", "text": "Over the years the Smurfs and the world of video games have met over and over again: not always in a memorable way, it's true, but raise your hand if you don't remember at least the 1999 video game of the same name, released on the first PlayStation. The review of The Smurfs - Mission Fel Leaf is only the starting point for a more ambitious project. Not ours, but that of Microids, which has entered into agreements with the rights holders of the little blue men for at least four other video games that will be released in the coming years. The goal is to introduce the Smurfs to younger users, also thanks to a new animated series that will be carried out at the same time as the video games. There is a certain liberating sense in admitting that you have had prejudices and that they then turned out to be completely out of place. The Smurfs: Fel Leaf Mission is not your usual tie-in. The name of Microids should have warned us: the production proved to be convincing, net of some really annoying flaws. Synopsis: The Fel Leaf Threat One of the many bouncing platforms from The Smurfs - Fel Leaf Mission The plot of The Smurfs - Fel Leaf Mission is very simple and perfectly in line with the many episodes of the animated series that you will certainly have had the opportunity to enjoy as a child (or in the company of your children/grandchildren). The important thing, after all, is that it works. In this case, the wizard Gargamel has come up with another of his own: failing to find or capture the Smurfs, he has decided to use an ancient magic to summon the Fel Leaf. We are talking about a highly versatile and above all toxic climbing plant. The spell has caused the threat of the Fel Leaf to invade the Smurfs Village, the surrounding forest, but also more distant places such as the castle, the dam and various areas that you will meet along the way which, in about eight hours, will lead you to the credits. The environmentalist message is clear enough: nature must be saved from this harmful element created by human beings. The problem is that the Fel Leaf has also begun to summon annoying little monsters of various types (the main enemies to fight) and even Fel Traps that can trap the Smurfs by making their location known to Gargamel himself. Quite a problem. Amazon offer The Smurfs. Mission Valfoglia - Collector's Edition - Collector's - Nintendo Switch 79.99 See Offer Luckily the Smurfs do not hold back in the face of danger: a few words from Papa Smurf are enough to convince the protagonists Hefty, Brainy, Cook and Smurfette to set off on the charge. Each of them will manage a part of the game levels, until it is possible to change them: in fact, the style of play does not change, because at the center of the production, more than the individual Smurfs, there is their all-new battle tool: the Smurfizer. Gameplay: Use that Smurfizer The smurfs from The Smurfs - Fel Leaf Mission in action Smurf rhymes with Inventor, which is the name of the Smurf who created it. Like all his creations, not everything works properly, but, in short, in a similar context there is no time to complain. The use of the Smurfizer is explicitly inspired by the Splac 3000 from Super Mario Sunshine: its jets of healing essence eliminate the Fel Leaf, stun enemies, allow you to create passages to advance in the surrounding environment. In addition, the Smurfs can use the machinery to dash at high speed and knock over wooden obstacles, perform a ground pound, even to fly short distances. All the gameplay of The Smurfs - Fel Leaf Mission revolves around the functioning of this machine as handcrafted as it is futuristic. The various levels, in fact, hide different types of collectibles which can then be spent at the Inventor's workshop to upgrade the Smurfizer and improve its features (or directly unlock new ones). The weapon proves to be versatile in the various environments, which basically respond to two genres: the adventure and the platform. You will thus notice the alternation of more horizontal places, in which you continue by simply eliminating various enemies and the Fel Leaf present, and other more vertical ones, in which a certain skill (which you did not expect) in jumping between platforms proves to be fundamental in continuing . Since certain items can only be reached after unlocking new powers, replayability is boosted quite convincingly. Limits and a little surprise The game environments of The Smurfs - Fel Leaf Mission are inspired, but all too similar If The Smurfs: Fel Leaf Mission fails to reach a higher rating than the one you are about to read, it is not because it is notdisputing. The problems (or limitations) are basically two: an excessive linearity in the structure and variety of the main levels (clear the area, fight the enemies, free the area, talk to the Smurfs, free the area and so on) and, above all, the technical sector. On Nintendo Switch - the console on which we carried out the test - the graphic detail and the framerate are close to reaching historic lows: a good cleaning and revised optimization would have been really necessary, also because it is strange that a similar title is unable to shine on Nintendo Switch. The resolution, in particular, is far too low; best of all, it doesn't get any better when switching from portable to TV mode. Most likely on Xbox, PlayStation or PC, the other platforms on which the game is available, this problem will have less impact on the quality of the experience. On the other hand, the presence of a small surprise on which to date, voluntarily, not a single one had been spent word. In Smurfs - Fel Leaf Mission there is also a local cooperative mode, in which the second player, equipped with Joy-Con, controls a small robot and supports the Smurf in the adventure. He can do this by throwing small seeds capable of disturbing enemies, independently healing corrupted plants, and more generally by flying freely in the surrounding environment. Here, perhaps, the platformer taken as a model is Super Mario Odyssey.", "date": "2021-11-03", "grade": "7.5"}