{"name": "Anche Sonic ha il suo kart", "ref": "https://multiplayer.it/recensioni/75690-sonic-sega-all-stars-racing-anche-sonic-ha-il-suo-kart.html", "text": "It has now been 5 long years since the release of the Nintendo DS version of Mario Kart, a five-year period in which no pretender to the throne of best kart racing for the Nintendo portable has posed a serious threat to the undisputed king of the genre. At the time, the scope of the Nintendo game was amazing, above all because it presented itself as a ram of that Nintendo Wi-Fi Connection which in the following years would become more and more widespread until it became the solid platform that we are now accustomed to exploiting in many titles present on the market. Although it wasn't the best chapter in the series, marred by somewhat confusing game mechanics compared to the traditional strategic approach of the first few episodes, Mario Kart has so far remained the most valid offer for those intending to try their hand at an arcade racing multiplayer on DS. After 5 years, Sega's answer arrives with Sonic & Sega All-Star Racing, which is proposed as a fundamentally different production as it is multiplatform but decidedly similar in concept, with some almost suspicious similarities. Those who have worn their fingers with the mariesco kart will immediately find themselves at ease with this Sega title, which maintains the same setting as the progenitor both in terms of game options and for various gameplay elements. Indeed, finding ourselves evaluating the game on a platform like Nintendo DS, we cannot escape the main issue: the direct comparison with Mario Kart. The time that has passed since the latter's release obviously plays in favor of the Sega product, which however fails to surpass, or even match, the quintessential kart racing. Not differentiating itself that much Sonic & Sega All-Star Racing counts on a well-established and undoubtedly pleasant structure, to which must be added a respectable technical realization, but risks not finding a real reason for being if the genre is already dominated from a title of the caliber of the Nintendo product. There is so much to run The structure is by now well codified of the kart racer, or rather a sub-species of the racing game with a strongly arcade matrix: in an absolutely unrealistic context, we find ourselves driving with the chosen driver inside improbable tracks (all characterized here from the different settings offered by the Sega catalog) competing not only with driving skills, but also through a strategic use of various attack and defense weapons, decidedly similar (at least in concept and functioning) to the well-known shells, banana peels , and accelerant mushrooms (among all the others) of mariesca memory, obviously with a different look and inspired by the Sega series. The driving system itself is clearly inspired by the other kart game, with the introduction here too of the controlled drift when cornering, necessary to obtain a momentary acceleration once the maneuver has been completed. The present play offer, between single and multiplayer games, is abundant. We therefore find ourselves choosing our own driver among the large group of racers taken from the most famous Sega series - each equipped with its own typical vehicle and different driving characteristics, with many other drivers unlockable by spending the Miles points accumulated as the game progresses - and with this, launch into one of the various game modes present. Here too the choices made by Sega and Sumo Digital have something derivative, but the amount of game to be completed even in single player, with all the gang of drivers and tracks to unlock, manages to provide long hours of gameplay. The main mode is obviously the grand prix, in which we have to face a series of tracks in sequence and win the points classification at the end of the run, but there are also quick races and Missions. The latter are characterized by a decidedly different approach from the normal race: in a similar way to what happens in Mario Kart, here too it is a question of facing a series of challenges in which it is required to complete a particular objective within the various tracks . It is something similar to the analogous modality present in the recent Out Runs, in which we have to carry out precise actions in a given time limit (collect objects, hit elements on the track, beat the opponents in a certain way, perform drifts), at the end of which we are judged on the basis of the results achieved. A minimum score is required to continue to the next stage, with variable rewards (again as in the Grand Prix) in terms of Miles to be spent in the ~market~. A small splinter Instead of building a different version specifically tailored for the Nintendo DS, given the obvious differencein terms of the computational power that separates the portable from the home consoles, Sega has opted for the direct reduction to the small size of the original experience. The tracks are therefore the same that we find in the larger version, obviously adapted to the potential of the Nintendo DS, with the necessary reductions in terms of the amount of elements on the screen and the polygons used. However, what is most striking at the outset is the fluidity that characterizes everything: while the main flaw of the domestic versions is precisely the unstable framerate which often becomes catastrophic in the most agitated situations, the Nintendo DS edition sports a practically constant fluidity which results in a truly satisfying racing experience, despite the downsizing imposed on the graphics sector. Driving is a little more chaotic than the other versions, as the drift system tends to be less controllable and there is little time and poor visibility to develop counteroffensives or attack strategies with the weapons made available, things that tend to undermine the enjoyment of the game. The multiplayer sector obviously represents the main element on which the longevity of the title is based, an option which, although present in a rather extensive way, suffers from some defects that reduce its value. In essence, the best way to fully enjoy the multiplayer experience is the local wireless connection with multiple game cartridges, the only case in which we can take advantage of the full potential offered by Sonic & Sega All-Star Racing, although the run is still limited to 4 participants, as in all multiplayer options. In this case we can dedicate ourselves to the Grand Prix or the battle, present only in the presence of several cartridges. If you own only one cartridge it is possible to face only one Grand Prix at a time and with only two riders, in any case the choice of tracks available in multi-player mode remains limited compared to the contents present in single. Finally, online multiplayer via Wi-Fi Connection allows the Grand Prix for up to 4 players within a selection of tracks: in this case, the gaming experience obviously enjoys the convenience of being able to exploit the pool of connected users online, although there are some uncertainties to be noted in the data transmission resulting in some visible lag at times.", "date": "2010-03-22", "grade": "8.0"}