{"name": "La fine di una lunga guerra", "ref": "https://multiplayer.it/recensioni/75381-command-conquer-4-tiberian-twilight-la-fine-di-una-lunga-guerra.html", "text": "Will the Command & Conquer saga end, at least in its current form, with this fourth episode? Will the NODs and GDIs, which have been shooting pixels at each other since 1995, cease hostilities and all subscribe to an MMORPG with mellow characters? Who can tell. EA has promised news for the future. For now, however, we can only see how this Command & Conquer 4: Tiberian Twilight came out, in which Kane seems redeemed and wants to end the war to start a now inevitable hair treatment. Is it right to trust the mariulo with the grullo face and combed by a sander? But, above all, why are there still Smart cars on the streets of the future? We'll only find out by taking part in the two campaigns, one by NOD and one by GDI, playable in single player or cooperative mode (but without Littizzetto trying to sell you hams). Each consists of eleven missions, of which the first three serve as tutorials and do not award experience points. At the beginning of each mission you can choose the level of difficulty you want to play, you can check the troops available and then you can start the game. Accumulations and discharges The main purpose of each map is to destroy or conquer predetermined objectives. In some cases it will be necessary to escort vehicles or free allies, but these are still variations on the same style of play. Once you have chosen the crawler to use (defensive, offensive or support), you have to land it in one of the landing areas. The crawler is the mobile base of your army, capable of building the troops you need for battle, creating defensive infrastructure such as turrets or bunkers, and providing technological upgrades that improve the army's performance in the field. The troops that can be produced vary according to the type of crawler chosen and greatly modify the style of play. In reality, initially you do not have all the units available and you will have to unlock them by leveling up. For this reason, the first time you play it is quite difficult to finish a campaign already at a normal level and it is better to start from the easy one and then play again, increasing the difficulty, with more performing troops available. There are several ways to gain experience. The most obvious is to fight and destroy the opposing troops. Another is to collect the red tiberium scattered around the maps, which moreover also serves to buy the indispensable technological upgrades. Other ways to make it are by achieving certain objectives and passing missions. The essence of the game The average difficulty of the missions is decidedly high, especially if you face them unprepared and without the right troops. Why we chose to make life difficult for the player is very simple: Command & Conquer 4: Tiberium Twilight is fully multiplayer oriented. In fact the single player campaigns are quite boring and obvious if played alone. Cut-scenes with actors are poorly acted In short, they lack bite and a few hours of play are enough to understand that the maps are designed for multiple players. Also, to win in singles just select the offensive crawler and you never feel the need to choose the others, except on a couple of occasions. Let's also add the general brevity of the two campaigns, which are finished in a few hours of play (let's say five each), and you will understand very well that if you are looking for a strategy game to play alone, it is better to go elsewhere. The cooperative mode overturns the judgment because it becomes necessary to plan moves better, coordinate and more complex strategies can be developed to face enemies. It is always necessary to have reached a higher level to have all the troops available, but at least the game manages to express itself at its best and, above all, can reveal its true nature. Simplified strategies But let's go back to the single player campaigns. In many maps there is very little to do, in the sense that since there are no resources to collect and being designed to immediately throw the player into the action, you are following a fixed pattern that requires the immediate production of the maximum number of troops possible with subsequent cautious advance and constant supply of troops by the crawler. The combat strategies are not very elaborate and in most cases it is enough to move with circumspection having in mind to produce troops of all types in order not to find oneself discovered. Usually it is enough to create an attack group supported by healing units in order not to have too many tactical problems. The linearity of most clashes makes stra processing superfluousadvanced tegies. As the level of difficulty increases, everything becomes more difficult and you need to be quicker in making decisions, but the patterns to follow remain more or less the same. Ironically, multiplayer maps are much more complex and elaborate than single player maps, offering different buildings to conquer and resources to dominate. Who doesn't play together.... The validity of the cooperative, decidedly more enjoyable than the single one, has already been mentioned in the body of the review. The competitive options, which will not have a dedicated server and LAN service, relying on P2P, have instead been explored in a specially compiled article and the result of the beta of the past weeks. The mechanics are those at the base of the chapter, with the acquisition of experience points and the differentiation between the three ~classes~: offensive, defensive and support. Players reach a maximum of 10 and have to face each other through rather classic modes - during which to capture control points, for example, and always with objectives - taking advantage of some new features such as the possibility of respawning after the destruction of your Crawler , but they will go into depth after the release as it was not possible to do it in the review, with practically no one online. In general, this sector seems interesting even if this year, even without having to bother with StarCraft II, there are several valid alternatives. Agile and fast Technically Command & Conquer 4: Tiberian Twilight is done really well, with detailed troops facing each other in battles three dozen vehicles without causing sudden losses of fluidity. Even the special effects are really well done, with spectacular explosions and laser beams criss-crossing in a network of multicolored lights. Not really at the top are the tacky cutscenes which, as tradition dictates, are made with real actors, and certain somewhat coarse animations, such as those of some types of missiles that follow unnatural trajectories. Fortunately these are trifles, especially if we think of the fact that the game is very fluid even on machines that are not exactly very powerful and that the framerate tends to remain stable even in the most agitated situations. From the point of view of the soundtrack we have some good music that frames a good number of rich and detailed sound effects. Nothing that makes you cry out for a miracle or that can make Kane's hair grow back (that someone mistakes for Pierpaolo... that ours is an incognito NOD?), but they do their dirty work and don't annoy.", "date": "2010-03-16", "grade": "7.0"}