{"name": "Un puzzle d'altri tempi", "ref": "https://multiplayer.it/recensioni/75176-the-misadventures-of-pb-winterbottom-un-puzzle-daltri-tempi.html", "text": "Xbox Live Arcade has increasingly become a showcase for innovative games, titles with a retro or simply avant-garde style, exponents of all that ~indie~ culture that would not find space and the right consideration in large-scale distribution. It is evident that the most important products also on Xbox Live Arcade are subsidized by the publishers but the inventiveness and realization is all in the hands of the brilliant developers. Examples such as Braid or Castle Crasher make the concept very clear, well developed ideas hand in hand with technical achievements with an unmistakable style, The Misadventures of P.B. Winterbottom in turn is a concentrate of all this. Cakes cakes cakes Mr. P.B. Winterbottom is an excellent character in his characterization, he seems anything but the protagonist of a 2010 videogame. Elegant and upright like an English gentleman straight out of a painting, a little overweight due to his great passion for cakes. This weakness of his leads him to try to recover every single ~sweetness~ in his way. In short, his life is completely aimed at recovering as many delicacies as possible by facing all the challenges on his way and it is precisely during a ~cake chase~ that the nosed (yes he has a large and evident nose) protagonist will find himself confronted with a real paradox space-time, finding himself endowed with powers worthy of a true superhero. In essence, the plot is all here, nothing in particular but it is its simplicity that captures the attention and above all the way it is narrated throughout the game. In fact, the story is told in a fabulous way that makes you dream and at times smile, before each scheme to be faced in fact, through a screen that closely resembles the cinematographic films of the past, the story is introduced, between rhymes and funny drawings. The Victorian style that permeates all the level presentation screens is rightly taken up in the diagrams, highlighting structures of the past, houses with protruding chimneys, tanks, beams and clocks with gears on display. Space-time paradox Coming to talk about the actual gameplay we must warn you since The Misadventures of P.B. Winterbottom is addictive, it moves like a platform but the mechanics closely resemble a puzzle game. By moving the ~nose~ you have to recover each cake present in the individual levels, if at the beginning of the game it is only a question of jumping from one point to another of the scheme after a while the evolution of playability is evident given that pressing the trigger on the right it becomes possible to record the movements made by the character, movements that will be immediately reproduced as such by a clone. It is clear that this possibility opens up many scenarios and becomes the heart of the game, given that it becomes essential to make the best use of the clones in order to achieve the objectives. An on-screen indicator highlights how many copies of P.B. Winterbottom can run on the screen at the same time, so it is necessary to make the best use of them so as not to see our efforts in vain. Some levels require you to clone your character to activate a switch or the middle of a seesaw, others require you to jump on the clone's head to reach high points on the screen. The more you advance in the game, the more challenging the puzzles to solve and do not allow hesitation or idle movements, it becomes necessary for the character and his clones to move in unison like the gears of a clock. In some levels, pure Lemmings-style strategy becomes necessary, seeing the clones appear and disappear and the character move from one side of the scheme to the other to reach cakes that at first glance seem absolutely unattainable. For example, you will find levels where cakes appear after pressing a switch for only a few seconds and then suddenly disappear, others where only clones can affect their surroundings, still others where you have to interact with evil versions of Winterbottom . The puzzles that you are going to face are never trivial, of course after a while you risk repetitiveness but above all the difficulty is the real weak point of the game, keep in mind that you will have to think to achieve all the objectives, and if you are a player who love the ~all at once without effort~ do not even consider The Misadventures of P.B. Winterbottom. From a technical point of view, The Odd Gentlemen game is a real treat for the eyes, all the choices have been made at the right point, the retro style and the charm of the two colors are highlighted by the absolutely atmospheric music that surrounds the Winterbottom action. NoThis is certainly not a title from which to ask the Xbox 360 to flex its muscles but what has been achieved is absolutely of a good standard, with precision in the jumps and in all the moves of the ~nose~, good animations and a more than spot on style. The genesis Thanks to Take Two Interactive Italia and the blog of Matt Korba (one of the two creators of the game) we can tell you something about the genesis of such a particular product as The Misadventures of P.B. Winterbottom. The origins of P.B. Winterbottom date back to many years ago, between 2005 and 2006. Matt Korba who has always been passionate about films, especially those in black and white without audio capable of exciting the viewer much more in his opinion and which had to be built in perfectly due to the lack of audio, he discovered a love for video games. Fascinated by the possibilities of this new medium and by the idea of being able to create a world completely from scratch with your own rules. It is here that another great love of Matt makes its way, that of time travel and space-time paradoxes and he begins to examine all the films and video games that had dealt with the subject up to that moment, Return to the future tell you anything? but also Zelda, Max Payne, Viewtiful Joe, Prince of Persia and partly Mario Kart (remember the possibility of registering a ghost of our race and then competing against him?). Matt was also greatly influenced by Tango, a small short film in which a looped room was shot and some characters entered who, once an action was done, immediately left the scene. All of these ideas of course then emerged into what became P.B. Winterbottom, which really shouldn't have been called that. It all started by chance since the real name was B.P. in honor of Billy Pilgrim from Kurt Vonnegut's book Slaughterhouse #5, but after misreporting it on a slide he realized it sounded better with the letters reversed. The meeting with the other member of The Odd Gentlemen Paul Bellezza took place for a project for the LA Times, and once they decided to carry on the ~Clone~ project, Paul was to be its producer. The plot was invented after exhausting meetings between the two, could a cake thief seem trivial? perhaps the fault of too many Red Bulls swallowed. The choice of the two dimensions had already been made by Matt in his time since he believed that the 3d with its different visuals distracted the player's attention, better the 2 dimensions in order to keep the player glued to the action. Many studies were done not to complicate things too much in the management of clones and not to make the player lose sight of which character had control. For this purpose, not only Winterbottom's cloning sounds were added, but a different color was also dedicated to him. The other fundamental choice that later led, thanks also to the collaboration of Asher Vollmer, to the creation of the first demos and the definitive version of the game was that of interacting with the clones. A first idea was based on the Positional System, ie the clone repeated every movement but there was no interaction with the character. The second idea instead highlighted the interaction and that is, the clone repeated all the movements endlessly and there was the possibility of interacting with it but this was rejected because it was too confusing. The final choice is a middle ground between the two, the Positional Transitional Physics System in fact provides for interaction but limited, as in the finished game it is possible to record movements, interact with the clone but if bumped or hit it dissolves. At this point P.B. Winterbottom was ready.", "date": "2010-03-17", "grade": "8.5"}