{"name": "Melanzane con le mele", "ref": "https://multiplayer.it/recensioni/75302-rayman-2-the-great-escape-melanzane-con-le-mele.html", "text": "Rayman was a good saga. The entirely three-dimensional engine (just starting from this second episode), such a genuine platform-game and a winning atmosphere led it to be considered a winning series in the era in which it landed on the market, although it was not quite at the level of the superstars of the period. In fact, everyone will remember a certain Mario 64 who, in all likelihood, still hasn't found a true and worthy successor to whom to pass his scepter despite the fact that about thirteen years have passed. The indomitable Gameloft - really unleashed in the last period - has opted for a complete restyling of the second episode born on last generation platforms, Rayman 2: The Great Escape, recently arrived with great fanfare on Apple iPhone/iPod Touch devices through the usual App Store. Judging a title like this is not easy so many years later, either for the context in which it has just been made available, or also for a genre, the platform, which is in a very particular moment of its historical experience, i.e. in a phase that awaits an effective renewal that has only begun with the arrival of Little Big Planet on Playstation 3, on the one hand, and Super Mario Galaxy on Wii on the other. Pickled eggplant Given these considerations, the approach to start Rayman 2: The Great Escape is in any case quite exciting, especially for those who have already played old chapters. If there was still someone able to consider iPhone and iPod Touch as simple phones or mp3 players, probably this direct conversion should finally be able to dispel almost any doubt, at least from a technical point of view. The lucky ones who had the concession of owning a Dreamcast console or a Nintendo 64, produced for those who don't remember it respectively by the defunct SEGA (defunct only in the hardware field of course) and by the always thriving Nintendo, will find ~almost~ no difference with this mobile counterpart. Very detailed textures, excellent resolution and very safe frame rate, as always when you are in the middle of a Gameloft branded product. If you think that this technological force is able to run perfectly on a device that fits in the hand, the result seems striking and it is even more evident how much the generation gap is distancing the latter from the albeit fantastic past generation. However, what is not at the top of the other productions for iPhone and iPod Touch is the gameplay, or rather its new expression, or transposition, adapted to the new completely virtual controls. With the left stick, always only drawn, you control the funny protagonist, while with two side buttons positioned on the opposite side you can jump and fire. Finally, by holding down the jump on the second consecutive press, our protagonist is able to rotate the two thick strands of hair to glide gently a few meters away following a good first leap. The controls are therefore faithfully reported, even if this time they seem less precise than others, but above all excessively cumbersome. In particular, it is the discourse linked to the camera that leaves us slightly dumbfounded. In fact, a discreet automatic adjustment of the view helps the evolution of Rayman's movements; But not always. It is in these delicate junctures that it becomes necessary to adjust the shot by sliding the fingertip across the screen in the useful direction, a movement that is not too difficult in itself, but in delicate junctures or during excited fights - to which specifically a system is also added targeting the enemy, executable with a single touch on the same, rather slow and clumsy - the result may not be too positive, even if not completely compromising. As far as history and longevity are concerned, Rayman 2: The Great Escape stands at excellent levels, being in all respects identical to the title that made its debut on the various platforms at the time and therefore rather replayable thanks above all to the numerous secondary contents. One last negative note to the save system, which drastically cuts the game in progress during a phone call (in the case of the iPhone) forcing you to start the chapter from the beginning. Gameloft's latest effort is already available on the App Store, and can therefore be purchased directly through the two devices at a price of 5.99 euros. The tested version is 1.0.1 App Store links", "date": "2010-03-09", "grade": "6.2"}