{"name": "L'armeria delle meraviglie", "ref": "https://multiplayer.it/recensioni/75161-borderlands-the-secret-armory-of-general-knoxx-larmeria-delle-meraviglie.html", "text": "Tested version: Xbox 360 The enthusiasm and expertise with which Gearbox first gave life to and then supported the Borderlands universe certainly represent some of the main qualities that have decreed the success of what was, in fact, one of the best titles of 2009. After two expansions via DLC (The Zombie Island of Dr. Ned and Mad Moxxi's Underdome Riot) which have added new locations and challenges without raising the level cap, finally with the third downloadable content this limit has been exceeded, although obviously this does not represent the 'only interesting aspect of the package... The beauty of 61 The Secret Armory of Genreal Knoxx, this is the name of the DLC with a weight that is anything but reduced by 1.6 GB, therefore finally constitutes that authentic and substantial evolutionary step that expert users of Borderlands have been waiting for a long time for a fundamental reason: the 'increase in the level cap of the characters, which from the previous limit of 50 has now been raised to 61, with all the related skill points to be assigned at will. As in the previous DLCs, also in this case we are faced with a ~rigid~ positioning of the expansion, which in fact offers a challenge suitable for players around level 35 in the case of game 1, and 50 in game 2; requirements, these, to be followed carefully in order not to risk facing The Secret Armory of Genreal Knoxx at too high or too low a difficulty. Therefore, starting from this fundamental assumption from which it is not possible to transcend in order to adequately appreciate the product, it is no exaggeration to say that what Gearbox includes in this expansion represents exactly what veteran Borderlands players have been waiting for: new enemies, vehicles and environments, rich and satisfying loot, and many hours of gameplay. However, let it be clear that this is not a walk in the park, far from it: the challenge is high, especially in the passage in game 2 with opponents always one or two levels above your own, therefore ideal for a close-knit and well-matched group. Furthermore, the respawn is decidedly rapid and there are no areas to be overcome lightly, not even on board vehicles. As for the latter, we were talking about the three new entries, particularly welcome given the only means of transport previously available. In The Secret Armory of Genreal Knoxx, on the other hand, already at the beginning there is a sort of 2-seater super off-road vehicle with relative turret equipped with homing missiles, but later on it will be possible to further increase the numbers of one's ~garage~ with even a slow but deadly 4-seat Lancer. On the other hand, this renewed interest in means of transport has repercussions in a decisive importance to the driving phases, which represent a significant slice of the time spent in the DLC even just for moving from the T-Bone Junction to the various mission theater areas. Even from the point of view of the new enemies, the programmers have not spared themselves; the assassins for example, lethal and very fast, or the Lance soldiers with a lot of Jetpacks, or the Doctors who restore the energy of their fellow soldiers, the Lance Probes or the monstrous Devastators are just some examples of the important work carried out in this sense. Not to mention the final ~surprise~, really intended only for those who have reached the new level cap. If the quality of this latest work by Gearbox was still not clear, just add a couple of numbers: 40 new missions for about 10 hours of gameplay in total, all at the ~usual~ price of 800 Microsoft Points or 6.99 euros on PSN.", "date": "2010-03-04", "grade": "9.0"}