{"name": "La neve in cel shading", "ref": "https://multiplayer.it/recensioni/75025-x2-snowboarding-la-neve-in-cel-shading.html", "text": "Fascinating cross between the racing and sports genres, snowboard games have for years experienced an evolution that has led them to be ever faster and more spectacular. In the mobile sector, we were able to try out some interesting titles on Java-compatible mobile phones, but on the iPhone and iPod Touch there was still a lack of a product capable of worthily representing this particular videogame trend. X2 Snowboarding presents itself as the ideal candidate to fill this gap, both for the strength of its numbers (five locations, fifteen events, six characters) and for the interesting technical solutions adopted, which see the use of cel shading for the representation of cartoon-style graphics. The picture is completed by the innovative system for performing tricks and the presence of a multiplayer mode both locally and online, respectively via bluetooth and wi-fi. Like snow in the sun The first thing to do, once the game has started, is to try the short tutorial that will show us the various facets of the control system. It is possible to leave the default setting, which sees our snowboarder move through the inclination of the device (therefore relying solely on the accelerometer) or opt for a traditional solution via touch screen. The latter unfortunately turns out to be a bit confusing, given the amount of buttons already present on the screen, and after all the motion detection performs its task in the best possible way thanks to a preventive calibration and the possibility of adjusting the sensitivity of the movement . In short, better to leave things as they are. The buttons located in the lower part of the touch screen are used to jump, grind and take a quick sprint (which consumes the adrenaline bar, however), while those located in the upper part are useful for pausing the game , to use adrenaline (a sort of spectacular ~bullet time~) and to take advantage of the ~rewind~ function, increasingly popular in racing games, which gives us the possibility to remedy a particularly serious mistake by ~rewinding~ the action for a few seconds. One of the limitations of the title developed by X2 Games is the absence of a career mode, replaced in this case by a completely free approach: we can choose the character we prefer and face an event among those available, trying to get the points needed to unlock all other races. The latter are divided into different types, for example there are events based solely on the score collected on the basis of stunts and those in which the competitor who crosses the finish line first wins. Stunts galore X2 Snowboarding adopts interesting and original solutions for performing stunts. In the vicinity of a ~trampoline~, we must load and then release the jump button; at that point, with the character suspended in the air, we will see two snowboard-shaped icons appear on the sides of the screen with a whole series of ~sensitive points~ that we can touch and which correspond to different tricks. The scoring system involves holding a certain position for as long as possible, releasing the button and returning to normal position in time for landing, but of course it is possible to combine different positions to multiply the points before touching the ground. The execution of the grinds on simple snow is regulated by a balance bar placed vertically and combined with the inclination of our iPhone or iPod Touch, while in the same way the grinds on the pipes and on the fences are maintained on the basis of a bar of the horizontal balance. The five available locations offer very different routes, which must also and above all be memorized if the event requires us to reach a certain score, given that we must remember well where the jumps and all those elements useful for our stunts are. The characters are distinguished by speed, balance and aerial ability, values which then really affect the gaming experience and allow us to choose between different approaches depending on the type of race. Technically an excellent job has been done: the cel shading graphics are really well done, with a good number of polygons and a series of very convincing effects. The excellent use of colors and the ~signed~ soundtrack complete the picture of a title that is perhaps a little expensive (it is sold for 5.49 euros) but certainly well-finished. The tested version is 1.1 App Store links", "date": "2010-03-05", "grade": "8.2"}