{"name": "Suda", "ref": "https://multiplayer.it/recensioni/74824-super-ko-boxing-2-suda-picchia-e-sbuffa.html", "text": "A stereotypical protagonist (blond, muscular and good-looking) who takes on the role of boxer, three circuits in which to perform and many opponents to beat, one more wacky than the other: these are the ingredients of Super KO Boxing 2, sequel of a boxing game released a few years ago for Java-compatible mobile phones and clearly inspired by the classic Punch-Out!. If even then we were talking about a successful, carefree and fun arcade, with the transition to the Apple platform the gain appears clear both in technical and playful terms. We find the anonymous boxer with a new look, improbable crew-cut hair and a great desire to impose himself on all his opponents. Opponents who in fact play a central role in the economy of the game, both for their extravagant aesthetic peculiarities and for their attack and defense routines, which end up characterizing the gameplay of the GLU product by themselves and enrich it thanks to the addition of a pinch of petty strategy. Just like in the original Punch-Out!, in Super KO Boxing 2 the key to victory lies in a combination of memory and reflexes: the former is called upon to learn the movements of the enemy on duty, the latter to take advantage of his moments of ~distraction~ and sinking a few well-aimed blows. It strikes, it strikes hard, like on a nail Typically arcade titles don't boast who knows what length, often making the mistake of offering players a single mode to complete quickly. In this case, however, the developers have seen fit to put at our disposal not only the classic ~story mode~, but also a couple of more or less interesting side modes, which enrich the experience and lengthen its life. These are, in this case, the Challenge Mode and the Endurance Mode: the first presents us with a series of skill challenges divided by opponent, the second presents itself as a ~survival~ in which we must try to resist as long as possible to a series of fights in rapid succession relying on a single energy bar. The Circuit Mode, or the main game mode, instead sees us face our opponents for a total of seventeen matches divided into three different circuits. The control system is completely based on the touch screen, and has buttons related to defense and attack respectively on the left and right side of the screen. We can therefore parry the punches and quickly discard to the right or left (increasing the speed of the dodge if the maneuvers are carried out consecutively), while our offensive is based on high and low punches, as well as on a special blow that can be used when its indicator is full. If desired, it is also possible to throw a loaded punch immediately after a dodge, to take the opponent by surprise. With one punch, he knocks you to the ground As mentioned, the opponents are the real protagonists of Super KO Boxing 2: there are twelve of them (and with the latest update another one was added) and they differ in appearance, strength, resistance and style. The first ones that are offered to us don't shine for speed and end up taking our shots almost without reacting, but the degree of difficulty rises rapidly: as you continue within the three circuits, things become much more complicated. You have to learn the enemy's moves, dodge at the right time and sink the blows as soon as possible. The differences between one opponent and another are also and above all underlined in terms of design, and it must be said that from this point of view we have an extraordinary variety of characters: skinny rappers, big hairy men, aliens, bullfighters and so on. The graphic style has improved substantially compared to the first episode of the series, although it is not yet fully mature. However, the animations are of decent quality and overall good use of colors has been made. Also noteworthy is the level of detail of the scenarios, as well as the presence of special effects which underline the power of certain shots, making the action very spectacular. The tested version is 1.4.0 App Store links", "date": "2010-03-04", "grade": "7.9"}