{"name": "iPhone sul piede di guerra", "ref": "https://multiplayer.it/recensioni/75059-brothers-in-arms-2-global-front-iphone-sul-piede-di-guerra.html", "text": "For the ancient Greeks, the term acedia indicated a particular manifestation of strictly motivated indifference towards something or towards someone. The theme of the Second World War, so inflated in the videogame field, is now often the cause of this cloying feeling, precisely due to the too many re-propositions mostly characterized by a subjective view, as happens for many of today's shooters on the entertainment market playful. And yet, from a profitable point of view, for those who develop these types of games, things do not seem to have changed, even in a genre that is so abused but ultimately successful. Gameloft, probably the most committed software house on the iPhone/iPod Touch front both from the point of view of quantity but above all from that of the quality of its productions, is pleased to present its latest effort aimed at Apple portable devices, Brothers in Arms 2 : Global Front. Another successful brand that arrives at the court of Steve Jobs. And war it is Sequel to the first episode released towards the end of 20008 - one of the first ~serious~ titles in the series - for the same platforms, this Gameloft production inspired by the second international conflict changes its characteristics in the basic setting, passing from a third person, as happened in the original, to a more adequate subjective aligning, to all intents and purposes, with the characteristics of a classic fps. At the base of Brothers in Arms 2: Global Front is the NOVA graphics engine, which in all probability was the one able to demonstrate with greater conviction, from the moment of its landing, the potential and the strong personality of these devices, actually in some ways still underestimated by some gamers. With this direct evolution of the aesthetic sector previously created by the developers, the current result seems even more impressive in some situations, although the futuristic settings of Gameloft's ~Halo-like~ were relatively easier to paint and able to show a more convincing level design compared to this Brothers in Arms 2: Global Front. Numerous aspects have therefore been improved such as the number of characters on the screen, really many, the explosions, the interaction with the game environment, while in any case maintaining the perfect fluidity that had characterized the futuristic shooter. Another point in favor of the warlike shooter concerns the artificial intelligence chapter, especially convincing at the highest level of difficulty. Thanks to the war connotation introduced, the available weapons park restricts the arsenal to the historical reference in which it is found. Forget, therefore, the power of the ~bolides~ of NOVA, but get used to simple rifles, machine guns and pistols more suited to the atmosphere but above all to the time, even if it is possible to add various vehicles of various kinds to these, including a spectacular glider . The modes to choose from include the single campaign, with which to tackle the events through the various points of view proposed and for the five locations (Prologue, Africa, Sicily, Europe and the Pacific), and the multiplayer one, which thanks to Wi -Fi and Bluetooth lets you play with friends locally and with everyone else online. Unfortunately, any expression of cooperative play is missing, which really would have fitted well within the proposed package. With the game view, the setting of the controls has also changed: with the left stick - virtual and touch, of course - you control the main movement of the character, while placing your finger on the rest of the screen affects the subjective overview . There's the button to fire and combinations that allow you to crouch at half height or lie down completely; the idea of the cover system is nice, quite similar with due proportions to that seen in Killzone 2, where by pressing the action button near obstacles or real walls it is possible to take cover to reload the weapon, and then lean out with timing and strike the advancing enemy. Brothers in Arms 2: Global Front is available on the App Store at a price of 5.99 euros. The tested version is 1.0.9 App Store links", "date": "2010-03-01", "grade": "8.4"}