{"name": "La vanit di Ezio", "ref": "https://multiplayer.it/recensioni/74879-assassins-creed-ii-il-falo-delle-vanita-la-vanita-di-ezio.html", "text": "Version tested: Xbox 360After the disappointment of the first DLC of Assassin's Creed 2, or that ~The battle of Forl~ unable to maintain the quality level of the main title, the curiosity linked to the second expansion offered by Ubisoft for its blockbuster set was decidedly high in our country. Fortunately Il bonfire delle Vanit turns out to be a decidedly more balanced and interesting product than its predecessor, and which represents at least a worthy conclusion to Ezio Auditore's long adventure. An apple a day On a narrative level, The Bonfire of the Vanities constitutes memory 13, and therefore arises immediately after the conclusion of the events narrated in the previous DLC; Ezio then returned to Florence with the intention of recovering the Apple of Eden, taken from him during the battle of Forl and ended up in the hands of Girolamo Savonarola. Unfortunately, however, the task is not so easy, since in the meantime the Tuscan city has seen the flight of the Medici and the establishment of a revolt headed by the Dominican friar himself. Consequently Ezio, with the help of a Macchiavelli who is still (too) a supporting character, decides to weaken Savonarola's defenses by eliminating his 9 lieutenants. The object of Il bonfire of the Vanities is therefore precisely this, or a series of nine assassinations scattered throughout the city to be carried out in the order you prefer. It is therefore already evident from the description of the contents of the DLC that this thirteenth memory is much closer, in its characteristics, to the more valid qualities of the Ubisoft product; with some exceptions, Ezio must organize his actions trying to avoid combat, focusing mainly on stealth raids, minimizing encounters with the guards, thus trying to reach the objectives without being detected. An intriguing setting therefore which, despite the repetitiveness of the objectives (as already mentioned it is simply a question of carrying out 9 murders in series), manages to maintain the player's interest thanks to the good characterization of its victims and the sufficient variety of the various situations that arise are called to face. In addition, The Bonfire of the Vanities also brings with it a new area of Florence, the Oltrarno district, roughly 1/4 the size of the rest of the city and where the beautiful Palazzo Pitti is located. Beyond the pleasure of visiting a new area there isn't really much else, since the shops present don't have any new items to buy and the handful of observation points present are very simple to climb. The trampolines are also of little importance, elements placed on the roofs that allow you to make larger leaps but which do not give anything extra to the economy of the game. However, it remains a welcome addition, especially in the face of the absolute poverty in this sense of the previous ~The battle of Forl~; in the same way the duration of the sequence, around two hours, represents a marked improvement also in this sense. On the other hand, the serious problems in the sound should be noted, which lead to the overlapping of some pieces of dialogue and even to total silence in a portion of the final sequence. A bug not related - it seems - only to the Italian edition, and which denotes a lack of testing that certainly cannot be expected from an important label like Ubisoft.", "date": "2010-02-23", "grade": "7.7"}