{"name": "Un mech per amico", "ref": "https://multiplayer.it/recensioni/74402-heavy-mach-2-un-mech-per-amico.html", "text": "The concept of ~mech~ was born in many ways from the need to give greater realism to those Japanese robots which in the early 80s were the undisputed protagonists of children's TV. Intended as combat vehicles of a purely military nature, they constitute a sort of evolution of tanks equipped with legs and arms. These are not transformable robots, in most cases, and their movements are characterized by a ~realistic~ slowness in stark contrast with the unnatural agility of a Daitarn 3 (which was a three hundred meters tall machine though) or a any Mazinger. The mechs are not indestructible (far from it) and are not piloted by precocious kids who somehow enter into symbiosis with the vehicle (to the point of feeling pain when it is hit!): they are armored combat units, no more, no less, and they rarely boast their own personality. However, they have always exerted a great fascination among science fiction enthusiasts, and the games in which they figure (it is worth mentioning the excellent Lost Planet for Xbox 360 and PlayStation 3, which will soon enjoy a sequel that promises to be excellent, or clearly the Mech Warrior series) are always quite successful. I, robot Unlike the first episode of the series, which put us at the wheel of a simple armored vehicle, in Heavy Mach 2 we control a big bad mech that we can upgrade in various ways, through the purchase of new weapons (one for each arm), new armor components, engine upgrades, and special attacks involving air support. The game structure is very simple: after creating a profile (there are three slots available), we find ourselves in the headquarters of our army and from there we can view the available missions, check the vehicle equipment and go to the upgrade shop . When we have selected the missions that interest us from the list, we can leave the HQ and go to the battlefield, where we will find numerous more or less dangerous enemies waiting for us. The control system adopted for Heavy Mach 2 is the typical RTS one: touch a point on the map and our mech will move in that direction, double-tap and it will produce a short quick shot, draw a path by dragging your fingers on the screen and the robot will follow it end to end. The approach to fighting does not allow us who knows what freedom, given that the system is practically automatic: when we have an enemy vehicle within range, the mech will begin to unload everything it has on him, only taking the breaks necessary to rearm the magazines (times vary depending on equipment, however). We can indicate which target we want to hit first by touching it, but otherwise we won't have to pay attention to too many things. The energy bar of our vehicle drops depending on the attacks suffered, but we can restore it using the repair kits in our possession or avoid getting hit by simply continuing to move while we attack. And this is the keystone of the product developed by IndieApps: once you understand the ~trick~, the clashes turn into a trivial, repetitive procedure, which gives very little satisfaction since the mechanics are always the same. Then there is a speech to be made regarding the technical realization: our mech and its numerous opponents boast a discreet design (although it is relatively easy to obtain these results when the view is from above), but the scenarios in which they take place the battlefields are always the same and are really gaunt and desolate. Added to this is a very repetitive sound sector in the music and very weak in the effects, as well as a general management of the interface that should be reviewed and made simpler and more practical. The tested version is 1.2 App Store links", "date": "2010-02-17", "grade": "6.9"}