{"name": "Chi ha paura del mostro cattivo?", "ref": "https://multiplayer.it/recensioni/74620-aliens-vs-predator-chi-ha-paura-del-mostro-cattivo.html", "text": "Tested version: PC Brief summary of the franchise: take a science fiction series that has launched or confirmed some of the best directors of the last thirty years (Alien) and put it together with another, decidedly inferior but still with a marked appeal to the public (Predator), mix and what you get is a crossover for all seasons, from comics to movies without forgetting video games. Rebellion has set the standard in this sense and in 1999, after a first attempt on the Atari Jaguar, it launched what probably remains his most successful work on the market. More than ten years later and after a 2009 to forget - Shellshock 2 and Rogue Warrior still need to understand how they arrived in stores - the Anglo-Saxon software house tries again and with this Aliens vs Predator attempts to return to the glories of the past. The result, it should be said right away, cannot be counted among those of unforgettable significance, however the title has some interesting ideas living in an atmosphere that is at times successful and some gameplay choices that cannot be experienced elsewhere. Variants The offer of Aliens vs Predator is based almost entirely on the possibility of impersonating a representative of the three forces in the field, passing from the defenseless marine to the animalistic Alien up to the Predator. The three campaigns therefore take place separately but parallel, sharing a rather narrow and rehearsed narrative plot, based as it is on the usual presence of an alien planet, an alien pyramid, two alien races plus one, alien to the others, which reaches where it shouldn't be trying to make it thick and thin. The idea is however functional to create the basis for giving substance to an atmosphere capable of arousing different sensations depending on the clothes dressed in that moment. The formula works especially in the first case, along the marine campaign, where by impersonating a rookie you will first have to make your way through now desolate complexes and the jungle, to try to survive, and then stand up as savior of the homeland, thwarting the usual threat that leaves room for reflection on who between apparently defenseless man and the other two species is the real threat. The first third of single player is therefore structured like a classic shooter, with a handful of weapons available apparently limited in number - just five including a machine gun, flamethrower, shotgun and sniper to which is added a sort of high-tech gatling - but more than enough to handle the constant attacks of the Aliens, truly spectacular in their movement along the walls, playing with the dark corners present almost everywhere. The level design alternates some sessions of linear movement between corridors and rooms often filled only by sinister creaks, with slightly larger areas that stage prolonged assaults, perhaps repetitive but genuinely entertaining in their constant need not only to shoot wildly, but also to identify the position of the threat, strategically using both the torch and the more powerful but short-lived flares. Approximately three and a half hours in the company of a novice soldier, in tension for a threat often only feared by a series of clichs, however functional, aimed at alerting and partially mortified by a final phase against some rather standard but rendered humanoid enemies annoying by a sort of cooldown which, once a shot is fired at them, prevents them from being hurt for a few moments before being able to damage them again. Having abandoned the role of a sweaty human and dressed in the role of an Alien born in a research center installed on the planet, we are faced with the least convincing portion of gameplay ever. The premises are good and the tutorial dedicated to movements and attacks has succeeded, just as the writer has not created too much trouble even the camera which, given the possibility of walking on every wall, could prove to be initially difficult. The problems can rather be detected in two distinct but fundamentally important elements: the alien has no motivation other than to impregnate some human and the arrow that indicates the next objective, thus preventing the creation of an empathetic bond that enhances the atmosphere, while the clashes are initially fun being based on the assumption of physical superiority over the opponents and, therefore, on the need to create some openings to attack in a stealthy as well as devastating way, but they almost always take place within the usual closed areas to clean up before moving on to the next one. With the marine, the tension and frenzy of his style of play the formula worked well, in this case a little less. The Predator is a sort of middle ground between the dtwo previous ones, with an interesting background and the ability to move vertically on several floors, combining invisibility with gadgets - lethal, of course - in some cases to be recharged using special control units scattered all over the place. This last portion of the game combines some less convincing elements, such as melee clashes that often become confusing, with others that are significantly more inspired and with the perception of how Rebellion has worked well on the levels to make them recyclable but always different when played in each of the three campaigns. As mentioned at the beginning, Alien vs Predator is pleasant to play and some design solutions work in their uniqueness, so it is a pity that many ideas have been left in power and so much of the good present can be traced back to what was experienced in 1999. To complete the experience in The single writer took about eight hours and replayability is guaranteed only by a scoring system that does not push anyone who would not have already done so to start the matter over again. Heavy legacy The multiplayer has on its shoulders the heavy legacy left by the game of which it is in practice a remake, a mixture of adrenaline and possibilities that at the time bewitched many. Unfortunately, the version tested for the review was complete with everything but sadly empty of people with whom to jump into the action, leaving us the only possibility to make some evaluations starting from previous experiences. The recently released demo was rather unfair, ten months old as it was - it had been packaged for E3 2009 - and with the all-against-all deathmatch mode that does not in any way decline the potential expressed when in teams, mixed or even better divided according to the species to which they belong. Some extra options, such as the one that puts seventeen marines against a Predator or an Alien, capable of converting the victims into its own kind, should then add other delicious possibilities to a compartment for eighteen players that looks good at first sight, provided that the six maps inserted are sufficiently well designed and increase in number over time. There are also two environments to play co-operatively, solo or up to four against the computer holding out as long as possible, but they seem quite an end in themselves. Needless to dwell on balancing issues with so few games on his shoulders, especially on the demo; certainly the adrenaline is not lacking and neither is the fun. Curiosity The Aliens vs. Predator series has been a properly plucked chicken over the years: from the comics created by Chris Warner and published by Dark Horse Comics up to about fifteen video games, through three novels and a successful series of action figures. Ah, there are also the two films, how can we forget them: the second is the worst of the two, despite the fact that Raul Bova starred in the first. How is it possible? No alien pyramid has yet answered this question. Lights and shadows Mouse and keyboard have once again been asked to triple their efforts, with the mapping completely customizable but already more than satisfactory from the start, except for the bizarre choice to place the Alien sprint on the Q key. There have been some complaints about a little lag in the mouse cursor: the writer has not experienced any problems and for those who do, it could be a problem related to v-sync or some option in the graphics card panel aimed at forcing the number of images per second. The pad is supported but certainly not the best option, as usual when in first person. Technically the work of Rebellion left quite impressed despite the tested version stopped at the support of DirectX 9, while the one coming out in stores should adopt the eleventh version of the graphics libraries, at least according to what was declared. The models of the characters and often of some elements of the backdrop are poor in polygons, it is true, but the lighting is absolutely of the highest order with numerous dynamic light sources that allow you to create reflections and shadows functional to the atmosphere, almost survival horror in some sections of the campaign dedicated to the marine. The animations are normal but the ones that matter, the rapid sneaking of the Aliens, work as well as the final moves that can be performed both by the aforementioned monsters and by the Predator are entertaining from start to finish, between spines extirpated from the bodies and cameras that linger on the cranial perforation of the poor unfortunates. In multiplayer, the lighting system loses a lot but the downgrade is, as always, sacrificed on the altar of performance, after all it's not what matters. The sound is also good, everything and always aimed at the aincreased heart rate but really only stands out with originality in a passage inside a disco, with the music pumping from the speakers and the Aliens coming out of the fucking walls.", "date": "2010-02-15", "grade": "7.2"}