{"name": "Il vecchio che avanza", "ref": "https://multiplayer.it/recensioni/73891-space-invaders-infinity-gene-il-vecchio-che-avanza.html", "text": "Once upon a time, video games were pure passion and gameplay, which were transmitted in a few lines of code and with a decidedly limited graphic design, but which in the eyes of the time still appeared beautiful and pleasant. Without abandoning ourselves too much in memories now out of fashion and in a current generation made up of technology of all kinds, the iPhone itself can boast of hosting the old in the new, with absolutely sensational results. On consoles we already have a fitting example with Shatter, which takes up and expands Arkanoid perfectly, while on Apple mobile it's up to Space Invaders, a fixed-pattern shooter that needs very little introduction and which has seen various more or less successful incarnations since his birth. How to bring back a title that, however historic, demonstrates the more than 20 years it has on its back? Just rely on Reisuke Ishida of Taito and that's it, because the good Japanese Game Designer has given the right life to the title, positioning it by right among those absolutely must-have for iPhone owners. Back to 1978 ~It is not the strongest species that survives, nor the most intelligent, but the one that best adapts to change~ These words by Charles Darwin, reported at the beginning of the game, summarize the structure and concept behind Space Invaders Infinity Gene, a real evolution from a technical, sound and gameplay point of view of this classic. The stylish and drumming menu which is accessed is initially lacking in options, the first level is the exact same as in 1978, but after a few moments the first evolution takes place, the music changes and becomes electronic and with a high number of beats per minute, the ship can now move throughout the game board, with the possibility of attacking automatically or using the fingers on the screen. From here the game becomes more delirious, with the first levels rather simple and then an ever greater explosion of music and color, with ships of various kinds popping up everywhere, and with the score going to the end of each completed level to flesh out a special bar, which allows you to unlock new weapons, a greater number of lives for each continue (which are infinite), additional difficulty and game levels, the music player and so on. The graphic style always remains rather simple, with opponents of different shapes reproduced in white or grayscale; however, the introduction of the possibility of moving far and wide, as well as several additions such as layered bosses, moving sections with obstacles to cross or weapons that completely change the approach (the one that swallows even enemy shots, the homing, area and so on) to attacks, give a remarkable and unexpected sense of depth to the game. As mentioned, the spacecraft is controlled with the finger on the screen, but the fact that it can be positioned anywhere, such as for the touchpad of a laptop, allows you to manage movements well and avoid enemy shots, which even at the highest difficulty level they are affordable by coordinating movements well and never lead to the frustration levels typical of scrolling shooters. The main campaign is completed in a scant hour of gameplay, but its structure leads to a very high replayability, topped off with over twenty extra levels and the mode called ~Music~, which integrates with your library musical and, once a song has been chosen, it allows you to generate a level based on its duration and beats per minute, to offer an ever new experience that can be shared via voting or signaling to other Space Invaders Infinity Gene users. With the 2.0 update of the title, a whole series of interesting new features have also been introduced. In this case, the above vote, new extra levels and dulcis in fundo integration with Openfeint, another social network like Xbox Live -probably the largest available on iPhone- which allows you to unlock 50 achievements and publish your rankings online for each level and modality, in order to compare them globally or with your friends. The tested version is 2.0 Apple Store Links", "date": "2010-01-21", "grade": "9.0"}