{"name": "Voice of Cards: The Isle Dragon Roars", "ref": "https://multiplayer.it/recensioni/voice-of-cards-the-isle-dragon-roars-recensione.html", "text": "A video game is an amalgam of innumerable ingredients, often mixed painstakingly, but even more frequently thrown into the pot a little at random in the hope that the final flavor will not be an unworthy obscenity. And among the thousands of elements that make up a work of this type, many immediately catch the eye, such as the animations, the music, or simply the polygonal models. Hardly anyone, however, tends to remember a fundamental component in a myriad of titles: post-its. No, we haven't lost our minds, colored sheets are really one of the cornerstones of design in various genres, especially when we are talking about video games with complex stories and mechanics. Most of the development teams base the entire planning on sheets of paper stuck almost everywhere, where schemes, characters, quests, gameplay solutions and an infinite number of other data are listed and drawn, then used by the developers as a model to give form to their child. The good Yoko Taro - who has been hanging out in the world of development for a long time and knows this ~secret~ well, having developed games of the caliber of NieR: Automata - therefore had an idea as simple as it is brilliant: to create a game completely made up of sheets indeed, cards. Voice of Cards: The Isle Dragon Roars has therefore come to light, a sort of low-cost ~lateral~ project, thanks to the reputation now conquered by the author with the Nier series. could be one of those hidden gems that this bizarre author usually churns out. The answer, alas, this time is no, but the fact that it is not a masterpiece does not necessarily mean that it is not a JRPG worthy of being played. Let's find out why in the review of Voice of Cards: The Isle Dragon Roars. Narrative: a not too hidden darkness Voice of Cards: movement and visibility are limited in certain areas Voice of Cards is, predictably, a role-playing game and this is very natural if we consider that the genre comes from paper. However, Square Enix's work is not a sort of Japanese transposition of Dungeons & Dragons: it is actually a turn-based JRPG equipped with extremely classic mechanics, where the cards represent more a stylistic solution than an actual gameplay element, albeit their presence actually allowed some curious experimentation. we would like to immediately clarify one thing in this regard: Yoko Taro's hand is immediately noticeable, if you know her works. At first glance, the world of Voice of Cards seems like a rather dull classic fantasy, which even starts by putting you in the shoes of a small group of adventurers divided by class, only to then introduce the true protagonist of the adventure with a flick of the tail and put you trivial search for a dangerous dragon. However, it only takes a few minutes to realize that something is not right: behind every dialogue and story there is always a constant unease and it is immediately understood that the world explored in the game is actually much darker and more violent than it appears. Voice of Cards: Status-inflicting spells can reverse a fight There is only one small problem: this time Yoko Taro has tripped over her own stylistic features and even the ~shock factor~ for which she is loved and appreciated by a large number of fans in Voice of Cards has become rather predictable. With this we do not mean that the game has a negligible or badly managed story - the story of the protagonist, Marren (even if he can be renamed), and his colorful companions are absolutely interesting, they flow great and there is no shortage of strong moments rendered with a fair craftsmanship - but overall it is one of the most predictable plots ever written by the author and neither the characterization nor the worldbuilding are helped by the rather meager duration of the campaign, which can be completed in less than ten hours without too much difficulty. Considering the number of events and characters involved, unfortunately, it is not enough to detail the game universe enough. It's a shame, because the potential for something more detailed was there. Even dedicated voices for the characters would have been a welcome extra and instead we opted (perhaps precisely to further limit costs) for a single narrator who tells everything as if it were a big fantasy fairy tale. Added to all this is the age-old problem of the localization, given that we are dealing with yet another Italian adaptation thatit has a tendency to differ from the English one. There are two cases here: either it was based directly on the Japanese version, or liberties were taken. Not being able to make a direct comparison with the Japanese text, this time we believe that the right option is the first, given that the events are often explained more clearly in our language than what was said by the narrator's voice; some errors here and there, however, are noticeable. All in all? Promoted narrative, albeit from the pen of Yoko Taro, we understandably expected something more. Gameplay: cards and dice, then the usual. Voice of Cards: The world map is, predictably, entirely made up of cards At the beginning of the previous paragraph we talked about the use of cards as a predominantly stylistic choice and it is appropriate to go into more detail, because at first glance Voice of Cards might seem like an experimental RPG with mechanics based entirely on the construction of skill decks (as we have seen quite a few recently), or a simple hybrid title with card games. This is not the case and Taro's work is built on the most classic of JRPG structures: his hero wanders around large maps in search of objectives and city centers, carrying out a linear plot and meeting companions who join his mission. The cards simply represent the entire game world: all the maps are sets of cards to be turned by moving your ~token~ nearby, the skills are in turn cards that are unlocked by leveling up in the classic way and any other thing, from attacks on enemies, works like in common JRPGs, without any particular landslides. The same thing goes for the towns and dungeons that you visit: in the former there is no shortage of shops for objects, weapons and armor, or hostels where you can heal yourself (the recovery of life points is not automatic but requires you to rest or use potions), while in the seconds - and on the global map - after a certain amount of steps the risk of encountering monsters increases according to the classic rule of random encounters. The only distinctive elements of Voice of Cards, in simple terms, are exploration and some interesting (but rare) mechanical variations linked precisely to the cards. A game board from Voice of Cards: The Isle Dragon Roars As mentioned, in fact, the cards in the maps are obscured, and must be revealed by approaching. The movement, however, is turn-based and limited to quick movements, but it is possible to return to any card already turned instantly - which greatly speeds up backtracking or returning to certain areas for the completion of quests. It is precisely this cadenced nature of progress that gives the game a fairly unique structure, because every now and then during the adventure you come across areas where the immediate ~teleportation~ to the cards already revealed is limited (or you have a precise number of on the map), unexpected events with multiple choices, and situations where it becomes necessary to slyly observe cards that pass at great speed in front of the screen. Those gimmicks are commendable, but in our opinion the developers didn't put too much effort into trying to make the most of the curious nature of their work, and there was no shortage of ways to achieve something more memorable. For their part, the battles resulted more than worthy: they are also turn-based with selectable moves (only four can be equipped per character, with three active characters at a time) and some of these require gems that recharge each turn to be used. The system is immediate, functional, and has a worthily calculated level of difficulty, which has never seriously engaged us but neither can it be completely underestimated (advance avoiding burst battles and without upgrading the equipment properly, and at a certain point the enemies will tear you apart). There is also an additional minigame (with cards, of course) with mostly aesthetic rewards, but overall we found it a bit too random to be really appreciable. Structure and technical sector: short but intense Voice of Cards: Choosing the right move isn't always so obvious. Keep in mind the enemy resistances The main weak point of the project, in all likelihood, lies precisely in the duration. About ten hours to complete the campaign are objectively few and, while it is true that they significantly limit the tedium of some of the advanced dungeons - which are mostly quite repetitive floors full of monsters, obvious passages and more treasures or less hidden - the story and the rather clever handling of movement and combat have managed to never let us get bored of the experience. That said, the choice (typesca) by Taro to insert extra contents related to a second game once the adventure is completed (in addition to the usual presence of multiple endings) this time seemed a bit forced, although getting to these extras is extremely faster on the second attempt (it takes about a couple of hours at most to get back to the end of the title). On the other hand, the presence of ~secret~ cards linked to one of these epilogues scattered throughout the game, and of numerous unlockable stories linked to monsters and characters that push towards completionism, are pleasant. Speaking of this, keep in mind that the JRPG we are talking about could be a real nightmare for those suffering from obsessive compulsive disorder: turning each card will practically become an addiction and will significantly lengthen your playing time (putting you in front of an ocean of random enemies), we warned you. And technically and sound-wise? Well, the music is by Okabe, who just like Taro in turn didn't seem to be in top form, but given his enormous talent he was still able to churn out a handful of themes that will creep into your mind with almost embarrassing, never unsuitable or unpleasant to listen to. The rest of the title, on the other hand, is purely based on static designs, generally of high quality and with a style that goes well with the duality of the game universe. The narrator's voice is also good, which we have never found irritating (although the English one has an almost listless tonality at times). Square Enix hasn't invested a lot of money in the project, but in its small way it is clearly very well thought out.", "date": "2021-10-29", "grade": "7.0"}