{"name": "La risposta  esatta!", "ref": "https://multiplayer.it/recensioni/73773-tv-show-king-2-la-risposta-e-esatta.html", "text": "The Game is available for download on the WiiWare service. Two of the major Quiz shows ever to appear in Italy, the Millionaire and the Wheel of Fortune, meet by merging their main features into a unique and particular Quiz: TV Show King is back with the sequel official after the good success of the first episode. It is basically a question contest between up to four contestants, centered on knowledge in ten major 'fields' including literature, sports, history, music, geography and many more. However, the skill and culture of the participants is not everything in this game because between one round and another we can decide to spin the famous Wheel of Fortune, and it will only be a friendly or adverse fate to decide who will be the true TV Show champion King 2 Between Jerry Scotti and Papi The wheel is decidedly extreme, being able to behave in a very punitive way (you lose everything) or on the contrary giving an advantage to the competitors shamelessly (exchange your jackpot with whoever you want, obviously with the first in the standings). The random factor of the wheel undoubtedly serves to make the game more unpredictable when the participants in the quiz are culturally very heterogeneous, think for example of family games with the grandmother, the cousin and the mother. In this sense, TV Show King 2 manages to keep everyone's attention on the score because it gives the chance of victory or recovery even to those who are weaker and more disadvantaged in their answers. Fortunately, at least in local offline matches the ~wheel~ option is expendable by unchecking it in the options, making the challenge fair and balanced between culturally like-minded people. Unfortunately, it cannot be done without it in online game sessions, making entry into the final a purely fortuitous factor. Once classified first or second, the challenge of ten questions starts, head to head, and in that case whoever actually knows the most answers wins. In addition to the classic option (the challenge with questions of various kinds) there is the possibility of directly going head-to-head, direct elimination (for more than two players) or the ~flurry of questions~ in which we must be able to answer as many questions as possible without ever making a mistake. The difficulty levels with which the questions are cataloged are three, to give everyone the opportunity to play and participate. The four boxes of multiple answers, obviously displayed all at the same time, show the pointer of each participant's remote control on the screen, marking the desired answer with a color and number of the player. This allows those unfamiliar with the subject matter to be able to change their mind on the run simply by following what the others have chosen: the ~vote~ is not secret, in TV Show King 2. The developers have intelligently solved the problem by adjusting the points obtained to each right question with a scale of values that follows the speed of response. The first earns 100% of the jackpot, the second 75%, then 50% and finally the last one gets 25%. The quizzes, always based on the question-answer combination, differ from time to time in style and mechanics: sometimes it is necessary to guess a drawing, trying to ~see~ it using the cursor on the remote control; other times, for example, the image to be guessed is grainy and sharpened in small steps, and many other mini-games of this type. What's new in this sequel The first, very important novelty is precisely that of support for Nintendo's Wi-Fi Connection, which gives the possibility of being able to challenge friends or perfect strangers from all over the world; obviously there is the system of tedious friend codes to enter. As we said before, during online sessions it is not possible to disable the Wheel of Fortune, making the games a matter of luck and fate rather than skill and culture. Another very interesting novelty is that of updating the questions (almost 8,000 initially present, 5,000 more than the first chapter), which works in two distinct ways: you can download packages of new quizzes, or create them from scratch on your own and then ~ship~ them online. Creating custom questions and answers is a lot of fun, especially if they concern friends and family. It is not clear how these, once sent to the central server, manage to enter the circle of updates intended for all users who use it, passing through an alleged ~censorship~ of the developers who select and reduce any questions that are inappropriate to public decency. It's hard to think that a developer is constantly online reading, checking and selecting thousands of new quizzes every day. In any case, the ~updated~ questions enter the list of those already present in the gioco and through the options it is possible to eliminate them, if necessary. It should be noted that the letter ~i~ on the keyboard is a clone of the letter ~L~, which makes it impossible to write correct sentences using the vowel. Support for Miis is once again confirmed and not tied purely to competitors, but to the entire studio audience. Through the options it is possible to monitor all the statistics of each Mii, including a graph that shows the areas of expertise in which we are best and most prepared. The statistics are numerous and very interesting to read because they closely concern our cultural level, divided by themes, skills and topics. The graphics of the game have remained almost unchanged: it is just a television studio full of Miis, three answering stations, the valet and the conductor, once again terribly dubbed in Italian. Finally, the idea of assigning ~trophies~ to particular objectives achieved, in full PSN or Xbox Live style, is good. TV Show King 2 is a sequel that doesn't rest on its laurels but makes novelty its true workhorse, hats off to Gameloft developers. The game is available on the Wii-Ware channel in the Wii-Shop for 800 Nintendo Points.", "date": "2010-01-26", "grade": "7.8"}