{"name": "Will Grey: eroe di terra e d'aria", "ref": "https://multiplayer.it/recensioni/73714-dark-void-will-grey-eroe-di-terra-e-daria.html", "text": "Tested version: Xbox 360 In the midst of the continental upheaval that is affecting the video game market, with Japan now distinctly seeing the western panorama of development pass in front of it (and even realizing it), Capcom is usually one of the few examples of structural solidity and conceptual, capable of churning out titles that are indisputably linked to the historical tradition of the Rising Sun both in terms of the spirit that animates them and for their quality. This, at least, is what happens in most cases. As far as Dark Void is concerned, a distinction must be made: as often happens nowadays, the title is the result of a partnership, having been developed entirely by Airtight Games, with Capcom affixing its brand and consequently the quality seal. Not everything went the right way to tell the truth, but there is no doubt that - beyond the gaps present in terms of gameplay and technical implementation - this action game still stands out for a good dose of charisma, linked above all to the idea center on which it was built, or the possibility of fighting on the ground and in the air. Let's think about it for a moment: we've seen a bit of everything in recent years, we've been many things within video games, yet a protagonist who goes from running and shooting in Gears of War style to a flying ~rocket-missile~ that creeps between canyons and valleys and shoots down enemy fighters with the sound of a machine gun represents something that cannot leave us indifferent. It is therefore precisely this mixed mechanics that saves Dark Void, a title in many respects crushed by not new shooter dynamics and a not exactly exciting level design, but which finds in the unprecedented sensation of freedom given by the possibility of passing at any moment (or almost) to free flight, its main reason for being. The dark void The story is characterized by a pleasant 50s style and narrates the exploits of Will, a cargo pilot with an unclear past, who during a normal transport flight (commissioned from him by an old acquaintance) finds himself catapulted across the Bermuda Triangle into a parallel dimension, a pleasant place that soon turns out to be torn apart by a continuous war between the humans of the Resistance and a strange alien race of super-technological beings called ~Sentinels~. Will willy-nilly find himself taking up arms against the aliens and leading the fighting humans against overwhelming alien forces. This enjoyable vintage sci-fi meatloaf is another plus point for Dark Void, which despite the usual redundant epic tone of the human struggle against the oppressor, contains some undoubtedly likable B-movie outings. Will, the arrogant post-war Yankee with a strong jaw is the perfect protagonist of this sort of vintage comic, which also counts among the co-protagonists none other than Nikola Tesla, to stay on the theme of absurd sci-fi. Just the brilliant and discussed inventor is the one who ensures technological support to the main character, builder of the iconic jetpack. Between fights on the ground, in the air and in both places together, there will be time to discover the ins and outs of the Void and the Sentinels, within the various levels which, to tell the truth, do not offer a very large amount of hours of gameplay (in total, we are roughly within 10 hours of gameplay). Therefore, a particularly complex story is not to be expected, but if you take it in the right spirit, you will gladly immerse yourself in this cartoon from the past. The presence of the jetpack gives the game two different souls: in the ground phases it is a rather classic third-person shooter, with interchangeable weapons (both human and alien ones can be used, all of which can be upgraded by collecting ~technology points~), bombs, ammunition to be dosed and cover system, but once the rockets are activated you are faced with a kind of highly spectacular flight simulator. Land and air shooter The mechanics of the ground-based shooter is strongly derivative, and takes full advantage of the legacy of Gears of War, proposing the now classic approach with firing phases and contextual cover to the structure of the scenario. It doesn't succeed as well, however, while proving to be quite responsive in the controls it becomes strangely deficient in terms of the contacts between the elements on the screen. In some cases it will seem to be hitting enemies who instead remain unscathed, while vice versa it can happen with a certain frequency to remain sheltered from enemy blows while popping up from cover to aim precisely, for example. It's a shame because the clashes - also by virtue of the well-established structure - are still funyou and the amount of enemies present in certain cases, especially in open spaces that allow the use of the jetpack, is impressive, resulting in spectacular fights. The addition of the vertical movement (as well as the simple jump, although this has fewer practical uses) adds a new dimension to the classic dynamics but still fails to relieve the repetitive phase of the ground battles, also due to the obvious shortcomings of the artificial intelligence that lower the level of the challenge by proposing opponents who in several cases behave in an extravagant way (hanging from the parapets, or jumping over the vertical structures ignoring us, for example). An interesting introduction is offered by the ~vertical cover system~, which substantially shifts the normal dynamics of fire and cover on a vertical plane, but in addition to presenting an unprecedented point of view, it proves to be a little too rigid and mechanical in the movements that can be carried out. The strong point of Dark Void is therefore confirmed by the flying phases and the mixed ground/air sections, where the possibility of taking flight by rocketing off with two short presses of a key really gives a great sense of freedom and a new depth to the 'action. The idea of being able to switch at any time from moving on the ground to spectacular aerial evolutions remains the fundamental concept of the game and its true strength. The only drawback of these sections seems to be the questionable structure of the quick time events that can be triggered to defeat enemy aircraft: it is sufficient to approach them (once the energy shield has been eliminated, in certain cases), press a key and always execute the same sequence of moves and keys to press to easily get rid of all the threats on the screen, excluding the small airships on which you can not jump or take possession. Xbox 360 goals Dark Void contains 47 achievements for the usual total of 1000 Gamerpoints. Normal progression in the game, i.e. passing from level to level with the necessary requirements met, already allows you to collect a good amount of points, although the complete loot still requires a certain effort, above all because some of the objectives are not exactly within reach. hand or clearly identifiable. A good challenge, but even those who are satisfied with completing the game can usually count on a good ~harvest~. Fantasy-vintage Dark Void, like many other action games of this generation, is built on Unreal Engine 3 and the Epic graphics engine shows its hallmarks on more than one occasion, especially when it comes to textures. However, we must recognize Airtight's ability to have given his own style to the game: the choice of setting it in the 50s and in a parallel dimension has allowed us to exploit, on the one hand, the vintage aspect as regards clothing and technologies used by humans ( obviously enriched by the almost esoteric charm of Tesla's creations) and on the other hand the wildest science fiction with regard to alien structures and weapons. The result is a successful mix that recalls a little Rocketeer and a little the most classic sci-fi films, complete with flying saucers. The graphics of the scenarios are best expressed in the wide-ranging exteriors rather than in the indoor phases, although in both cases there is a certain monotony of the settings, which in fact seem to repeat themselves several times without particular level design solutions or variety. On the other hand, the fluidity of the game is excellent, which does not miss even in the most agitated situations, in particular those in flight where the moving elements are truly everywhere. The same dichotomy between land and air present in the gameplay is also evident with regard to some technical aspects: in particular, the animations of the protagonist probably express the best in the spectacular flying sections, while on the ground they are not distinguished by particular qualities. The soundtrack is remarkable, for which Airtight played it safe by relying on the talent of Bear McCreary, composer who also signed the soundtrack of the new Battlestar Galactica and who used none other than the Hollywood Studio Symphony orchestra for play the accompanying music.", "date": "2010-01-18", "grade": "6.7"}