{"name": "Tower defense o simulatore divino?", "ref": "https://multiplayer.it/recensioni/73567-castle-frenzy-tower-defense-o-simulatore-divino.html", "text": "A position to be defended from the onslaught of increasingly numerous and motivated enemies: this is the incipit of ~tower defense~, a variant of real-time strategy that is enjoying some success on the iPhone and iPod Touch. The reasons are clear: the touch screen control system is even more immediate than the mouse / keyboard combo, allowing anyone to try their hand at this kind of product. Of course, in any case it is necessary to do things with criteria, to adjust the input methods in the best possible way so as not to make the experience chaotic and imprecise, and finally to think of a structure that manages to combine fun, longevity and depth. With Castle Frenzy, Gameloft tries to make a coup and play the innovation card starting once again from the touch screen. Are you used to using your fingers to position characters and turrets, or possibly to indicate the arrival point for moving troops? Well, in this case you'll have to use them to fight, literally. The gameplay of the game is in fact based on the possibility of ~grabbing~ the enemies that alternate in front of our castle, then throwing them into the air or crushing them to the ground in various ways to eliminate them. All this happens thanks to magic, on paper, but in reality it seems to be almost in front of a sort of divine simulator... The invader does not pass In the ten missions available, each divided into seven stages, increasingly dangerous and cunning enemies alternate, which in some cases manage to respond to our magic and are immune to certain maneuvers. Goblins, at the base of the scale of values, can simply be thrown into the air or grabbed and crushed on the ground or against the castle walls, while wizards resist being ~thrown~ and must necessarily be eliminated with a violent impact. Then there are the enemies riding huge boars, which once freed turn around and charge the incoming troops, or the armored variant with which this strategy unfortunately doesn't work: you have to eliminate both the beasts and whoever controls them. As the stages alternate, large and heavy enemies such as trolls also arrive, who can crush their companions when we slam them to the ground. There is a certain variety in the bestiary that we have to face, in short, a total of ten different invaders. At our disposal we have not only the ~launch~, but also a number of extra weapons that we can buy by spending the earned money and captured souls. The latter must necessarily be collected by the hydra, which therefore arises as the first ~upgrade~ to be purchased and is placed in the background waiting to eat both the flesh and the soul of an enemy. Using money and souls we can buy a more resistant door for the castle, a ball of fire and one of ice with spectacular and devastating effects, a stone griffin that can reduce the invaders to crumbs and finally magical objects from which we can emit lightning. throwing boulders, etc. From the point of view of upgrades, each mission has its own story and sees us starting from scratch. The touch of death The solutions found by the developers to control the ~launch~ and the various weapons at our disposal are excellent and intuitive, in practice you can play even without the slightest tutorial and the enemies fall by the hundreds under our blows. The game is also equipped with an achievement system that must be unlocked by completing certain objectives, for example by slamming ten wizards against the castle walls or by unseating five wild boars, etc. Obtaining these bonuses multiplies the earnings and therefore allows us to buy new weapons in the shop available between one stage and another. There is also the Gameloft Live service, which allows us not only to compare scores with friends and strangers, but also to chat between games. Let's say that the limits of Castle Frenzy are basically two: firstly, the direct control system on the one hand is immediate and original, on the other it ends up making things really too easy; secondly, as a result, the ten missions are completed within a couple of hours. Technically an excellent job has been done, with a fully three-dimensional environment characterized by an excellent use of colors and by really convincing models for design and animations. The ten invaders are all very well done, as is our castle. It's just a pity that the background doesn't change from one mission to another, thus leaving us to always play in the same scenario. The sound is excellent in terms of effects, while the music appears repetitive. The tested version is 1.0.8 App Store links", "date": "2010-01-19", "grade": "8.0"}