{"name": "Wipeout touch screen?", "ref": "https://multiplayer.it/recensioni/73724-low-grav-racer-2-wipeout-touch-screen.html", "text": "The accelerometer, if you like, was a simple introduction at the dawn of the arrival of the iPhone, but it is certainly one of the features that have had the most success in the creation of games for the Apple platform, especially for driving games. Even more it is possible to exploit it in titles in which not only the horizontal axis is used, but also the vertical one. All this preamble to introduce Low Grav Racer 2, which as the title suggests represents the sequel to one of the first productions that attempted to transfer the mechanics and sensations of a game like Wipeout to the iPhone, a futuristic race between ships at extreme speed , intricate circuits and use of weapons of various kinds, in order to cross the finish line in first position and also in the most incorrect way possible. At breakneck speed The basic concept also applies to this title, developed by Cobra Mobile and available at a cost of 2.39. 64 MB of download allow you to tackle as many as 18 tracks in three different classes (Alfa, Beta, Gamma, here the fantasy department has gone to hell...) in terms of difficulty and maximum speed, which in turn provide three spaceships which they differ from each other in manoeuvrability, acceleration and speed itself, in order to diversify the driving style to a minimum. The progression of the game is quite simple, in fact you have to face the various tracks more or less in sequence, unlocking the following ones thanks to the placement in the first three positions, which also brings the relative medal as a gift. That's all and little else, with the additional availability of a timed mode, the ability to create your own music playlist drawing from the iPod library and the always welcome integration with the Ngcomo Plus+ service, which allows you to unlock achievements for your Gamertag and send your lap times and totals in a global leaderboard, to compare with friends. Where Low Grav Racer 2 expresses its full potential is precisely in the structure of the actual gameplay, which probably places the title as the one best inspired by the aforementioned Wipeout. The graphics engine, which perhaps pays little attention to detail and the diversification of the backgrounds of the various tracks, however offers a remarkable sense of speed, with very few slowdowns which allow for a control system that works decidedly well and which becomes interesting where even the design of the tracks leads to the desire to perfect one's driving style and to improve the lap time. The learning curve is therefore well calibrated and the use of weapons helps to make the races more uncertain and exciting, with classic gadgets such as trigger bombs or heat-seeking missiles, but also some interesting variations such as the sort of hyperspace travel , which increases the speed of the ship and makes it immune to any object or collision with the opposing ones. In the end, however, to get to the top positions it is above all necessary not to miss all the various gadgets that increase speed, scattered far and wide on the track. The tested version is 1.0 Apple Store Links", "date": "2010-01-15", "grade": "8.4"}