{"name": "Mario Party Superstars", "ref": "https://multiplayer.it/recensioni/mario-party-superstars-recensione.html", "text": "Mario Party Superstars will arrive on Friday 29 October on Nintendo Switch: it is the second game of the series to land on the hybrid console, after Super Mario Party of 2018. The latter is also the best-selling chapter of the saga, with more than fifteen million units placed - before him, no one had ever exceeded ten million copies. However, its charge is slowly dying out and so Nintendo has decided to release a sequel: not a direct sequel, but a modernized collection of past classics  with the addition of online. Mario Party is a series born between 1998 and 1999 on Nintendo 64 and has spread party games internationally. The progenitor was developed by Hudson Soft, a company that was largely absorbed by NDcube, a Japanese software house owned by Nintendo, which since 2010 has been the sole author of corporate party games. We do not mention the history of the series unnecessarily, but we retrace it precisely because Mario Party Superstars is a tribute to the first chapters for Nintendo 64: many of the mini-games come from there, all five boards present derive from Mario Party, Mario Party 2 and Mario Party 3. The ~nostalgia~ relating to the first three-dimensional Nintendo console is not as strong as that for the NES and SNES (it is no coincidence that a Nintendo 64 mini has never been released), however this platform, despite having lost the commercial duel with PlayStation, over the years it has gradually acquired prestige. The nostalgia factor is never dominant, don't be afraid: those who lived through those chapters at the time will find pleasant ~amarcords~, but the title is perfectly packaged to be appreciated also - and above all - by a clientele who totally ignores them. In fact, we doubt Mario Party Superstars' real raison d'etre lies in nostalgia - that's quite the facade. NDcube has chosen this way to draw on a vast repertoire of extremely valid mini-games (selecting about a hundred of them), substantially unknown outside of enthusiasts: the three initial games, in fact, have not exceeded, added up, seven million copies. Given the time distance, for those who remember them, the ~nostalgia effect~ rather than the recycling effect is triggered. There's another reason why it made sense to release Mario Party Superstars: to take advantage of the online mode from launch and untie yourself from the uniqueness of the Nintendo console. Yes, you got it right: if Super Mario Party made the most of the specificities of the Joy-Con, Mario Party Superstars focuses entirely on the versatility of the Switch. The minigames do not use motion sensors, but are playable by anyone in any way: with the console in portability, in tabletop mode, docked, with the Pro Controller, with a single Joy-Con, with more than one console (locally) to double the screens. How did it go? Let's find out in the Mario Party Superstars review. Mario Party Mario Party Superstars: the setting reminds you of something? If you didn't know Mario Party, it is basically a board game with Nintendo characters (there are ten of them in this particular chapter and as far as we have tried, we doubt there are some to unlock). In the main mode it is always played in four, regardless of how many players are led by AI or by humans. The Mario Party Superstars boards are five and also in this case without the possibility of unlocking others. Each board is full of unexpected events and, based on the complexity, allows for a more or less strategic approach to the game. On your turn, you can consult the map of the track, so as to plan subsequent moves, and at the end you roll a die (with a classic cubic shape, but with ten sides) to understand how many squares the character will move. The goal of the game is to get more Superstars than your opponents: these can be bought along the way and the square in which they reside varies over time. They can also be stolen through Boos, and there are special items that make it easier to obtain them, such as Golden Pipes. Furthermore, at the end of the game, bonus Superstars are granted which can overturn the ranking: to the most unlucky player, for example. The coins necessary to buy them, which are also an important factor in determining the final ranking, are won by finishing on the blue boxes, through unexpected lucky events or simply by winning the mini-games. Mario Party Superstars: Space Station, one of the boards from Mario Party 2 We will talk about the minigames in more detail in the next paragraph, for now let's just say that there is at least one at the end of each turn. Speaking of turns, Mario Party Superstars has a nogreat customization: in the number of rounds of the game (which, if too long, can also be resumed at a later time), in the presence or absence of the final Superstars (and in any donation methods), in the nature and difficulty of the mini-games which will be drawn. The main mode of the game, the one we have talked about so far, is also available online. The Mario Party Superstars boards, as we said, are only five; a number that could have been higher, even considering that these are bridge bridge upgrades from the past. We couldn't fault the selected ones, however: from Yoshi's Tropical Isle to the Land of Terror, they are commendable both for the level design and for the gradual increase in complexity. We are a little sorry for the absence of an iconic board like Western Land from Mario Party 2, and in general it is hard to understand why NDcube limited itself to Nintendo 64 boards, considering that the minigames also come from the GameCube era. Minigames Mario Party Superstars: Peach just won a game in ~her~ board Without minigames, Mario Party wouldn't work at all: they are the ones who give dynamism to the game, make it more enjoyable. The contribution of the boards, in fact, lies in giving a visual, narrative and partially strategic context to the sequence of minigames. These can be all against all, two against two, one against three: we cannot complain about the number (a hundred) or the variety of those selected, as written above from both the Nintendo 64 and GameCube episodes. Some - few - are perhaps repetitive, and being a collection it's a pity, but they are amply balanced by those that, on their own, allow you to have fun for hours. Minigames that would require only a little study and a diversification of the characteristics (in Mario Party all the protagonists have the same functions, regardless of weight or height) to function as stand-alone products. They are not many, but they greatly enrich the offer of Mario Party Superstars. We refer in particular to sports titles, not for personal taste but for the depth of the same. Hockey, football with goombas instead of goals, but above all beach volleyball: the latter is a cut above any other mini-game, a single game can last up to a quarter of an hour (by selecting the maximum score) and allows you to beat, jump, crush (directing the shot) and even to block. Mario Party Superstars: in this minigame you have to change Bowser's face to make it look like the one in the center Precisely because the real focus of Mario Party is not the main mode, but the minigames, it is possible to experience them even outside the boards: just go to the (surprise!) Monte Minigiochi. There are various modes here, such as a cart race that ends after five rounds and whoever has collected the most coins wins. There is also the possibility, much more simply, to choose and play them freely, selecting rules and participants. The cataloging is varied, and can differ according to the content (~sportsmen~, in fact), the date of creation (~GameCube~) or the difficulty of the same. The online endurance race (whoever makes no mistakes in a succession of mini-games wins) would seem to give further longevity to the experience, but we weren't able to test it enough to guarantee it. Archive and graphics Mario Party Superstars: One of the three-on-one minigames It's almost comical to maintain it considering the gigantism and size of the game mentioned, but in some ways Mario Party Superstars is the Super Smash Bros. Ultimate of the saga: not only because it re-proposes some of the best mini-games of the past, but also for some archival and anthological ambitions , even appreciable, which however are almost ridiculous compared to the mammoth work of Masahiro Sakurai. Collected Coins can be spent in the starting area of the game, Toad's shop, or Kamek's shop. Here you can buy more stickers (used to communicate with opponents), but also and above all original and rearranged archive music from old Mario Parties. Not only that, a small encyclopedia has also been included, the pages of which can be purchased: all you will get, however, is a brief history, relating only to Mario Party, of a specific character. Waluigi, for example: an image, a quick description of the character, the games in the series in which he appeared. We repeat, we do not feel like praising or criticizing this approach: the fact is that entering this territory it is impossible not to relate to Super Smash Bros., and relatingdare to Super Smash Bros. in this area anyone would come out not only defeated, but devastated. Mario Party Superstars: Overwriting opponents' snow tracks is a lot of fun, but be careful not to get caught by other people's orbs Sonically, the title offers many rearrangements of melodies from the past: it doesn't dare too much, but we fully promote it. The selected music celebrates the lightness of the game, entertaining without tiring. From a technical point of view we can only appreciate what has been done. In particular, we appreciated the care taken in the reconstruction of certain materials (such as the biscuits in Peach's birthday cake): however, as always, this series does not stand out for its graphic ambition. The Nintendo characters appear here in the most standard version possible, both in polygonal modeling and in the complexity of the animations. Compared to other company productions, Mario Party is certainly more anonymous. Offline and online multiplayer Mario Party Superstars: Can be played on any type of Switch, on more than one console, with any pad available Mario Party Superstars, like every other episode of the saga, finds its full fulfillment only through the multiplayer mode: if on its own it is a title that is at best discreet (at best), in multiplayer it is enhanced, and improves, like few others. They help the unexpected on the board, the nature of the minigames helps a lot: they are intuitive and structured enough (on average) to entertain a beginner, and not to bore an expert player. From this point of view, we can only praise Mario Party Superstars: he renounces the specificities of the Joy-Con (such as motion controls, or the infrared sensor) to make himself playable with every pad, in every situation and possible way with Switch. By selecting ~online game~ from the home screen, it is possible to experience each mode as if we were offline. Coins collected in another user's game also become expendable in your save file. Everything works very well, but the final quality of the experience will -obviously- depend on your connection and that of your fellow players. All this being understood that the main experience of Mario Party remains the one in the club, with three friends on the sofa and possible - and probable - mutual offenses. From this point of view, the absence (for now) of a voice chat makes online multiplayer even more distant from offline. Let's add one last detail: two sections have been inserted within Monte Minigiochi, made specifically for playing online alone: by ~alone~ we mean without local friends, but also without online friends. They are called ~Survival~ and ~Challenge of the day~, and allow you to challenge your opponents by focusing on the run-up to the record, so as to delve into the nuances of the various mini-games.", "date": "2021-10-28", "grade": "8.0"}