{"name": "NBA 2K22 Arcade Edition", "ref": "https://multiplayer.it/recensioni/nba-2k22-arcade-edition-recensione.html", "text": "It is strange to try the review of NBA 2K22 Arcade Edition so soon after the release of the previous edition, always on Apple Arcade: obviously the subscription platform of the Cupertino house does not allow the structural updates to which many freemium products have accustomed us on the App Store and focuses instead on separate versions, also in order to increase the number within a catalog now quite rich. What are the new features introduced for the occasion? In addition to the updated squads, a largely redesigned interface immediately catches the eye, much more elegant than some frankly sketchy solutions of NBA 2K21 Arcade Edition, while on the content front we are witnessing the debut of The Association mode, an excellent alternative to Career that allows you to play an infinite number of seasons by managing team, players, contracts, talents and so on. Methods and contents NBA 2K22 Arcade Edition, a training session in Career mode It is therefore on the structural front that the most significant differences are recorded between the new basketball edition of 2K Sports and NBA 2K21 Arcade Edition (here the review). The start screen of the game allows you to try your hand at a quick game, access the full-bodied Career mode, the spectacular urban matches of Blacktop and the inevitable online multiplayer, which includes customized or classified battles, even within the aforementioned Blacktop. forward the Career, one immediately realizes some innovations regarding the player editor, the multifaceted initial tutorial, the training sessions and, in general, the whole outline designed to allow us to familiarize ourselves with the controls and game dynamics before face real matches. However, some perplexities remain about the balance, in the sense that at the beginning our character will necessarily have to give up certain skills and this will make progression more complicated, unless you choose to lower the degree of difficulty. As mentioned at the beginning, we then have The Association mode, which together with the Career forms the fulcrum of the experience. In this case we will not control a single athlete, but we will have to manage the entire team over several seasons, a bit like in the classic PES Master League... pardon, eFootball. We will therefore find ourselves scouting, signing contracts, making sure that team morale is high, solving any problems while trying to win games and grind points for the championship. Gameplay NBA 2K22 Arcade Edition, a match in Blacktop mode From a gameplay point of view, we did not perceive any substantial differences: the NBA 2K22 Arcade Edition system is very solid and multifaceted, but is decidedly poorly suited to touch controls, which require absolute responsiveness and precision. The realistic and ~soft~ approach to movements and actions often gives the idea that our inputs are not received and the experience is thus transformed into something slow and slippery. We must therefore play with the controller and perhaps do it on a larger screen than that of an iPhone, opting for an iPad or for Apple TV: it is in these situations that the title produced by 2K Games manages to express itself at its best, delivering us exciting sequences between attack and defense phases, as well as a depth very close to that of the parent series. All, however, without the shadow of microtransactions. Having assimilated the commands and the philosophy linked to the management of shots and tackles, the mechanics of NBA 2K22 Arcade Edition are confirmed to be very valid and will not fail to excite basketball fans who subscribe to Apple Arcade , who will be able to leave the previous edition of the game behind without thinking too much about it. Graphics and sound NBA 2K22 Arcade Edition, free throw execution The technical realization of NBA 2K22 Arcade Edition appears very conservative in-game, in the sense that the excellent polygonal models, the general fluidity and the richness of the scenarios have not been further improved compared to the already impressive edition released six months ago. However, it is also missing in this case the possibility of adjusting the graphic options in order to scale the experience on older devices and this can only produce too much uncertainty if you don't own a latest generation iPhone or iPad. As mentioned, the interface was for largely redesigned, going to improve the navigability and legibility of the various menus, while the sound is really well done as regards the effects but essential on the music front and still culpably lacking in commentators.", "date": "2021-10-28", "grade": "7.8"}