{"name": "Cold Fear", "ref": "https://multiplayer.it/recensioni/cold-fear.html", "text": "The (im)perfect storm Set on a Russian whaler battered by a violent storm, Cold Fear puts the user in the role of Tom Hansen, a special agent of the coast guard in charge of carrying out an inspection on the mysterious vessel. Precisely the peculiar characteristics of such a scenario make the first moments of the game decidedly dramatic and spectacular: the turbulent wave motion of the sea acts realistically on the hull of the whaler, generating oscillations of various entities whose effects are clearly visible. The objects on the deck therefore move realistically, pushed by waves often so high that they reach the surface of the boat with their own waves. The same protagonist struggles to maintain a stable balance, making simple walking a constant danger: following strong solicitations, in fact, Tom can fall and slide towards the edge of the ship, with the user who must have good game in quickly pressing a key to make it cling to some support. Add to the whole a remarkable graphic impact and an evocative soundtrack at the right point, and it doesn't take much to understand how Cold Fear presents itself very well in its initial stages. But the first negative notes are not long in coming, starting with a rough discussion of the already weak storyline that forms the backdrop to the adventure. The plot is not the most original, having as its subject the classic genetic mess that transformed the crew members into bloodthirsty monsters: but what is most surprising (negatively) is how the story is actually treated, i.e. in a very bad way . In particular, the whole story lacks a background, with our Tom who seems to continually act without a precise reason: continuing in the game, then, the situation worsens with characters without depth, cut-scenes of dubious quality (absolutely forget the dubbing in Italian) and a weak plot that winds for the most part through documents collected on the field that the player is in no way invited to read. A lack of involvement, the one found in Cold Fear, which is also openly manifested in the gameplay of the Darkworks title, defined as ~action-horror~ by the developers themselves but which fails to make both definitions good. From France with horror The meeting with the first enemies in Cold Fear, in addition to revealing their generic and uninspired look, opens the dance to the actual game structure, based precisely on a markedly action approach. The key element of this gameplay is the presence of a specific view for combat, different from the standard one (a hybrid between third person and fixed cameras) and very similar to what we saw in the sublime Resident Evil 4: at the press of a button, the point of view shifts to shoulder height of the protagonist, who can thus easily fire on enemies using the supplied laser sight. In this situation, the control system becomes similar to that used by fps, with the two analog sticks responsible for controlling the view and movement: moreover, the automatic switching on of a torch makes the use of this camera called OTS (over the shoulders, in fact) useful in inspecting the various rooms, especially the darker ones. However comfortable and well studied, the OTS view is not enough to make Cold Fear's fights exciting, on which the low danger of the enemies and the lack of an adequate structure of damage to areas on their bodies weighs in particular. Any semblance of tactics in shooting at the various monsters on duty is therefore dispelled: the only useful point on which to place one's crosshairs is the head (or something that vaguely remembers it), given that a shot landed elsewhere is essentially a wasted bullet. A boring target practice that in the ideas of the developers was to be revived by the oscillating movements of the ship, capable of preventing the user from aiming well; in reality this happens first of all only outside the boat, and secondly it does not jeopardize shooting accuracy if not minimally (it is also possible to tighten a support with an arm to stabilize yourself, but as well as being useless it turns out to be cumbersome and often counterproductive). In short, Cold Fear as an action title is not convincing. On the contrary, some choices made to support such a playful setting - the absence of an inventory, the amount of medikits scattered around the scenario, the possibility of saving only in certain moments decreed by the game - do nothing but further flatten an already unattractive in itself. missing in action If in regards to the action factor Cold Fear struggles to imporsi as a valid title, the same can be said from a horror point of view. Conditioned by a trivial and poorly managed storyline, by a set of enemies that are not very ~monstrous~ and by settings that leave little room for anguish, the Darkworks title hardly manages to scare the user, despite trying with some twists. altogether ineffective and predictable. Moreover, Cold Fear literally narcotizes the player in his exploration phases of the scenario, presenting a surprising amount of contextually empty rooms, which seem almost inserted to dilute the playful experience. The elementary puzzles that make up the game often force the user into tedious backtracking phases, made even more unpleasant by the total absence of any map: the indications posted on the walls don't help much, forcing on certain occasions to turn literally at random. And considering the loads that accompany the opening of almost every single door, it certainly cannot be said that walking around in Cold Fear is a pleasant activity. Not very captivating in the action phase and absolutely devoid of substance in the exploratory one, the Darkworks title is, unfortunately, a completely mediocre game. And this is a pity also considering the good work done by the developers from a graphic point of view: the already mentioned spectacularity of the external setting is the peak of a more than discreet cosmetic realization, which has its strong point in the care of the scenario . Excluding the very banal look of the enemies and some rather wooden animations of the protagonist, Cold Fear is a visually more than valid product, embellished with some truly remarkable effects. On the other hand, little to say on the sound front: as mentioned, the Italian dubbing is of poor quality, while the effects are average, with a substantially monochord musical accompaniment, based on a few motifs, albeit qualitatively appreciable. Comment Cold Fear is a title that could have been excellent, but which has instead wasted a good part of its potential: evidently oriented towards an action approach, the Darkworks developers have missed the target, offering gameplay unfortunately far from being frenetic and engaging . A somewhat flat exploratory phase and the banal storyline certainly don't help Cold Fear to rise among the best exponents of the genre, despite the appreciable graphic quality of the product and some good gimmicks. Pros: Fair graphic design Some original gimmicks Cons: Flat gameplay Not very incisive storyline Various ingenuity and structural gaps Developed by Darkworks, already authors of Alone in The Dark 4, Cold Fear had a good game in arousing a certain amount of interest in the phases preceding its release on the market: strong in a setting that is not exactly original but still interesting, in an action game structure -oriented and of an apparently remarkable technical realization, the French production has always conferred the idea of being able to be a survival horror capable of making its voice heard in its particular sector. And instead, once the game has been thoroughly tested, one gets the clear impression that fear is not the only ~cold~ thing present in Cold Fear...", "date": "2005-02-24", "grade": null}