{"name": "In tourne con il DS", "ref": "https://multiplayer.it/recensioni/73305-lego-rock-band-in-tournee-con-il-ds.html", "text": "Version tested: Nintendo DSRock Band, just like the competing series Guitar Hero, is one of those franchises that place 90% of its charm in the support of dedicated controllers. Playing one of these titles using a simple joypad, of course, would be humiliating and would take away much of the fun. Quite different is picking up a guitar, playing the drums or, better yet, organizing with friends to form a full band, vocals included. The portable reductions of the game, therefore, are in many ways a simple stopgap, a ~divertissement~ that will never, ever be able to match the ~real~ experience due to obvious technical and practical limitations. That doesn't mean it's impossible to make a Rock Band for portable consoles, though; on the contrary, the facts show that not only can it be done but that the result goes beyond the wildest expectations. For LEGO Rock Band the speech is exactly the same, only that the package is added that dose of bricks and hilarious gags that have always distinguished the videogame reinterpretations in a LEGO key. Songs and bricks Let's start immediately by saying that if on the one hand the DS version of the game amazes with a quality and complexity of the audio sector that you would not expect from the Nintendo portable console, on the other hand defections are inevitable as regards the tracklist: we have a total of twenty-five tracks instead of the forty-five that characterize the versions for Xbox 360, PlayStation 3 and Nintendo Wii. In short, a big difference, especially if we consider the fact that on home consoles it is possible to further enrich the experience through DLC. Twenty-five tracks, in any case, are certainly not few and at least they appear well selected, with a certain attention towards the more ~commercial~ side of the offer to meet the tastes of younger players: ~A-Punk~ by Vampire Weekend, ~ Accidentally in Love~ by Counting Crows, ~Check Yes Juliet~ by We The Kings, ~Crash~ by The Primitives, the classic ~The Final Countdown~ by Europe, ~Free Fallin~ by Tom Petty, the unforgettable ~Ghostbusters~ by Ray Parker Jr., Good Charlotte's ~Girls & Boys~, Supergrass' ~Grace~, Jackson Five's ~I Want You Back~, Sum 41's ~In Too Deep~, Carl Douglas' funny ~Kung Fu Fighting~, David Bowie's mesmerizing ~Let's Dance~, Rascal Flatts' ~Life is a Highway~, The Automatic's ~Moster~, Iggy Pop's ~The Passenger~, Kaiser Chiefs' ~Ruby~, Pink's ~So What~, ~Song 2~ by Blur, ~Suddenly I See~ by KT Tunstall, ~Swing, Swing~ by The All-American Rejects, ~Two Princes~ by the Spin Doctors, the evergreen ~Waling on Sunshine~ by Katrina & The Waves and finally ~We Are the Champions~ and ~We Will Rock You~ by Queen. Stage to the rhythm of music LEGO Rock Band gives us the option to play using the stylus and touch screen or conventional buttons. The two choices immediately appear very different, effectively transforming the gaming experience. Using the stylus, you have to tap on the screen at the point where the note crosses the ~nut~, but in the end it is easier to tackle the advanced difficulty levels precisely because you don't have to change the position of your fingers, but simply vary the area of the screen to touch in rhythm. Furthermore, the impact with the touch screen allows us to avoid the systematic limits of the buttons, which in any case have to make their run before transmitting the input to the software and which for this reason can sometimes return results out of sync. Using the buttons therefore presents itself as a greater challenge, which in some ways is closer to the original Rock Band with the instruments, but which in fact shows the side of problems that certainly become annoying when the songs are complex and the sequences of notes become thicker. The keys to press, for the record, are the left and up directions of the d-pad on one side and X and A on the other, to obtain at least a ~symmetrical~ effect that could make the alternation of pressure more natural, albeit subject to an inevitable initial learning period. What does not change is the assignment to the L and R back keys of the passage between one instrument and another, a practice that in the DS version of the game appears not simply optional but sometimes inevitable: the ~morale~ of the entire band must be kept high , and for this reason, every now and then you have to alternate between voice, guitar, bass and drums, without always remaining anchored to the same instrument. Jumping bricks Among the innovations introduced by LEGO Rock Band there is undoubtedly the management of perfect sequences, characterized by the arrival of ~purple~ notes that, played correctly, fill the ~fever~ bar, or a ~magic moment~ in whichhere the score is multiplied. You can enter this mode by pressing the B button or the d-pad down, but doing it while following a complex sequence of notes is not very simple. Fortunately, the developers have seen fit to include the possibility of activating the ~fever~ even by blowing into the microphone, a much simpler and more immediate operation. The available modes are quite classic, with the ~quick game~ to play a song of your choice and a multiplayer unfortunately only locally. The tour mode is the fulcrum of the conversion by Backbone Entertainment, and takes up all the classic elements of the Rock Band ~story mode~: our group goes around clubs playing and the quality of the performances unlocks new scenarios , new songs and a certain amount of money to spend on different characters, outfits and instruments. Technically an excellent job has been done, especially from the sound point of view: as mentioned at the beginning, the DS is pushed to the limit and manages to pull things out of its small speakers that we never expected to hear. All this is paid for in terms of pure quality, understood as sampling frequency, but the final result is still very enjoyable.", "date": "2009-12-28", "grade": "8.0"}