{"name": "Recensione Mercenari: Pagati per Distruggere", "ref": "https://multiplayer.it/recensioni/recensione-mercenari-pagati-per-distruggere.html", "text": "War games The initial idea of the product is as promising as its development: to transport the feeling of Grand Theft Auto in a war context, elevating interaction with the environment to power. The onerous task was entrusted to the Pandemic team (already responsible for Battlefield 1942), which set the story in the hostile North Korean territory. Here we find several military factions engaged in a bloody conflict, and it is at this point that the protagonists take over, with the usual dramatic entrance, ready to change the course of events a real military action with all the derivations of the case. One of these is the interaction with the environment, which amazes thanks to the use of the Havok engine, offering a next generation playful vision. War games Or maybe not. Faithful to the spirit of GTA, the game presents an alternative vision of the canons of the genre, not putting us in the role of the disenchanted hero, but of three mercenaries ready to do anything for the resounding penny. Therefore, the surrounding battle will no longer represent the goal, but only an annoying hindrance. There is nothing to say, the assumption is intriguing, as the player's aim will be to solve the various political objectives entrusted by the faction of the case, and which will naturally be remunerated. Reward needed to purchase new and lethal weapons. The faction is irrelevant, as is the outcome of the conflict, the important thing is to earn as much as possible! GTA goes to the front The atypical setting poses a whole series of game possibilities, such as that of solving missions in total freedom, the release from allied troops, the use of any means of war. Once you have chosen one of the three protagonists (two men and a woman) with related weapons, you are quickly thrown into the fray, learning the commands on the field itself, suggested by a well-disguised tutorial. The almost total freedom is immediately astonishing, conveyed only by the indications necessary for the mission, for the rest you are free to manage yourself as best you can, and the important thing is not to do it on foot. It doesn't take much to understand the importance of cars in Mercenaries, another predictable reference to the GTA saga. It is possible to drive everything, from jeeps to crawlers, up to helicopters, all equipped with different and rewarding physics. But it is equally obvious that this is not GTA, but a real military action with all the derivations of the case. One of these is the interaction with the environment, which amazes thanks to the use of the Havok engine, offering a next generation playful vision. Total destruction! Suppose the player gets hold of a cannon, the first impulse is to shoot anything nearby, perhaps the building that stands out on a nearby hill... Nothing apparently new, at least until we witness the dismayed collapse of the cannon. said building, highlighted by animations of chilling realism. Well, in Expendables this destructive practice is applicable to most of the surrounding environment, offering amazing new ways of interaction, and therefore, fun! Korean bullets The technical sector is adequate for the ambitions of the title, offering detailed landscapes, with a very extensive field of vision, but which are slightly lacking in definition due to the multiplatform nature of the project (Mercenaries was developed for both Xbox and Playstation 2). The framerate is rather inconsistent, but the fluidity of the game is guaranteed in most situations. The polygonal modeling of the characters certainly does not make one cry out for a miracle, but it is more than dignified, even if greater care is placed on the 3 protagonists. The soundtrack is peculiar, an aspect of the title that surprised us a lot. The orchestral music seasoned with apocalyptic choirs are very inspired and strongly cinematographic, and in their repetition they take on the nature of a conceptual soundtrack, an idea that greatly favors the game atmosphere. It is possible to drive everything, from jeeps to crawlers, up to helicopters, all equipped with different and rewarding physics. Korean bullets Among the defects found a level design that perhaps could be more daring, the total lack of depth in the protagonists, as well as the absence of a real narrative plot, and the AI of the enemies is not always satisfactory. Finally, we underline the lack of implementation of the online mode, Mercenaries is a product born for the single player, but some additional options for multiplayer would have been desirable, at least in light of today's market trends. The version we tested is in English, but the one officially distributed will be localized in our language. Comment Mercenaries is a product that has surprised us considerably. Pandasmic has inherited the teaching of GTA and shooters, projecting them into a highly suggestive war context, with the high interaction of the scenarios as the proverbial icing on the cake. The result is a very fun and long-lasting game (many missions available), particularly suitable for those who like to immerse themselves in the tumultuous universe of military battles, but from a different point of view. Good technical realization, charismatic music, flaw in some uncertainty in the AI of the enemies and a slightly too simplified level design. But it is a more than promising start for a desirable sequel. Surely the credentials are all there. Pros: Suggestive and fun High interaction with the backdrops Very long-lasting Cons: AI not always convincing Level design only discreet Some subdued textures If the good morning starts in the morning, a brilliant 2005 is expected for the Western videogame market. Especially for Lucasarts, which, we anticipate immediately, has launched one of the most interesting titles of these first months of the year, its name is Mercenaries.", "date": "2005-02-23", "grade": null}