{"name": "Diciannove anni dopo", "ref": "https://multiplayer.it/recensioni/73317-alien-breed-evolution-diciannove-anni-dopo.html", "text": "Tested version: Xbox 360After almost twenty years Alien Breed is back, a shooter with a bird's eye view developed, now as then, by Team 17 which in the meantime has brought its brand from the Amiga to the Xbox Live Arcade platforms and, soon, PC and Playstation 3. Alien Breed Evolution is certainly not the first repechage of this increasingly prodigal generation of remakes, but the affection of many towards the original and some hopeful videos have created a certain curiosity around the project in the past months. The premises are those of the past and are the same as seen in dozens of other sci-fi horror entertainment products: a spaceship full of aliens who are faster and hungrier than intelligent, some humans engaged in gaining an increasingly complex survival and lots of weapons useful to not leave only potential interactions between the two previous elements of the puzzle. The weight of the years Alien Breed Evolution offers as its main course an adventure along five large maps that can be played alone, to which is added a cooperative mode quite inexplicably separated from the campaign and, in practice, overshadowed by offering some environments that can be emptied in company and nothing more . The controls are extremely simple by assigning to the left and right analog respectively control of the direction of the user's alter ego and that of the weapon he is holding, letting the right trigger shoot and the left trigger use objects - of support like medkits or offense like grenades - while scrolling between arsenal and inventory with the d-pad. A few moments are therefore more than enough to practice with a scheme well supported by a good reactivity and capable of not getting complicated as new toys are acquired with which to eliminate the quantity of different opponents from time to time capable of appearing from the ground and from the (fucking) walls. The action itself therefore works and the sensation given by the attacks is pleasant, above all because it is supported by animations that are always punctual in showing the opponents retreating when riddled by their own shots or ready to jump towards the unfortunate marine now surrounded. Xbox 360 goals With the exception of a couple of objectives dedicated to killing a given number of enemies, the 200 points offered by Alien Breed Evolution are divided between the completion of the single player, the cooperative games and the collection of collectibles. Troubled aliens Unfortunately, the unoriginal but well-executed premises collide with an almost exhausting repetitiveness of the proposed situations: in the first level in particular but then present throughout the adventure there is the constant, unidirectional need to reach the points indicated on the mini-map, without practically any need to explore is left - also thanks to a level design that is only apparently labyrinthine - but rather being accompanied by the hand from one point to another. A choice that favors completion while debasing the atmosphere and the feeling of being lost inside a spaceship now controlled by the fearsome creatures. In this sense, the reduced environmental interactions, limited to a few glass or explosive cylinders to be destroyed, as well as the only sketchy exploration, which stops at the looting of lockers and lifeless bodies, are of little use. Overall, the six or seven hours that can be spent alone, perhaps choosing the maximum level of difficulty given the non-astronomical challenge rate, are a great tribute to a past that one has not really managed to overcome, remaining anchored to it without considering the change of tastes and demands of modern players; a pity, given that technically the work done with the Unreal Engine 3 is valuable both in the characterization of enemies and environments - classic and without verticality but well done - as in the use of effects and lights. The PC version of Alien Breed Evolution is expected for the first quarter of 2010, while the PlayStation 3 version should also arrive for the next one. There is no news of additional content for these two versions.", "date": "2009-12-29", "grade": "6.8"}