{"name": "Un tocco ed  subito musica", "ref": "https://multiplayer.it/recensioni/73039-beaterator-un-tocco-ed-e-subito-musica.html", "text": "Is there portable software that allows you to create music tracks on the fly? In theory yes, more than one: just look on the App Store to find dozens of multitrack recorders and/or sequencers that promise wonders but often disappoint for one reason or another. Anyone who has tried Beaterator in its recently released PSP version knows instead that the portability and technical limits of the Sony console have placed who knows what constraints on the imagination of the developers and their desire to make available to users as many tools to create music tracks from scratch or to ~build~ them starting from preset loops. The software created by Rockstar had few defects: some samples did not shine in quality (see the guitars), a special microphone was necessarily needed to record the voice and finally (most importantly) controlling the interface using the d-pad was anything but. how quick and immediate. In short, it literally took hours to create something decent, but other than that, you could really indulge yourself. The announcement of a software version for the iPhone therefore made all music editing enthusiasts prick up their ears, given that touch screen control could make what was slow and cumbersome on the PSP practical and fast, disintegrating into all previous limitations in one fell swoop and offering Apple device owners the ultimate program for creating music anytime, anywhere. And instead... From stars to rags And instead, mysteriously, all the potential of the program has been lost along the way. Beaterator for iPhone looks like a sort of ~spin-off~ of what we saw on PSP, a ~reduced version~ that maybe works well if we're looking for a sequencer to have fun for five minutes without asking for anything more. On the Sony handheld console, Rockstar's software had a 'freestyle' mode where you could assign each button a loop and then mix it all together to see what came out. Well, on the iPhone things work in more or less the same way: you create a new song or load a ready one, then manage the eight tracks by placing the loops you want from the list of available ones. Forget about battery management between kick, snare, hi-hat and cymbals: here you have to be satisfied. And the touch screen control, which applied to the program in its original version would have made it truly extraordinary, behaves here in a discreet way and nothing more, showing its side to a few too many inaccuracies during dragging and positioning of the loops. The problem is that while on the PSP the ~freestyle~ mode was a ~divertissement~ compared to the song editor, on the iPhone it is the only available option. Music, master And the ability to export the created song? The PSP version included a system for converting the song into MIDI or WAVE format (later easily transportable in the popular MP3), as well as the support of a real social network where budding composers could compete at the Rockstar court. Well, that's gone too. Users have been left with very few tools: it is possible to adjust the origin of the sound in the stereo panorama and its volume level (in a far from precise way, however), add reverb or compression. That's all. We therefore limit ourselves to ~embellishing~ the sounds already present, without being able to modify them in any way. The interface that should have elevated Beaterator to a paradigm for the genre on the iPhone is instead presented in a classic way, with few frills and without the operating speed expected from touch screen controls. Not that simply dragging loops is going to be such a complex maneuver. The tested version is 1.0 App Store links", "date": "2009-12-30", "grade": "4.8"}