{"name": "Solitaire Stories", "ref": "https://multiplayer.it/recensioni/solitaire-stories-recensione.html", "text": "We've seen how Apple Arcade tends to value original ideas and we've already examined several of them, but the Solitaire Stories review highlights a game that, frankly, takes somewhat by surprise. In fact, it is difficult to think of a variation with narrative inserts of the good old solitaire, one of the most universally appreciated card games in the world and also historically unchangeable over time. Instead, Red Games has managed to stage something more complete and multifaceted, in many respects a real video game rather than a simple digital adaptation of the classic card game: the basic mechanics are always the same, but all that surrounds it manages to modify the experience until it becomes something wider and more interesting, even decidedly surprising. In Solitaire Stories, the various stories change the design of the cards and tables, with narrative grafts In this interpretation, the old and quiet pastime so dear to bored employees in sleepy offices becomes a kind of adventure, with a story, different challenges and a real progression, while remaining basically always the old and reassuring grandmother's game. This, consequently, always entails a fundamental distinction: if you enjoy solitaire, then Solitaire Stories can represent a truly irresistible proposition, even taking into account the intrinsic limitations of the base game, but if you are not interested in the underlying mechanics, then this title it really has very little to offer, despite all the enrichments, even significant ones, that the developers have applied. From the point of view of the gameplay, very little changes from the integrated simulation in Windows that has depopulated the world so much, but the new modes, the stories and above all the challenges and the sense of progression that characterize it can significantly increase the involvement. The solitaire you don't expect The gameplay is that of solitaire, in the standard version of the ~Klondike solitaire~, or essentially the classic one: it is a question of stacking the cards by suit and according to the scale of value, trying to exhaust the deck available. There are no real changes to the basic mechanics, but Solitaire Stories offers some interesting variations that greatly enrich the experience, in particular the introduction of ~stories~ which represent the main addition: each of these is characterized by a particular ~scenario~ that affects the design of the deck, animations, and on-screen elements. Of course, there are also some real stories, told by a narrator and centered on various stories ranging from the employee trying to carry on the games to solitary in the midst of mountains of work to the musician trying to establish himself with his art, or even legends of abysmal monsters, bizarre chivalrous adventures and much more, all filtered through a somewhat humorous style. Beyond the stories, Solitaire Stories also offers several game modes and additional challenges Beyond the narrative system, the stories also offer a real progression, arranging the games along lines made up of different challenges with progressive difficulty. This is probably the most novel element introduced by the game in the classic solitaire dynamics, because it introduces stimuli to continue, from game to game, even beyond the simple fun or relaxation given by the mechanics of the cards themselves. There are not only the stories, however: there is obviously the ~quick game~ mode which allows you to immediately jump into the classic solitaire game, but the daily challenges are also very interesting, through which it is possible to compete asymmetrically with the community of players and also earn rewards with which to unlock further stories, decks and game content. We remind you that Solitaire Stories is distributed in the Apple Arcade service catalog, therefore there are no micro-transactions or pay-to-win elements to unbalance the experience in any way.", "date": "2021-07-09", "grade": "7.5"}