{"name": "Disciples Liberation", "ref": "https://multiplayer.it/recensioni/disciples-liberation-recensione.html", "text": "The fourth chapter of Disciples, a saga which, together with the less gloomy Heroes Of Might And Magic, has written important pages in the turn-based strategy genre. Its sequels seem to be rather difficult to conceive because, with the exception of Dark Prophecy, released a couple of years after the progenitor Sacred Lands (born in 1999), they arrived with more than two decades of waiting. Renaissance, in fact, dates back to 2011, while today is the time for Disciples Liberation. The long wait seems to have been worth it, because the title developed by the Canadian Frima profoundly changes the dynamics of the single player campaign. Will it be enough to return to the old Strategy First glories? Let's find out together in the review of Disicples: Liberation. A new approach Avyanna, the protagonist heroine of Disciples: Liberation In the past there were the classic campaigns, distinguished according to the faction and divided into chapters which, however extensive, always had the same limit: that of forcing the player to start from scratch with each new mission, losing in part or in toto hard-won progress. Liberation solves the root of the problem by introducing the figure of Avyanna, the only protagonist of the entire epic. The mercenary is the only unit that has an inventory and an upgrade tree and does not belong to any faction. This allows her to do as she sees fit with the historic four warring races: Imperials, Undead, Damned, and Elves. The narrative structure, in the intentions of the developers, should play one of the key elements of the experience, because it requires choices that influence the relationships with the parties involved. Unfortunately, however, the result is below expectations. In the first place because, with the exception of the lovers of the chronicles of Nevendaar, very few will be able to become passionate about an unoriginal plot. The choice not to dub all the jokes, but only the most important ones, does not help the involvement, as does the fact that some aspects relating to the background are taken for granted. Thus, one ends up listlessly reading the numerous lines of text and making decisions lightly. Furthermore, apart from a few crucial and clearly visible points that channel the plot towards one of the five available endings, the repercussions of Avyanna's actions often have little impact on the secondary characters. Thriving economy The citadel of Ylian, stronghold/hub where to recruit heroes and new units Once the displeasure for the missed opportunity has been disposed of, it turns out that Disciples Liberation develops on the traditional two phases of exploration and battle. Speaking of the first, there isn't much to tell: the character moves on horseback, in real time, with a bird's eye view. You visit regions, accept quests, meet enemies and collect treasures, just like all those years ago. Pleasant variations on the theme are instances to be tackled on foot with a closer view, such as the sewers that are the theater for the very first mission. The creation of the landscape and characters is pleasant (a significant step forward compared to Renaissance), but the problem remains of the poor interaction with the environment which reduces most of the quests to a mere coming and going between point A and point B. The citadel of Ylian instead represents the hub of management activities. From this point of view Frima respects the dictates of the genre, providing a series of buildings used for the training of specific soldiers; others are for trade and for upgrading weapons. By changing the faction with which to negotiate along the way, the structures are modified without losing the upgrades obtained up to that moment. This implies that the four deployments in play are poorly characterized, sharing the same stats with the exception of special attacks. Furthermore, the fact that the fortress is unique, that it can almost always be accessed and above all that it cannot be subjected to siege by enemies, takes away a fundamental tactical aspect in the game's economy. Speaking of economy, this too is been treated too roughly: raw materials abound, also thanks to generous treasures that flesh out the map and which regenerate over time and one almost never feels the need to procure more. Added to this is the passivity of the CPU which rarely (if ever) settles the conquered supply points, reducing this aspect to a mere formality. To the fight Better not approach with alow level The battles are the other column of the structure and also in this case there is no departure from the canons of the genre: they take place on the usual hexagonal grid with scenarios which, while changing according to the area of the map being explored, resemble the 'each other. The player is typically deployed to the left of the screen; in some cases it can be found in the centre, surrounded by the CPU on the sides, but it always starts first. The units that enter the field can be joined by other support units (healers, magicians, archers) that remain on the margins. This, combined with the peculiarities of the heroes (units equipped with a mini inventory and special attacks), should guarantee a certain tactical variety, but too often it boils down to a mere execution of the enemy army. Speaking of artificial intelligence, the historical weak point of the franchise, we unfortunately have to note how things have not improved over time, given that it still does not take advantage of advantageous situations, ignoring the bonuses on the map or avoiding concentrating attacks on a single player unit. But, in general, the whole tactical part is a bit too light, partly due to the limitation of the battlefield which mortifies the positioning of the units, partly due to the excessive ease. First of all, the enemies do not match the size of the player's army (you may find yourself facing two thieves with ten soldiers - the maximum number allowed) but above all, the loss of units is a painless event. When one of the main characters falls in battle, he comes back to life in case of victory, while the standard units sent to slaughter can be replaced (and, moreover, brought to the same level as the heroine) with little money. weighs and, indeed, the continuous progression of Avyanna (widely customizable in skills and spells) makes you want to play that famous last turn. In the long run, however, you begin to desire a greater level of challenge and the risk of abandoning the title before spending the eighty hours that the programmers promise is quite concrete.", "date": "2021-10-27", "grade": "6.0"}