{"name": "Outlaw Golf 2", "ref": "https://multiplayer.it/recensioni/outlaw-golf-4.html", "text": "Spa-ghet-tiiiiiiiiiiiiiiii Anyone who is about to enter the grassy world of golf must first of all know that frenzy does not live in this sport. The holes are meticulously studied, analyzing every bump in the ground, every sand bunker, every puddle of water. The index finger is raised upwards, it is brought towards the mouth in order to moisten it and then to test the consistency of the wind. In Outlaw Golf 2 these operations can be skipped over, finding the necessary data on the screen and being able to travel, as well as view, every centimeter of each hole. It is a pity that the 'virtually' saved time is heavily swallowed up by massive uploads and enormous frequency. Spa-ghet-tiiiiiiiiiiiiiiii It is a pity that the 'virtually' saved time is heavily swallowed up by massive uploads and enormous frequency. From the game menu it is possible to choose between a large number of game modes, not least the precious online item in which to measure one's skills with three other players. There is also a subspecies of mission tutorials, which soon turns out to be difficult and ill-conceived, then useless in its primary intent. The imbalance in the level of difficulty is felt right from the start, with tough opponents who do not forgive any mistakes. It therefore becomes almost prohibitive for an inexperienced player to deepen the experience by passing the obstacles noted up to now. Fortunately, these gaps are closed, or in any case disguised, by bizarre and amusing characters, who will perform in a large number of lively cut scenes, in perfect harmony with the progress of the match and the personality of the protagonists. There are even sexy hints and double meanings. Once on the playing field you have to deal with a rather convoluted, but tameable, even if not exactly suitable, control system after a few game sessions. Each player has his own peculiarities, both positive and negative, as well as a well-defined style of play. The feature of nervous tension is interesting, which in the form of a bar will outline the psychological profile of your player. After a bad shot, as well as after a good play, this bar will move depending on, leading the alter ego to stiffen or gassed, irritated or explode with joy. This possibility studied by Hypnotix has repercussions both on the game and on the animations of the protagonists, also adding meat to the fire with mini-games that can rebalance the nervous state of the sportsman within the game. Technically this Outlaw Golf 2 defends itself without too many sharp points, with well-kept polygonal models that make up for slightly subdued settings with scenarios that are too similar to each other. Pretty stable frame rate despite some inexplicable crashes in apparently light load situations. The soundtrack is varied and quite apt, which alternates with a totally English dubbing. Outlaw Golf 2 is a missed opportunity, a victim of venial mistakes that stumbles and collapses precisely on those 'fundamentals' so dear to every player. The long and frequent uploads, as well as a bad balance of the difficulty level make this title the most classic of games for fans of the genre, failing instead in the attempt to extend their arms towards those under the heading of golf who barely know the car. Ultimately, a title for the devotees of this sport, who thanks also to the peppery and extravagant imprint could really spend hours of healthy fun. For all others, an evaluation round is recommended. Pros: Quirky and funny characters. Lots of modes (including online). Hilarious cut scenes. Cons: Long and frequent uploads. Poorly calibrated difficulty. Simplified control system. One yard equals the equivalent of 0.914 metres. Before submerging the writer with 'who cares', try to think of the ambitious idea that has always driven golf: a ball to be hit in an exact point at a distance of hundreds and hundreds of yards (keep in mind the yard/metre ratio above), having the simple and only aid of a club and a few shots available. Damn absurd, don't you think? So absurd as to become one of the richest sports in the world scene, as well as representing a real lifestyle to all intents and purposes. Hypnotix has thus decided to take its Outlaw characters by hand, not exactly compliant with golf formalities, to throw them back on the green and clipped 18-hole courses. Second attempt therefore for Outlaw Golf with the main aim of improving the moderate success obtained by the predecessor, while maintaining the same, light-hearted appearance.", "date": "2005-02-22", "grade": null}