{"name": "Un puzzle game esplosivo", "ref": "https://multiplayer.it/recensioni/72832-iblast-moki-un-puzzle-game-esplosivo.html", "text": "Given the success of Rolando, there are an increasing number of games available on the App Store that have nice, round and soft little creatures as protagonists. In the case of iBlast Moki, these beings are called ~Moki~ and share with their colleagues the ability to bounce happily within the stages. Being a puzzle game, the goal is to move the Mokis in the right way and make them end up in a space gap that will project them towards the next level. But how to do it? Simple: by placing explosive charges capable of making them fly away more or less quickly depending on the distance of the detonation. The first stages of the game, from this point of view, play the classic role of tutorial in view of increasingly complex situations. We therefore find ourselves managing only one Moki and having only one bomb available. We can select it by touching its icon on the screen, then drag it near the little creature and see the trajectory it will follow projected (represented by an arrow), then press the switch and admire the outcome of the bang. If all goes as planned, the Moki will move towards the space gap and the game will reward us with a different recognition depending on the time it took us to solve the stage. Otherwise, we can use the same button to return everything to the way it was before and change the arrangement of the objects. Bim, boom, bam The most savvy will have already understood from these few lines the ~trial & error~ nature of the product developed by Godzilab. If in the first stages, in fact, it is possible without too much effort to immediately guess the ideal arrangement of the bomb to obtain the desired result, the more one goes on and the more the variants in play increase, creating situations in which it is practically impossible to solve the stage in one fell swoop: the Moki to be moved increase, the bombs and their nature increase, taking over those with adjustable timing; also and above all the surfaces change, which react differently to the stresses depending on the type. In short, the game turns into a perpetual attempt to be repeated until the best solution is found. And that's a shame, because on balance increasing complexity leads to a proportional decrease in enjoyment. Then it is clear that everything depends on personal tastes, perhaps those who love this kind of puzzle game will be conquered by the sympathy of the Mokis and by the imagination in the design of the seventy levels that make up the game (not a few!), to which are added those that we can create thanks to the built-in editor. Our works, once saved, can also be uploaded online via the Plus+ social network and made available to the community. A feature that alone is easily worth an extra point in the numerical evaluation. iBlast Moki's graphics, in its small way, are excellent. In particular for the use of colors, really excellent and able to characterize the different stages in the best possible way. The shades used change radically depending on the scenario, and in the end one wonders how the developers managed to find so many solutions, all equally valid. Object management, enriched by a convincing and well-maintained physical environment, never seems to put an engine in difficulty that proves to be robust and agile in any situation. Finally, the design of the Mokis is nice and spot on, even if some aspects of their creation perhaps denote a still immature style. The soundtrack accompanies the action in a discreet and essential way, without being noticed. Maybe it would have been the case to insert some nice little music... The tested version is 1.1 App Store links", "date": "2009-12-14", "grade": "7.9"}