{"name": "A volte ritornano!", "ref": "https://multiplayer.it/recensioni/72968-warcraft-iii-reign-of-chaos-a-volte-ritornano.html", "text": "If you enter WarCraft III in our indispensable Gamepedia, you discover that Blizzard's strategy game, years later, is one of the most loved games by our visitors (in fact, it occupies the 628th position; according to the Gamerankings.com milestone, it is instead the fourteenth best game made for PC); it is equally true that our site, sensationally, has never made a review of it, offering its users only a preview. This column was born from these considerations, which will deal with all those classics that, our culpa, were not adequately studied at the time of their release and with other old glories that undoubtedly deserve to be picked up again and seen with modern eyes. However, evaluating an ~old~ title is one of the most difficult undertakings: technological progress embarrasses the technical sector, while the passing of time erases, better than any patch, any negative aspects that were severely encountered at the time. Then there are some games that enter the list of classics for the sole fact of being chapters of important franchises; it can be said that WarCraft III has certainly been helped by the illustrious lineage, but it would not be fair to explain the reason for its success by simply indicating it in the alchemy of which every Blizzard title is impregnated, systematic ~blockbuster~. A jump into the past WarCraft III: Reign Of Chaos was released in the summer of 2002, more or less at the same time as Neverwinter Nights: times were different and publishers did not wait for the fourth quarter of the year to launch the precious cartridges on the market. The anticipation that had arisen around the third episode of one of the most important sagas in the field of real-time strategy was nothing short of spasmodic: it was in fact the first accelerated 3D production for Blizzard, which adapted to the new standards of market several years behind the competition. However, the Californian developer is well known for the calm with which he carries out his projects, and in fact WarCraft III saw the light after seven years from Tides Of Darkness and four from StarCraft. Jurassic gestation times for most publishers, but the results once again proved patient Sierra On-Line right. The game offers a robust single player mode enriched by excellent computer graphics movies that explain the progress of the plot. As was the case in StarCraft there is a single campaign divided into four acts, i.e. one for each race in the game. It starts with that of humans and then move on to that of the undead, orcs and night elves. Each act is in turn composed of several missions, characterized by tasks that sometimes go beyond the simple annihilation of the opponent. From this point of view, therefore, there did not seem to be any big news compared to the RTS panorama of the early 2000s: however, the thing that distinguished Reign Of Chaos from most of its competitors was the implementation of heroes, units endowed with incredible powers that could be improved as in a hack n slash role-playing game (i.e. slaughtering like hell) and resurrectable ~ad libidinum~ during the game. It was certainly not an absolute novelty (the underestimated Sacrifice immediately comes to mind) but the way in which elements taken with full hands from role-playing games were managed would later make school. From a purely strategic point of view WarCraft III is set on arcade levels or in any case much softer than the simulation stakes already set a few years earlier by Creative Assembly with the Total War saga. The same sacred rule of the Chinese morra is a little ~violated~ by the presence of the aforementioned heroes and by the intriguing economic system regulated by the ~budget cap~ (Mosley would have arrived there several years later!). This ~tax~ in practice not only prevents you from making more than a certain (low) number of units (the more powerful ones take up more slots), but reduces the efficiency in collecting the precious raw materials the more your army is numerous. Consequently, when a certain number of recruitments is exceeded, with the same resources withdrawn, a smaller quantity enters the player's coffers. All this only favors the rushing technique, i.e. the exaggerated accumulation of resources from the first seconds of the game to form, in the shortest possible time, an army made up of the strongest units with which to punish the underbelly of the opponents . The typical tactic of professional players foresees that, in the meantime, you level up your hero by attacking the non-player characters present on the map (another RPG element introduced by WarCraft), perhaps escorted by a small group ofsimple soldiers. Clearly to get the better of expert opponents you need to master your race to perfection, studying not only the exact order in which to carry out the updates, but also by positioning the buildings in the best possible way to allow a quick collection of the indispensable gold and timber. Multiplayer, cross and delight This style of play, which makes immediacy its weapon of strength, is indeed one of the most discussed aspects of Reign Of Chaos. On the one hand there are those who point out that the strategy just described can be applied without distinction to any race and map and that indeed certain ~macros~ are mandatory if you want to keep up with the most savvy players. Even those who love a more thoughtful and orderly management of the battle certainly cannot but turn up their noses in the face of some simplifications (for example the absence of morphology of the maps, or the scarce effectiveness of the defensive turrets) which are actually apparent: the Blizzard's real strength was that it made four races available to the player (there is also a fifth, the Naga, introduced a year later with the Frozen Throne expansion, but it is not usable) extremely easy to manage but very difficult to master. It almost seems like an advertising slogan but in the end it's just like that: only the experience accumulated on the battlefield allows the player to improve their skills. And in fact the multiplayer was the beating heart (and is still decidedly lively today, thanks to the continuous profusion of patches that the parent company continues to produce; the last one dates back to a few days ago) of this RTS, despite the only game. Numerous clans were immediately formed, favored by the visionary Battle.net, the proprietary service for online gaming which continues to be enriched with new features and WarCraft III became a mandatory appointment for numerous Italian LAN Parties. Also from an artistic point of view Reign Of Chaos proved to be far-sighted, laying the foundations for the subsequent World Of WarCraft. A distinction must be made between the technical sector, entrusted to the DirectX 8.1 libraries and devoid of many special effects that have become customary even for minor productions; already at the time of the release there were some bad moods because something more spectacular was expected. On the other hand, the character design was at the highest level and is still very current today. Orcs, humans, zombies and elves are all made with the typical and captivating Blizzard style and are not excessively affected by polygon anorexia. The maximum resolution is 1280x1024 but it is easily editable manually to fit modern screens.", "date": "2009-12-15", "grade": "9.0"}