{"name": "A Boy and his Blob", "ref": "https://multiplayer.it/recensioni/72948-a-boy-and-his-blob-un-ragazzo-il-suo-blob-e-il-suo-wii.html", "text": "It is almost a love story that binds the developers of the WayForward Technologies team and A Boy and his Blob: Trouble on Blobolonia, a video game for the NES released twenty years ago in which the protagonist could count on the help of a nice shape-shifting blob to overcome a series of internships full of pitfalls and characterized by a level of difficulty that is anything but friendly. The remake, made exclusively for Wii and simply titled A Boy and his Blob, faithfully reproduces the mechanics of the original while softening its many edges. The result is a decidedly more relaxing product, with a slow and gradual increase in difficulty, which is particularly striking due to the cartoonish graphics. And it's not just a way of saying: the visual impact of the game is practically identical to that of a good quality cartoon, with an extraordinary use of colors that gives life to evocative scenarios and great atmosphere, within which well-drawn and even better animated characters move. Above all, the boy protagonist of the story boasts a full-bodied repertoire of actions, each of which is convincing for how it is represented on the screen. There are few exceptions to the rule (see the undoubtedly ugly jump) and they cannot affect the quality of a job carried out with passion and competence. The encounter with the blob takes place during a particularly eventful night, in which the stars seem to fall to the earth: the boy wakes up with a start and reaches the smoky crater that he has created a short distance from his home, only to find this little white creature there , soft and chewy, who is crazy about gummy candies and who immediately demonstrates that he has unique and extraordinary abilities: depending on the type of candy he is fed, he changes his shape to become a ladder, a ball, a trampoline, a hole in the ground, a balloon... twelve different shapes that will help the protagonist of the game to try his hand at an extraordinary treasure hunt through four ~worlds~ each divided into ten different stages and crowned with additional skill tests that they bring the total number of levels to eighty and more. De Blob A Boy and his Blob immediately presents itself as a nice mix between platform and puzzle game, characterized by linear action that is varied from time to time thanks to the transforming skills of our little white friend. You can play using the usual Wii-mote / Nunchuck combination, or use the Classic Controller. In any case, none of the peculiarities of the Nintendo console is called into question: the Majesco Games product in this sense winks at retrogaming and offers an ~old school~ but certainly tasty experience, which actually starts very slowly and it takes a while to get going. Most of the stages of the first ~world~, in fact, flow away almost without problems, offering truly down-to-earth puzzles and making us think of a title dedicated to the little ones. Fortunately, then things change: boss fights and additional challenges are introduced, the transformations of the blob become even more numerous and the puzzles become more complex and interesting. Nothing to do with that little gem that is Braid, but certainly A Boy and his Blob is not the kind of title that is finished in a couple of days. The management of the jump appears well made, without particular problems (apart from the animation that accompanies the action), and the same can be said of the launch of the gummy candies, which can be effectively directed to ensure that the blob always transforms into the indicated zone. This is an important element, especially if our friend has to become a hole in the ground and the ground below is characterized by a few too many chasms. The movement of the two characters is completely independent. Generally the blob follows us closely, but it sometimes happens that it stays behind and we have to retrieve it by pressing the appropriate button: the boy calls out his friend, who after a while runs in the form of a balloon. A Boy and his Blob certainly presents itself as an out of the ordinary product More of everything Platforms, thorns, chasms and air currents are not the only things we will find in the scenarios of A Boy and his Blob. The game boasts a large group of ~blobby~ enemies like our white companion, but forced into black animal forms. Everyone behaves in a different way (see the ~bull~, which charges when the boy is in front of him), following deliberately simple and predictable patterns due to their integration into the overall picture of the puzzles to be solved. The particular shape of some locations does the rest, forcing us to use the blobto overcome tunnels or to transform it into a parachute to be pulled out after a particularly dangerous jump, then directing the descent in order to avoid the pitfalls. The delightful squares we have already talked about are accompanied by an essential and delicate sound sector, with the boy's (sometimes shrill) voice imposing itself on the rest of the effects, while the music does not conquer but does its job discreetly.", "date": "2009-12-14", "grade": "8.0"}