{"name": "Robot e misteri", "ref": "https://multiplayer.it/recensioni/72550-mystery-mania-robot-e-misteri.html", "text": "What's more bizarre than a sentient robot? Maybe a sentient robot who has lost his memory. That's what happened to F8, a brave but bumbling android who wakes up in the closet of a huge mansion without remembering who his creator is, or why he disappeared without a trace. Each of the twenty-seven rooms that make up the house contains a puzzle to solve, more or less complex: F8 must interact with the objects found inside them to find the solution to the problem from time to time and continue on his adventure. After a while, the robot finds F1 on its way, the first sentient computer created by the landlord, who offers him a deal: if F8 helps him find his circuits, scattered who knows where inside the mansion, he will in order to restore his memories. The two androids are not alone, however: a strange little boy wanders around the house without an apparent destination. Is he the key to the mystery? The Riddler Mystery Mania basically looks like a puzzle game: each room constitutes a puzzle to be solved, and to do so our F8 must interact with the environment just as if it were a ~point and click~ adventure. The original mix of the two genres is accompanied by an engaging and very well told story, which brings to mind some of the most famous PC adventures and encourages us to work hard to continue the story. Interaction with the scenario is simple and immediate: just touch the object of interest for F8 to move to pick it up, then touch the object with which we think it can be combined. Never as in this case, an example is worth a thousand words: there is a room where the exit is closed to the robot because of a puddle of water. There is an umbrella near it, but we cannot pick it up directly. But on a table there is the controller of a radio-controlled car stationary on the floor and equipped with a sort of hook. Just pick up the battery that is on the left side of the room, put it in the remote control and move the car so that it can hook up to the umbrella and take it to us: mystery solved. The associations between objects and contexts are all quite logical, without solutions that are too obscure, so in general it is enough to do some quick reasoning to understand how to move forward. The control system is completely based on the touch screen and does not require any particular skill: just touch a part of the interactive screen and F8 will immediately react to the input, picking up the object or shaking its head if this does not serve the purpose . Unique style The technical sector of Mystery Mania is based on simple but not simplistic solutions, in the sense that an apparently elementary design hides unsuspected narrative potential in this case. Just spend a few minutes in the company of F8, observe its ~facial expressions~ that elicit more than a smile, look at its behavior in the most disparate situations. There are objectives to unlock depending on the most absurd actions that are performed, and discovering them even by chance turns out to be a pleasant surprise. The animation is of poor quality, but even in this sense the suspicion arises that it is intentional, and the direction of the cutscenes only confirms the goodness of this choice. Even the sound, so essential and primitive, helps to create a certain atmosphere. Never as in this case, therefore, are we faced with a product that makes simplicity and style its strengths, offering us an experience as tasty as it is particular for just 79 cents. The tested version is 1.1.2 App Store links", "date": "2009-12-11", "grade": "8.0"}