{"name": "Suonare  pi divertente saltellando!", "ref": "https://multiplayer.it/recensioni/72580-maestro-jump-in-music-suonare-e-piu-divertente-saltellando.html", "text": "We thought we'd seen all the colors by now, especially on Nintendo DS, a little wonder machine that never ceases to amaze and surprise us with fresh ideas, new gameplay and new genres born from the combination of innovative and very special hardware features. Its double screen, but especially the touch screen, have freed the imagination of many software houses: PastaGames is one of them. Their Master! Jump in Music is a combination of disparate but masterfully mixed genres: platform, rhythm-game, adventure. Music, rhythm and platforms The premises that form the background for the story of Maestro! Jump in Music are, as usual, a mere pretext to justify the character, the purpose of the game and the succession of the various levels. Thanks to the incipit, however, the curious mix of genres in which the game was merged is also motivated: we are Presta likeable, pink penguin nemesis of the evil spider called Steccato, thief of musical notes and the companion of our fearless bird. ]The objective of the game is therefore to defeat the enemy, recover the music and live happily ever after with the bird of our dreams. But the most important aspect is the innovative gameplay: Maestro! Jump in Music is a platformer in which horizontal and forced scrolling levels follow one another in five well-characterized worlds and interspersed (like any good platformer) with bosses and final monsters. The scrolling of the level represents the speed of the game, just like the sheet music of any Guitar Hero or Rockband; the difference is that Maestro! Jump in Music is not only a matter of ~plucking~ the strings in a rhythmic way, but we also have to jump on the various platforms, collect notes and defeat opponents. Presto's movement is therefore automatic and inevitably flows from left to right. Our only interaction with his movements is to make him jump up or down, thus trying to recover bonuses and notes scattered throughout the various levels. However, it is not just a matter of collecting the famous golden notes, but also of touching rhythmically and in a precise timing way the many enemies that stand in front of us: time is given by a small circle that slowly tightens around them . Master! Jump in Music is a challenging but not frustrating game, difficult but not impossible. The learning curve is quite gentle and well graduated, allowing any type of game to familiarize themselves with the controls in a progressive way, up to being able to face the last, quite complicated levels. A successful mix of genres The total tracks in the game are 18, each of which corresponds to a level to face. The reproduction of the songs, mainly classical music but also contemporary productions, is made of excellent quality samples and execution. In addition to the normal story option, there is also another mode through which we can tackle one of the many levels we have already tackled previously, allowing us to enter our scores in the game's general ranking. The quantity and variety of the levels can be found, by extension, also in the number of musical instruments that can be ~played~ during the game action: guitars, drums, bass, drums, etc., each of which can be activated with a different movement of the stylus DS on touch screen: pinch, tap, rotate. There is also a ~Singing~ mode in which we can sing the melodies while playing the songs. Between level and level there are intermediate schemes where we are called to face more challenging bosses, graphically represented by the henchmen sent by the bad Steccato. In these situations, the game turns into a sort of ~Space Channel Five~, a title in which we had to try to reproduce all the dance moves proposed on the screen with perfect timing. Quality soundtrack The technical realization of Maestro! Jump in Music, despite the tiny Pastagames team made up of just a handful of guys, is definitely valid; the designs are captivating and in pastel colors, the levels are well characterized and all very different from each other, the characters are nice and without that sense of deja-vu that many contemporary video games often arouse. Some levels are perhaps stripped of details and with an improved texture definition, but the general picture is absolutely pleasing to the eye, especially considering that Maestro! Jump in Music represents a sort of Guitar Hero in platform sauce, where timing and rhythm prevail over the glance (the automatic scrolling structure proves it). The musical choice is of the highest level and includes classical, pop and great classics: from ~O Sole Mio~ to ~Flashdance~ passing through Morricone, Bach, Mozartand Beethoven. What amazes most about Maestro! Jump in Music is not the mix of genres in itself, nor the realization: it is precisely the level of challenge and fun that a game born from such a small team and with such unpretentious premises can generate in an audience that nowadays he had seen practically everything and could no longer be amazed. Master! Jump in Music is a little gem recommended for everyone, but especially for those who love platformers or rhythm-based music games. If the good morning starts in the morning we will hear more about the guys from Pastagames.", "date": "2009-12-09", "grade": "8.3"}