{"name": "Astro Boy: The Videogame", "ref": "https://multiplayer.it/recensioni/72692-astro-boy-the-video-game-astro-morente.html", "text": "Tested version: Nintendo WiiOne of the best-known works of the ~god of manga~ Osamu Tezuka, Astro Boy was born way back in 1952, the protagonist of a long and honorable career made up of comics and anime, as well as the last victim of the remake race that belongs to the modern US film industry. While the Italian public awaits the release of the animated film in theaters, the inevitable video game tie-in arrives early, by the same High Voltage Software responsible for the controversial The Conduit. And it will certainly not be this Astro Boy: The Videogame that will bring prestige to the developer's curriculum. astronomical fail It certainly cannot be said that Astro Boy: The Videogame starts off on the right foot: the game is introduced by a CG sequence that summarizes the initial stages of the story, using images taken from the film, and then leaves room exclusively for cutscenes in real life. -time good only to highlight the audiovisual gaps of the High Voltage title. It is therefore inevitable to immediately frame the product as a project with a limited budget, created solely and exclusively to monetize in the wake of the probable success of the feature film. Confirmation of this hypothesis already comes from the very first moments of the game, in which Astro Boy: The Videogame immediately makes clear the difficulties in terms of gameplay of the product. In fact, we are faced with an action game with a two-dimensional structure, divided into stages in which the protagonist proceeds alternately on foot or in flight. In the latter case, the mechanics recall those of the classic horizontal scrolling shooters, totally orphaned, however, even if only of acceptable challenge rates: in fact, the enemies appear on the screen with practically harmless weapons and moving at an embarrassing slowness, proving to be very easy targets for Astro lasers. In short, if boredom appears more than concretely in these sections, the situation does not improve when you proceed on land. In these predicaments, one mostly finds oneself fighting against a scarce variety of opponents of a robotic nature, mainly exploiting punches and kicks combined from time to time with some special move: however, the use of these techniques is limited by a special indicator, which recharges via glowing orbs dropped by defeated enemies. Too bad that Astro Boy: The Videogame lends itself to a large number of programming naiveties that inexorably compromise its final quality. It is not possible to carry out an attack while moving, some opponents are too short or small to be reached by the protagonist's blows, one is often hit by projectiles coming from who knows where, and so on: and these are just the most striking examples of superficiality of the work done by High Voltage Software. Toy Boy Considering the modest scenario described so far, the extreme brevity of Astro Boy: The Videogame is just yet another negative aspect; seeing the credits after not even two hours of play really represents something impossible to justify, a sort of record or close to it. Wanting to really look for a positive key in this sense, it could be said that the work High Voltage compensates for the very limited longevity of the adventure with a replay value supported by the possibility of tackling the levels in the company of a friend: and if it is true that in multiplayer the general situation is a little less heavy, on the other hand we are always talking about an insufficient and disappointing action game. In fact, the technical sector was also rejected, starting with a graphic that was not only mediocre in its entirety, but even a harbinger of some stylistic choices that were now considered extinct: this is the case of the full motion video backdrops of the shooting sections, which could not be seen from the time of the first shooters in CD format, or the primitive direction of cutscenes, made up only of shots and reverse shots. While playing, then, it is impossible not to notice the woodiness of the animations of the enemies, their barely sketched design, the extremely poorly defined textures and the mixed look of the scenarios that form the background to the action. An analogous speech then in sound terms, especially as regards the Italian dubbing: already uninspired on its own, this aspect of the D3 production suffers from a vast series of translation errors, which can be found in sentences that -simply- have no complete sense. The unsustainable cyclical nature of the background music of Astro Boy: The Videogame and the absolutely anonymous effects complete a bleak picture that requires deep reflection on the validity of the publisher's quality control system.", "date": "2009-12-03", "grade": "4.3"}