{"name": "Lego Indiana Jones 2: L'avventura Continua", "ref": "https://multiplayer.it/recensioni/72779-lego-indiana-jones-2-lavventura-continua-un-tesoro-di-mattoncini-per-indy.html", "text": "Tested version: Xbox 360For those who in the past have had the opportunity to try one of the games in the Lego series, regardless of the type of license, this Lego Indiana Jones 2: The Adventure Continues will certainly not come as a surprise. Following the path already trodden many times, Traveller's Tales brings back the winning formula inaugurated with Lego Star Wars almost five years ago on practically all platforms. A few small changes to the setting of the levels and the game actions do not radically change the structure of the series but make it, if appreciated, even more pressing. The second Lego Indiana Jones consists of 6 chapters. Three of these concern the latest film dedicated to the archaeologist played by Harrison Ford, or ~Indiana Jones and the Kingdom of the Crystal Skull~, the other three are each dedicated to a film of the old Indy trilogy. To access the blocked chapters, you must first complete those available in the initial menu, consisting of a series of wooden crates that recall the one that contains the lost ark at the beginning of the new film. In addition to these, there will also be a box for bonus levels and for the adventure editor, a simple tool for giving life to one's ~story~, through the choice of levels, player characters, and the artifact to recover. It's like walking on biscuits... Unlike past games, to access the levels of each chapter you need to complete some tasks/puzzles on the central map, which gradually unlock new accesses, new characters and new vehicles. If to complete the chapter you probably need to play less than half of the available levels, to unlock everything, and therefore have access to the ~Super Bonus~ level, you will need to find a way to access each level and meet the requirements to complete it. It seems a bit complicated at first, also because the game isn't clear enough on many of its aspects, but once you understand the structure you'll just have to set your brain in motion... and make assumptions. The levels of a chapter are divided into ~campaign~ and ~bonus~. The first ones are essential to move forward in the story, the second ones are supplementary and unlock a treasure, which put together with others, will allow you to build a useful tool to reach the final prize. Once completed, the campaign levels will have to be replayed as bonus levels in turn, with some minor changes. The diabolical mechanic that holds everything up is that to unlock some levels you need to have certain characters (or vehicles), and to have certain characters you need to have completed other levels, and many of these also require specific characters to be completed. The central hub is a kind of interlocking game where you have to unlock everything step by step, without having the faintest idea of the order to follow. Furthermore, the characters and vehicles must be bought with the bricks collected during the levels by destroying the destructible backdrop or simply passing over it. This brings us to the next step Fortune and glory, boy... Fortune and glory The pivot on which Lego Indiana Jones 2 is strong is undoubtedly that of collectibles. Tackling a level would not require too much effort, luckily the same is littered with objects to be destroyed in order to make cash and receive the ~Adventurer~ status once a sufficient amount has been scraped together (which is essential to achieve 100% game completion). The more time you spend examining every inch of the level, the more money you will have available to spend for our venal purposes. In addition to these treats, each central map hides 30 colored blocks, 10 red, 10 green, and 10 blue. The reds unlock cheats (such as the points multiplier), always to be bought at exorbitant prices, the greens of graphic effects as curious as they are useless, and finally the blues allow you to speed up some operations such as excavation, construction and things like that. Anyone who for some reason should find himself immune to this tunnel of expenses will lose much of the attraction that the game has to offer, because the rest must be found in the puzzle structure, certainly not least, and in the fights, which are instead only a pause between searches. In addition to the classic fisticuffs, Indy can use his whip, which is very useful for overcoming certain points by shooting it against handholds or for picking up and activating distant objects. A novelty compared to the past is that each character can use his own weapon aiming directly at the areas of interest. By holding down B, a viewfinder will appear that allows us, for example, to cut a rope, set a spear, or hit a target, all operationsoni necessary in the resolution of the level. Xbox 360 goals Lego Indiana Jones 2: The Adventure Continues is a game short on points. To unlock the first objectives you will have to complete the chapters, one for each. More will be unlocked once all chapter levels are completed and then the Super Bonus is completed. In addition to these there will be some secret and independent from the progression of the game such as firing 100 Bazooka shots. Reaching the thousand points is more a matter of time than difficulty, but time is really needed. You'll be crawling back in five minutes! At the beginning we talked about characters and vehicles. Each chapter offers a vast fleet of cars (and similar) and a large group of characters to control. It's not just about graphic variations, but in many cases the characters have their own characteristics. Meanwhile, all the women jump higher, thus giving meaning to those points marked by floating flowers, of which the game tells us too late. Many of the others instead have their own arsenal at their disposal, Indy obviously has his whip, but there are those with the shovel, those with the spear, the sword, the bazooka and more. Everyone can be indispensable both to open access to the levels and to complete them. In fact, if once inside a pulsating writing should appear that reads something like: ~You will need a character with secure access to complete the level / You will need a character with a gun to complete the level~, there is nothing else to do than to go out and wait until you've found the right characters. When in the map you can jump from one character to another by pressing the Y key, and the last two selected are the ones that will enter the level. The vehicles, on the other hand, allow both to move around the map quickly and to complete some challenges which consist of crossing some doors with the right means in a limited period of time. These will also unlock characters and allow you to progress. One last quick tip to remind you that Lego Indiana Jones 2: The Adventure Continues can be tackled in full in the company of a friend who can come and go as he pleases. Everyone will have their own character (to be exchanged as desired on the map) and will do their part in the level (instead of the continuous change between the two characters as in singles). When the two players get too far from each other, a black line creates a dynamic split screen that allows everyone to follow their own portion of the level.", "date": "2009-12-07", "grade": "7.9"}