{"name": "CSI: Miami", "ref": "https://multiplayer.it/recensioni/csi-miami.html", "text": "Elementary, but not too much The whole cast will join you during the investigation, which includes a total of five cases to solve, where in each of them a different detective will support you, while Horatio Caine, the most unbearable of the series, will only introduce you to the case (in this I see a forward-looking choice). The backbone of the game is an exquisitely ~point and click~ interaction within static screens, each illustrating a place on which you can carry out investigations. Only the crime scene rotates in a panoramic sense, but you are not allowed to move in any way within the scenarios, especially since your only extension in the game is the mouse pointer. However, you will be able to benefit from some zooms on the relevant areas, which you could discover by foolishly clicking on the screen or by proceeding with the investigations. I would like to commend the developers, who have created a practical and flexible system to avoid you hours of frustrating research Elementary, but not too much Naturally, there will be no shortage of suspects to be interrogated by asking them questions, even if, as for the collection of evidence, there are different levels of difficulty that can be customized during the course of the game itself, so as to make progress a little less trivial. Let's take an example: you might want the computer to provide you with the list of questions, otherwise you'll have to drag the object onto the suspect to see if it has anything to say about it. In one case or another there are no right or wrong questions, sooner or later you have to ask them all. Even the presence of a support detective serves no other purpose than to provide you with a clue in case you get bogged down, to the detriment of the final score. On this point I would like to praise the developers, who have created a practical and flexible system to avoid you hours of frustrating research, since we know how much you tend to no longer see a detail within a screen that has already been examined countless times after a while. The Devil is in the details However, the fulcrum of the television series is based on the comparison of laboratory tests, entrusted to the most modern investigation systems, showing viewers what happens, for example, to neural connections that break due to a hemorrhage, with scenes that are sometimes even a little raw but impactful. These kind of videos, made live, are also present in the game, as well as the three key locations that you will work on as a member of the CSI. The first is the morgue, where the coroner will give you information on the causes of death, allowing you to make further investigations on the bodies or organs themselves of the victims (in the first case you will even have to examine the digestive system of an alligator). After the autopsies, wash your hands and you can talk to the pragmatic Salas, the only one able to provide you with subpoenas or search warrants, provided that you have collected enough clues to proceed. Lastly, but only in order of appearance, because you can access these places whenever you want, is the analysis laboratory entrusted to the pungent Valera. Here you will delight in fingerprint comparisons, DNA analyzes and other comparisons useful for identifying evidence for the case. The most interesting aspect is the toolbar that you can access directly from the game screen, which contains all the tools of the real expert, including creams for the casts of wounds, ultraviolet light and all sorts of detectors for fingerprints as well as to a field microscope. The set of tools is divided into two categories, one for collecting evidence and one for locating evidence, both of which can be used to manipulate the clues themselves once you have collected them. I warn you that you will also bring amputated limbs and other unromantic souvenirs with you. A meticulous analysis of the places and a detailed comparison of the clues is the key to obtaining progress useful for solving the case. Please don't try this at home Frankly I prefer to watch the episodes on TV. The reasons are different but crucial, first of all the fact that as much as the game tries to make you feel like the real masters of the case, in reality the road has already been traced and is as linear as possible. You may overlook a speck, but it's impossible to make a mistake and there are no antagonists. It's like looking for the similarity between two cartoons in the Puzzle Week: all you need is a little eye and bad luck, if one tool is not the right one, you just need to click with the next one. The same goes for laboratory analyses: it is sufficient to place the samples side by side and press a button to verify their actual correspondence, which I assure you always appears more than obvious. It may seem natural that yesso, since the game is not aimed at aspiring forensics agents, but precisely for this reason the fiction appears even more strident with what is done to conceal it. Furthermore, all the rhythm and atmosphere of the television series is missing, because the dead times occupy the majority of the investigation, while the actors themselves do not have animations and facial expressions adequate for the changes in the soul that certain news should arouse, with the result of making you feel far from a true narrative involvement. I want to spend a few more words on the overly minimal graphic rendering, made up of barely animated figures glued onto poorly maintained and sparse two-dimensional backgrounds. The dubbing is in English and certainly does not sparkle, but at least the subtitles have been localized in Italian. the curiosity of putting the pieces under the microscope or of making the casts on a new corpse keeps you there long enough to spend a few hours in total serenity, thanks also to the possibility of asking for help and thus proceeding with the investigation. Please don't try this at home I would like to say more about it but the problem is that there is really nothing else to discuss, being a game that lives only on its aiming interface, although as you can see I chose to give it a 6.5 which still saves him from the abyss of mediocrity. The reason is that despite everything, it's the most relaxing I've ever experienced. Even if the cases are not yellow of great depth, the curiosity of putting the pieces under the microscope or of making the casts on a new corpse keeps you there long enough to spend a few hours in total serenity, thanks also to the possibility of asking for a help and thus proceed with the investigation. It's a shame because the right stimulus, applied to an interface that relies more on the possibilities of a video game, could have made it a much more pleasant product, while as it is, it can only satisfy a mild desire to pass the time. Comment The weakness of CSI: Miami lies almost entirely in the attempt to entrust the interaction to an obsolete ~point and click~ interface, which does not take long to show its limits, without adequate visual elements being able to drag you into even a similar involvement to the television one. Unfortunately, the technical realization saves too much on effects and films in order to give back to the product the polish it loses in the interaction. A relaxing game remains in our hands, but without bite. Excellent for those who just want to relax or for a mature audience away from the world of video games, looking for a simple and approachable product; to all the others I recommend the very Italian Martine Mystre by Cinghini. Pros: Relaxing and soothing Never frustrating Cons: Linear and bite-free Jurassic gameplay Visually far from the television series No murder is perfect The case of CSI: Miami is an emblematic example of film production adapted to a market that does not share either the methods of use or the expressive intentions of the film. This shouldn't surprise us too much, given that in any case the reverse passage occurs with increasing frequency. Given these premises, what I expect is to transcend the television experience, therefore having more fun than in front of a DVD of the series, since the intent is to make me experience my ~beloved~ episodes. So let's reconstruct the case, so as to collect enough evidence to be able to judge, on the other hand it is Yelina Salas of the CSI who teaches me that intuitions are not enough (with her annoying give me reeseasons). If you missed the previous TV series, don't worry, because the plot is resolved in the single episode, where an investigative team of the scientific section (in this case that of Miami), must solve a murder case by making use of the millenary progress of science. analyzing every detail found at the crime scene. You have exactly the same kind of task; gather the clues, correlate them to each other, and bring in the culprit. Don't worry, on the packaging it says that the minimum requirement is to be sixteen years old, so even with a 5 in physics you will be able to navigate between coroner and laboratory technicians.", "date": "2005-02-18", "grade": null}