{"name": "Al mio via scatenate l'inferno!", "ref": "https://multiplayer.it/recensioni/71857-medieval-al-mio-via-scatenate-linferno.html", "text": "On iPhone and iPod Touch, the touch screen as an input device has led to a decisive rediscovery of tower defense, strategic games in which our goal is to defend one or more positions from the assault of a growing number of increasingly aggressive enemies . In general, this type of video game offers the player two distinct and separate phases: one of preparation for battle, with the strategic disposition of the troops, and one in which the actual battle takes place, in which corrections can be made on the fly if necessary. In the case of Medieval, an important action component has been added to these two phases, which in fact distinguishes the title developed by Olmob for Brisk Mobile from its numerous competitors. In each stage there are two castles with as many banners in front of them: on the left the enemy one, on the right ours. Several waves of soldiers leave from the enemy castle and head towards our position with the aim of stealing our banner and taking it to their base, or of tearing the castle to pieces: in both cases, if they succeeded, it would be game over for us . The only way we have to resist is to decimate the enemy troops using a huge crossbow placed on the castle tower, which launches arrows of different types (single, multiple, burning, piercing) that we can enhance by spending the money obtained from each kill. Throw and throw The crossbow is the only weapon that we control directly, choosing the control system among the three available: drag, automatic and with visible trajectory. The drag system involves precisely a movement of ~tension~ applied with the finger on the screen: we pull back the string of the crossbow and release it for the arrow to be launched. The automatic system instead allows us to simply ~indicate~ where we want the arrow to be fired, and lends itself to very rapid even if not very precise attacks. Finally, the system with visible trajectory is certainly the most immediate and intuitive, since it shows us exactly what the descending parabola of the arrow will be to better manage our shots. As mentioned above, we can upgrade the crossbow and equip it with different bullets by entering the ~shop~ at any time and spending the money earned by eliminating our enemies. We can therefore enhance the single arrow and improve its reload times, and do the same with flaming arrows, multiple arrows and piercing arrows. However, the crossbow is not the only resource at our disposal: we can ~buy~ troops of various types (archers, warriors, knights), build huge catapults and also manage the projectiles of the latter as we see fit. It is possible to hit the enemy castle and cause damage to it, but generally it is a difficult path to follow: it is better to resist the waves of enemies and thus overcome the hundred stages available. Shining armor The thing that catches the eye of Medieval is undoubtedly the graphics, really defined and beautiful to look at: each scenario is different from the other for the position of the castles and for the animated background, as well as for the colors (excellent). The troops have good animations that somehow make up for the very small size of the characters. The effects related to flaming arrows and the destruction of castles and vehicles are very well represented. If we really want to find a technical defect in the game, it must be said that the interface is not always accurate, in particular as regards the selection of weapons (you have to touch the relative icon at the bottom of the screen), and this does waste precious time when maybe the battle is raging and the enemies are close to our castle. The sound accompaniment is unobtrusive. The tested version is 1.0.7", "date": "2009-11-30", "grade": "8.3"}