{"name": "Dungeon Encounters", "ref": "https://multiplayer.it/recensioni/dungeon-encounters-recensione.html", "text": "When you put extraordinary people together, does it have to be that way? This is the question to ask when faced with an apparently small, minimalist game, almost thrown into the pile hoping that the generated sound is greater than other valid indie titles, but disappeared after a short time from the spotlight. Dungeon Encounters is a product born from a desire of Hiroyuki Ito, director of Final Fantasy IX and creator of Active Time Battle, who returns to sublimate his playful invention. At his side heavyweights such as Hiroaki Kato, producer of Final Fantasy XII, Ryoma Ito, who designed the characters and Nobuo Uematsu, legendary composer of the soundtrack of Final Fantasy and this game. They are all first-level profiles, gathered in the style of old friends, eager to create a JRPG capable of synthesising old-fashioned, mathematics of numbers and exploration that is both rich and stripped down to the bone. Read on to find out what we think of this new JRPG from Square Enix in the Dungeon Encounters review. Maze to descend Some characters in Dungeon Encounters are particularly surreal Dungeon Encounters is a title reduced to the minimum terms, but not for this without the substance that counts: with a very simple synopsis, the game introduces you to an almost completely fantasy setting (almost because a couple of characters and enemies are not) in which has appeared a labyrinth full of monsters that descends downwards. Anyone who has gone has not returned, so an academy has been set up to welcome adventurers who want to try to defeat all the monsters and overcome the labyrinth. The story that introduces the character today is beautifully characterized, capable of immersing well within the character of each supporting actor. However, there is an element that immediately catches the eye and it is the absolute horizontality of each alter ego: net of the initial basic characteristics, the characters have no uniqueness, they are all equally developable. Therefore, if the image shows you a beast warrior or a wizard or a cleric, this does not mean that in the game system the artistic traits correspond to skills or anything else. We can therefore summarize that, for the purposes of the game, if we remove the equipment, each initial character will be almost the same as the others, therefore it simply becomes a matter of initial impact and pleasantness of the design. Dungeon Encounters is therefore a huge labyrinthine exploration game to descend , with more than 90 levels aesthetically organized in groups of 10. The logic is very simple: each level will be made up of boxes, no more, no less. There will be monster boxes, then clashes, or information boxes, puzzle boxes - logical or visual - and support boxes, where you can recover life, revive your companions, buy items and so on. We could define it as a dungeon crawler with boxes, in which having to ~color~ each path to gradually unlock other skill points to be used to expand the possibilities of induced support of the chosen group of explorers. Direct numbers Dungeon Encounters' exploration logic reads pretty fast Ito's new creature is a riot of bidirectional numerical clashes, minimal, but capable of immediately addicting: we have a party of up to four characters, five equippable items including two weapons, two protections and an accessory, some skills according to consumption and many numbers. The combat system of Dungeon Encounters draws from the Japanese role-playing tradition bordering on numerical obsession, proposing a very intelligent mechanism. Two types of attacks - physical and magical - and two types of defense - physical and magical - closing with effective life: the attacks, on both sides, will therefore have the objective of sending one of the two to zero as soon as possible defenses, so that each subsequent attack of the same type will take away the enemy's life. Thus a dance of attacks is created - some fixed, others with random impact - which often do damage - or survive in our case - when the defense, instead of going to zero, it remains with a very low value but still valid as a defensive shield. With a truly simple numerical gimmick in its essence, Ito packs a deeply mathematical and at the same time playful system, given that it will be our responsibility to equip the party with fixed, random, ranged, ranged and so on weapons. Dangers in the labyrinth Small digressions, but some Dungeon Encounters puzzles are a nice addition to vary the pace We now come to the gameplay, which in its simplicity hides absolutely unexpected hardcore twists: the advancement in the depths of the labyrinth is a journey that starts simple, but which alreadyThe 20th floor is not a little complicated, adding several dangers to the equation, also due to enemies with often devastating attacks or surprising clashes by putting us in front of very powerful opponents. For example, we were destroyed by an enemy who twice made a move that stripped all defense from all characters with a level equal to a prime number. Made it twice, party destroyed. Initially you think that the autosave takes you back somewhere, but it doesn't: you will have to start over with new adventurers, reach the point where you lost the first group and slowly bring them back to life. It is a cumbersome process, not helped by gaps between floors present only every 10 levels, which could be exhausting and disorienting due to its brutality. It had happened to us before and we had already had to make various different floors with a party of entry-level characters, avoiding every fight, with even a little anxiety for fear of making a mistake and sending even the last remaining characters to the winds. In short, we are talking about a sufficiently honest product in general, but capable of giving life to those 2-3 random situations capable of destroying the party in an instant, forcing you to jump through hoops. What if you lose the other characters too? Game over, or start over from a long time ago, throwing away hours of gameplay, or with the last character left alive, or from scratch keeping the experience, but not the items. In short, one would say that everything is fine until you understand how complex it can become to advance through the labyrinth, but maybe someone appreciates this sense of oppression that constantly grows. Imagine a Dark Souls where, if you die, you have only one chance to come back for lost souls; if you lose first, start over either from scratch or from hours of play back. The sound sector edited by Uematsu is simple, but very pleasant, able to accompany with discreet relaxation and then become more pushed, in The Black Mages style, when entering battle.", "date": "2021-10-24", "grade": "7.8"}