{"name": "Kratos in alta definizione", "ref": "https://multiplayer.it/recensioni/72539-god-of-war-collection-kratos-in-alta-definizione.html", "text": "Among the bulwarks of the consoles that have the PlayStation brand is certainly God of War, which will see the third chapter arrive on PlayStation 3, presumably, next March. For some time now, the Sony flagship has been deprived of compatibility with PlayStation 2 titles and therefore, either to prepare for the aforementioned arrival, or because the brand is undoubtedly very strong, Blue Point has is concerned about bringing the first two chapters on a single Blu-Ray, remastered from a technical point of view and unchanged in substance. For now in the American version and (apparently) by the end of January also in our beautiful country. The original God of War arrived on PlayStation 2 in 2005, and immediately managed to win the favor of critics and audiences. Not innovative in the broadest sense of the term, the title that saw Santa Monica Studios and David Jaffe rise to the fore was an action with adventure elements that proposed an extremely interesting setting, ancient Greece, reproduced in a sublime way from the point of artistic and narration point of view, with an inspired soundtrack to say the least. The events told of Kratos, who has now become one of the most charismatic video game characters ever, grappling with his past, up to the epic clash with Ares, god of war, and the claim of his own place in Olympus. The elements that have decreed the success of this saga, in addition to those already mentioned, are to be found starting from the perfect balance of the gameplay, which offered an always adequate level of challenge, to continue with a spectacular game progression, the absence of uploads between one section and another, a certainly remarkable glance, the constant introduction of the so-called quicktime timed sequences, used in abundant numbers to finish off the most difficult enemies and bosses. Playstation 3 trophies God of War Collection presents a good opportunity for trophy hunters, as they are present in large numbers and separated between God of War I and II. The first chapter provides 36, of which 5 gold and 10 silver, the second instead 35, including 5 gold and 11 silver. Most are obtained by completing the game, upgrading all weapons and spells, defeating bosses and finding secret chests, the more difficult ones are linked to the extra challenges available, completing the first chapter within 5 hours and crossing some sections within a certain time frame. After one comes two In short, an immediate success, accompanied by some criticisms of the control system in some cumbersome situations and the reduced presence of boss fights, which were practically reduced to the initial Hydra, a large minotaur and Ares himself. Said and done, Jaffe's (videogame) departure did not prevent the development of the second chapter, which also arrived on PlayStation 2 at the end of its most important cycle, in 2007. Basically, the title had a practically identical approach, but proposed a even more spectacular progression, the presence of many more bosses (starting from the Colossus of Rhodes) and the improvement of the control system, which saw the wise shift from the R2 key to R1 and in some cases circle to open chests and doors, so such as the ability to quickly ascend and descend ladders, ledges and specially designed walls. The technical sector in this case becomes sensational for the time, with the enhanced graphics engine in terms of particle effects, number of polygons and the same incredible artistic structure of the original title, supported by an excellent soundtrack. After the ascent to Olympus things get even more complicated and exciting, with Kratos literally pissed that the gods have not freed him from the numerous nightmares for the past, with his new fall and feelings of revenge towards Zeus , which reduced him to a mortal again and plunged him into the realm of Hades. At this point, however, Kratos finds new allies, the Titans, which allow him to begin his slow ascent to get to challenge Zeus in an epic battle topped off with a final sequence that leaves us with an absolutely foretaste of what awaits us with the third chapter. We finally arrive at the God War Collection, which as mentioned contains all the good things above without the need for backwards compatibility or anything else, but directly by inserting the Blu-Ray into the PlayStation 3 tray. We reiterate once again that, essentially, the games are identical to their original counterparts, with an initial menu that allows you to choose which title to launch and all the extras such as the making of both games, the cleared levels and the respective challenge modes. There is no doubt that the gameplay is a bit aged, yesespecially in the first chapter, and that the mechanics cannot have all that freshness breathed by those who have been lucky enough to play the two titles in due course. However, thanks to the progression of the game and its spectacularity, it was still pleasant to deal with the events of Kratos, it being understood that we expect several new features for the third chapter. All the best of God of War Collection are in any case addressed to the technical sector, which sees three big improvements: 1080p resolution, constant 60 frames per second and 2x antialiasing applied. The result is surprising in general, with an even better response to commands and a performance even on Full HD TVs that proves to be not at all regrettable, a sign that resolution is one of the main aspects for enjoying a video game on current televisions and excellent work done by Santa Monica Studios with the two God of War. In the first chapter many defects or rather shortcomings compared to the current generation of consoles obviously come to light, concentrated almost everywhere but above all in a polygonal key, in effects and in detail of the textures. Thanks to the excellent artistic sector, it is still possible to run into some glimpses that are very nice to see, supported by the aforementioned fluidity and resolution. Things get much more interesting with God of War 2, where the increase in detail, effects and variety, combined with an artistic sector that overflows with style and color, are factors that return an extremely pleasant, soft and clean impact which, we have no hesitation in saying, looks good in the face of a fair amount of titles available for the current generation of consoles. Paradoxically, the animated sequences suffer the most, which have not benefited from this upgrade, and which above all in the first chapter (in the second there are also some in high resolution) are clearly less beautiful to look at than the actual played part. Once upon a time there was the import, when the European titles always came out after months and months from the Japanese and American counterparts, when to run Virtua Racing for Genesis on the Italian Megadrive it was necessary to use a hot knife to widen the slot for the cartridge , when owning a Neo Geo meant having a mortgage like a house, when having all the Winning Elevens was synonymous with joy and pride. With PlayStation 3 and its region free games we are still experiencing a last glimmer of this glorious practice, see God of War Collection, Bayonetta and presumably Final Fantasy XIII and Gran Turismo 5; but now times have changed, producers have opened their eyes and everyone can enjoy adaptations that are almost always instantaneous if not simultaneously. Let me be clear, the current situation is clearly the most desirable for all gamers, but we always like to be a little romantic and nostalgic.", "date": "2009-11-27", "grade": "9.0"}