{"name": "Elementare", "ref": "https://multiplayer.it/recensioni/72276-sherlock-holmes-vs-jack-lo-squartatore-elementare-watson.html", "text": "Version tested: PCProbably in the Victorian era there were many who made jokes like: ~If Holmes were there, the case would be solved immediately~, referring to the brutal, never-solved murders perpetrated by Jack the Ripper against several prostitutes. In fact, the identity of the murderer still remains a mystery today and the hypotheses made over more than a century of investigations carried out at various levels have led to various results, very few of which are satisfactory. Anno domini 2009 D.C., the epic clash of brains between the investigator and the most famous serial killer in the world is staged on our monitors in an advanced and very accurate graphic adventure, completely translated into Italian and sold at a competitive price . The story begins with a bored Holmes with a lack of stimulating cases talking with his trusted friend and assistant, Doctor Watson. Reading the newspaper they learn of the investigation into Jack the Ripper and Holmes decides to go on the trail of the murderer. The first thing to do is to familiarize yourself with the simple game interface and with the possibility of playing in the third person, like in a classic Scumm adventure, or in first person. Then, having collected and opened the map of London, we will leave for the neighborhood where the first crime took place to speak with the local police. The streets are teeming with poor people and criminals. There are prostitutes and drunks on every corner and everything smells of mold and decay. The three-dimensional models are good and the environment has a lived-in feel. Fortunately the Italian dubbing does justice to the English one and doesn't spoil the atmosphere. Comparison The Xbox 360 version looks the same as the PC one, with the usual small graphical differences given by the different resolution that can be reached and the full price on the console, against the 19.90 of the PC version. Induction and deduction It will therefore be necessary to recover a briefcase containing the police report on the first murder. This is an easy task but one that shouldn't be deceiving, because things won't take long to get complicated. As we will soon verify, the documents available during the game are not frills, but fit perfectly into the gameplay. Reading them, Holmes and Watson (with the collaboration of the player) will have to draw deductions to continue the case. In addition to documents, the dynamic duo will also have to examine crime scenes for clues. When they have collected enough, a reconstruction sequence of the crime will start with the player busy putting the different elements together to draw conclusions. The fundamental phases are: the reconstruction of the dynamics of the crime implemented by making the protagonists play; the examination of the corpse; the measurement of the traces and the deduction of new facts through the concatenation of the elements collected in the previous phases. Unfortunately, the game is not without flaws and it is difficult not to notice how the logic puzzles scattered throughout the game break the narrative tension too markedly, especially when you are forced to face them at key moments. Furthermore, the level of challenge is not very high and the complex evidence deduction system has been made a little too friendly to make life easier for novices. Otherwise, it's an excellent product.", "date": "2009-11-27", "grade": "7.8"}