{"name": "Mass Effect: Legendary Edition", "ref": "https://multiplayer.it/recensioni/mass-effect-legendary-edition-recensione.html", "text": "When it debuted in 2007, Mass Effect was a futuristic and striking game, a space opera that influenced a generation of gamers and developers who, even today, look to the BioWare title as one of the highest peaks reached by science fiction video games. Waiting to find out more about the next unpublished chapter announced last winter, the Mass Effect: Legendary Edition could represent for many the ideal opportunity to recover the historic trilogy of Commander Shepard, re-proposed in a collection for PC and console modernized as much outside as under the hood. Established that we should not expect a revolution both from a technical and mechanical point of view, Mass Effect: Legendary Edition wants above all to be a tribute to everything it has represented for its loyal audience, a collection that leverages emotions and the rediscovery of feelings, characters, relationships and missions more than familiar. All trying to approach a new user base through an aesthetic renewal that passes from a higher resolution to redesigned textures, from more elaborate polygonal models to graphic effects capable of further embellishing the grandiose settings. Yet even for a longtime enthusiast, we assure you, taking command of the Normandy in this Legendary Edition undoubtedly has its charm. Finding old allies and antagonists, facing decisive dialogues with them, exploring unknown planets and increasing the team of characters has never been so smooth and immediate, net of some congenital defects of an original trilogy on which the passage of time, in some cases , it necessarily makes itself felt. But let's go in order, starting our review of Mass Effect: Legendary Edition right from the revival of the first chapter. Rediscover Mass Effect Commander Shepard in his iconic default appearance for the male version For those who have not had the pleasure of playing the original episode of the BioWare series so far, this is the case for a brief introduction to the events that kick off the intricate narrative plot of Mass Effect. During a patrol, a ship of the galactic fleet called the Normandy detects a distress signal in which a strange probe of alien origin is mentioned. Nothing that is out of the ordinary, except that this probe would appear to belong to the Protheans, a race believed to be extinct thousands of years earlier, custodians of highly advanced technological knowledge. From here a plot unfolds which primarily involves the new commander of the Normandy, Shepard, with all his crew, to try to get to the bottom of the military and commercial intrigues behind the alien discovery. This stellar odyssey will lead Shepard and his team to explore numerous space stations and more or less inhospitable planets, collect missions and obtain favours, forge various relationships, sometimes love ones, and decide what and how much to sacrifice for the greater good. The new lighting system has completely rejuvenated many settings Along the way we will find ourselves having to deal with our conscience several times and make decisions that will drastically change not only the relationships between the characters, but also the gaming experience and the destiny of all humanity. In the branching of the plot and in the dialogue system, Mass Effect is still surprisingly modern, and this is because the emotions and transport that the saga manages to convey have rarely been achieved in other recent productions. The flagship of the production is still today the possibility of making personal choices during the dialogues, thus being able to change the relationship dynamics with the characters and receive Hero or Renegade points that influence Shepard's reputation and unlock new dialogue possibilities. As if that weren't enough, all this carousel of choices can also lead to the establishment of emotional relationships with any character belonging to the Normandy crew. In this action RPG with a sci-fi setting, team management has also remained unchanged when it comes to action: in the various interplanetary missions we will be able to take control of a team of three characters, but while we will directly command Shepard we will be able to impart to the rest of the group a series of orders ranging from using a particular skill to switching weapons to a more effective one. The skill tree includes the traditional selection of offensive, defensive and support techniques, from healing allies to being able to shoot without overheating weapons or having to reload. But then what has changed? Technical improvements The improvements also go to the guide system, with theMako decidedly less woody If very little has changed in the structure of the game, the rejuvenation work for Mass Effect: Legendary Edition has been dedicated more particularly to the technical presentation, the interface and the feeling pad in hand. 4K resolution and higher framerate are two of the advances made by this re-release, but their implementation varies according to the platform. We have two graphics modes available: one that favors graphic quality, which reaches 60 fps in 4K on PlayStation 5 and Xbox Series X, and another that focuses on framerate (60 fps at 1440p on PS5, whereas on Series X you get to 120 fps, always at 1440p). With a fairly performing PC, 240 fps is reached, while obviously compromises are made with old-generation consoles. For this Legendary Edition, BioWare allows you to access the desired episode from a single launcher, while maintaining separate save slots for each of the three titles. In this regard, the possibility returns to face all three games with the same character, importing the save in Mass Effect 2 and then in Mass Effect 3 once the previous episode is finished: in doing so, some decisions made by Shepard in a game will have more or less evident repercussions on the story and dialogues of the two sequels. Just to further underline the continuity between the three episodes, now the iconic female Shepard of the third chapter is set as the default female character for the other games as well. Framerate and resolution: performance varies significantly from one platform to another Everything from the models to the animations, passing through the kinematics, has been revised and corrected, with some sequences even recreated from scratch to emphasize or better present important moments. Much has already been said about how the exhausting uploads, one of the weak points of the saga, are now much faster, with the unpopular elevator dialogues which, while previously they were an inelegant ploy to hide the loading of new scenes, today not only they last significantly less but can be skipped entirely. If graphically there is still a clear break from Mass Effect 3, certainly the work done by BioWare to rejuvenate the first chapter deserves applause, although there are a couple of weak points. On the one hand, the lighting in closed spaces, with some particular moments (Feros above all) during which the poor light compensation made the path to follow very difficult to read; on the other hand there are the facial animations, the progenitor's Achilles heel and which have undoubtedly aged badly, with extremely expressionless characters even in the most exciting and excited moments. The combat system has been modernized both in firefights and in melee The photographic mode is completely new, an addition that will surely be appreciated by many and gives the possibility to capture some of the most memorable moments of the BioWare epic, although its implementation and the amount of options available cannot be compared with other Photo Modes seen in the most recent productions. For example, it is not possible to call up the photo mode via a button, necessarily forcing to switch from the pause menu, while in interior spaces it is difficult to manage the camera. In the Legendary Edition package, then, we will find all the DLC originally released for each of the games: some will only be unlockable once you reach a certain point in the campaign, while others (such as special armor or unique weapons) will be available immediately. Unfortunately, the Mass Effect re-release doesn't do much to improve another of the original's weaknesses, namely the game map. Also in this case the map cannot be recalled with a specific key on the controller, but only from the pause menu, and in the absence of a real minimap it will often happen that we find ourselves following markers beyond walls that we will not know how to cross or get around . From the sound point of view, an excellent job has been done of re-adapting the audio tracks, enhancing even more the moments of the story imprinted in the memories of many, also thanks to one of the most epic and memorable soundtracks in the science fiction genre. A refined gameplay The first Mass Effect is the episode that has benefited the most from the revamping work, but the two sequels also defend themselves On balance, the first Mass Effect was in fact the one of the three that received the greatest benefits from this re-release. Putting aside the purely aesthetic aspect, it is the feeling in the controls that has seen the most welcome improvements. One of the most awaited adjustmentsi and evident concerns the Mako, the vehicle we will use to explore the different planets and move on their surface. Where in the original game it was afflicted by cumbersome controls and, in general, bad driveability, here we are faced with a completely renewed rover, more firmly on the ground and easier to control. The ~new~ Mako no longer explodes when touching lava, no longer has that annoying drift when cornering and has been equipped with a boost whose recharge remains independent of the jump. Let's be clear, the intention is to make the Mako less frustrating to drive, not completely revolutionize it: over the years, its grouchy movement has almost become a meme among enthusiasts, and completely distorting it would probably have destroyed a myth. Mass Effect 3's multiplayer wasn't included in the package, but few will likely really miss it The Legendary Edition refreshes Mass Effect also with regard to the combat system, an aspect in which the title has seen various corrections and refinements. The aiming and reloading model is significantly improved, and although we are certainly not at the level of the most modern third-person shooters, the firefights are much more fun and less wooden. The cover system was then made more immediate and effective, allowing you to position yourself behind the protections in a more natural way, while in melee it is now possible to perform a melee attack simply with a button (in the original Shepard did it automatically if a enemy was within reach). The clashes have inherited some disconnected animations from the original game, but overall we are facing a decisive step forward. Mass Effects 2 and 3 The character created in Mass Effect can be carried over to subsequent episodes, keeping their appearance and decisions made The second and third chapters of the trilogy are the ones that have objectively received the least tweaks, since they start from an already more modern base and in which BioWare's efforts to improve the original formula were already evident. As already mentioned, the jump from Mass Effect to its two sequels remains evident despite the fact that the first episode has been significantly updated from an aesthetic point of view. After all, Mass Effect 2 and Mass Effect 3 have also received a similar facelift work, including high-resolution textures, modernized models and an evident work of embellishment of the environments and graphic effects. Above all, the new lighting system stands out in particular, capable of completely transforming environments and kinematics. Without overdoing it, the Photo Mode provides a series of filters, the ability to change parameters such as depth of field, blur and contrast, but also to hide NPCs, enemies and party members from the scene Except for a few minimal differences, from a technical and gameplay point of view the two episodes are absolutely comparable, and if starting Mass Effect 2 as soon as the original adventure is over can be an initially destabilizing experience, the transition from the second to the third chapter is rather immediate. Many, many, are the changes and adjustments to the ~quality of life~, with balances to the functioning of weapons and ammunition, a further refinement in the controls, and also in this case all the contents have been re-proposed, including DLC, with the exception made for the multiplayer mode of Mass Effect 3. Lastly, a small and welcome extra added to the package is the Dark Horse Comics interactive comic that can be browsed before Mass Effect 2 and 3, and which will allow us to have a brief summary of the events that occurred in the previous chapters without necessarily having to complete all the trilogy. What makes these digital comics curious is the possibility of making the most important choices of the story while reading the comic itself, finding ourselves following the consequences of Captain Shepard's deeds while still feeling the weight of the decisions in a way that winks at that of the game.", "date": "2021-05-16", "grade": "8.5"}