{"name": "I conigli", "ref": "https://multiplayer.it/recensioni/72403-rabbids-go-home-i-conigli-la-luna-e-i-wc.html", "text": "Of course we are kidding. On the other hand we're talking about the Rabbids, probably the most insane creatures ever born of the human mind, and how could we seriously address a discourse on addictions starting from these stupid alien rabbits? Alien rabbits who have now openly outclassed poor Rayman, assuming the role of absolute protagonist that previously belonged to the man without joints, evidently too serious and intelligent to win over the hearts of gamers... The Rabbit on the Moon The premise of Rabbids Go Home is, if possible, the most absurd of all the games dedicated to alien bunnies produced so far: now permanently stranded on the Earth that they had tried to invade years ago, the Rabbids find nothing better to do than to try entertainment by electric discharges caused by street lamps. Completely re... dazed by the thing, hence the mention of the dependencies above, one beautiful night with a full moon they are convinced that our satellite is nothing more than a giant lamppost, capable of giving enormous shocks to all of them at the same time, and set out to achieve it. Thus intervenes the engineer Rabbid, an even higher brain than his colleagues, who rightly proposes to build a tower of rubbish high enough to reach the Moon. What does the toilets have to do with it at this point, the final goal of each level, frankly we still can't explain it, but that's it... The fact is that in each level of which the game is made up your task is, in the role of a Rabbid who is in a mine cart on a building under construction, collect as much trash as possible and take it to the bowl at the end of the path. All true, we are not inventing random things. Here, perhaps the problem of drug addiction belongs to Ubisoft designers more than to the poor bunnies... Take the bull by the nib. However, if you expect the usual collection of mini-games as in the past, you are wrong: Rabbids Go Home is a full-blown puzzle game, interspersed here and there with some mini-game clips, which incorporates elements from great classics of the past such as Lemmings and The Incredible Machine : basically, but it's much easier to play than to explain, the Rabbid on the trolley in each level has to collect as many pieces of rubbish as possible and reach the final toilet, only that the path is not complete and completing it is up to you, by arranging the objects you have available in the game area. The first levels are quite basic: you immediately notice that a couple of beams arranged appropriately allow the trolley not to fall into the void and to arrive safely at the cup. Soon, however, things begin to get intriguing, with the obvious greater abstruseness of each level compared to the previous one, and with the less obvious introduction, at each new series of levels, of a certain object with particular properties, not always intuitive at first glance. impact but clearly explained by various demos. A spring-loaded glove, for example, has the effect of pushing the Rabbid in a certain direction, a fan propeller will create a current of air to be positioned in the right way, a pair of shears will cut, if touched by the Rabbid or some other object, a rope that perhaps held up a bowling ball which, when falling, will activate some other contraption, and a bull (that's right, a bull!) will kick backwards anything that comes within its range... A bull, Exactly. What's weird? The nice thing is that it goes on like this for a good one hundred and twenty levels of single player Story Mode alone, with increasingly complicated and absurd situations, objects that are more and more insane and cryptic each time, in a real challenge to the player's rationality, which he will find himself having to fight both with the actual solution of the level and with the absurdities bordering on psychedelia that increase from stage to stage. Connective madness. If one hundred and twenty levels characterized on the one hand by purely absurd situations and on the other by the need to think hard and well (but not quickly, the story mode thank goodness does not set time limits) seem like a lot to you, it's because you haven't done it yet accounts with two other features of Rabbids Go Home. The first is the presence of four Challenges, to be unlocked by playing, which follow the same basic mechanisms of the main game but with new rules, including precisely the time count, each characterized by twenty levels, for a total therefore two hundred levels that the game makes available to you from the start. The second, even more total, is the presence of the level editor, which can then be exchanged around the world thanks to the Wi-Fi Connection for a longevity that theoretically, at this pointor, tends to infinity. Faced with such good things, the technical aspect passes not into the background but also into the third plane: we find ourselves in front of a 2D, with some rare three-dimensional elements, very accurate but always functional to the game which must offer clarity and breadth of vision, and to silly and negligible tunes. Excellent as usual however, always for those who love the most total craziness, style and characterization of the Rabbids, who manage, with each new FMV film, with each new animation frame, with each new sound sampling, to always and in any case be totally morons, stupid and demented. Ultimately, absolute idols. Lastly, the icing on the cake is the nice possibility for DSi owners to personalize the Rabbids using the images taken with the camera.", "date": "2009-11-24", "grade": "8.0"}