{"name": "A caccia di mostri", "ref": "https://multiplayer.it/recensioni/72416-dungeon-hunter-a-caccia-di-mostri.html", "text": "Gameloft strikes again, one might say. Strengthened by the great experience made on the Java platform, the French company has approached the development of the iPhone and iPod Touch with already clear ideas, churning out only excellent products. Dungeon Hunter is no exception, and immediately stands as the best exponent of the action RPG genre available on the App Store. After selecting our character's class from the three available (warrior, thief or wizard), we see him awaken in the catacombs of the Gothicus kingdom, whose territories have long been hostage to an army of mercenaries and demonic creatures. The fairy who called him back from the dead describes the situation to him, giving him a chance to put things right. But what will happen when the prince comes face to face with his former bride who now takes on the role of queen of darkness? We will find out once we have passed the numerous stages that make up the game, divided between gloomy dungeons and sunny outdoor locations, with the progression marked by the presence of five different fairies who accompany us in the adventure and who place their elemental powers. Sword or mallet? As in any RPG, the choice of the character's class affects its characteristics as well as the possibility of using one weapon or equipment rather than another. If we opt for the fighter class, the prince's skills will focus on strength and close combat, with the ability to use most weapons and armor. If we choose to be a thief, we will enjoy an excellent value relating to dexterity, i.e. the ability to land shots as well as avoid enemy attacks, but otherwise our skills will be average. Finally, the mage class will allow us to often use ranged attacks but we will pay the price of being rather weak in melee. Eliminating our opponents results in the classic ~level-up~ and gives us points to enhance our characteristics. Furthermore, within the stages, there are numerous chests and chests to be opened to collect money and weapons, both of which can then be used at a ~trusted shop~ both from the point of view of purchasing equipment and selling it. The screens relating to equipment and characteristics are numerous, and can be a little confusing at first, but then the adjustment happens quite quickly and there is even an option for automatic adjustment of weapons and upgrades. The interesting thing is that the character's appearance changes according to our equipment, the weapons we wield and the armor we wear, thus giving us immediate feedback on what we are using. Move and strike Dungeon Hunter offers us two possibilities as regards the controls, in this case a virtual d-pad and a ~pointing~ system. The first works much better than the second, even if it is not as precise as one might expect from such a technically accurate product: the direction taken by the character often appears artificial and the response to inputs is not immediate. When we meet enemies, we can act on the icons relating to the attack and the spells to hit them, but the conduct of the battles proves to be rather simplistic right from the start, forcing us to often use healing potions in the absence of an effective system of parry or dodge. The enhancement of the character also translates into the acquisition of new offensive maneuvers and powers that work ~passively~, that is, which improve our characteristics without having to recall them. The selection of these special attacks does not work very well, but without a doubt the range of maneuvers is very rich and allows for a moment to escape from the linearity of the clashes. The graphics of the game are excellent, with really well done locations, a good level of detail and always smooth scrolling. The polygonal models of the characters are a bit simple and angular, but it must be borne in mind that their appearance changes according to the equipment and that they have good animations. The sound keeps up without any particular problems, moreover giving us the possibility of listening to a personalized playlist as we wander through the dungeons in search of treasures and opponents to fight. The tested version is 1.4 App Store links", "date": "2009-11-25", "grade": "8.5"}