{"name": "Allarme rosso", "ref": "https://multiplayer.it/recensioni/72408-command-conquer-red-alert-allarme-rosso.html", "text": "Red Alert is a name capable of warming the hearts of many fans of the Rts genre, and consequently the idea of being able to play an episode packaged especially for the iPhone was welcomed with great enthusiasm. Also because, on paper, the type of gameplay is one of those potentially easier to transport on Apple hardware, thanks to a certain affinity between the touch screen and the mouse. But as is obvious, a valid control system must be supported by satisfactory content. Is this the case with Red Alert? Power has a price There are some things about Electronic Arts production that are difficult to digest, starting with the price: 7.99 euros are by no means a few within the economic system that has now established itself on the App Store, in which it is not difficult to find productions of great quality spending at most a handful of euros. Secondly, the absence of any multiplayer mode at the moment, despite a promised free update capable of filling that gap, is still something to consider. This is even more so in view of the fact that the single-player campaign is far from long-lived; there are only 5 missions for each of the two sides present (allies and Soviets as per tradition), to which must be added the 2 of the skirmish mode. That's right, only two maps; to still have 6 it is necessary to spend another 0.79 euros through the in-app shop, currently desolatingly half-empty but destined to get rich at least with the already announced third campaign, complete with a new faction to control. In the face of the aspects just described, it is difficult to assign a largely positive evaluation to Red Alert, and this despite the fact that there is no lack of happy notes starting with the technical component, decidedly valid above all for the amount of details and in the number of units and structures. Perhaps due to the limitations of the hardware, however, the missions struggle to match the breadth and epic flavor of those of the other chapters of the series; on the contrary, the development is often very linear and guided, and the level design fails to excite even with regard to the variety of proposed objectives. On the other hand, the control system is convincing, well organized around the qualities of the touch screen; particularly intelligent is the ability to create up to 3 groupings of units that can be recalled at any time by simply touching one of the icons on the left. It's just a pity that the artificial intelligence of your troops is not very developed, since it often happens that they get stuck against the elements of the setting, requiring further action from the player. Annoying the soundtrack, made up of invasive guitars to which silence will soon be preferred. The tested version is 1.0.0 App Store links", "date": "2009-11-23", "grade": "7.0"}