{"name": "I ninja combattono ancora su PS2", "ref": "https://multiplayer.it/recensioni/72377-naruto-shippuden-ultimate-ninja-5-i-ninja-combattono-ancora-su-ps2.html", "text": "There are those who still see the huge installed base of PlayStation 2 as a potential source of income, and the reasoning makes no sense. The Naruto: Ultimate Ninja series, for example, is coming out these days with a new chapter (the fifth, to be precise) just six months after the previous one, which in truth did not excite due to some at least questionable solutions. We all know that Ultimate Ninja was born as an innovative and fun fighting game, which bases its gameplay on scenarios with two floors of depth, on the management of objects during battles and on the massive use of spectacular combos and special moves. This until the third episode, still the best available for PS2. In Ultimate Ninja 4: Naruto Shippuden, the CyberConnect 2 guys tried to change the starting formula in a rather traumatic way, eliminating the classic ~story mode~ present in any match fighting game and replacing it with a mode based on exploration and interaction with other characters, where fights acted as a resolver event. It was therefore necessary to control Naruto and/or one of his friends, move within a more or less vast scenario and achieve the objectives indicated on the map to continue the story. An idea perhaps also valid with a view to rejuvenating a structure that had been repeating itself for a while, but which was implemented in a mediocre way: the exploration sessions were too long and monotonous, and the locations were absolutely not up to par of the situation due to their disarming simplicity. In other words, even a Naruto fan, perhaps enthusiastic about the presence of the events and characters of the Shippuden series, ended up losing all enthusiasm even before reaching the combat phases. Losing team does not change? Let's say right away that for Naruto Shippuden: Ultimate Ninja 5 the situation has remained fundamentally unchanged: we have a ~main mode~ which incorporates that of the fourth episode and which constitutes the fulcrum of the Namco Bandai product, accompanied by the ~free battle~ (a single encounter between two characters) and the now classic ~shop~ and ~collection~, respectively useful for buying and viewing the available extras. Also this time there is no ~story mode~ based exclusively on fights, a mode that could have really had its say given the numbers of the game: sixty-two total characters and twenty-four locations. In short, a nice disappointment, only partially compensated by a marked improvement in the ~main mode~, which now appears much more ~practical~ and allows us to decide our degree of involvement in the numerous secondary missions, in which we can participate simply by interacting with the strolling inhabitants. In short, we are given the opportunity to linger and spend some time wandering around the stages, or run quickly towards the objective indicated on the map and proceed with the plot. Naruto and his friends can move quickly (by holding down one of the back buttons) and double jump if necessary, as well as interact with certain objects (mostly chests) to collect their contents. The new stage design certainly catches the eye, the result of an optimization work that has brought the good old Leaf Village and its most representative neighborhoods to look their best on PlayStation 2. The polygonal count is high, the cel shading appears well used and the frame rate is always smooth and stable. The use of bright colors helps to liven up the settings, which pay for the richness of detail with the need to load the neighborhoods one at a time. However, waiting times are very short and are willingly accepted, given the goodness of the graphics. Knead the chakra and add some sugar As mentioned, the exploration of the stages leads to decisive fights that sometimes play the role of imaginative fillers with respect to the original plot of the Shippuden series, but which in any case constitute a turning point and allow us to advance in the game. At that juncture, we find the good old Naruto: Ultimate Ninja with his combos, stages on two floors of depth and special moves that start spectacular and also quite long animated sequences. The modalities of the meetings are variable: generally a couple of conditions must be met to win, but often these are elements that are active from the beginning (for example when we have to face an enhanced opponent) and independent of our conduct during the fight . Each of the sixty-two characters available can perform five different attack combos, based onon the repeated pressing of a single button of the Dual Shock as well as on one of the directions of the d-pad. By pressing the Triangle button you can activate the chakra to perform a special move (which uses the keystroke system to get right), while the management of objects (shurikens, throwing knives and so on) has remained unchanged compared to previous episodes . In short, beyond the numbers and the new stages, the structure of the encounters has not changed (if we exclude the presence of a second character as a ~support~ for certain moves) and the gameplay of these sections is once again based on the readiness of reflections rather than pure and simple technique. It is a pity that an interesting element such as the possibility of changing the depth plane has not been exploited better over time, ending up actually playing a marginal role. As far as the technical realization is concerned, Naruto Shippuden: Ultimate Ninja 5 also turns out to be well done in its fighting game aspects, with excellent polygonal models and the introduction of locations that do not disfigure compared to the many already seen. The sound commentary leaves something to be desired, not so much for the voices (in Japanese) as for the music, discreet but really repetitive.", "date": "2009-11-25", "grade": "7.0"}