{"name": "Comanche", "ref": "https://multiplayer.it/recensioni/comanche-recensione.html", "text": "Helicopter simulators are not really a very popular genre, especially lately. Comanche tries somehow, after a rather long period of gestation in Early Access, to renew the genre without however taking into account some characteristics that a game must necessarily have. The first of these is, of course, fun. Unfortunately the cumbersome controls, the physics applied to the models that are not exactly infallible and the practically absent auto lock of the weapons make this first, fundamental point almost nullified. Unfortunately, even approaching this production with all good intentions and with the eyes of someone who, as a child, played many titles with helicopters as protagonists, such as G-Police, Apache and Desert Strike, we really failed to understand its value videogame. This is not meant to be an attack on the developers nor a total rejection of the project, but in the two (two!) hours of the campaign, if you can call it that, boredom and repetitiveness reigned supreme. Let's go in order and see the (few) good things and the (too many) things that are wrong in our review of Comanche. Story and gameplay a glimpse of Comanche First, the sore points: the remake of Comanche is not the long-awaited rebirth of this series. Which is probably something to be expected, given that the game changed development teams midway through the project. In addition to the alternation of developers, Comanche has gone from being an exclusively multiplayer title to one with a campaign consisting of twenty-four mini-parts plus eleven independent missions. But, as we said before, know that it's too repetitive and lacks the kind of polish found in other air combat games. In addition to being very short. The fundamental part to begin to understand something of the complex piloting system is an extended tutorial. While not a simulation, learning how to control the RAH-66 attack helicopter will probably take you a good twenty minutes. Most of the fundamentals of flying should be instinctive for flying game veterans: Triggers are used to adjust elevation as the nose pitch of the Comanche propels the aircraft forward. The camera rotates with the helicopter, but it takes a couple of seconds before a 180 degree turn can be achieved. There is also the possibility of activating the simulation mode, but we weren't even able to take the first corner. Unmanageable. Even with assisted mode don't always expect to control everything like an expert pilot. When Comanche sends you into the bowels of top-secret bunkers dug into the mountains, you'll have a hard time keeping the walls and ceilings from touching, with camera handling that makes safe driving nearly impossible. But the game has some interesting features such as flying through the narrow canyon filled with dense misty pockets, which is quite an atmospheric moment. Comanches A Comanche sequence As the game's title suggests, it's no surprise that the RAH-66 is the star of the show and the only warbird you can fly. But Comanche gives you the ability to command five different models, from a preliminary prototype, the armored Rhino and the stealthy Ghost. Each helicopter has its own unique ability, from Eve's missile repair nano-bot to Rhino's ability to charge at opponents. Comanche tries to make sense of its futuristic setting with lines of dialogue as realistic as possible, but all this is very far from the verisimilitude of one of the Tom Clancy titles. Expect to hear maddeningly sad jokes (at least if you speak English) like being called Casper when piloting the Ghost Comanche or Frogman when coordinating with an aquatic demolition expert. enemy helicopters and indulge in explosions and destruction. But the Comanche fights feel a bit too automated. Most of the time you will probably engage air and ground targets without too much fear with the multi-barreled Gatling given its unlimited ammo. With the prototype lock system, you don't have to worry about aiming, just not overheating the machine gun and taking countermeasures as you move mostly in place. From a technical point of view we are on a discrete level as regards the setting and the model of our aircraft, but unfortunately there are textures that are not exactly worthy of a video game of a certain importance and the explosions, the lighting as well as the particles do not make a miracle cry. Dronesand fighting techniques our amazing drone in action The missiles are homing, so as soon as you're high enough and with a target locked, you can launch them to decimate multiple targets at the same time. The problem is that they are really scarce. Rockets are downright dumb and aligning them along their trajectory requires a light touch, often leaving you prone to enemy attack. borrowing it from the tradition of spy films. You will thus realize that a broken fan is always an indicator of the path to follow: each base seems to have a malfunctioning ventilation system, so they are all the same. Occasionally, you'll be tasked with taking down enemy drones and soldiers, but that's not all that great activity since these aren't exactly advanced artificial intelligence. The positive thing is that in all this mess the most fun thing is to pilot these little ones, which among other things give back a much more defined driving feeling and specific weight than their older brothers. Did someone say multiplayer? The landscapes of Comanche The flagship of the production should have been the multiplayer sector, but, we tell you right away, it is anything but fun. Unfortunately, on paper it wants to show one thing, but in practice it just can't ~take off~ said with a rather apt term. There are two game modes, infiltration and black box. In the first you will have to place EMP charges and defend them until they detonate, in the second you will have to be able to keep enemies away while defending a bomb. Everything works worse than in the single player, almost never being able to find enemies and once engaged, practically impossible to take down. Frustrating to say the least. The worst thing, however, is that matchmaking struggles a lot to find connected people, perhaps due to the fact that the game hasn't been out for a long time, or perhaps for other reasons unknown to us. The fact is that what was supposed to be the strong point has become yet another Achilles heel of the production. Yes, it is true, you can customize your aircraft and show it off during the games, but what do I do with a super helicopter if you can't play?", "date": "2021-10-24", "grade": "4.5"}