{"name": "AI: The Somnium Files", "ref": "https://multiplayer.it/recensioni/ai-the-somnium-files-recensione.html", "text": "At the Tokyo Game Show 2021, Microsoft demonstrated its willingness to start focusing on Xbox Game Pass in Japan as well and did so by adding a couple of very interesting games to its catalogue. We took the opportunity to write this review of AI: The Somnium Files, with some delay considering that the title has been out for a couple of years on Nintendo Switch and PS4. Let's try to remedy this lack now because Kotaro Uchikoshi's game really deserves to be taken into consideration and placed in the spotlight. We take this excellent opportunity to advise practically all Xbox Game Pass users to proceed with the download and also to many others to consider the possible purchase, because it is a strange and interesting work, which somehow remains in mind thanks to his truly strong character, as often happens with the productions of the director in question. We recall that Uchikoshi is also the author of the Zero Escape series, now considered a cult among the thriller adventures based on puzzles and storytelling of Japanese matrix and that We can easily find the imprint even within this game. However, there are also some variations that make AI: The Somnium Files a separate experience, which develops the author's typical style in a different way: there is greater attention to narrative construction, with the story advancing predominantly for a large part of the game almost like a visual novel, but which is also stratified and available at different levels of reading. On the contrary, the puzzles are probably more abstract and less logical than in previous titles, the result of a more bizarre puzzle design, but still built on a different and very peculiar conception of adventure, in which even the possibility of making choices different and retracing fragments of history to see the different folds of this becomes an integral part of the gameplay. A strange story of serial killers, eyes and AI Kaname Date, the protagonist of AI: The Somnium Files in action with the Evolver weapon Kaname Date is the protagonist of this story and is a decidedly strange guy, which makes him perfectly at ease within the bizarre situation in which he finds himself. It is a detective who is part of a highly technological and secret section of the Tokyo Metropolitan Police of the future, called ABIS. Date is able to use a complex system called PSYNC to delve into the minds of suspects and find hidden evidence. It also has the characteristic of having a replacement eye in which an artificial intelligence called Aiba has been installed, which acts as a real partner for the investigation, able to provide information on any aspect of the case by directly connecting to different data networks and also projecting images and recordings directly into Date's field of view, as well as the ability to use X-ray, infrared, zoom and night vision. Aiba is represented as an eyeball inside a sort of teddy bear initially, only to then take on the form of a human girl in the phases in which PSYNC is used or when she intends to be more noticed by the protagonist. Just the eyes seem to have something to do with the complex serial killer case that the protagonist has to investigate, given that it is a double homicide in which the victims both had an eye removed, just like Date in a mysterious accident that happened six years earlier and which also led him to lose a good part of his memory. Mizuki at the crime scene in a moment from AI: The Somnium Files An obscure element of the past that has clearly marked the protagonist and on which his handsome boss, head of the police district in which he works and who relies heavily on the protagonist's abilities, seems to know something, but without wanting to reveal anything at all. It is not the only point of connection between the protagonist and the case, given that the victims are also his close acquaintances as well as parents of the girl who has been entrusted to him, so it is clear that this cannot be any case, but something very most important for Date, involved beyond all limits in this mystery.Obviously we cannot reveal more, but we limit ourselves to pointing out how the story proves to be immediately interesting, but only reaches a good pace after the first few hours of play, when the twists and elements of mystery, but also the possibility of glimpsing some plot among the pieces that they are trying to recompose. Storytelling and puzzles A-Set is an idol who will play an important role in the story of AI: The Somnium Files Much of the game takes place in mannervery guided, like a sort of interactive visual novel based on investigations in a decidedly thriller case. We follow Date's moves moving from one setting to another, exploring the settings by moving our gaze and highlighting characters and objects of interest, with the dialogues acting as the backbone of the narrative, with some minimal choice left to the player on the topics to be explored, but essentially with the need to exhaust them all before being able to move on to the next phases. Occasionally we find ourselves in more excited situations, with the possibility of taking part in more dynamic actions that can lead to different results based on how we react, but in the investigation phases in the real world the story unfolds in a rather linear way, with a however well paced and a really excellent writing, which alternates different registers going from yellow to ~hard boiled~ action up to almost horror, but without ever giving up the ironic streaks that often emerge from the comments of the protagonist and above all in the exchanges between this and Aiba or Mizuki, the very intelligent girl who lives with him. Where the game takes on more puzzle-adventure characteristics is instead in the parts relating to the use of PSYNC, the equipment that allows Date to enter the minds of other characters to discover secrets and collect evidence and clues within the ~Somnium~, real dreams. AI: The Somnium Files, a moment of the investigation In these situations we also have the possibility to actually change the course of the story, because depending on the decisions we make and what we discover it is possible to open up new narrative paths through various ramifications in the plot that can lead to different endings. In this regard, we must point out the presence of a particular function in AI: The Somnium Files, which may seem secondary but is instead of great importance for fully exploring all aspects of the game. From the options menu it is possible to enter the ~Flowchart~, which allows you to review the entire flow of scenes that make up the story of the game, with the reporting of the crossroads we have faced, perhaps without realizing it at first. From here it is possible to review the scenes and face them again, perhaps making different choices from the initial ones and possibly opening new paths in the story, which will be essential to achieve a complete understanding of the story with a solution similar to that also seen in World's End Club by the same author. The mental gameplay of PSYNC Aiba in action, in human form, inside a Somnium The phases in which the PSYNC system is used are those closest to the classic Zero Escape-style puzzle, even if they are often so abstract that they are not very logical and understandable. In these situations, Date mentally connects to the suspects through a machine that allows Aiba to enter the dreams of the various subjects - or ~Somnium~, as they are called in the game - with the need to unlock a certain number of mental blocks in order to discover them. secrets and obtain essential information for the continuation of the investigation. In this case we directly control Aiba in a condition more similar to the classic third-person adventure, with freedom to move within the environments unlike the fixed positions we assume in the standard stages of the game. Since these are dreams, the settings are strange, surreal and abstract and so even the puzzles do not necessarily respond to an iron logic, therefore the consequences are often all to be discovered. The problem is that we only have 6 minutes to solve the puzzles and open all the mental blocks present, because that is the time limit in which we can act in the minds of others without being trapped by them, which gives considerable weight to the choices to be made. Each action that we choose to make consumes a certain amount of seconds, in addition to those that pass simply by moving within the environment: when we interact with an object, we are faced with several pre-set choices, each of which consumes a different amount of time and leads to different results. The possible choices in a moment of interaction in the Somnium of the game It therefore becomes essential to manage every second in the best possible way, perhaps by resorting to ~Timie~, which are bonuses capable of slightly increasing the amount of time available, but whose use must be strategically dosed. Considering that the choices we make within the PSYNC lead to the main ramifications we encounter in the story, it also becomes important to retrace these phases to see the different repercussions of the solutionsions of the puzzles in the continuation of the story, which is particularly useful also because, as mentioned above, these solutions and consequences are not always foreseeable according to logical principles, given their strangeness. An interactive anime The characters in AI: The Somnium Files turn out to be quite expressive From a technical point of view, AI: The Somnium Files is rather ordinary as regards the representation of the settings, with some creative flashes regarding the sections within the Somnium in the PSYNC phases, but otherwise we are not exactly of facing something surprising on the graphics front. However, where the game particularly shines is in the representation of the characters: a sort of particularly advanced cel-shading is used, capable of perfectly restoring the anime-style effect, as we have already seen in various recent Japanese titles. However, what stands out particularly is the rendering of the facial expressions of the characters, which within the limits of a graphic style that tends to cartoon anyway manage to convey a considerable range of emotions in a rather convincing way. The strength of AI: The Somnium Files, from an aesthetic point of view, is probably this excellent collaboration between the character design of Yusuke Kozaki (No More Heroes, Fire Emblem Awakening and Fates, Xenoblade Chronicles 2) and the excellent work carried out by graphic designers and animators on the characters.", "date": "2021-10-23", "grade": "8.3"}