{"name": "Sussurro eterno", "ref": "https://multiplayer.it/recensioni/72078-hybrid-eternal-whisper-sussurro-eterno.html", "text": "Gamevil now does not need big presentations: the Korean development house also based in the United States has managed to carve out a large share of users by bringing Zenonia to the iPhone, considered by many, including us, as the best role-playing game currently available on the Apple laptop. In short, developers capable of miniaturising experiences often reserved for more complex platforms, who for this new release of theirs have aimed at something different, an action with role-playing elements perhaps distant from the completeness of their previous work but once again perfectly at ease on the touch screen and well calibrated for the type of use it will meet. As Grey Narratively Hybrid: Eternal Whisper is the most already seen there can be, with the young hero Gray committed to repel the Dark Spirits, a dark threat capable of putting the world on the brink of end, at least until the coming of the mysterious Guardian, a entity that will be able to resolve the situation in favor of ours. The implications are those usual for the genre and no one will feel particularly involved in the plot, but the premise is only a slim excuse to throw the player into the seventy schemes proposed and structured as if it were a scrolling fighting game, with Gray called to sweep away the enemies in real time by exploiting both the white weapons at his disposal and the spells he will learn during the adventure. Moving within the levels turns out to be quite simple thanks to good use of the virtual Dpad, with a key for the slash and the skills that can be recalled by drawing the appropriate signs on the touch screen, all to follow a frenetic action at the right point, only partially slowed down by the dynamics of progression through the acquisition of experience and undermined exclusively by a somewhat unbalanced level of difficulty, capable of sudden surges in a not particularly difficult context. The quantity of enemies on the screen is never overwhelming but their variety, combined with the good number of strategies that can be carried out with the albeit not gigantic set of possible actions, makes Hybrid a constant flow of small gratifications, without extraordinary acute notes but with a good sense of measure in dosing the contents it has to offer. Longevity is guaranteed and well divided into sessions designed for those who need to use it during daily travel, and for 3.99 euros what is proposed is enough, leaving the roles of nice additions to the online rankings and the mode focused on an endless battle . Visually we are once again close to the Super Nintendo and the Mega Drive in terms of impact and colours, even if the style is not very original and the choice of making the characters move in 3D environments with different levels of parallax in the background could very well be replaced by a use of the two-dimensional technique extended to every juncture of what is shown on the screen. The sound isn't unforgettable - which is always paradoxical on a console that's primarily an mp3 player - but it doesn't bother either. Tested version 1.1 App Store links", "date": "2009-11-11", "grade": "8.0"}