{"name": "Pictionary", "ref": "https://multiplayer.it/recensioni/pictionary.html", "text": "Pictiona you that I pictiona too As described in the introduction, Pictionary as a board game is based on a very simple premise: in turn, each participant has to draw on a piece of paper the representation of the word randomly drawn from a deck of cards, all while the others observe and try to guess as soon as possible. Not being able to reproduce an identical structure on mobile phones, the developers of EA Mobile have well thought of proposing three variations on the theme directly available from the main menu. We start with the Single Player mode, in which you have to guess the object drawn progressively on the screen by the CPU: you have five attempts (after which the game over is triggered), but you need to type your guess quickly if you want longing for the highest score, as the score assigned for the correct answer decreases as the seconds pass and the drawing is composed. Then there is the Battle mode, essentially the same in terms of mechanics as the one previously described, with the only difference that it is played in two, booking in quiz style by pressing a certain key when you think you know the correct answer. Finally, the inevitable Pass and play should be mentioned, which can be used by a maximum of six users who, playing in pairs, must cooperate to achieve the maximum possible score: one of the two first composes the drawing, while the other must then guess what it comes, with both ultimately receiving the same amount of points. Pictiona you that I pictiona too The Free Design option is also curious, thanks to which you can create images in complete calm that you can later share with other people via bluetooth and perhaps use as wallpaper for your mobile phone. As can be seen, Pictionary certainly does not lack completeness and richness of modalities, making it a valid product both for a single player game session and for some pleasant moments of leisure with friends. However, the EA title suffers from a major limitation which basically halves its potential, and which an attentive reader will have already been able to guess: the design. Composing the desired image on the screen is certainly not an easy task, much less fast or intuitive. The game uses a system similar to that of the most common and elementary graphics programs, offering the opportunity to draw lines freehand, or from point to point, or still exploit square or circular shapes. Eraser and a color palette to be used for borders or fills complete the picture, but even if the tools are all there, the gist does not change: drawing using the keyboard of a mobile phone can only be something extremely cumbersome, imprecise and slow. Consequently, in group game sessions one must be faced with the choice of creating a rough but quick sketch (often precluding the other participants any possibility of guessing) or a sufficiently elaborated image, but anticipating the idea of having to employ at least about ten minutes. In short, as long as the CPU draws, Pictionary works perfectly, proving to be a pleasant experience and a stimulating pastime: but in groups the EA product loses much of its charm due to a cumbersome structure. Game tested on Nokia N70. Comment Pictionary is the strange case of an apparently unthinkable product for mobile phones, which nonetheless thanks to the commitment of the programmers manages to be fun and enjoyable even though it is very slow and cumbersome in the drawing phases. Complete with single and multiplayer modes, Pictionary works best if enjoyed as a real quiz, or when you only need to guess the drawing composed by the safe stroke of the CPU; however, if the task passes to the user, everything becomes much more complex, slow and not very satisfying. In short, Pictionary is a half-successful title, which in any case can give satisfaction especially in the Single Game and Battle modes. Pros Three different game modes Complete and well structured Simple and functional interface Cons Slow and cumbersome drawing phases Slightly limited multiplayer Audio-visual sector reduced to the bone After the excellent Scrabble, EA returns to the field of conversions of board games for mobile phones with probably the last title that could have been expected: Pictionary, the famous board game in which you have to guess the meaning of the drawing as quickly as possible by the participant on duty. And considering how we are not talking about Nintendo DS but about mobile gaming, the doubt arises as to how enjoyable such a product can be ", "date": "2007-02-08", "grade": null}