{"name": "Le favole moderne", "ref": "https://multiplayer.it/recensioni/71957-le-favole-moderne.html", "text": "Tested version: Xbox 360 There are many classic stories, those from ~once upon a time ...~ to be clear, the mere thought of which makes us smile again and the heart fills with tenderness. Who has never trembled for the fate of Little Red Riding Hood against the big bad wolf? Who among you has never feared that Snow White would die? In Playlogic's Fairytale Fights the perspective is very different and the wolf will have to worry. Fairytales or Nightmares? The beautiful introduction sees the presentation of all the classic characters we were talking about, from Snow White to Jack and the Beanstalk passing by the Emperor without clothes to get to Little Red Riding Hood, but from a rather bizarre and particularly violent and bloody point of view. Maybe it's just an impression? The real start in the game immediately catapults us into a not too clear fairy world called Taleville in which you can choose the character to use to enter the different levels provided by the challenge. The design of this area is a bit confusing and we had to wander around for several minutes to figure out which way to go to start the actual game, skipping the various stages of setting up the controls and audio/video settings. Still perplexed if the introduction actually had something anomalous, you start the adventure (we can confirm it immediately you can play it entirely in cooperative) and immediately there are no doubts about what to do, take a weapon and beat or rather slice all enemies you meet. You may wonder what this could possibly have in a game that recalls the fairy tales of the past, well the setting given to the title by Playlogic is just this, a distortion of the goodness of the classic heroes now framed in a different light, very irreverent enough to make us somewhat reminiscent of the old-fashioned Rare. Basically, playing as one of the characters, you have to move along the different levels of this scrolling fighting game, with absolutely linear and guided progress, to defeat all your opponents including several Bosses at the end of the scheme (above all the mythical Beaver! But even the Pied Piper is not doing badly at all) thus performing heroic deeds in order to regain his lost fame. The clashes are very numerous and not particularly demanding, the more delicate are those against the end-level Bosses against whom we will have to sweat the proverbial seven shirts before winning it. The linearity of the progress is interrupted by sporadic platform phases in which it is required to jump from one platform to another without falling, under penalty of losing all the savings obtained from the clashes. Unfortunately these sections are absolutely frustrating due to the control system, and with the umpteenth wrong jump resulting in a fall on deaf ears, anger can only take over even the most calm player. Not really a cartoon Looking at the images, you can get an idea of the cartoony look of Fairytale Fights, and of its very accurate graphic setting that permeates all the fantastic way in which we move during the adventure. The quality of the Unreal Engine is highlighted by a really successful character design, which places them in super deformed mode with a small body and a disproportionately large head, with physiques that closely resemble the protagonists of South Park. The violence that can be unleashed in a few moments is incredible and clearly clashes with everything that surrounds the hero in action. Literally slicing bad guys along the way and ~sliding~ over their blood is no small feat. It is pure and gratuitous violence, for ironic purposes only, it is evident, but it is certainly not a game for children as the graphic design might lead to suspect. From a stylistic point of view, therefore, nothing can be objected to the graphics that created the world of Taleville, and the Unreal Engine itself has been used fairly well for an engine that does not lend itself to particular criticism. Too many times we have noticed game areas that are too similar to each other, repetitions that could have been avoided with a more accurate development. The blood that flows from all the slain opponents floods the scene, the heroes get dirty with red splashes and continue their terrible deadly dance. The camera in principle frames the character sufficiently well and, except for rare cases in which excessive distances of vision occur, it works well. A greater number of problems are found in the presence of two players on the screen at the same time since the advance in pairs is not too easy and the camera ~tightens~ too much making one of the characters leave the scene. Xbox 360 goals The 1000 points disposible are divided into 49 objectives. First of all you need to completely finish the game in all the different chapters, but also win matches in arenas and make deadly combinations of shots. It takes time, in short, and a little patience. Out of control The control system studied by the developers allows you to move the character with the left analog stick and to attack enemies by moving the right stick. This choice has made the character in the attack phase hardly controllable, and in reality it is the entire movement of the hero that lends itself to criticism since too often it is too rapid and inaccurate. Falling from obstacles and falling into the void due to the imprecision of the controls is decidedly frustrating, and the same goes for jumping via the A key which unfortunately is too often poorly calibrated. The direction of the attacks is so imprecise that in the end you will simply find yourself rotating the right stick at random to hit your opponents in every direction. The system for parrying blows does not work and you become the victim of repeated attacks from afar by your opponents, an example on all woodcutters with rifles. The great variety is encountered with regard to weapons (collecting them all is also one of the achievements to be unlocked on Xbox 360), given that it is possible to challenge enemies with anything from the ~mailbox~ to the chainsaw, passing from bows and rifles. Weapons abound and in practice after each level shift there are new accessories. Fairytale Fights as already anticipated it is possible to play it entirely in cooperative with other players both via Xbox Live and live. The action is very funny even if even more confusing. Another mode in addition to the Story is the Arena, which can also be used online, which pits us against other human opponents to defeat. If you know Power Stone you will have no problem understanding how the arenas work, an all against all with no holds barred.", "date": "2009-11-09", "grade": "5.5"}