{"name": "Galletti ruspanti e minigame", "ref": "https://multiplayer.it/recensioni/71790-asterix-sono-pazzi-questi-galli-galletti-ruspanti-e-minigame.html", "text": "Created by Goushinny and Uderzo in 1959, Asterix is a cartoon character known all over the world. This popularity is probably due to the numerous animated transpositions, all of which were very successful, which have guaranteed the series a greater diffusion than is possible with traditional comic books. Even live-action cinematic films have been produced in recent years, the latest of which (~Asterix at the Olympics~) featured numerous sports personalities and inspired the creation of an entertaining and well-made multiplatform video game. On Nintendo DS there are several games dedicated to Asterix, and in the case of Asterix: These Roosters Are Crazy! we are dealing with a party game that mimics the traditional ~game of the goose~ and is clearly dedicated to a very young audience. Roll the dice! From the start screen you have to select your character and his opponent among the four available roosters (Asterix, Obelix, the singer Cacofonix and the village chief Vitalstatistix), then the game scenario between the village, the wood, the sea and the camp of the Romans. You can play alone or with a friend, taking turns on the same console. Playing the game is simple: you take turns ~rolling the dice~ and the character moves a certain number of squares on the course. Depending on the square on which he stops, he has to face one or more minigames, but he can also skip them by sacrificing one of the three boars provided. There aren't really dice to roll, but the characters punch a Roman soldier who flies off the force of the impact and lands on the chosen square. You can adjust the strength of the throw by paying attention to the fist-shaped icon that appears when it's our turn: if we touch the screen when the fist is small, the throw will be weak; if instead we touch it when the fist is big, we will be able to advance even five or six boxes. Whoever finishes furthest after crossing the finish line wins the game, with equal turns. Minigames for everyone As always happens for this kind of product, the strong point is represented by the large amount of mini-games available. In Asterix: These Gauls are Crazy! we find twenty of them, divided by the four selectable scenarios. Each can be played in normal or expert mode, with a substantial variation in difficulty. For example, in one of the challenges we have to visually memorize the contents of four dishes to then reproduce the dishes correctly: if in normal mode we have only one dish per dish, in expert mode the dishes become two and getting them all right becomes really difficult. There is a division of games by type: there are those based precisely on memory, those that simply ask us to quickly rub the stylus on the touch screen, those in which speed matters, etc. In one minigame we have to touch the right color when a note crosses the entire Cacofonix staff, in another we find ourselves at the fishmonger in the Gallic village and we simply have to put the fish indicated on the screen into the bag. There's quite a bit of variety here. Animated drawings For the realization of the game, the developers have tried as much as possible to maintain a certain adherence to the comics dedicated to Asterix. This transpires not only from the rich amount of unlockable extras, mostly made up of cartoons and character sheets, but also and above all from the graphics. The scenario during the game does not flow as smoothly as ever, but the roosters appear well drawn and have very nice animations. Colors are the masters, with always lively and brilliant shades to underline the joyful atmosphere that pervades this party game. The only drawback is the sound, too repetitive and essential.", "date": "2009-11-05", "grade": null}