{"name": "Che cielo che c'", "ref": "https://multiplayer.it/recensioni/71827-beneath-a-steel-sky-remastered-che-cielo-che-ce.html", "text": "Released way back in 1994, Beneath a Steel Sky was one of the few graphic adventures capable of facing head-on the hegemony of LucasArts products, absolute masters of the sector: the value of the Revolution work was underlined not only by the great public success and criticism at the time of its release, but also from the indelible memory that the title managed to leave in those who had played it. Therefore, it is impossible not to welcome this Remastered version, available exclusively for iPhone, with enthusiasm. The future is a trap Beneath a Steel Sky Remastered is set in a not particularly rosy future, in which humanity is reduced to living in huge, gray urban agglomerations managed with an iron fist by unscrupulous corporations. The protagonist is Robert Foster, raised by a tribe of outcasts of society forced to live outside one of these megalopolises: saved by them following a plane crash in which he lost his parents, our hero will be forcibly taken to the city, where he will have to unravel the mystery surrounding his true identity. The plot is very compelling, offers considerable food for thought and also in this Remastered version it can boast of being narrated by animated scenes by Dave Gibbons, co-creator of Watchmen. The in-game graphics have not been retouched, but still make a good impression, thanks also to the definition of the iPhone screen: the hand-drawn backdrops are particularly appreciable, but also the sprites of the characters are well-finished and well-animated. The crux of graphic adventures on the Apple device is however represented by the interface, an obstacle that Beneath a Steel Sky Remastered overcomes brilliantly. By touching the sensitive elements of the scenario, icons appear which allow you to perform the available actions, while to use an object from the inventory, simply open it and drag the desired item onto the objective. To avoid the risk of losing sight of some areas with which to interact, the game features a simple but effective mechanism: by holding your finger down on the screen for a few moments, all the hotspots are highlighted by a blue circle. An outstretched hand to casual gamers then comes from the suggestion system to rely on in case of need, which begins with rather vague clues and concludes with the real explanation on how to continue if the difficulties persist. Purists will still find their hands decidedly hardcore adventure, with challenging puzzles and an exciting story unraveling. If you want to nitpick, the duration of the experience is not the longest, but it is certainly quality time. Finally, another unconvincing aspect of Beneath a Steel Sky Remastered concerns the sound accompaniment: the music is rather repetitive, and the English dubbing boasts an acting so over the top that it can even be annoying. The tested version is 1.0", "date": "2009-11-06", "grade": "8.7"}