{"name": "Qui c' bisogno del Buscopan...", "ref": "https://multiplayer.it/recensioni/71724-painkiller-resurrection-qui-ce-bisogno-del-buscopan.html", "text": "Version tested: PCPainkiller became famous on two occasions: just released in retail version, for being an ignorant shooter like Serious Sam (therefore with dozens of enemies on the screen at the same time) but with a much darker atmosphere, and just re-released on Steam , where it sold a not inconsiderable carload of copies and made people talk about it again. Over the years they have come out in order: a decent expansion (Battle out of Hell), a bad derivative (Overdose) and a copycat title (Dreamkiller). Now, finally, Painkiller: Resurrection comes out, another derivative of the Overdose that has the co-op mode as its strong point. All the announcements that have concerned it have aimed to underline how much fun it would have been to play it in co-op. On the ads, the word co-op was bigger than the game logo. Fans of the original talked about nothing but the co-op of Resurrection and how their life was nothing without being able to prove it. Do you think that a couple of millenarian sects have postponed mass suicides to try out the co-op of the new Painkiller and that a porn star has locked herself up in a convent to try it out without being disturbed... and what does the publisher do? Feed the game to the masses without co-op, of course! There is no trace of it in the menus! Then you say one doesn't have to be bad when reviewing games... they promised they will patch it. But is it possible that those who bought the game immediately have to wait for the most advertised mode to be added via a patch? It must be a nightmare. Of course, the players are enraged, and they have every reason to. In reality, the longed-for mode exists, it has simply been made invisible and difficult to start. Those few who managed to find it have had big problems because it works really badly and crashes all the time. Brilliant! How to start co-op mode Multiplayer put on your hat and whip and hunt for hidden mode. To start a co-op game, start a dedicated server with the tool provided with the game. Select campaign maps C9L01 to C9L06, choose FFA and start the game. If you want, you can also add bots to accompany you. The ecological game At least the rest will be well done, you ask? No. Painkiller: Resurrection is the recycling fair. Five years after the release of the original, nothing has changed. But absolutely nothing. The enemies are the same, most of the graphical effects are identical to those of 2004, the weapons are the same, even the menus have remained unchanged. What has changed are the loading times, which have become phenomenal - we are in the order of the minute on the test configuration. Are the levels at least different? Ni. The settings are very similar to those already seen in previous titles and the similarity is strengthened by the presence of textures and models copied without too many hesitations from the first Painkiller. The textures have been enlarged, true, and some atmospheric effects have been added - not very well, actually, since they break down the fluidity - but when you start playing and you are in a cathedral and when you get to the second level you found in a cemetery, the sense of deja-vu becomes very strong. Furthermore, there are six levels in total and there is only one new weapon. Let's not joke, please. Bugfest 2009 is here! Furthermore, one is also forced to contend with dozens of bugs that only worsen the overall impression. In the first level alone we got stuck in the scenario three times and we were forced to reload the last save in order to continue. The glitches are innumerable as are the problems related to the design of the schemes themselves. In reality, the developers have done a lot to try to propose more articulated and better designed scenarios than in the past, Enemies, when faced with an obstacle that is too complex to overcome, continue to run regardless of the fact that they are no longer able to move the problem is that the enemies were not warned and remained the same as before. Don't misunderstand, we don't want enemies Einstein, absurd at this juncture, but it would be at least desirable that the poor souls don't get stuck with Swiss regularity in the various excrescences of the scenarios. Simply, when they are faced with an obstacle that is too complex to overcome, they continue to run regardless of the fact that they are no longer able to move. It's kind of a pain to see hellhounds positioned to ambush us getting stuck inside a shack they can't get out of because the door is too narrow. But this is only one of a thousand examples that can be listed. The fact is that on many occasions it is possible to curb the rabble of enemies simply by posrunning behind some obstacle. In other cases it is possible to finish entire levels without firing a shot. As? No more running, dodging enemies and counting on them not being able to chase anyone. In general we can say without hesitation that the single player mode of Resurrection is much worse than that of the first Painkiller, which is saying something given the years that have passed. Give me a hammer! But the bugs don't end there. Even the music doesn't cooperate, disappearing in the most excited moments or leaving when there's no one to eliminate. We are also sorry that some sacrosanct advice given by the fans have not been followed, such as that of making the bonus damage obtainable by collecting the souls of enemies storable in order to give the player the opportunity to use it at his discretion instead of having to waste it when perhaps there is no is no one to kill. The worst part of the game however remains the multiplayer. It's bad to say this for the sequel to a title that is still widely played online, but that's the way it is. What's wrong? Probably nothing, if you manage to stay in the game for more than five minutes. Unfortunately crashes continuously and there was no way to make it stable. Will these issues also be fixed with a patch? So it was promised. And in the meantime, what do we do with the game? Do we leave it to mature?", "date": "2009-11-05", "grade": "3.0"}