{"name": "Il re dal pugno di ferro", "ref": "https://multiplayer.it/recensioni/71861-tekken-6-il-re-dal-pugno-di-ferro.html", "text": "Version tested: Xbox 360A new Tekken was indeed missing. In this generation that has seen the big comeback of an exponent-rival of the 2D fighting game school like Street Fighter, the title which, together with Virtua Fighter, has helped to define the genre itself has been slow to appear on the screens in high definition of fighting games to 3D matches. Symptomatic case of the current market situation, Tekken has been forced by current times to make a historic about-face, which has led it to become a multiplatform title from PlayStation, thus presenting itself for the first time on both PlayStation 3 and Xbox 360. With 34 million copies sold behind it, distributed in 5 highly successful chapters, the Namco fighting game presents itself on the next-gen stage in a period of relative maturity for the platforms present, therefore presumably strong in a certain technical knowledge that can be exploited on the consoles and with a market already quite outlined as regards the genre of reference. A somewhat tougher challenge than that reserved for early killer applications, which the developers have been able to grasp well, even if they have not managed to reach historical results. The result is an optimal transition of the Tekken style into the new generation: a well-made update but without particular noteworthy innovative thrusts, perfect for fans and pleasant for everyone else too, thanks to the typical scalable approach of the series. On the other hand, the game was already well defined in its arcade version from which this derives, further perfected in the Bloodline Rebellion version. In the spirit of tradition is also the story that forms the background to the game, which continues the typical mythology illustrating the fight between the G Corporation and the imposing Mishima Zaibatsu, culminating as usual in the famous Tournament for the role of King of the Iron Fist. New entry There are 6 new characters introduced in this chapter, each characterized by a particular fighting style. There is the sensual and mystical Zafina, the androgynous Leo with a desire for revenge against Kazuya, then there is Miguel Caballero Rojo, the fighter-Latin lover, Lars who is instead the protagonist of the Campaign: the illegitimate son of Heiachi to whom also linked by fighting style, he takes sides as a paladin against the Mishimas. Alisa is perhaps the most bizarre new entry, being a lethal android with the appearance of a girl, while Bob is a good fighter characterized by a certain belly, which however does not prevent him from fighting at his best. Something new The subversive thrusts have not moved (even rightly) Tekken 6 from its strong link with the roots of the series, but it is undeniable that Namco has at least tried to propose something new. The most obvious introduction is represented by the Campaign mode, which in fact tries to bring down the typical dynamics of Tekken encounter combat within a scrolling fighting game-style context, with timid hints of RPG elements: we then find ourselves selecting a fighter and launch us with this within various levels (a bit naively, any character you choose in the cutscenes will still appear Lars, the default protagonist) full of enemies. All we have to do is reach the end of the path, eliminating swarms of opponents until the end-of-level boss fight. Once this is defeated, we see the story continue (still the ~G Corporation vs. Mishima Zaibatsu~ issue) and gain access to new zones, as well as earning money and experience points needed to level up our fighter. The Campaign is therefore, substantially, an enhanced version of the previous ~Tekken Force~ mode, but fails to fully convince: the level design is reduced to a minimum, while the typical mechanics of the clashes fail placed in this progressive context, resulting in all excessively chaotic, also thanks to a not exactly accurate camera management. It succeeds rather well in the role of breaking the routine and the possibility of facing it in multiplayer increases its value, but the reasons for returning to it lie above all in the possibility of collecting various accessories and elements to be used within the complex editor to change the appearance of the characters or, at least, in the desire to see how the story unfolds rather than in actual fun derived from the gameplay. Xbox 360 goals Tekken 6 has a rather calibrated distribution of its gamerpoints. There are 50 unlockable objectives, for the usual total of 1000 points to collect, scattered a bit over all the various game modes. Many are allavia those distributed during the Campaign mode, linked to the achievement of specific requests such as the defeat of a certain number of enemies, the collection of a total of objects or so on. The real Tekken-maniac will surely be able to complete the challenge, albeit with some time. Good old Tekken The crux of the matter is always the good old one-on-one confrontation. The dynamics of the fight is the same as in the previous episodes, with four buttons for attacks (two for kicks and two for punches) and an infinite number of possible combinations to chain combos, sequences and holds. The typical content opulence of the series returns here with arrogance, presenting one of the largest rosters ever seen in a fighting game with 40 usable fighters, each with a large repertoire of moves and combos available and each - it must be said - very well defined and original as a fighting style. The mechanics are well established and always effective, placing themselves as a meeting point between the typical dynamics of 2D fighting games and the depth conferred by the third dimension, with fast and immediate clashes that lend themselves well to entertaining newbies but also to gradually enthrall, with the possibility of discovering the large number of techniques available. The minimal changes made to the well-established structure for 15 years of history concern the introduction of Rage mode (this too, on the other hand, a classic in the genre), which increases the intensity of the blows as energy drops and the possibility of making increase the ~grade~ of the fighters by winning matches, adding a timid role-playing element in the management of the characters, which is also well filled by the presence of the rich editor. Many characters have undergone decidedly different changes and balances compared to past chapters, which could displace expert players but which will certainly also make the return to the action more stimulating. Various game modes made available, among which the presence of online multiplayer stands out, which in such a title obviously ensures an important basis for longevity, although in some cases there are some imperfections and uncertainties in the game that make the online gaming experience still perfectible, as well as the netcode of the game. For the rest we have the aforementioned Campaign and the classic Arcade mode available, as well as Ghost Battle (meetings in succession suitable for ~leveling~ the fighter), Vs Battle (against another player), Team Battle (ie the classic Tag Team with teams of fighters), Time Trial, Survival (against an infinite number of characters) and Practice. The video review New generation Let's say right away that the final version clearly differs from the one previously tested in the preview, especially as regards the graphics sector. Not a miracle result, but if nothing else the advertised ~full-time variable animation~ system is now clearly visible and the final effect is more than satisfactory. In essence, it is a motion blur-style effect that blurs the transition between one animation and another with a variable effect depending on the intensity and speed of the shots, with the result of making it as natural and less robotic as possible the movement of the characters, all combined with the fluidity of 60 frames per second. The modeling of the characters is still quite simple in many cases, while the animations manage well to characterize each of the 40 characters in a unique way, all of which appear quite well defined in their fighting styles. In addition, the typical lighting effects that accompany the strikes help to amplify the feeling of power of the lunges. On the other hand, the scenarios that form the backdrop to the clashes are not very inspired and pleasant, and the introduction of the limited interaction with these to raise the general impact is of little use. The possibility of hitting and destroying elements of the background is in fact limited to the programmed reaction with well-defined points of the environments that slightly widen the field of action (similar to what we saw in Dead or Alive) without however providing real variations in terms of gameplay . The soundtrack is typically Japanese in taste, alternating rock music with pop influences of various kinds, in the typical arcade mix of Namco tradition, in addition to the typical sampled voices of the characters: all of an exquisitely classic taste.", "date": "2009-11-03", "grade": "8.2"}