{"name": "Una fiaccola nel buio?", "ref": "https://multiplayer.it/recensioni/71845-torchlight-una-fiaccola-nel-buio.html", "text": "Torchlight is a small game for around 15 euros that can be purchased via digital delivery, an independent project which, instead of having a few young people with excellent ideas behind it, can count on characters such as Max and Erich Schaefer, as well as Peter Hu, people who have worked on planetary successes such as Diablo 2 before separating from Blizzard and jumping with Bill Roper in the ill-fated adventure of Flaghship Studios. The team, currently made up of about twenty-five people, is therefore made up of veterans of the Seattle office, at the time working on Mythos, and instead of aiming for a mammoth project - Hellgate: London was offline, paid online and not, a shooter and game of role, with a translation into fourteen languages - he focused on something more contained, extremely immediate and of Blizzardian memory. The result, unexpectedly, was more than pleasant. Ignorant The premise - a city with an adjoining mining quarry afflicted by mysterious dark forces - and the setting - a fantasy with steampunk elements - are nothing more than a sinister excuse to disguise the unique nature of Torchlight: very close to the second chapter of the Blizzard RPG and even more to Fate by WildStudios, it takes the concept of action-rpg to the extreme, offering an endless amount of small and large dungeons to empty, improving one's stats and wasting hours managing the abundant loot left on the ground by enemies . A dungeon crawl like we haven't seen for a long time, which soon put aside the slender and specious primary and secondary missions, guarantees hours of entertainment through the usual sequence of randomly generated patterns, mazes composed following well-written algorithms given the appreciable coherence of results and the good amount of scripted events. The structure is therefore simple, with the enemies deprived of an artificial intelligence other than the one that magnetizes them towards the user and the latter committed to guaranteeing them a survival of less than a handful of seconds, repeating the practice infinitely between explosions, pieces of flesh and blood scattered almost everywhere, in contrast with a cartoony, super deformed graphic sector with hand-drawn surfaces, far more caricatured than the one chosen by Blzzard for Diablo 3 and comparable to that of the aforementioned Fate . The city itself offers the classic shopkeepers, some more or less pleasant encounters and a trunk to share objects with other characters, acting almost exclusively as a hub. Curiosity A second game set in the same universe but this time in the MMO genre is promised within the next 18-24 months. There are no further details but the good success of Torchlight could give an important boost to this other project. Three heroes for everyone Before launching into the action, the only two choices you are faced with are related to the character to play and the pet that will accompany him: the first is selected from the three classic models - warrior, magician and thief/archer - while the second between a dog and a cat, without the user having control over the features of both the alter ego and his little companion. Obviously a different speech for the growth which, as mentioned, relies on the classic levels and the equally traditional skill trees, able to add new shots, spells and summons to its virtual counterpart, always in any case with action and fun in mind. The distribution of the loot allows you to always have some new object, weapon, armor or upgrade to add, for a result that is difficult not to consider exciting as it is similar, in terms of involvement, to Diablo. Regardless of which of the two beasts you have entrusted to have some company, you can also enhance the quadrupedal companion, also making it an extension of your inventory. In any case, Torchlight remains a sectoral product that is unlikely to please everyone, a race for statistics that sees its biggest flaw in the absence of multiplayer, really a shame. The music, curated by Matt Uelmann, already working for Blizzard, from StarCraft to World of Warcraft, is very beautiful, while the optimization made on the code has made it possible to keep the game engine light, which with the test configuration, at 1650x1050 and with all settings maxed out, it allowed it to stay steadily above sixty frames per second.", "date": "2009-11-04", "grade": "7.8"}