{"name": "Spara & fuggi", "ref": "https://multiplayer.it/recensioni/71265-minigore-spara-fuggi.html", "text": "The games in which you have to fight against zombies are now countless! Apparently, the fascination exerted by these gruesome creatures is still high, despite the fact that forty years have passed since their great introduction into the collective imagination, which took place by director John Romero. To tell the truth, in Minigore we will not be dealing with real zombies, but with black and hairy creatures, who however share the tastes of food with the undead: if they manage to grab you, they will eat your flesh and it will be game over. Literally ~game over~, given the nature of the new title developed by Mountain Sheep: the player has a single survival mode available in which he must survive as much as possible the attack of hundreds of ravenous monsters. The only variation on the theme is represented by the presence of three unlockable difficulty levels, which however only make things more difficult, without introducing any progression. Our character, John Gore, as mentioned, looks like a LEGO man: small body, large square head, ~drawn~ eyes. The difference with the nice little plastic puppets lies in the fact that John wields a big and bad machine gun, and has no fear of using it to dismember his opponents. Shoot what happens to you The prominent element of Minigore is certainly represented by its graphics, which boast a comic and colorful style both as regards the protagonist of the story and the countless enemies he will have to deal with. The visual references to the recent LEGO series video games appear obvious, and are confirmed by a control system that makes immediacy and fluidity its strong point. The developers have come up with a virtual double d-pad that allows us to control with the two thumbs the movement of John and the direction of his fire. The consequences of our volleys on the opponents are evident, judging by the liters of blood that soon begin to flood the iPhone screen. It is interesting to note that even in the presence of hundreds of opponents, the graphics engine does not bat an eyelid and does not give in to dips or slowdowns: everything remains extremely fluid. Unfortunately, the purely ~accessory~ presence of the background elements is also noted: our character moves within the scenario as he would on a perfectly clear plane, i.e. he does not get stuck near any obstacles (boulders, trees, etc.) . From a playful point of view, this excludes any episodes of frustration, but in the end it is not convincing and adds to the general lack of progression: the single stage, the single mode, the enemies always the same, the sole purpose of surviving as long as possible. The game costs only 79 cents, but at the same price there are several undoubtedly more ~full-bodied~ titles. Who's Afraid of the Black Man? John Gore, we said, must defend himself from the onslaught of numerous monsters arriving from all directions. To do this, he can count on the supplied machine gun, with infinite shots, and always keep on the move when the hordes of enemies become more consistent. Among the few variations, there is the possibility of picking up a very powerful rifle but with limited ammunition, or choosing to hit the crate that contains it to obtain an effect similar to a ~smart bomb~ on the screen. The ~normal~ monsters are sometimes joined by other ~fiery~ ones, decidedly faster, or their bigger versions, which once hit are divided into many smaller copies. Our energy is visually represented by John's physical condition, and in practice we can withstand two attacks before we die: when the third arrives, it's game over. Every now and then the killed monsters leave a four-leaf clover on the map that we can collect. When we have three of them, our character transforms into a sort of ~fiery minotaur~ and for a few seconds he can make a clean sweep of his opponents simply by touching them. The sound accompaniment consists of a beautiful engaging music (replaceable from one of our playlists) and some nice sampled phrases: not much, but it works. The tested version is 1.1", "date": "2009-10-26", "grade": "6.9"}