{"name": "Tra Bora e Scirocco", "ref": "https://multiplayer.it/recensioni/71502-lostwinds-winter-of-the-melodias-tra-bora-e-scirocco.html", "text": "Lostwinds: Winter of the Melodias is available for download on the Wiiware service of Nintendo WiiThere is no doubt that Lostwinds, the first one, is a good game: practically all the newspapers that deal with video games have awarded it, online or not. with ratings ranging from ~nice~ to ~justifies the very existence of the Wiiware~. Sure, Lostwinds was a good game, but it was also much more, and while that ~more~ isn't valued in the artistically immature world of electronic entertainment, it's not crazy to assume that if we judged video games as they do the literary or musical works the value of Lostwinds would remain practically unchanged, while that of many other games considered masterpieces would drop headlong. This is because Frontier's work pursued aesthetic aims through each of its components (including the playful one), while most of the good games are limited to chasing simple, pure fun. We defined the first episode as a four-handed story written by Hermann Hesse and Neil Gaiman, due to its ability to combine oriental mysticism with essentially western fantastic elements, but above all we defined it as something unique, an interactive haiku. Making a sequel worthy of a game like this, in a world and in an era where sequels rely on the logic (?) of ~faster, bigger, harder~, well... it's a even harder than bringing the series to life. Soft-spoken There are two other characteristic elements of Lostwinds that risked being lost in the name of homogenization, namely synthesis and calmness. The Frontier game was surprisingly devoid of dramatic tension, and not by mistake, but by a precise - conscious - choice of the developers: a choice, like everything else, rather unique in the gaming landscape. It was also a decidedly short adventure, about three hours, a length in any case proportionate to the elements introduced and the topics covered. Before talking about the changes made in the design of the sequel, it is good to specify, for all those who have not played the first episode, the basic structure of the Lostwinds series (therefore shared by both chapters): it is a side-scrolling puzzle-platform set in a single area to explore and re-explore (at Metroid in short) until the meeting with the final boss. The most peculiar part of the gameplay lies in the impossibility of jumping, in fact Toku is rather static to be the protagonist of a platformer, so his aerial movements are entirely managed through gusts of wind to be controlled through the pointer of the Wiimote. The air is not only useful for moving the protagonist, but also for interacting with the various subjects/objects on the screen, so much so that it is the player's primary alter-ego - another feature which, as specified at the beginning, enriches and completes the ~airy~ aesthetic of this series, in which human events are only a small part of the whole. When Frontier announced the sequel and promised a longer, more difficult and challenging adventure, but above all when the central theme of Winter of the Melodias was shown, i.e. the change of season (spring / winter), which can be inscribed in the abused (in the post ~A Link to the Past~) leitmotif of the two parallel dimensions, the suspicions that the uniqueness of the series could melt like snow in the sun - and the nightmare that melting snow in the sun would become a recurring enigma - became more and more pressing. The Melody of the Wind Frontier, despite the pressure from players and critics, who both wanted - largely - a longer and more substantial title, has managed to carry on with its project without paying too much attention to the judgments and advice of the public: it is true that Winter of the Melodias is slightly longer than the first, and it is true that it is also slightly more difficult, but these are marginal aspects that revolve around the central core of the work, or rather the reaffirmation of one's singularity and refinement. Winter of the Melodias is a better game than the progenitor, the various sections contemplate a stratification of interaction levels unknown to the predecessor (and not only because of the seasonal duality), but above all it is a platform that completely ignores mannerisms and, while on the one hand it fixes what there was to fix in the playful field (dispersion and degree of challenge), on the other it moves away from the canon as far as was necessary to improve further: clashes with enemies, for example, are now secondary, if not outright marginal. If in the first episode there were still so many puzzles related to killing all on-screen opponents (paradoxical and inappropriate puzzlei for every title that wants to be both serious and engaging, given that they imply direct contact between game and player, without giving importance to the narrative context or the character) here they are practically non-existent, and the change of season itself, which could have easily falling into banality, it is carefully dosed: only in some final sections has Frontier focused a little too much on climatic variation, but it's a bearable sin. Visually Winter of the Melodias is exceptional, as much and more than the first: elegant, light, refined, very well animated and, above all, measured in the lighting. The sound accompaniment, more than improved, has matured: less ingenious than that of the prequel, it takes up the main themes and, rather than developing them, alternates them with long silences filled by the blowing of the wind.", "date": "2009-10-23", "grade": "8.6"}