{"name": "One Piece parte seconda", "ref": "https://multiplayer.it/recensioni/71232-one-piece-unlimited-cruise-2-one-piece-parte-seconda.html", "text": "Wii owners who are passionate about manga and anime will have welcomed the announcement of One Piece: Unlimited Cruise exclusively for the Nintendo console. It will have been less fun to discover that this title has been divided into two parts for purely economic reasons, a clear sign that times have changed and it is difficult to expect (especially from a tie-in) extremely full-bodied and long-lived products. One thing, however, is really hard to complain about: the effort that the developers of the Ganbarion team have made to make the game more faithful possible to the manga as regards the story (completely unpublished), the dialogues (often really funny) and the presence of all the characters who have appeared so far in the series. For a One Piece fan, attending the numerous interlude sequences present in Unlimited Cruise is really fun, also thanks to the excellent polygonal models used for the occasion, which reproduce Monkey's physical appearance and facial expressions in the best possible way Q. Luffy, Zoro, Sanji, Usopp, etc. Very often the purchase of this kind of product is recommended only to enthusiasts, and we are certainly not faced with an exception: ~enduring~ the game mechanics at the base of One Piece: Unlimited Cruise 2 - The awakening of a Hero is a feat that only fans of the manga and/or animated series will be able to sustain. Let's be clear: the developers had several interesting ideas and the control system appears well studied and suited to the peculiarities of the Nintendo console, but in the end the action is limited to very long rather sterile and limited exploration phases, enlivened only by dozens and dozens of random fights worthy of an RPG. Obtained the object X through the classic backtracking, you can access a new portion of the map and maybe face a boss. The devil fruit A limited and repetitive gameplay, then? Let's say that the element of variety is represented almost exclusively by the growth of the characters, who in Unlimited Cruise can not only become more powerful and more resistant as they eliminate ranks of opponents, but see their arsenal of moves enriched as a result. Let's take Luffy, for example: at the beginning his attack combo consists simply of a punch and a kick, but through the level-up not only this is enriched by a further devastating movement (~gom-gom axe~), but it is accompanied by accessory attacks that are as fun to perform (by shaking the Wii-mote, perhaps, as in the case of the flurry of punches) as they are spectacular to see. It's a shame that the practice of focusing on boosting one character doesn't pay off in the end, especially in this second part of UC. In fact, once the game has started, we are asked if we want to import the save from the first episode, which we may have completed in the meantime. If we do this, we can have already enhanced characters right away and make them even stronger gradually, managing to stand up to practically every threat in the best way; if we don't, we have to ~start over~ and this can be a big problem, as even some of the ~basic~ opponents prove quite resistant to our best shots. In short, favoring some characters of the crew rather than others comes almost naturally, but this practice pays off when it comes time to face a boss and our favorites are neutralized: we then find ourselves hitting the enemy with the characters we have not upgraded , equipped with only ineffective basic attacks. The selection system hasn't changed: just press the ~-~ key on the Wii-mote to open a screen where you can change your alter-ego by choosing from the nine available. Their characteristics have not changed, so there is Usopp who specializes in ranged attacks thanks to his slingshot and various weapons, Zoro who has the best ~melee~ attacks due to the three swords wielded simultaneously, Sanji who confirms as powerful as fast, etc. Unlimited cruising One Piece: Unlimited Cruise 2 - The Awakening of a Hero begins where the first part ends, so Luffy and his companions find themselves having to return to the islands they have already explored to restore Gabri to its original form. Fortunately, the landscape of each location has changed radically, so it is in effect a matter of moving within new stages, albeit characterized by a less inspired design than previously seen. The system of transforming objects into points is the one we already know and pushes us to interact with the scenario whenever we can to collect something. Materials canlater be worked on for the creation of extra equipment and tools such as bridges, ~slingshots~ and ladders. The minigames where you have to use the controller's motion detection system have been increased, but still remain very simple and limited. In the eyes of One Piece fans, solving the puzzles related to the collection of objects can give great satisfaction, given that in these cases the plot progresses and you can see how the various characters behave in the face of new discoveries made on the islands. From a technical point of view, no changes are noticed, therefore on the one hand we have the aforementioned well-designed polygonal models and faithful to Oda's stroke, also equipped with a good set of animations, on the other a decidedly dancer frame rate, which alternates phases very fluid (60 fps?) to others jerky, denouncing more than a lack in the optimization work of the graphics engine. Everything that appears on the screen is very colorful and lively, but it certainly cannot be said that the design of the scenarios and enemies lives up to expectations: you find yourself exploring very bare and repetitive locations, which represent a step backwards compared to those present in Unlimited Cruise 1, while the opponents have few variations. The game's dialogues are spoken in Japanese and subtitled in Italian, while music and effects do a decent but not exciting job.", "date": "2009-10-13", "grade": "6.9"}