{"name": "NBA 2K10", "ref": "https://multiplayer.it/recensioni/71021-nba-2k10-sotto-canestro-anche-questanno.html", "text": "Tested version: Xbox 360No water has passed under the bridge since the first chapter of the successful 2K basketball series, exactly 10 years ago the first basketball simulation capable of making Electronic's shoes debuted on the then ~next-gen~ console Sega Dreamcast Arts and their NBA Live. The evolution of the saga has been slow but constant, and the guys at Visual Concepts have introduced new ideas year after year: the online game already in 2001, the scanning of the faces of the players two years later, the association mode in 2005, the shooting with the analog stick the following year, just to name the most important ones. This year 2K Sports brings to our screens the definitive game of basketball, the sum of all the experience accumulated over the past 10 years and now made available to the talented team to create the point of no return of the sports genre. The King's crown Where Electronic Arts still holds onto the primacy of creating the best sports simulations of the NHL and NFL, and if it plays it openly with Pro Evolution Soccer as regards football, speaking of Basketball, the palm of best game ever still remains narrow to the talented Visual Concepts of 2K Sports. NBA 2K10 is still the best basketball title out there, as well as one of the richest and most complete sports games ever seen around. First of all let's talk about the experience played on the field, the raw gameplay: there are some substantial innovations, which, while not distorting the game, modify it slightly. Until NBA 2K9 we were used to running continuously using the trigger, but from this year the run was palpably limited right away. There is a double energy bar under the character we command: one of instantaneous fatigue, the other general. Running gets tired soon and once the first bar is exhausted the player slows down dramatically; slowly also the global energy drops more and more, until a change is necessary to make it rest. The idea is right and makes NBA 2K10 more simulative than usual, but it's certainly a nice change and every fan of the series will interpret it in their own way. The learning curve is quite perpendicular and long to digest due to the amount of commands, shortcuts and variety of available actions put on the plate by the developers. NBA 2K10 is a deep game precisely because it can be used with fun by both a newcomer to the series and an expert who wants to know how to use all the controls. Each player is personalized not only in appearance, but also in movements and animations: therefore shots, free throws or passes must also be known to calibrate according to the controlled character. Passes are often not as precise as we would like, even directing the stick to the right target sometimes the ball can go out of bounds or go in another direction. Mistakes or desire for extreme realism? Curiosity As usual for a Yankee basketball game, NBA2k10 offers us a purely hip-hop soundtrack, with a tracklist made up of ups and downs. In the wake of ~EA Trax~, in the options we can access all the songs available in the game, see the CD covers, delete unwanted tracks or play the favorite ones. The leading artist is undoubtedly The Game, 50Cent's sidekick in many songs, who created an unreleased song for the game for the occasion. We note the presence of Kanye West and Florida, but otherwise they are underground artists unknown to most. The possibility of unlocking some rappers to make them play on the parquet is curious: Pitbull, David Banner, Twista, and West and The Game themselves can clash with the stars of the NBA. Coach or player? Compared to last year, the possibilities to call a game action in NBA 2K10 have been greatly expanded: from 8 to 24 plays. The range of offensive possibilities (called Playcalling) gives us the opportunity to exploit the best game conditions to create new ways of going to the basket, making better use of teammates and their passes, halley oops, blocks and so on. In practice, orders are given to the team which serve to coordinate the attack action with the characters not controlled by us. Thanks to the internet connection, which the game makes extensive use of in all its aspects, a mode called ~NBA Today~ has been inserted, very similar to the FIFA Live Season: it is a question of always having the real ~season~ at hand. ~ of the current season with pre-season, championship, Play-Off matches. It is therefore possible to participate in the real matches in progress, even if in a virtual way, with the real roosters and official formations. Another welcome novelty is the close partnership with a famous statistics site, which offers live on-screen, when you need it, comprehensive data and statistics of players, teams and league. The fabulous ~Association~ mode is always present, which allows you to manage a team in its most intimate details: staff, workouts, drafts, trades and championship games, just as if we were the coach/manager, and in NBA 2K10 you they can also wear the role of a rookie (a rookie freshman) trying to move up the team, make his way in the NBA and get to the NBA Playoffs. It's called ~My Player~ mode and it's a simulation of personal and sporting growth in the world of basketball. We watch the first game from the bench, coming on for only a few seconds (if the coach wants, of course. By playing well, we get positive judgments that increase the coach's esteem for us, and with it the possibility of playing more minutes and perhaps play in a first-class team.Besides these modes there is a whole submenu called ~NBA Blacktop~ which opens the game to a new sphere of the ~basketball~ world: these are challenges from 1 to 5 players, dunking competitions , free throw competitions, street challenges: basically an NBA Street included in the game and relegated to a simple ~mode~, just to understand the vastness of NBA 2K10 and its completeness. Xbox 360 goals NBA 2K10 provides the player with the canonical 1000 points, to be unlocked through 50 objectives. Most of them are related to specific sports performance on the playing field, and not to a progression in the league or single player. For example you must make more than 30 assists, 10 blocks or 15 steals with any team. Or score a certain number of baskets with specific players like Kobe Bryant, Dwight Howard or Kevin Durant, win the dunk contest with Lebron James or play a flawless game with Yao Ming. They are not easy goals, you have to work them out one by one. Challenge the world The greatest advantage of a sports game is that it can be used in multiplayer: Xbox Live (and PSN on Playstation 3) offer a range of almost unlimited possibilities to the next-gen player: in addition to the classic challenges in ranked or customized matches, you can in fact create our favorite player and form an ~online team~ with other players from all over the world. We have already seen how the internet connection perfectly integrates the game with statistics and data, continuously updates roosters and NBA news. The net-code seems to have improved markedly, and where a year ago there were noticeable drops in framerate in online games with very distant players, today the fluidity of the game would seem to be the same both when playing against Americans and against people close to us. The visual component of NBA 2K10 is again top-notch this year, with state-of-the-art animations customized for all the important players down to the smallest detail. The action flows smoothly, apart from some sporadic indecision in the frame-rate during the most agitated situations. The presentation is the most choreographic and spectacular in a sports game: lights, thousands of delirious people, scenographic entrance of the players. It's just like watching TV. Too bad for the faces, which, although very similar to their real counterparts, seen up close still give the impression of being ~wax statues~, with skin that is perhaps too shiny and the eye lost in space. The sound is at the top, as always, with ambient sounds from the sidelines, crowd screaming and singing, realistic effects and a respectable soundtrack, albeit with perhaps too underground tracks.", "date": "2009-10-07", "grade": "8.9"}