{"name": "Rosa  bello!", "ref": "https://multiplayer.it/recensioni/70996-kirby-super-star-ultra-rosa-e-bello.html", "text": "It was the year 1996 when the Kirby SuperStar cartridge peeped into the slots of the good old Super Nintendo: a nice collection of mini-games and platform levels to be tackled with the most placid character in the entire Nintendo universe. It was the transitional era between the 16bit consoles and the new, flaming and powerful 32bits which at the time showed incredible things: Kirby did not leave his mark, and few enthusiasts remember today that excellent game which marked the step to the new generation of chips and silicon graphics. The Nintendo ~Mother~ does not forget anyone, however: neither of her beloved character, nor of the many fans who adore him, much less the new and young generation who have not appreciated him in the past due to his tender age. This Kirby SuperStar Ultra is a welcome return, a graphic and content remix that will make many happy. A funny and cruel pink character Kirby SuperStar Ultra is a two-dimensional platformer, those games where you jump left and right, going up and down platforms and levels. To tell the truth, the likeable protagonist of this game rather than jumping and running is dedicated to flying and gliding thanks to his acrobatic skills, which can be activated simply by pressing a button: Kirby fills up with air and begins to float harmoniously for the scheme. The Nintendo pet (but what species will it be?) has many characteristics that make it unique and particular in the world of 2D platformers: it can suck up enemies, spit them at obstacles and other creatures, and even take on the appearance and powers of those it eats. Described in this way it would seem like a creature worthy of a Clive Barker Horror, but in reality Kirby is a stuffed animal that swallows and chews enemies with a smile on his mouth and big manga eyes. With her outstretched hands she looks a bit like the legendary Arale, the legendary cartoon from the 80s. The ~copy~ skills are used in almost all levels to access particular places, kill final Bosses, activate inaccessible doors: using the directional cross you can suck in an enemy and clone him, or lose his ability by pressing the select key: it's up to we decide which features are more important than others in that specific step. Curiosity Kirby was originally created by Masahiro Sakurai, a longtime friend of current Nintendo President Satoru Iwata and head of the HAL Laboratory team at the time, responsible for all Kirby and Smash Brothers. The creator of the pink hero then broke away from Nintendo, complaining of a serialization he did not like, to create a new independent label called SORA Ltd.: his first job was Meteos, together with one of the most extrovert game designers on the scene Japanese, Tetsuya Mizuguchi. On February 28, 2009 Nintendo officially ~engaged~ its ex-employee, financing him with 140 million Yen and about thirty employees (mostly from Smash Bros) to create a new game on which the tightest reserve. Portable size Despite its homemade nature, being originally designed and born for Super Nintendo, Kirby SuperStar Ultra is perfect for a portable experience worthy of the best DS platformers. Instead of one long adventure, a faster and ~easy~ approach has been opted for in this game: six mini-adventures set in exciting worlds, with different stories and backgrounds, Bosses, enemies. Each of them has a different degree of difficulty, and the average time to complete them varies from half an hour for the first one available (Light Breeze) to an hour, an hour and a half for the more difficult one. The adventures do not particularly exploit the technical characteristics of the DS (as for example the good Kirby Canvas Course did), having been designed for television, but Nintendo has seen fit to make some additions to the main course by proposing a series of delicious mini- games created specifically for a portable experience, which make good use of the touch screen and dual screens. You can also play cooperatively, with two players each having a copy of Kirby SuperStar Ultra. Alternatively, by connecting the two cards wirelessly, it is possible to play on a single screen, while the second participant controls his character by looking at his friend's Nintendo DS. Definitely smart. The visual cosmetics of Kirby SuperStar Ultra have been renewed and enhanced. It's not one of the best Nintendo DS games, visually speaking, but the improvement over the 16bit original is clear. The game is colorful, pastel shaded, fun to look at, as well as play. The music is cheerful and fun, absolutely suited to the context and the spirit of Kirby. The game, evidently designed for a young audience, has comy defect is that it is too simple for those who chew the platform genre for breakfast. The various levels are completed with decisive nonchalance and speed, and the Bosses at the end of the scheme (traditionally hard to digest) let themselves be killed with 2/3 well-aimed shots. The addition of new unpublished levels, remakes of some old ones with changed elements, new enemies and moves is very welcome. Thanks also to the inclusion of numerous FMV films, the global ~package~ is well packaged, complete and cared for from every point of view. A must-have game for every Nintendo-fan.", "date": "2009-10-07", "grade": "7.6"}