{"name": "Nell'intestino pigro del mostro", "ref": "https://multiplayer.it/recensioni/70988-tales-of-monkey-island-episode-3-lair-of-the-leviathan-nellintestino-pigro-del-mostro.html", "text": "Perhaps no one is reading this review except Umberto - to be sure that the opening paragraph is actually talking about the game and not the Tuesday futsal match. Let's see some plausible reasons: first case, you're a fan of the series and you want to make sure that the editor hasn't given Monkey Island a ~2~, but otherwise you've already bought it and best wishes. Or secondly, you think that if you're not a fan, then these five episodes aren't about you. Here, this is where you are wrong, because from this third episode we are convinced that the new adventures of Guybrush Threepwood can live on what the Telltales have ~snatched~ and re-adapted, strong in a now dense and coherent universe, full of new characters. Moreover, the tone is becoming more and more mature, and not only for some jokes of a sexual nature (being adults will also mean something else, right?) but for the common thread underlying the series: the couple, love and relationships between man and woman. Nothing to bother Love Line about, but Guybrush finally leaves the spitting contests behind to deal with the distractions of his wife and new suitors. In fact, while the redheaded Elaine discovers a LeChuck present to himself and responsible, the bounty hunter Morgan le Fay sends subtle but obvious signals to Guybrush, who however does not seem to take the advance, taken as he is by bringing his distant wife back on board . Oh yeah, the main plot, we almost forgot. Don't worry, everything continues in a crescendo of action, towards the now elusive Esponja Grande, and this time the adventure stages a kaleidoscopic swirl of characters, including a giant walrus looking for a girlfriend. So off the anchor and... Manateeeee! (playing, you'll understand). Curiosity Tales of Monkey Island is a series composed of five chapters and inspired by a saga of the nineties, The Secret of Monkey Island. The work is carried on by Telltale, with the collaboration of a large part of the original team. The episodes are released on a monthly basis and from time to time you can read the review on Multiplayer.it. NOTE: At launch, all Tales of Monkey Island episodes are available in English only. After some time, Telltale releases translations of the subtitles in other European languages, but there is still no official announcement about the timing. Those for the PC version cannot be purchased separately, unlike what happens for the Wii. Ask Murray The first thing that catches your eye if you have played the previous episodes is the aesthetic aspect. It starts with a convincing starry sky to continue in the stomach of a walrus and finally arrive on the seabed. Goodbye dull locations and secondary character models pulled out of the chart's recycling bin. All the people we meet - and there are many - enjoy a characterization that does not leave out often overlooked aspects, such as the voice and facial expressions. We finally get to know Coronado De Cava and his crew of mutineers, a kind of community withdrawn from the world (note: withdrawn in the stomach of a huge marine animal) among which is the invaluable surfer dedicated to celebrating life with as many as many glasses as possible; a disengaged idle as you see only in the Faculty of Arts. Furthermore, and this is a nice touch, Murray makes an appearance, a brilliant supporting actor who will return in the credits. We don't anticipate anything, but the closing of this episode is a testament to Telltale's creativity and style. As for the puzzles, which also begin more than one at a time in parallel, opinions differ. While all are unanimous in recognizing its inventiveness and originality, some have found them among the easiest seen so far in the series, while others have been stuck for up to twenty minutes on the same puzzle, sometimes due to the unclear directions provided by the game. In both cases, the average duration of the adventure could be shortened by an hour or lengthened by a couple, nothing that could, however, embarrass players accustomed to puzzles. Some crazy ideas and a couple of daring mental associations made us think back to the first two Lucas-branded episodes, making this third chapter of the new series the most successful published so far. Only one weak point remains, which distinguishes Telltale's productions, namely the aforementioned simplicity of the adventure. There's nothing short of fun, just a real challenge.", "date": "2009-10-05", "grade": "8.3"}