{"name": "Spider: Il Segreto di Bryce Manor", "ref": "https://multiplayer.it/recensioni/70891-spider-il-segreto-di-bryce-manor-nella-tela-del-ragno.html", "text": "All things need to be put into perspective. A shoe box may mean little to us, but for an insect it can become a huge empty house, or a big trap from which it is impossible to get out. And the garden in which we like to walk? For a spider it is a vast jungle in which creatures of all kinds confront each other, one hunting the other, to ensure their own survival. In the original Spider: The Secret of Bryce Manor we will find ourselves precisely controlling a tiny spider across twenty-eight different locations. The interesting thing is that an insect's point of view can transform a simple closet, a bathtub or even a hole in the ground into a large stage to explore and in which to find secrets and hidden areas. The game begins immediately, without pleasantries, and we find ourselves catapulted into a world that is in many ways unknown, armed only with our web and forced to weave it in the best way to get food. The objective of the game is to capture the insects found within each level and devour them to restore our supplies of canvas, which in practice also represent our vital energy: when we run out of them, it will only take a few seconds to run into a merciless game over. We must therefore weave wisely and cross at least three filaments to create a web, then wait for some insect to end up trapped inside and reach it to feast. My spider-sense tingles... Halfway between a platform and a puzzle game, Spider: The Secret of Bryce Manor stands out above all for an unprecedented and captivating control system, which constitutes both the best and the worst of the product created by Tiger Style. If on the one hand the fact of being able to move the spider simply by ~indicating~ the direction appears as an immediate and intuitive practice, sometimes this system gives way to annoying ~inaccuracies~ that force us to touch the screen several times before the arachnid understands where we want it to go. On the other hand, no problem for the jumps, which we can ~draw~ freely on the touch screen, nor for the weaving of the cobwebs. In fact, to produce them, just touch the spider and then make a jump: if the distance is not too great, the filament will remain attached to two objects and can be intertwined with others to form a real spider web. The insects that flutter within the locations, and which constitute our prey, move differently depending on the type and can be more or less easy to capture. In fact, they range from butterflies to mosquitoes, the former relatively stupid and the latter too clever (you literally have to push them into a trap), passing through ladybugs and wasps (the latter must be attacked directly with a jump). The challenge is to complete each level in the shortest time possible and eat all the insects present. The resulting score can be compared with that of our friends on Facebook... Eight paws for drawing In short, we have the picture of an original game full of depth. To these two important elements is added a very special graphic, hand-drawn, characterized by a very interesting use of colours. The scenarios are very detailed and it is possible to zoom-out by touching the screen with two fingers, in order to identify any insects still present or find the exit from the stage. Our spider is well drawn and has a convincing animation, it's just a pity that the transition from the lateral position to the ~total~ one (appreciable when the arachnid finds itself traveling a web) is a bit abrupt and seems drawn away . As far as sound is concerned, we have a series of fairly good quality effects accompanied by music that unfortunately has little to do with the general atmosphere: better to replace them with our personal playlist, since it is possible to do so. The tested version is 1.0.1", "date": "2009-10-02", "grade": "8.4"}