{"name": "The real portable driving simulator?", "ref": "https://multiplayer.it/recensioni/71017-gran-turismo-the-real-portable-driving-simulator.html", "text": "When the gestation of a video game takes five or more years, it is legitimate and expected that expectations are high. Even more if this game is part of the Gran Turismo series, one of the most important names in the world of modern electronic entertainment since its debut on PsOne dated 1997. And so while the wait for the fifth chapter will have to last until first months of next year, at least the declination for PSP has finally reached the shelves of shops, as well as the way of digital download for the newborn PSP Go. Five years and (not) hearing them For a whole series of reasons that we will discuss in the course of the article, it is frankly difficult to believe that Polyphony has actually worked on this portable Gran Turismo in a constant and assiduous way since its distant announcement during E3 2004, even if in reality a first glance at the numbers might suggest otherwise. 800 cars and more than 35 tracks (45 with variants), which can also be tackled in reverse, are figures that make an impression and which are often unattainable in automotive titles on living room consoles, let alone on a handheld. And also the playability, and specifically the quality of the driving model, have not been compromised by the ~reduction~; obviously it would be absurd to bother with the refinement seen in GT5 Prologue which runs on infinitely superior hardware, but stopping at the fourth chapter it can be said with good certainty that we are on the same level. This, translated, means that driving Gran Turismo cars is pleasant, demanding and rewarding; the Japanese production remains a simulator, and although it has long since no longer represented the only choice for lovers of this kind of automotive title, the quality of its foundations is undeniable. For this reason, we immediately suggest eliminating all driving aids and setting the simulative behavior of the cars, in order to thus be able to enjoy the large and small qualities of the Polyphony effort; each car has a behavior linked to its precise characteristics, and there are very few cars that look alike on the track. In this sense, it is regrettable that one of the strengths and most important of the series since its debut, i.e. the aesthetic and performance tuning, has been totally eliminated in this chapter. The pleasure of buying a standard car, perhaps used, and modifying its parts from the muffler to the entire engine until it is transformed into a 250 kmh racing car is unfortunately only a faded memory. All that's left are a handful of settings options, such as suspension, brake and aerodynamic balance; a fraction compared to the ~good times~ therefore, and an absence that really weighs heavily within the economy of the product. But the serious thing is that, unfortunately, it is by no means the only one... Multiplayer The multiplayer mode allows up to 4 players to challenge each other locally via ad hoc wi-fi; therefore nothing online, not even for trivial lap times rankings. For those lucky enough and therefore able to have 3 friends with relative PSPs and copies of the game, it is still possible to organize races with a high degree of customization, modifying a whole series of aspects in order to guarantee competitiveness even in the event where driving ability is not the same for everyone. Where is the game? Sometimes it happens to be dumbfounded in front of some game design choices, but in the case of Gran Turismo on PSP it is frankly incomprehensible to find a reason in front of the structure of the game in the single player mode, especially considering the past of the series. Quite simply, there is no content organization, progression or structure whatsoever; there are no championships, challenges, competitions, rankings, or even the slightest semblance of a career to develop. Through a very minimalist menu, you just choose the type of event (time trial, race or drift) and the number of laps, the car to use, and the track on which to race; a bit like the arcade games of many years ago, with the only difference that we are not in an arcade and Gran Turismo is not an arcade. The only development is the unlocking of the various difficulty levels, from D to S, with only the last two managing to represent a minimum challenge for expert users. In reality there are the Driving Challenges, a series of increasingly complicated tests that recall the licenses of the first episodes, but it seems obvious that this is a secondary option which certainly cannot be considered sufficient to support the entire single-player mode . It would therefore have been reasonable to expect more, even more so because, by extension, the only motivation in dealing with events is to earn money for cbuy the machines, which after all, once purchased, cannot be sold. There aren't even cars that give prizes for victories anymore, one of the little goodies that had contributed to making the Polyphony title what was in the heart of all fans. In practice, if it weren't clear yet, in Gran Turismo for PSP everything is available right from the start, reducing any sense of progression to just growing your garage. But even in this case there is something to discuss, in the face of the programmers' decision not to grant access to the entire catalog to the player at any time, but on the contrary, guaranteeing only the purchase of the cars of 5 manufacturers at a time , drawn randomly, for each ~virtual~ day of play. And going back to the races, being able to define electrifying and exciting is really difficult; steps for the only 3 opponents present, evidently a necessary compromise in the face of the limits of the PSP, but the basic artificial intelligence (practically always they limit themselves to following the ideal trajectory) and the lack of aggressiveness often and willingly transform the competitions into solitary buckling towards the finish line after just a few bends, a situation that changes only at higher difficulty levels. So what remains of this Gran Turismo? An excellent technical component without a doubt, superior to any other racing game on portable consoles; 60 fps and excellent polygonal modeling, which becomes superb in the case of car models, are a remarkable achievement that makes ~dated~ hardware still capable of surprising. Faced with so much quality, some missteps are surprising such as for example the horrible internal view, in which you can only see the profile of the car chassis while where the passenger compartment should be there is instead the darkest black, or the textures generally blurry and ill-defined. But they are negligible without too many problems, which is even easier to forget by observing the beauty of the replays, the trademark of the Japanese team. And the driving model undoubtedly remains among the advantages, to be appreciated kilometer after kilometer and which is reduced a little only due to the absence of analog brakes and accelerators. Obviously, any type of aesthetic or technical damage is missing, so collisions and ~bumps~ against barriers and opponents are more than tolerated given the absence of penalties for this type of conduct. Ultimately, summing up, it is clear that we would have expected much more from whoever invented the ~real driving simulator~.", "date": "2009-10-05", "grade": "6.8"}