{"name": "Dead Space Extraction", "ref": "https://multiplayer.it/recensioni/70827-dead-space-extraction-la-notte-dei-morti-spaziali.html", "text": "Rightly received as one of the best new IPs of last videogame season, Dead Space showed off all the trappings to become a successful series, and that's why the announcement of an atypical sequel like Dead Space Extraction left more than someone dumbfounded, if not downright perplexed. The fact that it was a shooter on tracks and that it was published exclusively on Wii made many think that such a decision by EA was exclusively dictated by commercial interests, and that therefore we would have ended up with a title far from the qualitative peaks reached by the 'original. Well, anyone who harbored similar suspicions about Dead Space Extraction can safely prepare to be proved wrong on all fronts. Nightmare in first person Set three weeks before the events narrated in Dead Space, Extraction allows the user to experience firsthand the terrifying events triggered by the discovery of the Mark - an alien artifact endowed with dark powers - on the surface of the Aegis VII colony. The game does a really good job on the narrative front, first of all because it provides a convincing and exciting account of the wave of death that overwhelmed the human outpost and subsequently the Ishimura spaceship: secondly, the developers of Eurocom have well thought out to exploit the perspectives of different characters during the ten stages that make up the adventure, exponentially increasing the involvement and dynamism of the story. The decisive emphasis placed on the storyline is further strengthened by the presence of a comic divided into six chapters (unlockable by continuing in the main mode), which gives further insight into the advent of the Necromorphs and the beginning of the carnage. These elements would be enough to make Dead Space Extraction a practically obligatory purchase for fans of the original survival horror, but fortunately the merits of the EA product also extend to the gaming sector, making it one of the most mature and interesting titles currently available on the Nintendo console . As mentioned, it is an on-rails FPS, in which therefore the user doesn't have to worry about the movement of the character - managed automatically through pre-set itineraries - concentrating exclusively on aiming at enemies and objects on the screen. The development team has managed to maintain numerous points of contact with the first Dead Space without any kind of forcing, amalgamating the various elements into a formula that works great. First of all, in addition to a couple of new entries, the weapons already shouldered by Isaac are back, complete with two fire modes: Plasma Cutter and company fire standard shots if you keep the Remote in a horizontal position, but a simple rotation of the wrist is enough to activate different alternative functions for each tool. The implementation of the Stasis skill is also excellent, which can be activated with the C key, which allows you to slow down the movements of enemies or elements of the scenario and whose use proves to be fundamental especially at more advanced difficulty levels; the A key instead manages another old acquaintance of the series, or that ray of Telekinesis which here is indispensable for collecting objects and power-ups, as well as for solving some small puzzles. All aspects which, combined with others of somewhat lesser importance (such as the excursions in zero gravity, which appear on a couple of occasions) reinforce the idea of how Dead Space Extraction is a real chapter in the franchise, and not a mere spin-off. Dismemberment a go go In a similar context of fidelity to the winning characteristics of the original Dead Space, the fulcrum of the action of the EA product could not be missing, or the practice known as dismemberment: the monstrous Necromorphs must therefore be eliminated by aiming at the amputation of their limbs, a mechanical which - as it is legitimate to imagine - goes perfectly with the setting from FPS on-rails data to Extraction. Beyond the fun inherent in brutalizing enemies in this way, the gameplay benefits from it because, especially on the more advanced difficulty levels, it is necessary to use a certain strategy to deal with the waves of opponents, for example by aiming first for the legs of each to slow them down and then deliver the coup de grace. Dead Space Extraction then benefits from a very well calibrated game rhythm, with frequent shootings alternating with more exploratory and suspenseful sections. In this regard, really wanting to nitpick, Eurocom's work can be contested for the absence of particular twists capable of making the user jump on his seat, but it is really a small thing in proportion to the overall quality of the title. Also why, belowthe technical profile, Dead Space Extraction presents itself as one of the best things ever seen on Wii, starting with a graphic that features extremely accurate polygonal models both as regards the Necromorphs and the humans (moreover characterized by truly remarkable facial animations), embellished by camera movements specifically designed to give on-screen events a dramatic edge. The settings are also excellent, featuring an uncommon level of detail and which are often inspired by those visited by Isaac in the original Dead Space, triggering a pleasant sensation of deja vu. The sound sector should also be rewarded, first of all for a good level dubbing in English (subtitled in Italian) and for a musical accompaniment that effectively punctuates the most agitated sequences. Addictive in its main mode, Dead Space Extraction has the great merit of offering a wide range of incentives not to put the game back on the shelf after the completion of the story, an operation that takes no more than 6-8 hours: first of all, the replay value is stimulated by the presence of three further difficulty levels, some crossroads scattered here and there during the adventure and by the search for all weapon upgrades. Furthermore, the main menu allows you to tackle the Challenge section, made up of ten levels in which you are called to obtain the highest possible score, eliminating various waves of Necromorphs, maximizing your precision and limiting the damage suffered. Add to that the fact that each mode tolerates a convenient drop-in system for playing with a friend, and it will become apparent how Dead Space Extraction represents a rare example of completeness of its kind.", "date": "2009-09-28", "grade": "8.5"}