{"name": "Pi reale della realt", "ref": "https://multiplayer.it/recensioni/70814-fifa-10-piu-reale-della-realta.html", "text": "Version tested: PlayStation 3 If last year FIFA had put the arrow, this year most likely, barring last-minute surprises, there will be the definitive overtaking of the competition. David Rutter's creature is in no uncertain terms the closest thing to football played, put in terms of pixels, polygons and physics applied to the ball. Still using an automotive metaphor, FIFA10 represents for football what the best SimBin titles are for the automotive genre, i.e. a concentrate of pure simulation, which reveals an immoderate passion on the part of the guys from EA Canada for the most beautiful sport in the world . As written several times during the preview, the title was not built from scratch, it was not necessary given the excellent results achieved in the last two years: keeping in mind the feedback from the players, the development team focused more on a improvement and fine-tuning work (the motoring metaphor returns again) of the consolidated mechanics of recent times. In the light of our test, it is possible to say with complete peace of mind that the honesty with which EA got involved has paid off. Football, the real one, is here. Team play Difficult review to make this. There are so many things to write, so many sensations to tell that it's easy to lose the crux of the matter. Before moving on to a cold chronicle of the new modes and tweakings applied to the old ones, we must immediately write the credible, or rather the incredible impression of reality every time we take the field. The rule of advantage has finally been corrected, the physics of the ball has been fixed, which although good in past years, occasionally gave the ball ~cheeky~ trajectories: the most complicated rebounds or the hardest tackles will always produce credible results, the the same can be said for crosses and shots, which never like now are tense, penetrating or ~bullshit~ when they have to be but above all they are the result of the player's body position and balance. Balance gives us the cue to talk about the physicality of the players. Size, indeed proportions matter! Being small, dribbling and fast like Messi, Miccoli and Giovinco doesn't automatically mean having deserted grasslands for long buck on the wing. The defenders, perhaps the classic big and slow centre-backs, use their body a lot, their hands and their shoulders, what they call their trade on TV. In practice, many times you find yourself on the ground in an instant, a turnover, a counterattack, an opponent's goal. All this, in addition to being very nice to look at, translates into a choral action, in an airy maneuver necessary to get to goal. This does not mean that the game is all about passing and ball possession, FIFA 10 gives us maximum freedom of choice and for the first time introduces 360 control in this edition, a real pad-in-hand revolution. In practice, until last year, when changing direction, the player always moved following the cardinal axes of the stick plus the intermediate diagonals. Now, however, the angles between the diagonals and the axes can also be exploited, thus tracing an ideal circle by moving the stick, precisely at 360. In short, it is possible to find unexpected passage areas, which is very useful in the dribbling phase. When you combine this feature with the dozens of moves and abilities available using the right stick (so many that the help screen is more like a match fighting game than a soccer game), you really have the feeling of being in the field. If you then deactivate all the aids, for shooting, for crossing, for passing and so on, you can enjoy the game to its fullest, in which every single action, every touch, every stop is always different from the other, and if you good you can really put the ball anywhere, with an almost instinctive fluidity and simplicity of gestures. Obviously all this has a price, a steeper learning curve than the competition, but with a minimum of patience and dedication you get results to rub your eyes. Not because then you only score overhead goals or because within ten meters you make a tunnel, a sombrero and a rabona, but because you manage to put the ball where you want with a precise cross, or because with a body feint the defender sat down, or better yet, he managed to close a tight phrasing in the area, all like before. The quicker you are to learn to do simple things well, the better it is, the more organized and tactically diligent the team is, the sooner the desired results will arrive. This is FIFA 10, a football game in which despite the fact that there are superstar players and dozens of spectacular moves, theteamwork and not the initiative of the individual. Still speaking of game organization, applause must be given to the way in which artificial intelligence puts eleven into play. The teams are always short, the departments move in concert, tightening where needed and it's not uncommon to see an offensive winger go down in defense and then rocket off again (always not colliding with a rocky and arm-slinging opponent) triggering a counter-attack. In short, a show that from the lowest levels of difficulty puts the player to the whip. Playing you realize that all those critical issues that afflicted the last edition have been resolved. Many had noticed a certain slowness and woodiness in blocking the ball from the chest, this time after a precise throw the ~trapping~ movement as the English say is much more fluid and fast, the same thing goes for the passes before. Mister let me play! As usual, FIFA gives the player the opportunity to test their skills in a series of extremely varied competitions, which, barring licensing problems, allow them to explore the whole world of football, both online and offline. Unfortunately there is no Champions League, but there is a renewed Live Season, which earns the 2.0 suffix, but above all changes have been made to the manager mode, made much more realistic and to the professional one. In the past year, many have complained about a certain little likelihood of the reproduction of the events of the season by choosing to play as a coach (and at the same time as director, president and actual footballer). Now it seems that the transfers are entirely credible, it is difficult to see big names who choose less famous teams just for the money. More generally, and this applies both to those who play and to the opponents, the palmares, the appeal of the club counts much more than the base money. In short, here too Kak will say no to the sheiks' money, waiting for more ~refined~ proposals from Spain. The final impression is that the game takes into account many more factors during the simulation sessions than in the past year, making decidedly more credible and less random decisions. Thanks, as previously written, to the excellent game organization of the team on the pitch, the changes in progress and the study of customized tactics to be applied in the match are much more noticeable, perhaps because here you are in the role of coach . In fact, the game gives us the possibility (which is also present in the other modes) to decide how to put the team on the field, varying numerous values that easily stand up to comparison with those of a real manager. It's a source of great gratification to see how a game takes place decisively because you have chosen to change form, getting the changes right and therefore playing in a different way. Still in terms of tactics, EA should be praised for the inclusion in the arena (in addition to one-on-one and the training match) of the possibility of recording set-piece schemes. It's all quite simple, you choose the area of the field and record the movements of the players on the ground. As in real life, it will be difficult to put into practice what you feel in training during a match, but the fact remains that surprising a human opponent with a complex movement from a corner kick is priceless. Still speaking of set pieces, it is a must to mention the possibility of quickly beating a free-kick, something that often gives rise to devastating counter-attacks. The Live Season 2.0, upon payment of a small subscription fee, gives us the possibility not only to be updated with the real statistics of our players, whether they are injuries, suspensions or cards inflicted, but for the first time it really allows us to play the championship chosen, following its evolution day by day, however taking the field only once for championship matches (a match cannot be repeated in case of defeat), while it is possible to replay friendlies as often as we like. Here too, therefore, the most complete fidelity to real football is pursued, and if on the one hand FIFA allows us to vary the outcome of a match, on the other hand it only requires us to have one possibility to do so. Pro mode has also undergone several changes. To describe it, simply say that in any mode you play (even in the arena), both online and offline, you unlock new features (but also new kits and celebrations), new peculiar traits or improve the previous ones. The increase in basic skills, in short, those present in a player's ~bio~, is not only achieved with good performance, but also as if we were faced with real achievements, unlocking particularresults, about 216 of which some are secret, which also give us the possibility to enable skill moves not immediately available. Furthermore, through the online store it is also possible to buy a temporary increase in one's statistics, a sort of digital doping, useful one imagines when matches of particular importance have to be played. FIFA numbers EA has included 25 championships, almost all with the official license of the local league, and for the most important ones obviously including the ~series A~ but also the ~series B~ (there is even the English third division). Almost all the teams have official kits, while 50 stadiums and 44 balls have been included: Lotto, Adidas, Hummel or EA Sports brands. There are 5 difficulty levels, and to the delight of those who want to customize their gaming experience, the options are many, and touch all sectors of the game, from the speed of the action to the camera, via the interface and the podcast . Alone or with the world? As usual, the FIFA game offer is practically endless. Luckily for us, the game comes to our rescue by adding a nice new next to the novelties of this edition. We have already talked about the offline side, while on the online side there are some important inclusions. Needless to dwell on the standard modes that return here exactly as in the 09 version, including the Football Party, while the pro club championship is completely new, which allows you to show off at a global level, both as a team and as an individual. The Fifa Interactive World Cup is also back, a tournament organized by Fifa itself. Practically Rutter's product covers all the possibilities that could come to mind. More than the complete offline modes, what is striking is the range of options, all devoted to improving one's skills and fame, of which the multiplayer is full. In short, it seems that the real highlight of this game is the professional mode declined in every possible meaning: FIFA 10 brings the single player into a real world community, in which to test one's skills. Those who prefer to play the usual way, on the other hand, have nothing to complain about. Quick matches, manager mode, national and create tournaments guarantee long play sessions, but that's just the tip of Rutter's iceberg. Unfortunately it was not possible to fully verify the goodness of the game's netcode nor verify the application of what was promised given the few players still present on the net today, but considering the very high general quality and the attention always paid by Electronic Arts for all that concerns the ~community~ of a game, it is possible to say that it will be difficult to deny what is written here in retrospect. Playstation 3 trophies FIFA 10 rewards the player with 42 trophies, of which 1 platinum, 3 gold, 10 silver and the rest divided between the bronze ones and some secrets. Trophies involve all aspects of the game, and are not strictly related to results on the pitch. For example, a silver one requires us to win a championship without ever resorting to simulating a match, the same thing when playing in professional mode. The simplest trophies are obtained by accessing some game functions, such as downloading the gameface, while the more demanding ones concern extraordinary achievements both online and offline. Amazement at every step Speaking of graphics, it is difficult not to overdo it with hyperbole. The game simply amazes with the impressive quantity and quality of animations, which simply amaze the player. If, as written at the beginning, the complex of stop/ball/run movements has been revised with very appreciable results, what leaves you speechless is the range of situations reproduced. Players flail out loudly during shoulder-to-shoulder fights, raise their arm to call for a pass or offside, tackle with the calling leg, flail around after jumping until they return to perfect balance, or in the case of the referees, they are often seen making sudden jerks or sudden movements with the body to avoid contact with the ball, which happens a little too often. Even the goalkeepers, who in addition to a general improvement in their performance, with the exception of a sometimes higher than average tendency to concede goals from a lob, often give us spectacular saves or instinctive shots worthy of the best Buffon. In practice, also given the high number of skill moves available, for a long time our maximum level of amazement will never be reached, a sign of an impressive job done by the Electronic Arts graphics.", "date": "2009-09-28", "grade": "9.3"}