{"name": "La rinascita di Contra", "ref": "https://multiplayer.it/recensioni/70573-contra-rebirth-la-rinascita-di-contra.html", "text": "Contra Rebirth is available on the WiiWare service of Nintendo WiiThe existence of a historical memory, stratified into periods and corresponding characteristic styles is proof, if not exactly of the artistic essence of a product, at least of its maturity and its sedimentation in a certain cultural substrate. The ~rebirth~ operation - from the recent Gradius to the previous Mega Man - represents a step of a certain importance in videogame development: they are certainly homages to the classic videogame tradition, but instead of focusing on the simple nostalgic re-enactment - re- editions with awkwardly adapted graphics as often happens in digital delivery - they are proposed as real new chapters perfectly immersed in the climate and style of the original work from which they descend. In a certain sense, therefore, they help to outline the importance of the various historical phases in the videogame evolution, attributing a specific value to them which is evidently still sought today, in defiance of purely technological progress. On the other hand, there has been a long discussion about the impossibility of reproposing some genres that have made the history of videogames in the best possible way today: the shooter and the scrolling fighting game, to name two, types that with the advent of the third dimension have managed to find benefit (if not from an aesthetic point of view, with mixed results) by finding their very meaning deeply linked to a certain graphic representation and, for better or worse, to a certain way of enjoying games that undoubtedly is no longer that of today. So here is the ideal solution to resume in 2009 a series like Contra, which more than 20 years later fully falls within the definition of ~vintage~: build a new chapter starting from the graphic representation and the game setting that characterized the chapters of the bitmap era, from 8 to 16-bit. The Ancient War The matter is as simple as pulling a trigger: the aliens are back on Earth, with their usual warlike intentions and repulsive appearance. It takes practical people to handle the situation, possibly someone experienced in dealing with the enemy (or rather, in dealing with THE enemy): someone like Bill Rizer, the pseudo-Schwarzenegger of the earlier chapters. Rizer is therefore awakened from a sort of hibernation and joined by the new fighter Yaggyu, then - without even giving him time to remember exactly who he is and what he did in the past - thrown into the rain of bullets, laser beams and war machines the world has become: the story, if it can be defined as such, is told through rather well-designed cut-scenes. Obviously, in full 80's spirit, the action within the game is pushed to a fever pitch: gigantic bullets, missiles, shot colours, huge bosses follow each other non-stop on the screen. There is no time to dwell on the details - now so important in modern games - you need to run, jump and shoot relentlessly in order to survive, in the typical precarious environment of constant hyper-real danger that once characterized almost every video game. The possible actions are few, there is nothing accessory, while the only minimally strategic elements are the choice of the weapon to be used (only two can be equipped at a time and alternated at will) and learning the attack patterns of the bosses to defeat. The latter deserve a special mention: as per tradition, they constitute the most spectacular moments of the Konami game, huge and extravagant. As true protagonists of the levels, they appear on the screen several times until the final showdown. The gameplay therefore precisely reproduces the classic gaming experience, which is good, especially for fans of the series and ~hardcore~ players in general, to whom this product seems naturally intended. You have to know what to expect when approaching the game: the user accustomed to more modern productions could find himself uncomfortable, both in front of the graphic creation and, above all, in the fast pace and the high level of difficulty that characterizes it, otherwise the frustration may arrive soon. Contra Rebirth is therefore a product suitable for the nostalgic, and for those who want a dose of action at the highest levels, without frills or aesthetics or much less content, which determines both its strong point and its limit, not being clearly appreciated by all equally. Like old times Another element that recalls the gaming industry of the past and the characteristic style of the action games of the 8 and 16-bit era is the relative brevity of the game. 5 levels, with the possibility of exploitsre infinite ~continue~, they are not really many, and they bring back to the foreground the essence of a low-cost product of this Contra Rebirth, still a title planned and developed specifically for the digital delivery market. The high level of difficulty forces you to play the levels many times before solving them, especially in the modes above the ~easy~, in which the loss of a ~life~ corresponds to a drastic reduction of the arsenal accumulated in the game, therefore the challenge is quite long-lasting, but the levels are still few. The technical realization is the element that most characterizes this particular Konami product: both the graphics and the sound are evident homages to the 2D video games of the 16-bit era and therefore present themselves with all their positive and negative evocative power. The graphics are very colourful, sometimes deliberately awkward and pixellated as befits the classic bitmap, in a feast of sprites and graphic effects that fully recall the Super Nintendo atmosphere: in some cases the rotation effects and change of dimension seem to directly recall the famous Mode 7 of the historic console. The scenarios contain references and elements already present in the previous chapters of the series, but for the most part they are completely new materials, demonstrating the care put into this game by the developers. Even the soundtrack fits perfectly into the general atmosphere, proposing remixed versions of the famous tracks belonging to the series, with a careful choice of samples, instruments, sounds and audio effects that seem to come directly from the 80s and 90s.", "date": "2009-09-18", "grade": "8.0"}