{"name": "Il calcio reale dell'iPhone", "ref": "https://multiplayer.it/recensioni/70705-real-football-2010-il-calcio-reale-delliphone.html", "text": "To date the number one football game on mobiles had the tag Gameloft; in fact, the Real Football series has been able over the years to put a considerable advantage between itself and its opponents, thus allowing it to make a name and fame sufficient to decree its success even on the occasion of its debut on the iPhone with version 09. After a few months, however, the situation is less favorable to the French house, above all in the face of the renewed combativeness of the competition which sees above all in the imminent Fifa 10 of Electronic Arts the most serious contender for the throne. The season begins Like any good self-respecting sports title, Real Football 2010 also aims at evolution rather than revolution compared to the previous edition. However, this does not mean that Gameloft's latest production is stingy with novelties, far from it; if there is one aspect in which frankly there is very little to criticize it is precisely that of the contents. Undoubtedly the most interesting is to be found in the online multiplayer mode, which joins the local ones via wi-fi or bluetooth, effectively proposing a solution similar to that of the Live Arcade or PSN services; after creating an account on ~Gameloft Live!~ through a rapid procedure it is possible to face challenges against human opponents both for their own sake and for classified ones. Unfortunately, despite the good premises, at the time of our review all attempts to play a few games online collided in the face of a more or less marked but always present lag. The more than concrete hope is that the problem is related to the debut of the service or to an overload of the servers, because otherwise this method would be effectively unusable. The list of contents then proceeds with 245 teams divided between national teams and belonging to 8 championships; the presence of only the FIFPro license allowed to insert only the real names of the players, while for the clubs we are faced with Piedmont instead of Juve, Lombardy for Inter, Milan for AC Milan, Madrid for Real and so on . Of course, there are also no coats of arms, official flags, sponsors and uniforms; and in the same way the squads are not updated perfectly, with Ibra at Barcelona but Cannavaro still at Real. For this last aspect, however, there will certainly be a correction soon thanks to the integrated option, with which it will be possible to keep the athlete database updated on the basis of the most recent transfers. There are also numerous game modes, which in addition to the classic championships and cups see the addition of ~Enter the Legend~, in which to control a single player during his career, and ~Season Club Master~ which also allows you to manage the of the transfer market by buying and selling players. The picture is completed by 14 stadiums (again unofficial), the possibility of uploading and voting for replays on youtube, and an integrated rss feed with updates on the real results of matches in the main championships. Obviously, however, the most important aspect is that linked to the gameplay, and on this juncture we can be satisfied up to a certain point; on the positive side there is undoubtedly the inclusion of a control via virtual analog stick, more precise and reliable than the digital cross of the 09 version. However, the improvements in the mechanics are more generally really marginal, and the result is therefore similar to that of the debut on the Apple platform; a very arcade soccer game, simple, but quite wooden in terms of player movements and not very reactive in the controls. The matches flow away in a pleasant way, but there is no doubt that there is ample room for improvement. A similar argument can be made for the graphic component which, although defined and with good textures, lacks a little more than sufficient polygonal complexity and rigid and limited animations. The tested version is 1.0.9", "date": "2009-09-23", "grade": "7.4"}