{"name": "Grazie", "ref": "https://multiplayer.it/recensioni/70655-blood-bowl-grazie-chuck-norris.html", "text": "Yet another videogame transport of a clearly successful board game, especially beyond the Alps, Blood Bowl, which has already been widely discussed during the preview, promises to reconstruct the original system in such a way as to be adored by historical enthusiasts as much as being able to open up to both virtual and non-virtual newcomers to the Games Workshop product. Humans, Elves, Lizardmen, Dwarves, Orcs and Skaven (ratmen) battle it out with no holds barred in stadiums and gaming leagues. Players are sold, new uniforms are bought (thicker), new training sessions are requested, stars are born, others set, some die. Stadium violence Blood Bowl offers several modes for the single game, useful, in the end, to train for the much more convincing multiplayer aspect of the title. Whether you play a points tournament or a ~friendly~ match, you immediately get a taste of the good work done by the developers to recreate the atmospheres of the original game: the three-dimensional models are typically fantasy and parodistic at the same time (it's a scene to see a paladin in armor running with a ball in his hand dodging a troll with a baseball cap), completely in line with the miniatures of the game, and the rules are reproduced with the utmost fidelity and respect for the paper ones, at least in the turn-based mode. Yes, because Blood Bowl is, first of all, a turn-based game: a suitably ~grid~ field and players like pawns, who are given a series of actions to take (throw the ball, tackle, run) to then start the turn to enjoy the unfolding action via a freely rotatable and zoomable camera to your liking. Winning matches means earning money, both for players and for non-canonical ~game tools~ such as studded gloves, armor and hooked brass knuckles. Of course, with such tools in the hands (and paws) of burly orcs, hardy dwarves, and hissing lizardmen, they can cause some pretty serious injury, if not death, to some unfortunate champion. Patience, death is an acceptable eventuality and the world is full of promising young Blood Bowl players. For those who survive, however, there is an excellent system of skill points that can be used to enhance the characteristics of the veterans of the stadiums, in order to shape their own personal fantasy Real Madrid, and replay it later in multiplayer, simply by transporting it from the saved file to the game servers . There are also the various ~random events~ of the board game, established by the roll of a virtual dice at the bottom of the screen: turnovers, stumbles, throwing objects from the stands and even pitch invasions are common in Blood Bowl. There is also a new mode, in real time, which in theory should serve to bring those who don't know the tabletop original closer to the title: although the idea of eliminating grids and rounds in favor of direct player control (among manageable in just a few clicks of the mouse) is potentially good, the realization leaves a bitter taste in the mouth, especially when confronted with an artificial intelligence that turns out to be incapable of producing a significant challenge to the player, with simplistic tactics that they limit themselves to beating as many enemy players as possible without taking into account that the goal is to conquer the opponent's goal and not cover the ground with corpses while an opponent runs quietly towards the opposite side of the field with the ball in hand. Internet arenas Surely Blood Bowl is a product designed above all for multi-player challenges and it is probably what fans of the game have been waiting for for a long time. The internet championships offer different leagues and degrees of challenge as well as obviously a much more important development of the team and the players, no longer linked to the mere clash with the PC, but thrown into a world ranking that is published and updated continuously on the same server. The characterization of the various races is undoubtedly useful for the success of the multiplayer, which goes well beyond the three-dimensional models of the players, giving each one its own peculiar characteristic and its own weaknesses and strengths (dwarves are very resistant but slow, elves at they run and have high agility, orcs are blacksmiths, lizards and humans are a good mix of everything, rats are fast and sneaky). Lights at the San Siro Graphically and technically speaking, not much can be said about Blood Bowl: the stadiums are characterized in a rather apt way, whether they are dug into the depths of the mountains of the dwarves, obtained from the lustral jungle or built in the midst of human cities. The three-dimensional models, both of the players and of the public, maintain good visibility das a whole, cartoony at the right point and goliardic as one would expect from such a product, although at high zoom levels one notices a certain repetitiveness of the textures and a paucity of details that is no longer so widespread today. The animations of the players are good, those of the cheerleaders and off-field musicians a bit jerky and repetitive. A special mention goes to the referee goblin: big nose and ears, striped shirt, crooked hat and whistle: the true legend of this game. The accompanying sounds are nice and the voices of the commentators are excellent, with the other a good choice of jokes and comments, unfortunately dubbed only in English.", "date": "2009-09-22", "grade": "7.0"}