{"name": "Avete accordato la chitarra?", "ref": "https://multiplayer.it/recensioni/70532-guitar-hero-5-avete-accordato-la-chitarra.html", "text": "Tested Version: PlayStation 3 Eighty-five songs, fourteen clubs and five characters to unlock: Guitar Hero 5 takes its nature of ~more of the same~ seriously and, in the absence of substantial novelties in the gameplay (which for better or worse has remained unchanged from the third episode), tries to amaze with an ever so intuitive and functional multiplayer management. It was said of this title that it was the perfect party game, and rightly so: it is possible to create a full-bodied playlist and put it on a loop, perhaps during a party, and give anyone the opportunity to try their hand at a song ~on the fly~, instrument in hand, play for a while and then pass the ball to someone else. All counting on an extraordinary flexibility, given that it is not mandatory to compose a band made up of vocals, guitar, bass and drums, but you can ~mix~ the instruments as we please to create unusual combinations: vocal groups, double drums or guitar triples, quartets... And when people or instruments are missing, just press a button to access the online and immediately find shrewd and motivated players, who can tackle the lineup each according to a different level of difficulty. The band thus formed contributes to the success of the execution thanks to an interesting ~compensation~ system, which allows the most capable musicians to remedy the mistakes of those who may be beginners with the series. However, there are also competitive modes, always in multiplayer, for up to four players locally or eight players online: there is one in which the winner is the one who simply gets the best degree of accuracy, the ~last man standing~ in which of the song the less skilled player is eliminated from time to time, the ~do-or-die~ which penalizes those who miss three consecutive notes, the classic ~face to face~ and more. Playstation 3 trophies There are fifty trophies that the game makes available, five of which are secret. Some must be unlocked by focusing on the new features introduced with this episode, therefore completing the songs using four basses, four voices or four drums. Others keep to the classic and are obtained by completing one hundred songs in the ~quick game~ mode, obtaining five stars with certain songs, successfully engaging in challenges or playing online with seven other people but all playing the same instrument. There is no shortage of trophies obtainable with the completion of the career, which are based on the number of stars collected and finally even composing your own songs with the editor yields some precious trophies. Fiammetta will join the band... The ~career~ mode of Guitar Hero 5 sees us perform in fourteen venues, each characterized by an increasingly full-bodied and complex lineup. Completing the songs successfully allows us to earn a certain number of stars and unlock the next location, but there are a whole series of interesting extras to go along with it. Firstly, the game includes five secret characters (Matt Bellamy of Muse, Shirley Manson of Garbage, Kurt Cobain of Nirvana, Santana and Johnny Cash) who are obtained by successfully completing the related songs; secondly, the playlist that characterizes each venue is enriched by bonus challenges that must be faced in a certain way, with a particular instrument or by paying attention to certain aspects of the song. It is certainly a further incentive to perfect one's performances, a central element in Guitar Hero from the very beginning. The guitar bundled with the game is, as usual, light and comfortable to wear, made entirely of plastic but well finished, characterized by about 25% smaller dimensions than a real electric guitar. The five standard buttons on the keyboard are followed by a touch pad that can be used for slides but also to simply play the notes, acting with the index finger as if we were performing ~tapping~ or with the thumb if we want to play the bass in slap. The reactivity of this touch pad is immediate and the feeling is very different compared to the device for picking, which for its part gives our inputs a more ~clear~ and physical character. Guitarists may find it easier to grip the device between thumb and forefinger, simulating downward strum, while whoever plays the bass will be able to verify that the upward stroke is less and therefore lends itself well to ~upbeat~ strokes carried with the index and middle fingers. Surely it is a touch of class that is anything but casual. The single potentiometer on the guitar is used to activate the controller but hides within it a regular four-way d-pad, which you can use to navigate frto the menus together with the ~pick~. A little further up we find the vibrato arm, which performs the dual role of adding panache to long notes as well as filling up the Star Power bar more quickly. The latter can be activated by placing the guitar vertically or by pressing the button on the bridge of the instrument, and in multiplayer mode it will no longer be shared among the various players: everyone can use it as they please. The battle of the planets Finding ourselves faced with the task of having to review an important title like Guitar Hero 5, we thought we'd ask an expert of the series (who wished to remain anonymous but whom we sincerely thank - thanks Judge) what are the positive and negative aspects of the title Neversoft, especially in comparison with Rock Band 2. Firstly, GH5 represents a bit of a return to the classic, it does not innovate like the World Tour episode and enjoys a first-rate tracklist, which sees the inclusion of bands like Dire Straits (when an episode dedicated entirely to them?), the Smashing Pumpkins and the combination Queen / Bowie (with a thrilling performance of ~Under Pressure~). It is difficult to establish which is the best game between Guitar Hero and Rock Band based only on the songs, given that new ones are cyclically released through DLC and in the end you will be able to find the same songs both in the Neversoft product and in the Harmonix one. Certainly the differences lie in the way in which the pieces are played, in the quality of the scores but above all in the precision required of the player: from this point of view, GH has always appeared more permissive. It should also be noted that while Rock Band 2 allows the almost complete import of the tracklist of the first episode, Guitar Hero 5 limits this feature to less than half of the songs present in Guitar Hero: World Tour. ...or will the band enter Fiammetta? During the career or within any other mode it is possible to switch instruments between guitar and bass on the fly, by pressing a single button, and thus appreciate the variety of ~scores~ which, as it is easy to imagine, change radically depending on the selected difficulty level. Playing songs at the ~easy~ difficulty level means acting only on the first three keys of the instrument, and it is clear that our inputs will end up producing phrases rather than single notes to respect the instrumental parts of the song. Switching to the ~medium~ level is a must as soon as you become familiar with the keyboard: each finger should be dedicated to a button, the correspondence between the strokes that scroll on the screen and the sound that comes out of the speakers already becomes more realistic and the level of satisfaction at the end of the execution rises hand in hand. From the ~difficult~ level to go up it is essential to change hand position as needed (keeping the index finger ready to act on both the first and second fret) and there is a practically real correspondence between the number of inputs and the notes that are played from the tool. It is very difficult, in this situation, to obtain respectable results if not with a good dose of practice. In any case, those who really play the guitar or bass do not expect to be able to make the phenomenon with Guitar Hero 5 from the first game: even with above-average finger mobility and coordination, you have to deal with completely different from what you are used to. We also got to try the game with the microphone, and the feeling is that despite being fun it doesn't reach the levels obtainable by playing an instrument. In particular, the detection of the notes appears imperfect, and to use the Star Power you still need to keep a Dual Shock 3 close at hand. Obviously we also did not miss a test armed with a battery. Unlike the guitar, there is no real bundle and therefore it is necessary to purchase or use the Guitar Hero: World Tour instrument. That is a kit consisting of three drums, a pedal and two cymbals (with the old style, i.e. triangular). Unlike the guitar, with the drums this Guitar Hero 5, but more generally the whole series, tends dangerously close to reality, given that as the difficulty increases, the mobility and autonomy of the limbs required to play the songs adequately, it is practically the same necessary for those who want to perform with real drums (obviously except for the number of pieces that make up the kit). Among other things, the drums are able to respond in a realistic way to stresses of different intensities and also to shots with different speeds. All this brings us back to that ~dangerously~ used just above: who hasalways wanted to play the drums but for reasons of space and noise he never had the opportunity to do so, he will find in Guitar Hero 5 a game where he can spend, without realizing it, dozens of hours trying to improve his rolls or counter tempos. I want to write a new piece! One of the most interesting features of Guitar Hero 5 is represented by the GH Studio, where we can give vent to our creativity in various ways. First of all, the GHMix allows us to build songs on five tracks using a rich library of sounds accompanied by patterns, drum kits, and virtual processors. Then there is the GHJam, where we can record four instruments on a backing track and therefore play the parts directly without ~building~ them. Finally, GHTunes allows us to consolidate an entire album with our songs and upload it online to share it with other players. Sound Check Orienting yourself in the main menu of Guitar Hero 5 is not difficult, despite the amount of options and modes available. After the eventual tutorial for novices and some quick games, the ~Create Your Rockstar~ editor is certainly worth a spin. This is to avoid seeing our favorite songs sung by a guy with a punk crest, but also and above all to realize the progress made by the Neversoft product from this point of view. The classic types that serve as the basis for the characters are available (punk, rock, goth, metal, pop...), each with a good number of alternatives in terms of clothing (top, bottom, shoes) and accessories (hats, piercings, tattoos and so on). It is possible to make our rock star more or less tall and more or less corpulent, choose the haircut that best suits his features and skin tone, then go on to adjust the facial features in detail (shape and size of the eyes, nose, mouth, ears...) to get as close as possible to the face we have in mind (whether it's ours, that of a friend or a famous musician). It is therefore really simple and intuitive to create a complete band in just a few minutes, complete with the logo and name of the group that will camp on stage while we play. It's normal that in a product like Guitar Hero 5 the quality of the graphics isn't in first place in order of importance, however Neversoft has managed to do a good job and build convincing scenarios within which to hold our concerts. The premises appear quite diversified, full of spectacular light effects and with an enthusiastic public (although the ~blur~ has been a bit exaggerated). The animations of the band are discreet, the act of playing the instruments appears well represented but the good variety of movements only changes from song to song, or if we always play the same song we will always see the same animations (except for the final exultation). The keyboard is readable as usual, a pity only for the ~flames~ that indicate the correct execution of a note, characterized by an animation that restarts with each hit instead of continuing in a fluid way, perhaps ~flaring up~. As far as the sound is concerned, there is little to say: apart from the volume level, mysteriously low, the songs are heard and played like a pleasure, with the various instrumental parts that can also be modulated thanks to the use of the lever and the touchpad.", "date": "2009-09-16", "grade": "8.7"}