{"name": "C' una nuova eroina in citt", "ref": "https://multiplayer.it/recensioni/70510-wet-ce-una-nuova-eroina-in-citta.html", "text": "Tested version: PlayStation 3 WET is a weird game. What went through the minds of its designers is a bit difficult to say. Mind you, it doesn't take much to copy other people's ideas and put them together... because that's what the developers of Artificial Mind and Movement did. In WET you will find a little No More Heroes and a little Prince of Persia mixed with a pinch of Tomb Raider, a drop of Madworld and three tablespoons of Max Payne, just to please. Rubi Malone, the protagonist, is a sort of hired killer and runs around with two pistols on her hips and a nice katana on her back, a bit like Uma Thurman in Kill Bill. Rubi is hired to recover a literally stolen heart and return it to a mobster to be transplanted. We don't know anything about her, only that she's good at shooting, slashing and jumping. Is that enough? All wet At the beginning of the game, a message informs us that the word WET derives from Wetwork, a term which meant dirty business, soaked in blood, during the war. And there is actually plenty of blood in WET: the prologue makes us understand what we will be facing for the rest of the game, i.e. shootings in industrial quantities, quick time events and frenetic chases. And literally the whole game is there. In fact, the true story begins a year after the events of the prologue, when the man who saved Rubi with a transplanted heart hires her to bring his degenerate son back into line. Obviously this request will have unexpected and sincerely incomprehensible implications: proposed as an 80s action film, the plot of WET leaks from all sides, explains nothing about the various characters and even ends in the trunk. The important thing seems to be just to kill as many people as possible and do it in style. The only vaguely original idea in WET is in fact the slow-motion effect that activates every time Rubi shoots while jumping or sliding: in these situations Rubi automatically aims at the closest target with a pistol, while the player can fire with the other on a second target targeted by stick. Learning to play WET is very simple, the design of the various locations is also designed so that Rubi can take advantage of specific holds, obstacles or passages during his murderous rampage. The more enemies you defeat while the game is slowed down, the more Rubi's style points increase, the faster her life energy recharges, and the more upgrades you can buy between stages: these upgrades include new abilities such as flying attacks with the sword or slow fire while hanging as well as the improvement of Rubi's weapons which include, in addition to the guns and the sword already mentioned, also a pair of shotguns, two machine guns and two crossbows light. That's all. At this point WET becomes a hyper-frantic action-game in which the player is mainly involved in three types of challenges: the total and indiscriminate elimination of enemies, the destruction of some switches in rooms called ~arenas~ and long sequences a bit ' shooter and a bit qte in which the wrong press of a key means premature death. The situations are quite varied and unpredictable, but the game does nothing but repeat them by changing the setting for the entire eight hours required to complete the adventure... Halfway through the game, the initial positive impression finally gives way to boredom and frustration. The video review He shots me down, bang bang WET also thrives on technical ups and downs, with sporadic but notable frame rate dips. The 3D engine moves numerous polygonal models at the same time, unfortunately crudely built, the best of which is undoubtedly that of Rubi, animated very well and decidedly fluid and realistic in its movements. Her enemies, on the other hand, all look a bit alike both in terms of behavior and appearance: they don't act strategically, but they launch themselves against our anti-heroine to be ruthlessly slaughtered and give her even more points. The real threat, as the levels pass, in fact becomes their firepower, easily avoidable by hopping like kangaroos left and right. Unfortunately, the settings drop in quality visibly: the stage of the English mansion, for example, is splendid, while the last levels offer only truly anonymous warehouses and indoor premises. However, the detail remains quite sufficient, despite the mediocre quality of the textures that concern both the environment and the characters. After playing the likes of Uncharted one would expect more and WET at times feels like a game from a generation ago. At the same time, the idea, indeed original, of applying a filter that makes the whole game similar to a deteriorated cinematographic film deserves applause.eighties cunt. On the other hand, the ~bloodbath~ that characterizes some levels is a little less original, completely red apart from the models of Rubi and her enemies, halfway between Madworld and No More Heroes with a touch of Tarantino. The advertising breaks between one level and another and the visual effects adopted help to increase this cinematic feeling and, we fear, to try to hide graphic uncertainties which however end up showing themselves anyway. At least the rocking soundtrack, borrowed directly from more or less famous musical groups, proves to be apt and brain-destroying enough; the dubbing, completely in Italian, is well executed even if a little too prone to vulgarity which in some cases is completely gratuitous.", "date": "2009-09-15", "grade": "6.5"}