{"name": "Le fuoriserie si danno battaglia", "ref": "https://multiplayer.it/recensioni/70443-supercar-challenge-le-fuoriserie-si-danno-battaglia.html", "text": "Supercar Challenge is a brave product, without a doubt. It's brave because it agrees to compete against the likes of DIRT 2, Need for Speed: SHIFT and the long-awaited Gran Turismo 5, which have rewritten the terms of evaluation when it comes to graphics in racing games. It's brave because it challenges the players to compete right from the start with racing cars which, despite traction control, ABS and all the electronics in the world, offer a driving experience rougher than sandpaper. It is courageous because it builds its appeal on a learning curve so steep that it seems vertical, with opponents who knock us out and lose us at the first uncertainty, and this already from the ~beginner~ level. Do you mind if we analyze these elements one at a time? After all, the article has just begun and there is plenty of space. Fasten your seat belts It took a while, but today we are in the midst of a technical revolution that has taken the racing game genre to unprecedented levels of visual realism. GT5 will run at a fixed 60fps in 1080p, at least on paper, and its competitors must somehow adjust and fight back, or else resign themselves to defeat. In the specific case of Supercar Challenge, we notice an all in all unjustified ostentation (see the start screen, seasoned with the epic background of ~O Fortuna~ set to music by Carl Orff) of polygonal models which, while faithfully reproducing the cars, appear flat and unconvincing. The game features a car trading system that encourages us to achieve the best possible results in races to earn money. The forty-four custom-built cars available can be tested (upon payment of a few hundred credits) before purchase, and once placed in the garage you can customize its livery thanks to a combination of paints and stickers. The developers have inserted the beauty of seven views, insisting in particular on the internal ones (there are four), which appear more ~raised~ than usual and therefore allow us to look at the road and what surrounds it in a very similar way to how it happens in reality. The interiors of the cars are well done and equipped with a decent level of detail. The game features a damage system that acts both aesthetically and practically, even if the cars appear decidedly more resistant than one would expect: we had to launch ourselves several times against the protections, at very high speed, to get the detachment of body parts. Taking bumps results in malfunctions of various types, but in fact it is almost impossible to finish the race prematurely because you are unable to continue. With the opponents it is often and willingly to fight over the counter, but it is rare that a spectacular accident occurs. The technical sector, in its entirety, appears discreet but unable to compete at high levels. There are twenty-two real circuits to race on, far from few, and satellite footage has been used to create them, able to provide not only a faithful picture of the hairpin bends and straights, but also a reproduction of the valleys to make driving even more realistic. Once on the track, the care taken in the design of the track and its immediate boundaries is certainly noticeable, but just look a few meters further to realize that the outline is certainly not that of great occasions: grandstands full of colored balls, none person or vehicle beyond the fences, vegetation often dull and poorly defined, clouds that ~distort~ when the view moves, lighting system that does not make you cry for a miracle, average atmospheric effects. If all this moved at 60 frames per second, that would be one thing, but the graphics engine never exceeds thirty frames per second and moreover often suffers from very visible drops. The engine roar varies by car and feels good, but there's little else to back up the System 3 title audio. Natural selection The long and frequent loads that separate one screen from the other perhaps anticipate a message: Supercar Challenge asks us to be patient, and it does so because of the three cars initially available (the Ferrari Enzo, the Pagani Zonda F and the Aston Martin DBR9) only one seems to have a minimum of road holding and doesn't force us to stop before tackling the bends. The discussion extends to all the custom-built cars present in the game, and in general the rule according to which a less powerful vehicle is more easily manageable than a monster with almost a thousand horses is valid. Which could also be there, were it not for the fact that in this way tackling a race and bringing it tosuccessful completion turns into an absurdly complicated undertaking. Sure, there are tons of settings we can change before setting off (car height, suspension stiffness or even camber of the tyres) to avoid finishing long at each hairpin, and there are also the very important electronic aids (which are also adjustable and can be deactivated if necessary), but when you always qualify last and it is impossible to catch up with your opponents in the first positions, then it is clear that something went wrong while balancing the difficulty of the game. There are two proofs in support of this thesis: one is the just mentioned difficulty in controlling the car, especially when cornering and even when the clear indication of the ideal trajectory appears on the track; the other is the infallibility of the competing pilots, who even if equipped with a poor AI (if you place yourself in front of them covering the ideal trajectory they don't understand that it would be enough to turn to overtake you) they never make a mistake and therefore make any comeback impossible do not start from crazy management of braking distances (almost impossible to implement, given the problems in road holding). The control system is highly customizable and allows us to steer with the left analog stick or with the d-pad, while acceleration can be managed in three different ways: using the secondary backbones, using the X and Square buttons or by moving the stick right analog forward and reverse. The possibility of changing gears not only with the primary backbones but also with the aforementioned right stick is very nice. Unfortunately, the left stick suffers from the usual lack of sensitivity, which in this specific case makes it very difficult to keep the car on the ideal line during cornering. Furthermore, wanting to be picky, the response to the stresses of the pad is not as immediate as it should be. Playstation 3 trophies There are thirty-seven trophies made available by Supercar Challenge. The twenty-two bronze trophies are unlocked by completing the most varied tasks: winning the first offline and online race, completing a perfect race, demolishing a car, not touching the brake for at least fifteen seconds, etc. The nine silver trophies address similar issues, but are generally more difficult to unlock: you have to complete the stages in the career mode, win a wet race without taking damage, climb from last to first in a race, etc. The five gold trophies imply the completion of individual modes, while finally the platinum trophy is unlocked when we have achieved everything there was to achieve in the game. At the end We understood that Supercar Challenge is a racing game that is selective by nature and decidedly atypical, which immediately puts us at the wheel of racing cars that we usually see in other titles only after having worked our way up on everyday small cars and sedans. In terms of the available modes, however, the System 3 product has a classic and quite substantial approach, able to satisfy everyone even if with due reservations. The ~challenge mode~, the richest and most demanding, sees us face five levels consisting of an increasing number of races and set in various parts of the world. Each time we will have to try our hand at a flying qualifying lap, and then measure ourselves against the other riders in search of the best possible placement. The quality of the results obtained at the end of each event will translate into a variable number of credits, to be spent on the purchase of new cars. In addition to the usual ~quick race~, ~time challenge~ and ~tutorial~ modes, we find a ~tournament~ mode which in the case of Supercar Challenge has been set up as a series of challenges that are gradually unlocked and which require the achievement of certain goals to be overcome. Then there is the ~arcade competition~, a series of variable competitions according to the level of difficulty (beginner, intermediate, expert, legend) and organized as small tournaments. The multiplayer mode crowns it all, available both locally via LAN and online, which allows us to create or participate in games for up to sixteen players. The search function includes a graphical evaluation of the ping, so we can select the host based on the goodness of the connection, even if we then noticed lag even in perfect conditions on paper. The usual problem of the many people without a headset remains, practically the majority, and it's a shame because the voice chat is handled well by the game and works automatically, without requiring a keystroke.", "date": "2009-09-14", "grade": "7.0"}