{"name": "Bentornati per una breve visita nel magico mondo di Alma!", "ref": "https://multiplayer.it/recensioni/70413-fear-2-project-origin-reborn-bentornati-per-una-breve-visita-nel-magico-mondo-di-alma.html", "text": "Tested version: A few months after the release of the base game, the first downloadable content for F.E.A.R. 2: Project Origin (of which we invite you to read our review for more information), with the subtitle Reborn, which at a price of around eight euros (the price is similar for all versions) tries to revive interest in the sequel of one of the most acclaimed first-person shooters and discussed the past few years. The plot is quite simple: in the role of a replicant you have to follow the orders of an authoritative and mysterious voice who will guide the nameless protagonist to the center of an explosion crater. Who will ever be waiting for us? Big Brother tryouts? As end users of the game, it's up to us to find out! In reality it doesn't take long, in the sense that with an hour and a half, two hours at the most, you arrive in complete tranquility at the end of the five chapters that make up Reborn, also because you don't encounter particularly difficult situations and the maps they are terribly linear, complete with weapons and energy supply checkpoints that can be found almost after each fight and not at all disguised with some narrative or environmental trick. You got it right, walking around the few maps you can find abandoned weapons as if they were cigarette butts. Actually the general impression given by this pill of F.E.A.R. 2 is to be more of a kind of paid map collage, not too well done, than a real expansion. It almost seems like a summary that tries to compress all the playful contents of the basic title into a very small space: you start on board the combat robot, you go on for about twenty minutes (the best part of the package), then you proceed on foot till the end battling old enemies and collecting old weapons. No Alma, no parties Obviously there is also Alma, the caterpillar girl, but honestly she makes a poor impression limiting herself to a few appearances of circumstance, almost as if her presence were an inevitable necessity to remind the user which product he is playing. So don't expect any revelations about her life or to get her phone number to invite her to dinner. In reality, apart from a very predictable final twist, there is little to get excited about on a narrative level. The only gimmick worthy of mention are the objectives to be achieved derived directly from the slave status of the protagonist and of which we won't tell you anything else so as not to spoil Reborn's only micro surprise. Instead, all those who criticized the artificial intelligence of F.E.A.R.'s enemies will be delighted. 2 because they will be able to continue posting their arrows on the forums, since there is no sign of progress: the enemy soldiers continue to attack in a predictable way and run towards our bullets, the invisible soldiers continue to be unable to attack by surprise , snipers still have the reaction times of a fossil buried under fifty meters of earth, and so on. Nothing new under the sun, just as there is nothing new from a technical point of view, a rather predictable fact and certainly not a negative given that some environments are very beautiful in construction, even if made up of completely recycled elements. The only noteworthy moment is the final battle which, although not too spectacular, manages to put you in difficulty if you don't face it loaded with medkits and ammunition. Too bad that alone is not enough to revive the offer, overall little more than mediocre.", "date": "2009-09-14", "grade": "5.0"}