{"name": "Championship Manager 2010", "ref": "https://multiplayer.it/recensioni/70356-scudetto-2010-palla-al-centro.html", "text": "When Sports Interactive left Eidos in 2004, he took his creature with him, leaving the English publisher with nothing but a brand in hand: Championship Manager. While the original title changed its name and owner becoming the now equally famous Football Manager, Eidos did not lose heart by entrusting the task of recreating Championship Manager from scratch to the newly formed Beautiful Game Studios. Certainly a great opportunity for the software house which however found itself facing a demanding test in the shadow of an opponent who had been chewing football for almost fifteen years. The first appearances of the new Championship Manager certainly didn't make people cry for a miracle. An evidently immature product and incomparable with the granite Football Manager. Some additions, such as the introduction of the Prozone performance analysis tool, have tickled the palate of football management fans who have not managed to digest cumbersome, too spartan and poorly balanced titles. Finally came the delay that saw the 2009 edition become Championship Manager 2010. An event that has raised several doubts about the future of the series. Yet, apparently, precisely that delay allowed the guys from Beautiful Game Studios to recover what seemed to be an unbridgeable disadvantage. First steps And here we are finally in front of Championship Manager 2010, famous in our land with the name of Scudetto. The setting is similar to that of Football Manager, but given the birthplace and the commonality of purpose we can say that it is almost inevitable. On the left stand the extended menu which contains all the options, from management to saving and, above, the action button which changes dynamically, leading us through the game phases. The first step is the assignment of the jersey number to the new players, the second is the choice of the players who will be deployed during the first match. There are also several sub-menus in the team management menu that allow you to change the team's strategic setup, individual player tactics and play patterns. Finally, the performance analysis framework appears. The first interesting innovation concerns the game schemes that can be tested on the field as happens for training between the first and second team. Observing the action in three dimensions shows us the influence of the characteristics of the players on a specific scheme, allowing us to choose and place players with extreme precision. Modern prices To celebrate the return to the field of Championship Manager, Eidos has organized a web launch linked to an offer that we can consider quite modern even in the era of digital delivery. In fact, until 11.59 pm on 10 September, a minimum offer of 2.51 is sufficient to pre-order the new chapter in the series. Still on the subject of digital delivery, CM also offers the Season Live option which allows, for a fee, to update the game database using real data entered every four weeks. Coaching tools The talent scouting system is at least as complex as that offered by Football Manager and allows you to keep an eye on certain regions of the globe in search of the new ball ace. The more time you spend scouting an area, the better your chances of finding good players. Added to this is a rather interesting peculiarity that adds a pinch of risk. In fact, once we have identified an interesting player we will have to observe him several times to know his actual characteristics which may not correspond to the initial hopes. Obviously there is also the team talk, a useful tool for motivating players and giving them specific instructions before and during a match. It is possible to speak to the whole team, to individual players or to specific sectors and it is possible to choose both the type of advice and the tone with which it will be pronounced by our coach alter ego. We also find all the classic features of the genre that allow you to manage first and second teams, buy and sell players and keep an eye on the physical and mental state of each individual player. What is missing instead is the outline of Football Manager made up of unexpected events, worldly events and all those events that contribute to creating the illusion of being in the middle of the football star system. Technical compartment Championship Manager is less ferocious than its SEGA counterpart. On the one hand this is a pleasant feature as the effect of the player's choices is more decisive and has a greater influence on events, but it is often an element that leads to overly facilitating the conquest of a cup or the championship, undermining the longevity of the title. A negative note comes from the menus which are less intuitive and more complex than those of Football Manager. On the contrary, the artificial intelligence of the demo, capable of unleashing indignant comments, is just a memory. Players move naturally, aided by the new three-dimensional graphics engine. It is certainly not a technological miracle but the 500 animations, combined with the soft and proportionate design of the players, are still able to give a rather pleasant look to the games. It is obviously possible to choose the quantity of matches to watch and the speed with which to do so.", "date": "2009-09-08", "grade": "8.0"}