{"name": "L'Era Glaciale 3: L'alba dei Dinosauri", "ref": "https://multiplayer.it/recensioni/70408-lera-glaciale-3-lalba-dei-dinosauri-lera-glaciale-3-lalba-dei-dinosauri.html", "text": "The first moments with Ice Age 3: Dawn of the Dinosaurs confirm the expectations that can arise from a game based on an animated series such as that of 20th Century Fox. From the scenes that introduce the player to the level (the game is completely localized in Italian), to the elementary explanation of the commands, and overcoming the first simple obstacles, it is clear that the title in question is designed primarily for a young audience, even first experiences with video games. What you don't expect, however, is that the third edition of Ice Age also offers different variations to the main game system, and so level after level the classic three-dimensional adventure turns into something else. You can roll on a snowball trying to get to the end of the path without falling off cliffs, and a moment later you'll find yourself playing with side scrolling like with the old Super Mario adventures. There will also be sections in flight that will see you busy shooting down enemies trying to sell your life dearly, and levels in which you will have to escape from a dinosaur or chase some prey. In fact, the game winks at the great classics of video game history on more than one occasion, and it is impossible for longtime players to miss certain quotes. For those who have recently picked up the joypad, however, it is an opportunity to familiarize themselves with the genres that have been the cornerstones of this industry. Having said that, it should be clarified that in any case the game never delves into all its aspects, and is limited to a quick re-reading of these genres, losing much of the fun along the way. Both in these moments and in the main adventure which closely reproduces those of the film from which it is based, the game offers a low level of challenge, where the loss of a life is penalized with only a few seconds of gameplay to repeat. The ferret, the squirrel, and the sloth During the course of the game we will be able to command three of the protagonists of the film. The first one we'll meet right away is Sid the sloth, an awkward and funny character who certainly doesn't make his courage the main weapon. His moves are limited and he can only attack with his bare hands, but on the other hand he can light a fire that is useful for overcoming some obstacles. We'll only take control of the squirrel Scrat in the side-scrolling sections we've already talked about. His agility makes the game more exciting even if there is little to do in these levels other than to jump from one path to another. Buck the ferret is the most varied character and probably the most fun to use. By means of his whip he can interact with many objects in the level, attack enemies with different moves, as well as cling to handholds and then twirl like a new Indiana Jones. It is precisely with this character that the difficulty level of the game becomes less soft. The paths become more complicated than the initial banality and it will happen on more than one occasion to lose a life. This is also because sometimes the solution is not easy to read, and it is not clear how far we can go with one leap, just as the control system once you hang on the walls is not clear either and which will make you inexorably fall into the void. Not bad, just two jumps and you're ready to try again. Ice Age 3: Dawn of the Dinosaurs offers unsuspected opportunities, with many different gameplay moments that keep the pace up. On the other hand we have a very low level of challenge, and rather trivial game levels for those who have already been weaned on milk and video games. For the same reason, the game is recommended for beginners and younger kids, even if they, either for their free time or because they won't be detached from the console easily, could finish the game in a handful of afternoons. In that case, all that remains is to retrace the levels to recover the crystals left behind and thus discover all their secrets. After that we will have to wait for the next movie and then the next game. Comment Convincing execution Quite different situations Overly simple Some problems with Buck's controls", "date": "2009-09-09", "grade": null}