{"name": "E' ora di darsele di santa ragione", "ref": "https://multiplayer.it/recensioni/70319-dissidia-final-fantasy-e-ora-di-darsele-di-santa-ragione.html", "text": "After a very long wait, the new exclusive project for Square Enix's PlayStation Portable finally arrives in Italy. A title also conceived to worthily celebrate the twentieth anniversary of the historical series of Final Fantasy, although its style is technically different from its predecessors. For the occasion, the Japanese company has in fact decided to reinterpret the entire universe that has been the backdrop to its many role-playing games in a fighting game key. Square Enix is actually not new to forays into the world of 1v1 beat'em ups, just remember for example the old Tobal 2 and Ehrgeiz on PlayStation, but the game we are going to review is quite different from them. At first glance it may in fact seem only a fighting game in which the most memorable characters of the entire saga, good and bad, collide with each other in three-dimensional scenarios. But don't be fooled by the premise: DISSIDIA: Final Fantasy is so much more. So much so that describing a rich game like this in a review is quite difficult considering the high amount of material present and the limited space available. Of course, we will also try to be as comprehensive as possible. The plot around which the whole story revolves is the simplest there can be and serves more as a pretext to justify the presence of so many heroes from different worlds. However it is rather functional for the purpose and enhanced in the Story mode, as we will see later, by the deepening of the events of the individual heroes of the adventure. Two powerful deities of the cosmos, that of destruction and disorder, Chaos, and that of peace and order, Cosmos, have been battling for centuries for their lust for power. Ten small crystals However, the clash lives on a perennial balance, so the two decide to put an end to the conflict once and for all by summoning twenty of the best fighters from some parallel worlds (and from the various Final Fantasy). Sephiroth, Garland, the Emperor, Exdeath, Dark Cloud, Golbez, Artemisia, Kefka, Kuja and Jecht will therefore line up in the ranks of the bad god, while in those of the good god Cloud, Tidus, the Warrior of Light, Firion, the Knight Onion, Terra, Squall, Cecil, Bartz and Gidan. When war seems to smile in Chaos, Cosmos and his allies realize that to avoid the final defeat there is only one solution: to find ten magical crystals to steal from the ten champions of evil. The game structure of DISSIDIA: Final Fantasy is broadly similar to products such as Nintendo's Super Smash Bros Melee or Capcom's Power Stone. But compared to the titles just mentioned, this one from Square Enix is much deeper and more complex in terms of gameplay, especially in the aforementioned Story mode, which we will immediately analyze. Once you have selected a character to use among the good ones (each of them is traditionally characterized by its own personality in line with that seen in the episode of the series from which it comes and by the relative weapons and special moves) and started playing, the The user has a first taste of that strategic component which he will later find even during the fights. In fact, a sort of futuristic chessboard appears on the screen very similar to the basis of some board games which constitutes a level, with a pawn representing the hero controlled by the player. Strategic Board Game This avatar must be moved through boxes where you can find treasures, summoning crystals, healing items or minor enemies, up to the current Boss belonging to the Chaos hosts to be faced at the end to complete the area. However, every movement on this grid is not free, in the sense that it is determined by the number of Destiny Points (PD) available to the character. For example, if you want to move to one or more boxes, you have to ~pay~ a point. Even if the latter can be accumulated during the various stages by following certain requirements required by the game for the completion of the same, such as facing enemies by getting rid of them within the first ten seconds of the start of the fight or winning without taking damage, if you want completing the level well and perhaps reaching boxes containing particular bonuses, it becomes necessary to plan one's moves in the best possible way and not waste any of them. Also because danger is always around the corner. You have to pay attention to the path you take: sometimes, in the vicinity of the space where there is a monster you want to face, there is another one and therefore, positioning yourself above the first will trigger a chain reaction (Combo). Basically finished the first clash with the enemiesco chosen must immediately face a second with the other, with no possibility of avoiding the confrontation. And often to heal. There are opponents, those colored red, who simply need to be ~touched~ to be unleashed. Help in these cases can come from one of the special techniques that can be used before going into battle. At the top right of the main screen when you are on the ~board~ some options are visible. Just select them and they will be used immediately. Among these there is the Laser Gaze which allows you to decrease the Life Points (PV, are the equivalent of the classic HP) of an enemy initially by 20% or Energy which allows you to recover health or even Scan (not to be confused with the 'command of the same name that can be activated with the R key) which again from the menu serves to understand which pawns to destroy to unlock those boxes that are temporarily inaccessible. Other techniques are unlocked as you progress through the game. Curiosity One of the funniest features in the game is the Mogunet. Final Fantasy's cute moogles send the player a letter every day with useful advice or containing a specific question, answering which you are rewarded with points. Another interesting addition is the one concerning the in-game calendar (based on the real one) and the relative Special Day. During the first game of Dissidia, the user is asked to set up a profile and to choose a favorite day between Monday and Sunday. In this way, every time you play at that precise moment of the week, a special bonus is guaranteed for each fight (higher EXP points, gil, etc). Battles to the last breath But let's finally analyze the real battles. The character is controlled with the analog stick while with the arrow keys you can change the angle of view of the camera. The X key is used for on-the-spot jumps, the Triangle for more complex ones, such as from platform to platform, or for climbing walls or taking advantage of paths on the ground, while R is for parrying blows or, in combination with the basic buttons of the Pad, to perform various actions such as summoning ~Summon~, dodging blows, etc. The clash between two contenders, which takes place in large arenas full of obstacles, platforms and detailed scenery, is not limited as for other fighting games to a sequence of hits, counterattacks, parries and combos, but still plays a lot on strategy. Attacks are usually performed with two buttons, one for physical attacks (Square button) and one for Audacity (Circle button). The latter play a fundamental role in combat: in fact, with each successful attack, ~Audacity points~ (AUD) are removed from the enemy and forfeited. It therefore becomes fundamental to ~steal them~ from the opponent in order to reduce him to a state called Collapse, that is, a phase of absolute weakness that makes him very vulnerable. When a character finds himself in this status, his opponent gets a bonus and if he performs physical attacks he takes away many HP from the enemy, sometimes up to immediate defeat. Another interesting aspect of the game is the EX function: in each level there is an item called EX Core. This object appears in certain points of the arena and serves, like the EX Force, the colored lights that appear on the screen every time it attacks and hits an enemy, to charge the appropriate ~burst gauge~ which, once full, allows through the simultaneous pressure of the Square and R keys, to activate the above mode. If you attack during this phase, a command appears on the screen surrounded by dashes that act as seconds. They decrease slowly starting a countdown within which it is necessary to press the appropriate highlighted key to give the hero the order to unleash all his power and perform a special attack, the EX Hypermove. The available options vary based on various factors, including the fighter being used. In the case of Cloud, for example, the Limit Break bar must be filled by repeatedly pressing the Circle key. Role playing game Without forgetting the Summons: Squall and his friends can invoke ~Summons~ as in the ~normal~ chapters of the Final Fantasy saga. The latter are divided into two distinct categories: automatic, that is, which are activated as soon as a certain variable condition occurs depending on the creature called during a fight, or manual, that is, which come into action on a specific command from the user by pressing special buttons on the PSP controller. After using them a certain number of times, summons cannot be recalled for a few battles. Uselessperhaps add that in the light of what has just been described, the clashes are absolutely spectacular and frenetic, so much so that to avoid losing sight of the enemies it often becomes advisable to lock the opponent by pressing the L key. At the end of each match, victories are rewarded with experience points or skill points, gil, etc. Further prizes are also obtained at the conclusion of each area (or ~chessboard~), i.e. after defeating the Boss there guarded by the god of Evil: in this case the final score is determined by the amount of PD saved and by other factors such as HP remaining, number of attempts to defeat an enemy, battles lost, etc. Characters can evolve like in a traditional RPG. Their basic parameters are the classic ones of the genre but with the addition of some new elements such as Ability Points (CP) and Audacity. The former in particular affect the amount of support skills (offensive, defensive, etc.) that can be activated for each character, therefore the more they scrape together, the more things you can equip the hero used (in fact, each skill has a cost in PC ). These ~special abilities~ can also be upgraded to Master level. The gil earned can be spent in a shop where it is possible to buy all sorts of good things (weapons, protections, accessories) that will gradually unlock. Some of them require specific rare items in addition to money to be bought. Go-go mode There are many other game modes in DISSIDIA: Final Fantasy among which the one called Arcade stands out, which takes up the typical style of one-on-one beat'em up productions a la Tekken, including customizable settings. Then there is Battaglia which is already much more interesting given that in this section it is possible to use the characters developed in the Story Mode by exploiting their skills, weapons and accessories acquired precisely in that mode and Communication, which allows the PSP user to challenge other players via an Ad Hoc connection and, among other things, use the so-called Friend Card to obtain the ghost of the character that a human opponent has used against him while playing on Wi Fi. There are so many extra modes and options to unlock that it would take another article to list them all. Just think that at a certain point DISSIDIA also becomes a JRPG in which the fights are managed by a contextual menu that will list the possible attacks and the actions to be performed... Concluding our detailed analysis of the product, we cannot fail to mention the level now reached by certain productions on the PSP, also with regard to general graphics. The Square-Enix title confirms the good things we had already seen in Crisis Core: also in this case we have polygonal models which overall appear clean and detailed. The rendering of the characters whose character design was entrusted to Tetsuya Nomura is excellent, as are the cut scenes created with the same graphics engine as the game, the light effects and those relating to the special moves in battle. In short, from this point of view, DISSIDIA is undoubtedly one of the best products ever seen on the Sony portable console. We can then say that the audio is simply fantastic. The soundtrack in particular will bring a few tears to the nostalgic as the game contains all the greatest hits of the saga rearranged, including the victory music, and other bonus tracks that can be purchased in the Catalog. Even the songs specially created for DISSIDIA, even if they don't reach the qualitative level of the aforementioned songs in our opinion, are to be considered anyway of good quality. Like the English dub. While the only discordant note of the entire production is the localization of the texts in Italian: the latter are not always faithful as a translation to the words spoken by the characters.", "date": "2009-09-11", "grade": "9.0"}