{"name": "Song in the Smoke", "ref": "https://multiplayer.it/recensioni/song-in-the-smoke-recensione.html", "text": "The survival genre is overcrowded, often due to titles that simply change in aesthetics, difficulty or balance, but not in substance. However, there is certainly no lack of space to say something new, perhaps mixing different genres. We can say this with certainty after having measured ourselves with the review of Song in the Smoke, a title set in a prehistory with mythological traits that relies on virtual reality and a level structure to offer us a challenge to survival from a more engaging and other less dispersive. Crafting Song in the Smoke's crafting is basic but integrates perfectly into the game's balance Song in the Smoke, also available for 29.99 Euros for Oculus Quest in stand-alone version and PSVR, is a rather linear survival game, punctuated by fairly large levels, but with well-defined boundaries that all revolve around the need to find three floating magic stones that they are necessary to progress. Classic structure, in short, complete with bosses who can eliminate us with a couple of hits, but merged with the mechanics of a true survival that certainly cannot lack a crafting component. The system is not particularly complex, but in this way it is faithful to the prehistoric context, with about twenty objects, some of which evolve based on the quality of the raw materials used, and fits well in balancing a title that does not include shelters impenetrable and forces us to constantly deal with sleep, cold, hunger and hostile creatures. All to be experienced in the first person thanks to virtual reality which makes an experience of this kind even more engaging. It's up to us to turn a bone into a hammer, assemble a knife, crush ingredients with the pestle to obtain cures, carve a bow or derive meat or other resources from a slain animal. Everything is done by hand, including placing the nine large stones that are needed, together with bark and suitable wood, to build a hearth, necessary for safe sleeping, recovering more health and saving the game. And it's all sensible and necessary to arrive healthy at the appointment with the fights that are already challenging with all in all harmless creatures like the snarler and become lethal, in a couple of hits, with the bosses. The gestures that we are called to perform are rather approximate, but they are sufficient to create the illusion of us doing things and are designed according to the timing that fits into the excellent balance of a title that does not allow us long breaks. On the other hand, it does not include protected shelters or the accumulation of resources. Almost everything must be in the inventory we carry around and we must be prepared to face increasingly complicated situations, where it may be necessary to assemble a torch on the fly in the middle of the night or quickly replace a club that broke in the middle of a fight. Exploration Among the most accurate elements of Song in the Smoke are some animations of the creatures that inhabit the forest Crafting goes hand in hand with the need to explore to find resources, hunt animals and search for the three stones. The title has a linear structure, but the maps are open and despite being all in all small in size they are well designed, so as to include an avalanche of vertical passages and paths that also include secrets, strange objects, health upgrades and even containers to smash , provided of course that you have the right tool to break the material they are made of. In all of this it is always good to pay attention to the status indicators which are visible in detail when we are near a fireplace, but are summarized on the character's wrist and are shown to us on the screen depending on the situation in which we find ourselves. In fact, when we are cold, snowflakes appear, while small drawings of legs indicate a growling stomach and large black leaves indicate that we are hidden by vegetation, which is very useful, together with the possibility of kneeling to reduce noise, to escape threats which we may not be prepared for. Hunting is a source of essential resources in Song in the Smoke The clashes, as we have said, can be immediately demanding and when a hostile creature becomes aware of our existence, it does not return placidly to the den but remains on the alert. It also tends to run away after taking damage to return to attack us by surprise, adding spice to an action that also draws strength from the convincing animations, including those of the animals that run around us, and from details such as the grass that slows us down. The result is a not particularly special worldpopulous but credible body, which is important to alleviate the weight of the inevitable process of collecting raw materials which remains constant throughout the entire experience, leading us to often repeat the same gestures. But the timing keeps boredom at bay. In fact, we are forced to work at a rapid pace in order not to succumb to hunger, sleep and wounds, which are more and more frequent with the increase of predators. However structured, in fact, Song in the Smoke takes its survival backbone quite seriously and tackled lightly risks turning into a frustrating experience. But linear structure, saves and clear objectives reduce the risk of this happening, at least compared to the typical high-challenge survival, while the survival dynamics significantly increase longevity, even if the duration of the experience clearly depends from the approach and experience gained by the player with this kind of title. Having said that, we are undoubtedly talking about a title that far exceeds the average length of VR titles in circulation. Graphic compartment The technical sector of Song in the Smoke certainly doesn't make you cry out for a miracle, but it is saved thanks to an effective style Song in the Smoke relies on stylized graphics that are more spartan on Oculus Quest, especially in terms of textures and effects, but which certainly cannot be defined as impactful in any of the available versions. Yet, despite the low polygon count and although the graphic effects are approximate, the overall rendering adequately supports an atmosphere that is based on suggestive sound, mythical creatures and fiery prehistoric sunsets, playing more on sensations than on quality of textures or on the complexity of the models. Having said that, we certainly would not have disdained a stronger narrative component, greater care for the rendering of the tools and more attention to physics, starting from the reactions of the monsters' bodies to blows, almost nil, to get to the glitches. In fact, it happens that some objects, bouncing, are possessed by the demon of physics, continuing to splash at astronomical speeds from one part of the map to another, depriving us not so much of the suspension of disbelief, as of potentially valuable tools. On the other hand, despite the modesty of the production, the 17-BIT title does not show its side in terms of animations, simple but effective, which give life to the animals, creatures, magic mushrooms and even the characters of the suggestive albeit short scenes interlude, which serve to provide us with some other clues between one map and another. The use of fire is also excellent, stylized but extremely vivid, which transforms the darkness into a blaze of flames that dance on the rocks and envelop us, protecting us from the dangers of the night. Checks Song in the Smoke's control system is fully customizable As challenging as it is, Song in the Smoke isn't punishing. In fact, it includes a map full of indicators, spirit guides and the possibility of saving the game, with three slots accessible by building and lighting a fireplace. There is also a long initial phase that shows us how to climb to reach the Song Stones and how to work the materials to build the basic tools on which weapons, hunting, skins to wear and so on depend. And it is good to take this phase seriously, also to familiarize yourself with the controls, reactive and well thought out, and with the inventory which, complete with mortar to create healing mixtures, includes two slots with a drawing of a hand that correspond to the objects that we can pull off quickly. Something that turns out to be very useful when nature stops being kind to us and suddenly the difficulty curve soars. The darkness of Song in the Smoke hides fairy creatures, secrets and predators Already the first fights make it clear that Song in the Smoke is not a title in which you kill left and right, excluding the case of animals and provided you have a bow. Teasing a predator, as we have said, is dangerous and in case things go wrong it is not easy to escape them. But the game also supports us in this case with indicators that show with which part of his body an enemy is attacking us and help to neutralize the attack more easily. To this must then be added a rich customization of the controls. Basically you move with the left stick, you turn in 90 degree shots and you climb by holding down a key, but it is also possible to exclusively use the movement with teleportation as well as it is possible to bet everything on the simulation, from the view that turns continuously until the need to physically crouch to reduce the noise of footsteps. There are also modesseated, movement based on the direction of the gaze, reduced visual range due to motion sickness and all the classic equipment to sew the virtual experience on. The only lack, at least for us, is Italian, but apart from the menu items there is nothing else to translate.", "date": "2021-10-17", "grade": "8.0"}