{"name": "Scaler", "ref": "https://multiplayer.it/recensioni/scaler.html", "text": "Traditionalist reptiles Bobby Scaler Jenkins is something of a budding alt-anti-hero, tailor-made for a rapidly growing teen audience. The multiverse, within which our universe and planet play a clearly marginal role, is connected by a series of portals, but the usual bad guy on duty, having stolen the technology from a brilliant inventor, threatens to run around with it unpunished. Bobby finds himself sucked into the same portal by chance as those trying to thwart the gang of bad and ramshackle reptiles, assuming the form of a gecko. In reality, the video game avatar of the Scaler gamer does not look like a gecko (or a chameleon?), just as most of the enemies seem to only remotely recall real reptiles or the same movements and properties of said microfauna. Traditionalist reptiles We certainly do not want to say that the character design must be realistic in fantastic games such as Scaler, in which, however, the chromatic care of the backdrops and the graphic effects, although completely routine, are well presented and at times decidedly suggestive (such as some light effects that stand out with the sun on the horizon in some backdrops). What is certain is that the characters are insipid, not taking any inspiration from the already fantastic real fauna of reptiles and aspiring to the maximum a cartoonish dignity that is lost in banality and lack of recognition. The plot of the game, interspersing the gameplay sessions, reflects these characteristics, fully returning to a not exactly excellent cartoon dimension. What matters, apart from narrative and aesthetic tastes, is that Scaler is at least fairly playable. Its weakness is originality. You will find nothing but the typical platform action (already seen and better in many other titles), including various attack techniques on enemies, yoshiane slang to grab bonuses and items, elementary switches to activate, skate-like sections on ropes traced from tredd raids of Sonic, exploration and collection of bonuses useful for the effective completion of the levels and to have access to the following levels. Freedom of movement is remarkable, with analog and 3D control and vast and rich environments (pity about the lethal water). Scaler then adopts the principle adopted by millions of platformers in response to Super Mario 64: collecting more (in this case) gems corresponds to more unlockable levels, which will present us with other gems, and so on, with relative freedom of navigation on the game map, which has a good number of levels. Then there are two design issues. The first is a control that is not exactly very precise, which sometimes risks causing the player to incur negative sanctions, such as the death of the protagonist or having to repeat the level or part of the level, not by mistake but due to structural defects of the collision routines. The second is the calibration of the difficulty, which presents inexplicably difficult moments in the face of a general ease of the missions. Character Art, various bonuses and progressive unlocking of various worlds still make the game long enough. Scaler could have been much better. Technically, the graphics engine and control routines could have led to more original results in terms of aesthetics and more varied and original in terms of game design. It remains a discrete platformer, not at all original and not exactly perfect in terms of interaction or level design, not up to the level of other genre titles available on PS2 but capable of providing a good amount of hours of fun without too many pretensions. Recommended, therefore, for younger players, also in view of its reduced price to the public. Pros: Fairly solid gameplay Lots of levels to unlock Beautiful environments for a low price Cons: Bland character design Totally derivative A few level design issues Scaler is a 3D platformer that can be considered ~classic~ according to the established media in the genre and the comparison with titles characterized by a similar attention to cartoonish design. It is basically a game that is barely discreet in its mechanics, with gameplay that is certainly not brilliant in terms of gimmicks or revolutionary in terms of control and some design problems. But still capable of providing a solid and quite varied interaction to the adventures of another, yet another videogame-cartoonish quasi-hero. Populated by anthropomorphic reptiles, Scaler's dimensional platform multiverse is filled with post-pubescent cartoon humor and a good variety of colorful and fantastical environments. As such, it could attract many of the younger players. And its decidedly reduced price makes the judgment on its lack of a style more lenientand or a decided ~personality~, as well as the comparison with other more famous and captivating platformers.", "date": "2005-01-20", "grade": null}