{"name": "Combattiamo la cospirazione sovversiva!", "ref": "https://multiplayer.it/recensioni/70141-combattiamo-la-cospirazione-sovversiva.html", "text": "Available via Xbox Live Arcade There are some games which, in their genre and in particular historical moments, are considered as watersheds between the ~before~ and ~after~ their release. Halo 2 represented the Xbox Live boom; Perfect Dark Zero the start of the new generation; Gears of War meant that everything was possible on consoles now. Shadow Complex is a fun game to play, beautiful to look at, complete: it is the definitive consecration of Live Arcade and of the entire Digital Delivery system. The Story of Shadow Complex The world of Shadow Complex is set in the universe of Empire, a novel by Orson Scott Card which tells of an imaginary second American Civil War organized by a powerful terrorist faction of clear communist origin. The game serves as a tie-in to the book and simultaneously as a prequel to the sequel Hidden Empire, fitting into a sort of trilogy between different genres. A film adaptation by Warner Bros has also been announced, and obviously the related videogame sequel is also expected. In short, a success announced even considering that the adaptation of the game has been entrusted to a veteran writer: Peter Allan David, famous author of comics and TV series such as Batman, Spider-Man, Star Trek, and a curious precedent linked to Xbox: the mini-series Halo: Helljumper. In Shadow Complex we take on the role of Jason Flemming, a hero (almost) by chance who finds himself having to investigate and fight a very powerful secret organization that aims to take control of the United States through a violent coup. The story starts with a flashback in full war action, and then restarts together with our girlfriend Claire, on a quiet relaxing day in the woods around the city. At one point we discover a complex of caves that goes underground. Claire offers to explore it, but at a certain point... Claire no longer responds to our calls. Accidental heroes Shadow Complex is a shooter with adventure and platform elements with a wonderful two-dimensional style, but entirely made in 3D with a refined graphics engine rich in polygons and effects: a technical sector like this has never been seen in a Live Arcade game. The game action takes place between levels, floors and corridors connected to each other by a never banal level design, sometimes amazing for the gimmicks and ideas that exploit the mix between 2D and 3D. The mind travels to the old great classics of the genre: Metroid for the old Nintendo systems, from which many inspirations have evidently been drawn, Castlevania. Our character's view is lateral, but in many situations we can exploit the three-dimensionality of the space around us by hitting enemies in depth, simply aiming them with the right analog and pressing the trigger. Other times the view can suddenly rotate and give us another perspective of the game action, transforming into third person like any shooter. One thing is certain: Shadow Complex is so full of gimmicks that it amazes from the first to the last moment. The developers of Chair Entertainment, already responsible for the good Undertow, have pushed the accelerator on the mix between the frenzy of the shooter and the beauty of exploring the best adventures of the genre. Through the map, very comfortable and recallable by pressing the back button, we can at any time understand exactly how to get to the goal to be achieved. The many secret objects are marked with a question mark, but this doesn't make their hunt any less captivating and fun: you always have to figure out how to get there. And once you get to the area, you have to figure out how to take the object, often positioned in a hidden way. Backtracking is present, but in an intelligent way: in Shadow Complex we always go forward, but once we have obtained more powerful weapons such as grenades and missiles we can retrace our steps in the hunt for previously inaccessible objects and power-ups. This is why Shadow Complex can be completed in 4-5 hours, without enjoying its exploration and research phases, or even in 13-15 hours enjoying it fully in every detail. Xbox 360 goals The classic 200 points to be unlocked through 12 objectives. Half of them will come automatically as you progress through the story, simply by killing enemies in a certain way (melee, grenades), discovering secret items and unlocking some mandatory events. The others, more demanding, want us to complete the game with as few objects as possible, or at 100%. Finally, reaching power level 50 will not be a walk in the park. The Great Classics re-enacted The strength of Shadow Complex is a right mix of elements. First of allAll the perfect level design that has the dual (and not easy) function of hiding a thousand secrets, secondary roads and brilliant ideas, but without displacing the player, without making him lose, without ever taking away the focus on the goal to be achieved. Shadow Complex is difficult but not frustrating, it's challenging but never impossible. Another winning element is the control system that allows us to move the character only between the X and Y axis of the screen, but makes us interact with all three-dimensional space thanks to an intelligent aim assist system. Going forward in the game you will notice many inaccessible points, and it will then be up to us to decide whether to go back to search for them, once we have obtained the right weapon to knock down the obstacle. Particular mention for the solidifying foam gun: it is used to block doors, enemies, create roads, bridges and to realize many other ideas. However, the little big jewel of the Live Arcade is not free from defects, like any other video game with the exception of a select few up there in Olympus. The aim, at least until we reach a high skill level, is not immediate and simple despite the help of the CPU. We often find ourselves having to shoot several times trying to hit the target while the latter quietly riddles us from a distance. But it is certainly a small thing compared to the very poor artificial intelligence of the enemies, who move only in a scripted way and often do not even react to our most obvious requests (see: bombs and grenades in the face). In many cases they don't even notice our close presence, they don't react, they don't run away, they don't cover themselves. And in the backtracking, mysteriously, they also reappear post-mortem. Shadow Complex has a constantly growing plot and gameplay that go hand in hand: as we progress through the story we discover unpublished details about the terrorist organization, the ongoing war, the conspiracy, and finally some not bad twists. Shadow Complex also has a vaguely role-playing progression: initially we are equipped only with arms and legs, shortly after we take the flashlight, then a pistol, a machine gun, grenades and so on. From a quiet boyfriend on a trip through the woods we are transformed into a powerful and angry weapon of war. Claire is somewhere waiting to be rescued! A new yardstick Shadow Complex represents the non plus ultra of the games currently available in digital delivery and on Xbox 360 Live Arcade. And this not only thanks to the fun gameplay and the complete package it offers (which also includes online time and score charts), but also to a graphic component never seen in a game of the genre: the use of Epic's Unreal Engine 3 is a guarantee with tons of polygons, effects, shaders, perfect shadows, water, smoke and fire, realistic and without compromise. Regardless of brute force, Shadow Complex is also very detailed and barely visible details: polygonal blades of grass, lots of objects and structures on the screen, their own detail and realization. Even the sound sector is very accurate and effective, orchestrated and equipped with evocative and impactful pieces. The sound effects are beautiful, always clear and crystalline in the sampling and with some classy hits, such as when we go underwater and hearing fades. The Shadow Complex package is therefore taken care of from every point of view, giving it the dignity and completeness of any other boxed masterpiece.", "date": "2009-08-28", "grade": "9.2"}