{"name": "Il Baseball dei Supereroi", "ref": "https://multiplayer.it/recensioni/70108-the-bigs-2-il-baseball-dei-supereroi.html", "text": "Tested version: Xbox 360 Combining the idea of a baseball game with the 2K label can bring to mind the glories of those wonderful World Series Baseball simulations released centuries ago on Sega Saturn. Unfortunately, or fortunately for those who don't like that genre, the new title dedicated to Yankee sport par excellence is a sort of arcade in NBA Jam or Fifa Street sauce, sports deliberately taken to excess to emphasize player performance, gameplay and fun . The developers are once again the Canadian guys from Blue Castle Games, responsible for the first episode and the upcoming sequel to Dead Rising. From the Pollos to the Giants! The Bigs 2 is a restyling of the first chapter, with additions, new modes and some new features. Like any sports game, therefore, it is a ~more of the same~, but this time full-bodied enough to justify the number two in the title. The first chapter revolved around the Rookie Challenge mode, which saw us as protagonists starting from an anonymous freshman to becoming a popular champion. In a similar way, in the new The Bigs 2 the juice of the single player is made up of ~Became a Legend~, in which we start playing in a Mexican minor league and we have to try to get back on top through training, great games and experience. Our first team is that of the San Guerrero Pollos (the name says a lot about our initial skills), but once called to the American Major League we can choose our favorite team in which to serve. Through mini-games, training sessions and matches, our physical and technical characteristics will evolve in certain directions: just like a small role-playing game, the pitching, catching, batting, running, precision and so on values will rise until we become a real baseball star. The gameplay of The Bigs 2, however, is not exactly simulation and relies on the peculiar characteristics of the champions, raising them to the nth degree. Here is the Japanese champion Ichiro possesses an incredibly powerful serve, which even manages to ignite the ball. Or some outfielders manage to make Matrix-worthy leaps to eliminate a long joke. You can make incredible wall jumps, very long dives or catching at the limits of the surreal. Some players, equipped with ~Legendary~ characteristics, can go further and are able to do almost anything, after beating a ~QTE~ style mini-game, in which we have to press the right keys at the right time. This aspect could make the puritans of Baseball turn up their noses (are there any, in Italy?) or those who grew up playing those fabulous World Series Baseballs. For all the others, they could instead represent an opportunity to make this particular sport finally interesting and fun. During the career, other types of mini-games will appear, focused on running, throwing, catching. These serve to advance the technical characteristics of our player, who advance in this way rather than according to how we actually play during matches. In fact, performing a large number of Home Runs will not increase our ability to hit a home run, eliminating opponents with catches on the fly will not make us better, throwing at great speed will not increase our shooting skills. Perhaps it would have been better to relegate those mini-games to extras to have fun between one game and another and make the gameplay more varied, rather than the only means of strengthening for our player. Among the extra modes we also find the classic ~season~, a complete season with the favorite team, in which we can swap players, decide the batting order and position on the pitch, up to the All Star Game. While representing a good chunk of The Bigs 2, however, the multiplayer mode is the real queen of this game (and of any self-respecting sportsman). Xbox 360 goals The goals of The Bigs 2, 37 for the canonical 1000 points, are divided into simple and impossible to obtain. Some of them are unlocked automatically by progressing in ~Legend~ mode, simply by performing legend moves, winning games and completing mini-games. In the second category, however, fall online achievements, difficult to acquire as most people log out before losing and we are not awarded the victory, stratospheric scores in Home Run Pinball and ~perfect~ games without opponents on base or hit while at bat. A controversial game, even in goals. Baseball to the nth degree The Bigs 2 is not just career, seasons and All Star Game. Most of the time, fortunately, can be spent sitting next to each otherto a friend or with headphones connected to the internet, challenging human opponents in multiple competitions and mini-games. The latter are the real, great addition to the first chapter of The Bigs. Those already seen in the single player can be replayed at any time, even in the company of a friend: in Power Mini Game we have to hit the targets over the fences as quickly as possible; with Pick-Up Game you can use the fantasy draft to enter some games in progress and distort the final result; with Contact Mini Game you have to hit the greatest number of balls in pre-established times, while in Glove and Speed, on the other hand, you exchange throws and run against an opponent. The game controls work properly: Baseball is a complex sport that requires all the available keys of the Xbox360 pad. The phases of the game are never easy to manage, despite appearances: for example, while we are batting we could have two or more players already on the bases, ready to go to score points. In these cases, thanks to the back buttons and the directional pad, we can manage the runs of each of them, get them back to base or make them run to the parent company. Or make him steal a base while we beat the opponent's pitch with the analog. Baseball is a simple sport but with multiple possibilities: 2K's experience in the sector is evident. Instead, what leaves us perplexed is the opponent's artificial intelligence, certainly a little too shrewd in attack and stupid in defense. Until we become a ~Legend~, most of our pitches are intercepted with very precise hits by the other team, who will send the ball exactly in the middle of the outsides: the worst situation for us, and the best for the CPU. Furthermore, during the serving phases, it can easily be seen that the direction to be given to the ball is decidedly arbitrary and is poorly defined by the position of the analog we have decided. This situation is particularly evident in Home Run Pinball, a minigame in which we have to destroy the off-screen elements to increase the total score: by holding down the analog in a specific direction, the joke hits all the destructible elements in the background in direct sequence . Rather, one would expect shots to be placed in the desired direction but still random in the final result. During our attack phases, on the other hand, it soon becomes clear how simple it is to always throw the ball in the same scripted directions. It should be noted that, playing online, the player who disconnects before the end of a game loses nothing: it is therefore quite difficult to win matches, as just before the end of each game, the loser opponent punctually disconnects the connection without penalties, and without victory for us. The aesthetic component of The Bigs 2 is excellent, and the colorful style is well suited to its extreme and arcade gameplay. The background of the stadiums, the public and the whole outline is very accurate and small details such as the polygonal grass, animations of the public, realistic shadows and excellent animations are appreciated, even if not in industrial numbers. Even the soundtrack and effects are OK, with a rock style typical of arcade productions, while the audio commentary, obviously in English, does not have an excessively large sampling and for this reason is repeated very frequently.", "date": "2009-08-25", "grade": "7.0"}