{"name": "C'era una volta una principessa grassa...", "ref": "https://multiplayer.it/recensioni/70148-fat-princess-cera-una-volta-una-principessa-grassa.html", "text": "A long time ago, in a not so distant galaxy, the PlayStation Network was seen by the gaming community as the ideal place to start that small revolution that some call ~underground production~, capable in some cases of giving life to real cult indispensable. New, original games, perhaps natively equipped with online multiplayer, offered at ridiculously low prices compared to the counterparts that crowd the store shelves. Well, so far we have seen very little of all this: beyond HD revisitations (wipEout) or simple add-ons (Ratchet & Clank), users have had to wait patiently for someone to decide to pull out of the hat a title like Fat Princess. This someone is Titan Studios, born from an offshoot of Epic Games, who have found in Sony the ideal partner to publish an exclusive video game (in the literal sense), which interprets the real-time strategy genre in its own way and takes us for hand in a fairy world... albeit a far from peaceful one! Obese majesty During the early stages of the game, the talented narrator of the Italian edition of Fat Princess tells us the story of the two princesses who one day find a huge and delicious cake in the woods... so good that they can't put it down except once really get, er, tough. Everyone is convinced that the sweet is cursed, a trap concocted by a rival kingdom whose shame must absolutely be washed in blood. And so a war of epic proportions breaks out, fought without hesitation by two peoples, each convinced of their own reasons. Isn't that how it always happens, after all? The main menu allows us to access online multiplayer (~Play with others~), start a game in single (~Play alone~), take a look at the global scoreboard (~Pungetti for everyone~) or adjust the various options available (~Magic knobs~), from where we can also customize our character to distinguish him from the others during group matches. The single game mode includes a story mode (~The Legend of the Fat Princess~) made up of six stages plus a ~final~ one, in each of which we have to reach a particular goal to win. Sometimes it is a question of conquering all the outposts on the map, or kidnapping the princess of the rival kingdom to bring her within the walls of our stronghold, or even carrying out the same kidnapping three times in a row before the enemy does the same. The character we control can move freely within each location (there are nine in all), change ~class~ by picking up and wearing the appropriate hats, be reborn after a few seconds if killed and give simple orders to his companions (~follow me !~ or ~disperse!~), which in theory should also add a strategic component to single-player matches but which unfortunately work poorly: most of the time our allies will prove to be too little clever and even less cunning to guarantee our safety or help us really effectively. The result is sometimes very long sessions, in which we try to put a patch on the deficiencies of the AI, often with little luck and leave the outcome of the mission almost to chance. Things improve when the soldiers become many and the classes pass to the advanced level, but only for a natural discourse of numbers: even a badly organized army can win, if its single elements are stronger than the adversaries and/or superior in number. The ~Dilettati~ mode (ie a random game) and the ~Gladiator~ mode, which is an ideal survival mode to become familiar with the combat system used in the game, complete the possibilities of the single-player game. Dripping fat As mentioned, the ~Gladiator~ mode can help us understand how Fat Princess's combat system works, which is indeed very simple. Our character can carry out his attack differently depending on his class, and defend himself only if in possession of the necessary equipment (the Warrior's shield, in this case). When our vital energy (represented by a variable number of hearts placed in the upper part of the screen) is too low but there are no enemies nearby, we can let the character rest so that he recovers all his strength quickly, or take advantage of the help of a priest. Jelly and flab The multiplayer mode of Fat Princess is clearly the one on which the developers have focused the most, just look at the number of people who can participate in the games at the same time (thirty-two, therefore sixteen against sixteen), with the action that manages to always remain dynamic thanks to the use of bots that replace the playerssuccessful or missing ones to reach the maximum quota. There are four options available: ~Rescue the Princess~, ~Take and Take Away~, ~Death Match a Teams~ and ~Invasion~. In the first case, our goal is to kidnap the princess of the rival kingdom and bring her to our stronghold, avoiding being killed in the meantime and organizing ourselves with our companions if the undertaking should prove particularly difficult. One one of the peculiarities of the game, in fact, is represented by the possibility of bringing slices of cake to your princess to keep her beautiful, heavy and difficult to carry: the enemy team will certainly take advantage of it. ~Take and Take Away~ starts from the same assumptions, but you have to carry out three kidnappings in a row and the first team that succeeds gets the victory.The ~Team Death Match~ is precisely a battle to the death in which the princesses do not matter and the number of ~rebirths~ is clearly limited, while finally the ~Invasion~ mode asks us to occupy all the outposts placed on the map and maintain control of them. The nine available maps are not immediately ~nice~ in the same way, there are differences that are not limited to aesthetics and end up decisively influence our approach to missions. Volcanic areas, for example, are full of pitfalls and become really difficult to manage, especially when there is little time left. Class is not water Classes represent a fundamental game element in Fat Princess: our character can at any time wear one of the five available hats (continuously produced by the relative machines, but also collected on the street) to become a Magician, a Priest, a Guard, a Warrior or a Servant. Wizards aren't very tough, but they have ice-based (basic level) and fire-based (advanced level) attacks, capable of doing massive damage even to groups of enemies. That of Priest is a ~support~ class, which depending on the level can remove energy from opponents or restore that of companions. In the basic level, the Guard attacks using a crossbow, while in the advanced level he uses a rifle (more powerful but less accurate): this is a rather agile and agile type of character, but in serious difficulty at short distances. The Warrior is the class with greater resistance and aptitude for hand-to-hand combat: at the basic level the character uses a sword and shield, at the advanced level he switches to a powerful halberd, thus alternating a balanced situation with one that is based solely on strength brute. Finally, the Servant class plays a fundamental role in the economy of the missions as it is the only character who can collect the wood and iron necessary for the upgrading of the machines that create the hats, as well as to build new devices inside of our stronghold. At the basic level he has a small carpenter's ax, very ineffective in fighting, while at the advanced level he can throw dangerous grenades. Technical realization The graphic style adopted by Titan Studios for Fat Princess is amazing, it manages to mix the typical solutions of children's cartoons with a considerable dose of blood, creating a contrast that is striking from the first glance. The characters can't perform many actions, that's true, but everything on the screen moves smoothly and without smudges, giving the clear impression of a well-crafted product with attention to the smallest details. The upgrade of the hat making machines comes visually represented by an animation that is always the same but very nice, and in the same way the interaction with the environment (in particular the collection of material using the Servant) is rendered well by a series of simple but effective solutions. The sound accompanies the games in a light-hearted way, with nice (albeit perhaps a little intrusive) music and a series of little voices as sweet to the ears as the sound of a chainsaw. The online multiplayer works very well and allows us to create a game, play with friends or search for any session, after which the available options are the usual ones (a player can be silenced or eventually kicked out). Voice chat is not automatic, unfortunately, and you have to activate it by pressing a back button on the Dual Shock 3. As usual, the biggest problem is the shortage of people equipped with headphones or earphones, which is no small feat for a game in which we should always and in any case collaborate and organize among comrades.", "date": "2009-08-27", "grade": "8.4"}