{"name": "Evoluzioni aeree con l'iPhone", "ref": "https://multiplayer.it/recensioni/69925-red-bull-x-fighters-evoluzioni-aeree-con-liphone.html", "text": "Of all the extreme sports, acrobatic motocross is perhaps the one capable of giving the strongest emotions, even if only for those who just watch. The aerial execution of increasingly elaborate and risky choreographies represents the pinnacle of human capabilities, where the slightest error of judgment or the sudden loss of balancing can result in a real catastrophe. Xendex has tried to capture some of these elements, namely the accuracy and the ability to assess risks, to make a series of video games for mobile devices. Of great success, moreover: to date between the three episodes of Freestyle Moto-X and the brand new Red Bull X-Fighters there are something like two and a half million purchases. It started a little quietly, on Java-compatible mobile phones, but right from the start the potential of the franchise appeared clear: the intuition of vector graphics so fluid and colorful, the purely arcade approach and the simple and addictive they conquered everyone. Now the time has come to face the challenge of the iPhone and confirm the good things that have been done. Without hands! Memory, promptness and precision are still the core of the Xendex product: through eight different locations, for a total of sixty-four challenges, our goal will be to achieve a minimum score each time to pass the stage, with the possibility in this case not only to earn cups, but also to unlock interesting ~achievements~. Like its predecessors on Java mobiles, therefore, Red Bull X-Fighters also boasts numbers very interesting and is capable of offering truly lasting entertainment as long as you appreciate its mechanics. You can choose between two different control systems. The default one uses the ~tilt~ of the Apple device to adjust the inclination of the bike forward or backward, so you have to tilt the iPhone left or right to get the desired effect. The only function assigned to a button on the touch screen is braking, which is essential for controlling the vehicle in certain situations. The optional control system is instead more classic and is completely based on the touch screen, with two directional buttons placed on the edge of the screen. Both approaches have their strengths and weaknesses, clearly the inclination of the iPhone must be ~assimilated~ before revealing its potential and in many cases requires some patience. The execution of the tricks is obtained by drawing twenty different ~symbols~ on the screen, and the concatenation of the stunts becomes possible thanks to a sort of ~bullet time~ which is triggered in this situation. For the rest, the usual rules apply: calculate the times well, land in the best way, pay attention to the indications that the game provides us before each challenge. Technical realization Animations have always been one of the strengths of the Xendex product, and on the iPhone it could only continue to evolve. We therefore have a polygonal pilot of discreet workmanship, who performs the various stunts in a convincing way while the shot passes from standard three-quarter view at a close-up taken from the side during ~bullet time~. We are dealing with a distinctly arcade title, therefore the physics implemented is for the use and consumption of the action: the bike rotates forward or backward depending on the inputs we provide, while the grip changes based on the terrain on which we are we find ourselves competing. The scenarios are characterized by rather repetitive and poor quality textures, unfortunately, with a barely mentioned two-dimensional audience and some beams of colored lights to hide a general desolation. The rocking soundtrack seems appropriate to the context, even if we will hardly remember it after pressing the Home button. The tested version is 0.4.0", "date": "2009-08-24", "grade": "7.4"}