{"name": "Sto per scoppiare!", "ref": "https://multiplayer.it/recensioni/69758-splosion-man-sto-per-scoppiare.html", "text": "As it is commonplace to believe, the difficulty lies not so much in achieving success as in being able to maintain it. And so we were all waiting for Twisted Pixel, a more than promising software house that created the pleasant The Maw a few months ago, distributed through the XBLA service of the Microsoft console. However, with the second release, 'Splosion Man, the Texan team managed not only to maintain the quality level of its debut, but even to surpass it. The art of explosion The protagonist of 'Splosion Man is an irresistible humanoid composed of lava, plasma or something similar, born from the most classic of experiments gone wrong in a secret laboratory. The goal is escape to freedom, and the means to it is the hero's innate ability to explode; obviously, however, this power must be managed, and in fact 'Splosion Man can resist up to a maximum of 3 explosions in a row in order not to risk becoming a pile of smoking ash. Fortunately, it only takes a few moments to recover the power and ~reset~ the count, but in any case it is a fundamental element for the progression within the levels and the solving puzzles. Wanting to associate the effort of Twisted Pixel to a specific genre, surely this would be the platform; in fact, the scrolling is two-dimensional, practically always from left to right, you have to constantly jump from one wall to another or on fixed and self-propelled platforms, and there are some enemies to defeat or to make steaks (literally!) thanks to the explosive power. Timing and speed of reaction soon become fundamental skills to ensure successful progression among the fifty levels available; a rather robust number, which guarantees absolutely sufficient longevity not only contextualizing within the 800-point Live Arcade productions. Although 'Splosion Man does not shine for originality by analyzing its individual components, even in the face of proximity to N+ as regards control of the character, the overall result presents a title with a good personality especially for the characterization of the protagonist; it is therefore a pity that the monothematic nature of the settings soon makes the game repetitive on an aesthetic level, depriving the otherwise pleasant and functional graphics of variety. In reality, the repetitiveness is also linked to the situations offered, since the inclusion of new game elements soon stops, then limiting them to recycling in the following levels. Xbox 360 goals The usual 200 points to be obtained largely by completing the single and multiplayer game, but there are more complex requests such as collecting all the cakes scattered throughout the levels. Not a child's game in short. One more effort Therefore, although 'Splosion Man can undoubtedly be classified as a more than successful product, as well as one of the best titles of this 2009 on XBLA, there are some perplexities fundamentally related to the mechanics on which it is based. After having welcomed the player in a more than sweet way thanks to a first handful of stages of increasing difficulty, about halfway through the first chapter one is forced to undergo a sudden increase in difficulty, with the relative discovery of the limits of the gameplay and the check. The fine line between challenge and frustration is in fact frequently crossed by the title of Twisted Pixel; in fact, it often happens that you have to perform a series of actions and jumps precise to the millimetre, perhaps while a relentless hydraulic press is about to squeeze the protagonist or the level of the fearsome water is growing inexorably. It is therefore not uncommon for the progression to be abruptly interrupted by certain passages, and in some cases the unpleasant sensation appears that the error is not generated by the player's mistake, but by the occasional imperfection of the controls or by the excessive rigidity of the level design. For heaven's sake, there is nothing so difficult to force those who grew up on bread and platforms to leave the pad, even in the face of the infinite lives available to the explosive hero and the good amount of checkpoints scattered throughout the levels. But the ~trial and error~ philosophy, i.e. moving forward with the awareness that often you have to die ~at least~ once to then understand what to do and how to continue, is a concept of gameplay that historically has hardly accompanied the most deserving products of the platform genre. Finally, the local or online cooperative multiplayer mode is interesting, which adds further longevity to the final package.", "date": "2009-08-12", "grade": "7.8"}