{"name": "Kingdom Hearts: Chain of Memories", "ref": "https://multiplayer.it/recensioni/kingdom-hearts-chain-of-memories-2.html", "text": "The power of memories... As we said, the bizarre alliance between Disney and SquareEnix for the creation of Kingdom Hearts had misled everyone: the childish Disney spirit would hardly have adapted to the much more mature Square characters, and the result could only be a mediocre narrative jumble. Actually, Kingdom Hearts amazed and surprised. The adventure of Sora, the protagonist, is a concentration of poetry, fantasy and drama like few other stories, sometimes so abstract and metaphorical as to seem what it would like to be: a fairy tale. But Kingdom Hearts is so much more. It all began on Destiny Island, where Sora lived in peace with his closest friends, Riku and Kairi. But one day the island is attacked by the Heartless, monstrous shadow creatures, and Sora is mysteriously transported to another dimension, separated from his playmates. Sora is no longer a kid like many others at this point: he now wields the Keyblade, the legendary weapon that can open the doors to other worlds. After meeting Goofy and Donald (Goofy and Donald for purists), in search of their missing King (none other than Mickey Mouse), Sora decides to join them in the hope of finding Riku and Kairi as well. Traveling from world to world (from Aladdin's Agrabah to Tarzan's jungle, from Alice's Wonderland to Peter Pan's Neverland) the trio will also have to oppose the Heartless and the plans of the evil Ansem , who wants to find and open the door to the world of Kingdom Hearts. But what does this mysterious dimension hide? What's on the other side? Darkness, that's what Sora sees, and Riku and King Mickey fight against thousands of Heartless to keep them at bay and prevent them from crossing the gap. And so, Sora is forced to close the door to Kingdom Hearts behind them, embarking on a new journey with Goofy and Donald Duck, to find and rescue their friends. The power of memories... And this is where Chain of Memories begins, with an FMV that leaves you speechless on Game Boy Advance. A mysterious hooded figure stands in their way and directs them towards Castle Oblivion, where perhaps Riku, Kairi and Mickey Mouse are located, but to enter the manor there is a price to pay: from floor to floor, our heroes will lose their their dearest memories. And so, while each floor becomes one of the worlds explored by Sora, forged by his own memories, driven by the desire to reunite with their loved ones, the three protagonists will end up in the crosshairs of the mysterious Organization ... But Chain of Memories is not only the Sora's adventure: once his narrative line is finished, a new game mode will open, called Reverse/Rebirth, in which we will take the part of Riku (and Mickey Mouse) to find out what happened before and after the Kingdom Hearts grand finale, preparing ourselves to the catastrophic events of Kingdom Hearts 2. In short, a slap-up job that, despite knowing of deja-vue, deepens and clarifies the events of one of the most beautiful stories ever conceived in the videogame world. Not just a card game... The first images shown by SquareEnix of Chain of Memories had filled the most attentive with doubts and perplexities: in the photos and artworks ~cards~ were clearly visible but everyone wondered what their usefulness was, what influence they had on a video game that, at least according to SquareEnix, it was an action-adventure. In the end, it was just about cards, but Chain of Memories is not a card-game: it's not like Magic or one of its surrogates, of course, it's really an action-adventure with one of the most bizarre, but well-crafted play mechanics, never seen. First of all, the exploration of the various environments takes place in an isometric view, guaranteeing an illusionary three-dimensionality. The various locations, the ~worlds~ let's say, are created by the player himself: starting from an initial room, it is possible to open doors to the following rooms using magic cards that will influence the characteristics of the next environment we will explore. For example, by opening a door with the Martial Waking card, we will create a room where our Keyblade shots will do more damage than usual, or by using the Teeming Darkness card we will see more Heartless than usual infesting the location. Oh yes, because the Heartless, as in the prequel for PlayStation 2, appear out of nowhere and wander around the various settings: by coming into contact with one of them, the screen will suddenly change, starting the battle (moreover, as already seen in Paper Mario, hitting a Heartless with the Keyblade it will be possible to start the fight with a few seconds of advantage). We are therefore not talking about real-time battles like in Kingdom Hearts, but that is not entirely true: in the battle screen, in fact, we will have complete control over Sora, who will be able to jump andmove freely to avoid the attacks of various enemies. Chain of Memories isn't just a card-game: it's just an action-adventure with one of the most bizarre, but well-crafted, play mechanics ever seen. Not just a card game... And this is where the highly original and hilarious card-based battle-system comes into play: each attack or spell by Sora will be a card from a deck that we can customize as we like (while respecting certain restrictions) and which will appear in the bottom left of the screen. By pressing the back buttons, we will be able to choose the card to use against our opponents, paying attention to its value: in fact, if our action and an opponent's action cross, the one with the lowest value will be interrupted and the card will be lost. Here, then, are Counterattacks. And that's not all: combine two or three cards, and you will get devastating special attacks. Did you want Firaga? Three Fire cards, and Firaga is dealt. Even the summons have been adapted to the mechanics of Chain of Memories: through some cards it is possible to recall a companion to the screen who will launch an attack and then leave us alone again. And that's how it will be possible to take advantage of the help of Goofy, Donald, Simba, Aladdin, Jack Skellington and many others. Who Said Cloud? Three cards with his big blond face, and you'll see Omnislash again, if you miss Final Fantasy VII. Once the deck is finished, just hold down a button to reload it: the more often we are forced, in the context of a fight, to reload the deck, the longer the process will last and the more vulnerable we will be to enemy attacks. The balance of the battle system is incredible: even the use of the most powerful cards, those of our enemies, has a negative feedback that should be considered before giving in to Sora's ~dark side~. This mechanic makes the battles in Chain of Memories never boring or repetitive, seriously entertaining the player and pushing him to customize his ~combat system~ as much as possible through the composition of the decks of cards, which among other things can be purchased in ~ sachets~ from the Moogle Shops. Thus, from combat to combat, from room to room, we find ourselves wandering in the various Disney worlds, initially selectable at will, retracing the synthesized plots (even too much, to tell the truth) of the corresponding fairy tales. If only the dungeons had been longer and more challenging, everything would have been truly perfect. A portable miracle? Without a doubt, Kingdom Hearts: Chain of Memories is the most impressive GBA video game ever. We are not talking about the introductory film in Full Motion Video, really surprising and well done, but about the entire audio-visual sector. The sprites in Chain of Memories are huge, animated in a very fluid and convincing way (Disney-like?), both the protagonists and their opponents. There are many gems inserted to complete a more than excellent graphic picture: from the portraits in the balloons through which the various characters converse, to the zooms that characterize the most intense moments of the fights (an instant close-up zoom accompanies the last hit of a combo of Sora, the camera pans incredibly out of view to show the rain of lightning that produces the Thundaga and so on spell). The luminous effects that distinguish the most spectacular spells and attacks, made in large numbers and variety, are excellent. The various settings have also been made excellently, despite the random generation of the various worlds leaving no room for a particular differentiation of the various rooms, which in practice present the salient graphic characteristics of a given world in different positions. Even the soundtrack plays the part of the (king) lion: the music doesn't even seem to come out of the mediocre audio player of the Nintendo handheld, remixed on the basis of those heard in the first Kingdom Hearts in order to make the most of the GBA's capabilities to guarantee a musical accompaniment as decent as possible. The result? Exceptional. Sora's vocalisms are also clear and clean, making the battles even more convincing. In short, a technical sector that is truly over the top. Kingdom Hearts: Chain of Memories is truly a revelation. Few believed in this project, branded immediately for a well-disguised commercial operation, and we are happy to deny them: fun, well-structured and varied, Chain of Memories is a programming jewel. Exceptional graphics and sound, but it is the gameplay that makes Chain of Memories unique, a fusion of various natural play mechanisms and perfectly inserted in the context of a very valid action-RPG, also from a narrative point of view, although it will be difficult for newbies to appreciate it sWithout first having played the prequel for PlayStation 2. While waiting for Kingdom Hearts 2, scheduled for September in the American version, Chain of Memories is a bolt from the blue, albeit short (but not too much: between the main-quest, the Reverse mode /Rebirth and the thousand secrets to discover, it's impossible not to come back to play it even after the end credits), intense and surprising. Finally, the two-player mode is worth noting: connect two Game Boy Advances and you can challenge a friend to a fight to the death between your favorite deck of cards and his, in a Versus mode that really couldn't be missed. Pros: Technically excellent. Brilliant and well structured battle-system. Just fun. Cons: Short, but intense. The various subplots are too fast. When Kingdom Hearts for PlayStation 2 was announced more than three years ago, the gaming community almost didn't know how to react to the bizarre news: is the software house author of the famous Final Fantasy working together with Disney on an action-RPG? Really absurd as a thing, and no one will struggle to admit that they were skeptical about what seemed like a real trade. Some even thought it was a joke, and after all how could you think of a video game in which the funny Donald Duck was face to face with the sweet Aeris? Actually, Kingdom Hearts wasn't a joke at all. Kingdom Hearts is still one of the best video games ever made, a concentration of fun and poetry like few others have ever seen. It is impossible to remain indifferent to its charm, unless you viscerally hate the Disney universe (which is decidedly unlikely: who hasn't loved Mickey Mouse?) or that of Final Fantasy. Or both. But the truth is that Kingdom Hearts, for those who played it, was an experience that was hard to forget. An experience, moreover, which this year will see a sequel, Kingdom Hearts 2, on PlayStation 2, which promises sparks. Therefore, the decision to create a chapter of this new saga for Game Boy Advance, and not a port or a separate adventure, leaves us amazed once again: just a narrative link between the two adventures for the Sony console. Basically, if you don't play Chain of Memories, you won't understand many passages in the plot of Kingdom Hearts 2 (and others from the prequel will remain obscure to you). Having made this premise, let's summarize the review in one word: masterpiece. And we explain why.", "date": "2005-01-13", "grade": null}