{"name": "Storie d'amore sul DS", "ref": "https://multiplayer.it/recensioni/69534-secret-flirts-storie-damore-sul-ds.html", "text": "The goal of the game is clear from the beginning, when the protagonist's best friend takes on the role of ~Love-coach~ and dispenses useful advice on how to win boys' hearts. If at first it might seem that it is only the physical aspect that dominates, later one realizes that the skills to be developed do not end there: one will have to commit oneself not only to improving one's physical shape, but also to popularity and, fortunately, in education. The Love-coach provides the character with the ~tools of the trade~; thus you come into possession of a mobile phone, thanks to which it is possible to interact with the various characters both with calls and text messages, and a secret diary, in which the affinity with the boys known is signaled and in which all the valuable advice on the dynamics of the conquest. While the former item is undoubtedly helpful in game progression, the latter sincerely is irrelevant to the story, good at best for visualizing the teachings of the day. A decidedly more interesting tool is the city map, thanks to which the character can move through the many proposed environments (and which can be unlocked as progress is made), also locating the different ~preys~ to be conquered. After having mastered the supplied items and having carefully chosen clothes and makeup, the character just has to jump into a new adventure! New friendships The encounters that the protagonist can make are the most varied: from lovers of sporty girls to those of cultured girls, from computer enthusiasts to the most staunch ecologists. The common feature of all the first meetings is that almost none of the boys are willing to get to know each other and this will be the stimulus to improve themselves in the various skills required (in fact, we start from a minimum level of ability). A useful way to impress is to frequently take care of your look, both in terms of make-up and clothing, highly customizable thanks to the various shopping opportunities available in the city. Or still train in the gym and engage in study. After some sacrifices, once a boy's interest has been gained, we finally move on to the actual interaction, made up of back-and-forth dialogues. What you perceive as you progress through the game is unfortunately a certain repetitiveness: so it happens to be asked three times by the same boy if his new pair of shoes is nice or if the protagonist loves nature. Another flaw is the need to indulge every single passion of the boy (the only way to be able to increase one's affinity): the exchange of different ideas is certainly not appreciated by the characters of ~Secret flirts~... An adventure made of minigames That of the mini-game, in Secret Flirts, is a constant. Interactions with objects and people are mostly done like this. Broadly speaking, three different categories can be identified: the first is dedicated to skills (such as studying), the second is the one necessary to earn a salary, the last, the most interesting, is the protagonist of flirts. The first two categories are practically identical, always being a mini-game with an almost unsettling simplicity in which you have to touch the right image to earn skill points or money. Those dedicated to interaction with kids, on the other hand, are undoubtedly more varied and fun, even if still very simple; so you will have to shoot arrows towards the greatest number of hearts, try to hold your partner's hand for as long as possible or even blow hard into the microphone to try to dampen the blushing of the shy protagonist's cheeks. The decision to base the progression of the story on a series of mini-games is undoubtedly right and ideal for ~enlivening~ the situations; however, there isn't much challenge for the player: even as you progress, you don't notice an increase in difficulty at all, which in the long run makes the game slightly flat, or in any case not suitable for an audience accustomed to very different challenges. Finally, the presence of the multiplayer mode could have stimulated competitiveness and increased the difficulty of the game; if only it wasn't designed simply for chatting with friends...", "date": "2009-08-03", "grade": null}