{"name": "Golf per tutti", "ref": "https://multiplayer.it/recensioni/69571-lets-golf-golf-per-tutti.html", "text": "Although it has already been available on the App Store for a few months, Let's Golf by Gameloft deserved to pass under the gauntlet of our reviews for three reasons: the first is the substantial lowering of the price compared to the launch price, now set at the very accessible 1.59 euros. The second is the small number - for the moment - of golf-themed games worthy of the name on the Apple platform. And the third is the excellent quality of the product, which in fact makes it advisable for every fan of the genre. Originality this unknown It is well known that Gameloft does not particularly address originality and innovation, and Let's Golf is no exception; in this case the obvious point of reference is the appreciated Everybody's Golf series for Sony platforms, from which the French product draws most of the characteristics. Starting with the graphic component, which is based on the super deformed comic style for the athletes and more generally on a particularly lively and bright color palette. An inviting approach therefore, entirely polygonal which gives the title overall a valid, detailed and more than pleasant aspect; apart from the not very high frame rate, a fairly secondary factor in this type of product, there are no particular defects to report from this point of view. On the other hand, the opposite goes for the sound, which is based on a few well-repeated and annoying songs and effects. There are 4 routes available, two of which are available immediately and the rest to be unlocked thanks to one's own performances; 63 holes in total, a respectable number which, together with the 3 difficulty levels, guarantees longevity and a discreet challenge factor. Let it be understood that for veterans, or at least for those who have acquired a good familiarity with the control system, only the difficult setting is able to require a little extra attention and concentration. There are also 4 characters, obviously equipped with differentiated characteristics and customizable at will. Finally, as regards multiplayer, it is limited to the pass to play solution or to local wi-fi; nothing online then, but all in all it could have been worse. The control system is based on the classic mechanics of the genre, therefore with the bar to be stopped with a tap for power, and with a second tap for precision. A (again) completely non-original system but tested to the point of not lend itself to any criticism; handling of the touch screen is also very positive, and it only takes a few moments to become perfectly familiar with all the commands available. The tested version is 1.1.0", "date": "2009-08-04", "grade": "8.0"}