{"name": "Una babele di torre", "ref": "https://multiplayer.it/recensioni/69417-final-fantasy-crystal-chronicles-my-life-as-a-darklord-una-babele-di-torre.html", "text": "The game is available on the Nintendo WiiWare service. The Crystal Chronicles series can be said to be something of a breeding ground for alternative ideas from Square Enix. A very mature and advanced project, started several years ago: taking advantage of a well-established reference universe which acts as a background by proposing already consolidated settings, characters and traditions - elements that can be associated with the definition ~Final Fantasy~ - having to doing with spin-offs (or spin-offs of other spin-offs) allows you to experiment with new playful solutions with a certain freedom. Considering only the most recent chapters, Crystal Chronicles served Square Enix to propose its vision of action adventure fantasy, strategic-management and, finally, the newborn genre of ~tower defense~. After the Crystal Defenders, built on a typically ~mobile~ gaming rig, My Life as a Darklord takes on the configuration of a more complete title, albeit conveniently placed in the downloadable games category. The game obviously refers to an opposite of My Life as a King, one of the first WiiWare titles as well as another particular experimentation by Square Enix in the field of strategic management. However, the game we are considering is not a negative equivalent of the previous title, but is based on a completely different structure. The protagonist of the story is the young descendant of a ~Darklord~, who having reached the age of reason (more or less) decides to finally take control of the evil family army and wage battle for the peaceful neighboring kingdoms. In the path of conquest, there will also be room for a certain progression in the plot, always told through simple written dialogues and characterized by a somewhat witty tone, and for crossroads and detours that allow sub-quests useful for collecting experience and extra objects. Tower defense The game structure follows precisely what the name given to the genre seems to indicate: the Darklord moves around the game map carrying his personal tower, on top of which resides the dark crystal that must be protected at all costs. As in the good old Dungeon Keeper, here we are limited to waiting for the arrival of the unfortunate, spotless and fearless adventurers who attempt to climb the tower to reach the crystal. Obviously, the player will have to prepare an adequate reception in order to prevent this from happening: it is a question of inserting various floors inside the tower, and filling them with traps and evil units, obviously trying to follow a planned strategy, since not all the units have the same effectiveness against certain enemies, and above all each has a certain cost. Each operation requires a certain expenditure of ~negative points~, which in addition to the initial endowment are recharged with the defeat of the enemies. The various floors of the tower must therefore be built, and filled with the appropriate defensive units: each floor is characterized by an artifact endowed with a particular power that supports the entire room. Equipped with defensive or offensive capabilities, the artifacts characterize the entire floor, in some cases influencing the disposition of the units to be flanked. The latter are of various classes (they are gradually unlocked by continuing in the game) but basically belong to three macro-genres corresponding to those of the opposing units, which are characterized by a cross-relationship of forces similar to the principle of Chinese paper: the melee units beat ranged ones, the latter are effective against magical units while wizards beat melee units. This structure is in some cases so rigid that some small errors in the selection of fighters to be deployed can be fatal, since the order of attack of the enemy units is not known from the beginning, and the units cannot be moved or modified ( until after their deletion). Life as a dark lady Once the defenses are organized, we are ready to welcome the enemies: the daring adventurers climb the tower floor by floor, facing the units they meet along the way through fully automatic turn-based combat. A timer marks the time of the encounter: once it has expired (if he is still alive, of course) the adventurer goes upstairs. Only one enemy at a time can occupy a floor, so if they overlap they will occupy the first free floor above, something to keep in mind as an adequate number of floors inside the tower is necessary (in any case expandable once the battle has begun). During the action the player observes the situation and intervenes by building new floors, inserting units in spaces lfree or possibly by investing funds in increasing the level of one's followers, if this has been unlocked, to increase its potential. In addition to the negative points necessary for the purchase of plans and units, the other currency present is in fact the ~negative karma~ which is conquered at the end of the levels. With this it is possible to expand the maximum number of floors to be inserted in the tower or to unlock new levels of experience for your fighters, to be applied to the units during battles always with a certain expenditure of points. The graphic aspect is quite simple, in line with the principle of the downloadable game, but you always notice the particular clean and well-finished touch of Square Enix. There is not much to see and discover as in the end the whole game takes place inside the tower, whose representation is somewhat stylized, while the story unfolds through static dialogue skits, however the staged world always manages to be distinctive and engaging.", "date": "2009-07-30", "grade": "7.8"}