{"name": "Reami virtuali per tutti", "ref": "https://multiplayer.it/recensioni/69529-free-realms-reami-virtuali-per-tutti.html", "text": "The fact that videogames interest a transversal audience and, above all, need a similar content variety, are rather young concepts in the console panorama which in recent years, especially on Nintendo platforms, has seen the flourishing of a multitude of titles dedicated to a user generally not or little considered. On PC it's a different story, since the idea of a fast game that can be enjoyed by everyone has been around for a long time, first in the form of flash games that may not be of high quality but are extremely simple and replayable, and now with an increasingly large group of online mass-market products aimed at younger and non-gamers. Titles often capable of being innovative, for example by embracing free use systems combined with micro-transactions - small payments to be made to obtain items or specials benefits - so as to capture the largest possible user base and then convince them to invest in what, above all thanks to the implications of social networks, has in the meantime become a real pastime. A path now also traveled by a giant like Sony Online Entertainment which, engaged in more traditional projects such as DC Universe Online and The Agency, nevertheless found the time to launch Free Realms last April: the data speak for themselves, 5 million users in four months for a growth that doesn't seem to end and that it was impossible not to go and investigate more carefully. Genesis of an alter ego What impresses in Free Realms is how the developers have managed to review the classic system of online role-playing games: usually the concept of challenge is the main mechanism used to move the thin threads of design behind such a product, that complex of mechanics capable of committing and rewarding, making one's virtual alter ego evolve; in this case, as the perspective changes, the guidelines with which the experience is defined have also changed, rotating on the side a progression that is usually vertical, giving everything at once. It is therefore not a question of obtaining but of improving what you already have, starting from the creation of a customizable character in appearance - male or female, human or a sort of flying creature, passing from the color of the skin, the hairstyle and the 'dress - and then with fourteen different classes (or jobs) to choose from at any one time, seamlessly moving from one to the other and improving your knowledge by practicing them. The games therefore allow you to range on all fronts, devote yourself to your favorite activities at that moment and improve yourself progressively, while concentrating on creating a friends list as large as possible as well as acquiring new objects. All for free, with a $4.99 subscription available to anyone wishing to have access to the four exclusive classes, some specially created missions and two additional spaces to have as many additional characters, with a virtual shop ready to welcome thousands of more or less useful items secondary, available for purchase separately. A bit for all tastes The idea of creating an MMO for everyone, as mentioned, came from the decision to immediately put them in a position to explore all the trades: ten open to all four, as already noted, only for subscribers. The combat classes are reduced to the typical styles of the genre - mage, ninja, archer, doctor and warrior - and carry out their combative activities within instanced areas, separated from the persistent world so as not to contaminate the other gameplay folds, linked to professions such as postman, chef, miner or kart driver, each featuring a mini-game such as delivering letters or, similar to Coocking Mama, preparing a number of different dishes. In short, Sony has thought a little of everyone, forcing the hand in wanting to put as much meat on the fire as possible and creating a mix of genres that may not be particularly fluid but of extreme variety, allowing you to switch from one area to another or to focus only on the one closest to your tastes, even inserting a trading card game so as not to miss anything and thus giving even more horizons to the virtual shop inside Free Realms. Given the effort and amount of different content, all quite well done, however, the distance of the title from the most passionate users - call it hardcore gamer if you prefer - who will not be able to find the depth of a normal online role-playing game remains unassailable; do not expect World of Warcraft or Guild Wars, in short, Free Realms is a product aimed at those who have their first experience withMMO or to all those who do not have many hours to constantly devote to it, so much so that solo play is encouraged more than group play. Technically the watchword was functionality, with characters and environments designed in a comic and colorful style, the former well animated and the latter quite varied, even if they fell into the typical landscape typologies of fantasy.", "date": "2009-08-03", "grade": "8.0"}