{"name": "Et voil", "ref": "https://multiplayer.it/recensioni/69383-drawrace-et-voila-con-un-dito.html", "text": "We know that it's impossible to expect an iPhone screen to remain clean and free of fingerprints. However, when we are faced with an iPhone on whose display the ~fingerprints~ draw circles and doodles, there are two cases: either the owner of the device has crossed the boundaries of Apple fanboysm, passing into a real fetish, or he is a passionate DrawRace player. Developed by RedLynx and available on the App Store for only 79 cents, this original and innovative racing game uses the touch screen in a truly imaginative way: without resorting to virtual joypads, it puts complete control of the car in our fingers. The gameplay of DrawRace, to be honest, has an almost turn-based strategy feel. In fact, to ensure that our car travels the entire track and for all the required laps, we need to draw with our fingers the trajectory that the vehicle will follow as soon as the traffic light turns green. It's really as simple as it gets imagine, if not more. You select a track from the twenty available (to be unlocked as you complete the races), wait for the start and start drawing. When the job is complete, the race is officially underway and the car follows our 'directions' to the letter, even when the trajectory plotted isn't precise enough and results in an unforeseen collision. Each race involves a challenge with a preset opponent and is overcome only in case of victory, then giving us the opportunity to replay the circuit in ~time trial~ mode or in online multiplayer. The latter option has been implemented in an extraordinary way, so that the search for the human opponent is almost instantaneous. Too bad there is no possibility of interaction that goes beyond the simple rematch. Multiplayer is also present locally: up to three people can play by passing the iPhone, drawing their own trajectory in turn and then watching the race together. Picking your head while driving is prohibited The technical sector of DrawRace is revealed in the behavior of the car with respect to the ~instructions~ that we provide it as well as in the response of the touch screen to the swipe of the fingers, given that the speed with which we draw the lines then translates into the acceleration of the vehicle for the stretch of runway concerned. In both cases, an excellent job has been done: the behavior of the car is more multifaceted and full of depth than expected. may think at first, with factors such as road holding and the type of asphalt making the difference. As regards the purely aesthetic aspect, however, there are no elements that suggest a high-level production: the cars are very simple sprites that rotate at every turn, while the tracks provide an essential scenario without particular cues. The drawing style of the pilots is discreet but spoiled by excessively thin strokes, while the musical accompaniment is so ~old school~ while not winning the ear. Given the extremely low selling price, it was frankly difficult to expect more. The performance of online multiplayer, as mentioned above, is excellent and allows you to organize fast and exciting matches in seconds. Finally, the ability to enter your times in the national rankings at the end of the game is a great way to promote challenge and replay value. After all, DrawRace is one of those titles that with a pinch of enthusiasm and participation can really entertain for a long time. The tested version is 1.05", "date": "2009-07-31", "grade": "8.0"}