{"name": "Battlestations: Midway - Recensione", "ref": "https://multiplayer.it/recensioni/battlestations-midway-recensione.html", "text": "Ready to sail in 5 minutes Before embarking on any mission made available by the game, it is necessary to learn from the appropriate tutorials, very numerous and well detailed, all the commands available to us to drive the vehicles that we will find ourselves having to control in the best way: from this point of view BM is placed exactly in the middle between the real simulation and the arcade, guaranteeing a good compromise between action and control. For example, when driving an airplane we will only have to worry about the damage suffered (visible through a classic bar that is initially all colored), the speed knob and the flight altitude, which is particularly important if you have to fire torpedoes against enemy ships or bomb targets dive. From the point of view of the submarine, however, the game changes completely: attention must in fact be directed towards the amount of oxygen present on board, the damage suffered (this time repairable using the appropriate panel) and the level of immersion depth; the latter is particularly important as once mastered properly it will be our best resource to prevent the sonars of enemy ships from identifying us, as well as not allowing depth charges to cause damage to the hull of our submarine jewel. Even the naval battles on the surface of the water are no less: depending on the type of vehicle on which we find ourselves (aircraft carriers are also available) we will have to face enemy planes using the appropriate artillery, or switch to heavy weapons including the very painful torpedoes. In any case, once the tutorials have been completed, the player will need a period in which to practice all the resources available for each type of vehicle within BM, which varies according to the propensity towards a title of this kind. After this phase, the variety of the game is also guaranteed by the impressive number of over 60 air-naval vehicles, faithfully reproduced on the model of aircraft and ships that took part in the conflicts of the era in question. From 0 to myth In the single mode of BM we find ourselves in the role of Henry Walker, a simple newcomer in the US navy, protagonist together with others of the attempt to defend the Pearl Harbor base from the attack of Japanese planes. Following his mission after mission successes, we will find ourselves commanding the US fleet in battles such as that of the Coral Sea, the first in history to take place between two aircraft carriers, and that of the Midway Islands, the climax of the clash between the United States and Japan on the of the Pacific Ocean. The missions are quite varied and engaging, above all thanks to particularly stimulating scenarios, in which we find ourselves practically having to drive every type of vehicle made available by the game, which can also be used as a strategic vehicle if necessary: in fact, imagine having 3 squadrons of aircraft, 2 destroyers and an aircraft carrier; if we had to drive all these vehicles together at the same time, it would all go down the drain, don't you think? In cases like this, the game comes to our aid, offering the possibility of giving orders to your teams, then making yourself comfortable and blissful in passive mode to observe how they carry out the mission entrusted to them, thus giving ample space to devise and experiment with tactics airships, particularly useful in multiplayer mode. It is no coincidence that the mention of the game arrives via the Internet, as it is no mystery that the developers have also focused decisively on this aspect of BM, offering impressive numbers, not so much in terms of players on the map (from 2 to 8) , but giving them the opportunity to control over 100 units, thus giving rise to epic battles in which strategic skill will make the difference, without however disdaining the possibility of carrying out a particular maneuver on the field with greater success than the same, if performed by the game's AI, which to be honest is in any case practically flawless at all times. Let's not forget in this regard that in the single mode there are 3 different levels of difficulty, very well balanced between them, capable of making the joy of casual players and hardcore gamers, as well as the challenge mode, in which we find ourselves having to deal with particularly intricate driving one of the 3 types of vehicles available in BM. Even the eye wants its part Looking at the screenshots around this same review, you can see how much the development team has been attentive to even the smallest details: bases and hangars teeming with busy soldiers, ships, planes and submarines made with extreme care, as well as a morewhat a satisfactory reproduction of natural elements, in particular water, contribute to making the BM engine a gem, above all considering its fluidity even in the busiest situations of battle. Tested on an Athlon64 3800+ X2 with 2Gb of RAM and GeForce 7900 and a Centrino Duo T2300 with 1Gb of RAM and Radon Mobility X1600, the game was always playable at maximum graphic detail, which may not match that of Gears of War for Xbox 360 owners, but it will still do its job more than satisfactorily. As for the audio, we have a soundtrack that accompanies the game actions, changing the type of melody in the various phases of the battle, while the speech is in English with the possibility of displaying subtitles in our language, except for the various tutorials , all dubbed in Italian. Battlestations: Midway is one of those games that you potentially never get tired of Conclusions Battlestations: Midway is one of those games that you potentially never get tired of, even just by repeating the missions in single player mode over and over again, without therefore bothering multiplayer games. It is certainly obvious that the added value over time for BM is precisely this aspect, as the game has all the credentials to become a new must have for all online players, whether they are owners of a PC and/or a Xbox 360. The variety of means available, the game mode divided between simulation and strategy and a more than good technical sector make this title one of the best for the next month of February, as well as a new ray of light within a particularly inflated setting in recent times. Pros Guaranteed fun To be played in multiplayer Excellent longevity even if played only in single Cons A little high learning curve Battlestations: Midway is available on PC and Xbox 360. The version tested for this review is the PC version. Achievement Points In the Xbox 360 version of BM there is the possibility of obtaining achievement points, through the achievement of certain objectives for a total of 1000 points available. The proposed objectives include the completion of the various single-player modes, also differentiating the points earned based on the set game difficulty, and then moving on to particular conditions also concerning multiplayer, such as the medal obtained for having preferred a certain type of means of war (Service Medal) or the one that is achieved on the basis of the kill/death ratio within one's own team, which is also differentiated on the basis of various levels. The final awards are composed of the medal obtained by completing the single campaign on Veteran difficulty and the Service and Marksmanship objectives, where the latter consist in the successful use of torpedo missiles, anti-aircraft and artillery. WWII The endless line of titles set during the greatest war of all time is essentially divided into two parts: the more classical ones, in FPS style, and those which, thanks to their innovations, have contributed to making the titles set in a historical period more interesting overused by game developers. Among these, we also find the Battlefield series, which by introducing the possibility of driving war vehicles has been able to give new life to its genre, boasting a large group of loyal online players. Although the differences between Battlestations: Midway and the effort of Electronic Arts are more than analogies, the inspiration that the Hungarian developers of Eidos have drawn from Battlefield is quite clear, thanks to which they were able to work on creating a game that in part allowed the player to control the vehicles through a mode halfway between classic action and simulation, and which at the same time gives the possibility to put all one's knowledge of aeronaval tactics into the field, also (and above all) against other human beings via the network. The story of BM is known to almost everyone: announced years ago for PC, PS2 and Xbox by Mythos Games, it has seen numerous postponements to finally reach the present day always on PC, but on consoles only for the nextgen version of Microsoft.", "date": "2007-02-08", "grade": null}