{"name": "In campeggio con pap", "ref": "https://multiplayer.it/recensioni/69291-another-code-r-viaggio-al-confine-della-memoria-in-campeggio-con-papa.html", "text": "We really needed it, it must be said. In the midst of the many casual games, mundane action games, sports of all types and genres, hit and run experiences that make up the majority of the offer on Nintendo Wii, it was time for an intriguing, challenging old-fashioned adventure to arrive , full of twists and turns and engaging from start to finish. Too bad that to see it we will have to wait a little longer since Another Code: R could have been all these things, but in reality it is clear how unfortunately the Cing programmers have decidedly failed this time. I preferred the other code Fans of the genre will probably have had the opportunity to appreciate the previous works of the Japanese team, which has collected the greatest successes on Nintendo DS with Hotel Dusk and precisely Another Code: Two Memories. In both cases it was a matter of solving mysterious cases, narrated in a lively way, and above all with a sufficiently enthralling rhythm. And it is precisely here that the first and serious weakness of the Wii debut is found on the contrary, linked precisely to the focal element of an adventure: the narration. Far from the levels to which Cing had accustomed us, in Another Code: R the adjective that comes closest to describing its qualities is, simply, soporific. The endless and verbose dialogues wouldn't actually be a big problem, given that synthesis has never been among the qualities of the Japanese team's productions. But what is missing is the content, the common thread capable of pushing us to continue with the curiosity to see what happens next. It takes at least 3 or 4 hours to get the better of a prologue in which practically nothing happens, and then move on to something concrete and sensible for playful purposes; and even past that hurdle, what follows is a rosewater storyline that certainly won't stick in the hearts of players. The events still see the Japanese-American Ashley as the protagonist, now sixteen; two years after the first adventure in which he tried to shed light on his mother's untimely death, in this chapter the father is at the center of the story, who was born and developed in a campsite on the shores of an elusive Lake Juliet. A not very electrifying location, which in fact does not lend itself to getting the narrative off the ground; a similar and equally serious discourse for the characters who, except in rare cases, are characterized by a totally flat and anonymous characterization, devoid of facets that can offer different interpretations. The dialogues then really reached exaggerated levels of length, talkative even on the most useless and negligible aspects; the clear feeling is that they become a way to artificially extend the total duration of the game rather than to offer something substantial. The continuous pressure of the A key to continue in the exchange of jokes is only rarely interrupted by the need to make choices which, however, in reality, are practically never decisive given that the script does not include junctions or variations. It is therefore more than evident how Nintendo wanted to lower the user target with this chapter of Another Code, trying to give life to what should have represented an ABC of adventures for adolescent players, preferably female. But to achieve this goal, the wrong path was taken, the one that translates accessibility into simplification and trivialization. Sleeping pill on dvd? What therefore makes Another Code: R a disappointment is precisely the awareness of Cing's previous exploits, a team more than capable of giving life to products of different thicknesses. However, it would be unfair to evaluate the Nintendo production as a failure, in the face of aspects that in any case allow a more or less evident glimpse of the capabilities and potential of the game. Above all the graphics, particularly apt and pleasant, which adopts the cel shading solution for the characters inserted in settings that mix 3D and hand drawing, with a use of color that allows you to associate the final result with a kind of illustrated book . And also with regard to the puzzles, flashes of light can be glimpsed, above all for the use of the Wiimote which finally on such occasions frees itself from the role of pure management of the cursor; on DS Cing had amazed for the innovative solutions introduced, and also with this chapter the team tried to maintain similar levels, which however, despite the effort, were not fully achieved. The reason? obviously the (yet another) simplification that has also touched the depth and difficulty of the puzzles themselves, but despite this you can still encounter pleasant puzzles especially from the middle of the story onwards. The interface, on the other hand, is very gooda, thanks to an intuitive method of interaction with the environments supported by a convincing inventory management; the return of the DAS is also pleasant, a sort of handyman computer that looks like a DSi and is fundamental on several occasions. On the other hand, the discourse relating to the control of the protagonist within the environments is questionable; his movements are in fact limited by a sort of rails to be traveled in a two-dimensional way without freedom of exploration. The player has only the possibility of making Ashley move forward or backward, and possibly make her change ~track~ at the crossroads exactly as on a railway exchange. Finally, longevity is expected between 12 and 15 hours.", "date": "2009-07-24", "grade": "5.8"}