{"name": "Orso al volante", "ref": "https://multiplayer.it/recensioni/69292-enviro-bear-2010-orso-al-volante-pericolo-costante.html", "text": "With Enviro-Bear 2010, developer Justin Smith has achieved quite a feat; make a small cult a game for all the opposite reasons to those that usually contribute to its success. Porting of the almost homonymous Enviro-Bear 2000 for the Windows platform, it is in a nutshell the emblem of the ugly that becomes beautiful, of the taste for the horrid, the repulsive that changes for some strange reason into attractive. A product so unusual and particular as to become irresistible for those who are able to get on its wavelength. Target hibernation The premises are simple: in the role of a bear, you have to drive a car for 5 minutes trying to collect enough food to get fat and then happily go into hibernation. No, you don't need to reread this sentence, it's all correct: although it is difficult to understand how a human mind can give birth to such a concept, this is actually the underlying theme of Enviro-Bear. Yet in the absurd, there is a certain logic within the world created by Justin Smith, which is realized when our bear actually has to drive the car; the poor mammal, devoid of the human ability to maneuver a motorized vehicle, must in fact act with a single paw on the controls, therefore making it necessary to use them one at a time, alternating them in such a way as to be able to move around. And so maybe you put the gear forward, then you press the accelerator to get a little gas, and finally you switch to steering to direct the car; the mix of these elements makes movement within the location possible - a forest strangely populated by other bears at the wheel -, with a final result that is as awkward and cumbersome as it is hilarious to say the least. Going against trees or ponds, if you are lucky, you will be able to receive fish or fruit directly inside the cockpit, to be collected and brought to the animal's mouth to feed it and thus get closer to the final goal. But the road to hibernation isn't all downhill, and the unexpected is around the corner ready to materialize; going to hit the wrong shrubs or rocks you will see the dashboard filled with stones, pine cones, leaves or even an annoying and hyperactive badger to be thrown out the window as soon as possible. Basically Enviro-Bear is all here: an absurd but strangely attractive concept, which pushes you to play trying to make your bear fat level after level. And this despite the fact that there would be every reason to say otherwise, starting with an imprecise and frustrating control system that makes it difficult even to simply shift the car's gear, and the repetitiveness that appears after practically a minute. But the absurdity of the context and the madness of the gameplay, provided of course that you are inclined to this type of ~alternative~ product, give the product a completely unique charm. We have left the graphic aspect for last, because it really is sensational; deliberately awful, stylized, childish, almost devoid of details and full of bugs, but for this very reason irresistible. The tested version is 1.0", "date": "2009-07-24", "grade": "8.0"}