{"name": "Il mio Coach in cucina", "ref": "https://multiplayer.it/recensioni/69177-il-mio-coach-di-cucina-il-coach-si-mette-ai-fornelli.html", "text": "Before getting to work, ~My Coach in the kitchen~ offers a long introduction dedicated to customizing your recipe book. The preliminary step consists of entering your data (for Nintendo DSi it is also possible to add a personal photo to your profile), not only as regards the most minor personal data, but above all for your experience with the world of cooking: in this way, one's own habits in terms of availability of time and budget, and the level of difficulty of preparation are requested. A very important section in the scenario of the entire game is the presence of a real ~virtual fridge~, within which it is possible to select the favorite ingredients or eliminate the foods to which one is allergic (or which simply do not meet the own taste). Creating your own ~selected~ fridge will come in very handy when you need to get to work: no recipe will be excluded from the recipe book, but those containing ingredients placed on the ~black list~ will be notified via notification. To complete the customization operations and perfectly recreate all the details of your kitchen, all that remains is to declare your equipment and get ready to play the role of a chef! Let the stove light up After the necessary preparations, the cook can finally take up the tools of the trade and follow the advice in the recipe book step by step! 240 unique and particular dishes (250, if you use the Nintendo DSi) can in fact be consulted in different ways: it is possible to view the complete list, just as you would with an old-fashioned recipe book, rely on the proposal of the day or even look for the most suitable for your case, directly selecting the ingredients you want to use. Or even look for a recipe based on your economic budget, time and difficulty, or, for slimmers, based on calorie intake. Once the difficult choice has been made (the dishes on offer are truly delicious) it's time to try your hand at the culinary art: the first step is to take a look at the list of ingredients, the necessary tools and the ~schedule~ of work. When everything is ready, the voice of the ~coach~ will describe every single step and, thanks to the voice recognition program, the cook won't have to fear the possibility of flouring his console. The use of ~My Coach in the kitchen~ thus turns out to be a simple and intuitive tool, truly addressed to everyone, thanks also to the presence of a clear and essential interface: having fun in the kitchen will be easier than you might imagine! It looks like a game but it's serious Newbies to the culinary art shouldn't feel lost in the presence of the great variety that distinguishes the world of cooking. For those who have no idea where to start, the ~coach~ provides a veritable dictionary of ingredients, tools and specific techniques, from the simplest to the most daring. Once you have learned the culinary fundamentals, you can indulge yourself with the various tools offered: a calendar for planning the preparation of the course and a ~shopping list~, in which you can record every single ingredient of a specific recipe chosen and check it off as soon as it is it has been purchased. Finally, a timer to use even in the middle of preparation and a unit converter, to juggle between kilograms and pounds. ~My Coach in the kitchen~ therefore establishes itself as a tool to learn and improve one's techniques, but also to find ideas for more original dishes than a simple pasta with sauce. Although this sort of interactive guide has been created for a console, the user must not be misled into thinking that he is in front of a game: the playful aspect is in fact relegated to a minimal and irrelevant section, totally in the background compared to the rest. For this reason, the ideal user is not someone looking for entertainment on the DS touch screen, but someone who, with the help of this tool, finds entertainment and creative expression among pots and pans. Comment 250 recipes, one for all tastes Several options to meet every need DSi support The playful aspect is predictably limited", "date": "2009-07-21", "grade": null}