{"name": "Dannazione eterna", "ref": "https://multiplayer.it/recensioni/69067-doom-resurrection-dannazione-eterna.html", "text": "For many id Software is a brand closely linked with the technological evolution in the PC environment; a software house which, thanks to the genuine work of John Carmack, a true guru of the visual progress of videogames, was able to demonstrate twenty years ago that it was also possible to have a horizontal scrolling platform on PC (Commander Keen) and, a few years later, created the first example of a first-person shooter with that Wolfenstein 3D that literally made history. However, id Software has always been able to invest even in small projects parallel to its most important franchises and often linked to platforms that the market had just begun to discover. It is on this basis that DooM Resurrection was born, the first video game created by the Texan company specifically for the iPhone, also developed thanks to the partnership with Escalation Studios. A game that draws heavily on DooM 3 released on PC 5 years ago but which fits into the trend, recently a little too flourishing, of rail shooters at the House of the Dead. On tracks yes, but not too much The story of Resurrection sees our avatar, a strictly nameless marine in full id Software style, land on Mars just in time to witness the coming of demons on the red planet and forced by events to reach the control station of a series of teleporters escaped the control of a group of scientists. On the journey he will be accompanied by Sam, a small flying robot remotely controlled by one of the few survivors of the tragedy, the only element capable of dissecting the little plot instilled in the game. So all we have to do is watch the protagonist accelerate his walk through the entire space base, killing hundreds of monsters and collecting ammunition and weapons scattered throughout the environment. Let's forget any puzzle element or the need to retrace our steps to use the object or key collected in some remote point, as per DooM tradition: here the gaming experience is completely linear. However, where Resurrection innovates is precisely in introducing tasty and peculiar elements to the otherwise static gameplay typical of rail shooters. Unlike what one might expect, the aim is taken by tilting the iPhone while the four corners of the screen are dedicated to the ~touch~ component of the game: the right corners manage weapon reloading (top) and the action to shoot (bottom), while the left corners can be tapped to switch weapons (top) and to dodge imp fireballs or take cover during attack by marines (bottom). Everything can be mastered in a few moments thanks to the first few minutes of the game which act as a real tutorial. You will be able to carry a maximum of three weapons at a time which can be collected, together with ammunition and medkits, by touching the screen as soon as we see any appear. Precisely this last action probably represents the biggest flaw of the game given that very often the screen seems to be inaccurate and you will be able to collect the objects only after touching them several times, often ending up activating one of the four ~sensitive~ corners to the precise choice of the designer to place the most precious ammunition at the limits of the visible area. After all, it's still id Software Nothing to criticize instead about the technical aspect of DooM Resurrection. Very pleasant to watch, it obviously falls within the canons of the series with rather sterile and extremely gloomy environments, full of ~dirty~ technology and packaging material scattered almost everywhere. The enemies are then directly borrowed as models, animations and audio, from those seen in DooM 3 with a graphic rendering of sure impact. Too bad only for the practically total absence of any form of musical track. The title runs absolutely smoothly, except for the first seconds of gameplay as soon as the game or level is finished loading and we cannot hide that it made us smile to read, when starting Resurrection for the first time, that it is recommended restarting the iPhone before starting a game, to make sure you have all the memory available. On the other hand, we do not feel like criticizing the repetitive aspect of the gameplay, being inherent to the genre of rail shooters even if we are well aware that in ultimately it all boils down to the continuous killing of enemies that appear as soon as a door is opened, a corner is turned or that attack the protagonist from behind. Among other things, the rather short duration of Resurrection (a level will hardly take you more than ten minutes to complete and there are 8 in all) causes the game to endbefore becoming hopelessly boring. The tested version is 1.0 (Build 4307)", "date": "2009-07-15", "grade": "8.5"}