{"name": "Nel castello della mia fantasia", "ref": "https://multiplayer.it/recensioni/69043-castle-of-magic-iphone-nel-castello-della-mia-fantasia.html", "text": "Gameloft's goal becomes clearer every day: to obtain the leading position on the iPhone as well within the games market that it had already gained in the field of Java mobile titles. In fact, the French company has been one of the reference points for a long time as regards the development of mobile gaming, having created a long series of titles over the last few years that have marked the way above all from a purely technical point of view. However, the boom of the Apple platform has left the transalpine house slightly displaced, which until now has limited itself - for a large part of its offer on the App Store - to proposing conversions of titles already released on mobile phones previously. Even with the obvious and often successful work of adaptation to the hardware made in Cupertino, a game built around the capabilities of the lucky smartphone has in fact been missing up to now. While awaiting Gameloft's debut in this sense, we can easily ~settle~ for quality products like this Castle of Magic. A castle that is not new to me As mentioned above, therefore, also in this case we are not talking about a totally original game, since its first appearance in the java version dates back to around the end of last year; in the passage on the iPhone however, the title has gained a renewed graphic design, now in 2.5d with a more than pleasant use of the polygonal capabilities of the system. The contents are instead unchanged, and put the player in the role of a boy trapped in a magical world where his playmate Jenny is kidnapped by the evil wizard of the moment and trapped in a castle. The latter is in fact the main location and is divided into five worlds, each obviously with its own setting, and in turn composed of 3 levels each. The gameplay is that of an absolutely classic two-dimensional platformer; it is therefore a question of going through the various stages by collecting diamonds - which also act as an energy reserve a bit like Sonic's rings - and eliminating the enemies that populate them. To this end, there are several power-ups capable of giving the hero some powers, such as shooting fireballs or shooting arrows from a bow. Everything in the norm, but the quality level design makes the perspective of the great work done by the French programmers; without a doubt Castle of Magic would not look out of place on a portable like the Nintendo DS, even if in reality given Gameloft's modus operandi, perhaps the arrival on the DSi Shop in the future cannot be excluded at all. While never putting the player in difficulty, the levels are structured in a non-elementary way, and the progression within them is pleasant and satisfying as are the boss battles. The quality of the technical component is also surprising, which certainly places the title at the top of the best iPhone games from this point of view; the settings are rich in detail and colorful, the animations of the protagonist and enemies complex enough and the soundtrack really of great value. Sorry for a barely sufficient frame rate and the scarcity of audio effects, which are limited to a few screams from the hero and very little else. But these are all in all acceptable defects, as is the certainly not particularly robust longevity that allows you to get to the end of the adventure in a handful of hours. But even on this, seen and considered the price of  3.99, you can turn a blind eye. Instead, the main reason that prevents Castle of Magic from reaching a higher vote is entirely linked to the control system, which relies on a directional cross and two virtual keys positioned on the lower sides of the screen. The accuracy of this solution is in fact really poor, and the failure to detect the commands given by the player is often a source of frustration; certainly in most cases, given the condescending level of difficulty, the fate of the game can be recovered, but the fact remains that the final result is far from proving to be appreciable, thus putting a spoke in the works of an otherwise top-level product. The tested version is 1.0.1", "date": "2009-07-14", "grade": "7.5"}