{"name": "Electronic Arts e il fitness", "ref": "https://multiplayer.it/recensioni/69105-ea-sports-active-personal-trainer-electronic-arts-e-il-fitness.html", "text": "Useful and pleasant, two words for an expression that has forcefully entered the life of many old and new players. An unprecedented concept, proposed in a winning way by Nintendo and capable of partially shifting the aim of many products for Wii from their more strictly playful location, associating them with the immediately expendable idea of something capable of giving concrete results, a enjoyable engagement rather than a disengagement. As with any winning model, the application has had more prosperous fields than others and that of fitness could only be at the forefront, after all it is a question of disciplining and regulating the movements of the users of a product which has made his fortune; after Nintendo with Wii Fit and several other experiments, more or less successful, there was therefore no shortage of Electronic Arts which with EA Sports Active not only manages to enter a thriving market, but does so in a credible way, proposing something new and strongly identifiable . Meta video game The foundations on which EA Sports Active is based are those of keeping fit, without compromise or deception. The premise is well expressed right from the start, from the box which next to the game provides the user with a band to tie to the leg and in which to place the nunchuck so as to detect its movements, and with an elastic band capable of exerting a certain resistance, to be exploited in specific exercises. Legs and arms in motion thanks to tools that are once again additional to the software, capable of creating a further connection between those who play - train - and the program designed to accompany their effort and measure their results, proposing a multitude of different activities. These are divided into four main categories: Upper and Lower Body, especially muscle exercises, from lunges to push-ups, to which are added Cardio, the best for burning calories, and Sports, from boxing to volleyball, the most playful of experience. A good variety, therefore, well supported by a quantity of preliminary information, advice and suggestions that simplify its use, with further additions relating, for example, to the possibility of training in the company of another person, provided he is also equipped of the appropriate instrumentation. For those who own the Balance Board, the support is present and in some cases interesting, the fact remains that it is not necessary to enjoy a satisfactory experience, if anything it is a plus. Give yourself a goal If the premise, the general structure and what is included in the package work - there have been some complaints about the excessive softness of the elastic band, designed however for everyone and for those who feel the need to replace it with a very low cost - it is in daily practice that EA Sports Active expresses itself excellently: the 30 Day Challenge option allows you to take charge of some objectives to be completed by choosing from a handful of different paths, based on intensity, all supported by tools such as the Daily Diary or the 'indicator can show hours of exercise as well as calories burned. The great variety of content combined with the goodness of the individual activities, therefore allows you to achieve what in many ways is da consider themselves the biggest obstacle often encountered by these productions, namely that of keeping motivation high, not abandoning the player-athlete after introducing him to the world of physical activity. In practice, after a few days of use, the thoughts are rather outlined and the perception of having moved is certainly strong, having struggled above all from an aerobic point of view, with the muscular part also put to the test but, for obvious reasons , more with a view to developing resistance than mass; the commitment is therefore more than consistent and, for the less used to it, it is advisable to start slowly so as not to wake up the next morning unable to go to work, limiting the more traumatic exercises such as running on the spot, always to be done for no more than strictly necessary and with sneakers. Speaking of the visual impact, the chosen style combines a certain anatomical credibility of the models, necessary having to show the movements, colors and environments without photorealistic pretensions; overall the result is pleasant and functional.", "date": "2009-07-17", "grade": null}