{"name": "L'asfalto del DSi", "ref": "https://multiplayer.it/recensioni/68950-asphalt-4-elite-racing-lasfalto-del-dsi.html", "text": "Gameloft was among the first European houses to get on the DSi Shop bandwagon, the exclusive online service of the latest version of the Nintendo portable; however, unlike those who have understood the DSi Ware as an alternative channel in which to offer exclusive titles, the transalpine producer has preferred, at least for the moment, to use games that have already appeared on mobile phones or in ~cartridge~ versions. Therefore, Brain Challenge, Pop Superstar, Real Football 2009 and Asphalt 4 have appeared in the Premium section; on this occasion we will focus on the racing game, subtitled Elite Racing. world tours Asphalt 4 arrives on DSi after landing on java phones, N-Gage and iPhone; although in the mobile gaming environment the Gameloft series is a sort of institution, on the Nintendo portable the conversions of the first two chapters have not left their mark, also thanks to greater competitiveness on a platform where quality certainly is not lacking. With the fourth revision, the programmers have preferred to focus on evolution rather than revolution; anyone who has played one of the previous episodes can in fact easily find the peculiar characteristics, above all a decidedly arcade mechanic in which the bumps represent only a slowdown and the turbos are the masters. The races take place across 9 locations around the world, such as Los Angeles, New York, Paris, Dubai; in order to offer a greater variety compared to similar products, Gameloft has also made sure that the requirements to win the different competitions were not only related to the fact of crossing the finish line first, but also to different factors mainly related to the need to eliminate opponents at the counter. The control system allows you to tackle competitions both in a totally classic way, i.e. based entirely on the keys and on the directional cross, and by entrusting the steering movements to the touch of the stylus, obviously acting in this case on a virtual steering wheel positioned on the lower screen. The gameplay is therefore quite pleasant, even if an excessive approximation in the management of the shocks and the revisable artificial intelligence of the opponents prevent the game from reaching peaks of excellence. As regards the innovations compared to the previous editions, the only important one is to be found in the ability to take pictures with the DSi camera and which will then populate the walls of one's garage or rather the advertising billboards along the track. But given that usually while driving you are busy following the action, it is such an accessory feature that it goes absolutely unnoticed in most cases. Finally, the graphic component can be defined as pleasant, even if far from taking full advantage of the hardware; the models of the cars are good as well as the frame rate, but the visual depth is not always as satisfactory as the quality of the textures.", "date": "2009-07-10", "grade": "7.0"}