{"name": "Animismo e scale musicali", "ref": "https://multiplayer.it/recensioni/69037-loom-animismo-e-scale-musicali.html", "text": "Often, editors insist that an older game has features that have been picked up much later by some contemporary titles. As if to say that they had already seen everything a long time ago. And maybe sometimes readers turn up their noses, because in fact, ~senior~ players tend to become snobs. Well: we raise the stakes with Loom, stating that its gameplay remains a spark of originality, which still illuminates us from a distant past eighteen years. Unfortunately, however, his script is vague and rarefied, and consequently we proceed quickly in talking about the story. You are Bobbin Threadbare, a member of a guild of wizards known as the Weaver Clan. Fairytale events lead you to witness the spell of the elders who imprison your godmother Hatchel inside an egg, while those rascals get the body of a swan. The reason for all this is a mystery for the young Bobbin to unravel. But his pains are not finished, since once on the road, while he's at it, he must also prevent the advent of Chaos. Now that we've refreshed our memory, we're reminded of why Loom is weak at storytelling. The secondary characters are barely mentioned, and although many locations have fairy-tale scenarios that are by no means trivial, in a few hours you get to the bottom of everything, especially at the first level of difficulty. In this, Loom far preceded Telltale... Curiosity LucasArts has decided to make its past glories available on Steam, giving everyone the opportunity to play again, or for the first time, several video games that have made history. Multiplayer.it has chosen the best for you, and now presents Loom. Sing me o egg the requested melody Brian Moriarty was in charge of the project, and in his intentions the saga should have consisted of two more episodes; right now, fans are still waiting. So let us console ourselves with this return to the past. What upset the canons of the genre was that instead of a complex verbal interface, Loom only had a magician's staff capable of playing different musical notes. All we can do with the mouse is select an object. If this is activated, it produces a melody, which we must record at all costs on a piece of paper, under penalty of being unable to continue the adventure. At the highest difficulty level, the game does not tell us the name of the notes. It is therefore up to us to recognize them by ear and reproduce them on the stick. These small motifs are actually spells, which are linked to the event that produced them... Lost eyes in the audience. Okay, let's take an example. At the beginning of the game, clicking on a flask full of liquid causes it to tip over, producing a melody. Well, that's the ~empty~ spell, and it's going to be played at the right time to solve a puzzle. In short, everything revolves around the execution of the appropriate melody in relation to the selected object or person. This is Loom: bare in graphics even for the canons of the time, essential in the contours but equipped with a touching soundtrack, and which still surprises us for its evocative power. Last but not least, the excellence of the dubbing, which unfortunately, like the whole game, remains in English.", "date": "2009-07-14", "grade": "9.0"}