{"name": "I classici da suonare", "ref": "https://multiplayer.it/recensioni/69040-guitar-hero-greatest-hits-i-classici-da-suonare.html", "text": "Version tested: Xbox 360A few weeks after the release of Guitar Hero Metallica and a few months after that GH World Tour, which introduced the possibility of playing drums and singing to the series, here is Activision publishing this Greatest Hits, a collection of some of most popular songs from all the back catalogue, but in original version - no covers, therefore - and with the addition of a mix between the characteristics of the last two chapters. The package is attractive, rich as it is in some of the most beautiful songs ever available, but the full price and some gaps make it necessary to carefully evaluate any purchase move. A little of this and a little of that From the World Tour structure, this episode clearly incorporates the presence of the drums and the microphone, plus the novelty of the editor to create your own songs with the possibility of downloading all the songs composed by players from all over the world, with a catalog that now boasts the reproduction of very famous melodies also from the history of video games (Plumbers and Porcupines are not lacking). Obviously, the main course is the possibility of playing with the drums and singing the original versions of this splendid track list, composed of about fifty songs that cover the whole saga, especially for those who have never played GH. However, we must take into account the impossibility of downloading new songs from the online catalog, or the fact that even having bought songs with Guitar Hero World Tour, these will not appear in the Greatest Hits list, and it's a real shame, because it limits the longevity giving the game the flavor of a recovery of the past catalog, which does not introduce anything new and which, if it had been available as a download package via Xbox Live or PSN, would have had a completely different charm. The setting is the one used for Metallica, with all the songs available immediately, so as to allow anyone to play and sing any song without going crazy behind the career mode for hours, and also coming against less savvy players here. The fact remains that the songs betray the hardcore nature of the origins, with a good part of the pieces that it is difficult to put on the track because the singer friend of the moment wants to launch himself with the microphone in his hand. In short, the ~metal~ turn that has always characterized the GH tracklists for the final songs of the career mode makes itself felt, putting technical and difficult to interpret songs on the track. In this sense, the calibration of the difficulty downwards helps, given that the more expert players can finish the game at the highest level without too many worries, also thanks to the implementation of the characteristics of the new guitar that allows you to play the solos of the songs, taking advantage the touchpad, with that tapping simulation (guitar technique with which the notes are played by pressing the strings directly on the guitar neck ed) which helps to avoid many mistakes, where the old chapters really didn't forgive anything. For the maniacs of technicalities and drums, the Expert + mode is back, borrowed from Metallica, with all the accents of the rhythmic part intact and with the double pedal to indulge yourself for hours and hours. Xbox 360 goals Hard life for objective hunters with this episode of Guitar Hero. Finishing the game at an expert level, remembering to take a look at some guides to see the easier but hidden objectives, leads to achieving just over 100 of the thousand points available. To increase the loot you have to play and finish the career with all the instruments and own the drums. If you really aim for full points, you need 3 more friends, time and a great desire to play on Xbox Live. Cooperatives and online Much of the longevity and fun of this GH, as always, is played on the possibility of bringing friends into play and forming a band with which to sing and play at breakneck speed, even online. There is also the possibility of tackling any song in no particular order, as well as the career mode for groups consisting of a minimum of two members. Among other things, a problem encountered in World Tour that did not allow you to use the Xbox Live microphone to sing has been largely resolved. Therefore, the possibility should not be underestimated, for those who already own one of the old versions of GH, of putting together a band of at least three elements, bass, guitar and vocals, even simply by buying the base game, having at least one friend equipped with a another guitar. The recognition of the notes will not be as perfect as with the microphone, but you can easily sing any song without major problems, maximizing the fun and containing the expense considerably.", "date": "2009-07-14", "grade": "7.5"}