{"name": "Faide familiari e problemi di gestione", "ref": "https://multiplayer.it/recensioni/68994-anno-crea-un-nuovo-mondo-faide-familiari-e-problemi-di-gestione.html", "text": "It is not the first time that the series of Management/RTS made in Ubisoft arrives on the Nintendo laptop, but for this round the French house, also thanks to the launch of the game on Wii, seems to have wanted to pay particular attention to the console versions of a series which in the meantime, on PC, is improving and establishing itself more and more from episode to episode. But what will be the end result of so much effort? Follow us in our new world and you will find out... Two brothers The game is divided into two modes: the classic Story Mode and the even more canonical, for the genre, Infinite Mode. The Story Mode is divided into seven chapters, divided in turn into various sub-missions, for an average duration of about ten hours of play, and sees us take on the role of Prince William, son of King George, ruler of a medieval kingdom fictitious but seems to be copied, also seen the strong Anglo-Saxon accent of the voice actors, on England. A severe famine has devastated the prosperous kingdom, and the old king is grappling with a population that is literally in danger of starving: while Edward, your brother, would like to set in motion the military machine to subject the neighboring kingdoms from the most fertile lands , you suggest to explore and colonize the islands that are located south of the Motherland, unknown and theoretically uninhabited. To Edward's disappointment, King George accepts William's proposal and engages his two sons, separately from each other, to start the work: you can understand how soon the enterprise turns into a close competition between the two principles, with Edward, decidedly more ambitious, stubborn and impulsive than his brother, who could go to the streets at any moment... The Story Mode, despite all its articulated plot and its evaluations at the end of each mission, is nothing more than a long tutorial: William is accompanied by various advisers who, with punctual, precise and all too explicit suggestions, guide him to the discovery of the intricacies of the game system, from the first constructions of the fundamental elements (houses, roads, warehouses) to naval exploration, from the management of population growth (which is divided into five different classes of growing prosperity and with ever greater needs) and relative taxation, contacts with the surrounding populations which can be both of a peaceful and therefore commercial nature, and of a bellicose nature, in which case we get our hands on the not so complicated but still important military part of the game. The Neverending Story Although fundamental in learning how to manage the various aspects of the game, the Tutorial/Story Mode is a bit limited and limiting: you notice it when, for example, you are prevented from giving a certain order or from simply starting a particular construction because it hasn't been unlocked yet, or when the mission stops as soon as your citizens are about to move up a step in the social ladder, or when the explanation of an aspect of the game is left half-finished and then reappears to complete some mission a little further. All this is easily understandable given that we are talking about a tutorial, but it clearly does not allow you to fully appreciate the game system and the subtle balances that every title of the genre worthy of being played must prove to be able to maintain. For all this there is the Infinite Mode, the true heart of the game, which, after setting a few initial options, provides you with an entire completely virgin world map to explore and colonize, having immediate access to all the possibilities , of course depending on the degree of development of civilization. It is here that you can fully appreciate the excellent work done by the programmers regarding the ~fine tuning~ of the various elements of the title, which is, as any lover of the genre knows, after all the key to the management success. Anno does well in this sense, managing to offer an experience that is at the same time profound (by console standards) but almost not at all cumbersome and complicated. Give me a nib and I'll lift the world for you The ~almost~ is due to a precise choice of the programmers, namely that of completely abolishing the use of buttons by entrusting the management of all actions to the stylus alone. In general, the interface is intelligent and well organized, as well as explained in great detail in the Story Mode, but the crowding of buttons and information screens, although everything is distributed on the two screens, it makes reaching some more hidden screens a bit cumbersome, especially at the beginning. Furthermore, having to move around the map by interacting with the touch screen, without leaving the possibility of using the directional cross, breaks a po' the pace of the game, and this is combined with the imperfect management of the zoom, which in its closest distance prevents the overview, while from the farthest distance it jeopardizes the precision necessary in placing some buildings. The graphics, in 2D, are still remarkable, full of details, colorful and capable of showing numerous elements on the screen even in movement without showing the side of the slowdowns always lurking in these cases, while the sound is notable for the nice dubbing of the Story Mode (accompanied among other things by very well done cartoon-style static screens, which are somewhat reminiscent of the old PC games of the genre) and for game music that evokes the atmosphere of past times, without however excelling in variety and involvement. Absent any multiplayer mode, finally we point out the translation into Italian which, albeit with some minimal blunders, is clear and precise.", "date": "2009-07-13", "grade": "8.0"}