{"name": "Atlantide", "ref": "https://multiplayer.it/recensioni/68941-indiana-jones-and-the-fate-of-atlantis-atlantide-comera-nel-1992.html", "text": "Let's dispel a myth: there are video games based on a film series that have been acclaimed as masterpieces by world critics. Don't you care about criticism? Know then that even the gaming community welcomed Indiana Jones and the Fate of Atlantis with unusual quantities of popcorn, as if they were at the cinema. Have we not convinced you? Ok, then add to it that this adventure is for many fans of the celluloid Indiana Jones a compendium of his universe, as good as the films that have filled up at the box office. The reason is simple, there is no mystery: Fate of Atlantis has a story that drags the player through hundreds of screens entangling him in a noir, then exotic, and finally adventurous intrigue, right up to the gates of Atlantis. If only Plato could have imagined how things really were. And instead we will find out, starting from an artifact contained in the Barnett College museum, which we will have to recover for Mr. Smith, before he betrays us and goes into hiding with the contents of the ancient statuette. From here on, we'll put on the dusty shoes of the world's most famous archaeologist. Curiosity LucasArts has decided to make its past glories available on Steam, giving everyone the opportunity to play again, or for the first time, several video games that have made history. Multiplayer.it has chosen the best for you, starting with Indiana Jones and the Fate of Atlantis. Bright, rough or romantic As you can see from the images, this is an outdated adventure as far as the interface is concerned. LucasArts at the time had created the SCUMM, an engine that managed different elements of the game. For example, it's not enough to click on a door to open it, but you have to choose a verb from those available, which could be ~open~ for example. The same mechanism applies to the combination of objects in the inventory or their interaction with the elements of the seabed. Furthermore, and perhaps here we hit a sore spot, we have to move the mouse cursor around the screen in search of sensitive pixels with which to interact. No help and no shortcuts: that's how it used to be. After all, cinema was in black and white before it became colour, so don't be surprised if Indiana Jones and the Fate of Atlantis only has 256 colours. What made this game one of the greatest adventures of all time? First of all, the quality of the narration and the settings, which still make you shiver with the desire to discover what lies behind an apparently insoluble mystery. Perhaps because the lack of technology forced the authors to give their all by focusing on substance and leaving aside frills and misleading distractions. Furthermore, the Indiana Jones character has been recreated with consistency and attention: the witticisms and the ability to defuse even in the face of the most tense situations are intact throughout the game. Last but not least, and this is a remarkable feature for the time, the adventure forces us to choose at one point between three different approaches. Think of how exciting a player could have been in 1992 to be able to choose between a rough style, made up of fisticuffs, a logical path, where the solving of puzzles is privileged, and a ~two~ alternative, in cooperation with Sophia Hapgood, the colleague of red-haired Indy. However you decide to proceed, the last stop is Atlantis, and there you will discover that Plato was not to be mocked as we did at the beginning. But before choosing whether to dive into this journey into the past, keep in mind that the copy available for download on Steam is entirely in English, and that the puzzles, however logical and well thought out, are difficult compared to those of the more recent. Having said that, however, we start the game and start it all over again for the umpteenth time.", "date": "2009-07-10", "grade": "9.6"}