{"name": "Cacciatori di mostri", "ref": "https://multiplayer.it/recensioni/monster-hunter-freedom-unite-cacciatori-di-mostri-unitevi.html", "text": "Data in hand, it seems that Monster Hunter is the real killer application for PSP: each new episode of the series pushes the sales of the Sony portable console in a sensational way, so much so that for the imminent release of the third chapter for Wii there are already those who predicts record numbers. And to think that at the beginning things didn't go very well for the Capcom franchise, born on PlayStation 2 but never taking root in the West, also due to an unsuccessful advertising campaign. It seemed that the series should remain the exclusive preserve of Japanese gamers, when instead the passage on PSP has opened new paths. The rest is recent history: Monster Hunter Freedom and Monster Hunter Freedom 2 have represented an evolution compared to what was seen on PS2, making changes to the gameplay and game structure, especially from the point of view of quantity. Monster Hunter Freedom Unite takes us one step further. The hard life of the monster hunter Once the game UMD has been inserted into the PSP, we are given the possibility of importing a character created with Monster Hunter Freedom 2 or of installing part of the data on the Memory Stick to drastically reduce loading times: the procedure requires about 600 MB of free space and quite a bit of time, but it brings substantial improvements to the experience and therefore we recommend it without reservations. Once the pleasantries are over, we can move on to the creation of our hunter by determining his gender, name, physical appearance, clothing and initial equipment. The character wakes up in the village of Pokke, fresh from a battle in the mountains gone wrong, and he is invited by the mayor to fill the recently vacated role of monster hunter. In the fantasy world created by Capcom, hunters are in fact real defenders of the villages they work for, and during missions they have the task of keeping the biggest and most dangerous monsters away from the city walls. On the streets of Pokke there is no shortage of shops and shops of various types, which allow us to spend the money earned during travel to buy objects, weapons and accessories. As we will soon discover, in Monster Hunter Freedom Unite the process of collection and transformation is preferred rather than the mere sale: everything we get from the killed creatures can be bartered or used directly in combination with other objects for the creation of new armaments. The classic example is that of dragon skins, which are artfully cut and sewn by local farriers to make light but impenetrable bodices. Sharpen the knife In addition to the shops, the village has essential resources such as the farm and the hunters' guild. The first proves to be useful for learning collection techniques or simply for distraction with the fishing minigame, the second acts as an antechamber for accepting missions in both single and multiplayer modes. The big news of this episode is in fact represented by the possibility of tackling the missions together with three other friends using the PSP wireless device. At this juncture, the experience proves to be phenomenal, full of strategy and technically perfect, with hunters who can simultaneously attack the biggest monsters to knock them down in a few seconds, or ingenuity by varying the approach to combat with the system of lures and traps. In fact, from the point of view of the offensive possibilities Monster Hunter Freedom Unite fears few comparisons: the weapons available are many, from quick and light daggers to two-handed broadswords, passing through the balanced combinations of sword and shield, spears and bows. Each weapon requires a different approach and offers unique combos, but the merits are generally compensated by the defects: the bigger and heavier tools are slow and require frequent maintenance, also because you have to use them for parries; the bows are not very effective at close range, but you can work on the composition of the arrows to transform them into real destructive bombs; solutions based on two weapons are agile and practical, but do not cause who knows what damage. Curiosity Monster Hunter Freedom Unite sees the presence of the nice Felyne, cat-like creatures that we can take with us and which boast different abilities. In fact, apart from their skill in the kitchen, the Felynes can follow us on the battlefield and give us a hand especially during the exploratory phases, when we need to identify the targets to face. Furthermore, unlike our character, these ~kittens~ can develop their skills and therefore ~grow~ as a result of the experiences gained. Let's go! Once you join the guildof hunters, we can view the available missions and decide whether to accept them, possibly paying a variable ~deposit~ depending on the type. The game provides for a differentiation based on the level of complexity, therefore our character cannot immediately access the more difficult missions and must instead follow the usual leveling path typical of RPGs. There are missions based on collecting, eliminating certain monsters and catching them. Once the equipment has been checked, we can leave and thus find ourselves within the locations that form the background to ours shipments, organized in not very large scenarios that require a short loading during the passage from one area to another. Generally the monsters present ~reborn~ when we move from one place to another, thus offering us an almost infinite resource if our goal is to collect useful objects to resell, barter or use for the creation of weapons and armor. We can move our character using the analog stick, using the d-pad to adjust the view (something awkward to do when the fights get frenetic), while the Triangle button determines the transition from the exploration phase to the combat phase , during which the same button and the Circle create spectacular and devastating combos. The back key R is used to run if we have not yet drawn the sword, otherwise it allows us to parry enemy attacks. The backbone L is instead used to center the view and (by holding it down) to manage the inventory (located at the bottom right of the screen), with the objects that must be scrolled by pressing the Square and Circle buttons. Once an object is selected, we can use it by pressing the Square button. Finally, the X button activates an evasive maneuver useful for escaping the blows of slower opponents. Technical realization The graphics of the game are really excellent, with extraordinarily defined textures compared to the standards to which PSP has accustomed us. The environments therefore boast a good level of detail and their only limitation lies in the rather small dimensions, with the loads that are necessary to move from one area to another. The bestiary of this new Monster Hunter is obviously disproportionate, so much so that there is no shortage of valuable resources for players on the net, with information of various types. Each creature has unique characteristics, and the most powerful ones boast even rather complex attack patterns, which must be memorized perfectly in order to be able to retaliate effectively. In fact, the alternative is to suffer an offensive such as to translate into an almost instantaneous game over. The animations of the characters are excellent, but also in this case the difference is made by the disproportionate amount of weapons and armor, some of which are truly particular and captivating, so much so that they define the external appearance of the character more than anything else. Finally, the music and effects carry out a well-executed accompanying work, with some original ideas and some pieces of great quality.", "date": "2009-06-24", "grade": "8.5"}