{"name": "Il pranzo  servito", "ref": "https://multiplayer.it/recensioni/mangia-tutto-il-pranzo-e-servito.html", "text": "Titled The Munchables in its English-speaking incarnation, Mangia Tutto! is a curious action game that -as the title suggests- requires the user to engulf everything he finds on the screen, playing the role of a funny spherical creature with obvious problems related to appetite satisfaction. If the premises tickle your interest and if you loved the Katamari Damacy series, the Namco Bandai product could be for you. I beat anorexia Despite being a pure and simple action game, Magia Tutto! boasts a particularly bizarre and convoluted storyline, which takes hold on a planet populated by little monsters whose only purpose in life is to eat: this idyllic scenario is shaken by the arrival of an army of space pirates, firmly intending to plunder the enormous edible resources of the place. Too bad that the bad guys on duty are nothing more than anthropomorphic foodstuffs, destined to in turn become victims of the terrifying appetite of the two protagonists of the game. Purpose of Eat It All! is in fact to go through the 24 different levels that make up the adventure by eating enemies, increasing in mass meal after meal to being able to feed on increasingly larger opponents. The reference to Katamari Damacy is evident not only for the sharing of certain aspects of the gameplay, but also for numerous side elements. The insanity that permeates the entire Namco Bandai work immediately catches the eye: the head to which the protagonist refers is a man with an onion head, the precious artifacts stolen by the pirates are nothing more than huge swirls of colored ice cream (also if Arale's lovers won't struggle to exchange them for something much less palatable), and at the end of each stage the user's score is counted based on the quantity of balls ejected from the back of the spherical protagonist. Still inspired by Katamari Damacy, the game then offers an encyclopedia of defeated enemies accompanied by descriptions that sometimes prove to be genuinely hilarious. Eat everything! it is therefore a game that inspires sympathy, thanks also to a simple but lively and pleasant technical sector: the character design of the various enemies and the manga-style interlude sequences are particularly noteworthy, while in game the title compensates for its low polygonal complexity with funny animations and spot-on color choices. Even the sound accompaniment contributes to the mood, with cartoonish effects and pretty music even if objectively repetitive after a while. Cicciobombo gunner As anticipated at the beginning of the article, the aim of the game is simply to eat as many enemies as possible, but there are some basic rules that give a minimum of structure to the whole. A number corresponding to the level of strength reached is displayed on the head of the protagonist and the enemies, which the user can increase by engulfing opponents lower than or equal to its value: it is however possible to use the ordinance attack - a very trivial roll - to divide magically the space pirates from the highest levels into many small and edible creatures. In the handful of boss stages that the adventure offers, the mechanics change slightly, given that you must first identify the weak point of the opponent on duty: it's just a shame that the process is basically the same for all the bad guys you meet. The rest is entrusted to the judgment of the player, who can choose whether to complete all 24 stages in the blink of an eye or to linger to get the highest scores, perhaps by engaging in the collection of special acorns specially hidden within the scenario: in this last case, you are rewarded with various decorations with which to change the appearance of your character, without however benefiting from any variation in terms of skills. A discourse that brings us to the weak points of Mangia Tutto!, in this case an absolutely laughable level of difficulty, a repetitiveness due to the absence of any form of character progression and the absence of solid alternative modes to the short single player campaign. Once the adventure is over, there is nothing left but to throw oneself in search of the missing extras or face the internships again in mirror form: a bit little for a product that is still oriented towards simplicity, but which would have needed more substance. Eat everything! therefore it remains a fun action game, which will surely make its way into the hearts of less savvy users thanks also to a control system that defining user-friendly seems almost reductive. Only the Nunchuck stick is used to move the character and the A key to eat, while the backbone carries out the attack andwith a vertical movement of the Remote, a small leap is made.", "date": "2009-06-24", "grade": "7.0"}