{"name": "Il gorilla non suona pi qui", "ref": "https://multiplayer.it/recensioni/donkey-kong-jungle-beat-il-gorilla-non-suona-piu-qui.html", "text": "It seems less, but four years have actually passed since the newborn EAD studios in Tokyo released their first work, that DK Jungle Beat which at first seemed little more than a clumsy attempt to exploit the bongos released on the occasion of Donkey Konga and never used again, and to bolster the ranks of a GameCube soft library which was now beginning to feel the effects of the imminent end of the console in an embarrassing way. However, the game then turned out to be formidable, a masterpiece of level design and technique proposed with an innovative and engaging control system; just to be clear, shortly thereafter the Tokyo studios would have offered the playing public a certain Super Mario Galaxy... Long live the traditions! Jungle Beat did not have the commercial success it deserved, while the critics were enthusiastic about it: probably due to the release at an advanced stage of the life of a console with not easy success. What better occasion than the Wii and the ~New Play Control!~ to give the title a new chance? We are essentially faced with a 2D platform (but with three-dimensional graphics) with horizontal and vertical scrolling that is rather canonical in its basic concepts: a series of levels to face, various objects and bonuses to collect to obtain points, energy and extra lives, enemies and obstacles to be eliminated and/or avoided and clashes with the classic end-of-level bosses, all in various and classic settings, from the jungle to the arctic landscape, which partly pay homage and partly mimic the other large scrolling platform of the gorilla Nintendo, that Donkey Kong Country that, now some time ago, shocked the world on Super Nintendo. The innovative feature of JB, at the time, did not reside at all in the game itself but in its man-game interface made up of the bongos mentioned above: the basics were easy but at the same time disconcerting, DK ran after drumming on the bongos and jumped with the pressure simultaneous of both drums, while in certain moments, including the clashes with the bosses at the end of the level, drumming meant giving tremendous and powerful punches to the unfortunate person on duty. The level design studied on purpose and the particular combo system (collecting bananas in a certain way gave more points, as well as not touching the ground for as long as possible) however made this approach immediately extremely natural, and JB almost transformed into a music game whose perfect execution gave players tons and tons of bonus points and satisfaction. On Wii the music, it must be said, has changed: the control system is, paradoxically given the characteristics of the Wiimote, much more traditional with the movement assigned to the analog stick and the various functions, including the indispensable jump, to the very traditional buttons. Only on certain occasions, see boss fights as usual, can we take advantage of gestural controls: all of this completely changes the nature of Jungle Beat, making it a certainly less innovative and perhaps even easier experience on Wii but, also thanks to a very slight readjustment of the level design, not ~worse~ at all. The question is probably resolved in a matter of taste, with the indisputable advantage that in any case it is a different experience from the original one and for this reason perfectly enjoyable even by those who, at the time, enjoyed stripping the GameCube edition. The technical ape Although it is an almost completely slavish copy of the original, and therefore practically the same game from a technical point of view, Jungle Beat graphically still surprises today with its bright colors, its detail at excellent levels, the many and well-textured polygons and various special effects including impossible not to mention the fur-shading on the fur of Donkey and the other furry animals present. There would be a lot of food for thought to think that a GameCube game from four years ago is considerably superior, always technically speaking, to a large part of the Wii toy library: in fact, we can deduce several things from it, starting from the fact that even today there are very few houses left on the Wii that they are seriously committed from a graphic point of view to finish with the consideration that, if in 2009 a game of the past generation still makes a good impression, perhaps there wasn't then all this incredible need to already switch to highly sophisticated hardware and HD .. . But this is material for another discussion in another area... The sound, on the other hand, is exactly the same: with the very nice little tunes (sometimes original, sometimes borrowed from Country) rendered in a jazzy and funky key, with great effect if not exactly freshness, at least serenity and non-canonicity. Finally, multiplayer and longevity sin: ithe first is completely absent, while the second, scarce in itself (three-four hours to complete everything in peace) is helped by being able to replay the various levels to obtain the maximum scores and thus be able to unlock some small bonus stages created for the occasion. Finally, support for 16:9 and progressive scan should be noted...", "date": "2009-06-19", "grade": "8.5"}