{"name": "Anche il Wii", "ref": "https://multiplayer.it/recensioni/indiana-jones-e-il-bastone-dei-re-anche-il-wii-finalmente-ha-il-suo-piccolo-uncharted.html", "text": "With its graphic adventures dedicated to Indiana Jones, LucasArts has set new standards for the genre and generated a huge number of increasingly enthusiastic and demanding fans. It is therefore necessary to clarify one point immediately: Indiana Jones and the Stick of Kings has little to do with the classics that older gamers remember with affection and nostalgia, while it clearly takes up the structure of that Indiana Jones and the Tomb of the Emperor released for PC and console in 2003. We are therefore faced with a third-person action game that more than the various Tomb Raiders seems to be inspired by the excellent Uncharted for PlayStation 3, drawing on the source of the new adventure games as well as these have drawn clear inspiration from the character created by George Lucas. The story told in this new episode sees us explore the deserts of Sudan, the Chinatown of San Francisco, the jungles of Panama, the palaces of Istanbul and the most mysterious areas of Nepal in search of a stick that gives those who wield it power to dominate the winds: the Stick of Kings, in fact. Unfortunately Dr. Jones is not the only person interested in this relic, which is part of the list of ~mystical~ objects that Hitler wants to take possession of. Whip and hat Mysteriously canceled in its Xbox 360 and PlayStation 3 versions, Indiana Jones and the Stick of Kings finds its most sophisticated incarnation on Wii. Not for the mere technical realization, given that as usual there are no differences compared to the PlayStation 2 version, but for a control system that takes advantage of the motion detection of the Wii-mote and Nunchuck as had rarely happened before in such a product. In the game, good old Indy has to face a large number of opponents with his bare hands, whether they are Nazi soldiers or simple minions, and has at his disposal an arsenal of moves that rival a fighting game. The shaking of the controllers thus translates into jabs, hooks and uppercuts carried independently with the right or left arm, while by pressing the Z button you can grab an enemy and decide whether to slap him or approach one of the many interactable objects in the scenario: a at that point just press the A Button to get rid of your opponent in really fun ways (by slamming them into a table, making them look closely at a fish tank, or ~potting~ them on a pool table). Within the locations there are numerous weapons, often improper, that can be collected. If you want, you can even grab them and throw them directly at the first enemy in range. But that's not all: Indiana Jones never separates from his whip, and in the game we can use it in many different ways by holding down the B trigger and shaking the Wii-mote exactly as if we wanted to crack it. In this way we will be able not only to reach otherwise inaccessible areas, but we will be able to disarm the opponents, take them by the legs and make them fall or trap them momentarily. Extra weight Indiana Jones and the Staff of Kings is one of the few Wii titles to feature achievements like those found in Xbox 360 and PS3 games. In this case, we will have to complete certain tasks during some stages (it's all written in the protagonist's logbook) to unlock extras of great value. Firstly, we will be able to access a series of mini-games for two players as well as ~arenas~ in which we can fight with our bare hands against numerous opponents. But above all we will be able to unlock the entire Indiana Jones and the Fate of Atlantis, which fans of graphic adventures can only remember fondly. Action archaeologist Fights almost always see us facing a large number of enemies, so the key to coming out unscathed often lies in our ability to quickly knock out opponents. Overwhelming us numerically is also a way to mask the paucity of artificial intelligence, given that the behavioral patterns of Nazi soldiers and their minions appear anything but sophisticated: they almost always oppose little resistance to our maneuvers, while in the case of the ~brutes ~ you have to wait for them to strike, dodge (by pressing A and B together) and then catch them with a rebound. When the enemies come with the guns drawn, Indy takes out his revolver and automatically lurks behind some cover, turning the game for a few minutes into a sort of pistol shooter. As usual, just point the Wii-mote at the screen to move the crosshairs and press B to open fire, even if in this case the shooting accuracy appears to be at least questionable. This latest LucasArts production isn't all about action, however: explorationion of the internships is still a central element of the gameplay, the puzzles to solve are numerous (and, fortunately, always quite ~logical~) and to overcome some points we are required to be prompt and timing. Some levels host nice and fairly successful alternative sections, in which we will find ourselves flying improvised planes or boats, motorcycles or even elephants, interacting with the controllers in a truly imaginative way. Technical realization Wii owners are used to expecting very little from the quality of cross-platform titles, yet in the case of Indiana Jones and the Stick of Kings it cannot be said that the guys at Artificial Mind and Movement have done a bad job. The graphics engine of the game manages in fact to manage characters and settings in a very fluid way (although there are uncertainties), the polygonal model of Indy is quite similar to Harrison Ford (although, from that point of view, it was certainly possible to make a little more) and has of a rather vast set of animations, given the numerous actions it can perform especially during fights. The same speech cannot be made for enemies, unfortunately, given that they are divided into a few types and therefore inevitably end up looking like photocopies of each other. The scenarios move between ups and downs, with some beautiful panoramas contrasted with landscapes that are a little too desolate, but the choice of colors makes everything quite varied and pleasant to the eye. And then there is no shortage of interactable objects, for sure. The sound sector defends itself fairly well, on the one hand thanks to the presence of the original music signed by John Williams, on the other hand due to a complete localization in Italian, dubbing included. Unfortunately Indiana Jones is not interpreted by his ~official voice~, and it must be said that the average level of acting appears low, with lines almost devoid of conviction, perhaps due to the lack of visual feedback during the recording phase. The effects are bad, which are too little noticed to add anything to the experience.", "date": "2009-06-17", "grade": "6.8"}