{"name": "All'insegna del realismo", "ref": "https://multiplayer.it/recensioni/arma-ii-allinsegna-del-realismo.html", "text": "Armed Assault had left a bad taste in the mouth due to a long list of only partially corrected defects, so much so that the community of enthusiasts had provocatively indicated the last substantial patch as the starting point for the actual game. Taking advantage of these criticisms, the programmers of the Czech Republic set to work and the fruits have matured two years after their previous effort. With these premises it is immediately clear that ArmA II is placed in the niche of ~hardcore gamer~ simulators: the watchword is realism, and not only in the graphic reproduction. The firefights, which can be tackled in first or third person (but purists will immediately discard this too arcadey view), represent the most advanced on the market today, so much so that armies from different countries have adopted the technology of Bohemia for training recruits. This does not only mean that even a single shot can be enough to make the word game over appear: in fact, it is the planning of the attacks that must be meticulously studied, therefore those who naively believe they can face the opposing militias with the bravado of an Advanced Warfighter will find horizontally after a few steps. As you understand, ArmA currently does not know many rivals of its kind. The highlight: the single player campaign Right from the initial screen, the game betrays its ancient lineage: from the spartan initial menu, it is possible to choose between the various types of game and set the graphic options, customizable but not too much. The campaign mode designed for single player is the flagship of this third effort of Bohemia, and catalyzes the first attention: it is open in character and boasts a degree of dynamism to which the flight simulators in vogue in the second half of the nineties they had always coveted. We are faced with a title that mimics a sandbox like Far Cry 2: the whole map can be explored from the start, and the player can choose in which order to complete the tasks. The missions will rarely take place as planned: just like in Black Hawk Down (the splendid film by Ridley Scott set in Somalia) pitfalls and slowdowns lurk at every turn; it may therefore be necessary to retrace one's steps to support a patrol preyed on by a sniper or lengthen the road to save civilians left at the mercy of the enemies. The completion of these secondary objectives is left to the will of the player, who does not exclusively have to think about the support fire with which he will later be rewarded: far from being RPG-inspired sub-quests, Special Operations must be evaluated as wisely as quickly - some of these are timed, and rushing to the aid of the needy can expose one's unit to unjustified risk. In other cases, however, the player's decisions (and actions) irreparably change the fate of the war: failing a crucial mission (perhaps simply by not completing it within the established time, or by losing too many men on the field) may not lead to the loading, but channeling events towards one of the less radiant endings (there are seven in total). The plot concocted by Bohemia is robust and unfolds over the course of seven ~levels~, although we must confess that we liked Operation Flashpoint's Top Gun script more. Instead, the events in ArmA II take place in the immediate future in the truest sense of the word: in September 2009, the Republic of Chernarus, located between the Black and Caspian Seas, is on the verge of civil war due to the victory of the pro-Soviet party that aims at reintegration with Russia: NATO forces are sent to the territory to guarantee peace, but the situation soon degenerates and we will find ourselves facing, under the command of the ever-present marine team Razor and aided by the resistance of the CDF, the wicked Russians flanked by the squads recruited by the reactionary regime. Guinness Book of Records numbers At the player's disposal the most powerful allied mouths of fire, and a large number of vehicles (over 150) including tanks, helicopters, amphibious vehicles, jets, bombers, but also civilian vehicles including buses, tractors (!), mountain bikes and motocross bikes: moving quickly is of primary importance given the huge open spaces. The Republic of Chernarus is in fact fictitious only in name: the programmers made use of satellite photos for the realization of the 225 square kilometers of the region, while the landscapes were recovered from the Czech motherland. As stated above the player is in command of the Razor unit, initiallymenmade up of four units, each unpersonifiable. As the game progresses, however, it will be possible to command even more teams, as in the missions defined as High Command, in which, from the top of an outpost and with the aid of the telescope, the player will have to manage an entire army. This complexity is reflected negatively on the game interface, which has always been one of the weak points of the Bohemia titles: from this point of view, however, the progress made compared to the predecessor is considerable. In ArmA II the control system is undoubtedly more user-friendly: with the use of the space bar and the central wheel of the mouse it is possible to keep a large number of men under control, giving them commands quickly even in more agitated situations. Once the demanding campaign has been completed, you can try your hand at individual missions, perhaps made with the powerful editor made available and on which the developer relies a lot to keep the community alive, or with the armory mode which represents the less serious but not for this less fun: it allows you to take control of any soldier, vehicle or animal (!) present in the game to freely explore Chernarus, or to face missions whose overcoming unlocks more challenging ones. After all, it is a pleasant pastime that is also useful for releasing the tension of the multiplayer sessions: in fact, the latter can prove to be truly majestic, given that the number of participants can reach fifty units. In addition to the essential Deathmatch (single or in teams), Capture the Flag and Dominion, Warfare and cooperative mode are also contemplated. The first was introduced with the 1.14 patch of ArmA and presents elements of strategy: in practice, two teams face each other for the complete conquest of the map or for the destruction of the enemy base; occupying cities can produce new weapons or units. The co-op mode, on the other hand, had been one of the flagships of the predecessor and is being revived by popular acclaim here too. It goes without saying that this is the type of game we preferred: being helped by your friends and completing the single-player missions with them offers very pleasant moments, and it is really worth trying these sensations on LAN. Curiosity ArmA 2 natively supports the TrackIR technology which, with the aid of a particular camera to be mounted on the monitor, allows to detect the movement of the head and transmit it within the game. In this way the game can be controlled with the classic paired mouse and keyboard while offering a greater degree of identification given for example by the possibility of tilting the head sideways to lean out of the corners within the game. New engine, same problems The graphic aspect, together with the campaign, was the object of the greatest attention of the developers; the first thing that catches the eye is the superb recreation of the scenarios, so immersive as to allow the player to enter into symbiosis with his own virtual alter-ego. Care in environmental reproduction, however, is not a mere work of visual flattery, but can also prove useful in the economy of exploration. Unfortunately, all that glitters is not gold, as the flaws that have always distinguished this series soon come to the surface: we are obviously talking about the animations, completely unacceptable for such an ambitious product, so much so that they are more woody than those of the glorious Hidden & Dangerous, weblog 1999. Another thorn in the side (literally) are the overlapping of polygons, very annoying and accentuated especially in the interior spaces, where fortunately only a small part of the action takes place. Bad clipping plagues several buildings and textures which tend to appear too late; the blur effect, thanks to which objects in the distance are blurred, can be useful for masking defects like these, a pity that the programmers have overplayed their hand a bit. The engine that drives everything is Real Virtuality, historically a tough nut to crack even for the most powerful systems, so much so that it can be set to maximum detail only with very powerful hardware. In its third edition it lowers the crest, but not so much: owners of medium-low PCs will even be unable to start the game, if they do not have dual core CPUs, but even those who house cutting-edge processors and video cards will have to do the you're dealing with fluctuating frame rates. On the computer used for the test, at the resolution of 1680x1050 and with all the details at maximum, the number of frames per second varied from 25 in the third view to 20 in thebefore, but the even more absurd thing is that even significantly decreasing the graphic quality did not improve performance. The same goes for the physics engine, unfortunately not always up to the task. If there is nothing to complain about the reproduction of the ballistics of the weapons, one could instead talk for a long time about how the driving model has been taken care of, a secondary aspect but not too much, as we demonstrated above. In fact, it is hardly credible that a 1970 Lada cannot do more than twenty kilometers per hour on a dirt road, being able on the other hand to tackle curves at much higher speeds with great ease, not to mention the braking distances, better than those of sedans. latest. Artificial Intelligence, after the neuronal cure promised by Bohemia, is in turn subject to uneven trends. The allies sometimes prefer the wide and consequently more treacherous paths, persisting on the same path even when under fire. More than once we have had to reload because our hounds had been eliminated by remaining at an excessive distance, even if, to tell the truth, the Allied sniper left on the roof of a building managed to track down a couple of Soviet practically invisible. The same goes for the enemies: formidable opponents ready to make the slightest ingenuity of the player pay dearly, sometimes they let themselves be filled with lead without mentioning the slightest reaction.", "date": "2009-06-19", "grade": "8.2"}