{"name": "Vecchia scuola su iPhone", "ref": "https://multiplayer.it/recensioni/vecchia-scuola-su-iphone.html", "text": "Among the most beautiful things for us gamers, or rather for our wallet, born thanks to the introduction of the iPhone App Store, the establishment of a particularly leveled price regime deserves applause, which in fact has led just a click away, a multitude of excellent products at the cost of a coffee or even less. In the list of games at 0.79, and permanently among the top positions in the best-selling rankings, for some time now, iFighter by EpicForce has established itself; after making itself known thanks to the free Lite version, distributed before the release of the complete product and downloaded over 1.8 million times, the shooter set in the Second World War therefore had an easy game in reiterating its success also in the next step programmed by the software house in Hong Kong. But beyond the attractive price, there's a reason iFighter has been downloaded by so many users: quite simply, it's a great old-school shot'em up that mimics classics like Capcom's 1942. And if the genre can now be said to be dead and buried on traditional consoles, it is precisely on mobile phones that it still gives encouraging signs of life as in this case. The useless and particularly impalpable story is therefore the background to a shooter that takes place through 4 rather robust levels with different settings, a large variety of enemies to eliminate, power ups, smart bombs and the inevitable final bosses. Choosing your own plane instead is not allowed, but frankly accusing iFighter of not being worth the 79 cents it costs is practically impossible: the game is fun, offers a good pace on every occasion and moreover the 3 difficulty levels allow you to offer a further challenge even once you reach the end. The graphic component then, totally two-dimensional, is very respectable and particularly pleasant, thanks to an excellent level of detail. As for the control system, it should be particularly appreciated that the programmers made an effort to introduce practically all the possibilities available on the iPhone, thus leaving each player to choose which one is closest to their tastes. We start with motion, which delegates control of the plane to the accelerometer thanks to the inclination of the mobile phone; then we move on to swipe, with which instead the movements are linked to the movements of your finger on the touch screen, without forgetting finally a classic virtual pad. The soundtrack is also not bad, while unfortunately any multiplayer mode is missing. The tested version is 1.3", "date": "2009-06-15", "grade": "7.7"}