{"name": "Hundred Days", "ref": "https://multiplayer.it/recensioni/hundred-days-recensione.html", "text": "They stole everything from us: Capcom the ancient Romans, Ubisoft the Renaissance, Electronic Arts the Divine Comedy and even in the worst way. But as you will find out by reading the Hundred Days review, at least for once we finished first. The credit goes to Broken Arms Games, an Italian software house based in Acqui Terme which, after several important collaborations and a handful of minor titles, is trying to make the leap in quality with a sometimes surprising management system. The chosen theme, the style with which it was packaged and some clever narrative details make Hundred Days a project that has all it takes to conquer an international audience, always remaining a clearly Italian product dedicated to typically Italian excellence. Italian. welcome to Italy We will of course be able to name our wines, choose the type of cap and bottle, as well as being able to design the different labels. The aim is to manage a winery: we naturally start from the basics and, slowly, harvest after harvest, we must try to transform it into a colossus capable of distributing its products all over the world. And this is already great and very welcome news: it's really nice to see that for once we don't try to follow pre-existing styles, usually borrowed from the Japanese or American school, trying to offer an experience that is actually unique, as well as proudly local. Hundred Days offers several modes, but to start the best is undoubtedly the narrative that will introduce us to the game through a warm hug as a background. A pleasant introduction The market will be subject to various trends which will make some types of wines more attractive than others. Offering different products is useful, but so is specializing in order to aim for excellence. The story of Hundred Days is also that of a young woman who lands in Italy from England to manage a small vineyard of Barbera grapes in the Langhe, Piedmont. Naturally this is only the beginning: as soon as things get going we will be able to buy more land to dedicate to new types of vines. The incipit is one of the super-winning ones: Broken Arms Games is offering the public what is basically the dream of many, but which only a few (usually those with more Pounds and Dollars in their pockets) can really afford. The cast, their names, the locations that will follow each other, have been chosen to give the international public exactly what they hope to find by coming here. Succeeding is easy, the difficult thing is never falling into stereotypes and fortunately Hundred Days avoids this risk with class. However, this introduction ends too much, too soon, even quite abruptly, forgetting in the meantime to teach us the rudiments of the game and the fundamental steps of our new job. Causes and effects Once bottled, the wine will go through retail and higher-paying special orders From shift to shift, you suddenly find yourself alone, grappling with a whole series of situations in which you just have to experiment with causes and effects. Hundred Days works in a rather particular way: each action is represented by a card, each card once placed on the playing field, which at the beginning is a space of 4x4 squares, is transformed into a figure that will be inserted between the others played in the same turn, always if we have enough space available. Once the possibilities available to us are over, we will be able to advance the time with the classic end-of-round button. Some actions will require only one turn, others many more: cleaning a machine or a tank usually takes up little space and only for one turn, while harvesting one of our lands will take up almost all the space and for three long turns, making it very difficult in the beginning manage more than one grape variety. There is little wine in the small barrel This is the game board. In the space in the center we will be able to play the various cards in our possession, optimizing the space available based on the boxes occupied by each action. As in any management system, Hundred Days also offers a series of technological advances that will make the supply chain easier to follow and manage. Furthermore, we will be able to buy new expensive equipment and slowly add space to the game grid, so that we can use more cards at the same time in each turn. Logically, we will also be able to buy new land, work the land so that it gives us a better or even worse crop, if we haven't done things right. The Broken Arms Games game hides an effective simulation inside which, taking into consideration differentThe fundamental aspects in the cultivation and processing of grapes, leads us to totally different results based on the materials used for winemaking, on those that make up the mix of the land on which we will have cultivated the vineyard, its exposure to the sun and so on. It is very interesting to learn all this, and no less fun. Fruit gravy Hundred Days: This is the warehouse where we will find the machinery that will transform the grapes into wine. Of course we will be able to improve the equipment we have and buy new ones to access new products The short tutorial, the lack of more satisfactory on-screen information, however, leaves the player with a long series of doubts that make the first few hours with Hundred Days rather confusing. Some elements that we will be able to unlock don't seem to work properly but only because no one has bothered to tell us that for example the maintenance department does not automate every aspect of the same, but only makes it more effective, and the same happens with the sales department, we will still have to take care of placing our bottles ourselves. A choice made in order not to make our role too passive, and consequently less fun. However, the first five hours with Hundred Days pass very pleasantly, between experimentation, bottling and a level of difficulty that will allow us to keep ourselves economically standing while we become familiar with the gameplay. Bringing a discreet Barbera to the shelves is not an impossible task, far from it, but if we aim for excellence we will have to work much harder, even risking making some important mistakes. Furthermore, things don't always go as planned, and a particularly rainy autumn, for example, can postpone or even damage a harvest that is fundamental to our finances. Not to mention disastrous eventualities such as the presence of parasites and other bad luck that will make our path to success less obvious than we might have initially thought. Alcohol spell Hundred Days: and here is revealed the secret behind the name of the game Broken Arms Games! The time spent with Hundred Days is extremely pleasant also thanks to top quality graphics and sound care. The style that permeates the product is of great elegance, and we can say the same about the beautiful soundtrack that sets our choices to music in a relaxing but never boring way; finally, there is a cure for the sound effects that is hardly found in similar products. And all this without making the game excessively heavy: it runs everywhere, but above all it seems ready to make the big leap into the mobile field, between touch screens and tiny batteries too often exhausted by an excessive amount of useless polygons.", "date": "2021-05-13", "grade": "7.5"}