{"name": "Maledette maledizioni", "ref": "https://multiplayer.it/recensioni/maledette-maledizioni.html", "text": "Mysteries of Westgate is the third official expansion for Neverwinter Nights 2 following Mask of the Betrayer and Storm of Zehir. Developed by Ossian Studios, a group of modders who also worked on the first Neverwinter Nights, it tells a story that has no relation to that of the main game, nor to the other expansions. Once the main character has been chosen or created, we will find ourselves entangled in a dense web of intrigues and curses (due to a kind of private club mask) involving the highest spheres and the occult powers of the city of Westgate, the exclusive setting of the whole game. Who cursed us and why? Where is he hiding? What is the relationship between a secret organization that wants us dead and the new comrades in arms that we will meet during the adventure (three in all)? Was there ever a time when one could get off a ship of a fantasy game and go get drunk at the local pub in peace. As in Storm of Zehir, here too it is possible to import a character from those saved from other campaigns. The only factor to consider is that the game is designed for characters ranging from the fifth to the fifteenth level, so using higher level characters risks making the fights really easy, also because all the other characters that can be inserted in the party will be adjusted to the level of the hero. Having said that, let's see what Mysteries of Westgate has to offer in practice. We were four friends in the pub Once the group is formed, it will be necessary to make the first decisive choice for the continuation of the narrative, or to work for a secret society based in the sewers (in Westgate the price of houses has reached unheard of figures), or for the temple of the god Lathander. The decision made will affect most of the quests that make up the main story, which will be completely different, thus ensuring a good level of replayability to the title. Furthermore, it is only by replaying it twice that the fifteen hours of longevity promised by the developers is reached. In addition to the main quest, there are sixteen good-level secondary missions, some long and articulated, others shorter and linear. In general they are well done and interesting and, to name a few, they will have us take part in a feud for the takeover of a shop, an attempted scam at dog racing and an investigation to find a missing diamond. There is no shortage of the classic arena in which to participate in individual or team battles, and there is no shortage of shops full of junk to buy. Small ancient world The main plot, despite some twists, is rather linear and all focused on collecting the information necessary to get to track down the final boss. The scenario is not huge, with four main locations (three districts of the city plus one underground district) to which all other locations are connected. In more general terms, it is a work that suffers a bit from the small size of the game world, but which can be appreciated for its classicism and for the wisdom with which it was made: it is clear that the developers are of RPG fans and hopefully in the future they will be able to work on larger projects, since they have all the qualities to make promising titles. From a technical point of view there is little to say: it is Neverwinter Nights 2, with all its strengths and weaknesses. The graphics are always the same, complete with problems in managing the camera that have plagued the game since its release. Of note are the new music, made with wisdom and beautiful to listen to.", "date": "2009-06-12", "grade": "7.0"}