{"name": "Un cazzotto da Nintendo", "ref": "https://multiplayer.it/recensioni/un-cazzotto-da-nintendo.html", "text": "Among the things that Nintendo does best, and one of the foundations of its success, there is undoubtedly the practically unique ability in the world of video games to update and bring forward series and characters who are 10, 15 years old or even more on the back. . An authentic geological era in the world of video games, yet the Kyoto house has managed to maintain the fundamental characteristics of each brand over time, making it immediately recognizable but at the same time modern and always current. But if this speech fits perfectly with historical names such as Mario and Zelda, there are in the archives of the big N a whole series of titles unforgettable by fans of the old guard but which instead seem to have gone into the background for the manufacturer. This is the case, for example, for Kid Icarus, who despite indiscretions and rumors has only been able to enjoy a few appearances in other games; and so it was for Punch-Out!!, stuck with the excellent Super Punch-Out!! for Super Nintendo dated 1994 and practically never reappeared until today. Go little Mac! In fact, it took the Wii and its enormous success to give Nintendo the courage to give new life to a name that has evidently never been forgotten by the people of coin-ops, cartridges and CRT screens. But for the younger generations, for the ~non-gamers~ who make up a large part of the Wii user base, Punch-Out!! Could it be a major attraction? Of course there is the encouraging premise of the boxing section of Wii Sports, although admittedly it was probably the least attractive part of the whole package. And then there's the question of boxing itself, a sport that has certainly known periods of greater popularity and with more representative performers. These arguments undoubtedly can affect the commercial success of Punch-Out!! for Wii, but which have nothing to do with the quality of a product which, while not establishing itself among the best games available for the Nintendo console, is undoubtedly one of the most pleasant surprises of this early 2009. The rejuvenating treatment which the programmers have dedicated to it follows the dictates that the Kyoto house and it is precisely the one described at the beginning, the same one that has successfully run in on several occasions in recent years. So here's Punch-Out!! on Wii is a veritable open book for anyone who has enjoyed the previous installments. Also in this case, in fact, the protagonist is the emerging boxer Little Mac, strictly framed from behind, and committed to facing a series of at least bizarre opponents, each with different characteristics. The beauty of Punch-Out!!, an aspect that has remained intact in this new chapter, is the fact that it is not really a boxing game in the strict sense. In fact, under this appearance there is a gameplay in which timing, rhythm and mnemonic capacity are much more fundamental than brute force. If in fact it is true that the weakest challengers can be knocked out even with a rambling series of punches and hooks, as soon as the difficulty increases, one realizes that the Nintendo title must be tackled in a different way, studying the moves of one's challenger and trying to anticipate them and then strike at the right moment and in the right way. You cannot move inside the ring, and the only body movements are linked to dodging to the left or right and to parries; everything revolves around learning the techniques of your opponent and the consequent execution of the precise counter or dodge with which to counter. A rigid mechanics, if we want even limited, but capable in its simplicity of intriguing and stimulating the player in an almost hypnotic way. A well-placed punch The desire to go ahead and win one match after another is also strengthened by the graphic component, or rather by the style characterized by a particularly effective humor, which through a very cartoonish aspect brings with it totally over the top boxers, who hopelessly emphasize perhaps one's geographical origins or physical qualities. The concepts of violence or pain are caricatured, harmless; everything is done in pure Nintendo style, a factor that is perceived in every moment. The control system offers a double variant, evidently a solution designed to tease both casual and more savvy players; both with motion control, where by holding the Wiimote and Nunchuck you perform the movement of the fists to see it reproduced by Little Mac (possibly it is also possible to use the balance board in addition), and in a totally traditional way by holding the Wiimote horizontally and therefore using the digital cross and keys. Sorry instead for the particular brevity of the modmain action, which can only count on 3 tournaments in which to face the 13 characters present, most of which recovered from the previous episodes of the series. It goes without saying that it takes very little to reach the final credits, even less for Punch-Out!! veterans; in reality the programmers have made an effort to expand the attractiveness of the product by inserting interesting secondary modes, which however do not add anything more, limiting themselves to re-proposing the previous clashes in an intelligent and quite stimulating way. There is also a local multiplayer mode for two players in split screen, which in reality, however, struggles to adapt purely single-player gameplay, proving to be quite negligible in fact.", "date": "2009-06-12", "grade": "8.0"}