{"name": "Tom Clancy's Splinter Cell: Double Agent", "ref": "https://multiplayer.it/recensioni/tom-clancys-splinter-cell-double-agent_a.html", "text": "Is it him or isn't it him? The ~heart~ of the game, as already underlined, is therefore the protagonist's double-dealing. The leitmotif that accompanies Double Agent is precisely the profile of Sam Fisher who must always be acceptable to both the ~good guys~ and the ~bad guys~, managing to be part of both sides at the same time. Often we will find ourselves facing difficult choices such as killing someone and we will have to decide whether to carry out the action in order not to make our companions suspicious or to remain good people, a sort of morality that must not exceed either side or the other and with the risk to be in serious trouble. The story is the one already told on Xbox360 and PC, but has been developed in a better way thanks to completely different missions. The story is the one already told on Xbox360 and PC, but has been developed in a better way thanks to completely different missions . This version for Nintendo Wii takes advantage of the graphics engine also used for PlayStation2, and it certainly cannot be said that it is a feast for the eyes. The low-resolution textures are washed out and careless, it is often possible to notice polygonal interpenetrations and the famous ~glue effect~ between the triangles, an open space that connects two polygons in practice. Technically this Double Agent is very little, even if compared to the ~old-gen~ versions. The polygonal count is extremely low and it is inevitable to observe how some anatomical parts of Sam Fisher are composed of blocks of parallelepipeds and large cubes. Furthermore, his figure is poorly made: looking at his face you will hardly recognize him. A complicated double game A lot of the material of this Splinter Cell is recycled from the previous chapters, in particular the animations and the audio sector. The first ones are excellent, as usual, in reality there wasn't much work to do and it was enough to take the motion capture movements from Chaos Theory to obtain a good result without even the slightest effort. The effects and samples are equally good, perhaps too good compared to the graphics sector, and there is a certain difference in quality. The game is totally in Italian and the dialogues are excellently interpreted; to lend the voices are the usual professional actors who have once again done a great job. Over the years, the Splinter Cell series has evolved in gameplay thanks to numerous innovations that have gradually made it deeper and more complete over the years. Let's think about the introduction of many items, the possibility of playing cooperatively and lots of executable moves that didn't exist before: Double Agent for Wii tries to do even more, or rather innovate the control system thanks to the Wii Remote and the Nunchuk. Initially you find yourself bewildered by the large number of moves, actions, items and weapons available, and it will take some time to learn how to do everything A complicated double game The resulting result is a hybrid game system between the classic joypad controller and a ~point and click~ very similar to what already happens on PC with the mouse. Initially you find yourself bewildered by the large number of moves, actions, objects and weapons available, and it will take time to learn how to do everything. The use of the remote control is new in the series and requires a certain initial effort, the hand and wrist must be ~calibrated~ on the TV to have precise control. Some actions will be performed by pressing the buttons or the d-pad, others by moving the controllers in mid-air. The problem arises from the fact that there are so many moves and you have to mentally learn which ones to perform ~in the classic way~ and which ones to do by moving the remote and nunchuck. Eventually the sense of immediacy is lost in a complicated play of keys and movements, and the simplicity often carried as the banner of the new Nintendo console appears a thousand kilometers away. When Rambo meets Inspector Gadget The Nintendo Wii remote control is used as a mouse-style ~pointer~: moving it rotates the view, clicking on objects, weapons and doors activates the commands. Instead, the classic analog is used for moving, while the lower keys are used for crouching and for the secondary attack. To climb ropes or objects, just move the nunchuck upwards, while by turning it to the right or left, you can stick to the walls to better observe the surrounding situation. It is also possible to swing: by swinging the nunchuck after jumping, Sam Fisher will move left or right while holding on to a ledge. The classic Splinter Cell actions are all there: the somersault, the splits, shooting while hanging, breaking the doors (this time by rotating the remote control left and right, you will feel strong vibrations), grappling the neck andvarious attacks. Most of these moves are performed with keys, the remote control, the nunchuck, or a combination of two of these elements. The equipment of this Double Agent is well stocked and definitely complete When Rambo meets Inspector Gadget The confusion that can arise from such a mass of possible interactions is understandable. The paraphernalia of this Double Agent is well stocked and decidedly complete: it starts with the classic SC-20 assault rifle, the electric projector that releases powerful discharges, the stickycam to control certain areas while remaining safe, the rubber bullets for to stun, grenades, the sniper, the sawn-off shotgun useful for close quarters combat, the legendary OCP which is the device used to disable certain electronic devices, and finally the EEV, the electronically enhanced viewer that allows us to detect territory objects and useful information. Obviously the list of weapons and objects doesn't end here, and the quantity is truly impressive; to these are also added the wall grenades, those with fragmentation, smoke and blinding flashes. An arsenal worthy of Rambo and Inspector Gadget. Cooperative mode The Nintendo Wii version of Double Agent completely lacks the online component; fortunately, however, the multiplayer part has not been completely eliminated and we can still play cooperatively with a friend of ours. These sessions, compared to those already appreciated on the Xbox which were merely playful levels against the CPU, intersect with the story and give greater depth to the game's plot. This mode can be really fun with friends, the only pity is that the replayability factor is not high: once all the missions are completed it will be difficult to pick up again. The difficulty is already quite high from the normal level; one hit is all it takes to go down. fortunately, however, the multiplayer part has not been completely eliminated and we can still play cooperatively with a friend of ours Cooperative mode At times it can be too difficult, almost becoming a ~die and try again~ until you memorize the enemy's moves. Staying on the subject of moves, there are some really interesting new ones: in cooperation you can persuade the enemy in pairs, if alone it is not enough, or climb the walls back to back. You can keep your partner hanging with a rope, make him climb a wall or heal him and share the equipment. There is also a ranking with times and objectives which mostly serves to make this mode long-lived. As previously mentioned, however, once you learn the missions repeating them will no longer give the same emotion as they become quite mechanical. Saving problems The slots for the saves are reduced to the bone: only one. You can save your game at any time, but not being able to save multiple times is a bad thing. Moreover, if we play cooperative missions, the save overrides that of the mission, and this can sometimes be frustrating. It is truly inexplicable why Ubisoft has not granted at least three or more slots, since Nintendo Wii has more than enough internal memory for the purpose. Final comment Thinking of a chapter of Splinter Cell to play with the revolutionary controls of Nintendo Wii may have made many people's mouth water. Unfortunately the intuitiveness of the remote control and the nunchuck have not been exploited properly and the result obtained with this Double Agent is a game with too difficult and complex mechanics. The high number of moves that Sam Fisher can perform can cause serious moments of crisis and memory loss: the difficulty is not so much remembering the moves themselves, but the combination of keys/remote control/nunchuck/movement to be performed. The graphic sector is also really insufficient and takes us back to the worst productions of the past generation: even the protagonist is unrecognizable. The only positive notes are the animations and audio, factors recycled from old chapters, and a fun, albeit short, cooperative mode. All in all a little bit. But after the announcement of the next chapter exclusively Xbox360, this could be the last appearance of Sam Fisher on Nintendo consoles. Pros: Cooperative mode Audio compartment Lots of weapons and items to use Cons: Really bad graphics Unintuitive controls Only one save slot Here we are at the first official appearance of secret agent Sam Fisher on Nintendo Wii, the ~new-generation~ console which, thanks to the innovations of its control system, will allow us to playexperience in a whole new way with stealth games based on the famous Tom Clancy novels. The title of the game developed by the French Ubisoft says it all: ~Double Agent~, an undercover agent who plays a double game in short. In fact, at every moment of the game there will be a bar on the screen that will hang on the side of Echelon or JBA, the two sides at war with each other, but if we lose the trust of one or the other, the mission will be immediately cancelled. Once certain primary objectives are completed, the trust of one faction will suddenly drop in favor of the other: it will therefore be our job to remedy immediately. The level of this indicator also affects the equipment at our disposal: the bad guys of JBA will mainly provide us with lethal weapons, while Echelon with rubber bullets, stun bombs and flash grenades. The narrative part of this Splinter Cell is different and more accurate than the already popular editions for Xbox 360 and PC: the Wii chapter is mostly similar to the PlayStation 2 counterpart, except for the controls, of course.", "date": "2007-02-08", "grade": null}