{"name": "UFC 2009: Undisputed", "ref": "https://multiplayer.it/recensioni/botte-da-orbi_a.html", "text": "The Ultimate Fighting Championship, also known by the acronym UFC, is an American mixed martial arts federation, as well as the most important of this sport worldwide. Known at its origins for its very brutal fights, over the years this organization has been able to transform itself by adopting stricter rules and by linking itself to various athletic control commissions, to become what it is today, i.e. a real sport not only for violence but aimed at enhancing the technical component of the struggle. In this way this discipline has begun to find more space on TV, finding the approval of a good portion of the American public (and not only) passionate about this type of sport. It was therefore inevitable that the UFC would also attract the interest of some video game producers, in the specific case of THQ, which has always been very attentive to the market of products dedicated to the world of wrestling (just think of the dozens of titles on wrestling) which entrusted to the Yuke's team the task of developing an ad hoc title for this discipline also on new generation consoles. The art of fighting UFC 2009: Undisputed is the fruit of this work, a product that promises to virtually revive the emotions and adrenaline typical of mixed martial arts matches. There are several game modes available (exhibition, the classic challenges that have made the history of the UFC, etc) among which the one called Career undoubtedly stands out. Here the player's aim is the same as in any self-respecting sports title, that is to create a wrestler and expertly guide him in his difficult climb to the top of the standings for the title of world champion in the category he has chosen to face ( five weight categories are available). And not just in the ring. UFC 2009: Undisputed in fact requires a fair amount of skill on the part of users in managing the athletes even outside the combat platform. In anticipation of the competition event, the video gamer must in fact worry about getting his virtual alter ego to train well, however taking care not to tire him too much, otherwise he will suffer poor performance when entering the ring for the actual match. The parameters on which it is possible to intervene to improve and enhance the impersonated wrestler are different and interesting: they range from the elements that regulate strength to those relating to speed or resistance (cardio) up to a large number of other skills, including moves. By hiring specific coaches, it is possible to participate in special sessions in which known techniques can be perfected or new ones learned. Then watch out for sponsors: the more famous you become, the more they will be willing to go crazy in order to put the logo of some of their products on the athlete's gloves or shorts. Multiplayer Up to two players can challenge each other both locally and online, in the latter case thanks to a broadband connection. By participating in an ad hoc tournament via the web, you can earn points and virtual admirers, until you become the best in the world. Perfect simulation It's just a pity that in the long run this aspect of the game ends up tiring given a certain repetitiveness in the actions to be performed. But let's now analyze the actual gameplay. Let's say right away that Undisputed is not the usual fighting game of those to be clear in which sometimes it is enough to press more or less at random on the buttons of the pad to create, with the help of a good dose of luck, some spectacular and involuntary combos, but rather a fighting simulator aimed primarily at an audience of enthusiasts and technicians. In short, non-occasional players, those who even in the titles mentioned above memorize every single move of a wrestler and perform them by skill rather than by chance. On the other hand, in a product that aims to best emulate a sport in which each fighter is allowed to use any anatomical part of his body to get the better of his opponent, this must necessarily be the case. Punches, kicks, knees, but also holds, takedowns and joint locks represent the fundamental basis of this sport. The playability of this title is something refined, extremely difficult to master but also very rewarding once you learn every single command. And in this sense, an excellent and accurate tutorial comes to the aid of the gamer who will guide him through specific workouts to extricate himself from the six basic fighting styles (Jiu-Jitsu, Muay Thai, Boxe, Wrestling, Judo and Kickboxing) that characterize this sport and the 84 fighters of the five official categories of the UFC, from Lightweight to Heavyweight, prehear in the THQ title. Each of them is the faithful reproduction of the respective real counterpart not only aesthetically but also in the behavior in the octagonal shaped ring and in the technical skills. Therefore, depending on which of them you decide to play in the game, you can experience completely different fighting styles. In some cases the raw attack will be privileged, in others a more careful and patient strategy. Playstation 3 trophies UFC 2009 Undisputed offers the player 31 trophies, of which 10 bronze, 16 silver, 4 gold and 1 platinum. Trophies are linked to various aspects of the game, from the type of KO inflicted on an opponent to the type and number of victories online, from unlocking movies to completing the various modes, to reaching a certain number of fans in the special tournament ranking via Internet. While to receive the coveted Platinum it is necessary to obtain all the Gold, Silver and Bronze Trophies. Audio & Graphics It is not always necessary to rely on the opponent to beat him up or grab him and throw him to the ground. Sometimes it is advisable to keep a safe distance to perhaps take advantage of the ardor of others to unbalance him and immobilize him on the ground, for example using the right analog stick which manages the holds, double-holds, etc., to block the opponent and only then fill him with punches earning valuable points for the final victory. After all, it is not necessary to KO the other athlete to win the match. Too bad that some small bugs relating to physics and collision management occasionally create too many problems in these situations. Without wanting to exaggerate, the possible combinations of all the available fighting techniques are almost infinite, so much so that each encounter is always different from the next. Even facing the same opponent previously defeated with ease, an approach that is always very attentive to the event is required: thanks to the advanced AI and the variety of moves and situations that can be verified during a match that we mentioned just above, in fact, each challenge will always turn out to be different. The graphics sector of UFC 2009: Undisputed is the best ever seen on new generation consoles in products of the genre. The athletes are recreated in an almost perfect way, with well-made textures and an almost obsessive attention to detail. Seeing some phases of combat it really seems to be faced with a real match of this sporting discipline. Just think of details such as the sweat that begins to appear on the body of the athletes during the clashes or the wounds that open on their faces based on the blows received. The same positive speech can be made on the surrounding elements, such as the scenarios and the ring, and for the animations, many for each athlete and related moves, globally well done. Of course, a few small flaws here and there are noticeable, but nothing particularly annoying or worthy of mention. Even the audio makes a good impression with a highly effective soundtrack that can boast the presence of the likes of Papa Roach and Puddle of Mudd as well as other Heavy Metal groups, and ~in game~ sounds such as screams (of the audience and of the fighters), background noises, impact of blows, etc., directly sampled on the edge of the platform and therefore excellent.", "date": "2009-06-11", "grade": "8.5"}