{"name": "Al Grande Slam con SEGA!", "ref": "https://multiplayer.it/recensioni/virtua-tennis-2009.html", "text": "Version tested: Xbox 360Virtua Tennis 2009 is not only the new chapter of one of the most popular sports series of all time, it is also the resurgence of a philosophy that follows tennis. From that first chapter dating back 10 years ago and to the Dreamcast its ability to restore the feeling of balls and rackets in an absolutely arcade way has remained unchanged. This is the premise with which we must approach the new episode. A story, a legend It's already been 10 years since SEGA-AM3 made its tennis masterpiece debut in the arcade, a title that has subsequently filled the hearts of all Dreamcast owners. With Virtua Tennis 3 the series has reached the next generation consoles and has therefore faced high definition for the first time with all that it entails. Precisely this last chapter has certainly been questioned by all the most loyal fans, thanks to some questionable choices, first of all the excessive presence of ~dives~ by the players to reach the furthest balls, but also the presence of a great rival like Top Spin. With Virtua Tennis 2009 the developers try to respond to the various criticisms with a product that seeks to be complete, faithful to tradition and improved from all points of view. We have decided not to follow the usual order but to deal first of all with the question of playability and response to the commands of the SEGA title because we believe it to be the fundamental aspect. All Virtua Tennis enthusiasts will have absolutely no problem in managing the commands which, as per tradition, reserve the left stick to the movement of the athlete and to directing the shots, with the A key the main shot is used, with Y the lob and with X and B the hits lifted. In practice nothing has changed, the feeling is the same, what has been heavily modified is the speed of the game, now less frantic and more thoughtful, with more time to decide how to respond and to embarrass the opponent. We also immediately clarify that the ~cursed dives~ have been completely eliminated by the developers and replaced by effective stretches in the same way and therefore capable of making us reach considerable distances without however slowing down the player tremendously. This choice does nothing but decrease the reaction time and therefore speeds up the recovery of the player who becomes ready after a few moments to respond to the opponent's blow. Every match, be it an exhibition or a ranked one, is a constant succession of blow after blow. The World Tour From the first menu that appears on the screen it is immediately clear how the SEGA title is set up, on the one hand exhibitions and online challenges on the other the World Tour, the real fulcrum of Virtua Tennis 2009. The campaign is tackled starting from scratch, essentially you have to choose a character by creating it from scratch with the overly simplified editor available. The customizations are not many and too many characters look alike, especially at the beginning of the game in the challenges for the lower levels of the ranking. Once the tennis player has been created and his country of origin has been chosen in which to place the Home, everything revolves around the calendar of events, divided by weeks; this offers from time to time the various tournaments to which it is possible to access, keep in mind that at the beginning there are many limits and we will not be able to join various events. There are not only tournaments but also a training center where it is possible to improve one's skills, divided into three categories: ground strokes, footwork and technique, and service and volleys. The coach is a certain Tim Henman... perhaps some of you already know him, through the exercises he requires us to do, the statistics improve, affecting the style of play. Access to tournaments is regulated by passes that can be purchased from time to time by putting your hand in the nest egg collected by winning the various events. In the store you can also find many items to customize and improve the look of the sample. Curiosity There are 20 real tennis players present in Virtua Tennis 2009, here is the complete list: Roger Federer, Rafael Nadal, Novak Djiokovic, Andy Murray, Andy Roddick, David Nalbandian, James Blake, David Ferrer, Mario Ancic, Tommy Haas, Juan Carlos Ferrero, Venus Williams, Ana Ivanovic, Svetlana Kuznetsova, Amelie Mauresmo, Maria Sharapova, Anna Chakveradze, Daniela Hantuchova, Nicole Vaidisova, Lindsay Davenport. There are also 5 secret characters including the inevitable King and Duke. What a struggle to follow the calendar During the World Tour we will face the different matches to climb the rankings, matches which, as mentioned, are marked by a precise calendar. We will be able to face the single events both by facing the single tournamentis double if we have made friends with at least one of the other players in the ranking. By winning the single tournament we will earn two positions in the ranking while by triumphing in both events we will earn three. It is clear that at this rate it takes time to get to the top. A characterizing element of this Virtua Tennis 2009 was already present in Virtua Tennis 3, fatigue. The player we created has a certain energy that is displayed via a meter located at the top of the screen when we are on the main World Tour screen. We cannot ignore it, the tennis player needs constant rest to avoid injuries or even an early retirement from the scene. If you really can't do without it, it is possible to restore a part of the energy by consuming an energy drink for a fee but don't abuse it, the accident is around the corner. Energy is restored in the best way either by stopping for a week or by going on a paid holiday for two weeks. The choice is yours and pay attention to the calendar so as not to miss the best events. Directly from the World Tour board it is possible to go online for single classified challenges or real online tournaments with the respective character. Our advice is certainly to upgrade it to the maximum before tackling the obstacle of clashes against human opponents. Minigames what a passion! To grow and make our player stronger and stronger, we cannot escape the challenges proposed by the 12 mini-games present in the World Tour. The mini-games featured in this edition of the SEGA series are as always fundamental with regard to the development of our character as well as being decidedly fun and capable of stealing attention from the real challenges against an opponent, especially since it is possible to face them even online. Let's see them in detail. In ~War of the Pirates~ our tennis player finds himself busy hitting the tennis balls launched by fast pirate ships that will try to bring him down with cannon shots, fast legs and steady nerves. In ~Demoman~ you have to break down the wall of blocks in front of the player, in a sort of Tetris or better adapted Pong. With ~Merenda Time~ you have to prevent the crocodiles from reaching the food, how? Literally hitting them with balls. In ~Alien Attack~ we find ourselves fighting the descent of extraterrestrials a bit like in Space Invaders. ~Spazza Birilli~ is bowling played with a tennis racket and powerful serves. ~Curling in Campo~ is the reinterpretation of one of the nicest and at the same time difficult winter sports, skill and precision are needed to get the most points. In ~Conta Mania~ you have to shoot down targets according to a precise numerical sequence. With ~Spese Pazze~ we will have to run from one side of the playing field to the other to collect all the objects arranged on the ground while avoiding the spheres launched by the cannon that shoots balls. Of the mini-game ~Billiards~ it is superfluous to speak, instead of a cue a tennis racket. To refine your aim and accuracy you shouldn't overlook ~Rovescia Barile~, hit the cans to make the red targets fall on the playing field. ~Avalanche~ is probably the funniest, reminiscent of ~Spese Pazze~ and the aim is to collect the fruit on the ground while avoiding the huge tennis balls. The last one is ~To each his own~ in which the correct fruit must be offered to the different animals placed at the bottom of the playing field. The minigames are nothing new for the series but we certainly can't complain about the variety of those present, a pleasant alternative. Xbox 360 goals Getting the 1000 points divided into 50 objectives is long and tiring. The objectives vary widely, from winning more than 25 games without suffering defeats, to completing all the challenges proposed by Tim Henman to hitting one of the line judges with the ball. Scoring with a volley or from the baseline will have its effects on the goals, don't take it lightly. Ups and downs From a technical point of view, the SEGA title must be analyzed in detail. Some aspects of this new episode of Virtua Tennis have certainly improved, as the more refined animations and the disappearance of the annoying player's dive were said at the beginning, but others leave at least perplexing. The artificial intelligence of the opponents especially in the initial levels, but not only, is set too low. We don't think we are phenomenal but we can confess without fear of contradiction that the first point immediately came after 5 entire singles and doubles tournaments, and we only mean 15, certainly not a lost game. A somewhat exaggerated result. Of the editor excessesvery scarce we have already said while we cannot deny that the work done by the developers to recreate the real tennis champions in virtual form is certainly superb. There are more than 20 real tennis players, including Federer, Nadal and the beautiful Sharapova together with Serena Williams as well as some legends of the past, perfectly reconstructed also in their movements thanks to a perfect motion capture job. The playing arenas are reconstructed well even if the models of the public, referee and line judges leave something to be desired. As for the playing surfaces, they are all present, and we honestly expected more in terms of realism. On red clay it is by now a duty that the game balls leave some traces on the ground. As far as the online challenges are concerned, we have to admit that Virtua Tennis 2009 isn't perfect yet, on more than a few occasions we have suffered from annoying delays and whoever hosts the match seems to have a decided advantage, having just come out most likely with a next patch these problems will be solved , we count on it. From the audio sector do not expect any additional joy, all very anonymous in which a good spoken Italian stands out but it is quite ridiculous to hear the voice talking about player one, player two, player three and so on, a little more customization it wouldn't hurt.", "date": "2009-06-07", "grade": "7.5"}