{"name": "L'ultimo Remnant arriva su PC", "ref": "https://multiplayer.it/recensioni/lultimo-remnant-arriva-su-pc.html", "text": "In full completion of its acquisition of Eidos, Square-Enix definitively launches its attack for the conquest of the western market with The Last Remnant (from now TLR), a ~Japanese-style~ role-playing game which however does not fail to bring some novelties to the within its genre to try to exert its charm even on players without slanted eyes. It is no coincidence that the first platform on which it has already arrived for months is precisely Xbox 360, as we were also able to see in our review dating back to the beginning of December, in which, in addition to the game's merits, some gaps were also highlighted, especially in the technical sector based on Unreal Engine 3. Just to reward PC players for the additional wait they had to endure, the developers promised a revised and corrected version of the game, thus trying to achieve the deserved success without any gaps with the second chance represented by this new release: the credentials are all there, we just have to find out what awaits us after installing TLR on our PC, while those who want to complete this process can take a look at the review of the Xbox 360 version of the game, to which we gave a 7.2 score last November. For the benefit of those who have not yet had the opportunity to read the plot of TLR, we will resume the first part of it, taking the opportunity to note that despite the attempts to westernize this title as much as possible, Square-Enix does not give up some classics of game storytelling Japanese role: immediately after the introductory film, the rowdy protagonist Rush Sykes finds himself desperately looking for his sister who has been kidnapped by some bad guys. Soon on his way he will meet the king (also a boy) David, he will discover the truth about his parents and realize that the events of his family do not belong only to the latter but are linked to the fate of the whole world, which peace politics is based on the presence of some mysterious artifacts called Remnant, destined to become the object of desire of the bad guy of the moment, another westernized character recalling in some ways Sephirot of Final Fantasy. Western RPG? Like all the rest of the elements that make up TLR, the game mechanics have also been directed towards a departure from the classic canons of Japanese-style role-playing games, first of all depriving the player of the possibility of encountering enemies on the map in random mode, certainly one of the most hated features by us Westerners in the so-called jRPGs. However, the removal of this element forces us on some occasions to go around trying to kill as many opponents as possible, in such a way as to increase one's level by arriving within reach of the boss on duty, which therefore changes slightly the mechanics from which Square Enix seems to be struggling to break away. A further piece of disjunction with what we are used to seeing is the limitation for the player to roam freely when and how he wants around the map: the most striking example is certainly the side quests, to complete which we are immediately catapulted into the designated dungeon then going back in the same way once you have cleaned up everything there is to sweep away. The most convincing aspect of the game is probably the combat system, revised compared to the past to give more breadth and a more epic tone to the battles, in which we now see fairly numerous formations involved, divided into smaller groups to which to give commands, also trying to elaborate a little strategy. In fact, we find ourselves commanding units made up of a maximum of 5 members, which in turn can be used together for a maximum of 5, thus allowing for forces deployed for a total of 25 different fighters: in reality, to simplify things a bit, the units behave as if they were a single nucleus, adopting a single energy bar and offering the player the possibility of issuing generic orders rather than saying one by one what to do during battle, whose mechanics prove to be the most interesting element of TLR. Long live PC If from the point of view of game mechanics, practically very little changes compared to the Xbox 360 version with the possibility of using a fast mode in combat and little else, the same cannot be said for the graphics of this game, based on Unreal Engine 3 and revised and improved by the developers as promised to meet the favor of PC gamers, even more intransigent than their console counterparts towards defects. The long loading times of the versionand TLR for the Microsoft console are just a memory, as well as the uncertainties of the engine, all solved by obtaining a stable frame rate and generally cleaner and more accurate graphics than previously seen, even if not free from defects attributable to the 'use of an engine whose limits we know well by now. The audio sector remains of excellent workmanship, with a soundtrack worthy of an epic adventure like the one told within this game. A sore point is the difficulty encountered in playing with the classic combination of mouse and keyboard: much better to replace it with a nice joypad, possibly just the Xbox 360 one to get the best out of the control system, given that the developers in porting they don't seem to have dwelt too much on this aspect.", "date": "2009-05-26", "grade": "7.5"}