{"name": "Tira fuori gli artigli!", "ref": "https://multiplayer.it/recensioni/tira-fuori-gli-artigli.html", "text": "There is no doubt that Wolverine is a prominent character in the large group of Marvel superheroes: his presence in the X-Men has always guaranteed the group an extra of all respect, and in the most important crossovers the Canadian mutant never misses all 'appeal. Previously covered by the most absolute mystery, its origins were told years ago and more than one miniseries was dedicated to the story, so much so that by now few people do not know about Logan's ~past lives~, his healing factor that This fact prevents him from aging and the military experiment that transformed him into the so-called ~Weapon X~ by covering his bones with a virtually indestructible alloy, adamantium. The film focuses precisely on this phase of Wolverine's life: having escaped the thousand prejudices that entails being a mutant who cannot die and who pulls out his claws if necessary, Logan earns his living by being a woodcutter and returns in the evening home to the woman he loves, Kayla. A situation that is not destined to last, however: characters belonging to the Canadian's past are preparing to make his life hell, in a series of events that culminate with the experiment conducted by Major William Stryker. I'm the best at what I do... X-Men Origins: Wolverine is a cross-platform tie-in that in its Wii version, for a change, doesn't refer to what was seen on nextgen consoles. This does not mean that we can wield Wii-motes and Nunchucks and shake them reproducing the character's fearsome slashing, but that we have to settle for a less accurate reduction, less full of thickness and in all probability less fun. In the game we obviously control Wolverine, within a series of stages that try to retrace the phases narrated in the film. We can move using the Nunchuck's analog stick, while the combat system is based on the alternating pressure of the B (light attack) and Z (heavy attack) buttons, the combination of which creates sequences increasingly spectacular and effective attacks. The offensive maneuvers available to us, as well as the basic characteristics of the character, can be enhanced through the upgrade screen, by spending the points earned from eliminating our opponents: we can speed up the mutant healing factor, increase total health or acquire new and different combos. The jump is deputed to the A button, and carrying it out near ledges makes us able to grab them to hoist ourselves up. In some situations, however, this maneuver proves to be ineffective and we need to identify, by pressing the ~+~ key, a handhold to launch ourselves into a longer jump than usual: all this must be done by shaking the Wii-mote in the direction indicated on the screen. Pressing the ~-~ key instead serves to resort to Logan's famous ~super senses~, which make us able to follow the tracks of our enemies as well as identify passages hidden from view. ...but what I do is not pleasant The structure of the levels is quite simple: we find ourselves in a particular location, hordes of opponents arrive to kill and at the end of each ~wave~ we have to find the right way forward. The fact of not being able to freely control the view (the d-pad, in this case, is only used to carry out quick evasive maneuvers) makes things less intuitive, thanks to a certain repetitiveness of the settings. Were it not for the brevity of the internships, in fact, one would even run the risk of no longer understanding where one is. A frankly disappointing formula, in short, which contrasts repetitive and very unfunny fights with simplistic and apparently drawn-out exploratory phases. An already unhappy situation, which gets even worse when there are ~boss fights~, regulated mostly by quick time events. The meager as immediate ~game over~ message, which arrives as soon as we run out of energy, closes the circle of a realization that more than technically leaks in terms of design, offering repetitive and fragmentary action when not limited and boring. Technical realization As already mentioned, the game does not have a manual adjustment of the view, therefore it is possible to look at the locations only from a predetermined angle. In fact, to be honest, there isn't much to see: often the environments stand out for their desolation, for the presence of structures that are too simple and for a general repetitiveness. Activating the ~super senses~ causes a series of ~trails~ to appear on the screen, offering a decent visual representation of this power, but the truly spectacular sequences are lacking. The character of Wolverine is done in an understated way, with good animations and details, but the same is notit can be said of the many adversaries we have to face, divided among very few types. The choice of colors is questionable. As far as the sound is concerned, unfortunately not a great job has been done, indeed the voices stand out for an ability to empathize that borders on zero: Sabretooth who fights with Logan on the trailer of a moving truck, with no holds barred, and speaks like if you were dictating notes to your secretary. The background against which this sound atrocity takes place is made up of effects and music that neither stand out nor obviously remain in the head. The Nintendo DS version The reduction of X-Men - Origins: Wolverine for Ninendo DS is very similar to that of Spider-man: The Kingdom of Shadows, also for the dual-screen portable console. Both games are classic two-dimensional platformers, in which the protagonists can fight in different ways and must explore the stages to eliminate all the enemies inside them as well as to collect a series of objects. In this specific case, the approach is decidedly more cartoonish than what was seen on the Wii, with the story that is linked to that of the film only briefly: the incipit is identical, but from the Weapon X experiment onwards proceeds a bit improvising. The control system sees the d-pad used for Logan's movement and the X, Y, A and B buttons respectively for strong attack, weak attack, sprint and jump. The back buttons are used to parry and to activate the ~fury~, a mode in which it is possible to launch blows towards the enemy by ~drawing~ them on the touch screen: an interesting idea, which should be recovered for the future. As in the Wii version, offensive maneuvers are basically based on combos and as you progress you can unlock new moves, useful for dealing with more difficult opponents as well as adding a pinch of variety to otherwise too limited gameplay. The graphics of the game are completely polygonal, very fluid, characterized by a large number of different characters who, however, cannot boast who knows what level of detail. Likewise, the settings are often very simple and sparse, with a use of colors that does not help improve their appearance. Ultimately, the game in its Nintendo DS version is a platformer with little pretensions, quite fun and technically discreet. Not an essential masterpiece, in short, but it could have been much worse. SCORE: 6.5", "date": "2009-05-18", "grade": "5.2"}