{"name": "Facciamo un giro", "ref": "https://multiplayer.it/recensioni/facciamo-un-giro-signorina.html", "text": "Probably no one has forgotten the first OutRun, in the arcade: on board a Ferrari Testarossa, with a beautiful blonde girl sitting alongside, we launched into a race that was as fast as it was carefree, overtaking hundreds of cars in an attempt to complete the sections of the route within the time limit set on the screen. A test of reflexes, more than anything else: being an arcade title, the SEGA racer allowed us to tackle the curves at full speed, making minimal corrections with the steering wheel and changing between the two available gears (~fast~ and ~slow~ ) to take advantage of traction when needed. In the vicinity of each checkpoint it was possible to decide whether to take the left (easy) or right (difficult) junction, aiming towards one of the five final destinations available to obtain a different epilogue. It took a good seventeen years to have a sequel to OutRun, but it was worth it: the new episode of the series (released in theaters in 2003 and converted for Xbox the following year) enjoyed a Ferrari license which finally made it official presence of the Testarossa, as well as several other cars from the Maranello team; but above all it offered an exceptional visual spectacle for speed and detail, together with a gameplay with greater depth thanks to the possibility of performing spectacular controlled drifts to tackle curves without braking. The home version could also count on a series of alternative modes to the classic ~in stages~, such as to make the experience exponentially more complete and long-lived. The success of OutRun 2 gave birth to a new version of the game always for theaters, OutRun 2 SP, featuring fifteen completely new courses and set in the USA. Comparison OutRun Online Arcade is available for both PlayStation 3 and Xbox 360. The two versions of the game have the same cost and are identical in every respect, so the differences lie only in the specific characteristics of each of the two consoles and in the related services offered. In the case of Xbox 360 we certainly have a better voice chat and perhaps a little more populated online multiplayer, while on PlayStation 3 we can enjoy a better control system due to the length of the left analog stick, which offers greater ~support ~ and precision especially during millimeter trajectory changes. At full speed Downloadable at the price of 9.99 euros from the PSN (800 Microsoft Points on XBLA), OutRun Online Arcade is in fact a port of OutRun 2 SP (and not of OutRun 2006, due to the lack of the fifteen classic courses) for PlayStation 3 and Xbox 360, which compared to the original arcade has the modes already seen in the second episode of the series plus an online multiplayer for up to six players at the same time. Once the game has been downloaded (it is just over 300 MB) it is possible to try the OutRun, Heart Attack and Time Attack modes, or face the brand new integral mode (also from a Time Attack perspective) which sees the various routes connected to each other for a total of fifteen exciting sections of increasing difficulty. The OutRun mode is the classic one, regulated by a timer that is renewed at each checkpoint and by the possibility of choosing the easiest (left) or most difficult (right) junction to obtain a different final sequence in the end. The game allows us to select our car from those available and to choose between manual or automatic transmission, then the start of the race is sanctioned by a green light. As mentioned above, the modern incarnations of the SEGA classic boast an arcade gameplay but with greater depth, in particular thanks to the possibility of performing controlled drifts to tackle curves: with the steering wheel already tilted, you give a hit on the brake and then again on the accelerator to cause the car to lose its rear end, determining its trajectory while acting on the front wheels. The ~wake~ element has also been introduced, i.e. the possibility of increasing one's speed by taking advantage of the aerodynamic advantage constituted by the vehicle in front of us. This is a determining factor, especially when you have to overcome direct opponents, who are not inclined to let us pass. The wind in your hair The contour modes offer the classic possibility of honing one's skills both in ~acrobatic~ terms and in terms of driving speed. Time Attack is a useful opportunity to study the tracks to perfection, battling with your own ghost to identify the trajectories and the best solutions to adopt in all situations. In that sense it is very interestingThere is also the possibility of tackling all of the fifteen tracks, one after the other, within a truly demanding challenge. The Heart Attack mode, on the other hand, sees us satisfying the requests of the girl sitting next to us with regard to spectacular driving, i.e. performing drift sessions, collision-free driving, tunnel crossings and so on at regular intervals, always maintaining sufficient speed to get to the next checkpoint. From this point of view, online multiplayer is the element of greatest interest, even if on balance its implementation could make the most demanding players turn up their noses. There is in fact a single mode for up to six participants, with a variable consisting of the possibility of choosing between normal or ~prepared~ (more performing) cars, inserting the ~pursuit~ factor (which makes the pursuers faster than those is in the lead) and enable or disable collisions. The system adopted for matchmaking is unfortunately not the happiest, as few matches are found (even more so when the filter by nationality is applied) and very often you have to wait several minutes in the waiting room because the match is already underway unfolding, without any indication of its duration. Clearly, it is possible to join an existing game as well as create a new one and wait for someone to fill it, or invite your friends via a simple and fast interface. Although problems related to lag are not uncommon (with sudden accelerations of the cars or ~teleportation~ phenomena), the problem of OutRun Online Arcade on PS3 mainly concerns the quality of the voice chat, really mediocre: although it is always active and therefore not linked when a key is pressed, the service is characterized by the excessive ~metallic~ effect of the voices, probable indication of a low dedicated bandwidth, as well as by the delay of the same. Playstation 3 trophies OutRun Online Arcade offers 12 Trophies (4 silver and 1 gold) of increasing difficulty, which alternate the simple completion of a race with manual and automatic transmission to reach the accumulation of one million credits. The more challenging ones are aimed at the timed mode, the online part and the Heart Attack Mode, where you need to get a triple A score in all game steps. Technical realization We are dealing with a few years old title, therefore a technical comparison with the current racers appears completely out of place. Having said that, even in this new incarnation OutRun does not give up the traits that have always distinguished it: very high speed, evocative landscapes and ample sense of ~freedom~ given by very wide and densely populated roadways. The graphics flow smoothly and quickly, while before our eyes sunny and lively scenarios alternate with snowy stretches, mountains and even construction sites. The realization of the tracks is excellent, with some reservations relating to some precise choices, while unfortunately the graphics engine yields to evident uncertainties when passing from one background to another, immediately after having taken the junction which determines the difficulty of the race, so much on PlayStation 3 as well as Xbox 360. Too bad. The sound sector offers us the classic music of OutRun plus some unpublished songs, but the intent is more to please the nostalgic than to offer everyone a quality accompaniment. The control system sees the L2 and R2 backbones assigned respectively to the brake and the accelerator, the left analog stick to control the steering wheel and the central buttons of the Dual Shock 3 to change gear and view. Driving is extremely comfortable and precise, probably thanks to the height of the stick and the support it offers above all during the millimetric changes of direction, when the curves are ~brushed~ rather than tackled in drift. Even the secondary backbones behave admirably, without ever being ~slippery~ and offering an excellent response to pressure.", "date": "2009-05-18", "grade": "8.0"}