{"name": "La tiepida ascesa di un garzone bollente", "ref": "https://multiplayer.it/recensioni/dalle-stalle-alle-stelle-la-tiepida-ascesa-di-un-garzone-bollente.html", "text": "Larry's is a license with a decent past: a series of graphic adventures belonging to the era in which defining them as classics did not make sense, since the genre was helping to define it right at that time. Certainly the series dedicated to Larry remained etched in the memory of the users of the time for the sexy humor, which is rare to find in a video game today, let alone fifteen years ago. Still, is that enough of a reason to go and exhume old Larry? Probably not, and the developers of the historic Team 17 must have noticed it too, judging by the reluctance with which they created a dull, sometimes dull, and champion only in flaws video game. In any case, let's get rid of the thought and deal with the erotic component of the game, mainly of a verbal type: from this point of view, it must be said, we have never heard a character in a video game swear so freely, make constant and explicit references to sex, and perform in capricious jokes of this kind. This aspect would also have flattered us - we are adult players - if it weren't for the fact that the lyrics don't belong to an Antonio Albanese from the best of times, but rather seem like the fantasies of a nerd who, in terms of sexuality, has stopped at the onanistic phase. The jokes are obvious, not at all witty and overabundant, without respite; a language that first triggers the yawn and then whets the irritation. Don't worry though: the worst is yet to come. What's more boring than sex? Larry Lovage is the nephew of the old Larry, and it will be him that we will have to drive inside his uncle's film studios to foil a plot, perhaps hatched by some rival producer. Larry is initially just a jack of all trades: young, lacking in charisma, and obsessed with sex. However, he will practice very little of this, busy as he is carrying out a series of tasks that will force him to grueling tests of ability. Platform elements, driving sections, scuffles and mini-games of various types represent the routine in Larry's life, who will even go as far as improvising as a sniper. The horror instead begins with the imprecise controls and the total lack of depth of the challenges, exacerbated by the misdirected camera (and fortunately we are in the Californian studios), and by the possibility of falling from a height and getting killed, so that start all over again. The environments have been cleaned of as many details as possible, with the exception of some film sets on which the parody of famous films is shot: however, the pleasure does not last long, and it is not enough to make us forget the presence of non-player characters, grotesque to the point of to embarrass. The speech of the game is in English, while the subtitles are in Italian, although the graphic style with which they have been inserted only serves to remind us how much we can work against the will sometimes. Bottom line, if there was one thing Larry really didn't need, it was a game like this. Leave nostalgia aside, the past may not be as rosy as you remember it.", "date": "2009-05-18", "grade": "4.5"}