{"name": "Zombie da giardino", "ref": "https://multiplayer.it/recensioni/plants-vs-zombies-recensione-con.html", "text": "It doesn't happen very often that the titles of PopCap Games come to stir the enthusiasm of the most passionate players: it happened with the two Bejeweled and Zuma, it happens again now with this Plants vs Zombies, a very valuable exponent of the now almost forgotten genre Tower Defense which in the recent months seems to have regained color with some other interesting releases, GeoDefense for iPhone above all. In short, it is a question of defending one's base from enemy attacks, exploiting the tools progressively made available to counter opponents equipped with increasingly fearsome weapons; this time, however, the battlefield will be the lawn in front of one's home, the enemies of the hungry zombies of the brains of those who live in the house and the powerful means of destruction in the hands of the user, ordinary vegetables. Jewel of consistency and variety The first levels of Plants vs Zombies are a perfect tutorial for the extremely simple game structure chosen: by exploiting the sun and placing sunflowers on the ground, points are earned which can be used to call attack plants which, capable of firing projectiles, hit and then kill the zombies. As the levels go by, new varieties of both are added and new solutions and some special levels are experimented with, for example where you can use boulders as if they were bowling balls or choose from a series of predefined attack tools. But what happens when night falls and the sunlight is no longer available, or when the attacks move to the other side of the house, featuring a swimming pool? Plants vs Zombies, starting from a trivial premise, builds a series of situations as bizarre as they are coherent with the game universe, adding increasingly complex strategic elements, constantly changing the cards on the table and doing nothing but giving new tools to solve modified from old problems, but perfectly balancing the difficulty and never slowing down the pace of the action. After dozens of levels spent between carnivorous plants and others capable of throwing freeze balls, sniper mushrooms and other bombs, perfect for killing the fearsome zombies Michael Jackson and their dancing adepts or for taking down the lightning-fast undead football player style, you they open up new possibilities, puzzles and minigames arrive, very often made in such a way as to exploit the irony that cloaks the whole production to rework ideas expressed in other games, even by PopCap. A huge amount of content, immediate and practically accessible to everyone; of course, it remains a product based on a gameplay that is not similar to all tastes and digestible by lovers of pure action, but with the exception of a few shortcomings, such as a multiplayer mode that could have been created with a little imagination, the 9.90 euros requested for download, even via Steam, they are a bargain. 2D for everyone Aesthetically Plants vs. Zombies doesn't shock, offering colorful and pleasant two-dimensional graphics, full of humorous ideas but not particularly spectacular, also due to decidedly limited animations. Nothing serious, of course, the aspect is functional to the gameplay and no one will complain that a production with such a low budget - and price - is not equipped with a technically brilliant work, but a little more variety in this sense does not it would have spoiled. The same goes for music, the few tens of megs of the executable include little more than a musical theme and, although non-invasive, after a while you end up suffering from repetitiveness. If it's technically okay, owners of older computers will have no problem running it smoothly, and the minimum requirements listed even below seem exaggerated, possibly flagged for excess. Just the extreme lightness of the title suggests, in case of commercial success, a possible future conversion on other platforms; fingers crossed. PC - System Requirements Minimum Requirements Processor: 1.2 GHz RAM: 512 MB Video Card: 128 MB Disk Space: 65 MB Test Configuration Processor: Intel Core 2 Duo E6400 RAM: 2 GB Video Card: NVIDIA 8800 320 MB", "date": "2009-05-04", "grade": "9.0"}