{"name": "Il ritorno di una grande saga", "ref": "https://multiplayer.it/recensioni/suikoden-tierkreis.html", "text": "With the global success that Nintendo's portable system has been having for years now, it was only a matter of time before a franchise like Suikoden also made its appearance on the DS's dual screen. Actually, Konami's RPG series isn't new to these excursions: the portings of the first two, legendary PSP episodes and a mediocre Game Boy Advance card-game are a case in point. However, Tierkreis is a real spin-off of the mother saga: it captures some fundamental characteristics, such as the presence of the canonical 108 Stars of Destiny, but other than that it is just a rather common RPG. And that's certainly not a bad thing. What's left of Suikoden? The first piece of information that definitely made a stir with Tierkreis' announcement concerns the unedited setting: while the various chapters of the mother saga offer connections and references to each other, Tierkreis is set in a parallel universe, presents new characters brand new and essentially establishes a new mythology for the series. Fans be warned: the pleasant feelings of familiarity at the sight of familiar faces and territories are over. The story is rather linear, it maintains the usual political intrigues and moral dilemmas but everything is lightened a bit, as if to underline the transition to a portable entertainment system. The protagonist of Tierkreis and his fellow adventurers come across an ancient magical book that gives them extraordinary powers: however, the tome is also sought after by the Order of the Only True Way, a sort of fanatical religious sect of destiny and a predetermined future. , a concept that already clashes with the libertine spirit of the main character, and which will be the pivot of a war without borders in which the 108 Stars of Destiny will take part - as per tradition, recruitable as in any self-respecting Suikoden. The fast pace and linear development, often proposed through finely crafted cartoon cutscenes, make this Suikoden Tierkreis a sort of videogame ~anime~: the rather static characterization of many characters, clearly divided between good and evil, leaves a little dumbfounded , but there is no shortage of twists and adult moments that will glue even the most avid fans of the genre to the DS. A traditional RPG There are no duels and there are no mass battles: the elimination of two main points of the gameplay of the Suikoden series brings Tierkreis up to the standard of classic RPGs, and if it weren't for the 108 recruitable characters and the peculiar art style, it would really seem of not deal with an episode of the series, spin-off or not. The Runes system has also been replaced by the Marks of the Stars, i.e. the powers that can be conferred - in a maximum number of four - on each character: in practice, his personal set of spells and abilities. The fights, on the other hand, heavily recall the saga, random attacks with a rather high frequency and turn-based clashes: the player orders the four party members how to act and then the blows are exchanged with the unfortunate enemies. The variety of spells, weapons and the inevitable combined attacks make every fight a pleasant experience, despite the frankly excessive ease of many battles, which can often be solved by setting the automatic attack while in the case of the bosses a little more strategy is required. Also on the technical side Suikoden Tierkreis proves to be an excellent product with some reservations. The realization of the locations, completely 2D, is truly phenomenal for detail and complexity: the various 3D characters move in them which, despite the fluid and numerous animations, leave a little dumbfounded by the amount of polygons and modeling. The situation in battle improves slightly due to the greater care placed in the creation of the various enemies, fighters and graphic effects related to spells and attacks. Of course, we are far from the refined style of the polygonal models of Final Fantasy IV, but we must still consider the amount of characters present in Tierkreis, many of which can be used in combat. The soundtrack is also of excellent quality, it offers numerous and various excellently made songs that pleasantly accompany the player in battles, exploration of villages and dungeons or in reading the texts through which the story unfolds: most of the dialogues are completely dubbed in English, but for some bizarre reason Konami has chosen to speed up the playback and, in other words, the protagonist and a few other characters seem to eat their punctuation while speaking their lines as if they were Speedy Gonzales.", "date": "2009-05-04", "grade": "8.0"}