{"name": "Final Fantasy Crystal Chronicles: Echoes of Time - Recensione", "ref": "https://multiplayer.it/recensioni/final-fantasy-crystal-chronicles-echoes-of-time-recensione.html", "text": "The Crystal Chronicles series has been running parallel to its older sister for some years: the softco entrusts these Final Fantasy with an almost experimental role, studying the tastes of the public and developing titles that are decidedly different from the canonical JRPG in which the saga has been reflected for two decades. Echoes of Time is the third episode based on the ~dungeon crawling~ concept: we started from the Game Cube years ago to land on the Nintendo DS last year with Ring of Fates, which was quite successful despite various technical and playful problems that afflicted him. With Echoes of Time the mother of Final Fantasy tries to fix the shot, unfortunately only partially succeeding. Of heroes and crystals The first substantial difference between Echoes of Time and its predecessor Ring of Fates is certainly the emphasis placed on the plot, which this time is only a process to be followed to unlock the various locations in the game: it all revolves around a sort of disease called ~crystal sickness~ and we, in the role of a young adventurer, will have to find out what it is and how to eradicate it to save our loved ones. The events follow one another following a rather trivial plot, however told through written and well-acted dialogues, completely in English, and excellent quality non-interactive cutscenes. Forget the remarkable characterization of the protagonists of Ring of Fates, in Echoes of Time the party is almost completely anonymous and the story does not offer particular twists and turns before the final stages of the adventure, which is rather short. It's a pity because Echoes of Time proposes the same concept of Ring of Fates, starting with a very pleasant soundtrack and passing through the well-made three-dimensional engine, lightened in part by the unpleasant frame-rate drops present in the prequel: they they still show up, but more sporadic and less annoying. The polygonal models are still well animated and full of details, they greatly reflect the fantasy of the character design typical of the Crystal Chronicles series, both in the case of the enemies and the various characters with whom you interact. In combat, the spells offer modest visual effects but the variety is more than good, some bosses are really huge, as well as the various settings that we will have to explore: from the usual forests to snow-capped mountains passing through caves and ruins, the originality is not exactly the strength of well-designed locations, whose only defect is perhaps the impossibility of rotating the camera at will, which sometimes gets stuck making it difficult to analyze the environment, a fundamental moment in solving some puzzles or, simply , in the most lively clashes. the multiplayer Echoes of Time gives its best especially if played in cooperative mode: through the local wireless connection or an Internet connection it is possible to face the main or secondary quests of the game in the company of a human party, much less irritating than the one controlled by the 'artificial intelligence. In these cases Echoes of Time certainly becomes a fun pastime, but the lack of better communication support than an awkward virtual keyboard or generic standard phrases makes the multiplayer mode of Echoes of Time not entirely different from a game in single with more cunning teammates than usual. Loot, farming, crafting... and it's not an MMORPG Unfortunately, a point against Echoes of Time is the lack of difficulty that characterizes the entire adventure, from the common enemies to the bosses at the end of the dungeon, passing through the puzzles to be solved to proceed from room to room: in reality it is almost always a matter of using certain spells or skills, move boulders or use specific keys, the imagination of the designers is certainly not lacking but sometimes these more than difficult puzzles prove to be frustrating, perhaps due to the aforementioned framing problems. As for the fights, however, the possibilities available are many: weapons and relative special attacks or the traditional spells of the series, this time usable - even in combination - only by spending the Magic Points without worrying about collecting globes of various kinds, as instead happened in the prequel. Two problems remain, however: the rare need to actually use magic, and the awkward keystrokes required to do so. Apart from this, Echoes of Time is a simple hack'n'slash to be played above all through the canonical buttons, despite the support offered by the touch screen: the little prominence given to the plot makes the balance tip entirely in favor of the gameplay which, passing over the really mediocre artificial intelligence of our party mates, controllable at any time dto ourselves through generic orders or direct action, it turns out to be quite addictive if you appreciate the beating heart of the game, which is a repeated and constant search for materials, objects and recipes necessary to build increasingly powerful and visually satisfying equipment. Complete with a pedestal on which to ~admire~ our characters, Echoes of Time leverages the player's collecting side and the disproportionate amount of objects to find and create, perhaps to reproduce the peculiar costumes of the various Final Fantasy ~jobs~, from warrior to the black magician, each with specific statistics, even alterable: the variety of settings combined with a frenetic and user-friendly battle-system manage to make what is basically a continuous repetition of levels, monsters and puzzles less heavy.", "date": "2009-04-22", "grade": "6.6"}