{"name": "E' la fine per il Principe?", "ref": "https://multiplayer.it/recensioni/prince-of-persia-epilogue-recensione.html", "text": "Innovation sometimes follows different paths and this time it is Ubisoft which inaugurates a new trend, namely that of releasing a game and, after a few months, adding an ending to be downloaded online and which strongly relaunches a future new chapter. This review, it is good to say it immediately for the more curious, cannot fail to mention the end of Prince of Persia and, therefore, whoever has not yet finished the main game, and intends to do so, is warned right from the start of the risk of spoiler that runs continuing. The ending of Prince of Persia had left many players dumbfounded who had found themselves in front of the Prince who, in order not to let the beautiful Elika die, who sacrificed herself to eliminate the unstoppable evil, brought her back to life and with her the evil Ahriman who relaunched himself at the their pursuit. In this Epilogue, the writing team tries to give a more in-depth explanation of what happened and tries to reveal to the player the reason for the seemingly incomprehensible choice of the Prince. This happens in the copious dialogues that intervene between the two protagonists during the game, which will not require more than three hours to complete, especially for those who have already finished the main adventure a few months ago. Epilogue is a kind of compendium of the main experience, with the challenging but rewarding platform phase, the Prince's powers activated and the somewhat repetitive fights that had already characterized the main adventure. A power is added to those of Elika , corresponding to a purple energized sheet, which allows the two to reach more distant parts of the level, running and jumping on walls of energy that appear out of nowhere, a moment before arriving there, forcing the player to learn their timing and location. A new element has also been introduced to the fights, and it is basically a simplified version of QTE, with buttons that must be pressed at the right moment to activate more powerful blows, in order to open the enemy's guard and which are activated when attacking by running the opponent. Care must be taken, however, because even the enemies, who are the same as in the base game, are equipped with them and in that case the QTE is used to block effectively. As for the ending, which is the main reason for the existence of this downloadable add-on, it is once again open. The game closes with a scene that leaves a great desire to know how the events will evolve in the next episode of the series, but which can only make one wonder why it hasn't already been included in the package already released in the shops, and that will be able to more or less gratify the player according to everyone's sensitivity. On the technical side, obviously, there are no news, but the great view of this engine and the artistic choices made originally are confirmed, with the settings that remain substantially unchanged and which in any case leave an excellent feeling in those who find themselves watching the screen, even if only as a spectator. Comment Can everyone who finished Prince of Persia resist downloading this Epilogue to find out what happens to Elika and the Prince? Probably not, and by paying what is necessary, they will discover, after a couple of hours of good platforming and fighting with the same enemies who already faced them a few months ago, that they can already prepare for a new chapter in the series. The mechanics of the game remain fun, the clashes are repeated as before, but this time the longevity is rather limited. The right place for this Epilogue should have been in the package released in stores at Christmas, but those who are passionate about one of the most intriguing protagonist couples of last winter will play it without asking too many questions.ProThe Prince comes back to lifeThe platform sections ConsThe longevity ribThe fights", "date": "2009-04-16", "grade": null}