{"name": "Trivial Pursuit", "ref": "https://multiplayer.it/recensioni/66793-trivial-pursuit-la-mia-memoria-e-infallibile.html", "text": "Rules first! Invented in the early 80s by three Canadian boys, Trivial Pursuit is a board game based on the knowledge of six ~subjects~ whose boxes make up a hexagonal board: history, entertainment, geography, art & literature, nature & science, hobbies & sport. Players take turns rolling a die and choosing which direction to move on the board; the square their pawn lands on counts a question in the relevant category, and answering correctly gives the right to roll the die again until the pawn ends up in the main square of each ~subject~. At that point, answering the relevant question means taking possession of one of the six triangles that determine the winner of the game. Simple but effective. Lots of news In this new video game incarnation, Trivial Pursuit gives us the opportunity to try our hand at three different modes: ~Empty the Board~, in which we can play alone and set new records by improving our general culture; ~Challenge between Friends~, a fast multiplayer for two, three or four participants; ~Classic Game~, which is a mode that incorporates the classic rules of the Hasbro board game. You can play with four controllers or use only one, passing it from hand to hand depending on the rounds. As in the original board game, the moves are established by the roll of the dice, so you have to press a button for the various sides of the dice to scroll quickly and press a second time to block the roll. The direction in which to move the pawn is decided using the analog stick, and its movement is visually represented in many different ways, all very nice: the pawn walks with insect wings, flies like a UFO or even performs hops. Variety of situations In games like Trivial Pursuit the total number of questions available is very important, this because often being faced with the same question would partially distort the dispute. Well, from this point of view the work done by Electronic Arts is really excellent, the questions within each category are very numerous and over the course of several games it has never happened to find some that have already been seen. Although the ~subjects~ object of the tests have not changed with respect to the boardgame, the database is very up to date and in the ~entertainment~ category, for example, there will be no shortage of references to the Italian television world as well as to our home stars. Furthermore, the Xbox Live service will allow us to download additional packages at any time (the ~cinema~ package is already available) to make the gaming experience even richer and more engaging. The technical aspect Translating a board game into a video game isn't always easy, you need to study a good interface and make everything as captivating as it is functional. In this case we are faced with a real feast of colours, with a three-dimensional scoreboard that is never so beautiful to look at and a series of classy touches capable of making each game unique. Our moves are also accompanied by a commentary in Italian of excellent quality, full of sarcasm and nice provocations, whose only flaw lies in the variety: the sentences are not very many, so we will end up hearing the same ones during each session. Local multiplayer only? If all aspects of this new Trivial Pursuit give the idea of a slap-up production, cured from all points of view, unfortunately it must be said that the lack of online multiplayer cuts off enthusiasm a bit. It is not known why, in fact, such an important mode was not included in the definitive package, giving us the possibility to play only with friends in our house rather than with rivals from all over the world. It is clear that in this way the longevity of the product ends up being severely limited. The purchase, therefore, must be evaluated carefully: if you usually find yourself in front of the TV with friends and relatives, then there will be no limit to the fun offered by Trivial Pursuit; otherwise, playing alone will prove to be a less than spectacular practice... Comment Rules first! Lots of news Variety of situations The technical aspect Local multiplayer only?", "date": "2009-04-19", "grade": null}