{"name": "Ready 2 Rumble: Revolution - Recensione", "ref": "https://multiplayer.it/recensioni/ready-2-rumble-revolution-recensione.html", "text": "In the world of boxing, ~heated soups~ are unlikely to be successful: if we exclude the fiction of the last film in the Rocky series, it is difficult to remember a boxer who wins again after a long break. A rule that from today can also begin to be applied to the videogame world, at least according to what is produced by this Ready 2 Rumble Revolution, which marks the return of a series that made its debut on the Dreamcast and which got lost along the way after a rather disappointing second chapter . Prepare for the worst In reality, Atari's reasoning is theoretically anything but wrong: to develop a third episode of Ready 2 Rumble exclusively on Wii, containing development costs, reaching a potentially huge number of users and exploiting a control system which of boxing had already been tested by Wii Sports. All winning ideas, but unfortunately put into practice in a truly disastrous way, as we will see. Ready 2 Rumble Revolution actually looks pretty good, with a menu that allows a remarkable selection of modes, among which the inevitable Career section stands out. The first obligatory step is that relating to the creation of a boxer, to be modeled using a rather simple editor which nevertheless opens the way to a good rate of customization, starting from the banal physical-aesthetic attributes up to more particular settings such as the tone of the voice, fighting style and so on. The presence of the editor compensates for one of the most immediately visible shortcomings of the 10tacle Studios title, i.e. the book of boxers available by default: these are parodic characters (the inspiration goes from Shaun White to get to Arnold Schwarzenegger, passing through David Beckham and many others), obviously designed with the intention of arousing hilarity, but which end up only annoying the user, they are so vulgarly stereotyped. The total lack of style demeans a graphic sector which, at a purely technical level, would not be contemptible at all: the polygonal models of the boxers are caricatured but rather well-finished, and offer good animations to the eye, moreover well linked to each other. The creation of the scenarios is not as positive, inspired by various characteristic places scattered around the world (here too the developers have certainly not wasted their imagination) and characterized by a general flatness and lack of details. Sonically too, Ready 2 Rumble Revolution does its dirty work, although it must be admitted that the screams and grunts of the boxers tend to become annoying a little too soon. Too bad that, beyond the aspects just described, the Atari production turns out to be a sensational hole in the water. The control system, this unknown It is a single element that decrees the blunt rejection of Ready 2 Rumble Revolution: we are talking about the control system, so badly implemented as to make the title literally unplayable. As often happens in the development of third-party Wii products, 10tacle Studios also got very carried away, persisting in wanting to exploit the Nunchuck and Remote motion sensor at all costs but without caring too much about calibrating everything in a decent way. The disconcerting result is that - at best - a good 50% of the movements made by the user with the controllers are not adequately detected, with obvious, disastrous consequences on the gameplay. As explained in the tutorial of the game, it is necessary to make movements upwards, outwards or deep to perform jabs, hooks and uppercuts, while to produce special moves a chain of several movements is required: Ready 2 Rumble Revolution struggles already to understand the basic blows, but being able (deliberately) to launch an enhanced attack is a practically impossible undertaking. The same goes for the mechanics that regulate defense: holding down the Z key, it would be enough to bring the two controllers in front of the face to block, and swing from one side or the other to dodge, but the conditional is a must since rarely the User movements are correctly transformed into related inputs to the on-screen character. Translated into strictly playful terms, all this means that the matches in Ready 2 Rumble Revolution are forcibly resolved in a frantic waving of the arms in all directions, in the hope of causing the greatest possible damage to the opponent: a truly demeaning activity, which moreover leads to poor results, given that the AI-guided boxers do not skimp on special blows and deadly counterattacks. The bad control system also suffocates the interesting ambitions of the mini-games in the bud, useful for increasing the gameand your boxer's statistics: apart from some rather simple exercises, most of the internships require the user to perform movements that are punctually not received by the sensor bar, leading to constant failures. Ultimately, Ready 2 Rumble Revolution can actually only be played in multiplayer between human opponents, in clashes based solely on the luck of one or the other boxer to land a few shots. But surely there are many better ways to challenge a friend on Wii... Comment Ready 2 Rumble Revolution is unfortunately a failure, caused by a very bad control system capable of setting new negative standards in terms of inability to detect player movements. It would have been sufficient to offer a classic mode as an alternative to be played using simple keys, but the cloying stubbornness of the developers aimed at wanting to exploit the motion sensor at all costs has claimed yet another victim. The Atari product could have been a decent beat'em up, but on balance it's just a very badly successful experiment. Pros Graphically more than decent Against Terrible control system Unplayable in single player Stylistically very questionable", "date": "2009-04-06", "grade": null}