{"name": "Aguzzate la vista!", "ref": "https://multiplayer.it/recensioni/trova-le-differenze-recensione.html", "text": "There are some things that need few words to explain, and that's the case with ~Find the Difference~ for Nintendo DS. This is the transposition on a laptop of one of the last games capable of leaving a shred of charm to the arcades. Not so much because they are permeated with that spark that made the cabinets the glory, but because at least they are accessible and fleeting alternatives to the more complex video games we have come to know in all these years. Between a round of Slot Machines, a game of Virtua Striker or an aperitif, a few games of ~Find It~, on its typical Touch Screen, we all did it. Well, at a cost of 25/30, it's as if you were taking home that discreet black column usually leaning against a wall or some column. This is not the official ~Find It~, if it really makes sense to express yourself in this way. When the mechanics of a game are limited to showing two photos and letting the player find the 5 differences in a limited amount of time, it is obvious that the power of a Brand has very little strength. The DS was practically born to host such an application. A photo is shown on the upper screen, the same photo on the lower screen with some small graphic adjustments, and we are given the opportunity to indicate the five proposed differences with the pressure of the stylus. The rest of the interface is limited to marking time, and counting the number of errors found, and help left. Thats all folks. Such and Which ~Find the Difference~ is based on a progression mechanism. After creating your profile among the three available slots, the tests will follow one another in blocks of six images, at the end of which you will have to recompose a photo with the sliding tile technique, or find a difference in sequence in each of the photos you have already seen . Each block of images is classified with an increasing level of difficulty, where the lowest is that of ~Rookie~. The player who progresses through the game will find increasingly difficult challenges to overcome. In the cartridge there are a total of 240 photos divided into 6 categories such as animals, landscapes, etc. For each of these photos, however, there are 4 different series of errors, one for each level of difficulty. In fact, it is not uncommon for the first quizzes to find truly eye-catching retouches, even made with the aim of being tracked down, but obviously there are also those that are impossible to notice, at the pixel limit. It will be possible to replay the unlocked photos in a special mode where they can be chosen by category or randomly. In addition to this it will be possible to try the Extreme Frantic where it will be necessary to find as many differences as possible, one for each photo, over a pre-established time. In puzzle mode, it will be possible to play to recompose the tiles of the unlocked photos. The developers have tried with little effort to make a game that would otherwise have developed in sequence a little more variety. You find it more suitable in this regard, however, is given by the possibility of playing multiplayer up to four with a single cartridge. The designers have prepared three game modes, one cooperative and the remaining two competitive. In the first, players will help each other find the differences, a bit like when, waiting for a game of bowling, everyone gathers around the ~Find It~ station. The others instead foresee the antagonism in the match. In the first mode, those who fare worse will be able to cast a spell on others hoping to receive some benefit. In the other one, however, each player will have the task of finding a difference between those proposed, whoever remains empty-handed is eliminated from the game.", "date": "2009-04-05", "grade": "6.8"}