{"name": "Antiterrorismo portatile", "ref": "https://multiplayer.it/recensioni/heroes-of-war-nanowarrior_a.html", "text": "In the not too distant future, terrorist organizations will become stronger and harder to hit, hiding their outposts in inaccessible territories. In response to all this, the governments of the world will invest their resources in a new war technology, capable of making a difference in the fight against terror. We're talking about combat armor, which feels like a second skin for the wearer and has a defensive system never seen before, based on force fields and the presence of repairing nanomachines. A single soldier equipped with this equipment can face an army, and this is precisely what the protagonist of Heroes of War: Nanowarrior is preparing to do. Trained hard for battle, our character will have to enter locations full of enemies and clean up as quickly as possible, using a large number of different weapons. His contact with the headquarters, represented by his sarcastic ex-wife, will have the task of coordinating his moves and showing him the way forward as well as the objectives he will have to achieve from time to time. Those who have already had the opportunity to try the first episode of the Heroes of War series will not find the action proposed by Nanowarrior very innovative, on the contrary it is basically a matter of doing the same things: we are faced with a completely 3D shooter but in which the the movement of the character is predetermined, that is, it runs along ~rails~, and the player is given freedom to move only in the context of the inevitable firefights. The territories we're going to visit are very different from each other and have indoor sections and others outdoors, while what doesn't change is the presence of many terrorists ready to shoot at us. As soon as a threat arises, the combat armor notifies us of the position of the enemies to allow us to aim and open fire with the equipped weapon. The interface shows us the level of shields and energy, closely related as using the second it is possible to restore the former while enjoying a momentary impenetrable shield. This is an inevitable operation, given the general difficulty of the clashes: our opponents tend to resist multiple bursts and then hide, forcing us to follow their moves and suffer some damage. However, we will be able to use many extra tricks to vary the action, for example using a device that makes us invisible or an infrared viewer to also identify hidden dangers. The control system, despite the many possibilities, appears simple and quite intuitive, even if during the fights it can only prove cumbersome and not very precise. As mentioned several times, the game makes use of fully polygonal graphics, which in a context of free movement could have really impressed. Unfortunately, the movements are predetermined, so much of the spectacularity of the environments ends up being lost. There are some good lighting effects, the locations are quite varied and the use of colors looks good. Of course textures aren't defined, but that's a common limitation of even the best 3D titles for Java-compatible devices. The opponents we will face are unfortunately anonymous and not very detailed, even if they boast a decent set of movements.", "date": "2009-04-03", "grade": "S.V."}