{"name": "Pro Evolution Soccer 2009 - Recensione", "ref": "https://multiplayer.it/recensioni/pro-evolution-soccer-2009-recensione_a.html", "text": "When the Nintendo Wii phenomenon was yet to explode in full force, and while most software houses were wondering how to exploit the capabilities of the wiimote and nunchuck, Konami surprised everyone by presenting a version of its Pro Evolution Soccer around hardware made in Kyoto. Pes 2008 on Wii was a version that borrowed only the technical component from the other editions (largely ~borrowed~ from Ps2) totally revolutionizing the control system and making it deeper, broader and necessarily more complex than the traditional gameplay via pad. In reality, the end result was simply a completely different thing from any football title released previously, paradoxically bringing it closer to a real-time strategy game complete with an on-screen pointer. A very encouraging critical success, also supported by the enthusiasm of those who were willing to forget 10 years of classic gameplay to start from scratch with something completely new. Unity is strength The basic concept of Pes on Wii is more than correct: football is a team game, in which the work of all the players is of fundamental importance, regardless of who is in possession of the ball. So position, movements, markings, schemes and so on; all things that until last year were largely delegated to artificial intelligence, limiting human control precisely only to that single athlete at that moment with the ball at his feet. The lucid madness of the Japanese game designers was therefore precisely in wanting to provide the user with almost total control of the team, allowing simultaneous ~multitasking~ management of all the players on the screen. Obviously this was not possible with a traditional mechanic and pad, and precisely in this sense the Wiimote and the pointer governed by it proved to be fundamental, with which precisely to interact continuously with men and really decide how the whole team should play. The price to pay? Several hours of practice, no doubt; because if it is true that with the Wii versions of the Konami series it is possible to raise the involvement, satisfaction and interaction in playing football on consoles to another level, in the same way it cannot be denied that doing so is really complicated and that requires a degree of attention and dedication that must be taken into account before accepting the ~challenge~. With the 2009 edition, Konami has operated on a double path; on the one hand it has done what is almost always expected from sports series, i.e. slight improvements year after year which are limited to perfecting and certainly not upsetting the general layout. On the other hand, however, it has included a couple of additions with a high specific weight in the product and which we will analyze in the next few lines. As for the gameplay improvements, in order not to repeat ourselves unnecessarily, we refer you to our test from a few days ago for in-depth details. In short, in the attack phase the management of one-two and quick exchanges between one's players has been greatly improved, while an alternative shot possibility to the nunchuck shock has found space, this time pointing in the chosen direction and pressing B. Where was it necessary to work more, or in the defensive phase, the programmers have remedied the incomplete 2008 version by refining everything and allowing you to double down on the attacker or anticipate the pass. The final result is certainly better and less frustrating, even if the clear perception remains that in the offensive phase the game is decidedly more fluid and convincing. The picture concludes with a more in-depth management of free-kicks, both in the case in which one is called to beat them and to defend one's goal. An eye to the past Among the surprises of Pes 2009 on Wii is undoubtedly the inclusion of the option for the classic controller, which in fact cancels everything when just described, offering the possibility of approaching the game in a traditional way, exactly as if we were in front of a Ps2 and not the Nintendo console. The result is obviously infinitely less intriguing but also sensationally fun, since it actually offers what for many is the best ~traditional~ Pes available, given the uninspiring leap into the next-gen made by the series. Bartering the pleasure of discovery and the depth of the mechanics studied for the Wiimote in exchange for the reassuring and very solid certainty of that Pes which has become a sort of religion especially in our country, however, risks becoming too strong a temptation for the average player; in this sense it is difficult for us to judge the choice of Konami, which while on the one hand could certainly expand the accessibility, the catchment area and therefore the sales of its product, on the other hand it risks demonstrating by the manufacturer itself an incomplete trust in the innovative gameplay conceived by the programmers. On the other hand, the improvements in multiplayer are very interesting, with the inclusion of co-op and options that now allow 4 players to challenge each other on the same console or 8 (4 vs 4) online on two Wiis. Certainly with so many pointers on the screen the matter starts to get particularly chaotic, and it is therefore strongly advisable to play Pes 2009 on a generously sized screen. Within the available modalities, practically all the gaps that separated last year's chapter from the other versions have been filled; in fact, now the Champions League license has been included, as well as the Master League and the Editor. But probably the one destined to focus the attention of most players is the Champions Road, exclusive to the Wii edition since its debut and on this occasion further improved and in-depth. In short, it is a matter of earning money by achieving specific objectives, to then improve one's team not only from the point of view of the players but also of the equipment and properties available to the club. Little to say instead as regards the technical component, which is limited to taking up that of the Ps2 version; far from spectacular or impressive, but still functional for the purpose. Comment Pes 2009 on Wii represents a big step forward compared to the previous edition, thanks above all to the quantity and quality of the ~side dish~ which made it possible to offer the user of the Nintendo console practically all the methods and options of which last year had been missed. Furthermore, the inclusion of a classic control mode, while bringing with it some doubts about Konami's trust in gameplay via wiimote, has undoubtedly made this edition more accessible, thus expanding its catchment area. But our advice is certainly to focus on the Wii-exclusive mechanics, capable of offering a depth and immersion superior to any other traditional football game. Provided you have large doses of calm, patience, curiosity and dedication to offer in return. Pros A good step forward from 2008 Finally complete in options and modes Control via Wiimote very satisfying Against Technically far too antiquated Some doubts about the inclusion of the classic control Playing with the Wiimote takes a lot, a lot of patience", "date": "2009-03-30", "grade": null}