{"name": "Puzzle Quest: Galactrix - Recensione", "ref": "https://multiplayer.it/recensioni/puzzle-quest-galactrix-recensione.html", "text": "Puzzle Quest: Galactrix is the spiritual sequel to that Puzzle Quest: Challenge of the Warlords which, although it came out quietly, managed to sell millions of copies and truly convinced everyone, becoming a drug for many players. Let's say right away that the basic formula is more or less the same as the original, which in turn was borrowed from the various Bejeweled, despite the science fiction setting. It is therefore necessary to align three or more hexagonal boxes of the same shape or color to make them explode, so as to pass various tests, which range from galactic battles, in which the enemy's energy must be exhausted to shots of lasers and bombs before he has ours depleted, in mining, in which the aligned boxes yield raw materials that can be resold in space stations or exploitable in some missions. In reality, compared to the past, there has been a significant change, i.e. the tiles no longer move on the X and Y axes but on the diagonals and the new gems no longer fall only from above, but follow the movement with which they moved the tile. It seems complicated, but in reality after a couple of test games you can play without problems and manage the situation in an optimal way, also evaluating the strategic differences that such a setting entails (there are many). There are two main game modes: the single player campaign and the multiplayer, the latter consisting of dry challenges between players. If desired, it is also possible to play quick games against the CPU, just to pass the time or to train, but there is no doubt that the main mode is the campaign. In fact, the multiplayer could have been much more refined as it gives the idea of having been put together just to add it to the list and give it an extra feature. A gem is forever In the campaign mode we will take on the role of a character chosen from a shortlist of three and we will have to face a dark galactic threat, hidden among the many systems that make up the universe. In fact, on board a spaceship we will have to travel from one end of the cosmos to the other to carry out missions or to hunt for resources, so as to be able to buy better armaments for the flying coffee pot with which we are facing evil. The armaments are very important and, as happened with the powers of the first Puzzle Quest, they can determine the fate of a fight: ranging from the classic laser cannons, available in more or less powerful versions, passing through devices that make the opponent skip turns or others that cleanse the ship of the negative effects suffered. To use each device requires a certain number of resources, represented by yellow, red and green gems. Speaking of gems let's describe the most common of the remaining ones: blue gems allow you to repair the ship's armor, distinct from energy, the latter not recoverable during a fight, white gems give experience points, while purple ones increase the Psi powers. This quick description applies to fights, because the function of the gems varies according to the mini-game being played and the tiles themselves can take on different shapes. For example, during the hacking phases of the portals, which are used to move from one system to another, it will simply be necessary to explode the gems according to a pre-established sequence, while, digging minerals, the resources that are being collected will be depicted on the tiles. In short, although Galactrix is a puzzle game, it does not lack complexity. Big universe, big spaceship One of the great strengths of the first Puzzle Quest was certainly having perfectly mixed a puzzle game with a role-playing game, obtaining an unexpected and, in many ways, surprising result. Galactrix also follows its predecessor on this path, re-proposing the character growth system based on four distinct values and adding ship management, with the possibility of purchasing more and more powerful ones. The party is also back, replaced by a more relevant ~crew~, which serves to have ancillary functions and to be able to face all situations. What is different is the method of exploration of the different locations: in addition to a general map, on which the network of connections between all the systems that can be visited is schematized, each one has its own structure and can be composed of planets, asteroids (from which to extract minerals), space stations and portals. The universe, despite what it may seem looking at the night sky, is not uninhabited and, indeed, sees different factions fighting each other. Depending on the relationships you have with the factions, it is possible to suffer attacks, which translate into random encounters that are difficult to avoid. From a technical point of view, Galactrix is functional to its nature, that is, despite having a very generic style, it does its dirty work as a puzzle game seasoning everything with some special effects and with some catchy tunes that will certainly not leave memory. The star map is, however, well done, while the different systems are repetitive and too generic. Granted, in general it's hard to penalize such a product for its technical shortcomings, but it's undeniable that Challenge of the Warlords itself was in more than a better sense. Comment Puzzle Quest: Galactrix is a worthy successor who pays a little for the desire to overdo the developers, in trouble due to the lack of new features to insert. Don't get us wrong, it's a good thing that it lasts much longer than Challenge of the Warlords, but the clashes are often too long for a puzzle game and, just as often, they are too linked to the luck factor, with random burst combos that manage to overturn apparently results already written. For the rest we are faced with a very playable and enjoyable title capable of capturing for hours.Pro It can become a drug like the original Very long-lived Despite being a puzzle game, it is quite complex Against Some fights really last too long Not very original The multiplayer side is to be developed PC - System Requirements Minimum Requirements Processor: Intel Pentium 4 @ 2.0 GHz or AMD 64 3000+ RAM: 512 MB for XP, 1 GB for Vista Video Card: NVIDIA GeForce 4, ATI Radeon 8000 with 128 MB Operating System: Windows XP, Vista DirectX: 9.0c or higher Hard Disk: 300 MB Sound Card: DirectX 9.0c compatible Connection: 56k modem Test Configuration Processor: Intel Core 2 Quad Q6600 RAM: 4 GB Video Card: GeForce 8800 GT Operating System: Windows Vista", "date": "2009-03-25", "grade": null}