{"name": "Giochiamo alla Texana!", "ref": "https://multiplayer.it/recensioni/texas-holdem-poker.html", "text": "Card games and mobile gaming go hand in hand, so much so that each publisher offers them in numerous versions and for all tastes. We have solitaire, blackjack and obviously poker, which in the last two years Gameloft has offered in as many variants: World Poker Tour: first Texas Hold'em 2 and then Million Dollar Poker. These are titles that have practically nothing in common: the first boasted a dynamic, engaging action, with a great level of challenge and only a few flaws in the interface; the second was afflicted by an exasperating slowness, divided equally between frequent loading and the impossibility of skipping game sequences. Texas Hold'em Poker, which has just been released, immediately presents itself as the ideal sequel to Million Dollar Poker, taking up its interface and mechanics but remedying the problems just mentioned. In fact, the game stands out for the speed of loading, as well as for the possibility of speeding up the action when it is the turn of our opponents at the table. Two not insignificant factors, which make the execution of the games faster and consequently add depth and involvement to the experience. As mentioned above, the Texas Hold'em Poker interface is the same used by Million Dollar Poker, so we will see the entire game table and all the players on a static screen, with the cards being revealed in the center, in a clearly enlarged version. In the lower part of the screen there are our cards (which we can ~peek~ at any time by pressing the 5 key) as well as the box with the possible actions, to be controlled exclusively using the d-pad: the check is performed by pressing the d-pad on the left, the raise by pressing it on the right, while the up and down directions are respectively to go all-in and fold the hand. Also using the d-pad it is possible to skip the turn of our opponents, accelerating the action to the maximum if we don't want to wait. From the main menu we can choose to try our hand at a quick game, start a career or participate in the ~heads up~ mode, which is a series of games against increasingly cunning individual opponents. The artificial intelligence always appears to be up to the situation and the game certainly never proves too generous, therefore the most effective strategies for winning remain the ~conservative~ ones, i.e. one must proceed with caution and avoid taking risks if one does not has nothing in hand. The action is accompanied by MIDI music that leaves the time they find, while the graphics reproduce almost all of the sprites already seen in Million Dollar Poker. The decision to enclose the table and players in a single screen unfortunately goes to the detriment of the details, given the size of the players. Fortunately, the cards are always very legible, and the possibility of speeding up or skipping the opponent's turn allows us to enjoy the game even when we have little time available or are disinclined to wait. The organization of the controls is good, with a minimum of confusion only when it comes to changing the amount of the raise. In any case, the idea of assigning possible actions to the four directions of the d-pad is certainly a winner.", "date": "2009-03-25", "grade": "S.V."}