{"name": "Grand Theft Auto: Chinatown Wars - Recensione", "ref": "https://multiplayer.it/recensioni/grand-theft-auto-chinatown-wars-recensione.html", "text": "Recalling the anything but memorable Nintendo conference of the last E3 2008 in Los Angeles, on balance there were very few titles presented on that occasion capable of proving to be completely convincing in terms of quality. Between a descent on a snowboard with Shaun White, a very static walk in Animal Crossing and a little exciting concert with Wii Music, the announcement of GTA Chinatown Wars for DS, the exclusive chapter for the Nintendo portable of the very successful series, had taken a back seat Rockstar Games. An obvious mistake, since Chinatown Wars can be defined without danger of contradiction as one of the best games that appeared in the glorious career of the two-screen handheld. All the GTA that matters For longtime players able to recall the beginnings of the series, with the first two chapters profoundly different in structure compared to the milestone set by the third episode, Chinatown Wars could initially be approached precisely to such precursors due to the top view in flight adopted by the programmers of Rockstar Leeds. In reality, the three-dimensional evolutions of the immature initial concept have not been set aside at all, but on the contrary largely implemented if not even refined and expanded in some ways. Playing Chinatown Wars, especially for those who have experience with the series, can only prove to be a continuous surprise in the face of the progressive crumbling of the mistaken belief that on a laptop like the DS, inevitably, numerous compromises would have had to be made. The story this time puts the player in the role of Huang Lee, son of a recently assassinated Triad boss, traveling from Hong Kong to Libery City; the problems begin immediately after stepping foot off the plane, and then continue in a crescendo of gang fights and power clashes on the streets of the metropolis. Which, as the most attentive will have noticed, is the same as in GTA IV crossed with Niko Bellic; in reality an island is missing, but in any case it remains a commendable result capable of offering a vast and varied environment teeming with life, cars, shops, activities and so on. The structure is obviously the classic one, divided into missions to be obtained through a series of key characters; in most cases it will then be necessary to use means of transport to reach various points on the map, obtain objects, commit murders and things like that in pure GTA style, always taking care not to be discovered by the police who are always lurking. And just speaking of the forces of order, one of the many pleasant innovations of Chinatown Wars takes over; also in this case the stars are present, indicating the degree of suspicion and therefore how many units are actually used in pursuit of Huang. But on this occasion, more depth has been inserted into the escape mode which makes it much more fun. In fact, if it is always possible to try to escape by leaving behind the pursuers or using one of the Pay'n Sprays, in the same way it is possible to engage the steering wheels by making them crash into a building or an obstacle. By eliminating in this way a number of police cars equal to the suspect stars active at that moment, one can be lost until ~freedom~ is regained. An intelligent and fun novelty, which we really hope will also be introduced in future home console iterations of the series, as well as the blessed ability to restart a mission - in case of failure - from the focal point of the same, eliminating the boring repetition of the road. In principle, the missions are shorter than in GTA IV and with a level of difficulty that is almost always affordable. And the much-discussed drug dealing? No censorship, even that arrived intact until the final version. In a nutshell, it is a mini-game to be played in a parallel way to the main story, and which allows you to interact with about eighty drug dealers and customers scattered around the city. The basic concept is practically the first rule of trade, i.e. buy low (or steal) to sell high, thus making a profit. The power of touch But one of the trivia elements in this Chinatown Wars obviously revolved around how the programmers would decide to take advantage of the DS touch screen. The reality of the facts is that Rockstar Leeds has been able to devise such a variety of implementations of this feature to such a convincing level that it certainly stands out among third-party productions, with a knowledge of the hardware similar to that of Nintendo itself. The action takes place entirely on the upper screen, while the lower one houses a kind of PDA with which to organizevirtually all management aspects; we are therefore talking about reading emails, programming the gps, browsing websites, displaying the radar and so on. But the beauty comes when the second screen is used actively within the gameplay, providing a further and unique playful interpretation of the series. In addition to being able to select the weapons in one's possession, it is thanks to it that Molotov cocktails, grenades and the like are launched, managing the direction and range of the shot. In the same way, the touch screen is used to start parked cars that we want to steal, perhaps by unscrewing the bolts of a flap and joining the wires as in the best American films, or using a device to bypass the burglar alarm. But also to defuse bombs, draw tattoos for members of your gang, fill Molotov cocktails from petrol stations, look for weapons in garbage bins and so on. A premium strain that really adds to the overall experience, never feeling out of place or forced. The only defect that can be found in this sense is the fact that, obviously, GTA is a game with which you interact with both hands; consequently when it is necessary to use the touch screen, ie continuously, it is inconvenient to extract or pick up the stylus, even more if the actions to be performed require speed or are within a dynamic context such as a shooting. The alternative is to use your fingers directly, but in this case the accuracy becomes very limited and can cause some moments of frustration. So let's take the opportunity to immediately clarify the second and last ~defect~, if we want to call it that, of Chinatown Wars, or the fact that compared to the chapters for living room consoles, the pure pleasure of driving is largely lacking. Not being immersed in a three-dimensional world, and with a physics of vehicles which, while varied and satisfying, is necessarily simplified compared to that of the third and fourth chapter, using one of the many vehicles available (on 2 and 4 wheels of course) returns to be purely a tool to reach point B from A, and no longer a moment of pleasure in which to get lost wandering through the neighborhoods of Liberty City. It is clearly a technical limit, and it is not actually fair and correct to point it out as a defect (hence the quotation mark above), when rather as a modification of the mechanics and of the approach to GTA that decisively mixes the cards on the table. When I grow up I will be a firefighter What does not change, however, is the variety of possible activities, which go beyond the progress of the main story and allow the already more than good longevity of the game to be enormously strengthened. In addition to the commitments as a drug dealer, you can dabble as usual with the missions of a policeman, taxi driver, fireman and nurse by stealing their respective means to raise some money to spend perhaps on buying new apartments and shelters around the city. You can also steal trucks and cars carrying drugs and weapons, so you can get hold of them without spending a dollar and still increase your finances, or engage in destroying service cameras, and so on. Turning instead to the technical component, frankly the work of Rockstar Leeds can be defined to an extent nothing less than astonishing; in addition to the enormous size of the city, it is the attention to detail that leaves you speechless, obtained through a graphic style in cel shading perfectly suited to the purpose that only very rarely lends itself to some slight loss of frame rate. Considering the memory limits of the DS carts, the presence of 5 thematic radio stations for different musical genres is also surprising, even if we would not have minded a few more tracks. There is also a robust local multiplayer mode, while the online connection allows you to exchange GPS points of interest, weapons and send messages with other users.", "date": "2009-03-23", "grade": "9.3"}