{"name": "Revival Deluxe", "ref": "https://multiplayer.it/recensioni/revival-deluxe_a.html", "text": "The genre of strategy ~ la Civilization~ boasts a certain following even on mobile phones, in spite of what one might think. Evidently the charm of these games goes beyond the mouse control system and has its roots in a well-established gameplay, capable of involving historical enthusiasts but also of creating new ones. In the case of Revival Deluxe, we are faced with a real clone of the masterpiece created by Sid Meier, both in terms of the type of interface and the game action, which is marked by the passing of the years and brings the civilization of which we follow the evolution to gradually discover new technologies. It is not the first time that HeroCraft engages with the genre, in fact the first Revival dates back to 2006 and differs from this ~Deluxe~ version almost exclusively for the technical solutions adopted, more in line with the times but still terribly backward compared to what recently seen on Java-compatible devices. Using the d-pad and some numeric keys, we will find ourselves controlling our character (belonging to the race of conquerors) as he explores the territories in search of cities to develop. Once we have crossed the walls of a village, we will be able to coordinate its functions and create a series of workers to promote its growth, both through the collection of materials (food, wood or minerals) and through research. In a short time we will be able to build forges, farms and markets where there was none, promoting trade while an automatic save system stores our progress every ten years. Just like in Civilization, very little space is given to the war component: going to war with another tribe is quite rare, and any clashes are managed in a very simplistic way, also due to a far from advanced AI. The bulk of the action therefore remains confined to the limits of research, the construction of new buildings and possibly exploration, with the latter being rendered visually in the most classic way (the still unexplored areas are covered by a dark cloud). As mentioned above, unfortunately Revival Deluxe leaves much to be desired as regards the technical implementation, really backward compared to what we have been able to see on mobile for several months now. The graphics adopt a top view and are completely devoid of animations, while the sprites do not stand out for their design nor can they count on a scenario that lives up to expectations. The elements are repeated too often and do not boast who knows what detail. Even the interface is not crazy, due to characters that are too small and difficult to read, while the sound is made up of the usual MIDI music that doesn't get noticed that much. The controls respond promptly to inputs, even if their arrangement appears unintuitive and during the early stages it can put us in difficulty. Luckily, a screen with the command list can be called up at any time... PRO It is a clone of Civilization Well represented ~evolutionary~ phase AGAINST Technically inadequate Terribly slow action Localization in Italian far from perfect", "date": "2009-03-20", "grade": "S.V."}