{"name": "Sonic e il Cavaliere Nero - Recensione", "ref": "https://multiplayer.it/recensioni/sonic-e-il-cavaliere-nero-recensione.html", "text": "When a new game starring Sonic appears on the gaming scene, we always hold our breath. The reaction by now generally ranges from an ~oh no!~ casual to the ~let's hope for the best!~ one of the most solid supporters of what we still love to call ~mama Sega~. Unfortunately, it is undeniable that the blue hedgehog, mascot of the legendary Japanese software house, has somewhat lost its identity in recent years, changing genre and format so often that sometimes we forget its platform origins, when it was the rival of Super Mario, so as to put Nintendo itself in difficulty. But Sonic doesn't give up, and still tries to find a place in the new, chaotic primordial soup that is the 2009 videogame market: after the modest Sonic and the Secret Rings, Sega tries again on Wii by telling a new bedtime story. . Appearances that deceive At first glance everything seems really beautiful: well-kept computer-graphics films introduce us to this new adventure for Sonic, transported by magic by the sorceress Merlina to the kingdom of Camelot, in a parallel dimension where the enemies have well-known features and King Arthur is evil and cruel. Sonic will have to take up the legendary sword of the Breton myth - or almost - to end the crisis and return to his world. So far, nothing strange: a fabulous and eccentric story, narrated through CG sequences and static dialogues, mostly dubbed in English (and subtitled in Italian) with a certain care that makes even some slightly poor lines of the script bearable. The attention to detail paid by the Sonic Team is remarkable and even navigating through the menus that look like an ancient parchment is pleasant and intriguing. Technically the game is certainly of a good level, apart from a rather mangy camera, the visual aspect is more than satisfactory: the stages guarantee a good variety and are full of details and graphic effects which enrich the vision. Even the soundtrack does not disappoint: rhythm and frenzy are its main characteristics, as usual for the series which has always offered excellent sound tracks. In short, having made these premises, Sonic and the Black Knight would finally seem like the hit of the blue hedgehog that we have been waiting for for years. And instead, optimism collapses inexorably as soon as you hold the Wiimote and come to terms with the gameplay... The good game does not last long With the previous video game incarnation of the blue hedgehog, Sonic Unleashed, we had the impression that the Sonic Team was getting back on the right track, offering at least a handful of stages faithful to the original spirit of the series, fun and frenetic. In fact, with Sonic and the Black Knight we really go back on track, but these inexorably lead to a real abyss. It's true, the game offers a large dose of extras to lengthen the broth, including an online ladderboard, a system for collecting and exchanging objects between Friend Codes, a sort of multiplayer battle-royale and it is worth mentioning the fact that you only play as Sonic. But it is also true that to do all this you have to come to terms with a truly disappointing gameplay. Sonic runs in the various stages of the game: we would say that he runs at breakneck speed from start to finish slowing down occasionally, instead Sonic runs for a few seconds and then stops to fight a handful of enemies, arranged in copious quantities along his path to stop him, one sort of checkpoint where the game ~changes~ and the platform phase is interrupted to give rise to the fights. Which would also be funny if the whole system weren't reduced to a vague and random shaking of the Wiimote: the system doesn't even recognize the precise movement of the controller which, however it is moved, always reproduces the same attack. It is possible to perform evasive maneuvers or carry out a special attack, but each encounter, including the end-of-stage bosses, is reduced to the frantic and totally illogical shaking of the Wiimote, which allows you to get rid of enemies, including the aforementioned bosses, without a minimum of reflection. The frequent interruptions of the rhythm to give rise to useless clashes in which the arm is waved at random, input moreover interpreted with a certain slowness, make the experience frustrating, extremely simplistic and physically tiring. And really unfortunately there is little else to add. Comment With Sonic and the Black Knight technically the Sonic Team has developed a good product, but once you start shaking the Wiimote over and over you realize its poverty of ideas and depth. Within a few minutes an inexorable boredom takes over and the desire to progress in the adventure, if only to find out its ending, undergoes a cograce even from the physical stress it entails. It's a shame to see how every 3D Sonic adventure always ends up generating an internal conflict; Sonic Team certainly wants to try to renew the franchise but, perhaps, the only true Sonic is still the linear and two-dimensional one of the nineties. Porcupine fans will appreciate this umpteenth incarnation of him a little, everyone else would do better to look elsewhere. Pros Sonic & co. I'm always a pro Technically cared for and of a good standard Against Bad gameplay Physically frustrating", "date": "2009-03-23", "grade": null}