{"name": "Il miglior attacco  la difesa", "ref": "https://multiplayer.it/recensioni/fieldrunners.html", "text": "The developers of Subatomics Studios have really hit the mark. The Apple portable console lends itself perfectly to the conditions required by the very popular real-time strategy games, especially on PCs; whether for the touch of the iPhone really fine workmanship, or for the simplicity of the game, Fieldrunners is a software to try with your eyes closed and let yourself be captivated by its main feature: to excite the gamer. No plot that slows down the pace of the game, in fact in Fieldrunners the player is called upon to defend his base from hordes of enemies with various characteristics, from the classic infantryman through motorcyclists and flying vehicles to then end up among airships and tracked vehicles having shapes similar to exoskeletons. The true protagonist of the game is the arsenal available to the user. At the beginning of the adventure only four weapons can be used but by unlocking the difficulty levels the number of defensive possibilities rises to six. In addition to the classic turrets with attached machine guns, special positions are available with green liquid projectiles that slow down the movements of the opposing soldiers. Rocket launchers and electric towers alternate with truly devastating flamethrowers and mortars; moreover, each weapon boasts the possibility of being upgraded twice, increasing its damage percentage. In short, the kit of the perfect soldier defending his area is ready and at hand with a simple touch. Inside, Fieldrunners hides little economic profiles to follow. Each defensive block added has a cost, obviously deducted from the player's account and the same goes for the aforementioned upgrades. In contrast, earning is relatively simple, just take down the enemies who have different sizes on their heads. What is the best game strategy? Fieldrunners maps aren't huge, in fact they're damn small. However, the player can resort to the exploitation of his arsenal as a kind of path where to put the enemies. In fact, the AI is certainly not the best: the soldiers walk straight, as happened in Lemmings, without bothering to look for particular paths. Exploiting this weakness therefore becomes the key to the game since building winding paths forces the attackers to take longer routes, thus increasing the percentage of hits suffered. Technically Fieldrunners is certainly not a software that squeezes the potential of the iPhone to 100%. The attention given to the details used for the weapons supplied and the good variety of enemies collides with the lack of attention to the environmental characteristics and a meager creation of the maps. On the other hand, I applaud the inclusion of the constant automatic save, given that Fieldrunners is a simple game but with very long game sessions, just think that to unlock a map you need to overcome 50 militia attacks, obviously divided into teams, and the conquest of difficulty levels reaches the total completion of the map, i.e. 100 rounds won. Fortunately, defeat comes only if 20 soldiers manage to survive, so we are not faced with a ~try and die~ software.", "date": "2009-03-23", "grade": "8.0"}