{"name": "Wildermyth", "ref": "https://multiplayer.it/recensioni/wildermyth-recensione.html", "text": "In Wildermyth's review we will discover that Worldwalker Games' first work is first and foremost a story. Our history. A story that, as almost always happens, starts quietly, unexpectedly, and then becomes bigger and bigger, epic, even legendary over time. A story that, generation after generation, will transform the protagonists into heroes and over time even into myths. Those who a moment before were young people committed to defending their village after a few hours have turned into seasoned veterans, ready to pass on their knowledge to the new generations. In this way story after story, mission after mission, our group of adventurers will not only make a name for themselves in their world, but also in our personal sphere. It will get under our skin. We will get to know each of them not only by name and appearance, but also by inclinations and tendencies, grieving every loss and rejoicing every time you cross their path again, a bit like you would meet an old school friend. A story, with a video game around it Some of the protagonists you might meet in Wildermyth Because, we said, Wildermyth is almost more of a story than a video game. It is true that there are many fights, strictly turn-based, it is true that the characters can level up, learn new skills and change equipment, but the core of everything is the story, the journey that will cross several generations of heroes. Wildermyth, in fact, is developed and told as if it were a book. Within each chapter, which is in turn divided into mini-campaigns, we will have to form a company of heroes who will have to save their land from the misfortune of the moment, gradually discovering their motivations to arrive at the expected final confrontation. The game world acts as a common thread between all these stories, but above all the people who populate it. This is because heroes from the first story can also appear in later ones. Either by choice, since they can be called into action instead of a character created from scratch, but they can also appear completely spontaneously within one of the many curtains that punctuate every move and every important meeting. The true masterpiece of Worldwalker Games is being able to create a procedural system capable of giving (almost always) great consistency to the game world, with events, relationships and relationships between the characters consistent with their nature and their past . A hero who has just lost a friend will want to specialize in protecting his companions, a hero who is in a relationship with another may decide to sacrifice himself in his place. Two lovers might bicker over dinner, while two rivals try to outdo each other in battle. Death in Wildermyth is all but final. Once in the campaign, in fact, we will have the opportunity to save a character who has been shot to death. Depending on its nature or luck, the killing blow could turn into a permanent wound or even a cripple. Alternatively we could decide to sacrifice him in exchange for one last heroic gesture, but even in this case this is not necessarily the end of him. After the battle, in fact, we will be able to decide to reward his sacrifice and dedicate an altar to him that will tell his legend to future generations. In this way the character will become part of the Wildermyth pantheon and can be recalled in subsequent adventures. Through this system both the characters who will participate in the final mission and the dead will be transformed from local heroes to legends, then into myths and finally into quasi-gods. Gameplay Wildermyth fights take place on a square-based chessboard Hero status is not purely aesthetic, but it brings with it all kinds of different perks. The greater their fame, the more powers and equipment they can inherit in the next adventure. A local hero will be able to choose a skill, a legend will immediately be a war machine that is difficult to stop. In fact, we are not just talking about a few more statistics, but about real transformations that make each character unique. One of our heroines, for example, sacrificed her hand on an altar. Instead of coming out crippled and unable to fight, she gained a useful ability that allows her to hook enemies. His mistress, on the other hand, was struck by a kind of stone in the eye; at the end of each campaign we will be able to decide whether to indulge in her transformation into a stone-woman or to settle for the bonuses guaranteed up to that moment. As we said, everything is in our hands: we will be both players and dungeon masters, victims and perpetrators of the destiny of the dungeonin our company. At the lower levels you will be able to enjoy the story, its ramifications and the many crossroads. At the highest levels, each battle will be a real fight against progressively stronger, more armored and meaner enemies. Wildermyth is filled with dialogue and choices like these Knowing how to make the best use of all the skills available to the heroes, such as the peculiar magic system, or the ability to warn one's warriors (in XCOM style, one of the works that inspired Wildermyth at least in terms of gameplay) , it will be essential to bring home the skin of your heroes. It will not be possible to be distracted for a moment, because dangers could lurk everywhere. And the biggest ones don't always hide on the battlefield. In addition to fighting, in Wildermyth it will be necessary to explore the game map and manage the few resources available. In this sense, the game reminded us of the never too praised The Banner Saga, with time marking our every action and being a real sword of Damocles on our heads. Scouring a territory for materials to build new equipment is always very useful, but it takes time. Time that is often not available, given that at regular intervals the enemies strengthen themselves with new skills and units and prepare real punitive expeditions that will put the map on fire. But there is not only this, based on the story addressed, there may also be other calamities lurking. Saving time and human resources, therefore, will be another very important element of the whole experience. Something that will test our resistance and that of our group. Style and graphics Wildermyth's style is very distinctive While it's not a visually stunning game, Wildermyth has style to spare. A little for the colors used, very bright, but always well blended with each other, embellished by the ~lights~ produced by flames or magic. A little for the curious choice of creating the characters through very detailed two-dimensional figurines. These are not simple drawings, but elements that evolve together with our heroes. They age between one campaign and another and wear all the weapons and equipment that we will assign them. The character design is also very particular, much closer to the style of Albert Barill's productions (That's how we are, Great men for great ideas) than to that of modern comics or manga. The accompanying music is also excellent, always very much in line with what is shown on the video and also in this case with echoes of The Banner Saga and the exceptional soundtrack by Austin Wintery It also has flaws Wildermyth's pastel colors can also be admired in this fight Although the quality of the experience is very high, especially for those who like to get lost among the hundreds of different dialogues that can be found, Wildermyth is not without flaws. For example the fights are all more or less the same. It is true that the opponents or the shape of the arenas change, but the goal is almost always to exterminate everyone. The map exploration and managerial phase is also rather poor, both artistically and materially, and, despite being functional, it could have given more to the experience. Furthermore, the interface is not always very clear and sometimes it is difficult to select the right enemy or to understand who to move. Finally, the game is only in English and without a good understanding of the dialogues it loses much of its charm. These are elements that are secondary for many, but which must still be reported.", "date": "2021-09-30", "grade": "9.0"}