{"name": "Su-30", "ref": "https://multiplayer.it/recensioni/su-30_a.html", "text": "While being able to count on undisputed masterpieces, as frenetic as they are spectacular, the genre of vertically scrolling shoot'em-ups is now a thing of the past. Among the causes of this illustrious disappearance is probably the inability of modern development teams to reinvent those mechanics which also contributed to the birth of modern video games, with titles such as Galaga, Xevious and 1942. The structure of the stages and the approach necessarily The two-dimensional dimension of these products is in fact very far from the thickness offered by the current action games and first person shooters, so much so that it is difficult to imagine some element that could suddenly project them within the new generation. Reproposed to the delight of enthusiasts and nostalgics within the various ~arcade~ channels, however, shoot'em-ups can still have their say in the field of mobile gaming, which lends itself to this type of application for a series of both technical and practical reasons. We have already seen a few examples on mobile, unfortunately far from exciting, but the Russian developers of HeroCraft have every intention of remedying the situation. Once started, Su-30 looks like the most classic of vertical scrolling shoot'em-ups. The plane we control moves quite quickly as we move the eight directions of the d-pad, and has an arsenal that can be upgraded and enriched in different ways as you progress through the stages. Since there's autofire, all we'll have to do is avoid enemy fire and position ourselves to fire a sufficient number of bursts against the toughest opponents. Some of them, once destroyed, release power-ups that can expand the range of our weapons or equip us with an alternative cannon. The basic equipment is the usual rapid fire but not very incisive, which through upgrades can gain in range and effectiveness, while the alternative weapon consists of a rather slow but really powerful cannon. An extra is represented by the special weapon, which can be made up of missiles or high voltage electric shocks that pass through the enemies causing serious damage. To activate it, just press the 5 key, while the * and # keys are used to switch weapons. It is clear that having an upgraded aircraft makes things easier, especially in advanced stages, and in this sense Su-30 at least partially prevents episodes of frustration that follow sudden deaths: on the one hand using a system with energy bar that prevents the loss of a life in one hit; on the other, giving us the possibility to recover at least part of the power-ups when our fighter is back in action. At the end of each level, as per tradition for the genre, you have to face a boss. Beyond the usual insignificant sound sector, the HeroCraft title is distinguished by very well done graphics, which sometimes even see the introduction of polygonal objects in the basic two-dimensional context. The design of the aircraft is good, while less good is that of the numerous enemy vehicles: the helicopters and fighters are fair, while the larger ships and fixed positions leave something to be desired. Unfortunately, the stages are all very similar to each other: you fly over large sea surfaces, sometimes interspersed with the mainland, and therefore also on a chromatic level there is a predominance of certain colors which does little to help the visual variety of the experience. PRO Solid gameplay Great weapon upgrade system Well done graphics... AGAINST ...apart from the scenarios, bare and monotonous No innovative elements Unspectacular bosses", "date": "2009-03-13", "grade": "S.V."}