{"name": "Un'opera d'arte in tasca", "ref": "https://multiplayer.it/recensioni/zen-bound.html", "text": "Chillingo and Secret Exit develop a real 360-degree digital artwork with an oriental background. Zen Bound embodies everything that a game for the Apple home console must have to enter the circle of milestones in the mobile world; Innovative gameplay, respectable 3D graphics engine and an exceptional soundtrack created by ~Ghost Monkey~ make Zen Bound a real work of art made of pixels. The game sessions are divided into two modes: Reflection and Challenge. For a total of 51 levels, the player is faced with a puzzle game featuring a rope and stone or wood sculptures, where the interaction between them is the constant useful for the progress of the story. In essence, the rope in question releases colored spots in contact with the sculpture, consequently the more the surface changes hue the more the percentage of completion rises, therefore the aim of the game is to wrap the piece in our rope covering it as much as possible. Exceeding 70% filling a nail lights up and the tolling of a bell warns the player that he can complete the level by touching the prickly object with the rope. Each level gives away three flowers, useful for unlocking the following stages, obviously freely replayable; in this way it is possible to improve one's completion percentage and the consequent collection of flowers, visible on the tree that marks the available stages. Zen Bound is not a game where you try to break records, it is solely designed for mental relaxation, since there is no time limit to respect or particular objectives to complete. The real pearl of programming lies precisely in the actual gameplay. The work to be covered with rope is totally removable thanks to the iPhone touch where with the classic pressure the player can turn and turn the piece around the advancing rope. At the same time, it is possible to change the position of the rope in question by directly repositioning the console, with an angular precision worthy of a protractor. The technical sector of Zen Bound exceeds all expectations. The 3D polygonal models are really perfect especially in the interaction phase between the sculpture and the rope protagonist. The latter is positioned in every corner or ravine in an incredibly real way, adhering to every surface. The graphics engine does a painstaking job by accurately simulating the situation and adapting the whole scheme to the player's movements, without ever running into any bugs or inaccuracies. The oriental scenario then gives Zen Bound that touch of magic and inspired environment that is more useful for the perfect adaptation of the player. ~Wear headphones for superior gaming quality.~ Before starting to play Zen Bound, the user is asked to use earphones; highly recommended to follow since the soundtrack that accompanies the Chillingo Ldt game is particularly inspired and hypnotic. The musician Ghost Monkey has undoubtedly created a symphony in perfect symbiosis for Zen Bound, which can also be downloaded directly by pressing the ~Secret Exit~ button from the initial menu", "date": "2009-03-15", "grade": "9.0"}