{"name": "Def Jam: Fight for NY", "ref": "https://multiplayer.it/recensioni/def-jam-fight-for-ny_a.html", "text": "Beat and blood in New York There are two main modes, namely the Story Mode and the Battle Mode: in the first you will play a criminal who is recruited by some illegal immigrants dedicated to organizing illegal fights. Your goal will be to make a career in this fraudulent world by breaking the face of all the challengers who stand in front of you and earn fame, power and money. The protagonist of the Story Mode will not be a fixed character: in fact, you can choose one among some that already exist, or create one from scratch, customizing elements such as the shape of the face, nose, eye color, haircut and even the stamp of the voice. After all this you will move on to selecting one of the five fighting styles present, namely Kickboxing, Streetfighting, Martial Arts, Wrestling and Submission. The differences between the various disciplines are not very marked: Martial Arts, Kickboxing and StreetFighting are mainly based on offensive blows such as punches, kicks, headbutts, elbows and knees, while Submission and Wrestling consist mainly of holds, throws, joint locks and techniques of submission. Once the selection of the fighting style has been completed, you will be introduced to a short tutorial that will illustrate the commands to perform the various moves. As for the Battle Mode, it will be possible to play up to four players or with the computer in various types of combat: in addition to the classic one-on-one and team modes, you can indulge yourself in frenetic free-for-all matches, or challenge each other in a match inside of a cage or circle of fire, and other variants of the same kind. The dress makes the monk To move forward in the game it won't be enough to be great beaters, but it will be necessary to take care of various aesthetic aspects of your alter ego in order to obtain the approval of the public: for this reason it will be necessary to visit the clothing store to buy the most fashionable clothes. of the moment, and then maybe take a look at the jeweler to snag some valuables to put in plain sight; moreover, it will not be counterproductive to go to the barber from time to time for a new haircut, and a new tattoo could give you a more tamarro look. If, on the other hand, you want to learn new moves and fighting styles, you will have the gym at your disposal to train. Clearly the more money you earn (by winning matches) the more purchases you can make in the various sectors. As already mentioned above, the aesthetic care of the character will not have a purely decorative function, but will serve to obtain the appreciation from the spectators, which will be represented through a yellow bale: if the latter completely fills it will be easier to perform the moves special. Welcome to Fight Club! Here we are finally arrived at the gist of the game, or the actual combat. The matches will take place in arenas delimited by elements such as walls, cages or people, and although they do not boast an extraordinary size, they will still allow players to move freely enough. Hits and holds can be performed by pressing very few keys (sometimes even just one), so you will master your wrestler in no time without encountering major difficulties. At this point you will think that the moves available will be very few given the simplified control system. And instead you are wrong, because you can perform different combinations simply by interacting in the appropriate way with the surrounding environment: so if, for example, you kick your opponent's butt in a corner, you can grab his head and slam it against a jukebox, or even better beat it up with a nice combo. And to do all this, just press two buttons! On many occasions the public could then prove to be a valid ally: the spectators will make objects available to the fighters to use against the opponent, and in other situations they will block the enemy ~American style~ allowing you to inflate him properly. Obviously, even the opponents will be able to take advantage of the help of the fans. To definitively KO your opponent, you can resort to various strategies: wait for the energy bar to turn red and smash an object thrown by the public on his head, or by performing a super move (which can be performed with the right analog stick); otherwise you can always try to use a submission technique and wait for the enemy to surrender. However, we warn you that the CPU AI is quite good, so you will struggle immediately to bring the fights to a successful conclusion, indeed the first few times you will suffer numerous defeats. Don't worry though, because as and whenyou go on your alter ego will become more powerful, and the matches, assisted by many spectacular moves, will become very exciting. Technical Analysis The audiovisual sector of the EA title is at excellent levels. Graphically we find a rather powerful engine, equipped with a high number of polygons which makes environments and characters absolutely realistic. Above all, the realization of the fighters should be commended: they are full of details, very colorful and with really convincing and very expressive facial expressions. Even the animations look good, natural but at the same time imbued with great spectacularity (especially those of the supermoves). The only sore point concerns the somewhat dancer frame-rate, which wavers especially in the most chaotic situations. Fortunately nothing that compromises the gaming experience. As for the sound, you will find all songs with a rap and hip hop background composed by the most famous singers of the genre. Surely they are well made, but those who hate this type of music could be induced to mute the volume. The dubbing is also excellent, characterized by well-chosen voices and perfectly suited to the part. Unfortunately, the localization in Italian is missing, and even those who know the Anglo-Saxon idiom well enough will have difficulty understanding the dialogues, since they are spoken in slang and other dialects. Comment On balance Def Jam Fighitng for NY looks like a good product that can entertain users: it offers many ways to play, many moves that can be easily performed, a large number of characters and all those elements that make fighting game lovers happy. Of course, it cannot be part of the elite of the genre, but if you have totally consumed the various Tekken, Virtua Fighter and Soul Calibur and you still want to lead your hands, then the EA title is for you. On the other hand, I don't feel like recommending it to anyone who has always hated the world of rap: they would certainly find the product of little interest. Pros Excellent control system High number of moves and characters Technically valid Cons No localization in Italian Not recommended for non rap lovers Last year the game Def Jam Vendetta arrived on the market, an original fighting game that was very successful in the USA but went almost unnoticed here in Europe. Certainly excelling in an inflated genre such as that of beat'em'up is a rather difficult undertaking (especially when titles such as Soul Calibur II and Virtua Fighter circulate on the black monolith), but perhaps the EA-branded product deserved some more attention. In any case, the software house has decided to create the sequel, and we at Multiplayer are going to describe it for you.", "date": "2004-12-16", "grade": null}