{"name": "LocoRoco Hi", "ref": "https://multiplayer.it/recensioni/locoroco-hi.html", "text": "Released in 2006 by Sony Computer Entertainment, LocoRoco quickly became very popular with PSP owners, especially in Japan. It is a hybrid between action and puzzle game, in which you have to cover certain paths to complete the various stages. The peculiarity of the game, however, lies in the fact that you do not control the small characters that give it its name, but the planet that hosts them: by acting on the buttons of the portable console, it is in fact possible to tilt the ground to the right or to the left, as well as make it jump for push the LocoRoco up and over any obstacles. The yellow beings, given their ~gelatinous~ nature, also have the ability to unite in a single agglomeration as well as to divide again in case of need. These are actions that are necessary to operate devices or to cross otherwise inaccessible areas. Taking advantage of the release of LocoRoco 2, Sony thought the time was ripe for a mobile reduction of the series, and this is how LocoRoco Hi was born, an unpublished episode developed exclusively for Java-compatible devices. Anyone who has played the game on PSP will have no problem getting used to this version of LocoRoco for mobile. The control system is simple and through the d-pad it allows us to tilt the ground and activate the ~jump~ (the longer we hold down the button, the higher it will be). We will also be able to use a key to divide or reunite the characters. The mechanics are identical to the original title, so we will find ourselves having to cover more or less tortuous paths by making the LocoRoco move through the inclination of the ground. We will be able to collect objects to increase the score and balloons to ~inflate~ our gelatinous little creature, making it gain weight and therefore speed on the downhill sections. When there will be a need to cross very narrow channels, we will be able to divide the character into many small parts of the same starting size, bringing them together to be able to activate devices that ensure passage towards areas located at the top. The stages are designed to have hidden parts, reachable only through meticulous exploration, so the action lends itself as much to a quick use as to a later re-reading. We are dealing with a reduction developed with great care, not only from the point of view of the gameplay (extremely similar to the original), but also from the technical point of view: the peculiar graphic style of LocoRoco has been reproduced to perfection, through solutions both simple yet effective. The excellent use of colors, the original and essential design and the fluidity with which everything moves make the game a very pleasant visual experience, whose only flaw seems to be a bit of tearing when the action gets fast. The sound accompanies the games with a series of catchy and good quality MIDI music. PRO Gameplay faithful to the original Simple but effective graphic style Good number of internships AGAINST Sometimes frustrating", "date": "2009-03-04", "grade": "S.V."}