{"name": "Watchmen", "ref": "https://multiplayer.it/recensioni/watchmen_a.html", "text": "The events of ~Watchmen~ take place in an alternative 1985, in which tension between the USA and the Soviet Union has never been so strong and could lead to nuclear war at any moment. The protagonists of the story are superheroes (the Watchmen, in fact) who are inspired by the deeds of a group of vigilantes from the 60s and try to limit the wave of crime that swept America during the last term of President Nixon ( who in this reality escaped the Watergate scandal). These are vigilantes without powers (with the exception of the very powerful Doctor Manhattan), afflicted with neuroses and personal tragedies, who are in the midst of an attack aimed at eliminating them all. But orchestrated by whom? This award-winning comic miniseries, written by Alan Moore and drawn by Dave Gibbons, has been published by DC Comics in the USA since 1986, and over the years has enjoyed numerous reprints (also in Italy). The film, directed by Zack Snyder, was recently at the center of a dispute over the distribution rights (originally in the hands of 20th Century Fox) but fortunately it came out unscathed and is now imminent its release in theaters. For the creation of the mobile game, Glu stepped forward, thanks to the previous collaboration with DC for the game Superman / Batman: The Alliance, which shares the structure and most of the mechanics with this Watchmen tie-in. The player can control the heroes Night Owl II and The Comedian, with the setting that from chapter to chapter goes from the present (1985) to the Vietnam War. During the adventure you also meet many other characters, who help tell the story through dialogues and sequences. Right from the start, the similarity with the aforementioned Superman / Batman: The Alliance (also developed by Glu and recently released) appears clear, even if Watchmen turns out to have a much greater thickness, given the possibility of moving your own superhero in three dimensions and to make him perform a certain number of combos and special moves: we are in all respects faced with a scrolling fighting game a la Final Fight, and this can only please. The developers also cited the Capcom masterpiece with regard to weapon management: knives are automatically thrown at the enemy when he is at a distance, while swords and firearms work as in the excellent but often underrated Cadillacs & Dinosaurs (always the work of Capcom). The d-pad moves the character (pressed twice serves to sprint, which ends with a charge on the opponent), the 5 key is used to attack, the 1 and 3 keys to use a special attack (regulated by a special bar which fills up over time), respectively to the left or to the right, and finally the 0 key allows us to use a sort of ~smart bomb~ that eliminates all the enemies on the screen. Along the stages we will often find chests that can be used as improper weapons and that inside them can hide medical kits capable of restoring part of our energy. Both Night Owl II and The Comedian can grab enemies (simply by getting close to them, even if the system could be improved) and then hit them repeatedly or throw them forward or backward, eventually throwing them at their companions. The ~normal~ levels are interspersed with alternative sections that leave the time they find but which discreetly perform the task of breaking the monotony. The graphics of the game are really excellent, definitely superior to the aforementioned Superman / Batman: The Alliance as regards the creation of the locations, very well designed and full of details and interactable elements. The use of color juxtaposes somber tones for 1985 New York with light and relatively bright colors to represent the forests of Vietnam. The protagonists are drawn in a sober style, and while they cannot boast the beautiful plastic poses of Superman and Batman, they are superior to them for the more varied and more fluid animations. The assortment of enemies is also excellent, quite numerous and detailed, while the sound is limited to some fairly good MIDI music. PRO An ~old school~ scrolling beat 'em up Large number of internships Exceptional graphics in quantity and quality AGAINST Understated sound, as usual", "date": "2009-02-26", "grade": "S.V."}