{"name": "Sega Mega Drive Ultimate Collection - Recensione", "ref": "https://multiplayer.it/recensioni/sega-mega-drive-ultimate-collection-recensione.html", "text": "Trying to write a review of a title, or rather a collection of historical titles, such as Megadrive Ultimate Collection, is a rather difficult operation, given that you enter the nostalgic world of retrogaming to all intents and purposes. Trying to make judgments about the graphics is completely incorrect, in the same way it is impossible to make direct comparisons between the game mechanics of the time, however functional and effective, with those of today. For this reason, an attempt has been made to evaluate the overall offer more than the individual values of each game, it being understood that some titles, perhaps thanks to the nostalgia effect for those who played them at the time, even after about 20 years have not lost in charm and fun, while others only stand out as filler to get to the round figure of 40 games present. Collection games Here is the list of games: Alien Storm, Altered Beast, Bonanza Bros, Columns, Comix Zone, Decap Attack, Dr. Robotnik's Mean Bean Machine, Dynamite Headdy, E-SWAT, Ecco the Dolphin 1-2, Fatal Labyrinth, Flicky, Gain Ground, Golden Ax 1-2-3, Kid Chamaleon, Phantasy Star 1-2-3-4, Ristar, Shining in the Darkness, Shining Force 1-2,Shinobi III, Sonic 3D Blast, Sonic & Knuckles, Sonic Spinball , Sonic the Hedgehog 1-2-3, Streets of Rage 1,2,3, SuperThunder Blade, Vectorman 1,2. In addition to unlockable extras, the list includes arcade and Master System classics such as: Golden Ax Warrior, Phantasy Star, Alien Syndrome, Altered Beast , Congo Bongo, Fantasy Zone, Shinobi, Space Harrier and Zaxxon. Quantity VS Quality The first thing that catches your eye, after an introductory movie with ~almost period~ music is the embarrassing number of games present, there are many of the old classics (and their sequels) such as Golden Axe, Sonic, Altered Beast, Shinobi 3, Comix Zone, Streets of Rage, Shining Force and Phantasy Star plus a series of second lines, more or less interesting, such as Ristar, E-Swat, Alex Kidd, Vector Man and Bonanza Bros. Quantity and quality, even if honor indeed, some choices made by Sega appear strange. Why include, for example, all Sonic and Streets of Rage, and some more than unplayable games (read Gain Ground) and completely leave out titles like Out Run, Super Hang On, Shadow Dancer and After Burner? What happened to Revenge of Shinobi? Perhaps to remedy these shortcomings, Sega has included a good number of unlockable, arcade and original Master System titles, but the final impression is that something is simply missing. As well as unlockable and non-unlockable games, there's also a list of pretty interesting developer interviews, the likes of Kodama, Uchida, Tsukamoto, Miyoshi, Nakamura, plus a host of exclusive artwork and footage. Old Gen VS Next Gen If from a technical point of view it is useless to discuss parallax levels and frames per second, it is more useful to talk about the work done by Sega to try to make obsolete 16-bit graphics more attractive to our LCD televisions. By pausing the game it is possible to set the video filter to hide the flaws of the very low resolution pixels of the time. The images lose their checkered appearance in favor of more muddy colors which, however, can hide some details. Some may not like it, it actually distorts the work of the graphics, but it is undeniable that on today's very large TVs it is a valid aid in overcoming the sad impact of hyper scaled pixels colored by just 64 colours. Also from the same screen it is possible to make the game 16:9 to remove the huge frame that surrounds the old 4:3 aspect ratio of the game. Less invasive than the video filter, this option gives us great satisfaction, especially in scrolling fighting games and platformers, which have suffered less from natural technological aging more than other genres. To conclude the list of options in the pause menu, it is possible to save at any time, going beyond the ~continue~ limit of some games. Going back to the games, the nostalgia factor becomes very important in the face of a technical sector, necessarily not in step with the times. If, for example, Sonic, Streets of Rage, Comix Zone and Vector Man, and to a lesser extent Ristar, Golden Ax and the various role-playing games, it is possible to say that time has been a gentleman, titles that are still beautiful to look at and valid from from the point of view of the gameplay, for others it is difficult not to go beyond a purely ~historical~ interest, from one game and go. Obviously this discourse is strictly personal, but anyone facing the golden age of the Megadrive for the first time today can remain cold in the face of certain titles. Another consideration must be made, namely the price of this collection. Fifty euros for about fifty titles is certainly a good compromise, but seeista the absence of some titles and the holding of others over the years, despite the good number of extras in the form of interviews and unlockable games, with titles of the caliber of Shinobi, Zaxxon and Space Harrier in their original arcade incarnation and some little Master System pearls, surely something more could have been done to meet Sega users, enthusiasts and not. Comment Sega Mega Drive Ultimate Collection is a collection that can't fail to please those who are approaching 30 years of age, and thanks to its release on PlayStation 3 and Xbox 360, it manages to bring all those young users closer to the old glories of the past who, for personal reasons, do not know or have only touched on some pearls of the 16bit era. From a purely nostalgic point of view, the Sega product is an absolutely indispensable opportunity to play with old classic pads in hand, perhaps in front of a big screen. If, on the other hand, we want to give a more objective judgment, we should point out the absence of some titles that we would have expected to see, in favor of a very complete roster, more in terms of quantity than quality though. The graphic options are decidedly useful and functional, making the antiquated low-resolution images of the time more digestible for modern televisions. Ultimately a good product, with excellent ~historical~ extras, and with a decent list of titles present, at a lower price than current standards, but which could have been even more. Pros The graphic revamp works Some titles have not lost their charm Interesting extras Against Some titles are missing Added too many sequels The price could have been a little lower The Trophies The game includes 35 trophies, thirty of silver, four of gold and one of platinum, all inextricably linked to the game score or to the various levels of progression within a title. All fairly easy to make, including those that are obtained by unlocking all the hidden games, cinematics, artwork and developer interviews.", "date": "2009-02-25", "grade": null}