{"name": "Halo Wars - Recensione", "ref": "https://multiplayer.it/recensioni/halo-wars-recensione.html", "text": "Halo Wars is a game characterized by several distinctive features, even without taking into consideration the actual ~game~: it is the first spin-off based on the Halo universe, the first game in the series not to be developed directly by Bungie, one of the few RTS built specifically for Xbox 360 and finally it is also the last ever game created by the Ensemble Studios team, group responsible for the historic Age of Empires series, recently closed by Microsoft within a general workforce restructuring . Regardless of its actual value, it is therefore clear that this is a title that arouses interest in the videogame panorama. The mission entrusted to Ensemble was certainly not easy since together with the high-sounding name, the game also brought with it everything that Halo has meant for gamers, and which ultimately sums up the same philosophy behind the Xbox project: with a mirror operation compared to what was done by the first game of the series, it was a question of transporting a concept typically linked to PC users on a console, thus making it fast and dynamic, with an interface built ad hoc for the machine controller, and a usable structure for most of the users. After having cleared the FPS making it properly a console genre, the new challenge of Halo is to transport the strategic in real time, a genre that is even more difficult to adapt mainly due to the use of the pad, which in this case acts as a real bottleneck for building a functional interface. After two and a half years from the first appearance of the game at X06, we are therefore finally able to enjoy this latest Ensemble-branded product, developed in collaboration with Bungie to try to make it as homogeneous as possible with respect to the original series: while not reaching the qualitative level of the latter, Halo Wars is still confirmed as an excellent product, and once again a confirmation of the versatility of the Microsoft console with regard to genres usually associated with the PC world. War and archaeology The story of Halo Wars takes place 20 years earlier than that of the Bungie trilogy, and therefore of the Master Chief's entry into the field. The war between the Terran UNSC and the Covenant alliance is in full swing, with the latter simultaneously engaged in mysterious research related to ancient artifacts, as well as doing battle with humans. Obviously present all the references of the case to the universe of Bungie, from the weapons used, to the means, up to the presence of the Spartans and the various races of the Covenant. The plot of the game - masterfully narrated by interlude sequences in really well-crafted computer graphics - narrates the adventures of the ground team sent by the UNSC ship Spirit of Fire to the planet Harvest, to investigate the strange activities of the enemy. In the 15 missions that make up the campaign - not many to tell the truth - we will therefore come to know many background stories of the history of Halo, which will thicken the background of the saga with grafts pleasant and consistent with the general context, while getting to know of new characters: Sergeant Forge, Professor Anders and the artificial intelligence Serina, among others. Unfortunately, the possibility of playing the campaign with the opposing side, the Covenant, is missing here, a choice which, although perfectly in line with the tradition of the series, may seem a bit anachronistic given the standards now in force in the RTS environment, as well as not very appropriate for purposes of longevity and re-playability of the title, also given the short duration of the story mode (from 8 to 10 hours to complete). The only way to take control of the aliens is therefore to engage in multiplayer, although even here the presence of only two factions penalizes Halo Wars compared to other competitors (StarCraft, for example): it is true that the choice may have been dictated by need to remain consistent with the reference universe, but the doubt remains that a possible use of the Flood (also present in the campaign) as an usable army by the player could have given further variety to the experience. The RTS mantra Halo Wars does not escape the basic structure typical of the real-time strategy, responding to the same universal laws that have governed the genre for years. Again, it's basically about gathering resources, building a base, and throwing yourself at the enemy. Although the variety of events in which we find ourselves within the campaign is appreciable, several facets typical of similar games are missing, pruned to focus attention maximally on the clash with enemies. Thinking about the complex management structure that characterizes Age ofEmpires, it is strange to note how the Ensembles have set the game dynamics here through a simplification which, although it may seem excessive to the RTS expert, however characterizes the game as a new solution and perfectly in line with the world of Halo, in a way its perfectly enjoyable. The main and secondary objectives are very diversified between one mission and another, but generally involve the construction or defense of a base first of all: this is characterized as a compact structure, concentrated in a single point. Next to the central core there is a fixed amount of space available for plant construction, which can only be expanded up to a certain point. Likewise, the choice of structures to be built (soldier barracks, vehicle factory, airport, resource collection points, power plants) is not excessively widened, which results in a standard base configuration, modifiable a minimum thanks to the conquest of elements external to it (energy plants, defense structures). It should be noted that the supply of resources is mostly automatic (supplies come from outside), with optional but minor collection in the field, another simplifying element in the structure of the game. The ~slotted~ layout of the base, with its limited possibilities, as well as the automatic collection of resources, cuts out a good part of the strategic planning, but it is on the other hand in the combat and in the management of the clashes that Halo Wars focuses mostly, which obviously finds its exaltation in the multiplayer game, present here both in cooperative and versus mode. The space morra The balance of forces during the clashes is essentially based on the classic Chinese pen principle: vehicles beat infantry, aircraft beat vehicles and infantry beat aircraft, with some exceptions given by the presence of special units with superior abilities, such as the Spartans. This involves a general balance that prevents the intensive use of a single vehicle or unit, as all elements have a strength and a weakness in the same way. As far as vehicles and infantry units are concerned, the fact that they are taken directly from the world of Halo implies the additional advantage of enjoying a characterization that is already well defined, balanced and consistent with the setting, as well as easily recognizable by expert users of the series, who will already know the specific characteristics of each element and the substantial differences between the weapons of the UNSC and those of the Covenant. The system adopted for the development and improvement of units is decidedly profound, an element on which a large part of strategic planning revolves: the structures of the base can invest funds both in the construction of new elements to be deployed on the field, and in the development of particular skills and additional features, which will then be introduced regularly in later produced units, with different levels of improvement available for each and two specific fire options. A further level of strategic choice also results from the selection of commanders to be deployed on the field (in multiplayer battles), each of which is characterized by its own special abilities (initial bonuses, upgraded units and orbital attacks for humans, specialized units and usable commanders in battle for the Covenant), with a solution that partially recalls the use of ~heroes~ in Age of Empires. The official strategy guide To better orient yourself within Halo Wars, the official strategy guide dedicated to the game, published by Multiplayer.it Edizioni in Italian, may be useful. Inside you will find techniques and strategies explained to make the most of the Campaign and multiplayer battles, as well as various insights into the units, maps and history of the game. The 208-page volume will be distributed on the market (in bookstores and video game stores) in the same period of release as Halo Wars (February 27) at the price of 14.90 euros. A new perspective The study of an interface also contributes to such a fluid and dynamic gaming experience which, for once, does not seem like a forced compromise to imitate the possibilities of the mouse and keyboard with the controller. There are no key combinations to learn here, each button corresponds to a single action (selection, menu opening, movement, primary and secondary attack) while menu navigation takes place through a radial configuration that allows easy viewing and selection of the many choices (a solution previously adopted already by Command and Conquer 3: The Wrath of Kane mbrought here to a further level of intuitiveness), without sublevels or excessive stratifications of the commands. The sticks are entrusted with the movement of the cursor and the rotation/zoom of the camera, with the possibility of jumping from one point of the map to another by ~shortcuts~ through the digital cross (a system that is not really functional, most of the times). The interface present in Halo Wars is certainly the best of those seen so far for RTS on consoles - except for that of Civilization Revolution, which in any case belongs to a different genre, with other requirements - and it is especially noteworthy the study and the work carried out by Ensemble to adapt the rhythm and the game structure to the needs of this control system (and vice versa), making the whole look like a homogeneous whole: an exquisitely console product. Although not distinguished by avant-garde technical solutions, aesthetically Halo Wars is in all respects a chapter of the historical series: the design of vehicles and units, the weapons, the light effects, the settings and the same colors adopted fit perfectly in the general framework of the series, giving the impression of observing the battles of Halo from a new perspective, managing the choral action of the UNSC and the Covenant from above for the first time. Only the scenarios in some cases are a bit flat and stark, but in most cases the detail is remarkable, especially at close range. Note, as regards the latter, also the presence of hidden objects to collect, such as black boxes or traditional skulls, able to provide new information on the story and additional options, thus stimulating the exploration of the settings. For its part, the sound accompaniment underlines the impression of an organic whole with the FPS series thanks to an orchestral soundtrack that incorporates some classic themes of the series, as well as excellent sound effects and dubbing, also taken from Halo standards. As already mentioned, the interlude scenes in computer graphics are of excellent quality. Comment It makes little sense to evaluate Halo Wars for what it has to offer in comparison to the modern RTS present on PC, compared to which it can seem overly simplistic, focused as it is more on the fights than on the careful management of resources and unit specializations. This game is based on a different rhythm, faster and more dynamic, assisted by an interface that is finally free from the limits imposed by the transpositions of genre games, and it succeeds well in its intent. It can rather be said that Halo Wars does not bring the genre to a new qualitative level, configuring itself in its own way as an alternative to the classic RTS, as Halo did for the FPS at the time, contenting itself instead with streamlining a now consolidated structure and focusing only on a few elements to the detriment of others, but this is not necessarily a defect. In any case, this latest Ensemble product currently represents one of the best examples of how an RTS should be developed on consoles, freeing itself from the tradition for Personal Computers.Pro It fits perfectly into the Halo universe Great interface Intuitive and playable in both single and multiplayer Against Shallower than other RTSs Short, one-way campaign Only two usable factions Xbox 360 - Goals 50 goals for the usual 1000 points is the loot in the game. To obtain them, the developers have managed to focus on the re-playability of the missions, linking the achievements to particular performances to be obtained: use of particular units, targeted eliminations and obviously obtaining the various medals at the end of each section. In addition to these objectives and those coming from simple progression in the campaign, many others are related to online matches. Ultimately, the complete collection is somewhat challenging.", "date": "2009-02-23", "grade": null}