{"name": "Tale of a Hero - Il Destino di un Eroe - Recensione", "ref": "https://multiplayer.it/recensioni/tale-of-a-hero-il-destino-di-un-eroe-recensione.html", "text": "Tale of a Hero is baffling. Already the title screen betrays the scarcity of means used to make this production, which appears incredibly dated even compared to titles belonging to the same genre and certainly not considered triple A. In reality it would be a good idea not to start a review talking about the technical aspects , especially if it's a graphic adventure, but here it's impossible to do otherwise. Visually, Tale of a Hero seems to have escaped from the first half of the 90s, as if it had been abandoned, relegated to a corner to collect dust and then revived to throw it on the market today. It really lacks everything from detail to style, and it's hard to find anything to salvage. Characters and various creatures are modeled roughly, often with very little polygons; just look at the protagonist to realize it. Maybe that's why it's difficult to have close-up shots and the characters always act in very long shots? Even Loom had managed to do better in this respect. With the scenarios it goes a little better from the point of view of design: that is, while not presenting who knows what qualitative peaks and while being anonymous, it cannot be said that they are badly designed. Above all, the swamp is well outlined, with a soft fog that softens the shapes of the ruins it submerges. Too bad everything is still and anonymous. We don't remember a graphic adventure in recent years with such dead scenarios. The animations are very rare and it often seems to move on painted boards, rather than in a living world. The protagonist himself does not cast any shadows, greatly accentuating the sense of flatness and general immobility. The same animations related to solving puzzles are often generic and not very descriptive. The surroundings of a story But let's get to the heart of the game, which is the plot and the puzzles. In Tale of Hero the story of a hero is told, the son of another hero (nepotism has also landed in the world of video games, apparently) who has to save a princess from an almost immortal ice giant. How to do without losing your life? Of course, just ask for the help of a witch and a mushroom oracle. In reality, the situation is slightly more complicated than that and during the adventure a twist will occur that will turn the tables on the table. Nothing shocking or new, actually, but at least a little spice is thrown on a decidedly uninspired plot. The real problem is that, after an initial sequence with an uncertain meaning (we have to stop a monster with the help of a talking black cloud), not at all connected with the rest of the game and disconcerting due to some dubious narrative choices (it is difficult to understand if the tones are serious or if they try to trace the irony of Lucas' old titles), the real adventure begins in which you have to perform a series of rather boring actions and in which you move within a handful of screens that they must be traveled over and over, examined and re-examined several times, in search of elements unlocked by a dialogue or something else. A certain general improbability reigns: the hero who has been asked to defeat an evil titan must, first of all, clean up the house, help his future father-in-law who, instead of favoring him, does nothing but put his sticks in the works and finally look for a way to enter a swamp fighting the stench. If you don't get discouraged by a less than sparkling start, you manage to get to the long section set underwater where the situation improves. Too bad that to make it you will have to resist the tedious first hours of the game ... and it is not a simple undertaking. Let's interface in silence The interface is very simple: at the top is the inventory bar, where you can examine, select or combine items, while at the bottom is the main menu bar. Items are picked up with the left mouse button and examined with the right. The puzzles are quite logical and, apart from sporadic cases, you don't have to work very hard to find solutions to problems, also because the dialogues give many suggestions to understand what needs to be done. Pixel hunting deserves a separate discussion, i.e. the need to go and look for something inconspicuous hidden in the scenario by beating it pixel by pixel, which, in some cases, was rather annoying, above all due to the aforementioned graphic limitations that do not make the all objects. For example, we struggled a lot to find the rooster in one of the first screens because it was completely still and badly drawn. Even the sound deserves blame: the few pieces of music present are poorly matched and, frankly, they are not that great. Especially that of the screen of the butppa, which you are forced to access continuously by going back and forth between the few locations present, tends to become unbearable. The voices of the characters (in English, while the written texts have been completely translated into Italian) on the other hand, are obviously a joke because they are completely inadequate for the characters. In some cases they seem modulated with the microphone of the Serpent Citadel (how many will understand this? Come on, force yourself and get busy with Google), in others they are simply out of character. Comment What else to say about Tale of a Hero? We are faced with a less than mediocre product even for the graphic adventure genre, for which graphic miracles or who knows what innovations in terms of gameplay are not expected, but only a good story and challenging puzzles as required. Of course, paying one would also expect a product in step with the times and not one that seems to come from the bowels of an amateur tool. Forget it.Pro Medium long Some locations are well designed The price Against Technically bad Pixel Hunting Phone call and uninspiring story PC - System Requirements Minimum requirements Not received Test configuration Processor: Intel Core 2 Quad Q6600 RAM: 3GB Video Card: GeForce 8800 GT Operating system: Windows Vista", "date": "2009-02-18", "grade": null}