{"name": "Jak 3", "ref": "https://multiplayer.it/recensioni/jak-3.html", "text": "Interceptors The Hollywood character this third chapter seems not to have lost at all. It begins where Renegade stopped, with a video in real time graphics that portrays the damned handsome green-haired Jak, handcuffed and escorted in the immense solitude of an equally immense desert. More than an exile, an almost certain death sentence. Accompanied by his faithful and troublesome furry friend Daxter, we will see our paladin wandering, wandering and still wandering among oceans of sand. Exhausted and demoralized, the extroverted couple ends up giving in to the blazing heat of that place, only to then be picked up from the ground by a not too friendly group of individuals belonging to a community of rebellious outcasts. Thus begins an adventure which, with missions aimed at satisfying the wishes of an opportunist tribal chief, manages to get even the novice player to practice. We will go from shooter and action sections to others typical of adventure-style racing, in a pout pourr so full of variations that it looks like a minestrone. Haggard, almost disappeared, the platform component that distinguished the first chapter, which instead now finds itself having to give way almost entirely to the game concept seen in the second. Jak now has more weapons, more means and even more powers, but the substance is the same as its predecessor. Few commas changed, practically imperceptible even to the most attentive. This, gentlemen, is the defect that most grips the new Naughty Dog production: a rather cheeky ludic immobility, partly forgivable only thanks to the actual goodness of a product that proves to have cemented itself well after the jolts suffered by the prequel. Not that we expected the revolution that affected the passage between the first and second chapter, mind you, but something more was necessary to propose it. The very addition of light powers to the protagonist's already substantial skill set is, however welcome, dwarfed by this general lack of innovation. The real stars of the game thus become the cars, which take shape in a varied showroom of buggies of all types and sizes. Finally, there are many elements that can be unlocked during the game, among which the possibility of customizing your alter ego stands out by choosing from a good number of variables, such as enlarging the head and removing the semi-fluorescent goatee. The real stars of the game thus become the cars, which take shape in a varied showroom of buggies of all types and sizes. Beyond Thunderdome Pad in hand Jak 3 always proves to be a versatile title, capable of proposing effective solutions for every situation encountered in the game. The control system does its dirty work without batting an eye too much and without revealing any difficulties. In these terms, the finishing work carried out by the American coders proves to be invaluable. The same cannot be said for the management of the chamber, which like a thoroughbred stallion rebels whenever it can. It often happens that you have to adjust the shot and, even worse, to see it better than stranded by any rock that gets in the way of its round path. It often happens that you have to adjust the shot and, even worse, to see it better than stranded by any rock that gets in the way of its round path. The visual counterpart is of a completely different kind, warmly proposing itself for the 2004 'graphic big gold' at least on the Ps2 side. Distinguished by evocative and well-built settings, the graphic sector also shines with characters and enemies with a good number of polygons and equally good animations. It would be right to review some animation of Jak like running, which is a bit too unnatural. Quizzes in any case. The lighting effects are also excellent, always dosed and effective in their spectacularity. Particular mention for what concerns the soundtrack and, above all, dubbing. The first trolling without however ever exceeding the game action, proposing motifs that are always appropriate and catchy. The second voice deserves an ovation: an exemplary Italian dubbing of both Jak and Daxter, as well as all the other voices donated to the various characters in the game. This is how every game's voice acting should be! Nothing more, nothing less. Jak 3 brings to a fitting conclusion a storyline that has kept many in suspense. A dutiful tribute to a saga that seems to end here, the new Naughty Dog game stands out more for the merits of its predecessor than for its own. The innovation that borders on zero is a hard blow to swallow, but the digestive materializes in a good title, quite varied and satisfying, even if not very long-lived. The duration of the adventure which ranges from 6 to 10 hours unfortunately invalidates agame that should have given something more, and not only in terms of overall duration. The high technical quality proposed by this final chapter consoles not a little, which does not betray the expectations derived from a saga that has always exploited the Sony machine properly. We conclude by recommending the game in question to all fans of the series and all those who want to know the fate of Jak, his hairy half Daxter and Heaven City. Unfortunately, those who have never had an interest in this noble epic will find it difficult to find here the cues needed to change their minds. Pros: Great variety of missions. Technically excellent. Exemplary dubbing. Cons: Innovation 0 (zero). A little short. Naughty room. We are on the verge of a year that is in some ways unforgettable. Pragmatic, at times narcissistic and certainly generous, this 2004 will remain in our mental photo albums for its abundance and quality. In some ways, it was exciting to see each software house fight with blows; after all, we are the beneficiaries of this pseudo-war on pixels, the recipients of gameplay-hungry vultures. A bitter context from which Naughty Dog certainly could not be missing, the American softco that gave birth to Crash Bandicoot and the indomitable pairing Jak / Daxter. The latter were born on a still young Ps2, with few tricks but a lot of will to blossom. The first chapter of the saga was a blockbuster, then repeated by a sequel that partially distorted the platform DNA of the forerunner, bringing it more towards action shores than anything else. We then arrive at this Jak 3, which in addition to the burden of closing what in cinematic terms would be defined as a trilogy, also has the duty to cement the good things seen in the previous episodes.", "date": "2004-12-15", "grade": null}