{"name": "Spectrobes: Oltre i Portali - Recensione", "ref": "https://multiplayer.it/recensioni/spectrobes-oltre-i-portali-recensione.html", "text": "It would happen that first of all it would become much ~cooler~, with a manga-sci-fi look that is also pleasant for an older audience, as well as its Pokmon; then it would happen that he would find himself in an extremely more complex game universe, both in terms of the structure of the universe itself (perhaps an entire solar system to explore planet after planet...), and in terms of things to do and ways in which to do them... In a word, Spectrobes would happen, Disney's answer to Pokmon which, after the unpredictable success of the first episode and waiting to land on Wii, tries the definitive consecration with the second portable episode. Winning team As we said, the first Spectrobes did not come out to the clamor of the public, who saw in Disney's move a very late response to the Pokmon phenomenon, yet it managed to gain a large share of consensus, critics and the public, simply by virtue of the goodness of the game, developed by the Japanese Jupiter co-authors among other things of the extraordinary The World Ends With You, so not really the first comers. The second title in the series takes up practically all the elements of the prequel, but declining them in more depth, starting from the setting, plot and characters. Again we will take the commands of the Dynamic Duo made up of Rallen and Jeena, police officers of the Nanairo System (this time we can also directly control Jeena, although only in particular sections of the game), and again we are dealing with the invasion of aliens and mysterious Krawls. This time, however, our opponents are not simply an indefinite and impersonal threat, but present in the figure of the High Krawl real ~bad guys~ with all the trappings, endowed with their own motivations and (evil) feelings which, even without by mistake from the clichs of the genre, it still gives a certain depth to the otherwise banal unraveling of the plot. Even the ways in which our heroes fight the Krawl are not very different: everything is regular as long as it comes to training and equipping at the Headquarters, traveling from planet to planet exploring its surface in an attempt to eradicate any Krawl presence and controlling Rallen while he fights a particular form of aliens with a real-time Action system. The peculiarities of Spectrobes emerge when we talk about the creatures that give the game its name, the only ones able to truly defeat the Krawls: while in fact Rallen limits himself to facing the Dust Krawls, to eliminate the Vortexes that generate them it is necessary these strange animals. You don't change! As you have already understood, the Spectrobes take up the concept of Pokmon a bit, in the sense that it will be necessary to find them, raise them, make them fight and manage them in the best possible way; they are of three different types each of which is strong against one and weak against the other and each of the almost two hundred different species has peculiar characteristics, not just visual ones. The Spectrobes are born from the fossils that you find around the planets: it is in fact characteristic of a Spectrobe puppy (you have one since the beginning of the game), that is not yet evolved, to be able to analyze the surrounding terrain to find various objects, including precisely the Spectrobe fossils, the minerals with which to feed the animals as well as various bonuses, and for this reason it is mandatory to leave at least one Spectrobe for each type as a puppy. In fact, you can also come across particular Portals, which give access to the most succulent areas from the point of view of bonuses, which however you cannot cross unless equipped with the Spectrobe puppy of the opposite type. Once the bonus has been found, the ~archaeologist~ mode starts, which makes extensive use of the touch screen and the tools purchased during the course of the game: the more excavations you make, the less risk you run of breaking the finds. Once a fossil has been found, it must be awakened through a particular procedure which also requires the use of the microphone; then the team must be managed, being able to carry around with you up to a maximum of six ~fighting~ creatures but only one puppy, and you must pay attention to the growth of the Spectrobes, which increase in level with the fight but also through the Incubator and the minerals... Finally, when you come across a Vortex, the color of the vortex must be analysed, only two (from the six that we carry with us) little animals of the opposite color must be selected, and finally you can go into combat by taking direct control of one of the Spectrobes while the other is governed by the AI: at any time, however, you can change the controlled character. These clashes also take place in real time, and it is here that you can clearly see how different each Spectrobe is from the other in terms of characteristics and moves used.But which team loses? You understood that we are dealing with a very complex and profound game; in fact, those listed above are only the broad lines of the Spectrobes concept, because if we then wanted to analyze the details, we would go far beyond the terms allowed for any normal review. Therefore, the latest Disney production cannot be attributed to any lack of poor design, and indeed, whoever is captured by the mechanism becomes an absolute slave to it, eager to try all the creatures, breed them at their best, find all the hidden objects, earn all the Emblems that the game gives you when you meet particular requirements. However, such a structure needs a clear, linear interface that is never awkward or repetitive, otherwise you run the risk of falling in love early, and it is a risk that Oltre i Portali, unfortunately, runs very often. Passing over some defects of the control system related to the movement of Rallen and to the lock on during the fights, which are annoying but not sensational, we cannot however ignore the complexity and cumbersomeness of the management of the whole complex, which are truly enormous and in many useless cases: every time, to save and access the Incubator, you will have to return to the spaceship; but accessing the Incubator is necessary to change Spectrobe puppy, so either go back to the spaceship every time you find a Portal and then do the whole level all over again, or simply repeat each level three times each with a puppy of a different color; the operation of the incubator itself is not at all intuitive and immediate. Again, the phase of finding the objects can be very irritating because the excavation is fundamentally repetitive: the problem could be of little importance if the game gave us some clues about where the most important fossils and objects are found in order to avoid all the ambaradn to then find a measly useless mineral, but there is no way to distinguish the truly useful objects before having found them... In short, the new Spectrobes is a game designed with all the trappings, but whose design was then accompanied by a realization equally attentive to the needs of a fan of the genre: we are not facing a disaster, and indeed whoever manages to overcome these obstacles will find all the charm of such a rich system, but certainly if these obstacles had not really been it would have been much better... And whoever overcomes these obstacles will also find, to underline how much meat in the fire there is, various multiplayer modes both offline and online, among which we point out a real market of Spectrobes to sell and buy among the players from all over the world, and a singular turn-based battle in which you win by tackling various mini-games, as well as 3D graphics not too detailed for a DS but very fluid and style-conscious, and finally an absolutely average sound department of the genre. Comment The Spectrobes problem was already in its infancy in the first episode, and this time it shines in all its glory: this series is very ambitious, it wants to be all that Pokmon has never been and probably never will be, and for this reason it has taken the most long of the leg. All game concepts on paper tend to create a rich, complex and exciting experience that combines Action RPG with management of the best kind; but unlinear and poorly structured controls, interfaces and game mechanics seriously risk ruining everything. You could outrun all the problems and find all the good in Spectrobes, but there it's really a matter of how on the wavelength of the game you are: if you're not, you'll soon abandon it. Pros There is a lot of irons in the fire The multiplayer is excellent The manga style will appeal to many Against Complicated and cumbersome interfaces Often repetitive More could have been done on the sound", "date": "2009-02-23", "grade": null}