{"name": "Race Pro - Recensione", "ref": "https://multiplayer.it/recensioni/race-pro-recensione.html", "text": "The name SimBin means a lot to the many lovers of driving simulations on PC and it is useless to start with endless digressions about their work to give enthusiasts the GTR series, the various RACEs and the unsurpassed GT Legends. Here we are dealing with a delicate passage, a turning point on the console that could easily be defined as risky right from the start and that after a thousand postponements, name changes and being off the radar for too long, seemed inevitably compromised and that for some it was for real. In reality Race Pro is a difficult game to assimilate like few others, so subject to ups and downs that you risk loving it or hating it solely for a matter of first impact, skin, while the only way to try to get a satisfactory judgment - perhaps failing and being criticized - it's throwing your heart beyond the obstacle at the cost of seeing it only from the point of view of a certain type of user and expectation. Bidding in fits and starts The offer on the modality front is varied and numerically tempting, with everything that can be expected from a driving game plus some tasty additions. The Career is the heart of the experience, as a universal standard by now, asking you to complete 33 contracts with as many teams and on an equal number of cars, winning as many races as possible, earning credits useful for opening the doors of the most famous teams and unlocking the cars used, so that they can also be used in other games. A not exciting complex because it seems too specious to enter only three races for each team, a management of money that has no way of being spent except to favor other contracts - so it might as well have given tokens per category and not thousands of credits - and the need to win there to get something else; in short, it is difficult to feel like a novice driver rather than a player grappling with the usual procedure. The various championships are better - once made available - which, taking advantage of the licenses obtained for the tracks, the drivers and the many variations of each vehicle, allow you to enjoy a certain amount of identification, while the Training and Race options appear as dutiful additions Single, which given the simulative qualities of the product acquire their own meaning and utility. Well the multiplayer that offers up to twelve players to fight, possibly supported by artificial intelligence for the missing slots, on the track you want and, based on whether you choose ranked matches or not, ticking off a good amount of options, from the realism of the damage to the amount of driving aids, from the weather conditions to the presence of a qualifying lap. In this sense, the lobby also works properly, which allows you to train while waiting for your teammates, without wasting time unnecessarily. Finally, the idea proposed by Hot Seat is amusing, which allows two drivers with as many pads to take turns driving, cooperatively or in competition, so as to allow local play on a single console avoiding the by now anachronistic split screen. Sit in the driver's seat There are three selectable difficulties, from beginner to professional, each equipped with a good amount of settings to be adjusted at will, adding and removing the various supports in braking, traction and so on. It is useless to hide behind a finger, Race Pro - the name is more than explicit - allows the possibility of being played even in a light way, like an arcade, but it wants to be taken seriously and the greatest satisfaction comes once all the aids have been disconnected, when you can appreciate the excellent work done to characterize each single car: from the Mini Cooper, with which you start, up to the racing cars of the WTCC Extreme championship, each four wheels accelerates and brakes, hits the curbs and collides with the opponents in different ways and believable, asking to be studied and tested with a good dose of patience, perhaps wasting time studying the most suitable set-ups for each track and then saving them and always keeping them ready. Let me be clear, certain excesses seen with products such as Live for Speed are not reached, which in fact will never arrive on consoles, leaving you free to run both with the pad and with the imperfect Microsoft steering wheel, but the satisfactions come almost only if you don't go down compromise, otherwise it's fun but not worth a Forza Motorsport or a Project Gotham Racing for all the offer and the refinements they have and the SimBin title is not. Not pretty but effective Visually Race Pro is simply inferior to its more famous competitors, although going to see in the specifics it has nothing penalizing for the user it is aimed at, if not perhaps the thirty images per second, half of what is desired by most part of the virtual pilots, remaining comstill perfectly enjoyable. The thirteen tracks included are present only in the official conformation - no cuts or mirror versions - and reproduce some of the most beautiful and evocative tracks in the world, from Monza to Brno to Valencia, passing by exotic and legendary destinations such as Macau and Porto; all are formally reproduced down to the smallest detail, with imperfections from tread wear that affect grip and all the most important visual references in their place, presenting as a counter-altar some contour elements that are not exciting, with poorly defined constructions and poor in polygons and a motionless audience, albeit perhaps posing. Only two possible weather conditions, sun and rain, the latter rendered properly both graphically and in terms of impact on driveability. The models of the fifty or so machines - all of which actually exist and which increase dramatically by counting the different liveries - are honest, far from those of Gran Turismo but also of the aforementioned competition on Xbox 360, although faithful to the originals both externally and internally. The physics and artificial intelligence of the opponents can be set at will in almost all modes and it is advisable to raise their level to the maximum, especially in the first case to obtain a credible impact on the vehicle, both aesthetically and in terms of functionality lost in each clash with the opponents or trackside obstacles. Not good are the menus that do not satisfy in terms of practicality and design, forcing more pressure on the keys than what would have been possible. Comment Race Pro is offered to everyone, but it is difficult to see its qualities beyond its simulation essence. The Career is playable but not as deep as might have been expected while the other modes, especially the online multiplayer, convince and allow you to better enjoy the excellent driving model that enhances each of the cars entered and all the tracks. The advice is to try it, set the difficulty level to maximum and try to understand if that kind of commitment and depth is what you are looking for in a driving game; if so, the purchase is more than recommended. Pros Compelling driving simulation Well built multiplayer Lots of licensed tracks and cars Against At lower difficulty levels it loses much of its charm Visually out of step with the latest releases Reviewable career Xbox 360 goals Race Pro offers the usual 1000 points, obtainable by completing specific sections of the Career or entire Championships, winning certain races and finishing others without taking damage. There is also ample space for multiplayer, online or in Hot Seat mode, so as to see one's merits recognized even in the long term and against other human opponents. Attention: the trial version has highlighted problems in unlocking some achievements despite the reached requests. It is not known whether the problem also exists in the version available in shops.", "date": "2009-02-18", "grade": null}