{"name": "Street Fighter IV - Recensione", "ref": "https://multiplayer.it/recensioni/street-fighter-iv-recensione.html", "text": "In Capcom, probably, nobody wants to hear the word revolution echoing in their corridors, a policy of continuous iterations, more or less all the same, has guaranteed the Japanese company years of success. Street Fighter IV seems to fall fully into this category, but a more skilled eye, indeed a player who decides to play it thoroughly by dissecting all its secrets, will find a title with a double soul, capable of exalting both newcomers to the series (or genre) , and those looking for more technical and refined mechanics. Available for PlayStation 3 and Xbox 360, and to follow also on PC, Street Fighter IV is basically a game with a double interpretation, absolutely detached from the nefarious practice of button mashing: the surface is that of the classic shoryuken and hadouken, but digging into deep there are a series of innovations, daughters in part of the previous episodes of the series, which distort the historical immediacy of the prototype, guaranteeing the title a usability that goes beyond the classic game of harp. In short, if this is not a revolution, we are close! Innovation and classicism The renewed game mechanics find an outlet in a well-implemented single player sector, but even if it is obvious that Street Fighter IV finds its definitive consecration in the challenge against a human opponent, Capcom has tried to make up for this ~sentence~ by creating a good variety of game types, ranging from the classic Arcade Mode to get to some challenges, passing through the training mode. The challenges are the classic ones, Time Attack and Survival, which, depending on the level of difficulty chosen, compete for the online rankings. To conclude the triptych of game types we find the Trial Mode, a real training mode, as we are offered the possibility of learning the advanced techniques of attack, combo, Focus and EX. The single player gaming experience then ends with the plethora of unlockable content, which in addition to new fighters, clothes and personal actions, allows you to enrich your personal gallery with drawings, intros and animated final scenes, titles and medals. It is also possible, once the game is finished, to choose the voices of the wrestlers, making Ryu express himself in a more appropriate Japanese or the busty American spy Crimson Viper in his own language of origin. All little things but which denote the care taken by Capcom in creating the fourth chapter of its most famous saga. The list of fighters allows us to choose our alter ego from a roster of twenty-five fighters (to be unlocked progressively), all the old acquaintances plus some new characters such as Gouken, with the double blue ~bubble~, former master of Ken and Ryu, the Frenchman Abel, the American spy Crimson Viper, the pot-bellied but very agile Rufus and El Fuerte, Mexican wrestler and aspiring cook, judging by the frying pan he carries with him. To these are added Seth, the final boss, with special moves that make Dragon Ball so much and the six street fighters Dan, Fei Long, Sakura, Cammy, Gen and Rose. The latter are exclusive to the home versions, as they are not present in the ~bar~ version. All and immediately To unlock all the wrestlers it is not enough to simply complete the arcade mode with the basic wrestlers, but some parameters must be met. If to play with Cammy, Dan, Fei Long, Gen, Rose and Sakura it is enough simply to get to the end with, in order, Crimson Viper, Sakura, Abel, Chun Li, M.Bison and Ryu, to impersonate Akuma and Gouken we must finish the game by colliding with the previously unlocked characters and at the same time get two perfects and two Ultras as a knockout blow Solar Attack...Energy! More than the extra content, more than the costumes and characters to unlock, the core of the game is the new fighting techniques. The first major introduction, which goes beyond the scenic Super and Ultra, is the Focus Attack. Direct son of the Parry System, it is obtained simply by pressing the two medium attacks. In short, depending on the loading time, the wrestler absorbs the opponent's blow, both physical and ~magical~, and if executed with the right timing, it strikes the opponent by stunning him, setting off a series of devastating combos. More difficult to explain than to do, it is simply necessary to add that, by mastering this technique to perfection, it is possible to effectively counterattack the opponents' special moves, break their guard and at the same time also recover some energy. More than all the new moves, this is the introduction that gives new life to the game, which allows a double key to understanding the Capcom product. Using it to perfection means knowing how to put anyone in difficulty, humano managed by the cpu, as it can be used as a complement to all attacks, to close prematurely, or in a different way a Super (or an Ultra), or as the opening of a combo. A sea of possibilities therefore, a real godsend for those demanding players who are clamoring for technicality and depth from a fighting game. Then the ~EX Moves~ return, i.e. the enhanced version of the normal special moves, which guarantee more damage at the cost of a part of the bar that allows the Super to be loaded, while the already (but also over) mentioned Super and Ultra make their entry . The former are obtained after a certain number of successful attacks, the latter instead when the ~Revenge~ bar is full, or after a series of suffered attacks. Devastating if performed successfully, they are the classic attacks that manage to turn the game around, and in the case of the Ultra, they gratify the player with a cinematic sequence of great impact. Cross and delight The greatest value of this title, more than an excellent technical sector, all lies in this perfect balance between casual attitude and hardcore attitude, in being perfectly attractive and appreciable by all types of players, immediate and immediately rewarding, and thanks to the The implementation of the training and ~teaching~ modes makes the transition to a game conduct in line with the new implementations decidedly downhill and not at all abrupt. However, to fully benefit from this latest Capcom masterpiece, it is necessary to seriously consider the idea of an arcade stick or an alternative pad to the standard one supplied, in the case of this review, of the Sixaxis. Unfortunately, the digital cross and the analog stick do not respond perfectly to the player's requests, resulting in too much or too little precision. If the ~normal~ special moves, those imprinted in the heads of historical aficionados, are carried out with relative ease, the Super and Ultra instead, decidedly more cumbersome to implement for some wrestlers, can have a decidedly lower success rate. And this is particularly serious because it forces the player to concentrate on the movement, to lose that half second to make up his mind, while the opponent can respond in the blink of an eye to the attack. Obviously a criticality of this type is particularly felt in the first games, but even with constant training, a different stick or pad is absolutely preferable. However well structured, and with a mountain of secrets to unlock, titles and trophies to win, the single player can soon come to an end, in fact Street Fighter IV becomes virtually infinite thanks to the possibility of playing with human opponents, online or locally is. For the moment, the multiplayer provides for the minimum wage, i.e. single challenges with the possibility of customizing the basic games, but a free patch is expected soon that will introduce tournaments, the possibility of registering, downloading and uploading the most interesting challenges, but above all a Advanced matchmaking, with different scoring and evaluation systems that take into account your performance and the tournaments you have participated in, in order to make the difference between novice players and expert players more clear. Subsequently, upon payment of a small sum, ~aesthetic packages~ will be released for all wrestlers, i.e. new costumes. Playstation 3 trophies Street Fighter IV rewards the player with 48 trophies, of which 35 are bronze, 10 silver, 2 gold and 1 platinum. They are linked to particular conditions such as a certain number of EX, Focus, Ultra and Super performed, the level of difficulty with which you finish the game, or the number of matches won online and offline. The two golden trophies are acquired by winning 100 online matches and all gold medals in challenges, while the platinum one is obtained by unlocking all trophies in the game. Apart from some decidedly difficult victory conditions, winning all the trophies seems quite easy, provided you have perfectly assimilated all the fighting techniques of the game. Pastel colors and fireworks Technically speaking, Street Fighter IV leaves you speechless, both from a purely technological point of view and from that of the artistic direction. The decision to implement 3D graphics but with a purely two-dimensional look is absolutely successful, with the wrestlers presenting themselves to the eyes of the players as if they were drawn, going beyond the classic cel shading. As for playability, here too we work on a double track: on the one hand there are pastel colors and refined textures with great detail thanks to skilful ~brushstrokes~ of color (examples arethe black trails of ink left by the successful Focuses), on the other hand the Ultra and Super shoot special effects in profusion, with the last ones exploding like fireworks in the face of the player who suffers them. Another aspect that often leaves you speechless are the very fluid animations, especially the facial ones that draw terrifying expressions of pain on the faces of the wrestlers. If you really want to nitpick at all costs, it is possible to recognize a veil of aliasing on some of the elements of the backdrop, which denounces a well-done polygonal modeling, but far from the perfection of that of the wrestlers. Decided thumbs down instead for the bad animated sequences in the opening and closing of the Arcade mode, totally detached from the style chosen by Capcom for the game.", "date": "2009-02-16", "grade": "9.4"}