{"name": "New Play Control! Pikmin - Recensione", "ref": "https://multiplayer.it/recensioni/new-play-control-pikmin-recensione.html", "text": "Pikmin is the most important series that Nintendo has created in the last ten years: according to Miyamoto, destined to become a cornerstone comparable to Mario, Zelda or Metroid, this saga, although it has received much appreciation from critics, has not yet managed to enter the players' hearts such as those just mentioned. Yet Pikmin is a unique and beautiful work, on which Nintendo intends to focus again: that's why this ~New Play Control~ version was published, which will soon be followed by the re-release of the second chapter and, presumably, in a more or less future less distant, from a third episode created especially for the Wii. Garden Legend has it that Miyamoto was enlightened by the idea of Pikmin while, sitting on a wall in his garden, he admired the movements of the ants. From there to the actual start of the project, a short time passed: two excellent names of the EAD team, Masamichi Abe and Shigefumi Hino (the man who, among other things, invented Yoshi) were commissioned to direct it. The game was released in 2001, a few weeks after the Japanese launch of the GameCube, and left many people unhappy: Pikmin was blamed for not being the absolute masterpiece that many expected, after enduring, for the first time, the launch of a Nintendo console without a Mario game. In short, it failed to be the ~next big thing~ that both the players and the press were waiting for; yet it was, in hindsight, the title that best managed to embody the Nintendo Difference heralded in those years. Pikmin is a game accessible to everyone, but suitable for few: there are no castles to conquer, monsters to kill or levels to complete, it doesn't inject adrenaline, but above all it doesn't exalt. In recent years we have been witnessing a continuous trivialization of the epic, which has now become one of the simplest and most immediate means of gaining a hold on the public: Pikmin has none, it is a bucolic video game, a haiku. In the Nintendo work you take command of Olimar, an eight-centimeter alien who, following the impact with a small asteroid, ends up in an unknown planet quite similar to Earth. His oxygen reserve allows him to survive for only thirty days (twenty minutes each, so the adventure lasts about ten hours), during which, in order to leave again, he is forced to find the pieces of the spaceship lost in the 'accident. To help him in the enterprise there are tiny native living beings, the pikmin in fact. Having to give the game a label, it could be defined as an RTS, although the central part entrusted to Olimar differentiates it a lot from the other exponents of the genre: rather than impersonating an omniscient deus ex machina, you control someone who has the power to command many others elements, so the evolution of the story is followed in a much more direct and physical way. New Play Control Pikmin is divided into four main areas, within which the thirty pieces of lost spaceship must be found; each of course is well differentiated from the other, both as characters and as vegetation, and constitutes a real micro world. Olimar is not only the commander of the pikmin, but also the ~person~ who must multiply them: to achieve the set goals you need to manage your time well, alternating the exploration phases with those intended for the creation of new pikmin. The fastest way to expand your troop is to bring the killed enemies back to the base which, inserted into the appropriate machinery, generate new pikmin to be extrapolated from the ground. These little beings designed by Nintendo are divided into three categories: the red ones, the most common and strong in combat, the yellow ones, the lightest and capable of carrying explosives, and the blue ones, the only ones able to survive in water. Olimar can command his minions in a variety of ways: moving them en masse, pulling them individually to the top of some ledge, leaving them alone somewhere. The wiimote has certainly helped to streamline the operations: if before the control stick was used for both the movement of Olimar and that of the pikmin's viewfinder, now the latter is managed through the remote control pointer, so as to be able to perform multiple actions simultaneously. No addition that justifies the purchase of the title if already played on GameCube, however the wiimote and nunchuk pair has been able to file the control system, bringing only advantages. Pik-Pik Pikmin, in addition to being an extremely refined video game, is also the only Nintendo series that pursues a certain aesthetic: unlike Mario and, partially, Zelda, untying Pikmin's gameplay from its habitat would mean completely distorting it. The bucolic, relaxed atmosphere, the dol settingce but at the same time ruthless (as only nature can be) is the true protagonist of Pikmin. The events do not influence the ticking of time, which inexorable and neutral alternates between day and night. Even the ~enemies~ are nothing more than carnivorous living beings placed in Olimar's path, who hinder him to survive, unaware of his mission; the cycle of life reigns supreme over all, with cut plants reborn, insects returning, pikmin leaving their seeds in the places where they died. Death, just her, silent and alien to many Nintendo games, is constantly present in Pikmin: presented without filters or particular emphasis, it comes to the fore every time you have to sacrifice a member of your troop, every time the pikmin moan in the water, every time, leaving the level for the night, we see them lost being eaten by animals. The atmosphere of the game, created through a beautiful soundtrack and excellent graphics, still remains evocative and powerful today, both because Pikmin was and is a unique title, and because, also due to the developers' fault, the Wii presents few games visually superior. Comment Pikmin is a game accessible to everyone, but suitable for few. Devoid of excesses and based on an adorable bucolic atmosphere, it puts the player in contact with the neutrality, beauty and ruthlessness of nature as few other popular works, in the video game and beyond, can do. The short length of the adventure, about ten hours, is both its main limitation and the characteristic that makes it unique both with respect to the sequel and, probably, to the sequels to come; however, the doubt that Pikmin's mechanics are more suitable for a story like this than a novel like Pikmin 2 is still strong. Not recommended only for those who played the original on Gamecube: the Wiimote improves the controls, the saving system is less ruthless and there is the 16:9 option, but the experience remains practically unchanged. Pros Unique and original, even after seven years Aesthetically refined Bucolic atmosphere beautifully evoked Cons Lasts (about) ten hours Controls via wiimote are better, but do not revolutionize the experience", "date": "2009-02-16", "grade": null}