{"name": "Mystery Case Files: MillionHeir - Recensione", "ref": "https://multiplayer.it/recensioni/mystery-case-files-millionheir-recensione.html", "text": "For those unfamiliar with Mystery Case Files, a brief presentation is in order: it is a series of created by the American Big Fish Games whose gameplay is fundamentally based on the ~glance~, or on the identification of objects within 'within highly populated and complex scenarios. In short, a highly ~casual~ product which in many ways refers to the philosophy of the ~touch generation~ and which was therefore highly anticipated by Nintendo DS owners. It is no mystery that the peculiar input system of the dual-screen portable console returns a feeling very similar to that provided by common mice, and in this sense Mystery Case Files: MillionHeir behaves in a commendable way, using touch in the best possible way screen and even introducing the ~puff~ in some phases of the investigation. An investigation that, in this episode, will see us investigate the disappearance of an eccentric millionaire... Each of the locations is extremely chaotic and overflowing with objects, but we will have to be able to identify only those that interest us. Where has Felice E. Prospero gone? Once the game has started, the super-computer that assists us in the investigation will show us which characters to ask questions to understand what happened to Mr. Prospero. Being a ~visual~ puzzle game, we won't have to deal with dialogues like in any Ace Attorney episode: the action consists in solving some ~scenarios~ which automatically translates into the collection of clues and information. Each of the locations is extremely chaotic and full of objects, but we will have to be able to identify only those that interest us and that appear in the list located on the right side of the upper screen. It is possible to ~navigate~ the scene using the stylus in dragging mode or by acting on the d-pad, so you have to ~tap~ on the objects in the list to locate and delete them. The interface on the touch screen shows us an icon for help (there are limited numbers), which allows us to quickly find an object, and one to access the inventory of tools. In addition to the ~regular~ magnifying glass, in fact, we can use an x-ray viewer, diving goggles, a flashlight or our hands. All tools that prove necessary in numerous situations, also because continuing through the stages we will begin to come across different lists than usual: the objects marked with an asterisk are found behind other objects and therefore must be identified using the x-ray viewer, while sometimes we will have to use your hands to interact with the scenario and get what is written on the blackboard (~slice~ a piece of bread, ~cut~ a watermelon, add details to a drawing, etc.). At the beginning of the game we will be able to select the challenge level: the lowest one will give us a relaxing experience, given the lack of a time limit within which to find all the objects, but in any case the presence of the aids will constitute a sufficient element to not never get in serious trouble... The nose of the investigator Although the main phases of the game, i.e. the identification of objects, represent the fulcrum of the gameplay and gradually acquire greater depth and complexity, Mystery Case Files: MillionHeir also offers a nice side dish. At the end of each search, in fact, we will have to face a small puzzle game that will unlock the revelations about the character we are investigating. Similarly, we will also have to pass short minigames to detect fingerprints or carry out DNA tests: in the first case, we will use the stylus to spread the telltale powder on the object, then we will have to blow into the microphone to remove it; in the second case, we'll be dealing with a classic puzzle game, in which columns made up of colored spheres rise up the touch screen and our goal will be to eliminate elements of the same color for enough time to complete the test. The story, divided into chapters, is quite intriguing thanks to the introduction of a large number of characters. It is clear, however, that at some point we will have already seen all the scenarios and perhaps identified the most important objects, which will make searches easier. Despite the huge number of things to find in each location, in fact, it must be said that the game insists a little too much on the same lists instead of changing them frequently. Technical realization Given the great experience of Big Fish Games with the Mystery Case Files series, it is clear that this first episode for Nintendo DS is already mature in terms of interface and style: the first is arranged in a very rational way and is always readable , the second is not crazyre but it cannot be said that it is immature. The locations, the real protagonists of the game, are quite numerous and show such a well-represented confusion and complexity that it even seems plausible. It will not be uncommon to find round objects stuck on other round objects to better conceal themselves, as well as fruit, vegetables and anything else with different colors or stylized representations to deceive the player. To give a trivial example, if we find the word ~apple~ on the list of objects to find we will expect something small and red, while in reality the apple could be green or it could simply be a drawing on a blackboard. It must be said that the scrolling of the scenarios on the touch screen is not very fluid and unfortunately suffers from a certain ~tremor~, something perhaps attributable to the quality of the DS screen but which in fact prevents the identification of the objects unless the image is not still. The sound is made up of really nice and spot on tunes, which immediately enter your head and have the great advantage of not annoying during the research sessions. Finally, the localization in Italian has been done really well, despite the intrinsic difficulties of this kind of product: applause to those who have dealt with it with such care and attention. Comment Mystery Case Files: MillionHeir is a product that adapts perfectly to the characteristics of the Nintendo DS, and despite the clear ~casual~ connotation it is fun and engaging even in the eyes of those who generally try their hand at more serious and demanding titles. In short, we are faced with the classic simple but exciting puzzle game, which you pick up to dedicate just a few minutes to it and then you realize that many minutes have passed. The touch screen has been used very well, even the fact of occasionally blowing into the microphone takes on natural connotations and integrates perfectly with the gameplay. Bearing in mind the limitations of this type of game, it could be said that the first episode of MCF for DS has very few flaws. Among these there is undoubtedly the low level of difficulty, but also the not always rational cycling of the objects to be identified on the same scenarios. For the rest, there's little to say: if you're looking for a nice, light and fun game, Mystery Case Files: MillionHeir is probably the one for you. Pros Simple and fun Good number of characters and locations Great use of DS features Against Pretty easy Bad graphic style Object search sometimes repetitive", "date": "2009-02-09", "grade": null}