{"name": "Devils and Demons", "ref": "https://multiplayer.it/recensioni/devils-and-demons_a.html", "text": "~When one war ends, another begins~, or so says the trailer of Devils and Demons, a new title from HandyGames announced a couple of months ago and now available for Java-compatible devices. The story behind the game is about an invasion from the realm of darkness: hordes of devils and demons that pour into the earth, destroying everything in their path. From the rubble, however, three extraordinary warriors emerge, intent on avenging their families and all the victims of the war: Khazum the earth shaker, Casseija the daughter of the Sun, Morlum the master of the wind. Each of these individuals has unique abilities: the first can handle large and heavy weapons, even causing earthquakes; the second is quick and agile, and can fight both from close and from a distance thanks to the crossbow; the third is a wizard capable of casting powerful spells but also of wielding his staff in close combat. Whatever the chosen character, we will have to face a total of almost fifty stages full of monsters of various shapes and sizes, with the aim of eliminating as many as possible. The game offers us two modes: campaign and arena. The second is just a pleasant extra, a sort of survival mode in which you have to face a large number of enemies within a closed scenario and survive as long as possible to unlock the next locations. The campaign, on the other hand, constitutes the fulcrum of the new HandyGames production: once we have chosen our character from the three available, we will find ourselves facing a sequence of stages with different objectives from time to time. In some cases we will simply have to eliminate all the enemies present, other times we will have to reach areas of the map and perhaps defend them. The combat system is very simple and is basically based on pressing the 5 key, through which our warrior can strike with the equipped weapon. The left soft key is used to change the weapon, the 0 key opens the pause menu and finally the 1 and 3 keys activate the special attacks. Killing demons earns us points which it is then possible to spend to improve the characteristics of our character, a possibility which, combined with normal leveling (typical of role-playing games), makes the warrior ~grow~ and makes him stronger as we progress through the internship. In practice, the clashes take place in a trivial way: you have to get close to an opponent just enough for our weapon to touch him, then keep hitting until his energy bar runs out. Similarly, our alter ego is subject to attacks and his energy is represented by a container located at the top of the screen, which can be restored by collecting bonuses scattered around the map. Technically, unfortunately, Devils and Demons does not make a miracle cry. Let's be clear: the HandyGames title is made fairly well, but in recent times much more complex and sophisticated titles have been seen on mobile phones. The action is shot from above, with a three-quarter view, and the characters have a fairly varied set of animations thanks to the two main weapons as well as special attacks. The enemies are divided into different types, but their design moves between ups and downs: some are well done, others terribly trivial. Finally, the maps turn out to be basically bare, poor in interactive objects and even repetitive in the filling elements: from this point of view, much, much more could have been done. The sound consists of a series of anonymous MIDI music, which adds nothing to the game action and can therefore be largely deactivated. PRO Three different characters Good number of internships Decent upgrade system AGAINST Simplistic fights Limited and repetitive action Technically just average", "date": "2009-02-12", "grade": "S.V."}