{"name": "Fallout 3: Operation Anchorage - Recensione", "ref": "https://multiplayer.it/recensioni/fallout-3-operation-anchorage-recensione.html", "text": "It took some time before the mechanism of micro transaction expansions on Xbox 360 meshed well, but now the practice is well established and practically regular for thicker titles. Even Bethesda, despite its experience gained with PC games, seems to have proceeded gradually, first experimenting with mini-expansions that have almost scandalized the gaming population - such as the good old Oblivion ~horse armor~ - then arriving at convincing experiences and rich as ~Shivering Isles~ always on the fourth episode of The Elder Scrolls. Given the know-how acquired, it was reasonable to expect such a treatment also for the new, mammoth RPG of 2008, or Fallout 3, a game with such a broad appeal as to push Microsoft to act in advance and ensure as many as three exclusive expansions for the own platforms. And so, from January to March, interest in the Bethesda game will continue to remain high even after the story is over, thanks to the three additions scheduled on a monthly basis, the first of which is precisely Operation Anchorage. The biggest problem for the introduction of an expansion in Fallout 3 was of a logical order: how to insert a new piece of history in a complex and structured world like that of the RPG in question, without creating holes and inconsistencies in the virtual world so accurately reproduced? The stratagem adopted by the developers was therefore ingenious: to transport the player far in space and above all in time, with respect to the events of the main quest of the game, thus releasing the additional story from the contingency of the ~present~ of Fallout 3 and thus having free to tell a new episode, with a new setting, but without affecting the solidity of the general atmosphere. The chosen episode is therefore part of the game's background, telling one of the key episodes of the war between the United States and China that led to global atomic destruction: the liberation of the city of Anchorage. The liberation of Anchorage As soon as the expansion is loaded, we are joined in the game by a mysterious radio signal coming from a group of renegades. Going back to these, we first find ourselves freeing the area from a group of super mutants, and then exploring the military base being researched. Inside this structure, we learn that the group has discovered an old weapons cache dating back to the period of the war between the USA and China, but to access it it is necessary to complete a complex virtual reality program, or a simulator that reproduces the battle of Anchorage, which occurred during that war. Obviously, the ideal candidate for the mission is the player himself, who inserted into the device suddenly finds himself thrown into the year 2066, in the cold of Alaska on the outskirts of Anchorage. The aim is to complete the 4 assigned missions that allow American troops to regain control of the city in question, eliminating some strategic objectives behind enemy lines. The first impact is immediately decidedly different compared to what the world of Fallout 3 has accustomed us to: a mountain scenery surrounded by woods in the distance and snow and ice everywhere that surround us in a setting that recalls a mix between Goldeneye and the first Metal Gear Solid, while the game structure itself finds a substantial variation towards tight action. Between stealth phases and furious fights we sometimes find ourselves lost within a game that recalls Fallout practically only in the use of the Pip Boy and the VATS system, given that the historical digression places us in a fully military and combative climate, cutting out many of the purely RPG features normally present in the Bethesda game. A different approach It is not only the story, in this expansion, that is detached from the normal context, but also the gameplay itself is characterized by a fundamentally different approach. Being a simulator, we find ourselves inside a fictitious reality, a game within a game, which responds to different rules. It is basically about eliminating the enemies until the objectives of the various missions are achieved, with a minimum of strategic management of the support team that accompanies us in the operations, of which we can choose composition and equipment. There are therefore new procedures to follow: the available arsenal is chosen at the beginning of each mission and cannot be changed at any time, eliminated enemies disappear as befits artificial intelligences within a simulator, preventing the classic raid of the corpse in search of objects, the collection of ammunition and energy is structured in collection points with real distributors, such asis more suited to an action game than to a complex RPG like Fallout 3. Overall, we are faced with an action digression, which finds the common thread with the main game only in the advancement of the level of experience, which also persists in Operation Anchorage (in case the level cap hasn't already been reached, obviously), and in the rich final loot, to be conquered at the end of the simulation and which obviously can be exploited more extensively if we still have quests to complete within the main story of Fallout 3. Also included in the downloadable package are four new achievements for 100 gamerpoints in total, and a new ability that can be acquired if you manage to collect the 10 briefcases containing strategy documents within the simulator (make sure if you find them all before finishing the expansion). Comment Being more action-oriented, Operation Anchorage seems to neglect what are perhaps the strongest elements of the original experience: exploration is reduced to a minimum, freedom of choice is totally missing and we find ourselves unable to collect objects and weapons in the simulator. Adding a limited longevity that settles between two and three hours of play, the result is a complete picture that is not too exciting. Although the idea behind the expansion is valid (the ~historical~ study) the impression is that of a subdued addition, still placed within a huge game, with which it obviously shares structure and supporting elements. Paradoxically, the fruition seems more suitable for those who have not yet finished the main game, given the possibility of drawing many experience points and the rich loot of weapons that awaits at the end of the quest. It remains to evaluate the need for a new ~dose~ of Fallout 3, according to which 800 Microsoft Points can be a valid expense, or not.Pro A new ~dose~ of a masterpiece Interesting ~historical~ digression New weapons and technologies available Against Definitely short Excessively limited action Too undemanding Xbox 360 - Goals Operation Anchorage contains 4 objectives for a total of 100 Gamerpoints, easily reachable by progressing in the missions and completing the story, without particular hitches or difficulties.", "date": "2009-02-05", "grade": null}