{"name": "Donkey Kong Country", "ref": "https://multiplayer.it/recensioni/donkey-kong-country_a.html", "text": "Original Rare - Seal of Quality At that time, the most famous gorilla in the world had somewhat fallen into oblivion, after having participated as a co-protagonist in the absolute debut of Super Mario in the history of video games. Nintendo decided that his comeback should come with a platformer made just for him. From this point on, the project passed entirely into the hands of Rare, who decided to give prestige to the adventures of the ape using a pioneering graphics technology: the backdrops and characters of this platform were created in RayTracing 3D on Silicon Graphics workstations, starting from models of plasticine. The result was colorful and superbly animated 2D sprites, full-bodied to the point of appearing three-dimensional. An amazing result considering the era and the hardware of the Snes. An event in every sense, the praise from the specialized magazines was wasted; the unforgettable GamePower reserved the cover of December '94 for the title, relegating the special on the imminent Japanese launch of a certain PlayStation to the background. It feels like playing with a Pentium in SVGA, commented Apecar in the review, in the graphics voice. A statement that read today sounds like a sneer, but which back then, with the 486 still on the desks at home, literally made us dream. The gorilla was back, hungry for bananas, surrounded by a clique of hilarious characters, one of which - Diddy Kong - destined to make it big. One hundred levels packed with bonuses, assorted goodies and jaw-dropping graphics. Best-seller even before being published, the success of the title was resounding. A tough platformer, which worthily closed the golden age of the 2D genre. 1995 loomed, the era of polygons and textures was upon us. By completing Donkey Kong Country, there was a clear feeling of having closed a fundamental chapter in one's history of gamers. In reality there was room for Yoshi's Island, a real swan song. If it doesn't have a sticker, which banana is it? At the moment Nintendo has reserved the possibility of buying Donkey Kong Country from the Virtual Console catalog only for Europeans. At the cost of 800 WiiPoints you take home a nice platform, very large and long-lived, challenging (sometimes frustrating if you're rusty), but certainly not a masterpiece. Donkey Kong Country lived much of its success on the wave of technical brilliance that Rare set up, as well as on the reputation of the character. The downside is represented by an interaction between character and backdrops far from the pixel-perfect precision that is appreciated in titles such as Super Mario World or Sonic. The representation of jumping platforms, edges, barrels, overhangs, etc. it's a feast for the eyes, but often puts a strain on the nerves of the player, who rarely feels sure of where he puts his feet. Screen scrolling isn't the best either; directorically speaking, it leaves too much ~air~ above the character's head, sacrificing the lower part of the screen, the most important one, because it allows you to understand where you are going to land with each leap. Shigeru Miyamoto said that DKC is proof that gamers turn a blind eye to mediocre gameplay, if the graphics are great. First crack of a love just blossomed? A sour release and a little over the top, but not far from the truth and still current. This is the story of a broken love. The story of a long distance relationship, and what a distance! 15,000 kilometers: those that separate Kyoto from Twycross, a small village in the countryside of Birmingham, in the heart of England. A relationship that began quietly in the 80s, which resulted in a passion that generated a special offspring, ended with the intrusion of a third wheel. The English girl seduced and abandoned is called Rareware, as you may have already guessed. Back in 1994 the British softco, newly wed, received the task from Nintendo to dust off a really heavy character (in every sense): Donkey Kong. A sign of enormous trust placed in the English by Nintendo, which for the first time entrusted one of its top brands to a developer external to EAD. A practice that has become increasingly common over the years, and not without criticism from those who see the quality standards to which Nintendo has accustomed us in danger.", "date": "2007-02-07", "grade": null}