{"name": "Sexy Party People", "ref": "https://multiplayer.it/recensioni/sexy-party-people.html", "text": "Games with an erotic background have always had the advantage of arousing the interest of users, even in the face of a far from extraordinary overall quality. They also have the fact that to make them you don't need a huge investment of resources: often they are really simple applications, perhaps cloned from existing products, with the simple addition of some spicy images. Let's take card games, for example: who has never tried strip poker? In the eyes of the average gamer, the opportunity to look at a photo of a beautiful girl in scantily dressed clothes is worth much more than any cash prize, especially if purely ~virtual~. And the interest in the stakes makes the games more engaging and fun. In recent times, Twistbox Games has enriched its own catalog with some erotic mobile video games, and Sexy Party People is only the latest addition. The aim of the game, as mentioned at the beginning, is to organize sexy parties with mathematical success. But how is it possible to do this using a deck of cards? The game features three different difficulty levels, which you can set before starting the game. We will therefore find ourselves facing internships of various sizes, with more or less boxes to fill in and more or less ~obstacles~ to make things more difficult for us. The cards at our disposal, placed in the lower part of the screen, represent the various guests of the party who must be positioned in the private room, on the available armchairs. However, it is not possible to place them at random: the colors of the cards must be respected and only match those with identical edges. If one of the cards has yellow upper and right sides and red lower and left sides, it must be positioned so that a card with a yellow lower part is on top and one with a red right part on the left. Never like in this case, practice is worth a thousand words and it is possible to learn the rules of the game in no time. The cards will be removed from the reserve deck and placed at our disposal in groups of three, with the presence of numerous jokers which assume a universal value and which therefore can be used to plug any holes if we do not have the right cards. It is possible to change the position of the cards already placed on the board, just select them again (by pressing the 5 key) and move them wherever we like (using the d-pad on the mobile phone). All this until we place the last card, which will close the game and leave us to the outcome: if the lights go out, we will move on to the next stage; otherwise, we will have to start over, with no possibility of continuing. Every ten internships completed, we will earn an image of a beautiful naked girl, which will be saved in a special gallery accessible from the start menu. As might be expected from what is ultimately an ~erotic card game~, the technical realization is far from spectacular. The developers have created an interface that was legible and functional, caring little about the rest, and in fact the design of the ~characters~ leaves something to be desired. Even the use of colors is not the best, while it is useless to pronounce on the erotic photos to be unlocked, since they are digitized photographs. PRO Simple but tantalizing gameplay A large number of internships... ...and every ten, a welcome reward AGAINST Technically mediocre Maybe too challenging Sometimes frustrating", "date": "2009-01-30", "grade": "S.V."}