{"name": "Il Signore degli Anelli: La Conquista - Recensione", "ref": "https://multiplayer.it/recensioni/il-signore-degli-anelli-la-conquista-recensione.html", "text": "It's strange to think that millions of people learned about ~The Lord of the Rings~ just a few years ago, thanks to the three films directed by Peter Jackson; it's strange because J. R. R. Tolkien's work was published more than fifty years ago, and since then it has not only conquered many fans, but has also fundamentally influenced the fantasy genre and everything that revolves around it. From those pages were born characters, stereotypes and creatures that have become part of the collective imagination. Translating everything into a film trilogy was a complex but decidedly successful job, which brought with it the usual load of merchandising which also includes the various PC and Console tie-ins. Electronic Arts is the house that has best known how to interpret the action component of films on last generation consoles, and its new multi-platform title, The Lord of the Rings: Conquest, stands as a wide-ranging project, strongly oriented towards multiplayer , which contains in its two campaigns not only the pivotal episodes told in the film trilogy, but also a hypothetical sequel in which we control Sauron's forces starting from the question ~what if Frodo hadn't thrown the One Ring into the lava, but had kept?~. characters and performers The structure of the game clearly takes up that of Star Wars: Battlefront, that is, it puts us at the helm of character-types who flank and support the protagonists we all know throughout history. Each of the two campaigns consists of eight stages, in which we will have to complete a certain number of increasingly complex missions, which refer to the events narrated in the films. During the decisive stages, we will be given the opportunity to control the various Aragorns, Legolas, Ganldalf, etc., which differ from normal soldiers due to only slightly improved characteristics. We will always have to keep an eye on our character's energy as well as the number of ~lives~ we have left, because in The Lord of the Rings: The Conquest, dying is something decidedly ordinary. At the beginning of each ~attempt~ you are asked to select your soldier's class from among the four available: warrior, archer, mage and explorer. Warriors are the best characters for hand-to-hand combat, they have a multitude of combos available to perform with the sword and an additional energy bar dedicated to special attacks. They can throw an ax at enemies as well as parry their blows. In this case, the Dual Shock 3 Square, Triangle and Circle buttons are used respectively to execute light, medium and heavy slashes, to be combined in various ways to obtain more or less effective sequences. Archers are the best characters for ranged combat, also thanks to the ~zoom~ function that allows them to strike from far away. They cannot parry blows, therefore they are extremely vulnerable in hand-to-hand combat, but they have three special attacks (each regulated by a special bar that recharges over time) which allow them to hit multiple targets simultaneously (L1 key), shoot poison arrows (Triangle key) or explosive arrows (Circle key). If they are reached by an enemy, they can kick him to the ground (Square key) and then move away. Wizards represent a good compromise in terms of attacks, which are very varied, but have little physical resistance. They can throw lightning bolts that can hit several targets, heal their teammates, create a barrier that repels arrows, cause a shock that displaces enemies or a ring of fire that continues to burn for a few seconds and does a lot of damage to whoever is in it. find in the middle. They also have a decent ability to fight in close quarters, thanks to their staff, but they cannot parry. Finally, the explorers represent the ~ninjas~ of the situation: by holding down the L1 key they can make themselves invisible (this skill is regulated by a special bar, as usual) to reach their opponents from behind and kill them with a single blow (R1 key), they have decent combos for hand-to-hand combat as well as an explosive charge that they can launch if necessary. They have the ability to parry blows. In all cases, the health bar is ~fixed~ and cannot be restored except by collecting the ~light~ that some enemies leave on the ground after being defeated. One ring to rule them all As mentioned at the beginning, The Lord of the Rings: Conquest offers an online multiplayer of a certain thickness, for sixteen players, which works using EA Nation's servers (it is necessary to subscribe to the service, which on PS3 is still freetuition) and offers three different modes: ~Team Deathmatch~, ~Conquest~ and ~Capture the One Ring~. In the first case, after selecting the faction you belong to, you have to fight the opposing team until you reach the score necessary to achieve victory. Timed respawns will be triggered every time you die and you can select a different class. The ~Conquest~ mode works a bit like the famous ~Annexation~ from Gears of War, i.e. you have to conquer the greatest number of territories within a map by making the character stop near flags until the team color is acquired . At the same time, you need to defend your territories from the onslaught of opponents. Finally, the ~Capture the One Ring~ mode is nothing but the classic ~Capture the flag~: you have to collect the ring (or snatch it from the clutches of your opponents) and take it to the enemy ~base~ to win each round. The quality of the matches is good, and even in the presence of pings that are anything but exciting, you don't notice who knows what lag, indeed things go all too smoothly. More than anything else, a good voice chat is particularly missed: the quality of the conversation is rather mediocre. In this way, a large part of the strategic component is missing, which instead becomes necessary to be able to better manage the clashes: the various classes of characters should act in symbiosis to fill their gaps, instead we are reduced to solitary assaults that leave time that find and break up the action absurdly. At least for online multiplayer, the developers could have opted for a rechargeable energy bar over time if you don't take hits, because when our character is dying, there are very few chances to survive. Technical realization One of the strengths of the game is certainly its ~presentation~, understood in this case as a mix of elements that recall the trilogy of ~The Lord of the Rings~: the introductions are peppered with filmed sequences taken from the films, the locations are very faithful and the music is the original ones. Moreover, the Italian edition boasts a really well done localization, with a Pino Insegno (who gave voice to Aragorn) in great shape and a rather high general quality, apart from some interpretations that are too ~light~ and out of context. As for the sound effects, there are really excellent ones among the ~ambient~ ones, while the noises of close-quarters clashes leave something to be desired. Moving on to the graphics, unfortunately there is little to be impressed by: the locations are quite large but relatively poor in terms of the number of polygons on the screen, the textures are far from defined and the frame rate is subject to continuous drops and uncertainties. The characters are divided into the four types mentioned above, but this becomes more of a limitation in the variety of models, with the soldiers who are all identical to each other. The animations are decent, but nothing more: sometimes good, sometimes too woody. Finally, the management of the view is bad: you have to manage it completely manually, and during the fights this is anything but simple, only increasing the sense of confusion. Comment The Lord of the Rings: Conquest is a title with enormous potential, which however does not materialize in practice. The epic atmosphere and the references to the movies are all there, and if you want you can accept the general lack of imagination in the composition of the missions, but when you get to analyze the substance of the gameplay you are inevitably disappointed: the combat system is too confusing and ~slippery~ (see the management of parries, for example), the characters have very evident limitations and there are literally holes in the game design that prevent us, for example, from overcoming trolls and giants when in command of warriors and explorers, forcing the use of archers or, at worst, wizards. The fact of taking damage even when you are about to go down or even when you are on the ground, unable to defend yourself or move, is really frustrating and goes with a ~wrong~ conception of matches, which end up being a set of ~attempts~ where instead planning and strategy could be rewarded. Finally, we must take into account a very ~sharp~ difficulty balance, capable of putting us in difficulty even at the easiest level. In short, this new production by Electronic Arts has defects, and not a few: fans of ~The Lord of the Rings~ maybe they will be able to pass over it and enjoy an experience that still proves to be substantial and compelling, the others would do better oriemove towards a less ambitious but more successful action game. Pros Excellent sound compartment Two challenging campaigns Interesting online multiplayer Against ~Slippery~ and confusing combat system Fragmented and often frustrating action The graphics could have been much better", "date": "2009-01-22", "grade": null}