{"name": "Assassin's Creed Valhalla: L'Ira dei Druidi", "ref": "https://multiplayer.it/recensioni/assassins-creed-valhalla-lira-dei-druidi-recensione.html", "text": "The wait was longer than expected, between uncertainties and postponements, but in the end we are dealing with the review of Assassin's Creed Valhalla: The Wrath of the Druids, the first expansion for the Ubisoft title that takes us on a new journey, this time in the green and rainy lands of Ireland. Eivor is in fact called to Dublin by his cousin Barid, who has become ruler of the city but not without contrasts and desperately seeking the support of the supreme king Flann. A threat, however, moves in the shadows: they are the mysterious Sons of Danu, a sect that descends from the ancient Druids and aims to distort the established order. History Assassin's Creed Valhalla: Wrath of the Druids, Azar will allow us to visit Ireland. The Wrath of the Druids becomes accessible already after completing one of the two narrative arcs of Assassin's Creed Valhalla: the expert trader Azar visits Ravensthorpe to create new trades and gives Eivor the letter from the cousin he thought he had lost long before that, Barid, who after settling in Ireland undertook to grow a modest settlement called Dublin. Having become a small city that shares both Viking and Christian traditions, the future Irish capital is the first place we will visit after the inevitable sea crossing. Unfortunately, the timing of the narrative appears a bit hasty, and so the initial stages of the new campaign are ramshackle and inconsistent. Assassin's Creed Valhalla: Wrath of the Druids, a parade of Irish regents. The problem is that even going forward in the almost twenty hours guaranteed by the expansion, between the main story and side missions, things don't improve and some expedients used know they have already been seen; obviously starting with the umpteenth sect whose members we will have to identify and eliminate, referring to the classic Order board. There is also the romance element with the beautiful Ciara, but even here there are few surprises. Were we to qualitatively place the Wrath of the Druids quest among the many sagas present in the basic campaign of Assassin's Creed Valhalla, the positioning in the ~ranking~ would be far from the highest positions. The potential is there and some sequences remain very beautiful (see the song in the initial stages), but the characters and situations could certainly have been managed in a better and less predictable way. Setting Assassin's Creed Valhalla: Wrath of the Druids, the Irish setting boasts beautiful landscapes. The situation relating to the setting is different, which shares the strengths and weaknesses of 9th century England that we were able to visit in the base game: where the urban settlements turn out to be poor and meager due to the inevitable architectural limitations of the period, some breathtaking landscapes literally breath taking and from this point of view Ireland fears few comparisons. The map is quite large, the traditional sync points are mostly mountain peaks but exploration does not prove difficult due to the differences in altitude or rivers . When the sun is high, the colors are splendid and you are truly in the midst of wonderful postcards, absolutely to be captured with the Photo Mode. More often, however, it happens that it rains or that there is a thick haze that dilutes the charm of the scenery. Structure Assassin's Creed Valhalla: Wrath of the Druids includes missions very similar to those of the base campaign. Exploration also represents a key element of the experience in this case and is functional to the structure of The Wrath of the Druids, which will see us gradually discover new settlements to be cleaned up, conquered and restructured to serve as commercial exchange centers with Dublin. A mechanic that in the city finds further confirmation in the expeditions of Azar, limited however to a mere delivery of resources to raise the level of the settlement. Beyond this, the main missions are supported by dozens of recovery or elimination tasks that we will necessarily have to face things in the middle of the campaign, in order to obtain the favor of king Flann (it is no coincidence that they are called Royal Requests), and which are inevitably less compelling than what has already been seen in Valhalla. Gameplay Assassin's Creed Valhalla: Wrath of the Druids will see you mesmerized observing the scenery on multiple occasions. In short, the variations on the theme are few and lead to the supernatural: the Sons of Danu use a mysterious mist that creates hallucinations and makes creatures such as werewolves or the powerful Balor alive and concrete, which we will be able to challenge by completing certain tasks to get hold of a spear legendary, but in general the gameplay does not differ from what we know well. The Wrath of the Druids problemit is not so much its being an inevitable more of the same, which is absolutely legitimate considering that it is a simple expansion, as the lack of a balance of difficulty that makes the adventure minimally demanding for those who have already completed the original campaign and have of something like a hundred hours of experience on the rump. Assassin's Creed Valhalla: Wrath of the Druids, Eivor and Ciara after defeating a druid assassin. The system automatically adjusts the level of enemies (default 55) to our abilities, but in fact a fully upgraded Eivor has no problem slaughtering anyone who gets in front of him, whether they are druid summoners, fire eaters, Irish hounds or precisely monsters linked to Nordic folklore. Therefore, if you have completed Valhalla, we suggest you increase the degree of challenge so as not to transform this expansion into a trivial walk. We have mentioned some of the innovations on the opponents' front, but there is clearly no shortage of equipment linked to the Irish territory, obtainable by completing the various missions and extra quests, as well as some exclusive Talents and Abilities, which further improve the protagonist's characteristics and allow him, for example, to summon a hound as support in battle or to throw a powerful headbutt that stuns enemies. Technical realization Assassin's Creed Valhalla: The Wrath of the Druids, Ciara awaits us at the edge of a stream. Wrath of the Druids generally confirms the excellent work done by Ubisoft Montreal with Assassin's Creed Valhalla, and although there are some glitches there is no doubt that the Irish setting is fascinating and evocative, with some extraordinary glimpses when moving between the hills and a lighting system that literally makes the good and the bad weather. The new characters are not exceptional and give a bit of the feeling of having been baked by a simple editor, in particular Ciara, but even here the light can change everything and there are sequences that really look like night and day based on the contrast. However, don't expect scenes with lots of soldiers in action, also because here the sieges and raids are few and not particularly spectacular. The goodness of the optimization on PC is not discussed, the options are those we talked about in the Assassin's Creed Valhalla review and with an RTX 3070 you can play without problems at a stable 60 fps with a resolution of about 1800p (i.e. 4K dropped to 80% using the scaler) and with all graphic presets set to maximum, with the only exception of antialiasing. We have already talked about the excellent dubbing in Italian, which however in the Wrath of the Druids expansion suffers from some uncertainty too much in the initial stages, at least as regards the supporting actors, and adds further vagueness to a narrative sector which, as mentioned, does not shine in terms of timing, ideas and characterization.", "date": "2021-05-12", "grade": "7.5"}