{"name": "Le missioni di Sam Power", "ref": "https://multiplayer.it/recensioni/le-missioni-di-sam-power.html", "text": "Sam Power Cop, Fireman and Repairman Mission is available for Nintendo DS. After having dedicated ourselves to that avalanche of passions that the multifaceted Giulia has been able to interpret on the DS of all the girls in the world, Ubisoft is back in the fray with the missions of Sam Power, a character dedicated directly to the hitherto neglected male user of young enough age to can be described as childish. It does so with three titles, at least for the moment, which will allow children to identify themselves with heroes traditionally more suited to them than a female protagonist engaged with babies to look after or horse riding competitions to win. Sam Power has for the moment, in fact, three missions: that of policeman, fireman or repairman. Professions (which, curiously, to adapt to a male imaginative become ~missions~) which are typically addressed to the fantasies of boys, thanks to the almost heroic connotations of the protagonists of the same, always aimed at saving others from dangerous situations or simply fixing what which breaks down, automatically ending up on the good side. At least as long as we remain in children's fantasies. When I grew up I wanted to be a firefighter! All that remains is to choose which of the three available professions is the one we want to interpret. Choosing, yes, on the very personal basis of the predisposition and sympathy towards one more than the other, the only tool of choice that really makes sense. The three games are in fact, in reality, absolutely identical down to the smallest detail, even in the dialogue options of the missions, except for the skins and themed settings depending on the profession that has been chosen. Technically and in terms of content, they are photocopies of each other, so it is useless to purchase a second title if you already own one of the three in the series, except for collecting ambitions that are unlikely to fit this kind of product. For the love of that little dragon Gris who so wanted to be a firefighter, let's take Sam Power's mission as a basis for our review which leads him to put out fires and save kittens from trees, it being understood that the remaining two professions are the same in terms of mechanics. All three games are immediately presented in their nature as titles intended for an extremely young audience and, consequently, rather elementary both in their management and in their contents. The options simply allow us to choose whether the stylus will be used by a right or left handed person and to change the language, nothing more. Access to the actual game is as immediate as you can imagine, with the simple choice between an adventure mode and an action that differ substantially only in the fact that in the adventure mode, between one mission and another, a dialogue that illustrates the context of the mission. The action mode skips the passage with feet together and jumps directly into the level to face. The starting point of the game in adventure mode is traditionally the fire station (or the police station, or the workshop), from which we will be able to talk to the boss to accept the missions in sequence or access the garage, in which to change any components vehicles with accessories earned by completing missions with the maximum stars available. Mermaids and blue lights The missions are divided into two parts: the first involves reaching the place where our help has been requested, the second takes place on the place itself. The first part is characterized by driving the appropriate vehicle, whether it's the fire truck, the police patrol or the repairman's canon, avoiding the traffic and collecting the stars scattered along the lanes. Basically we will simply have to move from one lane to another and, if necessary, turn on the vehicle's siren to move the other cars. The commands are entrusted to the stylus through which to turn the steering wheel, but the imprecision of the latter makes everything much more manageable by switching to the classic controls: a tap on the directional cross is sufficient to change lanes, in a much simpler way and effective. If we complete the path, which is rather short, without excessive penalties and within the time limit, we will move on to the actual mission, earning a star. The missions are basically sequences of mini-games, during which we will have to put out fires, track down criminals or hammer nails, in a handful of variants that will be used to earn stars to buy vehicle accessories. Pretty basic, basically it's about clicking here and there on the screen or blowing into the microphone with no real possibilityfailure ability, their repetitiveness makes the game decidedly first of surprises. Longevity is equally limited: a couple of hours were enough for our adult fingers to finish it. The graphics are simple and cartoony, very nice and winking for the eyes of a child, very pleasant. The sound accompanies the game well which is entirely in Italian, both in the dialogues and in the sound replicas of the texts that are proposed on the screen, certainly in aid of the little ones who will be able to play even if they have not yet mastered their reading skills. Comment This Sam Power trilogy can certainly be considered the answer with the pants to the skirts of Giulia's passions, despite being on average dedicated to an even younger target. A pleasant pastime for children who dreamed of being firefighters, certainly too elementary and without a complex structure to be able to attract slightly more mature kids. Colorful and fun, it is certainly a product that you can safely place in the hands of your youngest children.Pros Fun and colourful Elementary, suitable for younger children Against The three titles are almost identical Repetitive and very short", "date": "2009-01-11", "grade": null}