{"name": "Schizoid - Recensione", "ref": "https://multiplayer.it/recensioni/schizoid-recensione.html", "text": "The American developers Torpex Games, thanks to the versatile and intuitive XNA development tool, have created a little jewel of gameplay, published on that cauldron of ideas, new titles and remakes that responds to the name of Live Arcade. The Microsoft digital delivery service has in fact given a jolt to small developers, putting them in a position to be able to work and above all publish games that otherwise would never have seen the light of day in the retail market. The limitation of space occupied has meant that most of the titles have sought in the gameplay, rather than in the technical realization, a certain individuality and freshness. This is also the case of Schizoid, very simple both from a conceptual and a graphic point of view (although it is very pleasant to see), but decidedly demanding from a mental one. The basic idea is this: there are two creatures on screen, one red and one blue, which can eat creatures of their own color and are hunted by opposite ones. Schizoid is heavily related to multiplayer, where each player controls an on-screen creature, trying to protect their partner to advance from level to level. Matter of feeling The relationship between player one and player two has never been so close and symbiotic. In Schizoid it is necessary to constantly stay close, defend each other and play in pairs to complete each single level. Schizoid's gameplay is as simple as it is difficult to explain in words. It is a brilliant mix between Pac-Man, Shiluette Mirage of Treasures and some elements of Super Mario Bros, but first things first. It takes from the Namco title as with our creature we have to ~eat~ all the opponents on the screen, and the eggs they lay. Each level is only passed once the enemies are exhausted and we've taken them all. It gets its title from Treasure because the color is the predominant part of the game mechanic: blue eats blue, red eats red, each can be killed by the reverse color. It also takes from Super Mario Bros as regards the enemy artificial intelligence, which is more of a simple but effective script, the same one that had the ghost in the Nintendo title. Everyone remembers him: when we turned around, he attacked us from behind; when we looked at it, it froze. Similarly, in Schizoid, red creatures run away when the blue player steps in front of them, but attack when red is left alone. This is why you need a great feeling in multiplayer, so you stay as close as possible and eat each other's opposite colors. It's good to play together It's nice to play together: the good old and original motto at the base of the Xbox philosophy is fully respected. There are over a hundred levels to complete in co-op mode, both locally and over the internet via Live. Alternatively, it is also possible to play alone, with two different modes. The first is called Uberschizoid, in which we have to control both spacecraft with the simultaneous use of the two analog sticks: a decidedly demanding challenge, which requires considerable coordination and instantaneous reflexes. An excellent method to engage both hemispheres of the brain simultaneously, in short. The second option for the single player is to get assisted by a computer-controlled BOT. The artificial intelligence is excellent, and our virtual companion almost never leaves us in difficult situations, and does not die in stupid or trivial ways, but the fun is inevitable rather quickly. As you progress through the levels - all different, both in design and size - power-ups and special items are added, such as those to travel faster, or the barbed wire, a sort of weapon that is stretched between the blue and red spaceships , killing all enemies that pass through it. The use of explosive smart bombs and the like is also discounted, of course. The additions serve to give freshness as you progress, as if there were any need: the enemies are of many species and varieties, as well as the levels, very heterogeneous and intriguing. The design is averagely good, sometimes superficial in some levels (too simple), sometimes brilliant in others (well adapted to cooperative). The audio sector, rocking, has a good rhythm but remains almost unchanged for the entire duration of the game, a little variety would certainly have helped. Graphically, Schizoid is a simple but well designed title. The style is techno-minimalist, with numerous on-screen effects reminiscent of titles such as Rez or Galaga Legions. For obvious gameplay reasons, the color palette is reduced to the bone: the whole game is red-blue, so as to facilitate visual acuity and reflexes in the players.Comment Schizoid is an intriguing, fun, fast-paced game and well designed to work best in multiplayer. It is a title with simple but deep gameplay, complete with online, local co-op, co-op with bots and single player. The 100 levels available keep the player busy for quite some time, and the variety of situations, levels and enemies (although the actual game is always the same), make you want to play it again and again. In single player the purchase is not recommended. Pros Simple and deep gameplay Addictive multiplayer Long and varied, thanks to many modes Cons Soundtrack ok but too repetitive Some levels are too easy, some too difficult Xbox 360 - Goals Like any Live Arcade game, Schizoid is also giving away the usual 200 points, to be unlocked through 12 achievements. Some are very simple and are obtained naturally, by trying all the modalities or by advancing in the levels. Others need more effort and are unlocked only in particular schemes, in which we are called to obtain super performance. An extreme game, even in the objectives.", "date": "2009-01-06", "grade": null}