{"name": "Real Football 2009 - Recensione", "ref": "https://multiplayer.it/recensioni/real-football-2009-recensione.html", "text": "Waiting for the 2009 version of Pro Evolution Soccer, the battle to crown the best football game for Nintendo DS has only two contenders: on the one hand FIFA 09, a distinctly arcade title that introduces very few new features compared to last year's edition; on the other, this Real Football 2009, which demonstrates right from the start that it has learned from the mistakes of the debut episode and offers an approach decidedly more devoted to realism and strategy. It almost seems like reviewing the ancient duels ago by the EA Sports football series and the first versions of PES, which in fact differed from what had been football par excellence until then due to the greater thickness and the much more simulative approach . From the start menu we will be able to access the various modes: friendly match, tournament, league, penalties, training and multiplayer. Unfortunately, the latter is only present locally, for up to four players, where FIFA has been offering a decent online game mode for some time: it can only be a first point in favor of the Electronic Arts title. Arcade or Simulation? The realistic approach is particularly evident in the relationship between the movement of the players and their response to commands: the ball is thrown only when the movement of the run ends, not in the meantime. On the one hand this makes the action more plausible, on the other it creates great difficulties when you want to carry out a triangulation near the opponent's penalty area. Following the same philosophy, tackles (especially those from behind) turn into fouls in most cases and are punished by the referee, who however does not seem to dispense cards with particular frequency. The management of free kicks is also similar to what we have seen in the various PES, therefore we will not have the possibility to move arrows or other indicators, but we will simply have to adjust the power of the shot so that its angle responds accordingly. It is a more complex method than that of FIFA, but capable of giving greater satisfaction in case of success. Moving on to balancing the difficulty, it must be said that the game becomes quite challenging from the normal level up, although obviously it always depends on the teams facing each other. However, the most interesting thing is the lack of ~corrections~ in the passes and in the movement of the players, i.e. it is possible to miscalibrate a shot and see the ball cross the sideline because our partner was unable to reach it: these are things that in football games they happen less and less often, if you pay attention... Technical realization Graphically, Real Football 2009 is currently the best football game for the Nintendo DS, without a doubt. The developers have done a great job of optimization, with the field flowing smoothly and without uncertainties, good animations and a decent level of detail for the players. They're still not faithful to their original counterparts, sure, but achieving that on the Nintendo DS is probably impossible due to the resolution of the screen. The atmospheric effects are done discreetly, while there are twelve stages available, quite differentiated from each other. Unfortunately the ~touches of class~ are practically absent, the sequences that follow a goal are very few and at the same time the shots at the start of the game are sadly repeated at every match, inviting us to skip them without thinking twice. The touch screen is used to manage the squad and strategies in real time, while the radar is positioned on the upper screen, in a very small and barely visible version. The sound is really essential, without commentary, with little music and only discreet effects. Comment This 2009 edition of Real Football looks really improved compared to last year (but it was the absolute debut on Nintendo DS), making it an excellent second choice if you want a good football game for your dual screen portable console. Why a second choice? Well, while surpassing FIFA 09 from a technical point of view and offering a gameplay decidedly more oriented towards simulation, terribly solid, the Gameloft title suffers from some youth problems and cannot guarantee who knows what longevity. As for the former, there is the terrible bug that nostalgics of the first FIFA for Mega Drive will remember well: when the goalkeeper puts the ball back, it is often possible to stand in front of him with a player and intercept the shot on the fly, to have it bounce directly into net. On the longevity front, however, the lack of online multiplayer weighs heavily but also of weight modes that go beyond the classic tournaments and championships. Notedof the notable improvements compared to Real Football 2008, however, it is easy to imagine that the next episode will be able to make a sensational overtaking without too many problems. Unless Konami decides to commit himself ... Pros Great playability Smooth and well done graphics Engaging action Against No online multiplayer Classic game modes, nothing more Some ingenuity to file", "date": "2009-01-06", "grade": null}