{"name": "Gigi il Guerriero", "ref": "https://multiplayer.it/recensioni/gigi-il-guerriero-recensione.html", "text": "Writing a review of Gigi the Warrior seems almost unfair, because evaluating it as a video game could be reductive, since it is to all intents and purposes a sort of interactive comic, a divertissement that vaguely has the shape of a fighting game, but it is above all a way to have two laughter about Italy and its politics. And it's already funny that while we try to make the latter aware of the need to give space and support to the videogame industry, here comes this project by Simone di Giorgi that is perhaps not the most suitable for a captatio benevolentiae towards the institutions, because he really doesn't tell them and for this reason he is irresistible. It's a coarse-grained satire, which doesn't go into subtlety, but the ridiculously forced parallel between the parable of a certain Italian politician belonging to a certain Movement and the story of Ken the Warrior is truly enjoyable, there's little you can do about it. Of course, the choice of the Buronson and Hara series is smart, because it winks at a generation that grew up dreaming with Ken's adventures and living in the shadow of the Second Republic, which is able to grasp precisely both the quotes from the 'one than the other, here fused together as only in the wildest imaginations in the fumes of alcohol. At the end of the day, the truly playful part almost becomes an accessory, at least during the first game, when one would simply like to advance from match to match to see how the absurd story evolves. Speaking of history, Gigi the Warrior narrates the deeds of a young politician intent on following the path of honesty in a post-apocalyptic world where the government has now fallen and the old parties no longer exist. Initially defeated by the fearsome Knight, who engraves the five stars on his chest, he is saved and trained in combat by the President, who sets him on a path of revenge and redemption to restore democracy in an Italy in disarray, prey to criminal gangs and old tools of politics that aim to cover the role of Emperor. Gameplay: a real button masher In Gigi the Warrior politicians do not have the original names but are easily recognizable The game is all based on clashes between the protagonist and the opponents he meets on the way, through various Italian cities now destroyed and transformed into desert lands. ~However, mankind survived~ and apparently also several politicians, who in the meantime have recycled themselves as more or less lethal fighters and marauders. Introduced each time by amusing skits in the style of Ken the Warrior, the matches have little of the fighting game and much of the button masher without big reasoning behind it: during the fight, three pairs of fists are displayed at the side edges of the screen, which light up red to brief moments. The player simply has to tap his fists when they are red, trying to do it as fast as possible to inflict more damage and avoid hitting late or losing energy. The gameplay is all here and it is easy to see a clear reference to Punch Mania: Hokuto no Ken, the old cabinet that required you to throw real punches at a series of timed targets, inspired by the fights of Ken the Warrior, only that the general effect is obviously very different here, on a small touch screen. The mechanics is extremely simplified and is based only on the immediate reaction to the inputs on the screen, which is also made a little difficult by the poor visibility given by the position of the hands which inevitably cover sensitive portions of the display and everything boils down to a frantic pressure on the hope to hit the shots that appear randomly, not exactly the best of fun. An animated satirical strip Gigi the Warrior, one of the finishing moves directly from Kenshiro's lore The absurd situations staged and the satirical representations of the politicians represent the crux of the matter and are the elements on which all the interest is concentrated, the game is essentially a pretext for having some big laughs by descending directly into this interactive madness between parody of Ken and general mockery of the entire Italian political scene. In this, Gigi the Warrior works perfectly, also demonstrating an artistic direction of a certain thickness, which is based on a beautiful style as regards the drawings and a good ability to adapt the real figures to a completely extraneous context such as the post apocalypse Kenshiro Atomic. We have seen similar operations in the past, even quite enjoyable in their being caciarone like Call of Salveenee or Super Botte & Bamba 2 Turbo, but in thiscase, a greater coherence of vision transpires, emerging more as a product in its own right than a sort of artisan mod, at least as regards the technical realization and style. A touch of class is the overlapping of the Japanese dialogues taken from Ken with the exchanges that the characters address in the interlude scenes, which contribute in some way to creating a mix that works, despite the general absurdity or perhaps thanks to it. Along the same lines, we also mention the sequences with the coup de grce that bear the name of the move in kanji and the montages with the recordings of real speeches by the various politicians used in an often perfectly apt way. In some cases, such as when a certain art critic insulted us in rotation while Gigi performed the typical Kenshiro-style yells, we had a really hard time sustaining the fury of the confrontation given the laughter that the situation provoked.", "date": "2021-09-25", "grade": "6.8"}