{"name": "Gangstar 2: Kings of L.A.", "ref": "https://multiplayer.it/recensioni/gangstar-2-kings-of-la.html", "text": "Grand Theft Auto hasn't arrived on Java-compatible devices yet, so various production companies have been busy filling that gap, with mixed results. The first Gangastar, released in 2006, could boast an excellent technical realization and a game structure extremely similar to that of the famous series created by Rockstar. THQ Wireless and I-play then countered respectively with the mobile reduction of Saints Row and with the innovative Car Jack Streets: in the first case it was unfortunately a mediocre conversion, very cumbersome and limited, which did not enjoy particular improvements with the sequel; in the second case, the developers of the TAG Games team have packaged a title that is in many ways original, above all because of the (real) time management. With Gangstar 2: Kings of L.A., Gameloft therefore resumes the battle exactly where it left off, confirming the goodness of the series and implementing a series of improvements both in terms of technique and thickness. During the early stages of the game, the characters we will be dealing with are introduced, then we move on to the missions: there are seventy-five in total, and they clearly become more difficult and complex as they go. The structure is the classic one for the genre: you have to move from one area of the city to another, with the objectives indicated both on the radar (located in the lower part of the screen) and through flashing arrows. In this sense, the game is always very clear and full of explanations, at least until all the various possibilities are revealed: weapons, shops, vehicles, the combat system, etc. The character is controlled via the d-pad, the 5 key is used to fight, the weapons are selected with the # key while the * key manages the radar indicators. Finally, the 0 key must be held down for a few moments when we are in the vicinity of a vehicle, to steal it. Once behind the wheel of a car, the controls become related to the car and no longer to the screen: pressing the d-pad up accelerates, pressing it down brakes, while steering by pressing it left and right. Compared to Car Jack Streets and Saints Row, the driving phases are much slower and therefore simpler: you manage to come to terms with the commands rather quickly, the traffic is far from dense and collisions are managed intelligently , without causing annoying blocks that are difficult to get out of (especially during chases). Killing passers-by or policemen triggers an alarm at the top of the screen, which in a very similar way to GTA is represented by a series of stars: the more there are, the greater the aggression from the police towards us. In that case, we'll have to leave the ~hot~ zone immediately and wait for things to get back to normal. As for the combat system, we will have the possibility to hit enemies with our bare hands up close or shoot them with various firearms, using an automatic aim that works very well. We will also be able to buy a bulletproof vest to increase our resistance to attacks, and perhaps take advantage of parts of the scenario as shelter during shootouts. The graphics of the game are certainly the best of its kind, and just take a look at the photos to realize the care Gameloft has put into creating the various areas of the city, always full of details and distinguished by an excellent use of colours. There is no shortage of interactable objects along the roads, which are also quite populated by both pedestrians and passing vehicles. The characters boast a good design and smooth animation, while the vehicles stand out for their good variety, even if the rotation of the sprites during the curves hasn't been rendered properly at its best. The touches of class, however, abound: try walking on the beach and you'll leave footprints, while swerving at speed in a car will leave tire marks on the road. Too bad for the sound sector, decidedly subdued: the music is too short and repetitive, the effects are good but really limited in number. PRO Really great graphics Seventy-five missions Thick rich gameplay AGAINST Limited and repetitive sound Maybe a little easy", "date": "2008-12-17", "grade": "S.V."}