{"name": "G1 Jockey 4 2008 - Recensione", "ref": "https://multiplayer.it/recensioni/g1-jockey-4-2008-recensione.html", "text": "At a gallop In this case it is interesting to point out the fact that the dialogues with one's colleagues and collaborators take place through a series of anime/manga style screens with transcribed sentences (in English) that bring to mind other productions purely reserved for the Japanese market, such as simulators of appointments. Once on the track and the race has started, you can concentrate on the real challenge. However, know that controlling your horse is not a simple thing, at least initially, and you will have to get used to taking many factors into consideration, because as mentioned above, it will not be enough to press the joypad keys at random to win. It will be necessary to pay attention to how the reins of the equine are held (through the two analog sticks or via the back buttons) for example, or to understand when the time has come to force the animal for the final sprint, and so on. In case of victory you will be adequately rewarded with increasing prizes that can be used to further customize the jockey and stable, or for other management purposes. The technical realization of G1 Jockey 4 2008 does not make one cry for a miracle, but taking into consideration the type of game and the fact that the title was basically conceived for PlayStation 2, it is not too bad. The polygonal models of the horses and jockeys are made quite well and the textures that cover them, while not representing the state of the art, do their ~job~ well. It certainly doesn't seem like a PlayStation 3 title. The same goes for the animations, well cared for and credible, especially for the horses, as you can appreciate in the detailed television-style replays at the end of the race. As far as the sound is concerned, the KOEI title has good ~running~ samplings and a soundtrack of those that are not unforgettable, but which all in all are liked when they accompany the player in the various competitions, resulting in being pleasant. There have always been very few titles dedicated to the world of horse racing here in the West. From memory of the editor we can think of a few games for Super Nintendo and PlayStation 1, but little else. While in Asia, and especially in Japan, this kind of productions together with train simulators are sometimes among the best-selling games in the weekly charts of the various sector magazines. De gustibus, as some would say. Now KOEI is trying to carve out a small slice of the market in Europe too, counting on a small circle of enthusiasts of the genre eager to finally be able to enjoy a game dedicated to their favorite sport, horse racing. This G1 Jockey 4 2008 we immediately clarify that it is not an arcade in which you just need to fiddle with the buttons of the pad to win the races, but a real simulation of the genre, where you can train hard, study the opponents' tactics and their characteristics as well as manage at best your economic capital are the key elements for the success of a race and progress in the game. In short, to become the number one in this sport, you have to sweat the proverbial seven shirts. Horse Fever The centerpiece of the entire game is in our opinion the Story Mode. In it it is possible to take on the role of a young and inexperienced jockey who, after having attended a race at the hippodrome alongside his father, decides to become a champion himself in the sector. Strange to say, but this mode is very complete and really engaging (provided you love horse racing), with attention to every detail. How it works: at the beginning of the story you will be ~called~ to make a series of choices that will determine the physical appearance, characteristics, personal data and gender of your virtual alter ego. Then it will be the turn of a complete tutorial that will help you get into the mechanics of the KOEI title and which you should follow carefully in order not to run the risk of not fully understanding all the features of the simulator. This section has a well-developed learning curve, even if it can be a little boring in places. Once all this is done, it will then be the turn of the actual races and all that follows (participation in increasingly important tournaments, special competitions, etc.). But, as mentioned at the beginning of the article, the highlight of the product is not only the horse racing event, given that like any self-respecting simulation, the pre-race phase is the one that plays an important role in the racing economy. You need to study graphs and statistics well, the most suitable strategies in relation to opponents and terrain, listen to the opinions of teammates and the coach to learn every secret of the event that you will be facing shortly after. Comment Let's face it: G1 Jockey 4 2008 is not a title for everyone. Indeed, most likelyt, as mentioned before, is aimed at a small circle of enthusiasts or those who want to try something new with respect to the usual management-sports simulations. It is undeniable that the care with which the product has been created by KOEI makes this title very appealing to them, to those who love horse racing and want to virtually relive the whole series of events linked to this sport, given that it takes consideration of all aspects of the competitions in every detail. Pros: Complete as a simulator. Playable in two in split-screen. Well balanced learning curve. Cons: Only for enthusiasts. Graphically not from PlayStation 3. Difficult.", "date": "2008-12-10", "grade": null}