{"name": "Medioevo del Sol Levante", "ref": "https://multiplayer.it/recensioni/warriors-orochi-recensione_a.html", "text": "A long saga Take a fictional story that draws from an Asian legend and twist it to fit a certain context you want to create. Then add a fair number of characters from two video game series such as Dynasty Warriors and Samurai Warriors, a sprinkle of magical atmosphere and lots and lots of violence. Thus you will obtain Warriors Orochi, the multi-directional fighting game with a white weapon from KOEI that after its appearances on PlayStation 2 and Xbox 360 peeps out on PlayStation Portable. The game reinterprets in a legendary sauce facts and events of two of the bloodiest periods in the history of China and Japan, namely that of Sengoku (from 1478 to 1605. A time in which Japan was divided into many small fiefdoms constantly at war with each other) and of Sangokushi (the era of the three countries at war). The premises of Orochi Warriors, however, are decidedly fantasy since they are inspired by an ancient legend concerning a monster belonging to Japanese Shinto mythology, that of Yamata no Orochi (The Yamata snake), or simply Orochi. This serpent divinity with eight heads and eight tails awakens from its secular slumber to subject to its will some of the greatest warriors of the Far East of those two historical periods so distant in years thanks to a space-time distortion, transporting them to a moment contemporary. Unfortunately for him and his dark plans, not all heroes comply with his wishes, so Orochi finds himself having to first eliminate the latter in order to continue his ~work~ of world domination. Pitched battles The gameplay of Warriors Orochi is practically the same as the series from which it draws its inspiration. Only the commands, as we will see, have been simplified. So we are facing the classic title in which we have to face dozens of enemies on the screen in different battles to progress in the adventure. From time to time, and to make everything less monotonous, the player is called upon to carry out slightly different missions, such as escorting an important ally avoiding a bad end or infiltrating enemy rear lines to clean up. But on balance the action always remains the same. But let's go into detail. The gamer takes control of a team made up of three (good) heroes: one fights, the other two remain on standby waiting to be called into battle. The three characters are in fact interchangeable at every moment of the adventure, but cannot be used in tags, an element which, if on the one hand offers the possibility of being able to manage different members and different fighting styles, on the other makes the game easier at most since it becomes practically impossible to die. In fact, when the vital energy of the main character used at that moment by the player drops below the safety threshold, just call him back to the ~bench~ and replace him with one of the other two companions to continue peacefully. In the meantime, the wounded hero removed from the battlefield recovers health and Musou powers (a sort of mystical energy) automatically, and therefore will then be ready to return in turn when needed. A team of heroes Each warrior can be selected from a good number of fighters characterized by three key parameters which, based on the values expressed, distinguish them from each other, namely Power, Speed and Technique: this allows you to create a team that is varied in fighting style . During the fight, depending on the character used and his skills, the player can perform various types of attacks, from the simplest to the combined ones, without forgetting the special executables and the devastating Musou charge when the appropriate bar fills up to 100 %. For the rest there is little else to do. Even if in our opinion the game still offers a good degree of fun, there is the risk, we repeat, in the long run that it may turn out to be a little monotonous. Unless you are a huge fan of the series and therefore decide to complete all the missions in a perfect way to unlock weapons, characters and artwork, since even the two-player mode does not increase the longevity or the style of play that much. Taking a quick look at the graphic and audio sectors, it should be highlighted how from an aesthetic point of view the KOEI title offers a fair quality of colors and details, but nothing exceptional in any case as regards the polygonal models, well defined but not perfect . Beautiful graphic effects and cut-scenes proposed in a pleasant anime style. It should be noted that the game environment is kept ~whole~ even in this portable version, and no longer built in separate blocks as in the past. All without excessive frame-rate drops even with dozens of characters on screen, exceptin sporadic cases or if you play in two. For the audio, we point out an ugly English dubbing and music that is not excellent but which nevertheless accompanies the game action in their own way.", "date": "2008-12-11", "grade": "6.7"}