{"name": "Shadow Ops: Red Mercury", "ref": "https://multiplayer.it/recensioni/shadow-ops-red-mercury-3.html", "text": "The first impact The first impact is not easy, as - after a dramatic filmed introduction - you are catapulted directly into the middle of the action. The first mission should never be difficult and usually represents a sort of tutorial to the rest of the game, well Red Mercury escapes this tacit law and projects the player from the first moment into the midst of bullets, grenades and explosions. The initial feeling is unsettling: who are the friends? Who the enemies? What to do? Bullets fly everywhere, the only solution is to seek cover and then think about making the point. It only takes a few moments to find some cover and take a look around, so as to understand that the teammates are easily recognized both by the clothing (they are those cool soldiers full of very expensive military equipment) and by the big prohibition sign that appears when you point the viewfinder at it. The enemies are terrorists and therefore dressed in civilian or paramilitary clothes, but - above all - when we aim our sights at them, there are no barred signals. The action becomes instantly red hot, bullets fly and bodies pile up in the dust, in corners and behind crates. In short, a war scenario, which however immediately reveals its cheerfully ~arcade~ nature, denying in a few seconds any hope of finding tactical depth in the game. Shoot from behind the crates Shadow Ops comes in two flavors, one 32-bit and another dedicated to the lucky owners of the new AMD64 microprocessors, precisely 64-bit. In this case the graphics change, but only at the texture level. Meanwhile let's go back to the 32-bit game. Red Mercury uses the Zombie Engine, nothing less than the good old Unreal Engine reworked and rebranded. To see the graphics are nice, with defined textures and bright colors, the level design is good, but technically we are faced with a lower quality than today's standards, with a too low polygon count, squared and angular objects and buildings and a general absence of those graphic effects that now embellish all the shooters that have come out for a year now. ... the level design is good, but technically we are faced with a quality lower than today's standards Shoot from behind the crates I admit, however, that the general look of the maps is captivating, with all those typical standards of the military genre. There are crates, street corners, you can lean out from behind cover to shoot, there are flash and blast grenades, teammates who act as bodyguards, covering us everywhere we go, and there are bad guys , terrorists with the usual atomic bomb, there are the sounds of guerrilla warfare and the scenario is permeated to the core by a strongly military atmosphere. What is missing? Shoot from behind the crates There is no interaction with the environment, there is no possibility of shooting the crate behind which the enemy is hiding and being able to break it, there is no possibility of hitting and dropping objects, because not even the shadow of a physics engine has been implemented , neither called Karma Engine nor called Havoc Engine! In short, if you give a barrel a blow with the butt of the rifle, you will see it shake just a little, but it will not fall even if you trip it. And again: the ability to open doors is missing. Not all, of course, but at least a few more, just to give the illusion of having a little freedom of movement. Even a flashlight is missing!! And, speaking of freedom, Red Mercury puts the player inside a unique and linear glass-walled path from which it is not possible to exit. If it's not the closed doors, it's the invisible walls that keep us inside the path. We can only go on and very often we will find ourselves unable to even the most basic actions, such as climbing a low step, just because it was not foreseen by the designers. The enemies appear in waves and throw themselves in a suicidal way towards our projectiles, they come out of the windows, gates open wide and emerge from behind them, sometimes one even has the sensation of being inside a rail-shooter, one of those where the movement it's automatic and you just have to aim and shoot, so to speak. Shoot from behind the crates The crates don't move from there, you'd want to change their position to have a new tactical advantage, but the crates remain firmly anchored in their place, even if you storm them with kicks and punches, simply because there is nothing tactical here. And the various scripts that activate new events are useless, the captain who opens that cursed door that didn't open before, so that he can continue on the other side of the road, is useless, because it's just trivial expedients. insomma, Red Mercury is just a big shooting gallery, where it's also allowed to take cover behind objects and this will kind of be the leitmotif of all the fights: hide, lean out and shoot. And so, until the end. Red Mercury puts the player inside a unique, linear, glass-walled path from which there is no exit. Shoot from behind the crates The level design, as I said, is nice, with crates stacked on top of each other, containers, planks and pipes held up in mid-air, windows, doors, passages, hiding places, lighthouses that you can turn off with one swipe, but none of this is exploited. The stacked crates remain there, because in the majority of cases it will not be possible to climb on them, the windows allow a glimpse of a room to be glimpsed, but we will never be able to lurk inside because the doors are all closed, the suspended piers are not accessible because there is a beautiful invisible wall in the middle, the lights can be switched off, yes and no, a minimal part, but nothing changes anyway since no one raises the alarm if a light goes out suddenly, in short, many beautiful unused things, a beautiful cake, stuffed and full of goodies, but all made of cardboard. The only consolation is that there are a lot of objects to blow up. Barrels and crates of explosives, waiting for a merciful bullet. Obviously, since the game doesn't even remotely want to compare itself to a Raven Shield, just to name one, there are no saves during missions. [C] The graphics engine is not running. free from defects, in this case we can see a rare case of branch penetrating the walls It's since the days of Counterstrike that crates and containers have invaded the maps of hundreds of shooters How can you easy to understand, this operation is set in the remnants of the old Soviet Union [/C] The sense of all this? The general feeling is that of being faced with a title with a very cinematic imprint, which wants to involve the player making him feel the protagonist of adrenaline-pumping and exciting adventures, as happened in Medal of Honor or Call of Duty, for example. But the result is bankruptcy, because the excessive simplification of the gameplay, the lack of any interaction and the repetitiveness of the action, mortify a good idea that does not lack interesting ideas. The missions kick off with action in the heart of enemy territory, then the incredible epilogue in fullmotion video and the flashback that tells us how it all began. And it is from there, from that moment in the past that we will have to make our way, reliving all the events that brought us face to face with a crazed terrorist and his atomic bomb. the excessive simplification of the gameplay, the lack of any interaction and the repetitiveness of the action, mortify a good idea that does not lack interesting ideas. The sense of all this? From here we will visit many places and experience different situations: in Africa we will hunt down unscrupulous guerrillas, in Kazakhstan we will silently infiltrate the enemy ranks, and so on. Yet in the end it all turns into the same thing: shooting and hiding. Even stealth missions are reduced to a simple thematic variation of the usual shooter concept. In short, we are faced with a title with great frustrated ambitions, in which you cannot choose weapons before the mission, you cannot collect those of fallen enemies and, even, between one loading and another, the weapons change by themselves ! Shall we enter a warehouse holding a shotgun, an AK47 and a pistol with a silencer? Well, after loading we will find ourselves in the warehouse but with three completely different weapons! On the one hand, then, the game sins of superficiality and carelessness, on the other hand it offers spectacular cinematic sequences in full Hollywood style, full of action and adrenaline, good for spending half an hour of healthy fun in front of the monitor. Comment No, we are not. If Atari wanted to throw itself into the arena of tactical shooters it could have done it better and with more style, while what we are facing is a mediocre, repetitive and boring product. The defects of the game derive from a precise programmatic, editorial choice: the flattening of the gameplay, the inconsistencies, the excessive simplification, are things wanted in the design phase, they are not ~errors~ that came out later. The cinematic cut increases the intrinsic value of the product a little, but by how much? Can you justify everything else? Who wants to buy Shadow Ops: Red Mercury will it be to see the sequences in full motion video or to play? If we add to this a graphic sector that is certainly not first-rate, then the final result falls disastrously. Shadow Ops it seemsa product packaged especially for newbies of the genre, for those who have never played a Medal of Honor or a Ghost Recon and do not know the best that can be found on store shelves. Or, worse, it looks like a game aimed at younger people, at those kids who find themselves in front of a PC for the first time and for them one title is as good as another. Pros: Well-made level design Fast and disengaged gameplay Cinematic interludes Cons: No interaction! Non-existent game thickness and enormous repetitiveness! Outdated graphics Introduction. Special forces, terrorists, a nuclear device and covert operations. Tom Clancy lovers will already be delighted, but be careful, don't let yourself be deceived: Shadow Ops has nothing to do with the works of the famous author. Released first on consoles, Atari also offers this shooter in the PC environment, however challenging a group of competitors that is far more than fierce. Once you start the game, you are inundated with a disproportionate amount of sponsors. Logos, brands, jingles, developers, producers, distributors, a very boring process that forces us to press the all too overwhelmed, heroic, ESC key. Let's see what happens when we finally get to the point. [C] Squadrons of fighters and soldiers ready for action, but this is not the case. Tom Clancy The cinematic sequences are spectacular and in full Hollywood style From the very beginning we will hunt down this individual, who is truly responsible for the events behind the Red Mercury. Note the hand that ~penetrates~ into the briefcase, let's start well. [/C]", "date": "2004-12-09", "grade": null}