{"name": "Prince of Persia: The Fallen King - Recensione", "ref": "https://multiplayer.it/recensioni/prince-of-persia-the-fallen-king-recensione.html", "text": "The fallen king (from the platform) The Fallen King is configured more or less as a sequel to the just released Prince of Persia: in this portable edition the protagonist still faces the threat of the demon Ahriman and the curse that is deteriorating the world. Even in this battle, the Prince is not alone: instead of the beautiful Elika, the mysterious wizard Zal will be at his side, who with his magic will provide the Prince with decisive support for the several dozen game levels that make up the adventure. The plot is extremely simple, almost specious, told through textual dialogues, which even slightly characterize the two protagonists and their enemies: but Prince of Persia is mainly action and puzzle-solving. The structure of the various stages is intriguing, it offers a well-studied combination of jumps, puzzles and fights: in short, there is no lack of variety, but unfortunately each of these ~phases~ is undermined by various collateral problems that make the experience vaguely frustrating. In the first instance, we have a really annoying problem, linked to the control system: Prince of Persia is played completely with the stylus. Just like in The Legend of Zelda: Phantom Hourglass, even in Prince of Persia the contact of the stylus with the touch-screen will determine the actions of the Prince, but the imprecise response to the inputs or their careless detection become nefarious in the numerous sections in where the precision in the movements or in the jumps must be practically millimeter: it is not uncommon in fact that, for example, the game exchanges a pressure on the touch-screen for a run command rather than a jump or vice versa, leading the player to premature deaths and unwanted. The structure of the various stages is intriguing, it offers a well-studied combination of jumps, puzzles and fights... The fallen king (from the platform) The problem occurs especially in the advanced levels where it is necessary to combine numerous evolutions in sequence to overcome traps and chasms, and the frequent checkpoints do not relieve the stress. Controlling Zal's spells, on the other hand, is much simpler, and they constitute the essential tool for solving puzzles and overcoming the most complex obstacles: as in the case of Elika for the home edition, Zal is also crucial to progression in the game, and his use becomes natural and intuitive as you proceed from stage to stage, integrating perfectly with the level design. The combination of the athletic skills of the Prince and the magic of Zal becomes predominant during the fights with the canonical bosses: however, if the sporadic random fights are already boring and repetitive exchanges of blows made by pressing on the touch-screen, the situation does not improve against creatures that should be more complex to defeat but which in reality have extremely predictable and circumventable attack patterns while identifying, in a few moments, the simple strategy to adopt to win. Indeed, the combat in The Fallen King is the worst element of the package. Matter of style This new version of Prince of Persia continues to change: on next-gen platforms the restyle has been incisive, transporting the world of the Prince and its inhabitants from a visually realistic dimension to a cartoonish and fairy-tale one thanks to a very colorful cel-shading, a choice courageous that has not failed to raise criticism and praise. On Nintendo DS, the style has changed again: the character design is much more cartoonish, the characters vaguely super-deformed, an attempt has been made to maintain a relationship between this portable edition and its older brother, with not exactly satisfactory results. On the other hand, however, exceptional care has been taken in the creation of the animations of the Prince, Zal and their enemies: extremely fluid, convincing and extremely spectacular, the sensation of ~agility~ of the Prince is truly powerful. The various locations, on the other hand, present a fluctuating mix between two-dimensional and three-dimensional elements: the result is good but the detail is often incomplete. However, the real problem is the frequent presence of slowdowns in the most excited moments of the action, combined with the imprecision of control via stylus is the real cause of unexpected Game Over: repeating the same phase of a stage because the Prince falls off a platform instead of stopping on the edge it doesn't help, especially with the same repetitive and anonymous background melody. Prince of Persia: The Fallen King is available for Nintendo DS. Prince of Persia was one of the most welcome Christmas surprises this year: the reboot of the Ubisoft saga proposed the fairy-tale adventures of the Prince with a completely new concept, also from an artistic point of view. PlayStation 3, Xbox 360 and PC are statand of course the platforms mainly designated to host the new adventure of the most famous Prince in the gaming world, but also the Nintendo DS - not surprisingly the best-selling console ever - could not miss this appointment: The Fallen King is more than a port , is a real episode developed specifically for the Nintendo handheld that attempts a combination of the classic mechanics of the series and the new ones introduced on the major platforms. The Fallen King is certainly a pleasant attempt to return to the side-scrolling origins of the series while keeping alive the winning ideas that characterized the new incarnation of the Prince, primarily collaborating with a partner to solve puzzles and defeat enemies. The idea is excellent, the technical realization good, the level design often excellent, but the controls via stylus are really imprecise and unsatisfactory and, undoubtedly, they are the most important element in the entire play structure of The Fallen King. It is a good starting point, however, for a very enjoyable portable series, and certainly a title to be taken into consideration for those who are fasting on the adventures of the Prince. Pros Technically pleasing, beautiful animations Great level design Good fusion of old and new concepts Cons Poor stylus and touch-screen controls Boring and repetitive combat Occasional frame-rate drops", "date": "2008-12-12", "grade": null}