{"name": "Death Stranding Director's Cut", "ref": "https://multiplayer.it/recensioni/death-stranding-directors-cut-recensione.html", "text": "For this review of Death Stranding Director's Cut it is necessary to proceed in small steps, exactly as Sam Bridges, who is the absolute protagonist, must do when he explores unknown territories. The occasion is in fact too tempting not to start by talking about the legacy of Death Stranding, what followed two years after his debut. However, we have a product to analyse, this Director's Cut which adds, modifies, rebalances, and we will do so starting from two different points of view, in order to satisfy both those who have already lived this adventure and are ready to go back, and those instead he is preparing for his very special first time. The origins In Death Stranding Director's Cut it is possible to build special ramps that allow you to do tricks Death Stranding is the first game that Hideo Kojima designed after leaving Konami, the company where he grew up professionally and which allowed him to create renowned series such as Snatcher, Metal Gear Solid, Zone of The Enders and Boktai. Hideo Kojima is a creative with a very strong authorial imprint, which is increasingly rare in the field of very high-budget video games, and has become famous mainly for things such as breaking down the fourth wall through ingenious gameplay solutions (the evil Psychomantis from Metal Gear Solid ne is a perfect example) and thanks to his disturbing ability to anticipate the future through tangled sci-fi plots that animate unforgettable characters. The artist is present, Marina Abramovic would say, so present in Hideo Kojima's games that many end up not appreciating. It's normal to happen, but you will never hear anyone with a minimum of knowledge of the subject belittling the ideas, intuitions, ability to play with the public, of this 58-year-old originally from the Setagaya district of Tokyo. Freestyle Compared to other entertainment industries, video games is where the creative most often finds himself imprisoned in his greatest success. Explosive minds thus end up working for a lifetime on the same idea, even when it can no longer contain their vision, which naturally widens with age, experience and an expanding culture. In recent years at Konami, when it had become clear that Metal Gear could no longer contain his wild imagination, Hideo Kojima tried to reinvent Silent Hill only to reinvent himself. In PT, the ~playable teaser~ of Silent Hills, it is in fact already possible to glimpse the results of the new creative process which, after Konami's daring videogame retreat, finally brought us to Death Stranding. Damn, we all wanted to see and play that Silent Hills, but with its cancellation and the subsequent breakup between Hideo Kojima and Konami it didn't go badly, if not even better. Death Stranding is something that with a similar budget is practically never seen, it is an expression of an almost absolute freedom that we are not entirely certain Kojima would have had working on the famous horror series in which he was entangled. After all, if he really wanted to make a horror film, he could have done it very well afterwards, but after all, isn't Death Stranding and this Death Stranding Director's Cut also this? Cinemagameplay The racing circuit must be found and built. With him also comes a new racing car to drive, and the possibility for all means to perform a controlled drift One of the greatest goals achieved in this sort of age of maturity for Kojima is finally being able to combine cinema and video games together so that neither of the two natures prevails over the other, as happens in many titles including at least a couple signed just HK. In PT, and to a greater extent and completeness in Death Stranding, it is simply the gameplay that works in front of the camera, that is telegenic, and it is always the gameplay the protagonist on which the staging was built and works. In short, it is the gameplay itself that transfigures unreality into cinema. A direction in which no one is working and which places the Japanese, whether you like it or not, in a unique position with respect to an increasingly polarized and, sorry, too often trivialized video game industry. A narrative simulation There's nothing we're prouder than stealing the donkeys' first truck So let's talk about this undisputed star, the gameplay of Death Stranding which like all the greats can be summed up in very few words: you are Sam Porter Bridges and you have to deliver packages of all kinds around the United States, but not the postcard ones, let's talk about the United States after the world of the dead began to mirror itself in that of the living causing all kinds of space-time collapses. Each journey can be subject to various setbacks: the onslaught of madmen, chronorain that gradually ruins what we carry, chiral ghosts to shoot blood at, as well as the morphology of the terrain that can cause other serious problems in travel, if not paid attention. To better overcome any possible boredom that would slow down the delivery, or even worse risk making us ruin what we are transporting, Death Stranding always introduces new tools, thereby increasing the difficulty of the proposed journeys and the kilometers to travel. The approach to travel is absolutely simulative, for example it is necessary to pay attention to the distribution of weights and keep an eye on other important variables, while the grid that regulates the expeditions is narrative disguised as only apparent complexity, but that is enough to create the illusion of being there, grappling with a real job simulated in fantasy, trying to figure out how to use the last energies in the body to reach the refuge above that peak, or trying to descend safely into that crevasse. Instructions for Use In the old Death Stranding, raising the difficulty was of little use and broke the boss battles altogether. The Director's Cut ~Very Difficult~ is done unexpectedly well, and the boss rebalancing prompts us to recommend it to veterans and newcomers alike To make things less demanding, to break down insurmountable barriers, we will be able to carry ladders, climbing stakes, levitating trolleys, and a briefcase that allows us to build very useful things such as bridges, watchtowers and more in crescendo. If things aren't weird enough, know that Death Stranding will unite you with other players and of these you will see the structures they have built in their game, and they will see and can of course use yours, even upgrade them or simply rate them with a like. In addition, where players pass more often, paths are dynamically created on the ground which have various benefits in addition to signaling roads that have already been traveled and are therefore safer. But the choral activities don't end there: all together, each in his own game, you can contribute to the construction of a gigantic highway that runs through almost the entire map of the adventure. A better start All vehicles can enter a controlled drift by pressing circle at high speeds. The function is indispensable on the circuit, but immediately proves to be very useful elsewhere as well The progression with which new weapons and various trinkets are unlocked has always been one of the funniest things about Death Stranding: you can go on in the game quite quickly, finish it in about thirty hours, but that's when you've brought every possible recipient to five stars that you will be able to say that you have seen and unlocked practically everything. In this Death Stranding Director's Cut several intriguing objects are added, apparently too useful, and this has generated some fear in the fans of the game, fearing that they would make it too simple, even trivial. To answer this question, we decided to throw away the 220 hours spent with the first edition of the game to start the Director's Cut all over again. The choice was immediately rewarded with a much more pleasant introductory part than in the normal Death Stranding, thanks above all to a new rifle that allows you to stun enemies from a distance, making the first encounters with the mules more varied, and a more soft and at the same time intense as it is enriched by the new contents. The new rifle first, the new motorcycle with integrated forklift then, and everything that is unlocked later and that was not present in the original Death Stranding, does not make things simpler, but more varied and fun. The motorcycle with integrated trolley seems too successful an idea not to create an imbalance, when you then use it and you realize that by speeding up a too big boulder it can disperse and damage the load, then you think twice about pulling it again out of the garage; the new pedestrian bridge, which is built without additional materials and in some cases replaces the staircase, does not work in the rain. New content also respects the same rules as original content. No game overs Bikes with added undercarriage, pocket holodecks, courier cannons... we were afraid that the latest additions would ~break~ the game, but everything turned out for the best After all, Death Stranding has never been interested in a classic difficulty. It's one of those games without game over, there's a gimmick here too, and consequently it doesn't want to punish you with unnecessary loading but only urge you to think better, to have fun experimentingor with its game systems that also include bitter disappointments, critical failures such as an entire load lost in the river due to a bad foot, a suicidal fall due to too short of breath and a too empty water bottle, final rushes on bare feet because boots broke from too many kilometers; Exhausted Sam falls to his knees in the pouring rain, surrounded by ghosts, with the batteries of the exoskeleton discharged, while a Low Roar song resounds in the valley transmitted by a recharging unit built by another player and a few infinite meters away. Sam's travels can also be fun and daring, but more often than not you walk alongside a human drama that finds its perfect simulacrum in the contrite and tired face of Norman Reedus, in his body weighed down by loads that are always too heavy, in the his overalls increasingly filthy with fatigue and chrono-jinxes. The prophecy The photo mode isn't new to the Director's Cut but it made its way into the base game along the way and through a patch Of course, speaking of Hideo Kojima, Death Stranding is largely composed of lore, setting and story, first of all characters. The whole that makes up this work has its own pre-established narrative that gives rhythm and pushes forward, towards the final journey, like many optional documents, secrets, special deliveries that in this Death Stranding Director's Cut also increase in number and variety, returning to pay homage to Cyberpunk 2077 and Half-Life before the others. The story of Death Stranding traces a universe never seen before, a science fiction with unique connotations and all to be discovered. Here you will witness disturbing inventions and theatrical reversals of the front between mysticism, technique and magic, surviving a reality shrouded in a perennial and milky twilight that cynically imposes its twisted rules. This was already two years ago, but having so closely prophesied what the world would experience just a few months after its arrival in stores, Death Stranding Director's Cut arrives bringing with it several more meanings. On the other hand, it was supposed to be the story of what could have happened, but Death Stranding in the end unintentionally turned into an allegory of what we are only now painfully leaving behind. Having experienced pandemics and lockdowns on the skin, today it generates different emotions, much more intense, playing the role of Sam Bridges, this courier at the beginning alone who tries to reunite America by delivering packages to frightened and isolated inhabitants, literally blazing new paths, cobwebs, filaments, collaborating with millions of other Sams in as many dimensional planes, our homes; in a world where likes have replaced money and messianic real and theoretical umbilical cords tie the living to their funereal shadows in the sky. Olympic citation ~All work and no play makes Sam a dull boy~ Death Stranding is also an extraordinary cross-media product, it's a project that works as an antenna that broadcasts an idea of music, brotherhood, humanity that the player slowly absorbs over broadband. Moving on the hatch composed of cinema and gameplay of which we have already talked abundantly and which allows you to create a third other art, drawing on the highest but never less than global pop, Death Stranding weaves together all the elements necessary to give life to what it is one of the most important cultural works of these years. All ennobled by an exceptional cast made up of the aforementioned Norman Reedus, Lea Seydoux, Tommy Earl Jenkins, Mads Mikkelsen and a very young Margaret Qualley before she definitively broke through as a follower of Charles Manson in Once Upon a Time in Hollywood. There is even Lindsay Wagner in two versions, as she was at the time of The Bionic Woman and as she is now as a splendid seventy-year-old, confirming once again that Olympic citationism is being played here. There's also room for Super Mario and Princess Peach in Death Stranding, too bad there isn't a feature that snaps a photo of the player's face when this particular cameo happens. Beginnings and restarts Relaxing in the refuge after a delivery to the limits of the human transmits unique sensations. Doing so by listening to the game's OST and reading its many docs is even better This Death Stranding Director's Cut that Hideo Kojima himself, rightly, does not like to define Director's Cut, it is not that it introduces who knows how many new things. The new missions, even if some are very fascinating due to the internal settings, by themselves do not deserve a dusting off of one's rescue; the much-hyped racing circuit is a nice idea, but it alone isn't enough to justify a second game. The new tools such as the cannon that shoots parcels, the motorcycle transporter", "date": "2021-09-23", "grade": "9.2"}