{"name": "The Last Remnant - Recensione", "ref": "https://multiplayer.it/recensioni/the-last-remnant-recensione.html", "text": "What is a Remnant? To tell the truth, TLR presents itself to the player in a rather canonical way, with the protagonist Rush Skyes desperately searching for his younger sister who has been kidnapped by a strange type of creature called a Remnant. The Remnants are the keystone on which the whole story is based, they are artifacts endowed with immense power, adored and feared by the population, which can distribute wealth to the cities that own them as well as spread destruction if they are used in battle. The nature of the Remnant is unknown and they can come in all shapes and sizes, what is certain is that the balance of world politics rests heavily on these magical objects and as it is easy to predict, a dark figure eager to take possession of this will not be long in coming. great power, Rush soon sees his quest turn into a family drama that will intersect with the tide of a war for world dominance. Even TLR instead reflects what we can safely point out as a characteristic of the jrpg of this generation: the slow progression of the narrative, which in the initial stages is struggling to take off but which over time unleashes important twists sipped throughout the length of the game, however, this also has the advantage of keeping the player's attention high until the end, once you enter the heart of the story, with the risk, however, of not being able to get caught and leaving the game prematurely. The main quest alone reaches thirty hours of gameplay without counting the countless secondary missions that lead to doubling the overall count of longevity, what makes you turn up your nose is the nature of the subquests that always present themselves as ends in themselves, not bringing never to develop the personal stories of the characters, and which are self-contained most of the time with the discovery of a person/object or with the killing of the creature on duty. No walks TLR is a game that never abandons the player, on the contrary it escorts him from the beginning to the end of each mission he decides to undertake, so much so that once the task has been accepted we will not be allowed to reach the location freely designated but we will be immediately teleported to the dungeon in question and once we have completed our task we will return to the starting city again in front of our interlocutor. This is because the latest Square effort is absolutely built on a base that does not allow any free roaming component: the various locations, cities and dungeons can only be reached via a world map where the icons of places to visit appear, there is no the possibility of passing from one place to another if not selecting a destination and reaching it with an immediate teleportation. Exploration is limited within the areas and dungeons which in some cases reach considerable dimensions but which sin from a certain poverty of characterization. Even the cities have a similar structure with limited locations to always be reached via a similar icon selection scheme where the various districts hosting inns, shops and guilds of utility to the player are depicted. In this case the lack of free exploration is felt all the more given the obsessive care placed in the creation of urban environments (inhabited by a multiracial population), it would certainly have been fascinating to be able to wander and admire the metropolis in the round that serve as ~ base of operations for our party members. The city architectures (hosting gigantic Remnants) are undoubtedly the most fascinating locations offered by the game, thanks to the presence among the members of the artistic team of some creators of Final Fantasy XII, who gave us remarkable landscape views, such as the unforgettable Rabanaste. The more the merrier! We now come to the aspect that most characterizes The Last Remnant from the mass of jrpg that has recently invaded this hardware generation. Square Enix this time wanted to dismantle the clich of the classic party made up of a handful of units. How many times have we wished we could face the clashes leading not a small number of heroes, but one or more organized teams of fighters? Well TLR comes to our aid by offering the possibility (or rather forcing, under penalty of a premature Game Over) to build unions: real teams of several freely recruitable elements who will take the field in unison behaving as a single unit. Obviously, even the enemies will present themselves in battle in similar formations so that the clashes immediately take on larger-scale connotations compared to the standards of the genre. I unite themni are the basis of the TLR combat system: by forming teams of up to 5 elements each, the vital energy of the latter adds up forming that of the single union which will be controlled in all respects as a single entity, thus it will go to engage in battle with the enemy groups, with an action called engagement, and if carried out with a certain attention to the geometries with which the enemies are arranged (not always very clear to tell the truth) it will be possible to enjoy tactical advantages by launching attacks on the sides and behind the opposing formations. Unions are the basis of the combat system of The Last Remnant The more the merrier! During the battles we will have a variety of commands available that allow you to carry out simple attacks or to resort to magical or warrior arts, and it is important to underline how it is impossible to decide the actions to be performed by each individual member of the union. We will be offered different combinations of attacks based on the various arts with which the characters are equipped, in some situations some subjects may also resort to the devastating use of the Remnants in battle capable of reviving the fortunes of a compromised battle. Monsters are always visible in exploration areas, as happens in Blue Dragon, and it is possible to engage in battle with multiple enemies at the same time to get richer rewards at the end of the battle. The accumulated experience is automatically distributed among the party members, but there is no control over the learning of the arts and the growth of the parameters of the characters that evolve automatically, moreover it is only possible to modify Rush's equipment while the others leaders will manage themselves with the items recovered in battle. All this makes everything much more usable for an inexperienced audience devoid of role-playing experiences, but takes away a slice of gameplay from the more savvy adventurers, who will find themselves a bit forced between the lack of exploration and the simplification of certain schemes related to the type. Load! As planned, TLR is yet another title that relies on the Unreal Engine 3 graphics engine. Once again, the eastern programmers show a certain embarrassment in managing the potential of the engine of the fathers of Gears Of War. First of all it must be said that there are a disproportionate number of uploads which, even if short, continuously break the action. If on the one hand the polygonal modeling of the characters appears slightly rough, the visual impact is raised by the use of good textures and by a masterful lip-sync work which gives credibility and depth to the cutscenes entirely created with the game's engine . Even the environments enjoy a particular care for the realization of the surfaces which always remains on good levels, where the animation of the protagonist's run really leaves something to be desired. The effects of the spells and blows that are wasted during the fights appear very spectacular and well done. Unfortunately, TLR suffers from that annoying texture late loading effect made famous by Mass Effect, which can be partially countered (but not solved) by installing on the hard disk. The only real drawback that can undermine the enjoyment of the gaming experience, however, is the serious instability of the frame rate during the battle scenes, which suffers from heavy drops, aggravated by the dynamism of the camera which, although giving spectacularity to the clashes, ends up sometimes being too nervous when changing shots. The soundtrack displaces between orchestral compositions and heavy guitars and is enjoyable, but also reminds us how distant the times of collaborations with Nobuo Uematsu are. Comment The Last Remnant gets its own space in the crowded landscape of oriental role-playing games thanks to a strong personality and a good narration that is maintained throughout the adventure, while suffering from a more cheesy cure as regards the side missions . All in all, the step forward compared to the previous Infinite Undiscovery is noticeable also thanks to a finally fun and innovative combat system. TLR is a role-playing game with softened features that is aimed above all at those who did not grow up on bread and statistics, but obviously this filing operation may not go down well with those players who can boast some experience in the genre. It is certainly a valid product that can easily carve out a space for itself in the playrooms of anyone who is looking for an adventure that is not too demanding from the point of view of the mechanics and who is able to defer in the face of some false notes in the technical sector. Square Enix adjusts the shot, but we are still far from the glories achieved by its most famous brands. Pro Combat syinnovative and fun stem Enjoyable and compelling narration Beautiful settings Cons Mechanics too simplistic for expert players Technical sector of fluctuating quality Exploration phases too limited Xbox 360  Achievements The Last Remnant is perhaps the most reluctant game to release gamer points. The total objectives are just 22 and in order to hope to overcome the few dozen points collected along the way it is necessary to reach the end of the adventure.", "date": "2008-12-10", "grade": null}