{"name": "Killzone", "ref": "https://multiplayer.it/recensioni/killzone.html", "text": "Get in the (kill) zone Killzone opens with an excellent CG movie that introduces the user to the facts narrated in the game: led by a leader with not too hidden Mussolini-like features, the perfidious Helghast army begins to ruthlessly attack the human colony of Vekta, rebelling against the alleged oppressions exercised on them by the earth's population. The remarkable quality of the opening sequence extends (albeit to a lesser extent) to almost all of the cut-scenes present in the title, characterized by good polygonal modeling, convincing direction and well-made Italian dubbing. In general, Killzone successfully succeeds in immersing the user within the game universe, skilfully mixing different audiovisual elements capable of giving the idea of being involved in a convincing guerrilla scenario. And guerrilla warfare is the leitmotif of the entire Sony production, both in terms of scenography and in terms of actual gameplay. In fact, it is difficult to consider (and play) Killzone as a classic FPS, all strafe and wild shootings: the Guerrilla title in fact presents a vast series of aspects whose purpose is to discourage a Rambo-like approach to instead favor a more tactical game conduct. First of all, whether it is for a precise choice of the developers or for real deficiencies in the control system, shooting the running Helgasts is a very difficult undertaking. Secondly, the frequent presence of compact groups of enemies and their constant ballistic accuracy make any attempt at direct confrontation almost always deadly. Not to mention the weapon reload times, which are deliberately long and therefore can only be carried out safely away from enemy fire. And that's not all: the speed with which the energy indicator tends to empty, the impossibility of jumping and the short amount of time allowed in the shooting phase are all elements devoted to the same purpose. In short, to continue in Killzone it is necessary to adapt to the perspective of the hit and miss attacks: shoot, take cover, shoot, take cover, reload and start again. A gameplay that certainly distinguishes the Guerrilla title from other FPS, but which on the other hand tends to make it repetitive more easily, also thanks to a level design which, however good, leaves little room for variety. It is also true that Killzone allows the user to tackle the various levels by choosing one of the four available protagonists, each characterized by peculiar abilities which, thanks to a small trick, are always highlighted regardless of the selected stage. Basically, the number and position of the enemies undergo differences depending on the selected character: by impersonating the assassin Luger you will therefore have a better chance of facing the Helghast by hitting them from a distance or killing them from behind, while the beefy Rico will be able to rely on his firepower to unceremoniously mow down entire hordes of enemies. With the remaining Templar and Hakha constituting the classic middle ground, the four heroes of the game therefore offer different offensive options, without substantially changing the play structure or constituting a valid injection of replay value. Not just countryside Alongside the single player mode of the game, consisting of 11 levels, Killzone offers Sony users the opportunity to try their hand at multiplayer challenges both via split-screen with bots as opponents, and online up to a maximum of 16 players. Although the Sony network has never been the best of life, it is exploited by Killzone in an excellent way, allowing even crowded games without major lag problems and leaving room for the use of the headset for voice communication. There are six modes dedicated to multiplayer sessions, namely Deathmatch, Team Deathmatch, Defend & Destroy, Assault, Domination and Supplies (a kind of ~multiple~ Capture The Flag). These turn out to be quite fun, although they all fall roughly into the genre's schemes: what is not convincing about Killzone's multiplayer is the game rhythm, transferred without any variation from the single player mode of the title. But if in that case the slowness of the movements does not weigh that much (thanks to the intermittent gameplay described in the review), in the more dynamic multiplayer environment it makes itself felt a lot, leaving some room for boredom. The Importance of Being Helghast If the guerrilla-style setting of the Killzone gameplay can still be considered, with its limitations, a valid alternative to the classic FPS approach, the fact remains that the Sony product has several internal defectswhich undermine its overall assessment. In strictly playful terms, the behavior of the Helghasts is particularly annoying, precise as snipers even from the most prohibitive distances and at the same time extremely unresponsive in various situations. Peek around a corner and an enemy hundreds of yards away will smack you in the forehead, but throw a grenade into a room populated by Helghast and you're unlikely to find any survivors. Killzone thus continues continuously poised between the contradictions of its AI, leaving the user the victim of relative dissatisfaction or, in some cases, real frustration caused by the heavily scripted nature of the game scenario. The continuation in Killzone is in fact characterized by linearity both in the field of simple walking (the path, except in rare cases, is unique and clearly visible) and above all with regard to the events that occur within the levels. Helghast always appear in the same places, always make the same movements, and always strike with the same irritating precision. Example: open scenario, countryside outside the city. Make the mistake of running exposed in the middle of the road and you will be hit full blown by a grenade thrown from who knows where. Repeat the level (the checkpoints are few and often poorly placed), go through the aforementioned path again and you will again fall victim to an explosion whose creator is not even visible. Of course, the reverse process is also frequent, with the Helghast letting themselves be killed in the same way time after time. And this certainly does not help the player to be fully satisfied with the experience offered by Guerrilla. Which is a pity, because Killzone is all in all an original product, with a captivating gameplay, but which suffers from considerable shortcomings. Double sin, if we also consider the excellent quality of the audiovisual sector of the game. Graphically, the Dutch developers have managed to do a somewhat astounding job, especially considering the no longer avant-garde hardware of Playstation2. Killzone offers scenarios of great visual power, graced by smoke effects and explosions of remarkable workmanship, and populated by characters with high polygonal detail. All this at a certain price, however: the frame rate is not exactly high, and is susceptible to frequent drops in the most crowded situations, but this does not affect the gaming experience that much. The animations of the opponents are convincing, even if a little wooden, while the realistic movements of the camera and the arms of one's virtual alter ego during the operations of reloading the weapon, running or overcoming obstacles deserve applause. On the sound front, the already mentioned goodness of the Italian dubbing goes perfectly with high-level effects and music, and which assume even more importance in the presence of a surround system. Comment Killzone is not a great FPS, nor the Halo-killer that someone (perhaps) expected. The Guerrilla title, on the other hand, is an honest and in some ways original product, equipped with an excellent audiovisual sector, but which has a series of gaps that it is not really possible to overlook. Certainly conditioned by the hype that had formed around it and by the unfortunate overshadowed release by the giants Halo 2 and Half-Life 2, Killzone is above all a title that pays for the inexperience of a young software house like Guerrilla, which however has shown that it possesses good ideas and technical skills. Maybe with a possible Killzone 2, the speech could be different Pros: Excellent graphics Film sound compartment Out-of-the-box gameplay Cons: Repetitive game structure and level design Unbalanced enemy AI Various structural naiveties From the first moments of its announcement, Killzone has been honored by the Playstation 2 community with the heavy title of Halo-killer. Passing over the (questionable) reasons that led to this epithet, the fact is that the Dutch first-person-shooter immediately accumulated a very considerable dose of hype, continuously invigorated by the classic flock of enthusiastic previews, thunderous press-releases and screenshots spectacular. As its release date approached, however, the wait for the Sony title began to waver: either for the mediocre exploit of Guerrilla with Shellshock, or for the triumphant arrival of the ~rival~ Halo 2, or for the first less positive hands-on than expected, Killzone arrived on the market almost quietly, moreover a short distance from the very heavy releases of the new adventures of Master Chief and Gordon Freeman. Who starts well", "date": "2004-12-08", "grade": null}