{"name": "Grand Theft Auto IV - Recensione", "ref": "https://multiplayer.it/recensioni/grand-theft-auto-iv-recensione_a.html", "text": "Comment GTAIV remains that masterpiece released on console several months ago: Rockstar has decided to focus more on creating a plausible and degraded social context around the protagonist, rather than aiming at the freedoms (or experiments, call them whatever you want) peculiar to a San Andreas or Vice City . This means that you won't find RPG stats anymore, you won't have to go to the gym to improve your fitness, be careful what you eat so you don't get fat and so on. You will be given a character, Niko Bellic, and you will have to live his story, sometimes reserving a minimum of freedom of choice. However, the PC version of GTAIV has to deal with the hardware requirements and it must be admitted that the programmers should have focused more on making the game more performing: the framerate problem is solved by sacrificing the graphic quality, a price to pay necessary if you don't want to have the impression of playing in a sort of perpetual slow motion. Despite these small problems, absolutely do not miss the title, because all its merits, from the excellent graphics, to the almost addictive gameplay, you will find them unchanged in this PC version. Indeed, to be honest, you will find them clearly improved. Pros Technically excellent All the advantages of the console version Innovative video editor and improved multiplayer Cons Very demanding in terms of hardware Rather simplified thanks to PC controls Grand Theft Auto IV is available for PC, PlayStation 3 and Xbox 360. The tested version is the PC one. Goodbye poor accuracy The optimization of the game engine can also be seen in the correction of some bugs that afflicted the console version, including the phenomenon of the sudden appearance of buildings, cars and pedestrians (called, in jargon, pop up): being able to install on hard disk the entire game and being able to count on hardware that is on average more performing (at least in terms of reading speed on the hard disk) than the PlayStation 3 version has completely solved the problem, also thanks to the ability to let the user decide the viewing distance: by reducing it, you will significantly increase the free space on the video card memory, obtaining decidedly higher performance, however sacrificing the aesthetic aspect. The programmers have also retouched the management of shadows, especially on faces, now almost completely glitch-free, except in some cases when you are driving a vehicle: however, these are small insignificant moles, which absolutely do not penalize the global aspect of the title. You will therefore have to pay a very high price for the graphic quality, especially if you want to enjoy the feeling of being immersed in a plausible city, with pedestrians on the roadside, cars in queues, drivers honking their horns and so on. With the right hardware, the distance that separates you from the monitor will be broken and you will feel as if you have been transported to another reality: that of Niko and organized crime. Leaving aside the aesthetic aspect, let's move on to a more concrete one, namely the problem of automatic pointing: for obvious reasons of convenience, this function is no longer present in the PC version, thanks also to the keyboard/mouse combination which is not afraid of anything in FPS the joypad competition, guaranteeing you excellent aiming accuracy. Unfortunately, the artificial intelligence routines have not been retouched and this, combined with the value mentioned above, will make it quite simple to get out of the fights unscathed or almost, given that you will be able to hit even the smallest part of the body with absolute precision that your silly target will protrude from its cover: which inevitably leads to a drastic lowering of the level of difficulty, making your life rather simple and, in the long run, will give you an almost omnipotent feeling. In our opinion, this sensation is in stark contrast to the realistic imprint the developers wanted to give to this new episode. PC - System Requirements Minimum Requirements Processor: Intel Core 2 Duo 1.8 GHz / AMD Athlon X2 2.4 GHz RAM: 1 GB Video Card: NVIDIA 7900 / AMD Radeon X1900 with minimum 256 MB Disk Space: 15 GB Recommended Requirements Processor: Quad Core Processor RAM: 3 GB Video Card: ATI 4870X2 2GB / NVIDIA 280 1GB Disk Space: 16 GB Test Configuration Processor: Intel Core Duo E8400 @ 2.66 GHz RAM: 4 GB DDR3 Video Card: AMD Radeon 4870X2 2 GB Operating System: Windows Vista Home Premium Always better to use the protections GTAIV, like many recent titles by now, uses the Sony DADC SecureROM to verify the authenticity of the disc: this means that drivers will be installed on your system and an executable will be launched (one-off) to activate your online copy. The process is extremely simple and straightforward and you will have no limit on the number of installations nor will you have to reactivate your online copy if you uninstall the program and then install it again, except in the case in which you decide to change some PC components, such as the CPU or video card. The digital download version (via Steam) will also have this type of precaution incorporated. As long as these protections don't harm the players themselves (in any way), we're just happy to waste a few extra minutes fighting piracy. The other news The other novelty of the PC version consists of the video editor integrated directly into the game, with which you can indulge yourself in creating your own movies, editing them and then sharing them with the rest of the Rockstar Social Club community: it is, of course, an interesting gem even if, in fairness, we must say that the version of the game we tested had some stability problems with this function and repeatedly brought us back to the desktop without warning. During the game sessions you can record what you have done (up to 30/40 seconds before) by simply pressing a key and then, via your mobile phone (obviously we are referring to that of the virtual alter ego) you can activate the editing module, where you can review the saved clips, cut them, paste them together, add songs, lyrics and so on, until you create your blockbuster. Undoubtedly interesting, this feature gives the user something else to do in the already vast world of GTAIV, but we honestly don't think it can excessively prolong the longevity of the title. Instead, what significantly increases the fun is the multiplayer component, now enriched by the possibility of facing 32 other players in the flesh: as on 360 and PS3, there are 15 game modes and they include Deathmatch, Team Deathmatch, Control of the Territory, single and team Mafya Srl, Cops and Thieves, Rush and GTA Rush as well as free roaming mode. Games are hosted locally and players can connect even while the game is in progress. What impressed was the fluidity and quality of the game that never showed problems both in the loading phase and in the actual gameplay. The construction of the scenarios is excellent and there has been no pop-up phenomenon. To tell the truth, some slight uncertainty was seen in the form of a sporadic lag, but nothing more. The real difference between the console version and the PC version is represented by the characterization of the characters who, in addition to showing a new set of heads, can boast a decidedly revised wardrobe, which also includes very elegant suits as well as a new collection of accessories.", "date": "2008-12-01", "grade": null}