{"name": "Disney Board Games Master", "ref": "https://multiplayer.it/recensioni/disney-board-games-master.html", "text": "Board games represent one of the first forms of entertainment, and especially in the family it was customary to bring out checkers or the good old ~Forza 4~ to spend a few happy evenings. Over time this tradition has been somewhat lost, if you like along with many other things. In fact, compared to ten or fifteen years ago, our habits have changed a great deal, and not always for the better: the so-called ~culture of consumerism~ has transformed our homes into many electronics showrooms, with three or four TVs, at least one couple of PCs, various consoles and, of course, a mobile phone each. This does not mean that the goodness of board games has been lost (after all, the classics never die), but rather that to experience those emotions again one must approach entertainment in a different way, unfortunately losing the bonus represented by the good company in favor of practicality and portability. The genre of board games on mobile phones has always been quite popular, first for a sort of forced choice (the technical capabilities of the first terminals did not allow you to do anything else, in practice), then in the form of a pastime for nostalgics and enthusiasts. With this Disney Board Games Master, both categories are catered for... The game allows us to create three different profiles to share the experience, although sadly it lacks any multiplayer mode. From the start screen you can try your hand directly with one of the three board games available (Othello, Checkers and Forza 4), or start a ~campaign~, which translates into facing three different tournaments (bronze, silver and gold) each divided into about ten trials. The various stages are based in rotation on one or the other game, and as you progress the rules are enriched by extra elements that increase the difficulty: sometimes the boxes are filled with jewels or objects with different functions (bombs , etc.), or you start from a game that has already started and you have to solve a difficult situation. Sometimes, even, you have to solve a ~puzzle~ in which victory can only come by following a well-defined series of moves. The three disciplines lend themselves very well to this type of application, and even those who don't know them well (Othello is probably the least popular game of the group) can learn to appreciate their rules and philosophy in just a few games. The control system is extremely simple and immediate, with the d-pad used to move the cursor on the board and the 5 key to make our move. The graphics of the game are very well done, with an excellent use of colors and an effective interface, which always makes the action extremely ~readable~. The loading screens are also enriched by negative images of some Disney characters, really suggestive. The action is accompanied by some decent quality MIDI music, even if a little too ~sad~ for the context. The controls respond to inputs promptly, with no lockups or other issues. PRO Three games in one Thick gameplay Addictive and challenging challenge AGAINST Discreet music, but a little ~sad~ Maybe too difficult It lacks any multiplayer mode", "date": "2008-12-04", "grade": "S.V."}