{"name": "Dragon Ball: Origins - Recensione", "ref": "https://multiplayer.it/recensioni/dragon-ball-origins-recensione.html", "text": "The Origins of the Myth As mentioned, Dragon Ball Origins narratively retraces what is considered the first part of the series (actually there is no distinction in the comic, the suffix Z only applies to the animated version) from the fateful encounter of child Goku with the enterprising Bulma up to the second Martial Arts Tournament and the related fight with Piccolo. And nothing has been left out along the way, indeed some additional episodes in the animated series find their place in Dragon Ball Origins in the form of extra stages. Oh yes, because Dragon Ball Origins is not the usual fighting game, but an action-adventure that blatantly copies The Legend of Zelda: The Phantom Hourglass, so much so that we could define it as a clone of the exceptional Nintendo game. The adventure is divided into episodes, introduced and concluded by long non-interactive three-dimensional sequences which essentially reproduce the story as if it were a cartoon: the voice dubbing (in English) is limited to a very few lines, the dialogues are in fact entirely textual (in Italian) and decidedly faithful to the original work. The Origins of the Myth Even the lack of censorship of some of the most talked about and hilarious scenes of the series is surprising: in case you are wondering, we confirm the legendary exhibition of Bulma's nudity in front of the Master Turtle, with the subsequent discovery that she had left her panties at home. Well, there is. And there's also Goku's pea in the wind, for that matter, and copious splatters of nosebleeds. The sometimes grotesque irony and soft eroticism that characterized some of the most famous gags are perfectly intact. Dragon Ball Origins is not the usual fighting game, but an action-adventure that blatantly copies The Legend of Zelda: The Phantom Hourglass The Origins of the Myth The polygonal engine that offers these interlude sequences is really excellent: the models of the various characters are similar to their original and extremely detailed counterparts, they maintain the same expressiveness of the original scenes, and enjoy excellent animations. The same engine is also used for the game sessions: apart from sporadic drops in frame-rate in the most excited action sequences, the graphics engine shows no uncertainties, and is indeed very pleasant, colorful and full of details. Perhaps you need to get used to the dual screen view: the space between the lower and upper display in some cases makes it difficult to identify enemies or obstacles. The music in the background is unfortunately not the original, but unpublished melodies that skilfully imitate them, maintaining an amusing and carefree tone in most of the sequences, including action ones: after all, one cannot help but smile when the damage on the toughest opponents is displayed in the form of plasters and bumps! The Legend of Goku It's the attention to detail that makes Dragon Ball Origins a particularly memorable adaptation, but also the originality and simplicity of the control system. As it was suggested, Dragon Ball Origins owes a lot to Nintendo's experimentation with its latest portable The Legend of Zelda, and Goku is controlled exactly as Link was controlled: it is possible to move him with the directional cross, it is true, but the gameplay is designed on the touch-screen and a traditional control is even inadequate. Touching the lower screen with the stylus it is simply possible to make our little hero walk or run, a couple of taps in one direction allow us to roll him away (with timing the same input allows us to teleport him behind the enemy during an attack) and by repeatedly tapping on an enemy or an obstacle it is possible to punch or beat him, depending on the fighting technique used, which can be selected on the fly by another stroke of the stylus. The variety of Goku's fighting techniques is noteworthy right from the start, and as the episodes/levels go by, new skills and combat maneuvers are learned, including the very famous Kamehameha wave: choosing what to face enemies with is important, where Goku's extendable staff offers long-range attacks and automatic defense at the expense of mobility, for example, unarmed combat instead allows for greater evasive abilities. This strategic component, so to speak, becomes fundamental during clashes with some enemies or with the various ~bosses~ that characterize the end of some levels or entire episodes: these battles, just in pure Zelda style, must be faced by following specific strategies or solving simple puzzles while avoiding attacks. For this reason, a slight imprecision in the movements recorded by the touch-screen can sometimes be annoying: it is not transcendental, butit occurs with a certain frequency in the most agitated situations with numerous elements on the screen. The Legend of Goku The puzzles are another fundamental component in Dragon Ball Origins: Goku will often find himself going through caves and forests, for example, which offer the starting point for the main playful phases of the adventure. In most cases Goku will be accompanied by Bulma: controlled by a discreet Artificial Intelligence, the girl will try to defend herself from enemies using her gun, or will reach the next obstacle waiting to be saved or for the puzzle to be solved. the path. Generally these puzzles require the moving of boulders or the recovery of objects, and become more and more complex from stage to stage, offering a remarkable variety to a game unfortunately not particularly long-lived: the main mode can be completed in about ten hours, but the presence of secret levels to unlock and numerous hidden goodies increase the replayability of the levels, individually selectable after completing them. Comment No one probably would have bet on this Atari title: the best surprises are undoubtedly the unexpected ones. Dragon Ball Origins is not only an unmissable game for fans of Goku and his original adventures, but also a very valid action-adventure enhanced by a well-made technical sector, unforgettable characters and a hilarious story, moreover told through excellent cutscenes. It is not a difficult game, also thanks to the variety of audiences it aims at, but it can be played again pleasantly to discover all the secrets and unlock the various bonuses. A true pearl in the boundless production of video games based on the universe created by Akira Toriyama. Pros Very faithful to the original series Technically excellent Very good gameplay Cons Control system via stylus sometimes inaccurate Some frame-rate drops and dual screen not always functional Dragon Ball Origins is available for Nintendo DS. As 2009 dawns, it's hard to account for the staggering amount of video games based on Dragon Ball Z, distributed across all platforms, including the most recent ones. It's really a very long list, and unfortunately not even half of it is worth the purchase. Instead, it is much easier to list the titles based on the ideal first series of the manga, considered by many to be the truest and most inspired, that irresistible and goliardic adventure starring Son Goku as a child, when the story had not yet become an absurd plot of extra-terrestrial invasions, transformations and time travel. Perhaps due to the ease of adapting to the essential concept of the fighting game genre, perhaps due to the commercial potential of the series, the narrative segment in which the protagonist grows up and faces countless battles for the salvation of the cosmos has always been the focal point of videogame adaptations of the masterpiece by Akira Toriyama. A timid attempt to revive the classic series took place at the time of the Game Boy Advance, with a decidedly nice but not without flaws platformer and, for this reason, ended up in the oblivion of missed opportunities. Ironically, Baby Goku lives on today on the Nintendo DS and in a strange twist of fate isn't just a good tie-in for fans...", "date": "2008-12-03", "grade": null}