{"name": "Tomb Raider Underworld - Recensione", "ref": "https://multiplayer.it/recensioni/tomb-raider-underworld-recensione_a.html", "text": "After the events of Tomb Raider: Legend, Lara Croft has discovered that her mother is not dead, but is trapped in a mysterious place: to find her, the seductive explorer will have to re-examine her father's research and discoveries, pushing herself once again beyond the border where reality and legend become indistinguishable. The game opens with a sequence showing Lara's huge house on fire, with the protagonist having to survive the fire unscathed and avoid being killed by her own friends, who don't hesitate as soon as they see her to shoot at her. But why? What happened? The answers to these questions will not come immediately, because in the meantime the action will move to a few days earlier, in the Mediterranean Sea. If in the previous episode of Tomb Raider the developers had drawn heavily from British legends, citing the island of Avalon and the mythical sword of King Arthur, in Underworld there are numerous references to Nordic mythology: during her research, Lara comes across in several statues representing Odin and his son Thor, the god of thunder, who is said to have used magical gloves to wield the mighty hammer Mjolnir. It is precisely after the discovery of one of these ~gloves~ that the situation precipitates, with the arrival of a mysterious and determined organization, which will be able to give a hard time even to a ~veteran~ like Lara Croft. Finding the right path by climbing and jumping always gives great satisfaction. That ancient vase had to be brought to safety... In the transition from Core Design to Crystal Dynamics, the series has found its own direction, which is expressed in a sort of ~compartmental~ exploration, leaving little room for fighting and putting us in front of relatively simple puzzles, which must be solved within of often symmetrical settings. This is particularly true for the Wii version of Tomb Raider Underworld, which right from the start is different from what was seen on PlayStation 3 (but also 2...) and Xbox 360, with smaller locations and sometimes distinct puzzles with a disarming simplicity. Moreover, from the pause menu we will be able to get all the help we need every time to overcome a point where we are stuck, in the form of advice or real solutions: did the owners of the Nintendo console really need it? As in Anniversary, some devices must be manipulated using the Wii-mote and Nunchuck detection system, thus directly controlling Lara's hands, even if this eventuality has become rarer than in the past. Finding the right path by climbing and jumping always gives great satisfaction, especially when the right path is far from obvious. We will often find ourselves using the grappling hook, shooting it with the B key and pulling it with the Z key: it is a fundamental tool for activating certain mechanisms, but also for reaching otherwise inaccessible areas, exploiting its momentum. Move like Lara Croft The controls, in general, appear unchanged compared to the previous Wii episode: the analog stick moves the character, the A button is used to jump while the Z button lends itself to the dual function of moving on the rope and activating the weapons (in this case, trigger B is for shooting). The view can be rotated in two different ways: by holding down the C button and moving the crosshair on the screen (via the infrared device on the Wii-mote) or by using the d-pad. The latter option certainly proves to be more precise, but during the fights both are largely ineffective, with the camera literally going crazy and chaos reigning supreme. It is perhaps for this reason that the developers have inserted the automatic lock-on: we may not be able to see the enemies as we wish, but at least we will be able to hit them with weapons. Well, it's lucky that fights are so rare. The shaking of the Nunchuck once again serves to speed up Lara's movement while she is hanging from a slope, but in general the peculiarities of the controllers are not exploited very much, and in those situations the Wii-mote and Nunchuck reveal themselves (as usual?) far from accurate. Let's also say that Tomb Raider Underworld is one of those titles for which it would be difficult to imagine an ~immersive~ control system, therefore more classic solutions would have been preferable to limited functions, which leave the time they find or even end up worsening the 'experience. Technical realization The character of Lara Croft has undergone a major makeover over the years, however it is hard to get used to what has now become an annual process. Anyway, TRU's Lara is pprobably the best ever seen: the similarities with Angelina Jolie are as obvious as they are obvious, the breasts are abundant as usual but the physique, in general, is decidedly more graceful and ~soft~, something that even Wii owners do not they will appreciate. There has also been an improvement in the animations, slightly more numerous, and the quality of the locations improves immediately after the first chapter. The opening lines, in fact, do not speak in favor of the game, with a decent realization of the water as long as you are immersed, but absolutely unwatchable when you are in the open air, with the waves really too fake and still, and visual solutions not one but two generations old. Once you get to what is the most appropriate scenario for Tomb Raider (tombs, temples and ancient buildings), the situation improves a lot. Too bad for the problematic management of the view, which has already been mentioned, as well as for the frequent drops in the frame rate, which end up affecting an otherwise really good result. Finally, the sound sector is divided between highs and lows: the music is well done, indeed some are really beautiful (although referring in a far from marginal way to the theme of the film ~The Da Vinci Code~), while the effects only escape, but are sometimes played by the mountain speaker in the Wii-mote, with disastrous effect. The Nintendo DS version The series is presented on DS for the second time, after Tomb Raider: Legend, and the improvements are substantial: rather than insisting on the three-dimensionality of the locations to the detriment of the general quality, the developers have tried to limit themselves to a two-dimensional but solid approach. The game is basically a platform, and the similarities with a classic like the original Prince of Persia are wasted between ~pointed~ traps and stunts, which Lara can perform in various ways, counting on a respectable repertoire of animations. The control system is conventional, with the main buttons used for jumping, shooting, rolling and interacting with the environment. The action is displayed on the upper screen of the DS, where the icons of the inventory or the objects of the various puzzles that we will have to solve appear on the touch screen (all very simple, to tell the truth). The technical realization is excellent, with rather detailed and fluid polygonal graphics, which show us sometimes simple scenarios but always characterized by a good use of colors. Music and effects do their job in a more than decent way. Ultimately, we are dealing with a fun and well done product, certainly the best episode of Tomb Raider for Nintendo DS: if you are a fan of the series and want to take Lara with you always, then grab it on the fly. SCORE: 7.5 Comment Tomb Raider Underworld offers for the first time an unpublished episode of the series to Wii owners, who until now have only been able to try their hand at Anniversary. The control system hasn't fundamentally changed, and unfortunately suffers from the usual view management problems, especially during fights. The substance of the game, however, is expressed during the exploration and resolution of puzzles based on moving within the locations: in these situations, the new Crystal Dynamics title appears perhaps simplistic but rather enjoyable and exciting. Lara's polygonal model is the best ever, and despite the limitations of the Nintendo console it manages to monopolize our gazes, even when the surrounding scenarios are evocative and full of charm. From a multi-platform perspective, let's face it clearly, there's no reason why you should prefer the Wii version of Tomb Raider Underworld: the use of the controllers is limited to certain actions and represents a limitation rather than an advantage, with the technical sector which does not go beyond the usual standards. However, if you enjoyed Tomb Raider: Anniversary there is no reason why you should give up this new episode for the Nintendo console. Pros Solid and addictive gameplay Lara is as beautiful as ever Very well crafted scenarios Cons Frequent drops in frame rate Problematic camera management Quite simple puzzles", "date": "2008-12-01", "grade": null}