{"name": "Disney Fairies: Trilli", "ref": "https://multiplayer.it/recensioni/disney-fairies-trilli.html", "text": "Despite the strong association with Disney, Tinker Bell was born from the pen of J. M. Barrie on the pages of the novel ~Peter and Wendy~, which Disney itself later transformed into a highly successful animated film, one of the many timeless classics born in the studios of the house that created Mickey Mouse. It is a tiny fairy, often even mischievous, who has been the symbol of ~Disney magic~ for years and therefore enjoys great popularity, especially among the little ones. Recently, Tinker Bell has enjoyed particular attention, which has led to the creation of a background made up of places and supporting actors, with the inauguration of the ~Disney Fairies~ franchise, and to the creation, this year, of a first DVD cartoons in computer graphics. This was probably the event that convinced Living Mobile to secure the rights to create a mobile video game inspired by the Disney character... Tinker Bell Puzzle, as the title suggests, is nothing more than a puzzle game in which we'll control the fairy Tinker Bell through a series of stages, which must be unlocked one at a time. In fact, the game map shows us a certain number of locations, but only some are accessible from the start and we will have to follow the instructions of the various characters we will meet in order to select them. Each stage has several phases to complete, but not necessarily in a continuous sequence, on the contrary we will often have to go back and forth between one place and another to get objects without which we could not go on. The mechanics of the puzzles manage to surprise, as from such a product one would expect something very simple, suitable for the little ones. Well, things are very different: we won't have to move boxes or align identical pieces with each other, but we will have a limited number of moves available to ~solve~ the stage. How? We will have to deal with a different table each time, with a series of bubbles positioned inside it. Each bubble can be more or less inflated, and we can ~spend~ one of our actions to increase its size until it explodes, with the burst projecting in four directions and hitting the surrounding bubbles as if it were our intervention . The key, therefore, is to pop the right bubbles and in the right positions, so that their burst leads to the bursting of the others, in a chain reaction that can theoretically get us through each stage with just a couple of moves. It is a very brainy and rather demanding mechanic, open to an approach made up of continuous trials and errors. The game's graphics are decently done, with well-drawn sprites and animation of sufficient quality. Let's say that we are a little below the average as far as puzzle games are concerned, given the release of some truly extraordinary products also from a technical point of view. The use of colors isn't bad, but it could have been done better, while the sound sector consists of some decently made MIDI music: nothing striking, but worse would have been expected. As far as the control system is concerned, there is little to report: the d-pad controls our movement on the board, while the 5 key lets us intervene on the selected bubble. PRO Challenging and thick mechanics Good number of internships Discreet Graphics... AGAINST ...but below average for the genre Sometimes frustrating", "date": "2008-11-27", "grade": "S.V."}