{"name": "Shaun White Snowboarding - Recensione", "ref": "https://multiplayer.it/recensioni/shaun-white-snowboarding-recensione.html", "text": "Shaun White, who is this? In his early twenties, Shaun White is an American professional snowboarder. Among his most significant achievements are the Olympic gold in Turin 2006 for the halfpipe and the numerous gold medals collected between 2002 and 2008 in the X Games. In addition to snowboarding, Shaun does not disdain skateboarding, another discipline that has earned him numerous awards. His exploits are extraordinary, also because the boy underwent two heart operations to remedy a congenital defect: this means overcoming difficulties... Four mountains for me... After creating our character using a simple editor, we can devote ourselves to a short tutorial to familiarize ourselves with the control system and begin to orient ourselves in Park City, which is the first location we'll be dealing with. To call up the map of the mountain, just press the SELECT button, and in this way it is possible to check which places have become accessible and where we can find the chairlifts, which together with the helicopter represent the only means we have to reach the summit. To access these structures, just go there on foot, after which we can enjoy the view during the climb or skip the sequence. One of the first tests that we will have to overcome will be the collection of a certain number of coins, three per location, which are found in the most unlikely places: on the top of a ramp, beyond a crevasse or at the end of a track that can only be traveled through a long grind . Changing mountains is simple, just enter the pause menu by pressing START and select the ~destination~ item between Park City, Alaska, Europe and Japan: the journey takes place instantly, and each location boasts a different conformation of the descents, to be learned through the direct experience. The coin challenge is clearly not the only test we will have to face: scattered across the mountains we will find a large number of events of different types, which represent an element of variation compared to downhill skiing and can earn us much more money. Finishing first in the races or in any case performing the greatest number of tricks during the descents, in fact, translates into an economic return which can then be used for the purchase of new boards and equipment: the former are divided into different categories and can change into substantially our approach to racing and stunts, increasing our speed or making life easier when we have to perform tricks or landings to the limit. We can explore the mountains as much and as we want, tackling endless downhill sessions. All together passionately The new Ubisoft product turns out to be very different from the snowboard games seen so far, first of all for the enormous freedom of action and movement that is granted to us (we can explore the mountains as much and as we want, facing endless sessions of free descents just to the fun of it), secondly for the innovative use of online multiplayer. The action can in fact be experienced alone or with friends, indeed some races must necessarily be tackled in a group: we can invite people we know or search among the available matches, to create a competitive group that will compete on the track in a different way depending on the occasion. The particular speed in the search for rooms and opponents can only testify in favor of such an ambitious approach, which should be taken up again for any new productions and which in many ways anticipates the future of online multiplayer as we know it. It must be said, however, that this mode should have been tested better: sometimes it happens to see one's challengers literally sinking into the snow during a descent, and voice chat suffers from all the limitations that PlayStation 3 owners know well. For the rest, the possibility of experiencing the game in its entirety with someone else can only make the experience more fun and engaging. Realism versus spectacularity Another of the innovative elements of the game is its relatively realistic approach to snowboarding: forget the endless and spectacular stunts, or the impossible jumps: although your character can withstand any kind of fall without taking damage (score aside), the momentum that follows jumping from a ramp will barely allow you to perform a complete rotation (whether horizontal or vertical), during which you will have to try to insert as many ~grabs~ as possible to multiply the score. This situation continues until certain challenges are won and special abilities are acquired, which in effect mess up the mechanics to whichup to that point we have become accustomed in favor of a decidedly more arcade situation: it is really strange that we have opted for such a solution. The control system is basically entrusted to the back buttons and the analog sticks: the left one regulates the movement and the inclination (to be dosed well in the vicinity of the throws, because that is where the tricks originate from), the right one allows us to perform various types of grabs, while the R2 and L2 keys respectively operate the jump and the movement of the board in the air. In case you want to perform a grind, you have to jump over a railing and then adjust the balance bar to keep the indicator as central as possible, with the same mechanism that comes into operation when we make a very high jump and have to find the right balance to land without damage. A little practice is enough to master the tricks, even if you never get used to the role of the left analog stick, which by regulating the descent speed very often gets us into trouble when it comes to jumping, with the character leaving in a crazy flip and maybe there isn't the space to be able to complete it. Technical realization The spectacularity of some snowboarding games has made school, so the expectations for this ~next gen~ title were quite high. Let's say right away that the solidity of the locations and the freedom of action are elements that the Ubisoft developers have achieved very well: our character can walk freely in any area of the mountain, which is therefore rendered in its entirety and not limited to the trails we can walk. Certainly more could have been done as regards the outline, represented by shops, bars and structures located at the foot of the mountain: the buildings show a poor level of detail and interactivity is practically nil, which is really a shame given the feeling that we wanted to give to this production. The snow and trees are very well done, with an excellent sense of depth, but the frame rate often suffers from uncertainty when we move the camera independently. Although the locations and the slopes are generally well done, the thrill of the chasms and improbable jumps is missing, while the structures that allow the execution of stunts are not as numerous as they should be and must be looked for a bit during the descents. The game boasts a good Italian dubbing and a high quality signed soundtrack (there are songs by Incubus and Audioslave, among others), even if the number of songs is far from huge. The sound effects related to the snow and the table are good and quite realistic, but also in this case the ~outline~ is missing and there is a bit too much silence. Comment Shaun White Snowboarding presents itself as a good quality product, with some innovative ideas and a new approach to the genre: our character can move freely within the four available locations, exploring them and trying his hand at both downhill sessions and races . The latter must be tackled alone or with friends, using an online multiplayer system that has enormous potential and which in practice does not place barriers between the two types of experience. The execution of the tricks and the management of the board respond to decidedly more plausible rules than the average snowboard game, however renouncing, in this way, a good part of the spectacularity that has always been the hallmark of this kind of production. We also need to add a certain linearity in the available events (which are not very numerous, on the contrary) and a control system that metabolizes quickly but suffers from some solutions that are anything but intuitive. Not to mention the surrounding elements, which in a ~free~ context like the one we wanted to create needed to be valued to a minimum. In short, the new Ubisoft title achieves its purpose only halfway, proving to be rather limited as soon as its structure is fully understood. However, it is a product that introduces some valid and interesting concepts, concepts that we expect to be reused in the future. Pros Great feeling of freedom ~Total~ and innovative online multiplayer Good construction of the mountains... Cons ...but little attention to the surrounding elements Limited game structure Control system not great", "date": "2008-11-24", "grade": null}