{"name": "Strong Bad Episode 4: Dangeresque 3 - Recensione", "ref": "https://multiplayer.it/recensioni/strong-bad-episode-4-dangeresque-3-recensione.html", "text": "Fourth chapter and it is increasingly difficult not to feel like a jammed recorder, obliged as we are to repeat every month how good TellTale's work has been in making accessible to all the inspiration offered by the series of cartoons available on the web Homestar Ruiner, taking the 'now mythical character Strong Bad, a Mexican wrestler, and focusing on his crazy personality such a solid and fun episodic series. In this case and as we will see later, the decision was to set aside some of the rules kept up to now, partially distorting the experience and finally proposing something really fresh from the point of view of narrative methods. Thus, at least in part, the polemical and critical tone trademark of the American developer is lost, gaining however in involvement and originality. action Instead of asking the player to move in the fictitious world of Homestar Ruiner as happened up to now, he will be asked to move in the even more fictitious world of the action film Dangeresque 3, starring and directed by Strong Bad and inspired by the most genuine and hilarious b-movie tradition with epic tones, with great pretensions and few means. The story of the game will therefore be that of the film, just as the problems faced will be those that the protagonist will have to face in the film: a decidedly good idea to completely change the cards on the table, developed in an excellent way and capable of making people laugh thanks to the thousand references and quotations, crippled in an absurd way and reproduced with deliberately tacky and poor materials and effects. As often in the TellTale house, it is therefore the script that imposes itself and convinces, with specifically several new characters introduced or revisited and settings that for story reasons will be upset and modified compared to those usually known. The gameplay is the usual mix of point and click dynamics and puzzles, with an average difficulty more similar to that of the first two chapters and oriented towards the bottom, almost completely devoid of backtraking and with little interaction between the different objects offered. Many extras add a whiff of longevity to the handful of hours needed to complete the adventure: the cinematic nature of the story has given rise to a series of mock interviews, small specials and shots of fake mistakes as often seen in products for the home video, while the usual arcade with a retro flavor is inevitable, this time a 2D shooter with a space setting which in its good realization does not exalt as has happened other times. Film music Graphically and as widely predictable, there is neither forward nor backward, with the usual flash game style that makes a fine show of itself, standing out for its originality but certainly not for its technology, even if artistically this time you can see less bare and more fantasy environments . On the other hand, the music that mimics, based on the situations, that of many famous films is very beautiful and in particular a tune that many will not find it difficult to trace back to a famous spy movie stands out. The dubbing is beautiful as always, with attention to the smallest details even if only in English, as are the subtitles. Comment All in all Dangeresque 3: The Criminal Projective is, albeit slightly, the best chapter of the series, capable of detaching itself as atmospheres and suggestions from the remaining chapters and proposing an unprecedented, fun and full of cinematographic references. The regret remains for an excessively soft difficulty and a not brilliant mini arcade game as has happened several times in the past. If owners and admirers of the previous ones, take it with your eyes closed. Pros Great movie buff Technically very enjoyable Fun from start to finish... Cons ...beginning and ending are very close to each other Bonus arcade game not as good as other times PC - System Requirements Minimum Requirements Processor: 1.5 GHz RAM: 256 MB Video Card: 3D with 32 MB Disk Space: 240 MB Test Configuration Processor: Intel Core QX6700 RAM: 2 GB Video Card: NVIDIA 8800 GTS 320MB", "date": "2008-11-24", "grade": null}