{"name": "Il lato oscuro di Peter Parker", "ref": "https://multiplayer.it/recensioni/spider-man-il-regno-delle-ombre-recensione_a.html", "text": "They killed Spider-Man... Raise your hand who doesn't want to be a superhero! Me for example: too many commitments, and zero downtime... But Peter Parker, you know, is a person selflessly willing to do anything to save the world from bad guys. And therefore he is also in the front row when Venom, always him, arrives in Manhattan, unleashing panic thanks to a new, incredible ability: that of splitting into an indefinite number of copies! With the help, therefore, of a newborn army, made up of helpless passers-by and possessed heroes, the black alien with the forked tongue even manages to ~infect~ our beloved Spidey, who in addition to the usual red-blue tights, will therefore be equipped also of the mysterious (but terribly more elegant) dark outfit. ~With great power comes great responsibility.~ Imagine yourself from two By simply pressing the right analogue lever, you will instantly switch from one version to another, thus having the agility and versatility of the classic costume, or the devastating power of the black one. All of this obviously has strong repercussions on the gameplay: it will be up to the player to face enemies in a more canonical way, taking advantage of Spider-Man's acrobatic skills, or choose the path of ~Evil~ thus being able to count on the brute strength of Venon. In this case you will even be able to launch cars against the unfortunate opponents, who will not necessarily be bad: the possibility of switching from one costume to another will in fact also be fundamental at the plot level; if therefore in the previous chapters there was only one opportunity for resolution (read, strictly in rhyme: ~clean sweep of every enemy force~), in the Kingdom of Shadows you can choose to marry evil, and fight against those ideals that have always guided you . Moral of the story: depending on your actions, you can come across four different endings, effectively increasing the ~replay~ factor of the title. Factor, unfortunately, strongly compromised by the repetitiveness of the adventure. In fact, the game does not stand out for its variety of action: characterized by the usual Free Roaming framework, the gameplay is based on the classic succession of missions. Unfortunately, these will be dull and banal, and lack bite in almost all cases. In fact, if we make an exception for the fights with the Bosses, made adrenaline-pumping by the excellent combat system we will talk about later, for the rest of the time you will be called to the most basic actions, such as eliminating snipers stationed on the roofs, or stopping of runaway cars. The secondary (and therefore optional) missions make the situation worse: these are limited only to stopping a certain number of criminals, or to rescuing civilians in difficulty. Again, again, and again... All this would probably be more bearable if your wandering around looking for trouble was accompanied by a pulsating New York; and instead, you will soon notice the absolute lack of characterization of the city. All the same buildings, cookie-cutter passers-by, and no secret places. The only thing you will find on the bare roofs of the skyscrapers are spiders, which when collected in a certain number allow the enhancement of one's skills. A role-playing component, this, which embellishes the title, and helps the player not to use the very expensive blu-ray as an expensive coaster. Our alter ego is in fact equipped with three types of techniques: on the ground, in flight and ~climbing~. Each technique has a large number of moves, to be performed through the most disparate combinations. Before unlocking a new move, however, it will be necessary to reach a predefined number of experience points, largely obtainable by completing the various missions. This is how your fights, initially based on the use of two or three basic combos, will become spectacular and exciting, leaving a nerd smile on your face that you will certainly be proud of! To further satisfy your thirst for comics, the developers have seen fit to include many other icons of the Marvel universe: fascinating characters such as Luke Cage and Wolwerine will therefore become pillars of the main storyline, and can even be called to the battlefield via the simple pressure of the digital cross. In case instead you prefer to marry the cause of Evil... Well, get ready to sweat the proverbial seven shirts, because you will find them on your way! Technical realization Technically speaking, the game is very far from today's best productions. The game environment is in fact dull and depressing, while the enemies enjoy almost no characterization, being ofdifferentiated at best exclusively by a different color. However, the few polygons and the general poverty of textures contrast with the animations of the protagonist, they are very convincing, and supported by a frame-rate anchored to 30fps even in the most agitated situations. Similar ~feelings~ grip the sound sector: your deeds will be accompanied by very well orchestrated and enthralling music, but it is the dubbing, bordering on the grotesque, that gives the audio department the odious minus on the register. Why give Spider-Man, a man who supposedly never has to ask, an old maid's voice?", "date": "2008-11-20", "grade": "7.0"}