{"name": "Blitzkrieg: Rolling Thunder", "ref": "https://multiplayer.it/recensioni/blitzkrieg-rolling-thunder.html", "text": "Old cloths, new contents? Blitzkreig presents itself as an old-fashioned real-time strategy game with a strong tactical component. The maps, not too large, concentrate large quantities of units in small spaces, and the action always develops from close clashes between the forces in the player's possession and those of the enemy. The large number of vehicles and units available give the game an unexpected breadth and allow for an immersive experience and a fairly faithful reconstruction of the conflict. When buildings, aircraft, vehicles, and land units are considered, the total number of objects well exceeds one thousand. As always happens in these cases, the greatest importance is given to the historical reconstruction of the re-proposed battles, almost as if to create an impressive interactive encyclopaedia on the Second World War. This expansion leaves the main structure of the original game unchanged, making only a few minor changes, such as the addition of the ~Elite camouflage~ ability that makes ~elite~ troops invisible until they open fire on enemies. The AI has also been overhauled, with the enemy's handling of snipers improved. The main objective of the mission is now accompanied by a secondary mission, through which it will be possible to collect bonuses and additional units to join your army. The forces in the field The management of the troops, which has also remained unchanged compared to the previous titles, offers the possibility of governing entire infantry platoons by selecting at least one of the components of the desired company; in this way during the most agitated phases of the fighting it will be possible to maintain control of the situation without having to waste time looking for units scattered on the map. The buildings located on the map are not only an obstacle, but are an active part of the scenario, being able to be occupied and used as outposts to launch attacks on enemies. Damaged vehicles can be repaired by special troops who have the task of supplying and carrying out vital rescue activities for the armored vehicles. A further ability of heavy vehicles is that of being able to entrench, thus increasing the defensive level and shooting capacity, but exposing themselves more to enemy fire. Sprites? The general aspect of the game is perplexing, as, from a technical point of view, Blitzkreig appears as an outdated title, devoid of all those graphic frills to which we have become accustomed in recent years. The graphic design, while giving the illusion of three dimensions, offers nothing more than a fixed isometric perspective map on which models made up of sprites for infantry units or 3D renderings for vehicles move. The animations appear a little too flat and lacking in depth, and often one gets the impression of governing an army of puppets all the same. The visual impact, therefore, is not the best, and risks ruining the party, since, all in all, this title reserves some good cards. For example, the management of fights and artificial intelligence could compete with that of the corresponding titles equipped with cutting-edge graphics engines. Comment In conclusion, this expansion gives the original title greater longevity, but does not change the general aspects of a game, which although it cannot be defined as disappointing, at least as regards the gaming experience, cannot rise to the title of best RTS in history . However, it is still pleasant to spend a few hours of play in front of the monitor in the company of the new missions proposed by Rolling Thunder in an attempt to relive the conquest of Europe and Africa in the role of the allies. We are now waiting to see what Blitzkreig 2 will offer again, already announced. Pros: Good reproduction of vehicle models Wide availability of units Cons: Outdated graphics Not too large maps After Burning Horizon CDV and Nival offer a new scenario for fans of the Blitzkreig saga, waiting for the release of the second chapter; it's about Rolling Thunder, stand alone expansion of the famous RTS. If in Burning Horizon, the previous expansion, the player was called to take on the role of Erwin Rommel, the Desert Fox, now the time has come to switch to the side of the allies, under the command of General George Patton, hero of the world war . The game offers eighteen new missions in single player mode, through new scenarios never seen in previous titles, such as Australia, Guinea, Siberia and Spain, focusing on the events that revolved around the entry into the war of American forces in the coalition Allied against Axis forces.", "date": "2004-12-06", "grade": null}