{"name": "Banjo-Kazooie: Viti e Bulloni - Recensione", "ref": "https://multiplayer.it/recensioni/banjo-kazooie-viti-e-bulloni-recensione.html", "text": "A bizarre adventure that deviates from the ordinary canons Banjo and his trusted feathered friend Kazooie are back as protagonists with an adventure that is far from the canons and gameplay to which the classic series of platform games had accustomed us. In ~Screws and Bolts~ (this is the subtitle of the game) it is essentially about building, modifying and perfecting vehicles that we need to carry out missions and races, wandering around a colorful world full of things to do and see. The story sees Banjo oppose the evil witch Gruntilda for control of the Spiral Mountain, through numerous tests conceived and organized by LOG, the supreme creator of every video game. Even those that have sold less ~like Grabbed by the Ghoulies~, as the protagonists of the game themselves admit candidly and with a distinctly British veiled irony, referring to their most sensational failure since they have been with Microsoft. The whole game is very witty and self-referential, referring to the Rare tradition and quoting many plaforms including Super Mario, more or less directly. Many historical characters from the series return in this third chapter: the shaman Mumbo, Bottle, Jolly Roger, Tip Tup, the polar bear Boggy and many, many more. The whole game is very witty and self-referential, referring to the Rare tradition and quoting many plaforms A bizarre adventure that deviates from the ordinary canons Just as happened in Mario64, special objects must also be collected here that allow us to open the doors of the various worlds, but this time it is not about stars, but about Jiggy, special golden tiles that can only be obtained after completing the various missions of the game. The phases can be divided into two distinct and extremely different types. In the first you explore the surrounding world on foot, as in any other three-dimensional platform, jumping on the roofs of houses, wandering through hills, rivers and animated villages populated by the most bizarre creatures. During the time thus spent in the world of Banjo, quests are acquired and musical notes are collected, scattered to the four corners of the map so that anyone who plays will be encouraged to explore. Once a mission has been accepted, the second phase begins: Banjo is transformed into a cross between LEGO bricks and Mario Kart, mixing racing elements with creative ones. The missions are extremely varied and put the player in front of a huge amount of things to do and overcome. Each world functions as a sort of large container of missions, each one different from the other even if they share the same playing field. Create, try, play: it's the new Bnajo experience In Banjo-Kazooie: Screws and Bolts you never get bored, because each Jiggy is conquered in a different way. There is to compete against other characters, or escort a vehicle. You have to fly, go underwater, hit huge targets with your vehicle, do speed challenges, find hidden treasures, steal dangerous bombs. Each mission requires a suitable means of transport in order to be completed, and here in the pre-game briefing it is possible to choose the vehicle that seems to us most suitable for the characteristics of the race. But the highlight of the game is yet to come, because this Banjo revolves around the concept of editability and improvement. Every part of your car/motorcycle/plane/boat can be moved, deleted, added, rotated, lifted, flipped, so you can create just about anything with your imagination. in the pre-game briefing it is possible to choose the vehicle that seems to us most suitable for the characteristics of the race Create, try, play: it's the new Bnajo experience In the city it is possible to buy spare parts that can be used in the vehicle editing process: there are engines, tails, wheels, mechanical parts and hundreds of other pieces that combine to give infinite possibilities for customizing and creating. The performance of the vehicles varies a lot thanks to our modifications, thanks to an excellent physics engine that makes each modification tangible and immediately verifiable. For example there is a level in which we have to try to throw down the highest number of dominoes, and to do this we need to create a flying vehicle which, once it reaches the highest possible speed, drops on the target with a wingspan extremely wide. In another race, however, we are committed to delivering radio transmitters to specific points on the map, and to do this we have created fast motorcycles but equipped with an external trunk that carries the antennas. In still another one fights against an opponent following the rules of Japanese sumo, pushendolo therefore outside the pre-established ring. To do this we had to greatly enhance the engine to obtain a greater thrust, but trying to preserve agility and speed of movement. Explore, collect, modify! The creative gameplay of the new Banjo represents the new element of the series, and can potentially prove to be the juiciest and most appreciated novelty by the players. Its atypical nature may make it appealing to many, while it might distance it from those who would have liked a ~simple~ platformer. The personality and tastes of the gamer have never been so discriminating in a game of this kind. The general handling of land vehicles is not very good, and the physics applied to every object visible on the screen often causes more damage than joy, making the game exciting, but sometimes complicated. For example, it can happen that you get stuck with your car between two stones, right in the middle of a timed race; or it may happen that you swerve excessively from one side to the other, hitting the side walls or protective trees, and not easily be able to regain full possession of the vehicle. During the platform sessions there is no problem, on the contrary the competitive races can suffer from an excessive realism of the collisions which sometimes damages those who are playing against the CPU. The musical notes, which in the first Banjo were used to unlock new doors and in the Tooie chapter made us learn the moves, in this third chapter are used to buy spare parts and upgrades for the vehicles. There are almost 1900 scattered around the world, and finding them all will be a truly difficult undertaking, but one that will tickle every adventurer's desire to explore. The creative gameplay of the new Banjo represents the new element of the series, and potentially the juiciest novelty Explore, collect, modify! After the element of modeling, exploration and collection are therefore two other keywords that join the blend of the unique gameplay of Banjo and Kazooie: Screws and Bolts. There are already pre-built vehicle sets to start with, of course. In the briefings that precede the missions we are shown various details concerning the challenges themselves: objective to be achieved, time available, means allowed. During this phase it is therefore possible to choose the vehicle that can do the best for us and that is able to better exploit its characteristics. It is interesting to note how the cars, helicopters and other means that the game makes available to us by default already do an excellent job in themselves, and that further modifications are often useless, if not harmful. Most of the time, therefore, it is only necessary to choose the right vehicle without further upgrades. Depending on the time obtained to complete the mission, however, various rewards can be obtained. To win the Jiggy useful for unlocking new worlds, just do an average time. The various modifications to the vehicles thus become indispensable when you want to beat a record time or get the most out of a challenge. This factor makes the difficulty level of the game scalable and suitable for both casual players and hardcore gamers, who will certainly work harder in the edit section to get the biggest rewards from the competitions. Front row rare The world of Banjo and Kazooie has never been so colorful and detailed. The whole game is an orgy of extremely detailed polygons, effects and textures, without suffering from particular slowdowns and running on the screen in an unexpectedly fluid way, apart from the situations that are really too expensive in computational terms. In air missions it is possible to better appreciate the three-dimensional load supported by the Xbox 360 graphics processor, which displays every minimum detail with an enviable and rarely appreciated nonchalance in a next-gen videogame. Up close, the polygonal elements are very detailed and enjoy textures full of all kinds of effects. Refractions, particles, transparencies, convincing shadows, light sources, water with realistic reflections and applied physics. The new Banjo and Kazooie once again demonstrates the Rare team's familiarity with powerful and flexible hardware like that of Microsoft, and represents a great example of what is possible with the machine. The whole game is an orgy of extremely detailed polygons, effects and textures Front row rare Although the sound effects are subdued and numerically limited, the soundtrack takes care of reviving the fortunes of an otherwise anonymous audio sector: the music is all orchestrated, well characterized and with a style that goes perfectly with the light-hearted and cheerful tonero underpins the whole game. There are also numerous famous remixes that will delight many Rare fans. This new Banjo is a complete and complex game, therefore a section dedicated to Xbox Live and network gaming could not be missing, which includes numerous options such as competition between friends, sharing of the editor's creations and the possibility of taking pictures and making them the 'upload to the official site. Certainly this is not the real juice, but they are options that increase the already very high longevity of the title. Comment Banjo-Kazooie: Screws and Bolts is an atypical chapter in Rare's historic platform saga. The English team has always accustomed us to changes and novelties, but finding so many all together could disorient and make more than one person skeptic. This new chapter of Banjo is not a classic platformer, but an original mix that mixes elements of customization and fantasy, vehicles, exploration and collection. It's a game in which there are tons of things to do, hundreds of missions each one different from the other, tons of artistically and technically wonderful places and levels to visit. The difficulty level is scalable making it a game that is suitable for practically anyone. Too bad for some problems in driving, the legacy of an all too painstaking collision and physics system, which does not go well with such a frenetic and fast title and intended for a vast audience, which would have needed greater fluidity. Definitely a must try if you are willing to give a chance to the new formula created by Rare.Pro Lots of things to do Technically excellent Orchestrated music Ironic and fun Cons The editor of the vehicles is often not indispensable Some problems in guiding the vehicles Too much complex for the audience it seems to be targeting Sound Effects Xbox 360 - Goals Banjo-Kazooie: Screws and Bolts provides the player with the canonical 1000 points to unlock. The game is quite generous and already after the first few hours we can have achieved the first eight to ten goals. Continuing the adventure, all the others are unlocked with a moderate progression, simply by continuing to collect notes, new levels and new worlds. Some objectives reflect the ironic and fun nature of the game.", "date": "2008-11-19", "grade": null}