{"name": "MotorStorm: Pacific Rift - Recensione", "ref": "https://multiplayer.it/recensioni/motorstorm-pacific-rift-recensione.html", "text": "Earth, fire, air, water, these are the four elements that characterize the game experience of Pacific Rift, where mud and clashes are still the masters, but this time with 16 tracks and 16 players on the screen at the same time, even online. Once again it is the festival that is the focal point of this production, divided into four categories which also represent the game setting. Each event is accessible by ticket, and for each placement in the first three positions you get the points necessary to level up and therefore to unlock new races, of obviously increasing difficulty. This is basically the progression of the game, but with some diversions aimed at making the single-player campaign more varied, such as having to finish the race within a time limit or with a maximum number of explosions (conditions necessary to unlock some events) rather than racing in elimination mode, where every few seconds the last in position is eliminated from the race. To support the ~scene~ and contrast a progression for large stretches already seen and long repetitive, we really think about the setting and the excellent design of the tracks which, either for the greater variety, or just for their realization, are a pleasure to face even several times, in an attempt to experiment with all the best shortcuts, jumps and roads to gnaw precious seconds off the other opponents. By far the most difficult are the volcanic ones, where you often pass away, while the more spectacular ones see views with vegetation rather than waterfalls full of jumps and points to be tackled at maximum speed. In any case, the gameplay formula does not change, if not marginally, where based on the chosen vehicle class, to which one is added (Monster Truck, for a total of eight) the feeling with the track changes radically, with the bikes which restore driveability and maximum speed, but a rustle of wind is enough to crash against the roughness of the route, while with a lorry you are indestructible but certainly not able to compete easily on tracks where it is important to keep your foot on the accelerator often. In this sense we have not found major changes compared to the first Motorstorm, but indeed the physics sometimes seemed too ~sensitive~ and accentuated, which is felt in very frenetic situations and above all with some types of vehicles such as quads and buggies . For the rest, with the lats you accelerate and brake, there is the handbrake, two game views, the possibility of mocking and smacking your opponents and using the turbo, slightly revised in this sequel. In fact, the filling of the limit bar at the bottom left is affected by atmospheric conditions, using the turbo near hot spots will cause the bar itself to rise much more rapidly up to the explosion limit, conversely passing under a waterfall or in a lake will result in a cooling and therefore to a more prolonged use of the greater thrust in speed. This novelty certainly adds a minimum of more strategy to the races, which unfortunately in single mode do not offer a very high challenge, not because of the difficulty, often even high, but precisely because of the involvement of the opponents, who often compete on their own . The situation improves considerably online, where if on the one hand we have few modes, on the other hand when the opponents are controlled by humans the game becomes much more fun, because Evolution Studios has managed to fix all the little problems of the first chapter, thanks to better management of the voice chat, to the introduction of matchmaking, to the possibility of challenging up to 15 people at the same time and to a growth system also online, which allows you to reach certain levels based on your placements, and therefore to challenge people of equal rank. Of course, there is no shortage of rankings (even single ones per track), filters for friends and the possibility of inviting them directly into the game, according to a trend that is gradually establishing itself (finally, we might say) also on PlayStation 3. For the rest we have a trial mode with classified times (to be tackled even in elimination) multiplayer in splitscreen (horizontal or vertical) or even in four on the same console, many extras such as sketches, costumes and many new skins for your half-man as we continue in the festival. Dulcis in fundo, the classic photo mode, through which it is possible to take pictures of moments of the game, even by applying some filters, and save them on your memory stick, as well as consult them using the appropriate album section present within the game. The technical aspect, compalso the decidedly varied setting, returns some passages that are truly impressive in terms of impact, either for the excellent use of HDR, or for the polygonal conformation of the tracks and for what happens on the screen. It is a big pity, however, that the textures are decidedly fluctuating, and above all not infrequently ~mixed~, unclear and with some aliasing problems, aspects that undermine a technical sector that would otherwise have been excellent in every situation. The music takes up those of the first chapter in style and adapts perfectly to what happens on the track, there is no shortage of famous artists such as Fatboy Slim and Megadeth, while the sound effects are devoid of novelty and do their job without infamy and without praise. Comment The freshness of the first chapter is missing, as well as innovations worthy of such note, but Pacific Rift is always a pleasant and fun title, which continues on its way without real direct contenders and enjoys a well thought out multiplayer sector, both offline and online. We would have expected a little more in terms of physics management and a greater number of game modes, but the rest is done with all the trappings of the case, keeping intact and indeed expanding the merits of the first Motorstorm. It is therefore natural to recommend it to those who have appreciated the original title or to those who have not yet traveled the muddy and insidious roads of this production, but who have always been fascinated by it. Pros Excellent track design Fun and varied Excellent offline/online multiplayer Cons Graphically good, but undermined by aliasing and muddy textures Gameplay practically identical to the first Motorstorm Physics sometimes unbalanced", "date": "2008-11-10", "grade": null}