{"name": "Ben 10: Power of the Omnitrix", "ref": "https://multiplayer.it/recensioni/ben-10-power-of-the-omnitrix.html", "text": "Ben is a normal kid, until he stumbles upon an alien artifact while camping with his cousin Gwen. The device is powered by the mysterious power of the Omnitrix, and binds to Ben in the form of a bracelet: by activating it, the boy is able to take on the appearance of various aliens, each with particular powers. Ben decides to use this gift to fight crime and threats to humanity, wherever they come from; and it does so through four highly successful seasons broadcast by Cartoon Network between 2005 and 2008, crowned by the release of feature films as well as merchandising which, in addition to including the usual action figures, has a tie-in for Nintendo DS and PSP, as well as this mobile reduction made by GlobalFun. The game has only one mode, and as mentioned it's a scrolling beat'em up, in which we'll control young Ben in a series of different locations. We will find ourselves facing a large number of enemies, including alien life forms and dangerous robots, and we will have to get rid of them using offensive combos: by repeatedly pressing the 5 key, Ben will hit the enemy with kicks and punches, until he can permanently eliminate him with one blow more powerful, activated via the d-pad. The development of the stages is divided between clashes and traps, which must be avoided by performing somersaults or slides. In the presence of walls and barriers of different types, we will find ourselves necessarily having to resort to the power of the Omnitrix: by holding down the 5 key, Ben will transform into a powerful alien, whose shape changes according to the icon located in the top of the screen, and which can be changed by pressing the left soft key. Once assumed the alien form, the character will be able to strike in a much more effective way and use special moves that vary depending on the case, just waiting for the Omnitrix's energy bar which is located under the vital energy bar, which empties over time but can be restored after eliminating enemies. The forms available are quite numerous and can be unlocked by successfully completing a minigame between one stage and another. However, the game mechanics do not change much: the combat system remains the same, the enemies move according to overused and repetitive patterns, without ever representing who knows what challenge, and the action in general is linear and repetitive. The technical realization moves between ups and downs, without ever shining: the sprites boast a good set of animations, but the quality of the same leaves something to be desired. The impression is that the characters and the background fight a bit, perhaps due to a not always exceptional use of colors. It must be said that the forms that Ben can take are numerous, and that each one has characteristic movements. In addition, the enemies are quite varied and are drawn in an unobtrusive way. In short, there was a commitment from the developers: perhaps what is missing is the style, since sometimes it seems to be faced with an amateur production. The sound performs its task without infamy and without praise: there are no effects, just a series of moderately made MIDI music, unfortunately not very incisive. PRO A large number of sprites Simple and immediate Based on a successful cartoon AGAINST Trivial and repetitive action Acerbic character design Not fun, not long lasting", "date": "2008-11-07", "grade": "S.V."}