{"name": "Quantum of Solace", "ref": "https://multiplayer.it/recensioni/quantum-of-solace_a.html", "text": "There is no doubt that agent 007 is one of the most charismatic characters ever. The film series, officially inaugurated in 1962 with Sean Connery as the protagonist, is based on the novels by Ian Fleming and narrates the adventures of James Bond, an English spy who works on behalf of MI6 and who more than once finds himself having to eradicate alone global threats. Over the decades there have been several actors who have dressed the impeccable role of Bond, and the films dedicated to him have never known particular crises, especially on British soil. However, the recent change of course with the signing of actor Daniel Craig (initially criticized by many for not being ~handsome enough~ to play agent 007) for ~Casino Royale~ served to make the more modern and current series, as well as to give the character that pinch of human weakness that he has always lacked. A successful experiment from all points of view, which sees a direct and natural sequel in the new episode ~Quantum of Solace~: James Bond wants to shed light on the facts that led to the death of the woman he loved, and has every intention of go all the way. We are faced with a two-dimensional action game in which the standard game action is sometimes replaced by alternative phases, which aim to retrace the events told in the film. Our character has a vast repertoire of movements at his disposal: he can run, jump, cling to ledges, crouch and use a good number of different weapons to get the better of his opponents. The early stages are quite eventful, and they see us chasing a hit man across the rooftops of the city: we'll have to jump with precision and timing, trying not to lose track of the killer as he shoots at us to slow us down. Subsequently, things will become more ~quiet~ and we will be able to focus on the combat system: Bond can perform a combo of kicks and punches capable of knocking out weaker enemies, but completely ineffective against the beefy gorillas that we will face in the advanced stages . For this we will come across a rather varied arsenal, which shows in the lower part of the screen the bullets that we still have in the barrel and that we will have to use wisely: even if the shots are infinite, the reload times can put us in difficulty, leaving us at the mercy of our opponents. It is possible to create even rather elaborate shootings, hiding behind a crate and then coming out only when it is time to fire. However, it is unusual to have to destroy the same crate in order to continue, since we cannot simply climb over it. Between fights and platforms to climb on, we will also find ourselves having to hide using the stealth element, especially when we have no weapons and will only be able to overwhelm the enemies by taking them by surprise. For this mobile reduction, Glu has tried to do a job that is up to the situation, adopting some innovative solutions as regards the graphics. The character of Bond was probably designed as in the ~acrobatic~ titles for mobile phones (the reference is in particular to the Freestyle Moto-X series), i.e. starting from a vectorial solution which guarantees a decidedly above-average fluidity as regards animations... even if at the expense of detail. Unfortunately the scenarios are too trivial and repetitive, as well as the enemies, almost all identical to each other. PRO Very smooth and varied animations Good number of weapons Quite challenging AGAINST Character design lacking in variety and detail Dull and repetitive scenarios Without thickness", "date": "2008-11-10", "grade": "S.V."}