{"name": "Gears of War 2 - Recensione", "ref": "https://multiplayer.it/recensioni/gears-of-war-2-recensione.html", "text": "Bigger and badder than ever! Gears of War 2 fits perfectly in the groove left open by its predecessor. The locusts have far from given up, indeed, to hear what the narrative voice of their Queen says, they never will. They continue to dig the earth from within, unstoppable, with the new project of sinking the last outposts of mankind into its bowels, including Jacinto, the largest capital that survived the war and the last bastion of our defenses. Where the first chapter began with Marcus ended up in prison for a trial linked to the death of his mysterious father and recovered from the ranks of the army as a last resort, now the COGs are very clear that, without our hero, there is no hope of survive the ongoing battle. It's up to Marcus to train the new recruits, the brother of that Carmine who died in the first episode, training that is nothing but the tutorial with which to regain confidence with the control scheme that made the history of the Xbox 360. And it is to him that the troops refer at every juncture, both the new co-stars - such as Tai, the Maori warrior, or Dizzy, the cowboy chariot driver - and the members of the old team who gather along the unraveling of the levels in a adrenaline-pumping crescendo of pure Hollywood origin. Cliffy B had promised a game that, without betraying the public's expectations, would be bigger, badder and longer lasting, and he kept his word. Gears of War 2 is like the sequel to a cinematic epic that develops and expands on almost all the best features of the previous episode, without bothering to explore new paths. The story is, as always, that of an action film, peppered with twists and bigger and bigger monsters, with some of the characters who, however, are deepened, up to leaving the feeling of a real handful of heroes in a war much bigger than them. This nuance is helped by the secret objects that must be collected during the game, which are no longer just the dog tags of the COG, but which vary from posters to dispatches, up to the pages of the diaries of the soldiers who died at the front, which help to give content to the universe created by Epic, along the lines of what Irrational Games did with the Bioshock podcasts. Some of the new characters make little more than an appearance, and some dramatic moments are perhaps underused. The ride towards the end, however, has some moments that will make you jump with adrenaline and this, in an action, is all that is expected. Moreover, the Locusts let the player enter their underground world, which is enriched with temples and hieroglyphics, to show the existence of an alternative culture to the human one, with hierarchies and accessory creatures, protagonists of some of the most spectacular sequences of the whole campaign. And which we won't tell you about so as not to spoil the surprise. The official guide of Multiplayer.it With the arrival of the new ninety piece of the Xbox 360 line-up, or Gears of War 2, also comes the official strategy guide published by Multiplayer.it. The official guide of Multiplayer.it The color volume, (304 pages, 14.90 euros) provides an indispensable compendium for having the upper hand in the tough fight against the locusts. The contents are divided into material dedicated to single player and multiplayer modes, including the new ~Horde~. Also included is a full color poster printed on both sides. New moves In GOW 2, when you are knocked out on the ground, you can crawl to escape from locusts and try to get revived by teammates. When monsters do it, several possibilities open up: X to finish off the opponent with a kick; Y to mount on him and punch him; B to end it with a kick from the butt of the held weapon. By pressing A, however, you grab it and use it as an organic shield to take cover behind, while shooting with the basic pistol. All these possibilities will express their maximum potential on the net. Sheltered! The gameplay has remained substantially unchanged: active reloading, the cover system, which we will return to later, the lancer's chainsaw and white weapon clashes are back. The novelties consist of weapons such as the flamethrower, a pistol that discharges bullets at intervals, like a small machine gun, and a new type of bomb. The now famous chainsaw duels or the new ~moves~ in melee, are likely to have much more relevance for multiplayer. For example, shielding yourself with the stunned body of a locust is rarely useful during the single player campaign, while we don't struggle to imagine how decisive it can be in a fight in which the opponents want to reuse the possibility of resurrecting a teammate, rather than riddle them with bullets to take the player who is blocking behind. What changes, in a more evident way, is the pace of the game, much more frenetic, full of spectacular sequences and always with bated breath, thanks also to the amount of creatures that are constantly thrown at the player. Fighting against Reaver, Bumark and Corpser (even 3 at a time) becomes the norm, when instead in the first episode, the bigger creatures only made fleeting appearances and in completely scripted contexts. The bifurcation structure of the levels also returns, only this time there are more and more frequent. The sections aboard some vehicle (there are of different types, some really ~beastly~) increase, as well as the phases in which going forward shooting wildly is not the best solution, and there are also some sequences, for sniper rifle lovers, made spectacular by the new game areas much larger than the previous ones. Epic also kept its word when it promised a much longer game than the previous one, given that the single player campaign, at a normal level, is difficult to complete in less than 12-13 hours. Above all, if you are dedicated to finding the hidden items, and without considering the longevity guaranteed by the cooperative mode. This feeling of familiarity which on the one hand makes the player feel immediately at home, on the other dilutes the disruptive effect that Marcus and his associates had a couple of years ago, but radically changing the approach to gameplay could have even been harmful, and probably useless. Gears of War 2, from this point of view, is a granite rock. All the Bumarks you want! Cosmetics are also evolving. The latest version of the Unreal Engine illuminates the scenes in a much more effective way, the HDR offers some glimpses to remember, especially towards the final bars of the game, the liquids react softly to the passage of COG and Locust, and some settings and bosses that you meet can only leave any player speechless. The interactivity of the backdrops intervenes only for some elements of the scenario and is never decisive for the purposes of playability, but it still helps to make total war situations less static. The Gears of War universe is deepened, the number of locusts increased, enriching an artistic imagination that has conquered millions of players. The blood returns, which literally flows in rivers, in a scenario that cannot fail to disturb the faintest of heart, and in a couple of sequences one cannot avoid feeling the weight of the dust and the horror aroused by certain creatures. As for the gameplay, the devastating impact of a couple of years ago is partially diluted, but what they have managed to do in Epic, considering the polygonal mass, the definition of most of the textures and the fluidity of the engine, which now he no longer has any problems in any situation, he has few equals in today's panorama, above all for the physicality with which they have managed to render the clashes with the largest creatures, and the environments, never so vast and detailed. The audio is fully dubbed in Italian and the results are as great as before. Music and sound effects are confirmed at the same levels, with the emphasis placed more on detonations and gunshots, rather than on the soundtrack. Comment Anyone who finished the first Gears of War will remember the comment that died on their lips as soon as they finished the single player campaign: ~I want more.~ This new adventure relaunches one of the strongest and most loved imaginative universes, among those created in recent years, and offers hours of entertainment, without the need to take refuge in the longevity of online gaming, which helped the first chapter to survive its congenital brevity. Marcus, the COGs and the world of GOW are enriched with details and become the protagonists of an epic and engaging battle, which follows the evolution of a cinematic colossal, without upheavals in terms of playability, and aiming to confirm and polish almost all strengths. The sense of continuous amazement, experienced previously, was difficult to replicate, but so were the adrenaline and fun that this new story can give from many points of view. Multiplayer is confirmed as one of the keys to the success of the saga and the new Horde mode keeps even the most demanding expectations. Now all that remains is to wait for the epilogue of the trilogy, with the hope that Cliffy and associates know how to give the final blow and close all the outstanding points. PS: After the last boss, listen carefully for the end of the credits, there is a piece of audio thatbuilds a nice bridge to the next chapter. Pros The new online modes The campaign The cosmetics The variety of situations Cons Some undeveloped characters Cover system not yet perfect The waiting times in the creation of online matches An Arriving Horde! Once again, playing GOW, you get the clear feeling that the guys on the team really enjoy playing it and, above all, in Multiplayer. It is here that the story of Epic comes out the most, when you realize the care placed in the construction of the maps (some with variable atmospheric effects, even lethal and which affect the progress of the matches), in the filing of small elements such as the duration reloading, balancing weapons, and why the new melee moves were added. It's hard to resist the temptation to press Y on an opponent's body to punch him when he's down, but you expose yourself to enemy fire for a long time and this can cost you your life. Playing assiduously, however, one realizes how the cover system has been filed, but not made perfect, and it still happens to find oneself sheltered behind the wrong wall, while instead one wanted to run at breakneck speed to try to avoid a hail of bullets . Even the matchmaking system, which seems more precise and similar to that of Halo, needs a fix because the waiting times in creating a game can be very long. On the other hand, Cliffy and associates have pulled the Hordes mode out of the hat, in which up to five players can face 50 successive waves of increasingly large and numerous monstrosities, through which to understand that polygons are certainly not a problem for this engine and maximizing the cooperative experience of a game that has made this type of sensation a trademark. Surviving an onslaught, surrounded by Husks and locusts, resurrecting your companions and sharing the ammunition found on the ground, is an experience that any online game lover should try. Xbox 360 - Goals Gears of War 2, with the right number of hours of play, is quite generous in giving a good part of the 1000 points available. By finishing the campaign on a normal level, you can easily end up with more than 300 points. To get over 600, just finish it with a friend on Insane level. The 1000 are the prerogative of the most assiduous players, aided by a practical indicator, which marks the progress in the acquisition of each single objective.", "date": "2008-11-03", "grade": null}