{"name": "Strong Bad Episode 3: Baddest of the Bands - Recensione", "ref": "https://multiplayer.it/recensioni/strong-bad-episode-3-baddest-of-the-bands-recensione.html", "text": "Important month for the first season of the new TellTale Games saga, Strong Bad's Cool Game for Attractive People, which after a couple of good releases and positive acclaim obtained almost everywhere, opens the second half of the series with this third episode and tries to confirm the qualitative crescendo shown up to now. The elements are obviously the same seen up to now for a formula that predictably deviates very little from the classic one: the humour, the crazy plots and the particular design are as always taken for granted, while the subject matter is a look at the world of musical groups in the age of the internet and video games. In Baddest of the Bands you will then be asked to help Strong Bad in organizing a bizarre challenge between some local bands, complete with prizes and some impropriety aimed at directing the fate of the meetings. Depending on the story As always happens in TellTale's adventures, the narrative plays a fundamental role so as to change the structure of the puzzles and the progression from time to time along the approximately four hours of play that are needed to complete a single episode. In this case the first part of the experience is extremely linear and asks Strong Bad to gather his group, the user to assign names and then to try the first pieces, all without almost being put in the presence of problems to solve or obstacles to overcome. The real challenge - and with it the more complex puzzles - comes when you have to pitch, circumvent and defraud the judges and opponents, resorting to the most sinister and impossible techniques; the level of difficulty does not even exceed the tolerable threshold in these cases but compared to the past it has been slightly raised, making all in all reach levels of greater pleasure and satisfaction in completing the work. There is still a lack of inventory management and interaction between the collected objects that brings these titles closer to normal modern point-and-click production in terms of complexity, but this choice is probably to be framed in a philosophy of simplicity and immediacy which in this case in particular also binds well with the WiiWare philosophy. Inevitable, once again you cannot be disappointed by the small arcade game included as a bonus. This is the time of Hot Babellen Odyssey, a sort of vertical scrolling shooter aboard a minibus and with the user's goal of defeating the wicked aliens who are trying to invade the earth. It doesn't last very long but the crazy style and the equally fun power-ups make it playable more than once and perhaps the best of those offered so far. Catchy tunes Always equal to itself the video sector that does not present any novelty and leaves it to the new settings and the arcade mini-game to differentiate it from the rest of the releases. The technical judgment is therefore not changed and remains the same even when analyzing the interface, clean and essential, and the excellent distribution of the interaction points on the screen, so as not to force crazy searches to the last pixel. The sound makes use of the usual good voices - all in English, like the subtitles - and some music specially created for the challenges between the bands, nothing transcendental but still able to elicit a few laughs. PC - System Requirements Minimum Requirements Processor: 1.5 GHz RAM: 256 MB Video Card: 3D with 32 MB Disk Space: 240 MB Test Configuration Processor: Intel Core QX6700 RAM: 2 GB Video Card: NVIDIA 8800 GTS 320MB Comment Baddest of the Bands is predictably the continuation of a road traced at the start, without ever claiming to add pieces to a mosaic which, however, as it was conceived, entertains and does not fail to offer original and always different narrative ideas. Halfway through the series it is impossible not to highlight how the various Sam & Max were on other levels of excellence, but waiting for the third series of the detective duo we are certainly in the presence of a good alternative. Pros Insane musical challenges in full style Strong Bad Extremely good mini-game Good balance of difficulty Cons Gameplay depth remains limited Technically it doesn't make a miracle", "date": "2008-10-30", "grade": null}