{"name": "Starfox Command", "ref": "https://multiplayer.it/recensioni/starfox-command.html", "text": "The Whole Saga! What will an anthropomorphic fox do in space??? Here, then, is this Starfox Command that tries in some way to bring what seemed like a lost series back on the right path traced by the first chapters. And in part he succeeds, but let's go in order. Abandoned, hopefully forever, the experiments introduced on GC where you command characters on foot, you return aboard the legendary spaceships driven by Fox, Falco, Peppy and... a lot of other characters! That's right, this time many figures will be played, including members of the Star Wolf and a series of completely unpublished ~puppets~ -actually much less inspired-. Everyone drives a ship with completely different firing characteristics, energy amounts, and boost gauges, and that's definitely good for variety. Yes, but what are we to do with these spacecraft? Obviously destroy everything! Here the most evident innovation of this chapter comes into play: the component and the strategic map. Each mission is in fact set on a map where the Great Fox - the large goose-shaped mothership - and other various elements appear in a corner. There are all the moving enemy units - represented by red dots - the missile silos, the enemy or friendly bases to be freed and any missiles already in motion. Our job is to destroy them all before they or a missile reach the mother ship led by trusty Rob. In addition to the enemies on the move we will have to free the various occupied friendly bases and destroy all the opposing ones. To do this we have various rounds available in which both we and the opponents have a certain range of action and movement. With the stylus you have to draw the correct trajectory of our shuttles, in order to intercept both the various bonuses and the enemy units and bases. Depending on which they come into contact with, the various classic combat areas are displayed: a bit as if they were calling us to physically fight the various battles between the Advance War units! Having abandoned - unfortunately - the track structure of the prequels, the ~free flight~ arenas that already appeared on the Nintendo 64 have been revived. , of different shapes and movement patterns. Also in this case there is no shortage of variety, even if in the end you always end up doing the same things... In the sense that the mission is almost always that of having to knock something down, once all the opponents have been hit must, in the ~base~ areas, blow up, with a particular and always the same approach through ~portals~ concluded with a rotation, the same flagship... The movement required to turn... ...use the turbo... ... and loop with the loop icon What questions, he fights alongside an anthropomorphic falcon, a frog, a rabbit... When one of the -too- numerous missiles is intercepted, on the other hand, one must follow a trail formed by the portals, those already seen before and which are approaching ever faster, to finally shoot the device. Even here the routine eventually becomes boring. There is no shortage of various monsters at the end of the mission that suddenly appear. Command is certainly one of the games that is most afflicted by the dreaded ~DS syndrome~. This ~disease~ affects those titles that want to forcefully exploit the characteristics of the dual-screen laptop and are unable to cover its limits. In this case one of the most classic structures must be adapted and the result varies. To drive the shuttles you have to digest the use of the stylus: touch right, left, up and down and the ship tacks and pulls, rub and the ship rotates, touch twice up and the ship puts the turbo, double down and brakes Even if you get used to and adapt after a while, you undoubtedly always regret an analog stick or the old cross, both much more reactive and precise than the stylus. Even after several hours of play you find yourself cursing some undetected swipe or some action that would have come better with traditional keys. Furthermore, having to continuously observe the lower screen that displays the radar in the long run annoys we have our hand in front-, but this is mandatory given that the resolution of the screen and, at times, an obvious pop up does not allow us to see the enemies in distance. Most of the time we fly into thin air with objects that pop up suddenly or, better, they are made up of four or five pixels even if they are relatively close together. Even the introduction of the strategic part to take advantage of the touch screen turns out to be a useless burden which in any case leads to the overcoming of the same paintings, even if with ordine different. However, of course, the addition is not negative, even if it leads to frustrating situations given that even a very small error -perhaps dictated by the control system- is enough to force you to repeat the whole mission and all the sections after seeing it miserably explode Rob. Finally, even the microphone is exploited by force making us record some words which then ~crippled~ will form the voice of the characters obviously formed by the usual verses of the saga ... However, beyond all these defects and a certain basic monotony, the game is overall very pleasant. Either because the technical realization is almost always valid - even if it rarely makes you cry out for a miracle - apart from the aforementioned defect, or because of the undoubted power of the combat structure that takes up all the fun of the debut chapters. Another point that comes back with great pleasure is that particular cool look and content even if interpreted by funny and childish characters. Most of the time the design of the ships and the game environments are very nice even if they all tend to look a bit alike and sometimes it seems that only the colors change However, a good variety and an excellent tree structure sufficiently long and complex allow for excellent replayability. Further elements that make you go back to fighting at the tip of the stylus are: the possibility of increasing your score by destroying everything that moves in the various levels, the numerous different endings and the curiosity to try all the various ships. The flagship to shoot down in all bases The strategic map Urban landscape Command is finally the chapter that manages to bring the Starfox saga back to fairly high levels. Even with all the defects of the ~DS syndrome~ it is undoubtedly a pleasant game, even if some choices weigh down its structure. Strategy maps are neither positive nor negative, they are just there, bringing something new, but also a series of problems and frustrating situations. The difficulty curve dictated both by the structure of the levels and by the characteristics of the various shuttles is very particular and fluctuating. Once you understand the basics, you are still faced with a classic and solid shooter and this is its greatest advantage. Too bad for a certain monotony that tries to be mitigated with a fairly wide variety of enemies. Pros Adrenaline and fun Complex and replayable Good technical sector Cons Affected by ~DS syndrome~ Tendency to be monotonous Strategic part a bit heavy After the first, by now epic, polygonal episode on Super Nintendo, an excellent and ~vibrant~ chapter for Nintendo 64, an Adventurous and flat episode on Gamecube and the unmentionable attempt by Namco always on Cubo, a fifth recovery chapter could not be missing , on DS, of the Volpacchiotto Spaziale saga.", "date": "2007-02-06", "grade": null}