{"name": "Lost Judgment", "ref": "https://multiplayer.it/recensioni/lost-judgment-recensione.html", "text": "The die is cast: the Yakuza series will continue to carry on the RPG-style revolution introduced with Like a Dragon, surprisingly appreciated even by those who had never approached the franchise, while the spin-off Judgment will maintain the action brawler approach it has characterized the brand from the outset, thus offering the nostalgics of Kazuma Kiryu's adventures the formula they are well used to, clearly refined and improved. It goes without saying that we approached the review of Lost Judgment with many expectations for this sequel. Directed by the rookie but talented Kazuki Hosokawa, the game focuses heavily on the numbers of a much richer structure than in the first chapter, thanks to the introduction of a second map in addition to Kamurocho, that of Isezaki Ijincho in Yokohama (the same as the already mentioned Like a Dragon) and some interesting news related to the way in which the scenario is explored and experienced. History Lost Judgment, the protagonist Takayuki Yagami After the events of the original Judgment (here the review), the detective agency of Takayuki Yagami and his assistant Masaharu Kaito is experiencing a lean period, while Kamurocho is invaded by new criminal gangs that have effectively replaced the now dissolved Tojo clan. The call from the former acrobatic thief Fumiya Sugiura, who also became a detective and settled in Yokohama together with the skilled hacker Makoto Tsukumo, is therefore providential. The two were hired by the principal of the Seiryo private high school to shed light on possible bullying episodes that they would be consumed within the walls of the school. Four years earlier a student committed suicide because he was tormented by his classmates and the director fears that such an episode could happen again, a few months after the disappearance of a young trainee who, while studying at the same institute, seemed to have been responsible for similar conduct . The high school is large, the students are many and Sugiura and Tsukumo could use the help of Yagami and Kaito, who accept the offer without knowing that soon another far more murky and disturbing case would involve them and the school at which they are about to investigate. A former policeman, Akihiro Ehara, accused of molesting a woman on a train, after hearing his own guilty verdict stood up and uttered words that deeply shook the courtroom. Ehara said Yokohama police must have by now found the body of a tortured and murdered man, identifying him as the intern who disappeared before officers even did, saying he was the man who drove his son to suicide and that he got what he deserved. But how can Ehara know these things, if the murder took place while he was in Ikebukuro station, the same morning he was chased by the woman he had molested, blocked by some passers-by and arrested? Lost Judgment, a student tormented by bullies The story of Lost Judgment, written by Tsuyoshi Furuta, therefore starts from very interesting assumptions, involving us in an interweaving of situations and characters that unfolds over thirteen chapters in which anything really happens between dramatic implications, inevitable twists, surprising revelations and yes, even a pinch of rhetoric placed in the middle of a narrative at times controversial, in which for the first time a figure peeps out who escapes the franchise's mold and who finally finds no comfortable justification for his actions. of bullying is dealt with in a convincing way, with adequate times and ways, although some contradictions emerge during the plot. An excellent job has also been done with the supporting actors (although a better outline of some of them would have helped to make everything balance) and with the villains, who are truly ruthless and at the same time very strong: defeating them will not be easy and in some cases we will find ourselves to experience situations in which Yagami will be really put to the test. Structure Lost Judgment, a look at Isezaki Ijincho's scenery in the evening As per tradition for the Yakuza series, Lost Judgment also boasts a decidedly full-bodied structure, which in this case is at the center of the most relevant innovations. It starts first of all from the double map, given that the large scenario of Isezaki Ijincho in Yokohama has been added to the traditional Kamurocho of the first episode, as mentioned in Yakuza: Like a Dragon (here the review), and it is possible to move from one city to another in an extremely rapid manner, whenever desired. Speaking of moving, rather relevant mechanisms are introduced after a few hours to speed up the exploratory phase. The first is skateboarding che Sugiura gives to Yagami and that we will be able to pull out while running through the streets (but not on the sidewalks, watch out) so as to double the speed of movement and reach our goals more quickly. The second is the taxi service, easily accessible from your smartphone, which works like a quick trip and therefore does not ask you to reach the car with driver every time. Lost Judgment, the new apps on the protagonist's smartphone In short, it turns much faster in the Lost Judgment maps, but the system of enemies encountered on the street remains unchanged and characterizes the progression of our character, who only through these fights and the completion of any assignments can get possession of the points needed to boost his health and attack stats, as well as the many techniques related to fighting styles and more. During the twenty hours it took us to complete the main plot alone, these facilitations did not affect the balance of the experience , which at the normal difficulty level presents an often trivial degree of challenge in the first hours, to then increase in the second half of the campaign and in particular during the boss fights, which however suffer from the usual problem with the almost infinite healing items that can be carried and consume to avoid game over during the most mangy battles. Lost Judgment, the inevitable view of Kamurocho with the lights on We talked about twenty hours, but be careful: the total duration of Lost Judgment is at least double, if we consider the entire part dedicated to School Tales. These are activities and assignments that revolve around the Seiryo high school clubs, for a total of ten subplots that practically constitute a parallel and separate campaign, with a progression very similar to the entrepreneurial career of Like a Dragon. Then counting the inevitable subquests and the many extra activities available in the maps, you can easily exceed one hundred hours, as indeed already happened in the first chapter. Speaking of subquests, the game has changed the way you access them by introducing the Word Search , an application developed by Tsukumo that scans internet chats and geolocates user posts to allow us to identify the places where certain terms become more frequent within the scenario, to then go there and find the secondary mission waiting for us . Also in this sequel, of course, the tone and atmosphere of these assignments are distinguished by the absurdity of the situations and their ~Japaneseness~. Lost Judgment, a laundry thief caught in the act Still in relation to structure and activity, the VR Paradise present in the original Judgment returns with some small changes, although in the end that variant of the virtual reality goose game ends up being a bit boring with its lengths, and there are also drone racing, with all its side of prizes, power-ups and so on. Furthermore, a skate park could not be missing, in order to take advantage of and enhance Yagami's new locomotion system. Finally, from the main screen it is possible to access the new Gauntlet mode, which presents a series of different types of challenges for players who want to put themselves to the test. trial. There are fights to be completed according to certain rules and within a time limit, platform phases to be overcome in speed, boss fights and large-scale brawls: an interesting addition, capable of further enriching the package. Extra activities Great tradition of the Yakuza series, the extra activities are also present in Lost Judgment and allow you to try your hand at the classic baseball training, darts, mahjong and the inevitable SEGA Clubs, where we can find classics such as Space Harrier and Super Hang-On, as well as the novelty of Sonic The Fighters. Not only that: in the protagonist's office in Kamurocho the old pinball machine has been replaced by a small CRT TV connected to a SEGA Master System II. Finding cartridges for the console is not easy, but in the end you can count on a decent list of titles with which to play a few games. Gameplay Lost Judgment, Yagami stealth flips a coin to distract a guard Also in terms of gameplay Lost Judgment introduces interesting new features, although not all of them appear to be guessed. We are referring in particular to the mechanics relating to investigations, which in some cases are weakened (see stalking and burglary), in others reiterated all too often (see pursuits and first-person observation). Then there is the novelty of the platform phases, in which it is necessary ~solving ~environmental puzzles by climbing the gutters and being careful not to run out of energy from the socket, and from the stealth phases, but both often prove trivial. The addition of further gadgets in addition to the camera (a sound amplifier for remote listening and an electronic device detector) makes some sequences more varied, which nevertheless remain pigeonholed within a very linear path. In short, like and perhaps more than in the first Judgment, one gets the feeling that these minigames leave the time they find, without add nothing really relevant to the experience.From this point of view, it is clear, the development team has not yet found the square. Lost Judgment, a frantic fight sequence The matter relating to the combat system is different, which, on the one hand, feels the inevitable tiredness of a formula that has been reaffirmed for almost sixteen years now, with the usual combos and finishers to determine the progress of the clashes and the problems we have already mentioned with regard to the generosity of the inventory, in combination with a degree of challenge that for several hours appears comparable to a health walk, on the other hand introduces interesting innovations in the form of a third style, that of the Serpent. allows Yagami to slide the blows of his opponents and to exploit the cue to his own advantage, in the context of spectacular and very painful projections. And when one of the enemies is in a panic, we can finish him off with a couple of basically harmless but fun maneuvers, making him pass out. In combination with the Crane and Tiger styles, the Snake certainly increases the variety of fights and adds a little freshness to a stale system, although always a harbinger of great satisfaction. Lost Judgment, an unpleasant situation during School Tales Speaking of variety, the aforementioned section linked to School Stories represents from this point of view an extra gear available to Lost Judgment. Hired as a consultant at Seiryo high school to be able to move freely within the institute and conduct his own investigations, Yagami comes into contact with the various school clubs and their members, ending up engaging in the most varied activities to pull the strings of a plot that leads to the mysterious figure of a new villain. It's a pity that the quality of the minigames related to this part of the game is a bit fluctuating, with situations that feel like they've already been seen (see the rhythm sections of the dance club, the Girls' Bar and the casino) and others that are not very exciting (the fights between robots in the robotics club), but there is no shortage of amusing ideas (some sequences of the motorbike races are spectacular) and some truly new elements, which never fails. Technical realization Lost Judgment, a race through the beautiful urban landscapes of the game It hasn't been long since the release of Judgment on PS5 and Xbox Series X|S, and it is probably for this reason that the visual impact of Lost Judgment on the new generation consoles does not appear revolutionary, despite its undeniable quality. The big difference is made by the 60 fps of the default graphics mode, clearly, while the real 4K at 30 fps of the resolution mode don't quite stand the comparison: despite its stability, the frame pacing does not communicate sufficient fluidity and also the gameplay it suffers. The character models have been improved but not too much, in particular Yagami wears the signs of the most brutal and demanding fights for a few days, but once again the scenarios are the masters. If you have played with the multi-quoted Yakuza: Like a Dragon you already know what to expect, in the sense that this is the level reached by the series in terms of detail and interaction of the settings. Unfortunately, a dynamic day-night cycle is still missing, which would make the difference in such fascinating open worlds, but it is possible to wander around the city in the morning, late afternoon and evening. Lost Judgment, a selfie with Yagami and his friends, hoping to find them for a third chapter The ~virtual tourism~ component is strong and is also felt in Lost Judgment, especially when wandering around the streets of the center in the evening, with the illuminated signs reflected in the inevitable puddles in a mix of screen space reflections and cubemaps that this time, however, we found it less attentive than usual: there are windows that reflect non-existent objects, and this occurs a little more often than we were used to seeing in a series as well-finished and refined as Yakuza. The PlayStation 5 version, which was provided for this review, boasts near-instantaneous loading but control support", "date": "2021-09-16", "grade": "8.6"}