{"name": "Yamakasi Masters", "ref": "https://multiplayer.it/recensioni/yamakasi-masters_a.html", "text": "Parkour has its roots in the early 1900s, when a French officer stationed in Africa began to study the rapid and extremely agile movements of some members of the indigenous tribes, who managed to climb trees with incredible grace and speed. These observations soon transformed into a physical discipline, with the aim of teaching army troops the best way to move within any environment, even the most hostile. David Belle, founder of parkour, comes from a military family, and in the early 90s he put together a group of athletes capable of applying his teachings in an urban context: moving from point A to point B in the same way as fast as possible, climbing buildings and making seemingly impossible jumps. In 1997 Belle himself created the Yamakasi division, or a branch of parkour with artistic ambitions, in the sense that it puts the spectacularity and beauty of the movements in the foreground with respect to the speed of movement. As we can see in this videogame developed by Breakpoint... Yamakasi Masters is an action game with many platform elements, which starts from a ~Prince of Persia~ structure but presses the accelerator on speed and stunts rather than reflection and combat (absent, of course). The main game mode is Adventure, which is accompanied by a short tutorial, a Challenge mode (in which you have to complete the internships in the shortest possible time, then comparing the results with the online ranking) and the possibility of running inside of the ten locations available in a completely free way, for the pure pleasure of taking an ~acrobatic~ walk. Once we have chosen our character from three different real-life athletes, we will find ourselves having to complete a series of simple missions with the aim of participating in a parkour competition and winning it. Basically, what we will have to do will never go beyond moving from point A to point B; the problem is that it won't immediately be clear how to reach our destination, so we'll have to climb a large number of buildings, perform stunts every time we encounter an obstacle and find the right path by following an indicator located at the top of the screen. The action is not free, but takes into account a time limit: we will have to do everything that is asked of us very quickly, or we will run into the inevitable game over and we will have to start the stage all over again. The control system is based on the various Prince of Persia and Flashback, so we will be able to move the character by pressing the d-pad (twice forward to get a quick sprint), with the up and down directions assigned respectively to jumping and acrobatics . The 5 key can also be used to jump (and actually works better), while the 7 and 9 keys allow us to take a look below our position, to understand if we can land safely or if we are at an excessive height. The game can count on an excellent technical realization. Apart from the sound, composed of a series of MIDI music that is anything but unforgettable, the graphics show us well-designed characters with a rich set of animations. The locations are also well made, they flow independently of the backdrop (to create a nice depth effect) and boast a good level of detail. The internships are quite differentiated from each other, even if they are still urban scenarios. PRO Engaging and spectacular Great animations Very challenging... AGAINST ...maybe too much Response to commands not always punctual Often frustrating", "date": "2008-10-24", "grade": "S.V."}