{"name": "Pro Evolution Soccer 4", "ref": "https://multiplayer.it/recensioni/pro-evolution-soccer-4_a.html", "text": "Push on the band Talking about Pro Evolution Soccer 4, describing its contents and the innovations introduced by Konami is sincerely useless: the Multiplayer pages have already had the opportunity to dissect more than deeply the renewed mechanics and the filings to a game system that every year moves more there the concept of perfection. We will therefore limit ourselves here to analyzing what really differentiates the PC version from that for the Sony monolith, obviously with special attention also for the newly arrived Xbox edition. Without a shadow of a doubt, the conversion work of the Japanese programmers was not particularly tiring; with a view to adaptation as limited as possible, PES 4 on PC welcomes the player in exactly the same way as it did on Ps2, complete with references to ~X keys~ obviously belonging to the console universe. Nonetheless, this is certainly not a particularly annoying aspect, and on the contrary, it helps to create the identity of a title that wants to make all those who have had the opportunity to play it on other platforms feel immediately ~at home~. In this sense, the use of an adapter to connect a dual-shock pad is highly recommended, in order to fully enjoy all that Konami production is able to offer. And obviously, it is able to offer a lot, starting with a reactive control system, not particularly difficult to assimilate in its basic functions but very demanding when it comes to getting the best out of it. And this has always been the strong point of Pro Evolution Soccer, i.e. the ability to welcome novice players but at the same time to continuously stimulate the more experienced ones, offering goals and objectives in the form of spectacular plays and articulated actions. One step closer From a technical point of view, the version for Windows machines is obviously superior to the Ps2 one from every point of view, totally eliminating the defects that made more than one person turn up their noses. We are obviously referring first of all to the slowdowns found in the most crowded situations or with the widest shots, completely absent here provided of course that you have a PC that is at least discreet. The higher resolution adopted also gives a clearly cleaner and clearer appearance, although the polygonal models have not enjoyed any strengthening injection. Nonetheless, complaining about the graphic aspect of the Konami production is sincerely difficult: the most famous and representative players are reproduced with an almost maniacal care in the features and movements, complete with celebrations taken directly from real life. Nonetheless the animations, enriched and cleaned up in a more than sensitive way compared to the third episode, are able to give the real illusion to an inattentive eye of being faced with a real football match. The introduction of the referee on the pitch has finally made the happiness of those who have been clamoring for it, even if some of his decisions sometimes leave us rather perplexed, especially on the occasion of sanctioning fouls with cards. The sound component, which has always been the weak point of Pro Evolution Soccer, certainly proves to be superior to the previous episodes both for the effects and, above all, for the commentary, entrusted in the Italian edition to the award-winning company Civoli  Sandreani. Although destined to become hopelessly and inevitably repetitive to the point of suggesting its exclusion, the amount of sentences that make it up is undoubtedly such as to allow you to face several games before moving on to the drastic solutions mentioned above. Online mon douleur But what undoubtedly represents the most awaited aspect of this fourth chapter for PC is obviously the online multiplayer component, a real Holy Grail for many years now for every fan of the Konami series. Unfortunately, although the step forward is abysmal and opens a real new era for the franchise, the room for improvement is very large. For heaven's sake, we're not referring to lag or slowdowns during the actual matches, which on the contrary take place in a very faithful way to the offline version without causing any problem worthy of the name, but rather to the match organization phase, really meager and not very functional. With what to online game lovers will seem in no uncertain terms a leap into the past, in PES4 to participate in a game created by another player it is necessary to enter the latter's IP. A search function is missing, just as a list of friends is missing or in any case any option that allows you to deal with unknown people and whose IP is therefore unknown Online mon douleur A search function is missing, just as a list of friends or any other option that allows you to deal with unknown people and whose IP is not known is missing. It is obvious and self-evident that the current telematic communication channels, such as Icq and Msn, or again ad hoc fansites and so on, can partially make up for this lack, the fact that in direct comparison with the Xbox version, under this aspect the PC edition is hopelessly defeated. Comment Pro Evolution Soccer 4 for PC lives up to expectations, also offering Windows users what is undoubtedly the best football title ever made. Compared to the console editions, the PC version can count on a clearly better technical aspect which further appreciates the work of the Konami graphics and enhances their attention to detail. Provided you have an excellent pad or, even better, a dual shock adapter, this fourth episode finds its best expression in terms of offline play in the PC incarnation. However, the same thing cannot be said for the online multiplayer component of PES 4, really meager and quite far from that offered by the Xbox counterpart. Pros: Exceptional gameplay Graphically the best edition available Finally online! Cons: Online mode really too thin Lack of licenses for several teams Arbitrage still imperfect Once upon a time there were exclusives, i.e. those titles inextricably linked to a gaming platform and which fully justified its purchase. By now however, exclusives can be counted on the fingers of one hand, and a software house rarely agrees to miss the opportunity to sell a successful franchise to the largest possible audience through the conversion process. And so, what was once a major reason to own first a PSone and then a PS2, has morphed into a series available to virtually anyone. We are obviously talking about Pro Evolution Soccer, now synonymous with the best way to play football sitting in an armchair. And so, while the third chapter marked the first steps away from the ~only on Sony~ categorization, the fourth episode here has definitively spread its wings towards the multiplatform, accentuated by the ~mockery~ of the much desired online mode present only on Xbox and PC.", "date": "2004-12-01", "grade": null}