{"name": "NOM 2: Free Runner", "ref": "https://multiplayer.it/recensioni/nom-2-free-runner.html", "text": "Have you ever read the manga ~U.P.O. - Unidentified Prince Object~? It talks about a prince desperately searching for his princess, but what matters is that a large part of this booklet published by Kodansha (and also published in Italy a few years ago) takes place on the move, with the protagonist advancing undeterred aboard the his vintage car: he breaks down walls, runs over people, destroys anything that stands between him and his destination. It just goes on, without obstacles and without limits... a bit like the little man in NOM 2: Free Runner. Just like for the first episode of the series, Gamevil offers us a large number of stages in which the protagonist proceeds running and finds himself facing everything: carnivorous plants, traps of various kinds and more or less difficult opponents, bosses included. Anyone familiar with the world of mobile gaming knows that basically two schools of thought coexist in it: on the one hand, the one that wants advanced mobile games, rich in depth, that have nothing to envy to their console counterparts; on the other there are the so-called ~casual games~, productions based on the continuous search for simplicity and immediacy. NOM 2: Free Runner is certainly part of the latter trend, and it doesn't take long to understand it: just start a game to realize how simple the gameplay and structure are. Our little man runs forward, with the environment flowing towards him and enemies and traps advancing accordingly. When we are faced with a threat, all we have to do is press the 5 key: in some cases we will see the character jump, in others we will see him hit the enemy to get him out of his way. The only thing that matters is the timing, that is, you have to understand when to press the button; otherwise, the action pretty much flows by itself and you don't need to do anything else. Each stage is divided into sections, and one of the peculiarities of the game undoubtedly lies in its ability to ~turn over~ to accommodate what is happening on the screen: the little man jumps and starts running on what was previously his right, so we will have to look at it from the side or turn the phone around. As you progress, several ~complete laps~ of the screen are made, while the locations change color and the enemies become more numerous and cunning. We find ourselves a bit displaced when the technical aspect of a game is created in a certain way due to a precise stylistic choice. In the case of NOM 2, we have really essential graphics, which mostly play with the contrasts between the characters (completely black) and the colored background. Unfortunately it is also unlikely that the poor quality of the animations was intended, so the visual result is a bit of a cross between choices and limits. The sound consists of some nice, rhythmic and quite engaging MIDI music, while for the control system there is little to say: everything is done with a single button. Unfortunately the response to the inputs is not always accurate and reliable, though. PRO Very original Really simple and immediate Unique graphic style... AGAINST ...but inadequate for the times Very limited gameplay Often frustrating", "date": "2008-10-22", "grade": "S.V."}