{"name": "McFarlanes Evil Prophecy", "ref": "https://multiplayer.it/recensioni/mcfarlanes-evil-prophecy.html", "text": "Sometimes they come back McFarlane's Evil Prophecy gives the player a truly chilling vision of the nineteenth century world, in which humans fall prey to undead and other sinister creatures that emerge from every corner of the earth's hemisphere. The harbinger of an apocalypse soon becomes the daily bread of every population, and only a brave few decide to roll up their sleeves to ostracize the numerous hordes of darkness. Among these a scientist, a student of the paranormal who responds to the name of Hans Jaeger and who decides to group some helpers at the antipodes of each other, to go hunting for monsters. The foundations for an at least intriguing game would also exist, if only they didn't crumble against a cemented wall with the approximation and carelessness of monotonous gameplay and a technical realization faithful to McFarlane's creatures. We will be able to manage a party of four stereotypical characters in real time, who will be interchangeable at the discretion of the unfortunate player. Although differentiated in the key points, the four 'hunters' will be substantially identical to use, focusing the entire combat system in a button smashing to the bitter end which becomes worn and boring within a few minutes. The same level design does not help the digestibility of this Konami title, being of an almost disarming linearity as well as offering rare interaction cues with backdrops and NPCs. The foundations for an at least intriguing game would also exist, if only they didn't crumble against a cemented wall with the approximation and carelessness of monotonous gameplay and a technical realization faithful to McFarlane's creatures. Sometimes they come back In such a context it is almost superfluous to mention the possibilities offered by multiplayer, moreover unrelated to the main game, which can make very little opposition in the face of such a playful paucity. Even the enemy AI follows the unfortunate trend of the entire production dedicated to McFarlane's creatures, proposing 'mono-script' enemies of almost irritating stupidity: the only input they will have will be to attack on sight, without strategies or patterns of action. attack anyone. In this Titanic disguised as polygonal, not even the technical realization manages to throw a lifeboat for a boat that is leaking from all sides. It's hard to say what's really uglier, if the graphic or sound counterpart. The fact remains that to see McFarlane's Evil Prophecy is really an ugly creature, and to feel it is almost worse. Desolate environments pervaded by constant fogging alternate in this escalation of visual horror with rough and badly animated polygonal models. All covered with the most washed-out textures that the Sony monolith remembers. An approximate and difficult to manage chamber has the burden of delivering the coup de grace. The last breath this Konami game exhales by proposing a neglected sound like few others. And if the absence of dubbing basically doesn't disturb that much in this context, the coffee breaks that you take with background music just can't be digested. Sometimes whole minutes will pass between one musical intervention and another, leaving the experience relegated to bad background noises and the annoying verses of the characters on the screen. A chilling game, no doubt about it. It almost feels like a paperback version of what a game developer doesn't have to do to make a good product. Awkward, sloppy and sloppy. These are the first adjectives that come to mind to describe this Konami title, but there would be much more colorful if desired. Finding a category of players able to appreciate something of this McFarlane's Evil Prophecy is a difficult, if not impossible, undertaking. Simply the worst Konami production and one of the worst games on Ps2. Pros: Cons: Linear, monotonous and boring. Bad AI. Approximate and ineffective room. Technically awkward. Sometimes it happens that you come across a photo of a person you don't know and have never even seen, and then you start fantasizing about possible character traits simply by observing the features of the face or the expression held at the moment of the shot. This is exactly what happened when curious people scoured the web in search of a photograph of the creator of Spawn, Todd McFarlane. Perhaps a little influenced by the dark works of this gentleman, also made up of action figures, we have traced the profile of a mysterious, resolute man with that edge of the dark that suits such a character. Konami, following in the footsteps traced by Namco only a year ago with Spawn, has decided to be inspired by the works of McFarlane to build a video game on it. This time I'm in the viewfinderor the action figures of the Canadian cartoonist are finished, real creatures of horror. Should we therefore expect a terrifying game?", "date": "2004-11-30", "grade": null}