{"name": "Aragami 2", "ref": "https://multiplayer.it/recensioni/aragami-2-recensione.html", "text": "The review of Aragami 2 represents a warning to those with a guilty conscience: beware of your nightly movements, because if you are guilty of terrible crimes you are probably not safe. Among the shadows he may have lurked waiting for you, with his katana, the Aragami, a creature that leaves no way out for his preys. Impossible that you have never even heard this name in passing: the original title dates back to 2016, and more recently we have also reviewed the definitive edition for you, known as Aragami: Shadow Edition. Aragami was born as a pure stealth game and as such he made himself loved in the following five years: so much so that the developers of Lince Works, rightly, thought of making a sequel. A sequel only in regards to its gameplay, as it has been boosted throughout. Narratively speaking, in fact, Aragami 2 represents something very different from what you knew. After spending several hours immersed in the fascinating Rashomon Valley in the company of Kurai and his friends, we are ready for the verdict. Plot: Stop the curse Remarkable scenarios, but it's not in the story that Aragami 2 shines The legend of Aragami is rooted in the depths of the past. These are cursed supernatural beings, creatures who come back to life after death to perform the most disparate tasks, but that's not all: an Aragami is cursed even after being resurrected. His body and mind corrupt, corrode, up to total madness, transforming the creature into a danger even for his own kind: finally, after a certain period of time, the Aragami returns to die, undergoing a sort of petrification . Not exactly a pleasant existence, but perhaps there is a cure. These are the premises of the story of this second chapter. Kurai, the protagonist of Aragami 2, comes back to life in the form of Aragami, and immediately encounters an entire world inhabited by his own kind. It is the Rashomon Valley, a land essentially occupied by an entire city inhabited by creatures of the shadow: the leader of the place meets the protagonist in the first moments of the game (after the tutorial), and explains to him that there his brothers and sisters sisters live in harmony, without disturbing the outside world. Indeed, if anything, it is the opposite: the Akatsuchi Empire, in fact, intends to raze everything to the ground and exterminate the inhabitants. The physiological condemnation of the Aragami is then linked to this impending tragedy linked to external politics and the imperialism of the Akatsuchi: the curse that first imposes corruption and then the extermination of individuals. But, we said, perhaps there is a cure capable of stopping the curse: it will be Kurai who will have to investigate it, during the main game missions. In this regard, it should be noted that the main difference between Aragami and Aragami 2 consists in the density and narrative quality: the latter sacrifices any attention to the story on the altar of the actual gameplay. In short, it is not so important to tell the story of a particular individual as to find a pretext to offer a series of levels within which to unleash the potential of Lince Works' stealth game. On the other hand, the ending of the first game didn't leave many possibilities, even if we would have liked to see a greater integration between the plot and the playful offer itself. Improved gameplay Aragami 2, gameplay side, introduces interesting news The gameplay of the series has been improved from almost every point of view: it is clearly on this aspect that the developers have insisted the most, and our test confirmed what was intuited from the first trailers released. The creature of the shadows that we will control retains all the possibilities already offered by the first chapter, with the addition of two novelties. The first consists of a series of additional moves: Kurai can double jump, stick and hide behind walls and surfaces, so as to surprise incoming enemies, hang on some ledges to eavesdrop on enemies. In general, it has much greater mobility than seen in the past, thanks to the ability to exploit the Shadow Essence, that is the power of the shadow. Added to these improvements are new skills and an overall improved skill tree. In Aragami 2, once the individual missions are completed, the protagonist levels up, and for each level he gets one point to spend on skills. The player is free to choose the ones that best suit his style of play: for example, it is useless to unlock a better parry in combat, if you prefer to always and only act in the shadows without being identified; much better to unlock the ~call of the shadow~, which brings the enemyclosest to the Aragami's location, so you can comfortably stun or assassinate him, without exposing yourself to the view of your surroundings. Murder from the ledges? Aragami 2 allows you to do that Aragami 2, like its predecessor, has been designed to be enjoyed completely in stealth mode. But this isn't always possible, either because some levels are clearly impossible to complete without going into combat, or because a mistake happens to anyone and from there to find yourself with five enemies on your heels it doesn't take long. At this point, either you flee or you fight: the combat system is not particularly complex. With the right mouse button you parry (consuming stamina), with the left you attack: little by little you break down the enemy's stamina bar and inflict lethal damage, up to assassination. As long as it's one-on-one, no serious problem: however, if there are even only two enemies, bringing home the skin is not easy. Also due to a camera and a not exceptional responsiveness of the commands during these phases. Structure and multiplayer mode Hand-to-hand combat in Aragami 2 can create some difficulties The structure of Aragami 2 is not particularly fresh, but completely new within the franchise. Now the protagonist basically lives in the village of his fellow men and only gets away through a mission bulletin board, with an attached dimensional portal. First you accept a task, then you go to the chosen level to complete it: it can be a matter of assassinating a certain enemy, recovering an object, eavesdropping on a conversation, everything and more. There is no shortage of secrets and surprises, such as hidden gold statues to find, money to collect on the ground, all pretexts to deviate from the usual route and explore the surrounding area as much as possible. At the end of each mission, depending on the result, more or less rewards are obtained. How many times have you been discovered? How long did it take? How many deaths on the ground, and how many deaths suffered by Kurai? All this influences a grade that even swings up to a very bad D. The structure is still quite simple and encourages replayability up to a certain point, except that every now and then there are really essential objects to obtain, such as projects for the blacksmith. Personalization, in fact, is the other great innovation of Aragami 2: fortunately it does not affect the gameplay, given that it resolves itself into simple cosmetic objects (masks, cloaks, katanas of different colors) with which to equip your dark creature. What's more lethal than an Aragami? Well, three Aragami Personalization that is not an end in itself: considering that Aragami 2 can be enjoyed from start to finish in online multiplayer mode, think of the embarrassment of seeing three identical Aragami on the screen. Thanks to cross-platform, anyone can join your game, regardless of the game version (PC, PlayStation, Xbox). Indeed, some levels have difficulty clearly designed to test several friends at the same time; this does not exclude that you can complete them alone, but in short, calculate your moves well, because after two deaths in a row you have to start over.", "date": "2021-09-15", "grade": "8.0"}