{"name": "NBA 2K9 - Recensione", "ref": "https://multiplayer.it/recensioni/nba-2k9-recensione.html", "text": "New entry and excellent confirmations.. Within NBA 2K9, we have been able to notice how a better implementation of the animations, now much more fluid and realistic, together with a considerable improvement in the realization of the artificial intelligence of the cpu, manage to immediately return a different feeling from that of the previous edition . Both our teammates and the opposing players manage to adequately respect the tactics, better covering players who do not carry the ball, and making more frequent insertions within attacking actions. Repetitive screens or actions on predefined tracks are therefore a thing of the past. Among the various additions, a note should be assigned to an opponent's body or shirt holds, in order to slow down his movements or unbalance him while handling the ball, obviously it is a good rule not to abuse this possibility, under penalty of the referee's whistle and related foul . Always referring to the game mechanics, it is possible to notice how the possibilities of making dunks have been reduced, in particular at the higher difficulty levels. At the same time, ball interceptions have increased exponentially, and collisions with models in the game have improved. The game modes are very numerous in NBA 2K9, in addition to the classic quick matches and the online section which we will discuss later, there are two very well developed sections, the first is linked to more arcade challenges, such as dunk clashes under the basket or competitions in three-point shooting. The second is an extensive and meticulous version of a career in the NBA world, in which we will be able to decide to control only the management of matches within the championship, or gradually increase the level of detail up to managing the negotiations of engagements, exchanges of players, or take advantage of the work of their talent scouts to create the dream team of the future. Obviously there is the possibility of modifying numerous customization parameters, to modify the degree of simulation and difficulty that you want to obtain during the matches. I thought I saw Shaq... As for the graphic discourse, NBA 2K9, even without setting new standards in the genre - with the exception of the truly breathtaking animations - manages to defend itself very well, and the final result is undoubtedly of excellent impact. Few, if not absent, graphic defects such as aliasing, tearing, while unfortunately there is some drop in frame rate during some replays and particular situations, but during the development of the action the game remains perfectly fluid and playable. We have already mentioned the excellent animations, but we must also point out a better realization of the audience in the stands and good lighting that makes the faces of the players quite realistic. As for the sound effects, we really can't complain, well done and good use of the capabilities of Dolby Digital. The choice for the soundtrack is of the same level, which thanks to more or less famous authors such as Beastie Boys or BlockHead, fully conveys the American-style atmosphere and sound. I thought I saw Shaq... One against all In this edition of the title made in 2K Sports, the online is one of the most accurate and interesting sections, especially for fans of the series. First of all it should be noted that NBA 2K9 supports matches up to 5 Vs 5 via Xbox Live, which means a game made up entirely of other real players. In this mode, being able to count on a close-knit group of friends is essential to bring home victory. The players must be able to coordinate and have some sort of understanding regarding the strategy on the pitch. Moving in attack while waiting for the pass from whoever has the ball is relatively simple, but knowing how to wait and mark the opposing players, knowing when to return to cover or when to move to a suitable area to capture rebounds, even without touching the ball for a long time, is a very important to the team, how little desired for an online user. If you are lucky enough to have a proven group, then NBA 2K9 is a safe choice for multiplayer games. Speaking of online feedback, a fluctuating situation emerged from our tests, matches with Italian and European opponents 1 vs 1, are experiences equal to offline matches. Unfortunately in the new 5 Vs 5 mode, we did not find the same level of quality. The matches, especially those with opponents from another continent, have highlighted several lag problems. We will be able to return to this aspect in the future, given that patches dedicated to optimizing the network code are on the agenda for sports titles. Comment NBA 2K9 is definitely a b editionen successful, the return to a much more simulation than arcade approach, albeit with all the limitations due to the learning curve of the controls or the level of difficulty certainly not accessible in the first match, has borne fruit. Needless to make direct comparisons with other titles in the sector, perhaps oriented more towards other aspects or with other types of implementation of the game mechanics, NBA 2K9 is a game on its own and to be appreciated at its best it deserves to be tried for more than the classic five minutes of a demo. We can ask the 2K Sports team for some optimization in the online rendering of games with many players present, and some small improvements in the technical department. Title absolutely recommended to all fans and players looking for the best in sports simulations. Pro Challenging The benchmark among basketball simulations Extremely comprehensive career mode Vs 5 Vs 5 Online not yet perfect A bit long learning curve Xbox 360 - Goals NBA 2K9 has 50 achievements for a total of 1000 Gamerpoints. The awarding of points varies, from 10 for the simplest, up to 30-35 points for the most demanding challenges. About 20% are dedicated exclusively to online performances. The title is certainly not the most suitable for quickly raising your gamepoints score, on the contrary... it is more correct to say that only the most expert and passionate will be able to obtain the maximum points available.", "date": "2008-10-13", "grade": null}