{"name": "Saints Row 2 - Recensione", "ref": "https://multiplayer.it/recensioni/saints-row-2-recensione.html", "text": "Gang warfare has never been so bloody Saints Row 2 is set a few years after the events of the first chapter, which had seen us ascend to control of the city after defeating all the gangs that had its control. An accident forced us to be pinned to a bed, inside a hospital, watched over by armed prison guards during a very long coma. This is the incipit that precedes the long and detailed game editor: the bandages on the face serve as an excuse to create a character with very different physical and behavioral characteristics. Three types of men and three of women are available with the possibility of modifying the race (Asian, African American, Caucasian) and the face, in every smallest detail. In addition to the facial features, it is possible to add make-up, accessories and so on. We increase or decrease the age as we please, literally transforming the protagonist from young to old simply by moving the dedicated cursor. The editor proves to be particularly versatile and complete, including not only the visual aspects of our physique but also our behaviour, walking and fighting style. The editor proves to be particularly versatile and complete, including not only the visual aspects of our physique but also our behavior Gang warfare has never been so bloody There are also numerous provocative gestures, which can be used especially in multiplayer, to be selected to make us even more unique and different from everyone else. There are also many different voices available, from purely masculine to feminine, smooth and sexy. No video game before had gone so far, with the possibility of modifying practically any detail of the person we control to our liking; but that's not all, because during the game it will later be possible to visit countless clothing, jewelry and accessory shops, tattoo artists, hairdressers and plastic surgeons, to further push your customization and gradually add more details. The developers of the Volition studio seem to want to push the pedal particularly on creating our own unique identity and on the amount of options to choose from: Saints Row 2 is an extremely varied game and in which there are countless things to do. PIMPs, Ninjas, Mobsters and Corrupt Police. Here is the fauna of Saints Row 2. As soon as the character editor is finished, the story begins, and starts immediately with lots of adrenaline and action. No girls to take to the beach and take home in the evening, but immediately a daring escape from the prison where we find ourselves prisoners, with a shooting worthy of a Hollywood action movie, aboard a yacht riddled with bullets by the police helicopters they chase us everywhere. The tutorial can be avoided, for all those who have already played the first chapter. For all the others it will still be easy to learn all the possible moves and actions, thanks to a control system that is now precise, simple and tested. In the options it is also possible to change the fluidity of the movement of the camera, to customize the video scrolling during the shootings and when we take aim. As soon as you land on the banks of the immense city, it becomes clear how the story of Saints Row 2 is much less guided than similar titles. Initially it is necessary to get rid of the prison clothes and find something to wear, after which we are literally catapulted into the violent neighborhoods of Stilwater with one goal: to reconquer the whole city, defeating rival gangs and slowly gaining the respect of all criminals. The map of Stilwater is divided into neighborhoods controlled by gangs that are colorful and different from each other, both in terms of clothing style and weapons used. reconquer the whole city, defeating the rival gangs and slowly gaining the respect of all the criminals PIMPs, Ninjas, Mobsters and Corrupt Police. Here is the fauna of Saints Row 2. There are the P.I.M.P., the pimps, who control the traffic of prostitution and look a lot like the characters in Snoop Dogg's videos; the Ninja use samurai swords, large-engined Japanese motorcycles and are made up almost exclusively of girls; then the mafiosi, obviously of Italian origin, are the typical immigrants in pinstripe suits who manage drug dealing. The human fauna of Saints Row 2 is extremely diversified and characterized. Just as the people who populate the city, distributed everywhere, are elderly, women, men, homeless people, girls, lovers kissing on benches, Orientals, African Americans, no good. Each non-player character is also equipped with good artificial intelligence that glit allows you to react to the world around you. A car accident, a shooting or the simple fact of walking around the street naked (it is possible, and opens the door to a series of ~streaker~ missions), will make those who populate the city streets adopt very different and sophisticated behaviors. NPCs can also make autonomous decisions, such as defending themselves, running away, calling for help, in order to make the game unpredictable and always different. A game decidedly not recommended for respectable people The way to build respect is to perform the many activities in the game. Each of them could almost constitute a title in its own right, given the variety and length. For example, one has to pretend to be a policeman to allow a television crew to whip up a scandal against the forces of order. In this case it is therefore necessary to be violent as much as possible and allow the video operator to film our raids: putting down fights, dispersing skaters or animal rights demonstrators, intervening in family fights, arresting drug dealers on the run, arresting in the act of felony insurance scammers and prosecute park maniacs or killer killers. For each activity there are six levels to tackle, each barred by a save checkpoint. In Saints Row 2 there are car races, demolition derbies, chases, shootings in planes and helicopters, prostitution recruitment, drug dealing, parachuting and many other very different and heterogeneous activities, which keep the player busy without ever getting bored. But that's not all, scattered around Stilwater there are also many objects to recover and collect (for example music CDs, which unlock audio tracks then available in the soundtrack) that push us to explore every detail of the city. The way to build respect is to perform the many activities in the game A game decidedly not recommended for respectable people There are also numerous mini-games, such as the one with a distinctly sexual background in which, closed in public toilets, we have to achieve pleasure by manipulating the two analog sticks of the controller (which vibrates by touching the right areas) in rhythm. Diversification is the watchword of Saints Row 2, and to deal with this a practically boundless fleet of cars has been created, from American muscle cars to convertibles, from sports cars to small cars, passing through twenty-meter limousines to garbage trucks , ambulances and firefighters. Even the arsenal of weapons available is of all respect and in addition to the ~classics~ it includes chainsaws, flamethrowers, tracking missiles (radio controlled via analog) and military weapons. Even the objects on the streets can be used for offensive purposes: by holding down the A key, you can grab practically everything that you can lift, and then throw it or use it as a weapon. The weak point of such a vast and varied world Saints Row 2 is entirely playable in cooperative via system link or via the internet: with a friend at your side the gaming experience and the fun are extremely elevated, and the developers seem to have finally understood this, fortunately. During co-op you use the same character that we created in single player, but the CPU difficulty is increased automatically by creating more enemies on screen. Saints Row 2, despite being equipped with a solid and fun campaign mode (it lasts almost thirty hours), pushes the accelerator on online multiplayer, offering a number of options, situations and missions that will make the THQ title last for a very long time. Up to 12 people can compete at the same time in various competitions such as car racing, high-speed offshore, helicopter, deathmatch or free-for-all. Saints Row 2 also offers the player the ability to perform ambulance, firefighter, police, stunt, airplane and helicopter pilot missions. Furthermore, for all those who love extreme exploration, we recommend getting on a boat and setting sail for the open sea in front of the city: there will be surprises. Instead, what seems to be the only weak point of Saints Row 2 is instead a global technical realization that shows the side to some pop-up problems and sudden appearances of vehicles on the road. The framerate often drops in the most crowded situations and the game is constantly plagued by a noticeable horizontal v-sync that breaks the image in half during faster camera moves. The world of Saints Row 2 is detailed in the main streets and places, but is left empty and poorly characterized in the alleys and secondary buildings, the less visible but equally explorable ones. It is useless to design an entire eight-story buildingif there is absolutely nothing inside, except white walls. However, the game is vast and offers respectable glimpses and views: city panoramas and sea views that are not bad, despite everything. The character design of the characters has been improved compared to the first chapter, but is still too immature. The faces are unrealistic and with extremely saturated colors (as is the whole game), and the same animations, especially that of the race, could be improved. the only weak point of Saints Row 2 is instead a global technical realization that shows the side to some problems The weak point of such a vast and varied world Another aspect that is not fully convincing concerns polygonal collisions, which are not solid and precise. Several times we will find ourselves with some person stuck in the hood of the car, a motorcycle sticking out of a wall or some non-player character who is pierced by a light pole. The world of Saints Row 2 is vast and full of objects and characters, however, and this aspect is basically understandable if you take the big picture into account. The soundtrack, on the other hand, is extremely positive, and includes numerous radio stations that can be listened to from the cockpit of all the vehicles in the game, with Rock, Metal, Hip-Hop and 80s music. Very famous and less famous songs are part of a first-class soundtrack, topped off with matching sound effects. Finally artificial intelligence, with ups and downs: in some situations the enemies behave in plausible, improvised and human ways, hiding, taking hostages to protect themselves, running away. Other times, however, they appear in front of us helpless and still, without reacting to our fire. Above all, the police always show this pseudo-stupidity, acting on well-defined and never surprising scripts. Comment Saints Row 2 is a game with a strong personality that excludes it from wanting to compete at all costs with more famous titles belonging to the same free-roaming genre. The THQ title pushes the accelerator on three main components that all other games develop in a different or minority way: characterization and customization, variety of missions and battles between rival gangs. Saints Row 2 has a robust single-player campaign that engages for a long time, but also tons of online multiplayer modes and the much desired co-op for two people that allows you to play the whole story alongside a friend. The game gives way to numerous technical imperfections and some uncertainty regarding artificial intelligence, but still shows respectable visual glimpses and an enviable global complexity. A nice surprise, in a winter marked by so many quality titles. Just like Saints Row 2. Pros The city is alive and full of things to do Long and varied campaign and multiplayer modes Customization Cons Some frame-rate drops Pop-ups and polygon overlaps to see again Artificial intelligence fluctuates Xbox 360 - Goals Saints Row 2 offers the player the canonical 1000 points to unlock. The THQ game is certainly not generous with the gamer, and even after many hours you can still find yourself at zero. The points are obtained by completing the various missions (very long and consisting of six levels), both in single and co-op, by defeating the rival gangs (an operation that takes many, many hours) and by collecting the various objects to be found on the city map. To find all 50 CDs, for example, it will take all thirty hours that separate us from the beginning to the end of the game. No gifts then, but a lot of sweat. Saints Row 2 is out for PC, PlayStation 3 and Xbox 360. The tested version is the one for Xbox 360.", "date": "2008-10-14", "grade": null}