{"name": "Warhammer Online: Age of Reckoning - Recensione", "ref": "https://multiplayer.it/recensioni/warhammer-online-age-of-reckoning-recensione.html", "text": "How to prepare for war Before going into the technical aspects of the game, we would like to dwell on the marketing aspects for a few minutes. With the baptism of globalization of the MMOG, had with World of Warcraft, also for Age of Reckoning we were able to appreciate the growing importance that this user base is starting to play in digital entertainment. TV commercials with good quality cinematic sequences and banners on specialized sites around the world accompanied us for a good month, culminating in a really important product packaging, in its collector's version. We had spent good words for the work done by Funcom for Age of Conan, but here it has gone one step further. The exploration of the rewarding bundle ranges from the elegant and robust box, which dominates our MMOG showcase like a giant codex, to an artbook that contains the pinnacle of Games Workshop productions for style and quality. Passing without catching your breath through an interesting and well-finished graphic novel, which serves as a presentation of the background of the various races and closes the roundup with an original Games Workshop miniature, depicting the greenskins war chief Gumlok and his shaman, to assemble and paint. The sumptuousness of the tomes also overshadows the objects, titles and extra quests present in the game. In summary: a great start. Order Fire Mage Empire: The Fire Mage is a master of destruction, specializing in fire spells. Fire is the basis of all his abilities and is even found in the heart of the Wizard himself. Using the power of the fire wind he is able to level hordes of enemies to the ground or incinerate individual foes with beams of white incandescent energy. War Priest: A War Priest of Sigmar is a terrible master of battle and a tireless defender of the faith. These holy warriors are the hammer of the church, acting both in defense of the Empire and in furthering the church's purposes. Deadly in close combat, the Warrior Priest relies on the blessing of his god to protect him in battle. Witch Hunter: The Witch Hunter is a tireless foe of Chaos, black magic and sorcery of all kinds. Fast and agile, the Witch Hunter is dangerous up close, especially when approaching an unsuspecting or frightened target from behind. Ironbreaker Dwarfs: The Ironbreaker is the quintessential dwarf - rude, argumentative, and silent. Equipped in his famed gromril armor, and wielding his hand-crafted elite weapons, he is a steadfast defender, resilient against even the most powerful attacks, and aids his allies by ensuring their safety amid the enveloping chaos of battle . Runepriest: Adepts and sages who spend their lives learning the language of runes. With their arts they are able to create incredible artifices to assault their enemies with the powers of the earth itself. They can also make their allies more resistant to more violent attacks and heal their wounds. Engineer: From pistols to grenades, the Dwarf Engineer is a deadly ranged combatant who will fill you with lead from a distance and tear you to pieces as soon as you get close. It excels at killing multiple opponents at once, as most of its explosive attacks are capable of devastating enemies that are in tight groups. High Elves Swordmaster: The learned warriors of Hoeth are the foremost and foremost masters of the blade, and are capable of weaving a wall of impenetrable steel with both the Greatsword and the Longsword. Archmage: The mightiest of Hoeth's scholars are known as Archmage, and they are capable of wielding all winds of magic into powerful sorceries known only as High Magic. Shadow Warrior: The shadiest, most sinister and most brutal of all the High Elves. Shadow Warriors are masters of ambush and warfare. They strike swiftly and silently with precise deadly volleys from their longbows, before charging in and killing any survivors with a flurry of blades. White Lion: While the vast majority of White Lions serve in the revered guard of the Phoenix King, there is a selection of hunters more attuned to nature who take it upon themselves to raise the War Lions of Chrace. Unfortunate is the enemy who comes across a hunter and his lion! Whether by ax or by claw, death is inevitable for him. Ready to fight Between public missions and quests in war zones, the journey of our character continues. Path that, unlike many other products, can also be carried out entirely through combat contro other players. In fact, not only will it be possible to devote oneself to the scenarios, instantiated places where teams of the same number compete for dominance through the achievement of objectives, but also to the much publicized outdoor RvR. And here gentlemen we are talking about war, not peanuts. For those nostalgic for Dark Age of Camelot, we will have objectives for all tastes to besiege and conquer, including a large number of castles. The success of these operations will pass through perfect coordination between the members of one or more guilds, with the ultimate aim of ensuring domination of the area in which the faction to which they belong fights. Whenever a sensitive target is captured, a bar at the top right will signal the evolution of the conflict in the area. The more goals we reach, the more we will consolidate our influence in the area, which will ensure us bonuses on gaining fame points and influence points from public quests, as well as discounts on the use of NPC merchants. The expansion of the domains of one or the other faction will in any case be aimed at one goal: the weakening of the defenses in the opposing capital, which will ultimately allow it to besiege and raid it, with the promise of a substantial bonus on fame points earned. Gorthor still appears young for this last phase, but rumors are arriving from other European servers, where the conflict is already extremely tough and where more than one guild or alliance has measured itself against the end-game content of the product. With fluctuating results and reviews that are not always positive. He mostly complains of an excessive decrease in system performance and a final phase of the siege that favors the resolution of some public quests rather than the fight without quarter, house to house. However there is still a lot of room for improvement in what will already, in many ways and for many people, be the benchmark for RvR in MMORPGs for years to come. Yes, because what we haven't said until now is that, despite some imperfections, despite the concept being abused and the technical development not exactly flawless and avant-garde, the game is fun. Amusing for the immediacy with which you are thrown into the conflict, amusing because the fights are often not resolved in 10 seconds, but also last a few minutes and almost always require good coordination of the group to emerge victorious. The combat is clearly geared for strong teamwork, so many complain about a rough balance between the various classes. What many probably don't realize is that Age of Reckoning is about mass warfare, not duels to the death. The synergy of a close-knit team can create pleasant and engaging moments of healthy videogame competition, dragging even the most skeptical of carebears into the vortex of war. Among other things, the framework for this cooperative spirit is the excellent guild management system, which provides for an advancement in the guild level as its members complete objectives in the game. As you grow, you unlock more guild tactics, banners, guild bankers, and a host of other bonuses. Undoubtedly, in our opinion, what clearly should have been the central objective of the game, that is to involve lovers of group clashes between players, has been largely achieved. There are still many painstaking cleaning operations to be carried out, however we are in an MMORPG that has been out for less than a month and moreover without any particular hitches. Neither Rome nor World of Warcraft were built in a day. What is beautiful is not beautiful, but neither is what is not There had to be shortcomings somewhere, otherwise we would have been here talking about a new phenomenon of the kind. In our opinion, the wealth of content contrasts with a technical and graphic approximation, which disappoints in some respects. Pass the choice not to exaggerate with tone and saturation, probably to try to do justice to the dark gothic taste of the Games Workshop universe. But from here to seeing the humanoid monsters make a mocking moonwalker, as they try to escape from the player, without turning their backs on him, it passes. The character designs are vaguely acceptable, as far as fidelity to the original concept is concerned. The animations, while barely adequate, disappoint in their woodiness and sometimes don't seem to help the feeling of continuity of the combat actions. The graphic details of the backgrounds, on the other hand, are more than sufficient, especially with regard to the buildings and constructions of various kinds, well modeled and built. The Gamebryo graphics engine, a revised and corrected version of the same Oblivion engine, seems to resist, even in preswithout a large number of textures on the screen. On the other hand, physics does not seem to shine particularly, sometimes inconsistent with the succession of movements. We were also a little disappointed by the variety of equipment, which in 25 levels of experience tested, did not show to be in sufficient number to guarantee uniqueness to the style of one's alter ego. It helps somewhat that the ability to paint clothing in various colors and the ability to acquire trophies from the Tome, to show off on top of the armor pieces. All in all, a sufficient sector if we take into consideration the fact that, due to technical needs, the graphics must remain streamlined, in order to avoid playing slow motion during castle sieges, as someone from the competition has well thought of doing. We certainly prefer playability to glitz for its own sake, while admitting a certain anonymity of the design. On the other hand, the sound sector is good, with a recurring theme in the opening credits, which will certainly enter the imagination of the players and some atmospheric jingles, played in the right place and at the right time. For the rest, the noises of swords, styles or spells will certainly not remain in history, minimalist and below average, decidedly not in line with the explosions of colors and energies. Nothing really unforgivable, however, for those who grew up with bread, chickpeas and Ultima Online. The system requirements are more or less average for a product of this type, far from the killing machine required by Age of Conan, yet slightly more demanding than World of Warcraft, despite the arguably lower yield. Ultimately it could have been done better, but the Teutonic work that Mythic has always reserved for DAoC updates, including the graphics engine, bode well for a further and future step forward. The crafting system should be noted as disappointing, which includes only 2 creation skills and 4 ingredients collection skills. The practical application of this skill sometimes appears superfluous and, apart from the ability to create Talismans, which enchant objects with further bonuses, the benefit-effort ratio is not always very convenient. Too bad, the umpteenth demonstration that lately a certain approximation is rampant in inserting craft skills in games. Comment With several merits and some flaws, we can say that Age of Reckoning is a good product. Content is there in abundance. Combat, as promised, is the core of the game from the very first levels, and offers an excellent alternative to the classic leveling that we have been used to seeing for years. The battles, bitter and close between organized teams or chaotic bolgia, amuse and satisfy the palate, adding a coefficient of challenge that invites you to give more and more, in terms of skill and organization of the group. There are some technical and stylistic limitations, which will certainly make fundamentalist aesthetes turn up their noses, however in our opinion, they do not question the good work that has been done in terms of playability and medium-long term appeal. The end game is still to be seen and, in this case more than ever, it will be at the mercy of the players and their choices, especially regarding the daily strategic planning of the conflict in the RvR areas. The PvE content may certainly disappoint, which beyond a good system of public quests and some interesting storylines in normal missions, offers a still limited variety of dungeons and instances to explore. Furthermore, an evident linearity of the clashes will certainly not make the battles against bosses and various amenities so tactical and complex as in World of Warcraft. But this isn't World of Warcraft, we knew it wasn't going to be and we acknowledge it. The product must be enjoyed in other terms and will certainly do justice to all the last-minute fighters who have waited so long for an opportunity to take up their swords again, after the engaging Italian experiment of Dark Age of Camelot of a few years does. The war has begun. Pros Plenty of objectives that guarantee good longevity in the medium-long term Fun and immediate group RvR Good characterization of the character's skills Interesting system of public quests and guild advancement Cons PvE content still limited and not particularly cared for Technical-graphical sector not always up to it Crafting system disappointing and without personality Minor bugs and Italian translations still incomplete Warhammer Online: Age of Reckoning is available for PC. Destruction Chosen Chaos: A Chosen Champion of Tzeentch is a terrible vision - warped by the blessings of the dark gods, these massive beasts have the size and power to take on even the mightiest of", "date": "2008-10-09", "grade": null}