{"name": "GTR Evolution - Recensione", "ref": "https://multiplayer.it/recensioni/gtr-evolution-recensione.html", "text": "SimBin: all-Swedish success Founded in 2003 by Henrik Roos, SimBin is a Swedish software house that with its 70 plus components in a few years has been able to establish itself decisively in the field of driving simulators. Starting out as creators of mods for F1 2002, the members of the software house have managed to string together one success after another up to the GTR Evolution we're talking about today. The challenge for this year for SimBin, however, is far from over, given that towards the end of 2008 (maximum beginning of 2009) RACE Pro should also be released for Xbox 360, a platform that will mark the debut of the Swedish boys also in the console market. where they will find themselves facing quite a bit of competition after winning the hearts of PC gamers. Comment SimBin hits the target once again, churning out an exceptional title from all points of view, with many merits and only one small flaw concerning damage management that is not fully convincing. Trifles aside, the gaming experience proves to be among the most satisfying and enjoyable currently obtainable from a driving game: the merit of SimBin was precisely that of making GTR Evolution a game capable of satisfying all types of passionate players. racing on four wheels, creating a very successful mix between the hardcore component and the more immediate one with which to jump headlong into a race with just a few clicks of the mouse. In conclusion we can say that this title definitively consecrates the Swedish development team at the top of PC simulators, waiting for SimBin to enter the console market with RACE Pro and hoping that after this the studio will dedicate itself to a brand new chapter to savor soon again on our monitors. Pros Excellent reproduction of weather effects Sky-high fun Solid and satisfying online Cons Unrealistic damage management Those expecting killer graphics may be disappointed PC - System Requirements Minimum Requirements Processor: 2.4 GHz Intel Pentium 4 or equivalent RAM: 1 GB Video Card: DirectX 9 compatible 3D with 256 MB of memory Operating System: Windows XP or Vista Hard Disk: 3.7 GB DirectX 9 with compatible sound card Recommended Processor: 3 GHz Intel Pentium 4 or equivalent RAM: 2 GB Video Card: DirectX 9 compatible 3D with 512 MB of memory Hard Disk: 4,7 GB DirectX 9 compatible Force Feedback Wheel Test Configuration Processor: AMD Athlon X2 3800+ @4200+ RAM: 2GB Video Card: NVIDIA GeForce 7900GT 512MB Operating System: Windows XP The Green Hell awaits us The driving experience of GTR Evolution is strongly based on the laws of physics and realism, making the game a real simulation and putting the player in the role of a driver in the literal sense of the term, that is, making him feel just as if was there in the cockpit with the steering wheel in hand. The set-up maniacs are satisfied with a series of parameters that can be modified to their liking to get a few cents more on the times, while the driving model consequently presents itself with a simple but demanding style, thanks to a physics that really closely resembles that of the cars existing in the world in the flesh, of which GTR Evolution also reproduces strengths and weaknesses, forcing the player to choose the car that comes closest to his driving style. A type of approach perhaps not for everyone you might say, but this is where the enormous level of scalability of the game's difficulty takes over, which starts from the automatic gearbox passing through a series of settings that make driving accessible even to those who don't want to stay there to worry as if he really had to drive a race car. The only drawback attributable to the likelihood of GTR Evolution with reality is represented in part by the implementation of the damages: not that these do not exist of course, but a certain immunity of the cars can be found when they collide with each other, even at more of 100 km/h. All for the benefit of the branches. Evolution is among us The game modes present in GTR Evolution really leave a wide choice for the type of fun you want to undertake: between races against time, arcade races, individual events in which to try your hand at a race weekend and entire championships in which to take part , there really is a lot of irons in the fire, not to mention an online mode that we can define without hesitation as the most satisfying of those on the gaming market. Taking part in a 25-person online event going from free practice to race day trying to beat human opponents is truly a wonderful experience: all technically carried out flawlessly, without complaining of performance drops or problems of any nature attributable to youam of development. Even if instead you want to face the CPU-driven pilots, there is no shortage of bread for our teeth, given that the game's artificial intelligence is presented as combative and never giving up, forcing the player to continuously commit himself to 100%. Another applause goes to SimBin for the management of dynamic atmospheric events, not at all an end in itself but profoundly capable of modifying the driving style and consequently the fate of the race, in a very similar way to what we are used to seeing in reality. Keyboard, no thanks Graphically, GTR Evolution comes with a lean and performing engine even on older configurations, without being obsolete in detail, even if obviously we are not in the presence of the graphic detail of Far Cry 2: those looking for the maximum visual experience it could turn up your nose, but extremisms aside we can certainly be happy with what we see, never approximate but rather seasoned with small tricks placed here and there that cannot fail to please. Moving on to the sound, the game clearly hits the target: the music in the menus is catchy but what makes the game worth ~living~ are the noises that can be heard inside and outside the track, between circuit speakers and sound effects that make the driving of the cars is even more beautiful and they seem to come from the smoking asphalt of a real circuit. The control system allows you to play with any type of peripheral connected to the computer, with an avalanche of predefined settings for the various brands: while the steering wheel obviously represents the ideal solution for a driving game, even with a joypad it is possible to enjoy a positive experience, something decidedly not valid for the keyboard, too insensitive to allow the player to control his car in normal conditions, let alone with wet asphalt. The beating heart of GTR Evolution is, as for its predecessor, the large community of players who not only populate the online games, but who also actively contribute to the creation of additional content such as cars and new tracks: but after all it was more than legitimate expect an opening in this sense from a software house that started just as a creator of mods. Just go around the net among forums dedicated to SimBin titles to realize how active people's participation and involvement are.", "date": "2008-09-30", "grade": null}