{"name": "Ape Escape M", "ref": "https://multiplayer.it/recensioni/ape-escape-m_a.html", "text": "It was way back in 1999 when Sony released the first episode of Ape Escape for PlayStation: it was an action game with a third person view, in which the protagonist (Spike) had to explore a series of stages in search of crazy and bullying monkeys, each characterized by a distinct personality. The game was based on a control system designed specifically for Dual Shock (the first ever!), in which you used the left analog stick to move your character and the right one to wave the sophisticated monkey-catching net. The two sequels, both released for PlayStation 2, resumed and enriched the mechanics of the first episode, providing the series with graphics up to the situation and an even greater dose of humor, which in the Italian version could count on excellent dubbing , made with care and passion. For this mobile reduction of Ape Escape, the developers thought of using the mechanics of top-down action games. So we will be able to control Spike using the d-pad of the mobile phone in the four directions, pressing key 5 to activate the monkey-catching network, keys 1 and 3 to scroll through the inventory of gadgets and function keys to use them. As mentioned, the game is made up of twenty-five stages (including a short tutorial), divided into five different locations that have the theme of the forest, the desert, the snow, the rocks and the technological landscapes. In each level there will be a certain number of monkeys to capture: we don't have to catch them all to be able to access the next stage, but doing so will be essential to unlock a new location. As in the best of traditions, we will immediately be able to capture the most naive monkeys, while for the smartest ones we will necessarily have to resort to the help of a series of technological gadgets: the radar, for example, will show us the direction in which to move to find the closest primacy. As you progress, however, you will be able to use new tools and the gameplay will be enriched. Spike does not have the ability to jump, but the stages often develop in height and therefore it will be necessary to find the passable passages to reach the most inaccessible and hidden areas. Once we reach a monkey, we will have to approach it and activate the network to be able to capture it: its profile will end up in a database that can be freely consulted from the start menu, a bit like it happens in the console versions of Ape Escape. Unfortunately the technical realization of the game is really, really mediocre. The thing that most catches the eye are the stages, designed really sloppily, with the repetition of the graphic elements that practically becomes the norm and a choice of colors sometimes disastrous. The situation improves with sprites, but only slightly: the design is far from happy, and the quality of the animations leaves a lot to be desired. The sound does not improve things, since as usual it is anonymous and in this case also rather repetitive. PRO Good number of internships The gadget system is interesting AGAINST Mediocre graphics Poor and repetitive sound Limited gameplay", "date": "2008-09-26", "grade": "S.V."}