{"name": "Gestisci la Fattoria - Recensione", "ref": "https://multiplayer.it/recensioni/gestisci-la-fattoria-recensione.html", "text": "Run the Farm is available for Nintendo DS. Comment Manage the Farm is a title that stands out for its quality, compared to the mass production of titles aimed at a young and very young audience. The great variety of options available, the presence of unlockable achievements and a wireless mode that allows us to visit our friends' farms and invite them on a tour of ours allows the game to never be boring, despite the apparent repetitiveness of the actions to be carried out daily to allow the development of crops and livestock. Technically the game is equally accurate, with a good quality control system, graphics and audio. Pros Good technically and graphically Varied and never boring Objectives and tours to farms via Wi-Fi Cons Sound compartment a bit monotonous Some might not like the unromantic aspect of the countryside After getting used to life simulators in the countryside thanks to the Harvest Moon series, a new title dedicated to rural realities arrives on DS: Manage the Farm. After being accustomed from the Harvest Moon series to simulations of country life seasoned with romantic and fantastic elements, this time we are faced with a more realistic title that will lead us to have to manage the key elements of a modern farm, including the use of industrial machines that support the modern farmer in the life of the fields. At the beginning of the game, after having chosen our avatar, the name of the farm and its symbol, we will be introduced to the essential elements that will accompany us in each game day. First of all we will have to visit and get to know the general markets, where we will buy seeds, livestock and new structures and machinery. At the beginning, however, we shouldn't expect to have it easy: we'll start with a small and uncultivated piece of land and gloves and a hoe, the only support for our good will. We will need a small budget to buy the first seeds and be able to start our production. At this point, once the first crops have started, we will have to take care of them day by day, watering the seedlings, spraying them with pesticides if infestations occur and doing whatever is necessary to get to harvest day. But the farmer does not live on spinach alone, and in fact, alongside the crops, another cornerstone of our development will be the care of the livestock. And even for them, once the appropriate structures have been purchased to raise them such as sheepfolds and stables, it will be necessary to equip themselves with all the necessary tools, such as milk buckets, clippers, medicines and so on. As we progress in the game and earn money from the sale of our products we will be able to expand our facilities, buy new machinery, expand and consequently increase our production and our income. A linear title in its functions, day by day we will have to carry out routine activities while slowly we will see our farm grow, laboriously, in a virtual representation of the real toil of country life. Very well structured, quite varied in the options and types of management available. A series of periodic events, such as the County Fair which takes place at the end of each season, intervene to prevent the game routine, albeit varied, from becoming tedious. The graphic sector, like the sound one, are sufficiently well cared for, making the game always pleasant and not tiring to the eyes. The management with stylus and traditional commands is rather comfortable, intuitive and precise.", "date": "2008-09-25", "grade": null}