{"name": "My Baby Girl - Recensione", "ref": "https://multiplayer.it/recensioni/my-baby-girl-recensione.html", "text": "Once upon a time, little girls played with dolls. There were all kinds of them, even those who talked, who drank the bottle, even those who needed to be changed. Today all this has become virtual, thanks to a series of games that allow us to explore every detail of the life of pseudo-mothers, especially on the platform that best welcomes the genre: the DS. My Baby Girl fits into this panorama as a rather complete title, thanks to its many options and a more educational perspective than many other similar titles. In fact, the game leads us to take care of an infant from the first days of his life, in all its facets. Not only diapers to change, bottles to administer and bath to do, still present and important parts of the game. We will also have to take care of the actual development of the child, both from the point of view of activation and mental stimulation and from a mere physical point of view. This is why it will not be enough to shake a rattle in front of the child to satisfy the demands of the game: we will have to move him beyond his visual field limit, to force him to learn to turn around and concentrate his attention on an object, for example. To help us in the various stages of growth and development of the child we will find the professional figures who normally support a young mother: a pediatric nurse who will give us a series of suggestions for the care of the infant and a real pediatrician, who will prepare a monthly program of necessary exercises for the stimulation and psychomotor development of the virtual child. In practice, the game takes place in a classic way: at the beginning we will have to ~create~ our child, choosing its gender and personalizing some characters, as well as choosing its name . At this point we will find ourselves in the house, where each room will be associated with a precise action: feeding, bathing, taking the baby for a walk or dressing him, for example. Strolls in the pram or stroller will also be important for the development and stimulation of the little one. The clothes, on the other hand, are an additional component that allows us not to overlook one of the aspects of any doll game, that of matching outfits, shoes, hats and anything else possible. We have a shop where you can buy additional items with the money earned by taking pictures of the infant which, in addition to ending up in the family album, can in fact be sold to the photographer himself. Other clothes can be earned by giving the photographs to the grandmother, who will reciprocate with additional items. The various mini-games necessary to carry out the game's functions are quite intuitive and well illustrated and use both the console's stylus and the microphone, in cases where we have to vocally interact with the child. Comment My Baby Girl is one of the many games available today on the gaming market that are aimed at children. Among them we know how to highlight thanks to a very well structured management of the functions to be performed to take care of the virtual baby, management that does not neglect a certain educational component. In fact, children who are busy playing with this title will find themselves forced to pay particular attention to the signals sent by the infant, which must be understood in order to be able to intervene on his needs, whether they are to be changed, washed, fed or otherwise. Also in carrying out the mini-games present we must also pay attention and care: for example when taking a bath we will have to be careful that the child does not slip under the water, pulling him up every time. A good product, therefore, for all aspiring mothers who prefer to deal with a virtual baby rather than with the classic dolls that need to suck plastic bottles. Pros Good technically and graphically Educational Very varied in game options Cons Sound compartment a bit monotonous The management of the rattle is a bit imprecise", "date": "2008-09-24", "grade": null}