{"name": "Star Drift Evolution", "ref": "https://multiplayer.it/recensioni/star-drift-evolution-recensione.html", "text": "Form or substance? Independent realities ask themselves the question more often than you think, given that for a whole series of reasons it seems impossible to create a product that can truly satisfy everyone, even more so when the teams are made up of very few developers... or even by only one. The Star Drift Evolution review speaks of a title that has convincedly chosen the path of substance and has done so in the best possible way: through a long period in early access which has allowed the author and his ineffable collaborators to build an increasingly large and passionate community, which immediately understood the potential of this project and contributed to its growth. Structure Star Drift Evolution, a look at the tournaments that make up the career mode Growth, we said: from its Early Access debut on Steam to the launch of version 1.0, Star Drift Evolution has more than doubled the available tracks, currently seventy-five, and brought the number of cars to fifty. In short, we are talking about respectable numbers, which in combination with a very gradual progression system, which unlocks new locations only when you get hold of a certain number of stars, translate into dozens of hours of entertainment. Moreover, with the latest update, an easier option has been added to access all the scenarios much more quickly. To further enrich the offer, we also find an important multiplayer component, both locally and online, in this case for a maximum of twenty participants and with the possibility of opting for numerous different stipulations, hosting a game or participating in an ongoing race, adjusting the options to activate or not the collisions (better not, as it is easy to guess), limit the selection of cars and courses, organize challenges between teams and more. Gameplay Star Drift Evolution top-down view emphasizes the diorama-style aesthetic approach If the structure of Star Drift Evolution appears decidedly rich, the gameplay is undoubtedly the most relevant component of the experience packaged by Catze; and it too has grown over time, in concert with the feedback provided by users. Once an essential but rather effective tutorial has been completed in underlining the mechanics of the game between the accelerator, brake, handbrake and the different surfaces that can be traveled on in each individual track, characterized by a different color tone, you immediately launch onto the track. From the first impact, the driving model reveals itself to be unexpectedly deep, given that it changes radically depending on the vehicle we are driving as well as the selected view: the default one is a top-down relating to the car that recalls the great classics of the genre, but you can opt for a series of hybrid solutions or for a third person close to the approach seen in Art of Rally, which we recently reviewed. The key to success almost always lies in playing in advance, sending the car into a skid and thus closing the bend so that the wheels do not tread on slippery or slippery terrain, making us waste time. The memorization of the route, obtainable only through dozens and dozens of attempts, while maintaining a certain concentration capacity, will therefore contribute substantially to the cleaning of the trajectories. Even a small error can in fact translate into the impact with an obstacle or with an opponent, and that point anything can happen; also that the game gives rise to frankly exaggerated and difficult to read reactions, in a sort of crazy bouncing pinball machine that is somewhat reminiscent of the final scenes of The Blues Brothers. When it happens, however, one key and you're back on track or you start all over again, Trackmania style. Star Drift Evolution, one of the fast tracks played in a third person view However, we were talking about the cars: each of them has different values in terms of speed, acceleration, road holding, aerodynamic load and suspension stiffness. Well, these aspects substantially influence their behavior on the track, making them more or less easy to control, more or less equipped with a starting point. Principles which however are not absolute, as it is easy to verify by looking at the rankings and the vehicles used for do the best times: there is a close relationship between car and track, and understanding it is of vital importance. In the same way, at a certain point the developers also indulged in proposing borderline situations, in some ways similar to those seen in Wreckfest (our review here), with challenges between heavy or all too light vehicles and all-new routes suddenly fast and linear,which finally allow you to let go of the handbrake and practice more conventional driving. Technical realization Star Drift Evolution, an actually evocative sequence within one of the first tracks The aesthetic idea behind Star Drift Evolution was to create a sort of graceful diorama with a minimalist style, but it is clear from the start that the Catze-branded title does not reach the same levels of refinement seen in the aforementioned Art of Rally, to make a very recent and very fitting comparison. Yes, there are sequences that are more inspired than others, for example when you race at night, and an excellent job has been done on the design of the cars, which often and willingly take up real models or at least one precise category, but it often happens that the seabed assets appear generic. Furthermore, the interface would need to be rethought to get away from the typical canons of some independent productions. Star Drift Evolution, a glacial location where you proceed by sliding Having said that, the lack of weight and brilliance certainly has its advantages when perhaps you find yourself running Star Drift Evolution on an ultrabook during the holidays, because it is clear that we are not dealing with an expensive title in terms of hardware requirements. Enjoying the game on a 4K panel and the usual desktop PC equipped with RTX 3070 remains the best solution to get the most out of this experience, also in terms of fluidity and precision. A pair of good headphones or a hi-fi system will also do justice to a really interesting soundtrack, with songs signed by Kenobit, Electroshark and Luke McQueen II.", "date": "2021-09-13", "grade": "8.0"}