{"name": "X3: Terran Conflict- Recensione", "ref": "https://multiplayer.it/recensioni/x3-terran-conflict-recensione.html", "text": "Lando is a smuggler and a rogue: your type In Terran Conflict, unlike its predecessors, it is possible to choose which career to start the road to attaining power with: you can choose to play as a terrestrial pilot and begin the adventure aboard a small starfighter, or an alien merchant with his freighter, or even an assassin and his rigged interceptor, or directly of a non-default character. Regardless of the chosen career, freedom of movement will be more than total: you will have an entire galaxy that can be freely explored via hyperspace portals and dozens of stations and shopping centers in which to carry out your trades: if you wish, the war between the Xenon (an army of mad machines that attack everything and everyone) and the ~terrestrials~ can become for you only a new possibility of profit. Because it is precisely the freedom of choice that makes Terran Conflict almost an Oblivion of space: do you want to buy a transport and go to the market? No one forbids doing so, buying goods where they cost little and reselling them where they are worth a lot... do you prefer the fastest career of the space pirate? Start boarding other people's ships, but don't be surprised if the authorities hunt you down. Do you feel like a bodyguard? Visit space stations and mining facilities to find someone important to hire for a ride. The only goal is your power. You can go as far as buying entire space behemoths and commanding your own private fleet, all from the perspective of your personal ship. The game possibilities are almost endless. And it's in this vastness that Terran Conflict's problem comes in: it's a huge, complicated game that requires more attention than usual. It is not a title for those who want to ~play a practice match and go~ by knocking down a dozen enemies and then going back to the office or going out with a girlfriend: a Terran Conflict session requires time and patience as if it were an MMORPG or a role-playing game of those serious. This is not so much because of the commands that can be easily managed via mouse (well, more or less comfortably), but of the feeling of helplessness that the world that revolves around us gives: you are nobody and you don't need anyone, each sector has different portals for others sectors, potentially you can do so many things that you won't know where to start and every now and then you will meet someone who wants you dead without you remembering why. The complexity is remarkable and the time required just as much: often the objectives within a sector will be several tens of kilometers away from the starting point and waiting the 10 minutes necessary to reach them could in the long run bore players who are not looking for a simulation but any arcade. And beware of space battles too: apart from the fact that those around you are far from inexperienced and generally even the least of the fighters represents a challenge, always remember that your fighter is not unbeatable. It's not Rogue Squadron's X-Wing circulating unscathed among half a dozen Tie Fighters, nor Alliance's B-Wing single-handedly taking down an entire Star Destroyer: it's a hunk of metal with a flimsy shield and even just one-on-one could prove lethal (which is annoying since the rescue is automatic and takes place when docked in a space station), not to mention what would happen if you were to annoy an interstellar frigate with your freighter. Much better to buy a shipyard and build your own fleet before attacking those of others or maybe better to go into business rather than war, given that, however rich, you will always remain a private individual with entire galactic empires in front of you, and don't think it's enough to select a station and click on buy to have control over it. Owning a space station means first of all designing it (with a good number of design models), then avoiding being so close to a planet that it is drawn into it by the gravity well (you don't want your beautiful personal MIR to become a fireball right?) and above all ensure a good supply of stocks and weapons, the latter to be ensured also for your spaceships. It exceeds the speed of light by 05: it won't look great, but it lacks nothing... Moving on to the technical aspect, the X series has always been full of beautiful scenarios and breathtaking models, surrounded by incredible light effects and pyrotechnic explosions: Terran Conflict continues this pleasant trend by offering the player an unparalleled visual spectacle. Deep space is crisscrossed with stars and meteors, planets are bright and detailed, space stations and spaceships are beautifully designed and brimming with detail andof well-defined and sharp textures. The fighters move fluidly in the immensity of the skies and the plasma or laser cannons are a real feast for the eyes. Terran Conflict's graphics are like certain paintings: you can hear about them for years from anyone, but you only realize their beauty when you see them. Also noteworthy is the artificial intelligence that gives a ~personality~ to non-player characters: small and fast ships perform evasive maneuvers and try to outflank the enemy by attacking them in groups, merchantmen prudently keep out of trouble and battleships they rely on volley upon volley of cannons to maintain their supremacy; your comrades and subordinates are finally completely self-sufficient and even without precise orders they will hardly be destroyed without a shot being hurt. The only fluctuating aspect is the sound: if on the one hand the music proves to be worthy of the remarkable cinematic flavor of the product, rivaling some soundtracks (and mimicking that of Star Trek) the speech is rather hinted at, with lackluster recitations and voices unconvincing. Comment X3: Terran Conflict can be defined as a successful product. Not so much for the undisputed technical merits and depth of gameplay, but because it has achieved the goal it set for itself: to renew a saga dedicated to purists of the genre and offer them a highly competitive, solid, complex and satisfying product. Those who have the time and desire to dedicate hours to building their space empire will find in Terran Conflict the best available at the moment, those who loved the previous episodes will love this one too and those who own a latest generation machine will finally be able to push it to the max to enjoy graphics like few others on the market. Of course, those looking for easy space combat missions to kill the boredom of a rainy afternoon would do better to reinstall X-Wing Alliance for the umpteenth time (with some mods perhaps), but that's not a problem: it's not a developed title for casual gamers, this. Pro Universo vast and beautiful A thousand things to do It costs 29.90 euros and is worth twice as much Cons Extremely complex Remains a niche product Some trips can be boring X3: Terran Conflict is available for PC. PC - System Requirements Minimum requirements Processor: Intel/Amd 3000+ RAM: 1024 MB Video Card: Any DirectX 9 compatible 128 MB card Operating System: Windows XP/Vista Hard Disk: 4 GB Recommended Requirements Processor: Intel/Amd DualCore RAM: 1.5 GB Video Card: 256 MB Test Configuration Processor: Intel Core Quad 2.40 GHz RAM: 4 GB Video Card: NVIDIA GeForce 8800 GTS Operating System: Windows Vista Home Premium", "date": "2008-09-18", "grade": null}