{"name": "Spore - Recensione", "ref": "https://multiplayer.it/recensioni/spore-recensione.html", "text": "PC - System Requirements Minimum Requirements Processor: 2 GHz Pentium IV or AMD equivalent RAM: 512 MB Video Card: At least 128 MB video RAM and support for Pixel Shader 2.0 Disk Space: 6 GB Test Configuration Processor: Intel Core 2 Duo E6400@3, 0GHz RAM: 2 GB Video Card: Nvidia GeForce 8800 GTS Sound Card: Creative X-Fi Monitor: Samsung 19@1280x1024 Comment Spore is an extremely ambitious innovation product from which it would be unfair to expect perfection, but which nevertheless hits many of the targets it set for itself. The only real flaw that we feel like underlining is how to experience the best of the game it is necessary to wait at least 4 or 5 hours and reach the space phase: the previous ones, however enjoyable and fun, provide a gaming experience that many it will be discontinuous and irregular, where in the name of a certain elegance and simplicity too much has been sacrificed in terms of gameplay depth. It's not a stretch to say that the tribal and civilization phases could easily be reproduced in a Flash-coded mini-game for the Web. In reality the first four components of Spore must be evaluated for what they are: a sort of long tutorial mixed with editors with which to conceive a race in which the player finds himself emotionally involved and with which he will have no difficulty in facing the literal enormity of the universe. The game really begins the moment you take flight to the stars: the title literally shines with the kind of absolutely unique entertainment it is able to offer. It will not (yet) be the best title bearing the signature of Will Wright, but taken as it is Spore already approaches excellence and if it were to be ~cultivated~ over time with an expansion model as was done for The Sims, could still reveal enormous potential. Pros Fun in a genuine and immediate way Great synthesis of innovation and creativity tools for the player Rapid evolutionary phases and instrumental to the outcome of the space phase... Cons ...but a little too short and superficial, especially the Tribe and the Civilization Technically outdated even if stylistically very valid Take the first steps It is obvious that many of the characteristics that identify and make our race of galactic dominators unique will depend on the choices we make even before crawling out of the primordial soup and it is all in all legitimate to consider the first four evolutionary phases as so many elaborate interactive editors, characterized by a superficial gameplay, but equally capable of generating entertainment. The cellular phase is the most basic and at the same time the most viscerally fun: a sort of polygonal version of Pac-Man, to be played strictly in two dimensions, where our cell fights for survival, looking for food and avoiding the biggest predators of her (for the moment...). Those who have played it will immediately remember Fl0w, the bizarre but successful mini-game for PlayStation 3, even if this phase of Spore is if possible even more simplified in terms of gameplay, where the only quirk is the physics engine that forces us to evaluate the moment of inertia caused by swimming too fast and which complicates the ability to change direction, while the editor itself is rather simplistic where in the end the only choice to make before the next step is whether to create a carnivorous creature, herbivorous or omnivorous. Nonetheless the genuine fun and the window of duration within 15-30 minutes make it virtually guaranteed replayability. That of the ~Creature~ is undoubtedly the most rewarding and best cared for preliminary phase, as well as the one in which you will probably spend the most time. Part of this is of course thanks to the editor, a real joy to use, but the gameplay in this section also has its undoubted merits. It is essentially a sort of Action RPG, with controls reminiscent of World of Warcraft or Guild Wars: W-A-S-D keys or the mouse for movement, space bar to jump (and fly for those with wings) and activation of various skills via numeric keys. To evolve, the creature needs to interact with members of other species, obtaining DNA Points for each alliance it manages to make (impressing a sufficient number) or for each successful extinction (in this case by killing a sufficient number of specimens). To favorably impress the other ~animals~ you have four different ways of communicating: singing, dancing, flirting and posing, in a sort of mini-game of combinations in which it is necessary to imitate those of our interlocutors. We are all the more persuasive the more our creature will be characterized by social traits, while for those who are raising a predator it is easier to resort to brute force, and to the four combat skills: bite, blow, charge and spit. Like peaceful skills, combat skills can progress for 5 levels, depending on the body parts and evolutionary options with which we will gradually enrich ourselves, also modifying speed and health statistics. Whenever the reserve of points will seem adequate for the purchase of some change, all we need is to find a mate and reproduce us, to access the creature editor again where we can make all the necessary changes. This includes the sale of obsolete components and the addition of new limbs and appendages obtained from the alliances / extinctions of others and from the analysis of bone remains of older species with which the continent is littered. Finally, along the non-linear path of evolution chosen by us, there are some pre-established stages in which our brain will increase in size, allowing us to create and enlarge a small herd of creatures (equal to us or our allies) that will follow us in exploration and will participate with us in fights and friendship rituals. Ultimately that of the Creature is the most complete and gratifying evolutionary phase, capable of generating the greatest degree of emotional attachment towards our pet... which is not an element to be underestimated because it will then be the decisive factor in our choice if whether or not to bring this race to the top of the galactic theater or whether we will abandon it to champion the cause of some other xenomorphic being more congenial to us. Civil or uncivilized? points of view... With a cutscene that exquisitely mentions 2001: A Space Odyssey, the achievement of self-awareness by the last generation of our creature, makes that spark of intelligence shine that leads to the first step towards civilization: the tribal organization. This phase takes on the characteristics of a real-time strategy game, even if with such simplified connotations as to be slightly annoying at times. No base construction process other than the choice of which buildings to build in fixed positions, no tech tree of the units (there is only one type) which can only be distinguished by the type of tool they carry. Finally, the only resource to collect is food (which makes life much easier for the military tribes who can thus go around in combat gear all the time). Also in this phase it is possible to interact with tribes of other races belligerently or peacefully and to do so it is possible either to visit other people's villages equipped with musical instruments or in possession of weapons. There are three types of each category, each associated with a different building to be built, while of course it is not possible to build them all. Like RTS, the tribal phase seemed too linear and shallow, with even the editor limited to the configuration of the members' equipment (headdresses, tribal masks, armor and bags) which influence a new set of statistics relating to combat skills , health and efficiency in collecting food. No aesthetic customization of the village that will simply evolve in appearance towards increasingly evolved architectures as we defeat or forge alliances with new vassal-races, gradually building a totem whose shape will reflect the chosen conduct. And the best is only now... Building a UFO capable of leaving the planet's surface is the pinnacle for the civilization of a planet but only the first step in the foundation of a true stellar empire. Were we to quantify the importance of the space phase in Spore's general economy, we'd say no less than 80%: built like a sandbox organized into missions in full Grand Theft Auto style, the player is relieved of the urgency of looking after an entire planet , reducing the scope of their attentions to a single spacecraft and its commander, engaged in missions of exploration of the cosmos, contact with other civilizations, kidnappings, trade and - of course - wars of conquest. The feeling of freedom is absolute, both for what it is possible to do and for the possibility of choosing how to complete it and one of the major incentives to continue the adventure and in pursuit of the status of omnipotence is precisely the continuous exercise of improvement of our vehicle. The amount of devices with which it is possible to enrich it is disproportionate and right here we find some of the tastiest references to science fiction pop culture, from the tractor beam to the Death Star-style planet-destroying one. Not to mention the terraforming and colonization tools that could really give you some delusions of omnipotence. Once they become the doundisputed miners of our continent, we will move on to the Civilization phase, where the objective is the conquest (or peaceful unification) of the entire planet, now fragmented into the different factions of our race, which developed independently. This is by far the weakest phase and which is most affected by excessive simplification: a Civilization reduced to the bone, with a real-time unit control system very similar to that of the tribal phase. Unfortunately that means it shares some of its flaws, now exacerbated by the dramatic increase in scale. The first is an interface problem: it is not possible to organize units (land, sea or flying) with keyboard hotkeys, which makes it complex and frustrating to manage large armies that you will inevitably struggle to find in the microscopic map or on the real playing area, which being spherical and mostly devoid of details, does not offer a particularly effective tactical view. This combines unhappily with the pathfinding of artificial intelligence, which often sends units along improbable routes due to seemingly harmless but obviously insurmountable obstacles and almost invisible to us. If then the tribal phase offered little in terms of customization, Civilization suffers from the opposite problem, exaggerating in terms of purely aesthetic editing and with little impact on the gameplay. In addition to the clothing of the creatures, it is possible to work on the buildings of the city (town hall, houses, factories and recreational places) and three types of vehicles, for a total of seven creations. The latter then have to be created with an even more elaborate editor than that of the creatures, which is similar to a real modeling software. Certainly fun - and downloading other players' creations is immediate and nice - but in fact there's no real reason to do anything other than make your own cities look good. The impact on the game is very minimal, especially with regard to mobile units, unless you play with very high zoom levels. Luckily this phase is as short as the tribal one and indeed it is possible to ~get over it~ quickly once you gain access to the special abilities depending on the temperament of our race: a nice global tactical nuclear bombardment will end the war in no time and will open your gates of the cosmos. The official guide Multiplayer.it Edizioni publishes and distributes the official Spore guide, already available in shops at the recommended price of 14.90. The guide, 192 full-color pages, explains in detail all the customization options to help the player evolve their Spores from a single-celled organism to an intelligent and conquering race. The guide also contains a poster with Spore drawings and models as a gift.", "date": "2008-09-15", "grade": null}