{"name": "Street Fighter 2", "ref": "https://multiplayer.it/recensioni/street-fighter-2.html", "text": "The ~Pac-Man~ of the 90s There is probably no gamer who does not know Street Fighter 2. Released in arcades in 1992, it represented an inexhaustible gold mine for Capcom, who converted it for any existing game system and made countless sequels. In fact, the commercial success of SF2 has allowed the Japanese software house to become what it is today and to churn out masterpieces such as Resident Evil, Devil May Cry and so on. Street Fighter 2 is not a simple sequel to Street Fighter, but a real evolution for a genre that from that moment on is characterized by the large number of playable characters (all strictly different), by the alternative endings, by the execution of special moves and so on. The conversion for SNES was for a long time the best ever, moreover it resided in the first 16 Megabit cartridge for the Nintendo console and incorporated most of the elements present in the arcade version, with some differences due to the greater technical possibilities of the cabinet. Confronting M. Bison in 2007 The merits of SF2 are undoubted, it is the product that has most shaken the video game market and from which countless clones have been taken. Playing it in 2007, however, is not the best thing you can do ... for several reasons: first of all, we are faced with a conversion that, however good, does not equal the bar game. Secondly, proposing the very first version of Street Fighter 2 only makes sense if we limit ourselves to that: the possible (and probable) release of subsequent versions (and there are many) could be taken badly by those who decide to buy it now , for 800 Wii Points. Finally, the speed of the game is not comparable to that of the fighting games we've been used to for years now... and it will take a few games for it not to annoy. This new Virtual Console proposal should be taken into consideration only if you aspire to collect the first SF2, you are nostalgic for Super Nintendo and you have no problems performing crescents with the GameCube joypad or with the Classic Controller (the game only works using these two peripherals, in fact). The collection of classic titles sold through the Wii Shop is growing in size and variety. The latest update also and above all brought the arrival of Street Fighter 2 in the Super Nintendo version, for all those nostalgic for the series and for those who want to deal with the father of all fighting games.", "date": "2007-02-05", "grade": null}