{"name": "S.T.A.L.K.E.R.: Clear Sky - Recensione", "ref": "https://multiplayer.it/recensioni/stalker-clear-sky-recensione.html", "text": "Few but good Those who had the pleasure of getting lost in the vast and open areas of the first game will find this return to the Zone very familiar, both from a ~geographical~ point of view, given that for a good half of the areas are those seen in Shadow of Chenobyl , but above all for the sensations that are immediately felt while playing, or the total immersion in a lively and vibrant context, in which a nature raped by man is the true protagonist of the continuous clashes between the warring factions. Obviously CS is not limited to being a simple data disk, with new missions, new weapons and new monsters, but tries to correct the shot, not only from a purely technical point of view, but above all by reshaping the general balance of some of the mechanics of main game. You immediately notice a change in the economy, in the way we accumulate the money necessary to modify our arsenal and equipment. The artifacts, which in the first incarnation were many and easy to find, are now absolutely rare goods, something unique and rare, the object of desire of the warring factions, given that in addition to the bonuses they give, they are worth a lot in terms of currency ringing. These sinister and alien objects are not found around with the naked eye, since they are invisible, and only through a detector, which effectively inhibits the use of long weapons, will they appear when you are very close to them. Unfortunately, however, they are often found in highly radioactive areas, and thanks to the fact that you have to sift through them practically inch by inch to find them, it is often better to abandon the search rather than slowly die looking for something invisible. But if the artifacts are few, you are simply annihilated by the many missions available. The nine factions in the Zone are in turmoil, any mission we are given, brings another dowry, which will be activated simply by doing a certain action or passing near a certain portion of the map. It's all a succession of missions, with allies asking us to help them, perhaps while we are defending an observation tower and at the same time finally trying to recover that damned armor, the reward of the mission completed an hour earlier. Level 24 assault rifle The Zone is alive, it is tangibly felt that events are not entirely predetermined a priori, but that they can undergo changes in real time depending on our actions. Everything is so ~real~ and ~probable~ that several times you won't even have time to carry out a mission, given that within a few seconds, they are activated and deactivated, thus eliminating the possibility of additional monetary income, which this particularly nefarious given the chronic shortage of funds that afflicts Scar. Even the handheld available has undergone small changes in step with the general expansion of the tasks available, being able to give information on everything that moves in the Zone, friend or foe, alive or dead, main quest or side quest. It is a particularly useful tool, or perhaps too useful, given that thanks to it it is possible to plan one's actions very calmly, carefully choosing the road to take, or the exact moment in which to attack the structures, possibly poorly defended, of an opposing faction. It is therefore clear that Clear Sky is not a simple FPS, consequently if there is a certain complexity and stratification in the way in which the Zone is experienced, it could not be the same for the management of one's inventory and arsenal. The drift in a role-playing field is therefore clear, making it even more explicit than in the first episode. All weapons can be modified, but above all specialized, thus determining one's style of play. Obviously you can carry more weapons, provided you stay within the maximum transportable weight limit. The firefights, already of great depth in the first game, are further improved here, both because the artificial intelligence is very competitive, almost never letting itself be caught in the open, often resorting to concerted winding movements, but also because the choice of a peculiar approach based on one's firearm pushes us not to throw ourselves into the fray recklessly, but carefully examining all the possibilities that the battlefield offers us. However, there are some critical points, with moments of great frustration such as in the case of the first encounter with the army machine gun that blocks the road to Cordon, or the extreme ease with which enemy grenades are delivered halfway to our feet, and some bugs such as enemy bullets that easily pierce walls and trees, frustrating the search for cover, or last but not least the still presentinvisible barriers, which clash with the great sense of freedom offered by the game. Lights in Chernobyl From a technical and technological point of view, Clear Sky takes a decisive step forward compared to the previous game. The vast playing area, which forces us to make long wanderings on foot, which can be avoided in different areas thanks to the ~teleportation~ of some guides, is alive and full of detail, the feeling of immersion is strong, thanks to a certainly excellent level design. with Oscar-winning sets. Dilapidated structures and brackish waters coexist with sudden glimpses of (almost) luxuriant vegetation and rays of the sun that illuminate the leaden Ukrainian sky. The applied textures are well done, never flat and always full of bump mapping in profusion. The human models, whether soldiers or stalkers, are also an example to follow for many similar productions, just note the care with which the clothes and camouflages have been reproduced, something that cannot be said for some of the animals that populate the area, qualitatively normal when compared to all the rest. In general it is possible to say that there has been a good leap forward compared to the past, thanks not only to the previously mentioned work on the textures, but also and above all to the renewed special effects applied, such as the lighting system which recreates a probable day -night, and all those volumetric effects that are the technological flagship of the most advanced productions, also thanks to the finally implemented DirectX 10. However, all this graphic goodness has a price to pay. The system specifications have remained unchanged compared to Shadow of Chernobyl, and this means being quite high, at the expense of a dancer frame rate, which therefore suffers with medium configurations if you want to play with high details. Unfortunately there are also some sporadic instability problems, largely fixed with the newly released patch, but which can be a source of considerable frustration. Comment Stalker: Clear Sky is a worthy sequel to Shadow of Chernobyl. The refinement work carried out by the guys from GSC Games has partially distorted some of the mechanics underlying the previous game, smoothing out some critical issues, but bringing to light others, such as the scarcity of artifacts or the difficulty in following all the side missions. For the rest, this new descent into the underworld of the Zone works perfectly, thanks to the great atmosphere but above all to the excellent balance achieved between pure action and role-playing dynamics. Pros Major graphical improvements Customize your arsenal Large number of missions Cons Too few artifacts Long wanderings on foot Very heavy graphics engine with occasional instability issues PC - System Requirements Recommended Requirements Processor: Intel Core 2 Duo E6400 / AMD 64 X2 4200+ RAM: 1.5 GB RAM Video Card: 256 MB DirectX 9.0c compatible card / NVIDIA GeForce 8800 GT / ATI Radeon HD 2900 XT installation: 10 GB free Test Configuration Processor: Intel Core 2 Duo E6750 2.66 GHz RAM: 2 GB Video Card: Geforce 8800 GT 512MB", "date": "2008-09-12", "grade": null}