{"name": "Championship Manager 2008", "ref": "https://multiplayer.it/recensioni/championship-manager-2008.html", "text": "Managerial is an atypical genre: the player finds himself facing his favorite sport from a different angle than he is used to, with the attention shifted to the coaching commissioner's work in its entirety, rather than only to what happens in field. A pastime for purists, rather than for simple enthusiasts, which over the years has been able to carve out its own slice of the market, starting on PC and then also on the various consoles. What could be the problems related to the translation of such a product on mobile phones? Certainly not a matter of graphics: managers often come with a fairly simple interface, and the visual simulation of the games certainly does not play a central role within the package. More than anything else, the problem is managing the large amount of numbers and data which then also lead to the result of battles in the field: an important factor, which the Eidos developers have somehow been able to ~simplify~ in line with the technical capabilities of the various terminals. With the 2008 edition, Championship Manager only confirms its qualities, making some changes to the structure but without distorting anything previously shown. The game is once again designed for the English market, given the lack of any localization and the possibility of using only the Premier League. However, there are several internationally renowned players, made available to make the market phases more interesting, which are one of the most interesting aspects of the Eidos title: the sale is represented in a realistic and meticulous way, with the possibility of managing offers in various ways to try to strengthen one's team with an eye to the wallet. First of all, however, you have to create your own coach from scratch, choosing his name, the basic characteristics (charisma, technical prowess or managerial ability) and the team he will have to manage. Then you follow the calendar of events, without skipping any stage: you will even have to answer journalists' questions, choosing a cautious and buttoned-up approach or showing yourself as an unscrupulous and braggart coach. It goes without saying that a substantial part of your work concerns team management, from the training of individual players to the layout on the pitch: in this sense, CM2008 does not give us the possibility to create a module from scratch, but it does offer us a large number of pre-packaged options, also with clear references to the history of international football. Once the market, training, strategy and so on have been taken care of, the time will come to take the field and transform our work into a tangible result. The match is represented on the screen in a very simple way, with the delimitation of the field and the players in the form of colored dots that move according to the action, giving us a fairly precise idea of what the balance of the clash is. As mentioned above, sports management games are products characterized by an essential technical realization, and Championship Manager 2008 is no exception: the game doesn't even have a sound compartment, but boasts a good quality graphic interface: always legible, full of information, with a never chaotic arrangement of the elements. There is little to say about the control system: we will control the pointer on the screen thanks to the joystick, while the 5 key will be used to make the various choices. PRO Always full of depth and substance Very accurate strategic and market phases Simple and intuitive interface AGAINST There is only the Premier League Any localization is missing Only for fans of the genre", "date": "2008-09-10", "grade": "S.V."}