{"name": "Final Fantasy IV - Recensione", "ref": "https://multiplayer.it/recensioni/final-fantasy-iv-recensione.html", "text": "If with Final Fantasy III, over twenty years ago, Squaresoft launched the ~modern~ JRPG starting the climb to success that made it the undisputed queen of the genre, it is with Final Fantasy IV that the saga literally takes off, becoming the archetype studied, imitated and idolized for twenty years of a genre that, one can safely say, was born in that 1991, on the SNES. But not only. Final Fantasy IV also becomes famous in America, albeit with the title Final Fantasy II, one of the first JRPGs to be translated into English a few months after the eastern release. And the rest is history. With Final Fantasy IV Squaresoft definitively establishes its line of conduct in the development of Japanese role-playing games, placing an extreme emphasis on the plot and characterization, giving light to a true narrative gem that has remained forever in the hearts of fans, who have happily welcomed the faithful PSOne and Game Boy Advance ports, ten years apart. But Final Fantasy IV is a 1991 game and as such, even in the portings, the ancient gameplay and a certainly not elaborate script were suffered, when compared to the more modern stories, but with incredible narrative potential. After the partial success of the excellent 3D remake of Final Fantasy III, Squaresoft, which in the meantime has become Square Enix, has rolled up its sleeves, heeded the criticism and praise, and gave birth to a new remake, which from the first images it simply created enormous expectations in long-time aficionados and new recruits, who have perhaps approached JRPGs for a short time. Expectations, we confirm, fully repaid. The first real Final Fantasy If we consider the last chapters of Final Fantasy, essentially released on Sony machines, we notice in their scripts complex narrative plots, captivating twists and turns, a more or less acute characterization of the characters involved: Square Enix is generally considered as the most skilled softco in writing of plots for JRPG thanks to Final Fantasy, but few know that the first episode of the series to enjoy a plot worthy of the name was Final Fantasy IV, used a bit like a guinea pig to experiment with this new way of narrating in video games. In this edition for Nintendo DS, the three-dimensional graphics that allow unedited shots, an excellent but occasional English dubbing and an excellent soundtrack - a remix of the original composed by Nobuo Uematsu - enhance a story that already twenty years ago was characterized by its beauty and depth. The protagonist of Final Fantasy IV is Cecil, a Dark Knight at the head of the Red Wings platoon of the Baron empire: at the beginning of the game, Cecil is leading an assault on a defenseless country to recover one of the elemental crystals whose possession gives immense powers . But for some time now Cecil has been doubting the decisions of his King, and this unjustified massacre triggers a process of rebellion and repentance in him. The situation precipitates when Cecil, involuntarily causing another massacre, decides to defect with his friend and Dragoon Kain, in an attempt to protect the next targets of the King and his adviser Golbez: it is the beginning of an exhausting journey in which Cecil he will meet bizarre and heroic adventure companions, including his beloved Rosa, who will then be the damsel in distress of the situation for a good portion of the story, in which Cecil will face one of the most epic videogame moments ever: his conversion into a Paladin . The story of Final Fantasy IV, which truly represents the archetype of the genre and the essence of the saga itself, now enjoys substantial audiovisual improvements, allowed by the new three-dimensional engine, moreover it is almost superfluous to add that the texts have been corrected and adapted to be more faithful to the Japanese version, and this time fortunately translated into Italian. The best portable RPG Final Fantasy IV appears to be very similar to Final Fantasy III, but in reality both playful and technical improvements are numerous. The first thing that catches the eye is the character design, which absolutely faithfully respects the long-limbed and almost ethereal style of the artist Yoshitaka Amano: the effect obtained is simply beautiful. The settings are much more detailed and complex, in general the three-dimensional engine developed by Matrix Software for the prequel has been revised and corrected, redefining the concept of 3D on Nintendo DS: Final Fantasy IV is undoubtedly the best product, graphically speaking, available for the small Nintendo console. Numerous innovations contribute to improving an already excellent gaming experience... The best portable RPG Even random fights (whose frequency has been significantly ridotta) are a feast for the eyes, placing five of our heroes on the field against a variable amount of opposing creatures: the battle takes place on the basis of the classic Active Time Battle System, each character is in fact associated with a filling bar which represents the time interval between one action and the next. The possibilities are numerous, and while in the prequel everything revolved around the Job System and the almost infinite combinations allowed to the player (which indeed decidedly depersonalized the four protagonists), in Final Fantasy IV each hero has peculiar abilities that practically characterize his ~ profession~. For example, Cecil has access to a power-up that allows him to consume his life points to deal more damage, while Kain can use the very famous Jump attack that has characterized Final Fantasy's Dragoons for twenty years. Again, while Rosa is able to perform healing magic as a White Mage, Rydia instead after some events will be able to summon the Eidolons to attack or defend herself. However, there is also the possibility of customizing your own style of play, thanks to the new Augment system: in fact, it is possible to obtain objects with which to teach the characters additional skills. Once an Augment has been applied it is not possible to remove it, but in reality when a character leaves our group permanently (and it will happen often throughout history) we will obtain his peculiar abilities in the form of an Augment, so that our ~surviving~ party will inherit companion powers. The best portable RPG An element that distinguishes Final Fantasy IV is therefore the remarkable but perfectly balanced difficulty of the game, expressed not so much by the power of the enemies or by the temporary weakness of the characters who have just joined the group, but by the actual need to make use of the group's skills in such a way smart and punctual. So forget clashes based on the automatic attack (moreover present by pressing a simple button), in most cases it will be necessary to resort to the spells and abilities of the party, especially in battles with bosses, which require strategy and timing to be defeated. Numerous ideas and innovations contribute to improving an already excellent gaming experience: from the presence of a creature, Hummingway, which represents a sort of very long sidequest whose rewards allow access to numerous accessory features, to the unpublished Whyt, a little creature summonable by Rydia whose face can be drawn by the player and whose abilities can be enhanced through bizarre mini-games. In this regard, it must be said that the use of the touch screen is limited to some mini-games and to the optional possibility of using it to select commands and options during the game, in reality the lower screen is much more used than in Final Fantasy III, also showing the map of the various labyrinths and dungeons, by completing which you will get some reward items. Virtually nothing is left to chance. Exciting: with one word you can define Final Fantasy IV. Replaying it now, twenty years later, with its new graphics and appropriate updates that do not betray the spirit of this traditional JRPG, yet still so fresh and exciting, is an experience that every fan or not should try . The gameplay of Final Fantasy IV is very solid, affected only by the moderate possibility of customization proposed by the Augments, which could make lovers of the abused Job System turn up their noses. The random fights are fun and never too insidious, the audiovisual sector is simply stellar, the story compelling and the characters characterized as few: the praises to be given for Final Fantasy IV are really too many, and the very few defects are completely obscured by the quality of a truly recommended to all lovers of the genre and to those who are approaching it, moreover completely translated into Italian for non-English speakers. Pros Technically impressive, best test of the Nintendo DS Exciting storyline and lovable protagonists Excellent battle system, well-tuned difficulty, perfect longevity Cons Limited game customization Some questionable design choices", "date": "2008-09-05", "grade": null}