{"name": "Lost in Random", "ref": "https://multiplayer.it/recensioni/lost-in-random-recensione.html", "text": "In the world of Alea there is nothing more democratic than chance. Everything was born, lived, and thrived around this concept, even as the era of masterminds met its decline and the populace saw the rise of a cruel queen. Even in that moment, perhaps more than in others, chance was the heart of everything. At least until a little girl, alone against everyone and accompanied by a small animated dice, challenged the omnipotence of the queen to save her sister from a tragic fate. Lost in Random tells the story of Even and Odd, staging a fairy tale that for dark colors and aesthetics could rightfully enter Tim Burton's repertoire. It is accompanied by a rather original gameplay, although repetitive in the long run, but overall satisfying and open to experimentation. The Swedish development studio Zoink Games, already author of the beautiful Fe, has packaged an experience of medium longevity, perfect for what it wants to tell, and has found its rightful place in the EA Originals catalog which this year has already been able to offer us the It's great It Takes Two. A so called little gem that deserves to be played. For the review of Lost in Random we played on PS5 in backwards compatibility. Long live Alea Lost in Random, in Alea nothing is more important than chance The story of Lost in Random starts from a distant past, a glorious past in which the dice masters, together with the faithful dice, participated in epic challenges where the stake was their own life. A thriving era that, like all, sooner or later found its abrupt end, allowing the rise of a cruel queen whose will extends over all six realms. In fact, by royal decree, every child who turns twelve is forced to roll a mysterious black die on which his future will depend: the number that comes out will indicate the realm where he will be forced to spend the rest of his life, possibly separated from his loved ones. , because chance is infallible and in any case no one could oppose it. Except the sisters Even and Odd who on the fateful day, helped by their parents, try to hide: in reality the only one in danger is Odd, having turned twelve, but despite the attempts to escape the Queen's right-hand man, the equally fearsome Nanny Fortuna, Odd is captured and her fate decided. He will have to go to Sestin'Incanto, theoretically the place where everyone would like to live, the fairy utopia of the entire Alea. Although no one can prevent the two sisters from being separated, Even has never stopped thinking about Odd until, a year later, a specter will guide her in the first steps of an unforgettable journey undertaken to save her. Along the way he will meet Dicey, a small animated dice who will become his inseparable companion, and together they will cross all the realms to arrive in the presence of the queen and put an end to her unchallenged dominion. Lost in Random is a very dark fairy tale, which closely resembles the works of Tim Burton and in particular The Nightmare Before Christmas, which it also approaches due to its peculiar aesthetics. Even and Dicey's journey is full of charm and mystery, characterized by bizarre and precisely for this reason memorable characters, dangers of all sorts and moments of genuine emotion. The pace continues without particular slowdowns, even when you are dedicated to completing the maps by finding all the secrets and accepting the side missions. Only the fights, moreover one of the most original aspects of the game, in the long run suffer from a certain repetitiveness and redundancy, but the curiosity to know how the events will end always manages to relegate everything to a corner of the mind. We realize this, and especially in the very last bars we felt a little tired, however the case around which the entire combat system revolves manages to keep them unpredictable. The power of chance Lost in Random, Dicey is essential in combat Lost in Random is a game that, very simply, is divided between exploration and combat: each realm is a whole new microworld to be explored, both to collect coins and collectibles and to offer our help to any citizens in difficulty. Everyone, from Primagoria to Sest'Incanto, makes their name their main feature: in Borgodouble, for example, the inhabitants have a double personality which depends, as always, on the queen's die rolls. In Triscordia, similarly, the constant war between three brothers is waged one move at a time based on the roll of the fearsome black die. All, however, are somehow slaves of the queen and Even, in his journey, will also worry about restoring a minimum of peace in once prosperous realms. When we are not busy exploring to raise money, it helpsre the needy and find the pages of a book that, in its entirety, will delve a little into the plot, we will fight against the queen's armies who are trying in every way to stop our advance. A little girl has no chance against armored soldiers and in fact Even alone, armed with a simple slingshot, she can do almost nothing. For this at his side we find Dicey, an animated dice dating back to ancient times whose powers allow you to use magic cards that will form the strength of Even. The combat system revolves around a mutual collaboration between the two, but is based above all on chance: from the enemies we can collect the crystals necessary to charge the energy of the dice and, when even just one card of our deck is ready , throw it to start the actual fight. Lost in Random, Even and Dicey will not have to contend only with the soldiers of the queen Based on the result obtained, the cards in the deck and the draw of each hand we will have to adapt our strategy to get the most out of the points available. There can even be an unlucky hand paired with a too low roll, leaving us with no choice but to resume collecting crystals and give it a second try. Thanks to this stratagem, the clashes in Lost in Random are never predictable since they totally depend on our luck (and on a certain skill in composing the deck, yes) but, despite their unpredictability, in the long run they give way to a certain redundancy - mainly due to the fact that the amount of cards available is never really necessary. The deck can have a maximum of fifteen cards and, provided they are available, the same card can be inserted several times. They can be earned by completing some challenges in the field but above all they can be purchased in the related shop in exchange for coins. Our trusty retailer starts from a fixed base, which increases thanks to unpacking: no, we're not talking about monetization systems that have been sneakily inserted into the game. Simply, by spending a certain amount of money, we will fill an indicator which, once complete, will give us the possibility of unpacking one of the groups of cards available, divided by type: their content, of course, is random but it is up to us to decide whether we prefer, for example, danger cards to put enemies in difficulty with traps of any kind, or weapon cards to go with pure and simple brute force. From time to time, the seller offers three of the five types available, for a total of thirty-four cards to collect (doublings excluded): a fair number above all because, as already mentioned, despite the variety of combinations offered, it is difficult to try something else once you've found your own composition - which in our case focused on raw damage with bows, swords, hammers and spears, flanked by some damage and trick cards. Lost in Random, Eve and Dicey arrive in Borgodouble The resulting experience is overall satisfactory, even if not particularly demanding: it's all about having at least one card available with which you can cause damage to enemies, the rest is built with time and the luck of buying the right ones from the dealer . As we have written, chance rules everything in Alea and we can only go along with it. Most of the fights are in favor of the plot, some of these especially towards the end can get tight, but there is also some extra occasion to fight because we are exploring, or to save someone in trouble. The types of enemies are not very varied and then evolve into an enhanced version of them, while there are a couple of particular boss fights (one specifically that is not just about combat, let's put it this way). The lack of variety, however, is perceived above all in NPCs, which tend to repeat themselves so often, although at some point you start to forget about it. Unlike the fact that Even, despite having his own voice in the game, when he has to talk to other characters in a series of multiple choice dialogues does not open his mouth. A pity, because Lost in Random is also characterized by the irony and cheek of its young protagonist, who would have been nice to hear every aspect verbalized. To vary the flow of exploration and combat a bit there are the occasional board games , each different from the other but still linked to chance and the roll of the dice. In these cases, the result will not only affect our chances in combat (because yes, we fight even in these cases) but also how many squares the pawn will move that we will have to manage for that session. Each board game has special boxes, coming upwhich we will activate the relative effect which can be positive or negative. They are a welcome and all in all expected change in a game that makes the use of a die its primary nucleus.", "date": "2021-09-10", "grade": "7.8"}