{"name": "Scuola d'Equitazione", "ref": "https://multiplayer.it/recensioni/scuola-dequitazione.html", "text": "If the ~casual~ genre has an advantage, it is certainly that of having brought people closer to the world of video games who otherwise would never have turned on a console in their life. Leading this small revolution was the Nintendo DS, which thanks to products such as the various brain trainers, Cooking Mama etc. it has effectively created an enlargement of the market, favoring the entry of completely new and atypical users. Girls, needless to go around it, are often part of the ~casual gamer~ category and it doesn't often happen that they appreciate the titles that are most popular among boys too much. So it is above all to meet their needs that various series dedicated to animals have been created, and Scuola d'Equitazione is just one example of such products, created in this case for the mobile market. Gameloft, a company that has always been prolific and attentive, does not miss the opportunity to experiment with new solutions, in short, probing the ground to realize how many girls who own a mobile phone are also interested in video games. The game has only one mode, a sort of ~story mode~ in which we play the role of a girl (naturally...) who is admitted to a famous academy where horse riding courses are held. After choosing the appearance and name of our character, as well as the type of horse we prefer, we will therefore find ourselves wandering around the school looking for other people to interact with, waiting for the indications of our teachers. We will learn to control our horse, to make it run and jump, with the difficulty of the maneuvers increasing as we progress through the stages. The control system, during gallops, is very simple: using the joystick you can change the direction in which the horse moves, among eight variations, while the 5 key is used to make jumps when necessary. In any case, the game isn't limited to saddle rides, but puts us in front of numerous minigames that have to do with the care of our favorite animal: we'll have to brush it, clean its hooves, feed it and so on. Each of these applications has different rules and a different control system, but in general they are all quite simple and without any depth. The mix of horse rides and minigames leads us to grow our character, until it will be possible to participate in a series of prize competitions to impose our style on other schools. The technical realization of the game is discreet: there are the usual images of photographic origin to represent the characters, the use of colors is generally good and the locations never appear bare or repetitive. From this point of view, Scuola d'Equitazione is certainly part of the new generation of mobile games... pity about the sprites, which leave something to be desired: they are all too small, and don't shine either for their design or, above all, for the animations. The situation improves a lot on the occasion of the minigames, which take place in restricted settings but which boast nice and well-designed graphics. The sound, as often happens, is unfortunately mediocre and essential. PRO Good number of minigames Technically discreet Simple control system AGAINST Linear and repetitive Action too slow and without bite Mediocre sound", "date": "2008-09-04", "grade": "S.V."}