{"name": "Braveheart", "ref": "https://multiplayer.it/recensioni/braveheart.html", "text": "This Braveheart mobile tie-in belongs to the real-time strategy category, a genre that has so far enjoyed decidedly mixed fortunes on this format. Generally speaking, with products of this type, the risk is of coming up with a structure that is too heavy for the reference user, or - conversely - of arriving at an excessive trivialization with the risk of discontenting everyone. In this sense, Artificial Life has found a solution that we feel like promoting, trying to automate as many processes as possible while leaving the reins of command to the player. As it is easy to imagine, in Braveheart it is necessary to take on the role of William Wallace and lead your allies in a fight against the English in order to retake Scotland. The game - fortunately - dedicates the bare minimum to the plot, focusing on strategic action: the various missions that will be faced during the adventure will mainly focus on two objectives, namely defending a position or attacking an enemy outpost. In addition to having to manage the forces on the field, the user must pay particular attention to the figure of William, as his death involves an immediate game over. On the main issues, Braveheart follows the manual of the perfect RTS to the letter: the troops move around the map following the boxes of a grid, and the various units have characteristics that influence their capabilities on the battlefield (for example, the infantry is effective against knights but weak against archers). However, the structure is quite simplified, with the player basically only having to try to move the right warriors into the most correct position, as if it were a game of chess. However, there is no shortage of variations on the theme: in fact, victories allow you to accumulate gold that can be spent on upgrades or new units, while the various scenarios offer some bonuses capable of regenerating the health of your troops, reversing the fate of the clashes. Functional in terms of gameplay, Braveheart is also functional in terms of graphics, not at all spectacular but clear and intuitive, two very important virtues for a game of this kind. PRO Compelling gameplay Clean and functional interface AGAINST Not particularly complex Boring in the long run", "date": "2008-09-02", "grade": "S.V."}