{"name": "Castle Crashers - Recensione", "ref": "https://multiplayer.it/recensioni/castle-crashers-recensione.html", "text": "Given its RPG-fighting nature, the player can count on numerous power-ups: these are small animals that are found around the levels and which, once hooked, follow us everywhere, providing us with a valuable contribution and improving some characteristics. Chicken, for example, increases defense and agility; the piglet gives more health points while we eat; the frog can catch the various objects scattered on the battlefield with its tongue, while the seahorse gives more agility in the water. These are just a few examples, because the pets that help us in the Castle Crashers adventure are actually very, very numerous. The game is always balanced and never frustrating, and replaying it is well suited to the level reached by our knight. The design of the game is superb, full of details, refined in the animations, with attention to the color combinations. The world of Castle Crashers is goofy, quirky, fun, and worth experiencing with three other friends Everything, or almost everything, is interactive and can be touched, taken or destroyed. The character design is sober, with few but incisive and well-characteristic features. Sometimes it almost makes you think of an anime by master Miyazaki, and perhaps some enemies remember some of his best films. The world of Castle Crashers is silly, bizarre, entertaining, and worth experiencing with three other friends, an option that is contemplated thanks to the support of Xbox Live. The game suffers from a certain lag (which should disappear with an upcoming patch, to tell the truth), which sometimes makes it difficult to control in the most furious melees, but the fun in playing (and above all in watching) is still infinitely more great in company. Longevity is guaranteed not only by its RPG nature, which leads us to collect weapons and equipment, constantly improving ourselves, but also by the amount of characters to unlock and the mini-games available, such as versus sessions (yes, just like Guardian Heroes ). Castle Crashers is one of the most complete, well-crafted and entertaining games not only available on the Live Arcade, but in the entire Xbox 360 playground. Comment Spending 1200 microsoft points has never been so pleasant. Castle Crashers represents, while falling within all the canons of the genre, a breath of fresh air in the panorama of scrolling fighting games. He doesn't actually invent anything, but takes the best of all the masterpieces of the past, without copying but constantly paying homage and winking at longtime players. Castle Crashers is made with an original style and is perhaps one of the best 2D ever seen on consoles, with animations, colors and a definition that manage to redefine the genre, giving it new life and finally recovered dignity. To be downloaded absolutely, in the hope that the patch to solve the lag problems in multiplayer will come out soon. Pros Wonderful two-dimensional style A challenge that guarantees longevity Frenzied multiplayer Cons Some uncertainty due to lag Some could, wrongly, object to the price Goals The 200 points of Castle Crashers are decidedly difficult to complete in their entirety. After the first two or three relatively simple and unlocked almost immediately, there will be a bit of sweat, especially as regards those related to particular actions to be performed, impossible to know in advance without first checking the objective list. Playing in multiplayer, however, many are unlocked with relative ease and in a short time.", "date": "2008-09-03", "grade": null}