{"name": "Fifa 2005 su PC", "ref": "https://multiplayer.it/recensioni/fifa-2005-su-pc.html", "text": "Career mode Your career will not be just a simple season, but your sporting life. Obviously the role played is not that of a simple team coach, but you can step into the role of the general manager himself, and you will have fifteen seasons to prove your skill. This year this mode is even better. Starting from a small team, it will be necessary to demonstrate that you know how to use the best strategies to bring it to success. Only in this way will you be contacted by top teams, in order to finally be able to guide your favorite players (as well as all the medical staff and collaborators). This mode includes many features of managerial games: it is possible to buy players, assign resources to the staff and it will be necessary to know how to manage the morale and form of the players. This year the simulation of a match was introduced: you can therefore choose not to play the match directly and ~watch~ it from the bench, just like real coaches. However, it is possible to intervene personally during any minute of the match, thus interrupting the coaching role to dress that of players. The only weak point of this mode is the lack of a function that allows you to search for players, thus making it difficult to find a particularly suitable player for your team. We hope this is the starting point for a future improvement Gameplay The playability of Fifa 2005 is further improved compared to the previous version of this game. Watching the matches as simple spectators you may not notice the improvements made, but when you take the field you will really notice it! This year, EA SPORTS has also introduced a new type of control: the ~First Touch~. In summary, it is the way in which the ball is controlled, blocked and passed. For example, by passing the ball to your teammate, when the latter receives the ball, pressing the arrow key you can try to pass the marker and find new spaces to play the ball. The ~Off the ball~ control has also been improved: by taking control of the players without the ball, it is possible to set tackles, unmark and order teammates to advance on the field. With the control of the movements of the players who receive the ball from throw-ins and corner kicks, you will have total control of the team. Unfortunately the rule is confirmed that where there are improvements there are also worsenings: once again this year the player's effort is quite useless. In fact, a player, after making his sprint, will never be at the end of his strength and, if he doesn't have to run for a few seconds, the bar indicating fatigue will begin to return to the maximum levels. Conclusions: few (or practically useless) player changes on the pitch. Artificial intelligence The computer's prowess at dealing with humans is the part that dims nearly all of the improvements made to gameplay. The tactical movements of the team are not spontaneous enough, and this difference is especially noticeable when playing against the CPU. In fact, unlike the reality in which not only the attackers score but also the midfielders (and sometimes, but rarely, the defenders), in FIFA 2005 it seems that only the former are responsible for scoring. The only way to score players who are not attackers seems to be to exploit a bug in the game: in fact, by positioning yourself a short distance from midfield and shooting on goal, the ball enters in 90% of cases. We understand that nobody likes goalkeepers, but... In conclusion, the general gameplay of Fifa 2005 is improved compared to the previous one thanks also to the ~First Touch~ and ~Off the ball~ controls. However, it is on the right track to reach the levels of PES3 in this respect, even if there are still many things to do Multiplayer and Football Fusion To play between different players located in two places even very distant from each other, EA has confirmed the possibility of playing online. This can be done in 2 ways: via Direct IP, i.e. one player hosts and the other invites him to participate in the match by entering his IP on the game screen, or by registering online on the EA SPORTS website, it will be possible to meet other players and play using a program supplied with the Fifa 2005 CD. Football Fusion, on the other hand, is a feature that Fifa 2005 and Total Club Manager 2005 have in common: it allows you to transfer the data and the teams created with TCM 2005 to Fifa 2005 and use them to play any game mode (friendlies, career and online matches). Let's improve the game together Like everyone else, the Fifa Web is ready to churn out daily updates for Fifa 2005: kits updatedate, addition of all the missing series A stadiums (and not only), corrections of possible game bugs, modification of graphic details (balls, flags, nets, billboards, turf, player faces, and, ~who more has, you name it), improved artificial intelligence, transfer updates are just some of the infinite possibilities that you have within 365 days to make the game even more real than it actually is. Comment All fans of Fifa 2005 this year can really be happy because the game has undergone an improvement compared to last year's version. The improvements made to the gameplay and career mode mean that the purchase is not disappointing. The gameplay has been tweaked enough to be worthy of the graphics, sounds and, as always, the licenses. This may not fully convince PES players, but this year Fifa is recommended to everyone as it perfectly follows the real game of football. Pros: Great graphics Improved gameplay Career mode improved Cons: Gameplay still can't compete with PES Commentators sometimes get it wrong when commenting Lacks a player search function in career mode Recommended downloads Patch unlock all (patch that unlocks all stadiums, teams, blocked competitions): linkLogos patch: Since not all teams (some Italian) do not have a license, this fixes the wrong logos: linkSound patch: Modify the sound effects of the game, making it even more realistic: link After approximately 12 minutes of installation of the 2 game CDs and having waited a minute spent viewing the logos of the Leagues from all over Europe, it is finally possible to play Fifa 2005. The graphics of the Fifa series have always been considered one of the best in terms of it's about sports games. Again this year, of course, there are no exceptions. Everything flows smoothly The details are really excellent in all fields: the stadiums have been highly cared for and are even more noticeable when trying to play with different weather and storm conditions. As always, the graphics of the stadium are of secondary importance for those who play, given that the main shot will be the field, except for goal kicks or throw-ins. The audience has also improved quite a bit; not that it's much use, but it's always nice to see Also, this year too EA Sports has obtained almost all of the team licenses and this has allowed it to faithfully reproduce home, away, training kits, third shirts and goalkeeper shirts. As if that weren't enough, many players were played using photographic textures. This feature makes them practically identical to the real ones (try to compare Shevchenko or Beckham and you'll notice how much they reflect the ~real~ footballers!). Like the graphics, the sound also met high standards. The audio atmosphere is really excellent, especially in the larger stadiums. You can hear the fans cheering and clapping, booing and singing. Playing at home against Milan, for example, when you score a goal you can hear a real roar, while if the away team scores, only a few whistles (from the local fans) and applause (from the ~away~ fans). The other sound effects are also great: you can hear the ball being kicked by the players, the ball hitting the net and so on. It's really impressive that you can hear the players and coaches shouting in their own language. Match commentary, on the other hand, hasn't improved much since last season. It's a little smoother, but nothing more.", "date": "2004-11-26", "grade": null}