{"name": "The Artful Escape", "ref": "https://multiplayer.it/recensioni/the-artful-escape-recensione-avventura-musicale-platform.html", "text": "The Artful Escape certainly had an anomalous genesis, even taking into account its nature as an independent title developed by a small team, Beethoven & Dinosaurs. Just a few days ago we had the splendid opportunity to talk to the founder of the software house, as well as the creative mind behind this project, Johnny Galvatron and, thanks to his words, we discovered some background on the troubled and peculiar realization of this title, as well as on some specific aspects of its gameplay. And there were also a handful of very interesting considerations on today's market of independent developers and on the Game Pass given that The Artful Escape will be launched digitally on Microsoft's subscription service on September 9 in both PC and Xbox One and Xbox Series X|S versions. It will also be possible to buy it in a more traditional way by spending 19.99. Today we are finally ready to tell you our opinion on the title but, before going into the review of The Artful Escape, we feel obliged to reveal to you already in these first few lines that we have struggled quite a bit to issue a credible and coherent judgment on this title because, as sometimes happens with the most daring indie projects, with this game it is really simplistic to focus on the playful aspects. If for you a video game must first challenge the player and require some form of skill according to the progression of the difficulty, do not proceed further because this is not the right title for you. A classic teenage story Francis Vendetti, the protagonist of The Artful Escape The Artful Escape talks about a teenager, Francis Vendetti, and his long spiritual, mental and physical journey to become aware of himself, his passions, his desires and to decide once and for all what he wants to do when he grows up. The story of this game is one of the most classic, probably also the most abused, in literature and cinema and sees us take on the role of a boy grappling with the greatest dilemma of life: to build his own path, his own personal path of life with all the risks involved or live according to the will of his family, social impositions and a comfortable and peaceful inheritance. Francis is in fact a young folk singer who struggles to find a space in Calypso, a small provincial town, due to his connection to his uncle Johnson Vendetti, a very famous singer-songwriter who died at the peak of his musical career after revolutionizing the folk genre with a handful of particularly famous ballads and an album of incredible international success. However, his maturation process will not be a simple awareness of his own potential, perhaps in line with what we all experienced during our adolescence, but will be closely linked to his musical evolution, to his realization of what folk sounds they are close to him and castrate his real creative flair. And to achieve this awareness Francis will embark on a metaphorical journey aboard an absurd musical spaceship, crossing a universe of psychedelic lights, some worlds with bright colors and meeting a vast collection of absurd characters. In this sort of road video game under acids, Francis will transform: he will change his name, he will find a new place of birth and will finally and freely choose his clothes and his guitar, satisfying his desires and giving space to free will. Whether his journey will be real or purely mental, we leave the burden and the honor to find out and understand it to you. On the other hand to understand and appreciate The Artful Escape, this element is not even that important. Is there any gameplay in The Artful Escape? Playing the guitar, the scenarios of The Artful Escape come alive And we come to the crux of all the difficulty encountered in reviewing The Artful Escape. Beethoven & Dinosaurs' debut project is basically a musical adventure with some minimal platforming elements. With the exception of Calypso, the hometown of the Vendettas where the first minutes of the game take place and of Cosmo Lung, the spaceship that will travel Francis across the universe, the structure of the game provides for a series of horizontally scrolling levels where we will have to limit ourselves to move the guitarist to the right while admiring the splendid settings and what is happening around us. Sometimes there are small ravines and crevasses that we will have to overcome by jumping or by double jumping or, again, by exploiting a sort of controlled planing that Francis will be able to perform by playing the guitar while in flight. However, we are talking about a very basic degree of challenge, without enemies and with a sort of instant respawn just before the startreceptacle in the very rare cases in which we happen to fall below because perhaps we have not noticed a rapid descent. The only two variations to this gameplay are represented by the dialogues that we will be able to carry out during our journey by interacting with the numerous characters that we will meet on our path - multiple choice dialogues that do not however have relevant consequences on the progress of the story - and a handful of musical battles with the bosses. The latter are purely mnemonic and involve pressing 5 keys on the joypad with the right sequence, in the classic Simon style. Also in this case we are talking about a practically non-existent degree of challenge where the developer's goal is clearly to vary the pace of the narrative and certainly not create obstacles to the continuation of the game. Wanting to be particularly bad, one could consider The Artful Escape a walking simulator in all respects: there is no challenge, the gameplay mechanics are practically non-existent and the only thing that is required of the player is to get in tune with the rhythm, the artistic component and the peculiar style of this experience video game. An experience that, among other things, took us about 3 hours to complete in the 28 short chapters that compose it. There is no type of replayability except to unlock any objectives not collected in the first run. Incredible art direction A musical boss battle in The Artful Escape We can already imagine your question at this point in the review: so what's so beautiful about The Artful Escape? The answer is trivial however simple: as often happens with indie titles, it is its artistic direction that makes this title shine. Beethoven & Dinosaur's work is splendid to see with its colours, the wonderful characters often characterized even only through glasses, the incredible psychedelic scenarios that come to life following the rhythm of the notes of our guitar. It's a game that has its own distinctive trait and its own precise identity: just look at an image and you'll immediately recognize it among a thousand other titles. And then there's the audio sector which, alone, deserves the entire trip. As we have already told you in our interview with the creator of The Artful Escape, Johnny Galvatron, the title has a very particular management of the soundtrack: each level has its own background music track and we will be completely free to play the guitar at any time by Francis by simply holding down a button. At that point the guitarist will perform a virtually infinite solo that will enter in perfect harmony with the soundscape of the scenario. Playing The Artful Escape with headphones, with the volume high, is a really good experience and very soon you will find yourself going through all the its levels with your finger constantly on the X button to make you enraptured by the musical virtuosity of Francis and observe the scenario come to life as you pass. And this will be enough to make you enjoy it. The audio dubbing of the game is also absolutely excellent: all the humanoid characters are played by actors who are extremely in the part, with even a handful of names borrowed from cinema, and we found the idea of making ~speak ~ some aliens through musical notes themed with their own art style. The voiceover of The Artful Escape is in English but the title is totally translated into Italian in the texts, with great competence among other things.", "date": "2021-09-08", "grade": "8.0"}