{"name": "Dice Legacy", "ref": "https://multiplayer.it/recensioni/dice-legacy-recensione.html", "text": "Sometimes games live on a single idea which, if well developed, gives them a distinct and easily recognizable identity, which automatically makes them interesting, regardless of the genre they belong to or any other possible preliminary consideration. Of course, intuition alone is not enough and we need to build something solid around it, which magnifies it and makes it concrete in a wider context, elevating it beyond a good intention or a stroke of luck. As we will see in the course of the Dice Legacy review, this strategy allows itself to be both original and traditional, managing to convince with its formula with improbable assumptions, as well as strangely intriguing. Gameplay The dice are also the units Basically, DESTINYbit is a city builder in which you have to colonize the territories of an unexplored continent. The first peculiarity that immediately catches the eye starting the game is that the scenario has the shape of a ring, in which we have to go around the inside collecting resources and building buildings. Be that as it may, apart from the eccentricity, so far there is actually nothing that separates Dice Legacy from other city builders: the map is divided into hexagons on which the buildings must be built and, around the town hall, our center of power , there are resources that must be collected and exploited. The beauty comes when you see how all possible actions are to be performed. At the start of the game we are assigned a set of dice, each of which is an active unit. The color of the die and a number in the corner of its sides represent its social class and strength respectively (each side of a die can have its own strength value, but not a different social class). At the beginning we are given only yellow dice, i.e. ~villagers~, but soon we can build infrastructures that allow us to evolve them into citizens, soldiers, priests and merchants. Each die also has a residual roll to consume, which symbolizes its state of health. Once the rolls have run out, death is inevitable. Note that if you die, the entire community will suffer a drop in happiness. Making happiness fall too much means having to deal with riots aimed at taking over our head and other internal problems, linked to the social class of the missing die. If desired, it is possible to recharge the health of the dice by making them eat, or it is possible to cure them in case of illness or frostbite, using the appropriate structures. The main thing is not to lose them. Soon it also becomes possible to increase the set of dice available, up to the maximum amount established by the scenario, by pairing them inside a house. The dice The game world is shaped like a ring How do dice work? Each class can perform certain actions, represented by the different sides of the die. For example, villagers can fight (sword icon), build (hammer icon), gather resources (axe icon), explore (compass icon), and more. The military can fight against attackers or raid some neutral squares (such as those of merchants), or can be used to attack enemy bases, when discovered. In short, each class of die has one or more functions, which can be useful during the campaign. The limit, in addition to the aforementioned health, is represented by the fact that each die can perform one action at a time: the one shown on its face after a roll. So, for example, if a villager die shows a sword icon, it can only be used to fight or to perform generic actions (such as eating, healing and others). A fight If you need to make it do something else, you'll have to roll it again, causing it to lose a life point. Or you can block the face, waiting for it to finally become useful for something. A large part of the gameplay of Dice Legacy is focused precisely on the management of the dice: the player is required to balance the actions, making the most of them, but without forgetting to help them in case of need. With the passing of the seasons (the game is in real time), it will also be necessary to learn to balance the various social classes, all of them useful in their own way, but also very quarrelsome and immediately ready to bite each other. So here you can organize parties or create special buildings to spread some healthy happiness. Goals The passing of the seasons is also shown graphically One of the worst scenarios with which you can find yourself fighting in Dice Legacy is not having enough dice of the class we need to progress. The game assigns objectives to the player from time to time, which must be achieved in the shortest possible time. These range from build certain andbuildings, to discovering the origins of an aggression, up to the complete destruction of an enemy. Sometimes it's tempting to specialize dice on a need-to-know basis, but doing so risks losing sight of the big picture. For example, you cannot run out of harvester villagers, otherwise it becomes impossible to accumulate the resources needed to operate the buildings, have food and unlock new resources. In the same way, sooner or later it will be necessary to equip yourself with citizen dice, if you want to give impetus to scientific research, which unlocks new buildings and significantly improves our society. In short, there are so many things to look after in Dice Legacy, often even unexpected ones. For example, in winter you have to be very careful where you send the nuts, which risk freezing if not supported by wood-burning stoves. More generally, you need to avoid getting caught up in the wild roll, otherwise many dice will die, and learn to make the most of the available faces. Conclusions Some actions require the use of many dice What's amazing about Dice Legacy is that it works. Beyond its nature as a city builder, the element of luck introduced by the roll of the dice creates a different level of challenge, in which managing above all means not wasting rolls and trying to assign each dice something to do. If we combine the whims of chance with random maps and variable seasons game by game, we have a title with great variety, which offers different game situations with each restart. Of course, on certain occasions the possibility of having direct control of the dice is lacking, but you soon get used to the uniqueness of the gameplay and it doesn't take long to enter the perspective of not being faced with a classic city builder. We must also spend a few words on the technical side: Dice Legacy is not graphically excellent, but it still has some very interesting features, such as animations for each building or the changing environment with the passing of the seasons. It is not miraculous but given the genre you can also be satisfied. The same goes for the soundtrack, which turns out to be a good accompaniment and nothing more. The substance is that we are dealing with an excellent work, which masks its limits well thanks to its originality.", "date": "2021-09-08", "grade": "8.5"}