{"name": "Evolution GT - Recensione", "ref": "https://multiplayer.it/recensioni/evolution-gt-recensione_a.html", "text": "The large lineup of Nintendo DS, formed over many years since the console's release, includes practically every type of racing game: from arcades such as Need For Speed and Burnout to the various Mario Kart and Crash Bandicoot, passing through the recent Ferrari Challenge. However, a hole left empty is that of the Gran Turismo simulations, games usually accompanied by official licenses and real circuits. So here comes a relatively new title for the small miracle laptop: Evolution GT is what was missing to complete the racing genre in all its nuances. The game is published by the Italian company Black Bean and developed by the newborn software house Island Racing Studios, satellite of Firebrand Games, a company that includes only racing titles in its curriculum: Race Driver, Trackmania, Cartoon Network Racing and the new GRID. Too kind adversaries Evolution GT is made up of five main modes including the classic ~Career~, the fulcrum and heart of the game. For those who have little time to spend, the classic ~time attack~ and ~fast race~ appear in the menu: in the first mode it is possible to choose the car, modify some parameters and try to beat the record times, while in the second mode we are thrown on the circuit without a fuss and you immediately start running. The fourth mode is the championship, which sees us as protagonists in a series of races hosted on all the tracks in the game. Tuscan hills, Berlin, Milan, Barcelona, London, Corsica, the French Riviera and Scotland: the game settings are well diversified and numerous. Finally, for those looking for a real challenge, they can choose to challenge a few friends thanks to the wireless functionality of the Nintendo DS. this genre of games gives its best in multiplayer: the challenge is the primary factor Too kind adversaries You can play with a single cartridge, but having only the Corvette as a car available to a limited number of tracks, or in multi-cartridge mode, in which we are free to choose any option. It goes without saying that this genre of games gives its best in multiplayer: the challenge is the primary factor of car racing. Evolution GT has the official licenses of numerous cars, among which the Corvette Z06, Mercedes SLK, TVR 350 and Audi A4 Touring Car stand out. Initially only the novice mode will be accessible, to let us practice the driving system and the tracks, but continuing in the game all the difficulty levels, amateur, pro and veteran will be unlocked. The opponents' artificial intelligence isn't very brilliant, and they just run in single file, sometimes hinting at timid overtaking: by selecting the maximum difficulty, the effect obtained is to increase their average speed. The other cars don't seem to react to our presence: rams and car doors don't have any negative effect on our competitors, who continue to go straight on their way without getting upset. The dreaded pinball effect There are five types of cars, for as many different championships: three doors, roadsters, coups, grand tourers and racing cars. Unfortunately, apart from the different characterization and some changed sound effects, the driving model remains almost the same, not even changing by selecting extremely different types of cars. Evolution GT is a single central track in which the car turns left and right, while the whole background rotates accordingly, a decidedly atypical choice nowadays, in which we are by now accustomed to a certain freedom of movement inside the screen. But the good old Sega Rally for Sega Saturn had already managed to free itself from the grip of the ~binary~, more than ten years ago, consequently the choice cannot be attributed to limited hardware such as that of the Nintendo DS, whose potential should be equal to those of an N64. Evolution GT is a single central track in which the car turns left and right The dreaded pinball effect The physics simulation is bad, especially for a title that assumes to be realistic. The vehicles skid against guard rails and walls as if they were balls in a pinball machine, without reactions, without getting too upset, so much so that often you can go straight without much thought even in the vicinity of some wide curves, so nothing happens. We can also take advantage of the opponents to cut the curves inside, using them to our advantage with a well-placed door that does not make us go out of the way. Nostalgia effect: go back to 32-bit While giving the player a great sense of speed on screen, the overall look of Evolution GT is extremely poor. The modelingne polygonal is not very complex, and the graphic detail has been sacrificed to obtain greater fluidity. Having both would have been ideal, of course, and we're sure the diminutive Nintendo DS hardware could have gotten away with it. The size of the pixels of the border elements is disarming: huge blocks and squares that were rarely admired even in the 32-bit era. Despite the lowering of detail, the game still suffers from a flashy pop-up on the horizon, and the creation of some 3D elements under our eyes. The main car, the one we use, is well designed and with a sufficient number of polygons. The real problem is the other machines, made up of a small number of triangles, moreover with such flat and monochromatic textures. Details often get lost, coming together when we're right behind them to a most unpleasant effect. The tracks, very varied and heterogeneous, despite being designed with very few details and polygons are still well characterized, thanks to a good choice to diversify the settings a lot. The work done in the track design is also good, as no two tracks are too similar to each other and the tracks have been designed to take advantage of the different speeds of each type of car. The audio sector is made up of well-composed and fairly well-made rock-metal music, but all too repetitive in the long run. The sound effects, on the other hand, are repetitive right from the start, thanks to a poor differentiation between the noises produced by different cars and a few ambient sounds. Finally, we point out the compatibility with the Nintendo DS rumble pack: the few owners of this periphery will therefore be able to enjoy more realistic shocks, vibrations and bumps. Comment Evolution GT is a game genre that was missing from the incredible lineup of Nintendo DS, a simulation game with official licenses which, however, has very little simulation in the end. The idea behind it was good, but the implementation leaves something to be desired. What disappoints is the poor technical sector, with graphic problems that have not been seen since the 32bit era, a now archaic driving model, artificial intelligence reduced to the bone and very bad game physics. Extreme customization is missing, as one would have expected from such a title, and indeed, the cars behave on the track in a very similar way. Good track design and sensation of speed, obtained however by sacrificing too much from the game's 3D engine. Pros Good sensation of speed Track design Tracks and official cars Cons Graphic section Physics of the cars Artificial intelligence of the opponents", "date": "2008-08-05", "grade": null}