{"name": "Agente Smart: Casino Totale", "ref": "https://multiplayer.it/recensioni/agente-smart-casino-totale.html", "text": "As in the film, also in this mobile game the main protagonist is Max, a particularly clumsy special agent who is assigned the thankless task of putting an end to the misdeeds of the criminal organization KAOS. But if in the film this incipit then develops into an action comedy full of gags, in this tie-in the tones remain decidedly lower. Agent Smart: Casino Totale therefore turns into a mobile game with sleepy rhythms, punctuated by uninspired levels and fundamentally penalized by a gameplay that simply fails to entertain. The basic structure of each stage is the same, and sees the user committed to reaching the end of the scheme by destroying enemies (possibly stealthily) and solving elementary puzzles, which almost always require the use of a particular object or the entering a code retrieved a few moments earlier. Not that the action phase is particularly exciting, of course: Max's movements are incredibly slow, and the enemies represent a threat in a manner of speaking, given their very limited AI and consequently the ease with which it is possible to take them out. Agent Smart: Casino Totale is therefore reduced to a weary wandering from one point to another on the map, according to a scheme that is already boring in the very first levels of the game. And the situation is certainly not relieved by the peculiar system of ~insulting combat~ which from time to time is forcibly served up to the player: these are verbal clashes with some enemies, in which it is necessary to respond in kind to the offenses received, but which in concrete forces the user to make an almost random choice within a menu of predefined phrases. In short, Smart Agent: Total Casino is boring when not downright irritating, both for the reasons listed so far, and for the frequent and insipid cutscenes which it is necessary to attend. From a technical point of view, things improve slightly, but still remaining on the threshold just above mediocrity. The animations are fluid and convincing, but everything else is quite anonymous: the levels develop on trivial two-dimensional planes characterized by a questionable color palette and a completely negligible amount of detail. PRO Good animations Some hints of originality AGAINST Boring and repetitive Outdated play structure Technically mediocre", "date": "2008-08-07", "grade": "S.V."}