{"name": "Beijing 2008", "ref": "https://multiplayer.it/recensioni/beijing-2008_a.html", "text": "If it is true that the Olympics and the world of videogames are linked by years of licensed products, it is also true that one has to go back to the era of 8-bit systems to find some titles worthy of being remembered. The particular connotation of the Games, in fact, does not go well with the current way of understanding video games: it is a ~closed~ event, made up of a certain number of disciplines that all make history in themselves. The player, therefore, is faced with various possibilities, not all of which are fun in the same way, without a real common thread. At the same time, we must give these games the merit of having, in fact, created the genre of ~party games~, which for some time have also been very popular on mobile phones despite the progressive abandonment of multiplayer via bluetooth. Beijing 2008, born from a collaboration between SEGA and Glu, belongs precisely to this vein and allows us to tackle three different disciplines in an ~Olympic~ context. In addition to the classic ~quick game~, the game has a single weight mode, which opens the way for us to three different applications: the 100m sprint, the hammer throw and the 200m freestyle. The version we tested, in Italian, strangely does not include a discipline that can be seen in some images, table tennis. In any case, trying each of these three sports translates into facing a series of trials of increasing difficulty, divided into phases. In the race, we will find ourselves lined up with the other competitors until the shot is fired, after which we will have to press the 5 key when an indicator appears that scrolls in the lower part of the screen: the more precise we are, the greater the thrust released by our athlete will be, up to the finish line . The 200-metre freestyle has very similar mechanics, only that in addition to key 5, you also need to press the mobile phone joystick in the direction highlighted from time to time: while the athlete is swimming, the indicators scroll in the lower part of the screen. block~ at the right time and with the appropriate key. Finally, the hammer throw is divided into two distinct phases: in the first we will have to, once again, press the 5 key when indicated, with the greatest possible precision; on the fourth press, we will have to keep the button pressed to move the launch angle indicator, leaving it when it coincides with the ideal trajectory. It is possible to try your hand at all the disciplines without constraints, participating in a series of competitions that follow one another and which see the level of difficulty gradually increase, without however the challenge ever becoming too demanding. Moving on to the technical implementation, unfortunately there isn't much to be happy about: apart from the usual essential sound, present only in the form of anonymous music (but whose volume, at least, can be adjusted independently), the graphics make good use colors but otherwise leaves something to be desired. Firstly because the athletes are all identical to each other, ie we have on the screen a series of photocopied sprites that move in the same way; secondly because the drawing of the characters is rather anonymous and lacking in detail, and a colored background is not enough to remedy this lack. PRO Precise control system It's still the official mobile game of the Olympics Quite funny... AGAINST ...but only for the first few minutes Very few disciplines available Technically far from exceptional", "date": "2008-08-05", "grade": "S.V."}