{"name": "Siren: Blood Curse - Recensione", "ref": "https://multiplayer.it/recensioni/siren-blood-curse-recensione.html", "text": "The blood curse Siren: Blood Curse is the first title of a certain importance distributed (at least for now) in Europe and the USA exclusively via PSN. After Warhawk and Gran Turismo 5 Prologue, similarly present on the Ps3 online service but also in the classic retail version, on the contrary, on this occasion Sony has chosen to rely entirely on the digital delivery system, seen by many as the more or less obvious next future for the entire video game market. As if that weren't enough, Blood Curse can also count on a division into 12 episodes to be downloaded individually; the purchase can therefore take place both in chapters (4 containing 3 episodes each at 9.99 euros each) and for the entire package at 29.99 euros. An intriguing solution, which however lends itself to the little understandable distortion of actually having to download 12 files from the PSN - for a total of 9 Gb - with relative installation one by one, a practice that is anything but quick and painless. The plot revolves around an American television crew who travels to Japan in search of an ancient village that has disappeared into thin air for 30 years; unfortunately, things soon take a turn for the worse, with the macabre discovery of the transformation of the inhabitants into evil zombies renamed Shibito. If the incipit may seem quite trivial, as it actually is, fortunately the development offers numerous points of interest, starting with the multiplicity of protagonists that we will have to impersonate during the various episodes. The episode structure, similar to that of a TV series with a lot of anticipations at the end of the ~show~, in fact puts the player in the shoes of a series of 10 different characters, with different characteristics and therefore able to offer their personal perspectives on the unfolding of history. And it's not always about spotless positive heroes, mind you... Compared to the original on Ps2, things have changed in many respects, and in a decidedly positive way. First of all, it is a common opinion that the precursor was a little too complex and cumbersome right from the very development of the plot, which jumped from one point to another of the ~timeline~ with the aspiration of offering various pieces of the puzzle to be recomposed step by step the other. In reality, despite its charm and originality, this choice turned out to be far too extreme to be appreciated by the general public. Therefore, with Blood Curse we have returned to a classic linearity more suitable for immediate understanding; even the choice of American protagonists, instead of the Japanese originals, is to be understood within the desire to extend the catchment area of the product. In the same way, the control system has undergone a drastic modernization which now, supported by a more elastic even if not impeccable management of the camera, allows you to maneuver the characters quite easily. But for the debut on Ps3, the programmers have not only thought of accessory changes, but have undertaken to make the gameplay more fluid by correcting the specific weight of the Sight-Jacking function on which the original practically revolved. In practice it is the possibility of ~entering~ the head of humans and Shibito in the surroundings to thus see through their eyes. A fundamental function in order to establish the right moment to sneak up behind the zombies or to obtain valuable information or clues. In Blood Curse the Sight-Jacking is still present, but its use is less exaggerated, since it is necessary in fewer occasions; it is also possible to activate it and at the same time continue to move your alter ego, through a useful split screen. Professor... professor... Obviously the technical component has also undergone a decisive update, making the incarnation on Ps3 a product certainly not capable of putting the hardware on the ropes with graphic marvels, but absolutely valuable especially as regards the creation of the settings: gloomy, desolate, oppressive and capable of offering a genuine sense of anguish enhanced by a constantly present malevolent darkness. The work on the Shibito is also excellent, who, while paying in some cases an evident inspiration to classics such as Silent Hill, manage to scare and annoy enough to create the pathos and tension that certainly is not lacking in Sony production. The defects are basically to be found in textures of fluctuating quality, somewhat woody animations and a frame rate that is certainly not untouchable, especially on the occasion of the Sight-Jacking split screen. Fortunately the monstrous Italian dubbing of the progenitor has been swept away, giving way to a competent and flawless English accompanied by subtitles in our language. Finally, a round of applausedone to the soundtrack, with quality songs capable of actively contributing to increasing the immersiveness and atmosphere of the product. The overall duration of the adventure, around 10 hours, proves to be sufficient and average for the genre. Comment The ~new~ Siren is an intelligent and coherent modernization of a concept that is so promising but all too frustrating and difficult in its first incarnation that appeared on Ps2. Blood Curse on the contrary brings with it the balance and accessibility necessary to be appreciated by the general public, without however lending itself to excessive and harmful simplification. A ~classic~ survival horror but completely at ease in 2008, not perfect but with enough charm, atmosphere and style to enter the hearts of fans and fully justify the purchase price. Pros Excellent atmosphere Intelligent and more than successful remake Intriguing storyline with 10 different protagonists Cons Long and boring installation Not perfect control system Some technical imperfections", "date": "2008-08-06", "grade": null}