{"name": "Cocoto Fishing Master - Recensione", "ref": "https://multiplayer.it/recensioni/cocoto-fishing-master-recensione.html", "text": "The library of the new Wii Ware service is heterogeneous and very diversified, despite the tender age of the service launched only recently by Nintendo. So could a game dedicated to fishing be missing, a sport that seems to be reliving a second youth thanks to the magical and revolutionary remote control? After the historic Bass Fishing, the strong brand from Rapala and the Fishing Master from Konami, it's the turn of the likeable mascot of the French Big Ben: the little devil Cocoto, after having experimented with shooters and karts, goes fishing with an adventure on the high seas in which he is the protagonist in search of the mythological 5000-year-old fish. Only with this fish is it possible to stop the magic cauldron and the lava from escaping, thus saving the world from a now announced tragic end. Fishing mixes with adventure, therefore, proposing a look and some elements probably inspired by Zelda Wind Waker. The juxtaposition to the Nintendo title is deliberately forced, but it is precisely what brings us back to mind from the very first moments of Cocoto Fishing Master, when the story of the 5000-year-old fish is presented to us in the form of a fairy tale, narrated with fixed screens and drawings with a nice colorful and cartoonish style. The game is structured as a sort of very simplified RPG: you have to look for the five pieces that make up the statue capable of awakening the great God of Pisces, fighting against end-of-level bosses and increasing our performance hand in hand with progress in the history. it's the turn of the nice mascot of the French Big Ben: the little devil Cocoto What we catch can be resold to a special shopkeeper who, after evaluating the goods, will reward us with items and money to spend. It is possible to buy new hooks and baits, as well as special equipment that will help us in the exploration. The story is totally ancillary to the sporting action, fortunately, not actually representing a solid motivation as it is narrated in a rather hasty and vague way. The gameplay and game mechanics, on the contrary, represent the heart of Cototo Fishing Master. After connecting the nunchuk to the remote control, the boat sets off in search of prey: the end-of-level boss can only be accessed after having captured six different ones. They are not difficult to find as they are indicated with a colored dot on the radar. There is no tutorial so the first moments of the game are nothing short of disorienting: you have to learn everything, and by yourself. You can choose between surface, medium depth or seabed baits; once launched, the hook must be retrieved slowly until a fish bites, after which the mini-game to catch it starts. A little devil chasing fish The bait must be made to move in front of the jaws of the fish, so as to precisely follow the pre-established pattern, which changes from time to time. The movement must be precise, otherwise you risk losing its interest. The mini-game does not require particular playful skills, but rather mnemonic skills, and due to the excessive mechanical nature of the fish it is often frustrating and repetitive. Once the fish has taken the bait, you have to pull it up by recovering the line with a circular and continuous movement of the nunchuck. Also in this case, the movements are detected with excessive precision and therefore it is necessary to execute perfect circles in the air, in order not to risk that the hook loses its tension and strength. Visually, Cototo Fishing Master shows two distinct aspects depending on whether we look below the water level or above. In the open air, the flat and two-tone sea does not have a great emotional impact. The five levels follow one another with very similar colors and layouts, contributing to a mood of visual frustration and little desire to discover what lies ahead. Under the surface, things are better, despite passing over a slight tearing, some pop-ups and certainly not excellent quality of the textures. the flat and bichromatic sea does not have a great emotional impact A little devil chasing fish However, there are some good polygonal models and some effective light effects that give the underwater world a pleasant look. The imp Cocoto and his friends are made in cel shading, as well as the fish that move with convincing animations and a funny expressiveness. The sound effects are decidedly few and repetitive: in addition to the noises of the seabed and some background music, there is little else. The game, originally released a few years ago on PlayStation 2, takes about five hours to complete. Today you can (re)play with 700 Wii-Points, which however still seem to be too much for the fun that this Cocoto Fishing Master can offer. Comment Cocoto Fishing Masterit is an adventure based on fishing that fails to excel neither on the first field, nor on the purely sporting one. The story is merely an excuse to cast the line and does not enthrall the player, while the gameplay is cumbersome in controls and repetitive in experience. Visually, Cocoto shows some positive aspects such as the animations and the look of the seabed, but it lacks in too many others such as the quality of the texture, the use of colors that are too repetitive and an almost identical layout for all five hours of play, a a few, especially if you've already played it on Playstation 2. Pros Good realization of the underwater world A fishing game on Wii-Ware was missing Cons Too cumbersome controls Repetitive and short levels Not an original game", "date": "2008-07-25", "grade": null}