{"name": "Pro Evolution Soccer 4: Recensione Xbox", "ref": "https://multiplayer.it/recensioni/pro-evolution-soccer-4-recensione-xbox.html", "text": "It is not the first time that the Japanese softhouse has attempted to export its most famous brands outside the reference platforms. We recall the Gamecube conversion of WE6FE (the eastern counterpart of PES, never released in the west). But it is certainly unusual to see the PES brand on a non-Sony console in Europe. It is therefore an event of enormous importance, enhanced by online support (which we remember, is absent in the PS2 version), which could represent a positive sign for the future of this saga. The recommendation of ~for many, but not for all~ is now superfluous, when the ~many~ have now become ~all~, with stratospheric receipts and unanimous approval everywhere. Konami football has come a long way, perhaps too much. The unstoppable success has started an osmosis (not playful, fortunately) with the Fifa universe, bringing the longed-for licenses, official shirts and reliable squads, but there is still so much to do. The boxed version of the game strictly follows the one released a month ago on Playstation 2, proposing official licenses for Serie A, the Spanish and Dutch leagues, and all squads updated to August 2004. Even aesthetically very little has changed, we are facing a direct port from the Sony console, therefore devoid of substantial graphical improvements. The Xbox can certainly do more, and the KCET graphics engine shows little room for improvement, however we cannot ignore the total removal of the slowdowns that afflicted the version for the monolith, as well as a better image cleaning. The options and modalities are also unchanged, including the official championships and an increasingly complex Master League, which also takes into account the aging of the players. The boxed version of the game strictly follows the one released a month ago on Playstation 2, offering official licenses for Serie A, the Spanish and Dutch leagues, and all squads updated to August 2004. Official teams The amount of teams available in this fourth chapter is remarkable, almost double the previous one. Unfortunately however, excluding the aforementioned licenses, the other teams will continue to present improbable names and anonymous uniforms. This year, however, a remarkably sophisticated internal editor comes in handy, which also allows the creation of brands, brands and symbols to adorn the favorite shirt. With a little patience it is possible to create uniforms that have little to envy to those licensed for the game. Another improvement, which we would like to underline, is that relating to the commentary, edited this year by the Civoli / Sandreani couple, who often manage to effectively support the matches, commenting with a certain relevance, and also indulging in lively considerations. a remarkably sophisticated internal editor comes in handy, which also allows the creation of logos, designer labels and symbols to adorn your favorite shirt. The Heart of Pes On the gameplay side, it's pure gold, as always. PES4 is a total improvement of what has already been seen in previous editions: many animations for the players, a new free-kick, the renewed ball physics, are all additions that make the previous chapter obsolete. The AI is increasingly sophisticated, allowing for even more realistic coverage on the pitch, the defense closes effectively, the attackers line up on the trajectories of the crosses, everything is the antithesis of static. And the result is what we know, that is a simulation like you won't find anywhere, certainly more permissive and open to the general public, but always endowed with a visceral and genuine energy, class, the ability to enchant with complex mechanics and matches that are never the same, to give emotions as only real football can do. And if you please. Defects? PES4 still suffers from a certain ~automation~ by the CPU, which willingly adjusts the dynamics to give liveliness and challenge to the clashes, to offer itself competitive against human action. Playing with the CPU is more satisfying than in the past, but it is undeniable how the Konami title performs best when faced with flesh and blood opponents. There is still some problem with refereeing (finally visible on the pitch), often too harsh in simple tackles, inexplicably light in those in the penalty area. The application of offsides is also frequent, as is the intolerance in inflating the opponent's net, undermined by posts, crossbars and the proverbial ~hairs~. Problems that the CPU almost never runs into. On the other hand, the moment of the goal gives satisfactions that are difficult to describe. The pad of the Microsoft console is not entirely adequate, which demonstrates its limits in the assignment of the race and player selection on the analog triggers, when these commands have been specially designed on the keys of the Dual Shock 2. Furthermore,given the lack of the second pair of keys on the front, the player is forced to feint with the black and white keys, which in the Pad S are not exactly a model of comfort. We also point out the impossibility of playing with more than four players in the same game. The most sensational thing, and which projects Pes 4 for Xbox into a limbo of its own, is the much coveted Xbox Live support. The Heart of Pes Oriente Mon Amour The last aspect will only affect users of the oriental version of PES, that WE8 which has just recently been renewed with the J. League edition. In fact, we must specify that the Japanese and European versions of the game differ in the speed and rhythms of the game, greater in the case of PES4, slightly transfigured to satisfy the different needs of the western market. The difference is particularly noticeable in the case of the champions, who demonstrate their superiority in an all too marked way, leading to often frenetic rhythms on the pitch. Even the shots are more powerful, the rebounds are wasted, in general the action is more lively and projected towards the spectacular, while not transforming PES4 into a mere arcade interpretation. As we said, Live support is fully guaranteed, but for this mode, please read the appropriate box. Comment Writing this review felt like a long April Fool's Day. And yet it is all true. PES4 arrives as the culmination of an incredible month for Xbox, a Christmas that not only brought long-awaited work, but put an end to one of Sony's major exclusives, which in Europe seemed truly unassailable. A sensational event, amplified (as if a port of this caliber weren't enough) by the Live support and all the new playful possibilities offered by the online community, never as happy as it is now. The potential is truly enormous, especially if the possibility of organizing online tournaments is implemented, an opportunity that can only be verified when the European servers are prepared. But even considered offline, PES4 remains the best simulation on the market, the best way to breathe and experience football on our televisions. An essential purchase for any enthusiast. Pros: Gameplay at the highest level Improvements in every sector Live support Cons: Sometimes hectic Judging could be improved Some licenses are still missing Online Football Tribe The most sensational thing, and which projects Pes 4 for Xbox into a limbo of its own, is the much coveted Xbox Live support. It really exists, it's not a joke and anyone who has access to an ADSL line knows that they will be able to find online, at any time of the day or night, the strongest players in the most beautiful football game in existence and challenge them. It is a fundamental step for the series and an undeniable added value for the Xbox line up, especially in Europe. Support is currently limited to only 1 vs 1 and the rankings of the best online players, plus the standards set by Xbox Live 3.0, but there are rumors of the possibility, later, of real and proper tournaments manageable on the net. If so, add half a point to Pes 4's score and consider it Top Score. The king is back! How many times have you read this sentence? If your gaming career began with the Microsoft console, very few. And this is an opportunity to make up for an exclusive that for many years has been the prerogative of Sony. In this case, the king does not return, but arrives for the first time, and with such an amplified effect as to cause disturbances, sleepless nights and a serious brake on our social life. Because this round is online that makes the difference, that mysterious four-letter option that made the community dream for weeks, hoping for an officialization. And it has arrived. PES4 is fully compatible for the Live service, allowing for fights to the death with human opponents. Do you feel ready?", "date": "2004-11-22", "grade": null}