{"name": "Unreal Tournament 3 - Recensione", "ref": "https://multiplayer.it/recensioni/unreal-tournament-3-recensione_a.html", "text": "Unreal Tournament III is available for PC, PlayStation 3 and Xbox 360. The version tested is the one for Xbox 360. Proven game plan The gameplay in this chapter does not differ much from the previous ones and is frenetic and explosive like never before. The commands are few and essential; in addition to those of movement there is the command to use the tools available, such as teleportation or the hoverboard and also obviously the possibility of changing weapons in a fraction of a second. Each of the ten weapons available (plus the Redeemer) has a secondary mode that modifies the rate of fire or accuracy. In the case of the missile launcher, for example, up to 3 rockets are loaded which can be launched at a short distance from each other, while the sniper rifle has a zoom to snipe enemies from a sidereal distance. Scattered around the maps there are not only weapons and ammunition, but also armor, energy kits and power-ups capable of making you invulnerable, amplifying the damage or making you (almost) invisible. The larger maps involve the use of different means of combat, each characterized by different movement speed, resistance, power and rate of fire. In addition to the classic Goliaths and flying vehicles such as the Mantas or the Raptors, there are the fearsome Darkwalkers (very similar to the tripods seen in the film ~The War of the Worlds~), equipped with moderate speed and impressive firepower as well as weapons secondary capable of weakening enemies. What makes the difference in battle is the combination of different factors such as knowledge of the map to immediately get hold of the most powerful weapons, knowing how to use them best and above all being able to move as fast as possible. Expert players are in fact capable, through appropriate combinations of jump and movement, of often being elusive to most enemies. Double jumps and spins make even the least agile player elusive. Single player with storyline Speaking of game modes, the first substantial difference in this episode consists of the presence of a story (whose plot is far from memorable but is already something more than the previous chapters) compared to the classic intergalactic tournament. The protagonist is Reaper, a member of the Ronin, a group of mercenaries who is hired by one of the many megacorporations to fight the war. It is not possible to choose the appearance of our avatar as it will be for online battles. The campaign is rather linear and in fact consists of a very long series of increasingly demanding challenges that will gradually introduce the player to what are the different modes. In some cases there will be very useful videos that will explain the game mechanics and the use of the elements scattered around the map. The respawn finds its role during the campaign, where what is introduced is a new military technology that seems to be able to make a difference in war, or the ~regenerators~, capable of instantly bringing a fallen man back to life. The megacorporations obviously attentive to the costs of these machines, decide to apply them only in the most important situations, limiting their use. Although the developers have made an effort to give some variety to the objectives, certain mechanics will be natural to fans, to the point that for example during one of the first missions, after a long explanation film, you will hear from one of your teammates : ~But then it is a capture the flag with vehicles?~. Upon completion of the missions, you will come into possession of some ~game cards~ which will offer the player particular bonuses, for example they will allow you to reduce the number of opposing players or their energy. Deathmatch and Capture the Flag Warfare The new Warfare (or Strategy) mode is essentially a sort of ~Territories~ taken to the nth degree, it provides for a series of nodes to be conquered progressively until you reach the enemy base, destroy the core of the generator and win the game. In this type of game the maps are very large and oblige as never before to coordinate in order not to disperse one's power. In fact, to acquire the nodes it is generally necessary to conquer outposts well defended by turrets and vehicles, using considerable volumes of fire to destroy the barrier of the nodes themselves. Some maps provide for the use of special spheres (one for each team) which can instantly destroy an enemy node or reinforce one already conquered. Carrying the sphere with you, however, it will not be possible to board any vehicle. By conquering nodes, you will gain access to newand weapons and vehicles that were previously at the disposal of the enemy may be used. To make moving faster, it is possible to materialize once dead directly in one of the bases under our control. Furthermore, at any time, by pressing the X key you can activate the Hoverboard, a sort of surfboard that greatly increases the speed of movement but which prevents you from opening fire. An always active minimap at the top of the screen will still allow you to understand at a glance which direction to take. Among the modes present in Unreal Tournament 3, Warfare is certainly the one where the harmony between companions pays off a lot, given the need, depending on the situation, to attack and at the same time defend the newly conquered nodes. In short, if you want to play only for yourself, it is better to aim for Capture the Flag or Deathmatch.&#8232;In total, however, the number of modes present in UT3 certainly represents a step backwards compared to UT2004, where there were also: Bombing Run, Domination, Last Man Standing and Survival. The version specifically created for Xbox 360 tries to fill these gaps by inserting new characters, bringing the possible choices for online to 55 fighters, five new maps and above all the possibility of playing the campaign not only via Xbox Live with friends but also in split screen without too many problems, thus having the possibility of facing all the challenges gradually proposed in the company. The coop via Xbox Live seemed absolutely valid and worthy of being tried, we must confess that for our taste, playing the offline or online campaign of a game like Unreal Tournament 3 does not do justice to the work of the developers, given that UT3 is perhaps the fps that most of all gives its best online against human opponents. Comment Unreal Tournament 3 does not present very big news compared to its predecessors, this version dedicated to Xbox 360 exploits the computing power of Microsoft hardware very well and we can only say that this shooter made in Epic Studios was missed. The gameplay does not add anything new to the canons of the saga, we are in the presence of the classic ~more of the same~, with all the features that made the saga famous brought to the maximum. Technically we can only be very satisfied with the work done by the developers, the Unreal Engine 3 is brought to optimal levels here and the best performance can be seen even compared to a technical masterpiece such as Gears of War. The many maps and the presence of a linear campaign with a story, albeit trivial, offer high quality online and offline game possibilities. If we also add the possibilities offered by the coop to all this, it is clear that we are dealing with a very valid title, whose only real defects are those linked to the absence of some modalities and above all to the real lack of significant novelties. Pro Grafica high quality and well optimized Very varied maps Great longevity in solitaire and online also guaranteed by the coop Solid and addictive gameplay Cons Not many game modes No real news Xbox 360 - Goals The 50 objectives in which the 1000 points offered by Unreal Tournament 3 are divided will not be easy to scrape together, you will have to squeeze the game into every aspect, offline, online and in cooperative mode. However, the vast majority of points will only be awarded to the real killers on Xbox Live. A challenge that requires dedication. UnrealEngine 3 The graphics engine of Unreal Tournament, known as Unreal Engine, even in this third incarnation is as spectacular as ever. Those who constantly follow the world of video games will know how all the major software houses have in fact secured the license for the Epic graphics system in their next productions. Characters, environments, weapons and vehicles are equipped with an exceptional degree of detail and although the peaks of Crysis are not reached, the result remains in a word ~very next-gen~. The battles are therefore extremely spectacular and frenetic, with a constant frame rate even in the largest maps. We have never seen any glitch in the game engine, even with many characters on screen, with lighting effects and explosions, a really good job from Epic Studios. The implementation of physics is also excellent, present both in the bodies of the characters and in the vehicles. The level of definition of the various maps is very high and the smallest details can be seen even from a distance, with very clear textures. Also with regard to the animations and the different movements of the characters we can only be satisfied. As far as audio is concerned, speech (all in Italiano) appears functional to what the game is and therefore expect a rather colorful and braggart language. The musical themes do not appear very varied and can still be deactivated to immerse yourself more in the action and rely even more on hearing in battle. The design of the maps looks excellent as well as the variety of settings, ranging from oriental temples to abandoned factories, passing through forests, bridges and sci-fi structures galore. The style of the characters leaves a little to be desired, too similar to that already seen in Gears of War and in general with much less variety than in the previous episode.", "date": "2008-07-03", "grade": null}