{"name": "Digital Chocolate Caf: Domino", "ref": "https://multiplayer.it/recensioni/digital-chocolate-cafe-domino.html", "text": "Beyond the easy irony about the vaguely old school nature of the game chosen this time by Digital Chocolate, this last chapter of the series has the usual characteristics that made it famous: the game is therefore usable both in a traditional key and online at inside the dedicated community, in which the various users can embellish their caf with the prizes won in the single player. The latter is divided between the Quick Play and Career modes, a series of six tables with progressive difficulty that rewards the user with recipes for hot drinks, various extras and new environments as they accumulate victories. Anyone who already knows the rules of dominoes knows that it's a rather intuitive game, a virtue also confirmed by this mobile version. A maximum of four players (human or guided by the CPU) can participate, who must arrange their tiles on the table by aligning those with the same numbering: the first one to run out of tiles wins. In this case, Dcoch Caf Domino offers two variants to this basic formula, relating to the eventuality that one is unable to continue due to the absence of playable pieces: in this case, one can choose between two options which alternately force one to draw from the pile until find a useful tile or pass the turn waiting for the situation to unblock. The product is therefore not wasted in useless frills, resulting as immediate as it is undoubtedly simplistic: the game action is not particularly reasoned, which - combined with the far from insurmountable AI of the opponents - makes the playful experience something more mechanical than actually cerebral. The incentive to move forward is provided by the already mentioned extra content to unlock: the recipes for hot drinks are pure entertainment, while the objects and clothing items are slightly more ~useful~ to beautify your virtual caf or the 'avatar who will inhabit it. As in the other products of the series, Dchoc Caf Domino has a rather restrictive online component: it is therefore possible to visit other users' premises and compare one's hi-scores with those of the others, but multiplayer is in any case limited to the classic local formula of the pass -the-handset. Even from a technical point of view, the Digital Chocolate work is certainly not exciting, but on the other hand it was not legitimate to expect anything more: the table is framed by an isometric view, while luminous signals indicate to the user which tiles are playable and their optimal positioning. As if the game wasn't already easy enough... PRO Simple and immediate Fun multiplayer AGAINST Too easy and mechanical Online always limited Technically insignificant", "date": "2008-07-03", "grade": "S.V."}