{"name": "Emergency Heroes - Recensione", "ref": "https://multiplayer.it/recensioni/emergency-heroes-recensione.html", "text": "My hero! The main mode (accompanied only by a simple multiplayer via split screen for two players) sees us take on the role of Zack and respond to reports coming from the headquarters, graphically reproduced on a map that we can access by pressing the ~+~ button of the Wii-mote. Once an emergency situation has been identified, we can select it using the A button and return to the standard view: signs will appear on the road that can guide us, together with the voice reproduced by the controller speaker, to our destination. Once on site, we will change vehicles according to the danger to be faced, all through an automatic procedure. There are four possible situations: chasing a hit-and-run driver, clearing obstacles, rescuing trapped people or putting out fires. In the first case, we'll get on board the fastest car available to us, with the aim of hitting the criminal on duty a certain number of times, until he stops and we can arrest him. The clearing of obstacles is the simplest thing to manage: using a special vehicle, we will simply have to go around a stretch of road, impacting against all the objects indicated on the screen. Rescuing people in problem areas is also quite simple, since you just have to follow the marked route back and forth: the actual ~rescue~ phase is not shown, it happens automatically. Finally, dedicating yourself to extinguishing fires involves exploring an area and activating a pump (button A) when you are faced with a fire. The control system sees the Wii-mote used horizontally, as in all Wii driving games: you accelerate by holding down button 2, while button 1 is in charge of the brake and with trigger B it is possible to pull the brake a hand. At the bottom of the screen there is a bar that fills up over time and which allows us, by pressing the d-pad, to enter ~hero mode~, or simply to take advantage of a turbo boost. My hero! There are four possible situations: chasing a hit-and-run driver, clearing obstacles, rescuing trapped people or putting out fires. Walking with Zack Between one mission and another, we will find ourselves facing ~emergency~ situations even simply by walking around the city. Solving them on the fly will earn us bonuses of various types, to be viewed later in the appropriate mode Saving The technical realization of the game goes hand in hand with the thickness of the gameplay: we are at very, very low levels. The metropolis is decidedly ~sanitary~, there are numerous cars on the streets but no passers-by (to be honest, the polygonal model of a person is never seen in the game), and the design in general is mediocre, with a use of monotonous. The use of textures is among the worst that has been seen in a video game in recent years: there are very few of them, and they are very bad. In the most agitated situations there is no shortage of heavy slowdowns, while the pop-up effect always occurs, even in the quieter phases. The characters are represented and ~dialogue~ through images drawn in a ~manga-like~ style that leaves much to be desired, but they speak completely in Italian. It is a pity that the dubbing has been entrusted to non-professional actors, whose level of acting is mediocre at best. Comment Emergency Heroes, needless to go around it, is a mediocre product. Mediocre in the technical realization, mediocre in the game structure, mediocre in the localization in Italian and mediocre also in the control system: the vehicle responds to the movements of the Wii-mote with guilty delay, making it really difficult, for example, to avoid civilian cars. Among other things, avoiding them or not makes little difference: we will drag them into our race without any problem, since we don't have an energy bar and, in fact, we can never ~lose~ the game. The various missions are all the same and the arrival of new vehicles (always belonging to the four ~types~) is certainly not enough to improve the situation: you move around the map and avert a catastrophe without problems, and then move on to the next situation. There is no challenge and there is no thickness. Ultimately, a title for younger players or ~casual gamers~ without much expectation. Pros A good number of missions Very simple Interesting starting idea... Cons ...but badly, badly done Technically awkward Voice acting terrifying", "date": "2008-06-30", "grade": null}