{"name": "NHL 2005", "ref": "https://multiplayer.it/recensioni/nhl-2010.html", "text": "The news The third game in the famous ~triad~ of Yankee sports, NHL follows close behind the cousins of the NFL and the NBA in the hearts of sports fans. Let's start immediately by saying that this NHL 2005 rides the wave of its predecessor, albeit improving some aspects, resulting in a very ~arcade~ title and much less simulative than the NFL or NBA. Basically the match is based on continuous game reversals, very powerful shots, rugby shoulders and miraculous goalkeeper saves. For heaven's sake, NHL played in two people is very enjoyable and not at all stingy with emotional tension and participation, but the most avid fans of this sport could turn up their noses on several occasions. Although the balance of the game is clearly in favor of the spectacular action, as in any good sports title from Electronic Arts, however, that rich frame that has always delighted the player, and which gives ~body~ and completeness to the game, could not be missing. NHL makes good use of the official license of the US championship, thus benefiting from roosters updated to the current championship, with real names and real characteristics of each athlete. as in any good Electronic Arts sports title, however, that rich frame that has always delighted the player, and which gives ~body~ and completeness, could not be missing The news The latter, due to the very nature of the game, will be difficult to identify and therefore will be more of a ~sideline~, without a practical application in the choice of formation and substitutions. Disk checking is not as smooth as it should be. This mostly derives from a slight ~lag~ that seems to exist from the moment the button is pressed, to the moment in which the shot is actually fired. The passages also give a not too positive impression: the power is dictated by the pressure time, and therefore if we want to make a rather strong passage we will find ourselves having to hold down the relative key for a few milliseconds too long, often causing the loss of the so-called ~ puck~. Similarly, to make a more powerful shot it will be necessary to hold down the key longer. Even if you just push the analog stick towards a teammate and press, often the puck will be lost or will go to the opposing team, even if addressed well, and this is a serious flaw. This year, compared to previous editions, it is much more difficult to score a goal, and although the game is very fast and full of curling shots, the goalkeepers have been significantly improved in their artificial intelligence. And so we will often find ourselves seeing very ~televised~ saves in response to equally spectacular shots with the result that, with a medium difficulty (the default one), the matches will almost always remain balanced. The control of the player and the team Given the high difficulty of scoring, you will be called to carry out offensive strategies and attack methods alternative to ~go ahead and shoot~. For this, puckless player control, called ~off-the-puck~ for the occasion, was invented. It can be used in various ways, for example, running on the attack you can switch the player on the fly and free yourself in the middle of the area looking for a more favorable shooting position, or you can ~block~ an opposing defender trying to facilitate the task to the other teammate in possession of the puck. In any case it is almost mandatory to try to score in these ways, otherwise we will almost always find ourselves barred by the opposing goalkeeper. The ~outline~ of the game mentioned above is obviously the juicy career mode, very well cared for and full of details as in any good EA game, like FIFA, NBA or NFL. Although the managerial mode is not in itself very fun, it still helps to add body to the title. As previously mentioned, the individual characteristics of the players are not very marked, on the contrary, creating a team, it will be very important to refine strategies and schemes: even by purchasing the strongest and most fearsome players on paper, we will never be sure of achieving mathematical victory . This is why in the NHL there are dozens and dozens of details to set and calibrate in order to find a balanced and optimal team structure: the better the team is optimized, the more chances to score we will be able to produce during the match. This is certainly the most successful simulation aspect. The franchise, or the market from which we will be called to ~fish~ stars or young promises for our team, is very intuitive and satisfying, and takes full advantage of SEGA's ESPN series: despite this, it is still slightly more accurate and complete , given that each player has a huge amount of official statistics on his sidenoteworthy (as well as the photo of the real player, of course). The aesthetic aspect of NHL The polygonal modeling has taken a decisive step forward compared to previous editions. Exactly in line with EA's other sports productions, player faces are the most realistic seen in a sports title this year. Even the coaches on the sidelines and some excellent referees such as Kerry Frasier have been reproduced in great detail. The three versions of NHL, PlayStation2, Gamecube and Xbox, do not differ much from each other. However, the version for the Sony machine is slightly inferior in terms of cleanliness of the image on the screen and quality of the textures. In the same way that Xbox seems to be the best, even if, let's repeat, the differences are not substantial. The general framerate is not very high, however comparable to NHL 2004, even if we must appreciate some efforts of the programmers such as inserting a completely polygonal audience, very nice to see. The cut scenes and replays are very spectacular and television-like, and contribute not a little to recreating that sporting ~climate~ in the same way as FIFA manages for football. The cut scenes and replays are very spectacular and television-like The aesthetic aspect of NHL The audio sector is as usual very nice. The effects are realistic and taken from real samples, while the soundtrack of the game is the result of a rich musical selection. The commentary, in English, is very satisfying and exciting and for this reason the choice to leave the audio in English is certainly spot on and helps to appreciate this sport. Obviously in a football game such as FIFA, closer to our sporting culture, we would have been much more demanding. The Xbox and PlayStation2 version is usable online, a factor that extends the longevity of the game exponentially. The online mode has been particularly taken care of, there is the possibility of creating personalized championships, or looking for a game ~room~ with a degree of experience close to ours where to enter and play. Electronic Arts has also thought of including a particular ranking of the best 100 players, estimated based on game statistics (wins and losses). We will also always be updated on the scores of the most important matches and on the updates of the official roosters. comment NHL 2005 is a good ice hockey game. Having said this, there are some necessary clarifications and final considerations to be drawn. This year the NHL is more arcadey than in previous years, and much more arcadey than the NFL and NBA. This factor will be appreciated by many players, but the most demanding and passionate users will be able to turn up their noses. The second thought goes to the ESPN series of SEGA, unfortunately far from the European market, but which in the USA was still sold at a budget price (about 30 euros), while presenting a gaming system for many a cut above the EA sports series. The online mode of NHL is a welcome surprise, and has been well implemented, which greatly elevates the overall playability and allows NHL to get an above average rating. Pros Deep and complete career mode Excellent polygonal models and animations Online mode Cons Often too fast and confusing Passage control difficult and slow Too arcadey for simulation lovers Between SEGA and Electronic Arts the challenge is always at the top: the first with its ESPN brand, the second with its usual sports titles from the EA Sports line, in a war that this year reaches its peak especially in the land of origin of these sports, the United States. Even in Italy, however, all the EA games dedicated to stars and stripes sports will soon arrive on the shelves, including Madden NFL, NBA Live and the title that we are going to review here, NHL 2005.", "date": "2004-11-22", "grade": null}