{"name": "Myst", "ref": "https://multiplayer.it/recensioni/myst-recensione-remake.html", "text": "Writing a review of Myst can only put a certain awe, considering that it is a masterpiece, a true classic that has helped build the history of the entire medium in question. So we focus above all on the remake operation completed by Cyan Worlds and in particular on this further reworking carried out starting from the VR version and launched directly on Xbox Game Pass. The choice to go directly to the Microsoft service catalog is also brilliant, given that such an operation could also be rather risky to place on the market as a standard title, but instead represents an addition of great value to the subscription offer. This leads us to recommend it to practically all Game Pass users because it is an ideal game for detaching from the rhythms of many modern titles and rediscovering puzzles in its purest and most original form. Myst has a long history of remakes and different editions, starting from the original 1993 version. It was a great success, both for its indisputable value in terms of puzzles and for the technological solutions adopted, riding the wave of the CD-ROM with its impressive pre-rendered 3D graphics and sequences in Full Motion Video, so as to lead to various sequels and the re-proposition of the original in new forms. The Masterpiece Edition arrived in 1999 bringing few technical evolutions, unlike RealMyst of the early 2000s, which introduced real-time 3D for the first time, later evolved with RealMyst: Masterpiece Edition in 2014. The new Myst that we cover in this article is yet another initiative: this is the adaptation for standard displays of the version developed in 2020 for virtual reality, further reworked with some graphic improvements. A strange and fascinating story The light and fog effects of Myst Remake are really nice From the point of view of history and narration, as well as of the puzzles present, the new Myst precisely replicates the original, being an exclusively technical remake between graphics and audio. The story is all based on books and the narration itself makes extensive use of the text written during the game (translated entirely into Italian), with a solution perhaps a little obsolete nowadays, but which remains particularly effective, especially if books have a fundamental function as in this case. The volumes, in the game, contain different settings and act as portals to reach the ~eras~ in which the adventure takes place, like real worlds that come to life from printed paper. The unnamed protagonist suddenly finds himself in possession of the book Myst and is projected into this strange dimension, trying to get to the bottom of its mysteries and to help (or maybe not) two men called Sirrus and Achenar, sons of Atrus - who seems to be the creator or discoverer of the various eras - and for some reason each imprisoned within his own book. Beyond a few interlude sequences, the story always remains rather hermetic, fragmented between the documents that found around the islands and largely entrusted to the free interpretation of the player. Myst Remake is probably the most advanced and richest version, in terms of graphics This is also a peculiar feature of Myst, which places the enigmas at the center of attention and tries to build a sort of narrative justification around them which, however, appears secondary and above all necessary to create the right atmosphere. The concept is therefore quite different from the standard graphic adventure: Myst is enigmatic not only in its reliance on puzzles, but also in the way these are presented, in the logic that connects them and in the motivations that drive them to solve them. Inserted in a dreamlike and surreal context, however, they find their perfect location and it is this deep connection between the atmosphere and the general strangeness of the actions to be performed that builds the magic of the game, which is still perfectly intact. Chained puzzle gameplay The various eras featured in Myst Remake are the same as in the original The game sees us explore various environments characterized by the presence of concatenated puzzles, the logic of which emerges only after careful observation of the elements of the scenario. Although initially it may be difficult to understand the meaning of the mechanisms with which we find ourselves interacting, there is always a logical explanation for the actions to be performed, with the interpretative key of the puzzles that can be deduced from the clues scattered in the scenario or directly from the documents writings that are around. The puzzles have remained precisely those present in the original, with the only differencewithout being able to select the random mode or the exact replica of the 1993 version. The mechanics of the puzzles do not change, but in the first case the solutions are different, which still requires you to carry out all the foreseen steps to reach conclusions, even if you he already knows how puzzles work. Given the nature of the game, those who have already delved into the original will still find very few elements of challenge in this remake, whose charm then is simply based on the possibility of seeing the island and the various eras from a distinctly different perspective. Being all remained intact from its first edition, the gameplay today appears particularly rigid, almost ~mechanical~ in its way of fitting the puzzles together and less organic in combining exploration and puzzle solving even compared to the splendid sequel Riven and other similar titles released subsequently. 3D exploration brings a new dimension to Myst Abstractionism is one of its characterizing elements and is part of the charm of the game: the underlying logic of pulling a lever or pressing a key is never easily understood, making it difficult to predict the results, which may occur a few meters away, but this it is precisely the style of the series and of this type of game in general. For today's users, this hermeticism can be even more disconcerting considering how accustomed we are, in recent years, to tutorials and long-winded explanations or perfectly scripted justifications for each single action in games. Even the fact of requiring the memorization of data and clues, perhaps through the use of a notebook for notes, is something totally obsolete, which sends us back to the 80s and 90s of graphic adventures, when the clues they were automatically ~acquired~ and memorized by the character, but connections and inferences had to be made in the first person. The changes of the Remake Myst Remake runs remarkably smooth at 60fps on Xbox Series X. The new Myst derives from a version designed for virtual reality and brings with it some solutions that clearly show this origin. The game offers free exploration of the environment in 3D, but strangely it does not include the use of the original ~point and click~ option with static screens, which was instead present in RealMyst and which would certainly have pleased nostalgics, in addition to give an impression of greater completeness. Even more bizarre is the choice not to even include the new content that this version had already introduced in the past years, instead focusing on the original 1993 structure, which at this point is also quite short, considering that the whole thing can be completed in less than 5 hours of play, if you are particularly brilliant in solving puzzles. Another derivation from the VR setting is the user interface, which on Xbox in particular is rather uncomfortable, adapted to the controller. In fact, in the presence of interactive elements, we switch to a sort of contextual interface that modifies the setting of the commands based on the presence of levers to pull or keys to press, which does not always make it clear how to act in each individual case. In more than one situation the puzzles are further complicated by this cumbersomeness of the controls which are difficult to understand and in some cases one may have the impression of being faced with real bugs, considering that these have also been detected in various situations (although unlikely to lead to complete breakdowns of the game). Once these critical elements have been reported, we must also give credit to Cyan Worlds for having exploited the opportunity of the transposition from VR to standard displays to enrich the graphics of the remake. The game has been completely rebuilt in Unreal Engine and, outside the constraints imposed by virtual reality viewing, it looks much more beautiful and rich than before: graphic effects such as volumetric fog and weather agents have been increased, as well as a general improvement of the lighting system that also uses ray tracing. On Xbox Series X, Myst is shown at 4K and 60 fps, also taking advantage of the AMD Fidelity FX Super Resolution technology and it is a remarkable show that enhances the particular original atmospheres.", "date": "2021-09-06", "grade": "8.2"}