{"name": "Manager Pro Football: European Championship 2008", "ref": "https://multiplayer.it/recensioni/manager-pro-football-european-championship-2008.html", "text": "Sports management has always been a niche genre, probably designed for the most demanding enthusiasts, who are not satisfied with playing games in the first person with the various simulations available and want to experience all those things that happen in a more complete and realistic way between matches. In football, this means taking care of the formation of the team from all points of view: establishing a formation, putting the right players in the various positions, taking care of their training and managing their physical recovery, correcting their weaknesses, refining a specific strategy to every commitment and, lastly, take care of any market operations. All things present even in the most essential of managerial games, at least as regards the market for PC and console games. On mobile, things are different, as is normal, and the titles belonging to this particular genre are still going through a necessary phase of maturation. The first step to do, once the game has been launched, is to select one of the national teams participating in the 2008 European Championships, creating a profile whose progress is automatically saved (for better or for worse: if you are eliminated from the competition, you will have to start over all over again). Then we move on to the actual action, which in a manager mostly concerns the technical aspects that must be addressed between one game and another. The interface of Manager Pro Football: European Championship 2008 has changed compared to the previous episode of the series, unfortunately not for the better: the ways of modifying the various settings are less intuitive and less legible, and you have to do some tests and put up with some mistakes before get used to it. We can choose a module and make the substitutions of the players, which are a copy of the real ones but have ~distorted~ but assonant names to circumvent the lack of an official license. Each footballer has a series of statistics, among which there is also an indicator of the level of current form, to be taken into serious consideration when we have to choose who to send onto the pitch and who to keep on the bench. The strategic aspect appears quite accurate: in addition to the classic setting that determines the degree of aggressiveness of the team, it is possible to establish what the type of game will be (short balls, long passes, etc.) and the level of pressing on the pitch. Finally, there is also a section dedicated to training between one commitment and another, in which we will be able to take care of specific phases of the game, dedicate ourselves to recovering the individual elements or improving their skills. After this phase, we can move on to the game. The development of the action is completely automatic, with the exception of set pieces: in this situation, we will be given the possibility to decide how the shot will be carried out (taut, precise or round). Unfortunately the show offered is not the most exciting, in most cases we will see completely stopped teams, which come alive only in some situations, with players who ~drag~ the ball badly and goalkeepers more like statues than anything else. very drillable. Graphics and sound are not the most important elements for a manager, but they can contribute a lot to the involvement during the simulation phases of the matches. From this point of view, unfortunately the new version of Manager Pro Football is mediocre: the players are tiny and all the same, practically devoid of animations, and the development of the action is really terrible to look at, accompanied moreover by a largely deactivated audio commentary . In the ~technical~ phases, the situation can only improve, but only up to a certain point: the menus are not always very legible and you need to understand which keys to press to make the desired changes. PRO A game about the Europeans during the Europeans Pretty nice tactical aspect There are no real names, but at least they are ~assonant~ AGAINST Interface not great Horrible match simulation to look at It gives the impression of being very ~random~ in its results", "date": "2008-06-24", "grade": "S.V."}