{"name": "New York Nights 2: Friends for Life", "ref": "https://multiplayer.it/recensioni/new-york-nights-2-friends-for-life.html", "text": "The first few bars of the game are enough to experience a rather unpleasant feeling of deja vu: everything, from the character creation menus to the playful interface, resolves into something already seen in previous episodes. Even the first acclimatization actions are always the same, with the user engaged in ordering to wash, dress and feed his character before letting him go out: of course, no one expected Gameloft to revolutionize the gameplay of its product, but it really would have been enough a minimal effort to give even a semblance of novelty to New York Nights 2. The game is instead always the same, the actions to be performed are hackneyed and the graphics are not particularly improved compared to the last chapters. In short, let's say right away that those who have already dealt with other episodes of the series will hardly be able to get passionate about the subject of this review. For all the others, however, it is enough to know that New York Nights 2 is a sort of social RPG vaguely inspired by the series of The Sims, and therefore expects the player to take care of his digital alter ego, satisfying his primary needs and possibly helping him to achieve a desirable social status. The adventure is therefore covered with (extremely flat) dialogues with NPCs, objects to be used to obtain various benefits and minigames that intervene to revive an actually lackluster game action. Basically, everything is resolved in the achievement of various objectives assigned as one continues in one's climb to success: one starts from extremely simple quests, such as finding a roommate or doing some part-time job, up to decidedly more challenging, be it meeting your soul mate or getting a prestigious job in a large company. All this while always keeping an eye on the various indicators that indicate the level of satisfaction of the character's needs or the progress in his various aptitudes: each of these can be increased by performing certain actions, for example by washing to increase one's personal hygiene or by making friends to reach higher heights of charisma. However, we must also take into account the time that every single choice steals from the game clock, given that, however virtual, our alter ego also needs to sleep. Too bad that, as mentioned, they are all things seen and revised in the previous episodes of the series, not to mention that Gameloft has not made a particular effort to improve the historical gaps of the franchise. In New York Nights 2 there are therefore extremely frequent loadings (the loading screen appears at every single change of setting) and annoying problems with the context sensitive system, which often prevents the user from interacting with the desired element, ~distracting~ on other goals. PRO Technically good It retains all the characteristics of the series... AGAINST ...and all the flaws too Lackluster gameplay Tendency to repetitiveness", "date": "2008-06-19", "grade": "S.V."}