{"name": "Yu-Gi-Oh! World Championship 2008 - Recensione", "ref": "https://multiplayer.it/recensioni/yu-gi-oh-world-championship-2008-recensione.html", "text": "The formula is well established and, if managed properly, certainly successful: you create a game that has to do with the wildest collecting, you associate a cartoon produced in a possibly not too poor way, and obviously it is seasoned with some suitable videogame adaptation. The key lies in trying to create a trend in the world of the very young: once it has made its way into the hearts of children and teenagers, it's done. Yu-Gi-Oh!, for those who don't know it, is a collectible card game, one of those that have taken up the legacy of ~Magic~ by transporting its complex structure within a frame structured according to the rigorous marketing of Japanese productions such. Being owned by Konami, it goes without saying that Yu-Gi-Oh! can also count on worthy transpositions into video games, as well as being based on the normal form of a ~physical~ card game, and the publisher certainly does not skimp on the releases of the series on consoles. As for Nintendo DS, which inherited the legacy of Nintendo portables, long considered the most naturally inclined to this type of video game (years of Pokmon have paved the way, on the other hand) we have arrived with this 2008 World Championship at the fourth installment in the series in just over a year (considering releases in all markets), after a plethora of appearances on Game Boy Advance. Clearly, the genre lends itself to numerous consecutive releases that offer little more than mere updates to the basic structure, which must remain almost identical to itself: as long as it comes to having to buy a new pack of cards every few months, this can be easily acceptable , and is part of the game itself, it is more complex to judge a new chapter of a video game, sold at full price, which represents an offer identical to what we saw only a few months ago, with the addition of a few cards and a few more modes . Dueling souls Yu-Gi-Oh! allows you to challenge an opponent in a strategically structured card game: each card has a different value and can function as an attack or defense, divided into summons, spells and traps. In practice it is as if each card were a spell that the player deploys on the battlefield, deciding to use it in well-reasoned ways to try to destroy both the opponent's cards and the opponent himself. The gameplay is exactly the same as the original card game, with the same rules and the same structure in attack and defense phases. In fact, this 2008 World Championship is practically the same game as the 2007 edition, with the addition of some new cards and the introduction of the ~Duel World~ mode, which in itself does not represent any significant evolution in the series. On the other hand, this is probably what fans want: an updated version of their favorite card game (and the limited edition cards included in the package act perfectly as a decoy for the operation). Instead of a data disk, we end up with a real new release, with the same setting, the same characters and the same basic structure. Unchanged (it was also present in World Championship 2007) is also the excellent presence of an exhaustive tutorial, able to insert perfectly into the game even those approaching Yu-Gi-Oh! for the first time, an indispensable element for broadening the user base. Present as in the previous edition, the multiplayer game mode, both ~in presence~ and online via Nintendo W-Fi Connection, which basically represents the real fulcrum on which the game is based, being like any card game a essentially social experience. The real novelty of this 2008 World Championship is the introduction of a new single mode, called ~World of Duel~. In this one, a semblance of history is given to the game structure, with the presence of a map from which we will be able to access different areas and interact with various characters. To tell the truth, all this appears decidedly unstructured: on the map individuals simply appear periodically, with whom it is possible to talk (which is practically useless) or challenge to a duel. As you progress through the fights, you will meet increasingly stronger opponents, up to the main characters of the television series, but it is practically the same thing you get in the Championship mode, so the value of this new introduction is not clear. In any case, the fact remains that playing solo is definitely not ideal for fully enjoying Yu-Gi-Oh!: it's a useful way to gain experience and accumulate a good deck of cards, but the real game emerges forcefully only in challenges against a human opponent. Cards and cartons Graphics are certainly not a fo elementndamentally, in the video game version of a trading card game, yet Yu-Gi-Oh! World Championship 2008 is packaged properly from this point of view. It can be seen that Konami cares a lot (and rightly so, given the success) of its brand, and this chapter is also pleasant for those who, not being fans of the game, find themselves immersed in this particular universe for the first time. Of course, there are no particular frills: in the actual game phases, a three-dimensional representation of the battle plan occupies the upper screen, while in the lower one we control the situation through an agile touch screen interface, with 2D visualization. When two entities (i.e. two cards) collide, we witness a rather simple but effective animation, which makes the fight spectacular at the right point, giving a minimum of vivacity to the austere general setting. Added to this are short cartoon-style animations, and the original character design of the television series (which you may or may not like, but it is a speech upstream from the making of the video game). The audio is based largely on archival tracks, relying on an anime and a whole series of video games. However, some new music has also been introduced, which helps to settle the overall level on a good quality, essentially having to act as a simple accompaniment to the games. Comment Being a perfect digital transposition of the card game, there is little to discuss about the quality of the gameplay. Yu-Gi-Oh!, as a series, is as well structured as its non-game counterpart, and its quality is not in question, although it is still a product suitable for people who have a certain flair for the trading card genre . The technical realization is up to what is required by a video game that reproduces a card game between two players, thanks also to the support of the anime characterization that pervades the entire product. The aspect on which we can discuss the most is rather the usefulness of releasing two almost identical versions of the same game less than a year apart: the minimal additions made by this 2008 World Championship make it dedicated to the die-hard fans of the series , or to those who approach the game for the first time with this chapter, while a ~normal~ user who already owns the previous episode could consider it a superfluous purchase.Pros The excellent interface makes the digital adaptation enjoyable Presence of multiplayer in LAN and online Comprehensive tutorial even for beginners Cons Requires a certain predisposition to be appreciated Practically identical to the previous episode Il Mondo del Duello does not convince as a ~story mode~", "date": "2008-06-17", "grade": null}