{"name": "Crown Trick", "ref": "https://multiplayer.it/recensioni/crown-trick-recensione.html", "text": "Asphyxiated dungeons, monsters of all kinds, narration as elusive as it is fascinating: the Crown Trick review really has all the credentials to make lovers of this kind of experience not only happy, but very happy. And yes, we are ready to bet that almost no one has noticed the release of the game on PC, now several months ago. Well then that NEXT Studios, supported by Team17, has embarked on a console port. Specifically, we have properly tested the product in question on both PlayStation 4 and PlayStation 5 and we already anticipate that it has fully convinced us. Not only for its fully responding to mechanics that still belong to a very specific and niche reality, but above all for the ability to make them intuitive, varied and stylistically inspired. The cryptic narration that we like so much Crown Trick: not only exploration, but also battles with fearsome bosses You don't need to have twenty years of experience with roguelikes (and if you want with roguelites) to expect a very specific narrative even from Crown Trick. Exactly as already seen a thousand times elsewhere and as who knows how many times we will see again in the future, the plot is more cryptic than ever: we find ourselves inside a vast (and very dangerous) labyrinth engaged in the very generic mission of saving the world. It is appropriate, then, for the player to collect the clues scattered everywhere, to understand more, to allow the protagonist to remember. After the defeat of each boss, for example, it is possible to find an extremely interesting document on the ground, which we always advise you to read (you will have to do it in English, because the Italian language is unfortunately not available). And the sentences left hanging by the various NPCs, as well as the exhaustive progressive completion guide entries, also come in particularly useful. Despite these limitations, however, we can tell you at least the initial situation, without tripping over annoying spoilers. The player dresses the balls of Elle, a red-haired girl who ventures into a very dangerous labyrinth to save her kingdom. In fact, the source of the evil that is threatening everything seems to come from within the Realm of Nightmares: and then, beyond the somewhat distressing name, it's worth going and taking a look. Here Elle meets an animated crown, rich in knowledge but little tolerant of the majority of human beings (and not), who decides to help her save her world from the common enemy, a certain Duke Vlad. Before being able to find the author of so much evil, however, Elle will have to visit the labyrinth, the Realm of Nightmares, in all its extension, in all its levels and in all its dangers. Will he succeed? It won't be an easy task. Gameplay: turn-based strategy, but with lots of action Crown Trick's grid is very reminiscent of turn-based strategy games The game philosophy of Crown Trick, beyond its fundamental roguelike soul which we will discuss a little later, draws heavily on both turn-based strategy and action. She moves from dungeon to dungeon and level to level within a squared grid. Its every single movement, every slightest step causes a reaction in the rest of the environment. If Elle stands still, enemies don't move, hostile environmental elements don't trigger, no one breathes. But if it moves in any direction, the others present will automatically take action too: approaching, fleeing or, more often than not, attacking from medium or long range. If desired, it is also possible to skip the turn and remain motionless, seeing how the others will behave; the actions vary according to the single species of enemy, it is therefore very important to know the patterns of all of them. On the other hand, in Crown Trick the action is largely the master: don't think of titles in which you have to think for hours, and then act after infinitesimal calculations. The reflections last (and must last) a few seconds: for the rest you hit hard, in real time, with axes, broadswords, bayonets, daggers, reinforced gloves (weapons generated randomly at the start of each dungeon, which can be exchanged with others found along the way). If you're looking for a lot of action, Crown Trick will give you that too Obviously there is no shortage of offensive and defensive spells, the use of which is linked to the possession of Familiars, creatures that can be equipped like other tools. Indeed, Crown Trick offers a real Pokmon-style collection: some are assigned by default, but as more and more levels of the labyrinth are explored and the main and secondary bosses are defeated, others are added. Just to give an example, the primsthe levels feature a lethal close-range warrior chicken, a carnivorous plant, and an undead. Once beaten, they can be found within crystals that grant (randomly) one to three familiars. Playstation 4 trophies Crown Trick offers a list of Trophies on PlayStation 4 and PlayStation 5 which also includes the platinum one, but to obtain all this it will be necessary to die an infinite number of times and perfect one's style of play. In fact, among other things, all the bosses present will have to be beaten, a certain number of projects unlocked, in short, the most hidden meanders of the labyrinth explored. The roguelike soul, and a touch of RPG It must be said that the procedural generation of Crown Trick sometimes shows some uncertainty The soul of Crown Trick, we said, is still that of a roguelike. The dungeons are procedurally generated, although too often and at close range, in reality, we seemed to encounter the same situations with identical enemies. We die a lot and badly, and certainly compared to most contemporary videogame productions this aspect makes the title in question ~difficult~; but also, compared to other roguelikes, it's not too steep in the learning curve, once you get past the first real boss, the witch. The presence of the ~punitive death~ goes without saying: that is, in the event of defeat, Elle releases all the accumulated gold and a large part of the blue crystals, invaluable for buying various types of upgrades in the main hub. But not even at this point we would have told you everything about Crown Trick, because we still have to talk (and at length) about its RPG components: the number and variety of weapons present is truly incredible (also considering that the console version includes a substantial DLC) , each of which has a certain elemental damage, weak or more effective against others, very specific statistics, particular combinations. The same goes for artifacts, whose discovery is random and whose use ends at the end of the dungeon in which they were found: they can enhance Elle's attack or defense points, the effectiveness of spells, guarantee more gold or crystals, weaken certain enemies, and much more. In your hands you have one of those titles that apparently make themselves known in just two hours, but which can then continue to amaze you without problems up to fifty. For an indie roguelike, that's no small feat.", "date": "2021-09-06", "grade": "8.2"}