{"name": "TV Show King - Recensione", "ref": "https://multiplayer.it/recensioni/tv-show-king-recensione.html", "text": "TV Show King is one of the very first games to be included among the downloadable titles from the new WiiWare service: for 1000 points it offers the classic fun of party games based on quizzes, wheel of fortune and bonus questions, a mix between Who Wants To Be A Millionaire , Le So tutte and the famous Playstation 2 Buzz, only at a decidedly competitive price. Developer Gameloft has localized everything into Italian, including spoken dialogue. There are all the ingredients to spend hours of carefree fun in the company of three other friends: a brilliant and likeable presenter, the blonde and always silent valet, and a really excellent amount of questions. The management of the succession of quizzes is developed very well, as we have never come across questions repeated for the second time, within hours and hours of play. The topics addressed are varied and range from classical culture, with foreign literature, poetry and architecture, via sport, cinema and TV, to biology, chemistry and history. Developer Gameloft has localized everything into Italian, including spoken dialogue You can choose three degrees of difficulty, and games ranging from 3 to 9 rounds. TV Show King uses our Miis in an effective and entertaining way: it is possible to choose them from those stored on our Wii, or from those of our friends. Once the challenge begins, the Miis take on a series of facial expressions that indicate their mood, happy if they win, disappointed and sad when they fail an answer. If we play alone, the CPU will choose the other participants in the quiz from the audience, formed precisely by our Miis: in this way we will be able to challenge the digital counterparts of our acquaintances, family and friends. Every three questions, the presenter offers us a bonus quiz that gives extra points, while in the end we are given the opportunity to spin the wheel of fortune, which can make us gain further, make us lose a sum, everything, or steal from an opponent. Spin the wheel, bonus questions and Quiz Attack Not being able to have a dedicated controller with a button pad suitable for this kind of game, TV Show King uses the classic Nintendo Wii remote control like everyone else. This makes it essential to display an on-screen cursor that indicates the choice we are making on the various questions displayed, a factor that does not affect single player gameplay, but raises some doubts if we are having fun with friends. In this way, in fact, even if we don't know how to answer some quizzes, we just need to spy on our opponent's little hand. Furthermore, once our friends have made their choice, a colored indicator remains imprinted on the question of their choice, thus allowing us to make a quick statistic on which are the likely right answers. However, whoever answers first gets more points, but this advantage can easily be reduced or canceled with the final wheel of fortune. In many cases, therefore, the adverse fate of the best and most prepared competitor can cause him to lose the game in favor of the luckier ones. a colored indicator remains imprinted on the question they have chosen, thus allowing us to make a quick statistic Spin the wheel, bonus questions and Quiz Attack Going forward in the game, then, the way of choosing the answers will change slightly: sometimes it will be necessary to have to ~scratch~ on the screen to reveal the writing underneath, or to use a revealing lens to be able to read. They are definitely nice options, inserted to make better use of the wiimote's capabilities, but they make the challenge unequal and unbalanced as they do not allow you to view the writings at the same time as who is playing. There is also a mode called ~Quiz Attack~, in which questions are asked in rapid sequence and a point is awarded for each correct answer, a sort of survival in which the goal is to try to line up as many right answers as we can. Graphically, TV Show King is very nice, both in terms of the style of the characters and the color choices that make the game pleasant to look at even after long sessions. Nothing incredible, of course, but the genre to which it belongs does not require particularly refined cosmetics. The audio sector is also well cared for, with well-chosen music, good use of the integrated speaker of the remote control and voices completely in Italian. Comment TV Show King is above all a good deal: for just 1000 points you take home a varied, entertaining and well-curated TV Quiz. The use of Miis is excellent, as is the quantity of questions proposed, a fundamental factor in a game of this genre. The only flaw of the gameloft title, decisampenalizing institution for the best, is to view the answers given by the competitors, allowing those who do not know the exact one to copy the opponent, and then hope to overcome him with bonus questions and wheel of fortune. Even the partial display of the answers poses some obstacles for the best, preventing everyone from seeing the questions at the same time. Regardless of this, TV Show King remains a more than decent game, especially dedicated to those who want to spend a few carefree hours with friends or family. Pros Lots of questions, and very varied Good use of Miis All localized Cons Others' answers are visible No online mode Some options hurt the best", "date": "2008-06-10", "grade": null}