{"name": "Star Soldier R - Recensione", "ref": "https://multiplayer.it/recensioni/star-soldier-r-recensione.html", "text": "At first glance, Star Soldier R may seem like an incomplete game, almost a demo version: the possible options on the other hand allow games of 2 or 5 minutes of play, and beyond that you cannot continue. However, the concept on which the game is based is not the usual one, which sees the progression through levels to the end as the foundation of the structure. Star Soldier finds his identity in the frantic search for the highest score, within a limited amount of time. To understand a little the idea surrounding the game, we need to think about the context in which it was originally enjoyed: Star Soldier was one of the protagonists of the Hudson Caravan at the time of 8 and 16 bits: herds of Japanese boys thronged around the yellow van with the bee designed to try to reach the highest score, and clearly the game had to be based on short and excited games, and a bonus and points collection system designed to allow direct comparison between players. This version for WiiWare was born with the intention of recalling the atmosphere and dynamics typical of the series, expanding the boundaries of competition to the whole world thanks to the use of online leaderboards, on the Nintendo Wi-Fi Connection. It is, in essence, a classic school arcade shooter, with vertical scrolling divided into two levels. The two main game modes allow you to perform for a maximum of 2 or 5 minutes, within which there are no limits in the use of ~lives~, but clearly, with a view to collecting the maximum possible score, the execution of the maneuvers and the killing of enemies must be as perfect as possible. On the occasion of its arrival on the new generation platform, the graphics have undergone a modernization, and are now in an impeccable 3D, simple but full of effects and extremely clean. On the other hand, it is a matter of scrolling through a scenario and enemies for only 5 minutes maximum. Short but intense In the ~2 minutes~ mode you go through a single level with a final boss, while in the ~5 minutes~ mode there are 2 levels, obviously with two relative bosses. The dynamics are typical of the genre, moreover one of the oldest: you control our little spaceship trying to eliminate the swarms of enemies that crowd the screen and at the same time avoid being hit. The peculiarity of Star Soldier R is, as mentioned, the fact of not focusing on survival and the ability to go as far as possible in the game, but on the exasperation of the bonus. Within the chosen time limit, you must try to perfect your trajectories and approach to the enemy more and more, in order to maximize your score: eliminating enemies in a given time limit will activate additional bonuses, and by chaining the damage done, you enter a succession of multipliers that increase the score exponentially. In addition to this, hitting the appropriate elements of the scenario you receive huge amounts of power ups, which quickly transform our ship into a lethal weapon. It is clear that it is a fundamentally repetitive dynamic, but if you get caught up in the heat of the record  and with the publication of the online rankings it is easy to happen  it becomes one of those games which, also by virtue of the intrinsic brevity of the games, they are difficult to leave. One game leads to another, with every game over we realize where we went wrong and how we could have improved the score, and before we know it we're back in the thick of the action. However, it is difficult to be able to make the passion last for a long time: the short burst of gameplay runs out quickly, proportionally to the duration of the games, not being a game with a random structure, and only the true ~high score~ maniacs could continue to play it for weeks. Particularly strange (but this is also part of the tradition) is the third game mode: the ~quick shot~. In this case the game lasts 10 seconds, in which we will have to press the shot button as many times as possible, in a game action like Track and Field, so to speak. It is then calculated how many times we pressed the key per second, and the ranking is also drawn up on this. It sounds absurd, but Takahashi Meijin, an executive at Hudson Soft, is still known by his nickname ~16-Shot~, for his ability to hit the fire button 16 times per second. Just to give an idea of how this game is a sort of cult in Japan. Comment Precisely because of its extreme simplicity, paradoxically, Star Soldier R is a game that needs to be understood. The first impression, if you are new to the series and its typical competitive mode, is that of a vensold at full price (even if it is still 8 euros), a sort of unsatisfactory demo. If, on the other hand, we manage to enter the dynamics, and we get caught up in the heat of the bonus, the high score and the competition at national and world level, Star Soldier R takes on another meaning. It becomes a pure arcade, with immediate and ephemeral fun, but concentrated in short moments of gameplay, repeatable over and over again. In any case, it is difficult for the interest to last for weeks, since the levels are always the same and the attack patterns of the enemies as well, in the end it all boils down to a maniacal refinement of the game performance. If you recognize yourself as the type of suitable player, this is the product for you, otherwise you might think you have thrown away 8 euros: there is hardly any middle ground. Pros Immediate and immediately engaging Online rankings Good response to commands Cons The short structure may seem absurd. Obviously monotonous. A bit flat design", "date": "2008-06-06", "grade": null}