{"name": "Ace Attorney: Apollo Justice - Recensione", "ref": "https://multiplayer.it/recensioni/ace-attorney-apollo-justice-recensione.html", "text": "If there is one source of inspiration to which video game developers have still drawn relatively little, it is the whole stream of fiction, be it literary, cinematographic or television, with a legal and procedural background, the legal-thriller, to put it in a always effective anglicism. Perhaps it will be due to the sensation of static and boring that a process gives that the various houses have never felt like betting much on this sub-genre, but, to demonstrate once again that luck favors the bold, taking advantage of this niche left open, now a few years ago Capcom delighted the Japanese GBA owners with the Ace Attorney trilogy, a series of adventures with a tone always suspended between demented comedy and heavy drama; the three games were then ported to the DS and brought to the West (in Europe only the first two, Phoenix Wright: Ace Attorney and Phoenix Wright: Ace Attorney - Justice For All, while Trials and Tribulations has not yet been seen) with some of changes and additions to take advantage of the peculiarities of the Nintendo portable and with excellent feedback from critics and the public. Apollo Justice is the first episode developed on DS from the beginning. The other half of the sky In the Ace Attorney series the most fascinating characters are probably the district attorneys, divided between the roles of opponents, and therefore ~bad guys~, and representatives of justice. Among them the most memorable remains Miles Edgeworth, already appeared in the first episode; it is no coincidence that Perfect Prosecutor will be dedicated to Edgeworth, a spin off that will see us engaged on the other side of the judicial system. We await it, in Japanese, by the end of the year. Guilty until proven guilty Those who were already won over by the lawyer Phoenix Wright and his highly improbable clique of friends and opponents, as well as by the very intricate cases bordering on the absurd, playing Apollo Justice will have the pleasant sensation of returning to a loved, beautiful and welcoming home , only, perhaps, a little refurbishment. Despite the change of the protagonist, which you can deduce from the title, already at the beginning of the career of the new lawyer Justice you come across loved and known faces, in the same extremely over the top tones and above all in the identical game system, divided by each case (there are four, but on average longer than in the other episodes) in the investigative phase and the trial phase. In the first you visit various locations, from the crime scene to the detention house, from the headquarters of the law firm where you work to other important places for the investigation, you collect clues and work hard to get as much useful information as possible by the various characters; already at the beginning of the career of the new lawyer Justice we come across loved and known faces Guilty until proven guilty in the courtroom, instead, in order to avoid the conviction of our client (who always seems clearly guilty at the beginning of the trial) the testimonies are listened to and an attempt is made to highlight the contradictions, making use of the trial register where all the evidence is collected. All with a very comfortable and completely intuitive point-and-click interface, obviously entrusted to the interaction between the stylus and the touch screen; thanks to the stylus, perform the various possible actions - dialogue with the characters, analyze the evidence, exploit scientific investigation techniques (with a couple of new entries) and use Apollo's Perceive ability (which is able to detect certain nervous tics in the witnesses to induce them to reveal the truth) - it is a completely natural process that eliminates any obstacle to immersion in the game universe, which is then, probably, the real secret of the Ace Attorney formula. Suspension of Disbelief And yes, because ultimately the gameplay of Apollo Justice is extremely linear, and although the use of a lot of gray matter is repeatedly required, the freedom of action is very narrow, even more than in other adventures; we are dealing more with a sort of interactive book than with a real videogame, and, although the mental procedures through which you could get there are different, there is only one solution to a given problem, and it always leads to the same event. Rather than playing, one finds oneself gradually discovering the script put together by the screenwriters, and it is precisely here that the beauty comes, because each process begins almost like a pile of information put together at random but slowly one sees, with subtle pleasure, how each piece goes to its own, unexpected yet so perfectly logical place. And the relationship that binds the various elements of a case together is the same that binds the cases themselves together, and even each episode of the series withthe other, a perfectly coherent narrative structure like only that of the greatest Japanese manga and anime, a universe to which Ace Attorney is inextricably linked. The gallery of characters is delightfully absurd, impossible not to become attached, for example, to the slightly slow old judge or to the very young prosecutor, therefore Apollo's opponent, who seems more interested in his rock group and beautiful girls than in the triumph of justice , tones and atmosphere are hilarious and demented to then pass in an instant to the gloomy and dramatic, all assisted by an always excellent character design, by music that knows how to effectively emphasize every moment and for this new episode also by beautiful animated cut scenes that introduce each new case (perhaps too few and too short) as well as 3D graphic sequences that better illustrate the procedural reconstructions. The game is, moreover, also translated into excellent Italian, even in the (little) spoken. What more could you want from a process? Just a fourth and last case that will at least leave you speechless... Vote Assigning the fourth (third for us Europeans) episode of a series a higher rating than its predecessor, and calmly admitting at the same time that little or nothing is really different, means only one thing: the execution of the old formula is once again perfect, and leaves all the charm of the game, of the stories, of the characters, of the mental challenges completely unchanged. Of course, if the other Ace Attorneys hadn't said anything to you, it's not with Apollo that you will begin to suffer the particular spell, but if you liked them and you have doubts about the freshness of the beardless Justice, take a seat in the Audience Hall without fear: the experience will, as usual, be memorable. Well done, Capcom!Pros Perfect interface Excellent characters and story Very long-lived Cons Very little new You won't replay it a second time", "date": "2008-06-05", "grade": null}