{"name": "Block Breaker Deluxe 2", "ref": "https://multiplayer.it/recensioni/block-breaker-deluxe-2.html", "text": "In fact, the latest effort of the French publisher rests its foundations on a well-known mechanic, re-proposed under always different names but with a common substance; in fact, we are talking about the classic brick wall to be knocked down with a ball by controlling a bar at the bottom of the screen, the protagonist of dozens of clones that have appeared both in the arcade and on all types of consoles. Nothing could be simpler and more obvious, for a gameplay that is closely related to the Jurassic Pong. And yet, just like in the case of Tetris, they possess that ~magic~ which means that, despite having known it for centuries, one is always more than happy to play a game. Aware of all this, Gameloft has tried to expand the original concept, without distorting it, but on the contrary adding numerous factors capable of refreshing and making the final result even more engaging and stimulating. And in fact the work done can be considered more than satisfactory, since Block Breaker Deluxe 2 is in fact the best ~nephew~ of Breakout currently available on mobile. The reason for this affirmation is fundamentally linked to the level design, capable of guaranteeing a particular variety both for the simple conformation of the groups of blocks to be eliminated, and for the qualities of the latter. Yes because after the first stages in which you can become familiar with the controls by facing particularly simple challenges, new challenges begin to take over in the form of indestructible or particularly resistant blocks, or perhaps grouped in particular formations that are often self-propelled and therefore more difficult to hit, and again teleporters and so on. And as if that weren't enough, the bonuses and maluses that are often freed by the destruction of the blocks must also be taken into consideration; some able to provide particular properties to the bar, such as magnetism or better still the ability to shoot lasers or missiles with high destructive power, others that offer the ball itself powers such as division into 3 or fire with which to literally cross entire formations of blocks, others still unpleasant like the malus that reverses the left / right commands. A great variety of situations therefore, and which adds a practically infinite quantity to the high number of pre-established levels through the random generator to unlock. The graphic component is also of high value, very colorful and captivating, above all thanks to the effects of exquisite workmanship. Everything in 2d is clear, but considering the still rather immature state of the polygon on mobile phones it's definitely better this way. If the idea of returning to a gameplay that is basically 30 years old doesn't scare you, Gameloft production therefore really has a lot to offer. PRO Rock solid mechanics Excellent technical realization Curated in every respect AGAINST Little or nothing new Sound negligible", "date": "2008-05-29", "grade": "S.V."}