{"name": "Final Fantasy Crystal Chronicles: My Life As a King - Recensione", "ref": "https://multiplayer.it/recensioni/final-fantasy-crystal-chronicles-my-life-as-a-king-recensione.html", "text": "Crystal Chronicles is the solution devised by Square Enix to experiment with new videogame experiences linked to Final Fantasy, freeing itself from the heavy burden of expectations that the high-sounding name of the series carries with it. And this new My Life As a King is really a huge departure from the typical structure of RPGs, transforming the universe of the spin-off series - while keeping the atmosphere and the general characterization of the characters and settings perfectly intact - in the scenario of a Sim City-style management. Also considering the experimental essence of the project, the game presents itself very well: despite the budget regime in which it was produced and the price at which it is sold (15 euros), one does not really have the impression of being in front of a video game second order, which instead proves to be treated with the typical Square Enix touch in every part. If you have previously played Crystal Chronicles on Gamecube, you will also recognize in this the typical cut of the sub-series: a fantasy world more based on the typical dynamics of the fairy tale, with a more childish and dreamy characterization than the main series, embellished by respectable (despite the price, it easily rivals the full-cost Wii productions) and a pleasant audio sector. Instead of playing the part of the hero-explorer, however, in this case we play the King himself, charged with rebuilding the capital of the kingdom after the fatal advent of the Miasma, which destroyed many cities. We therefore find ourselves, at the beginning of the game, in the role of the young monarch, accompanied by the aide Chime, by the knight Hugh Yurg and by the mysterious penguin Pavlov, inside a completely empty fortified city. But things are destined to move soon, thanks to the presence of the enormous magic crystal in the middle of the city, capable of giving the King the power of the Architek, and with it building his own kingdom piece by piece (money and magic permitting). . The hard life of the King The freely explorable game world is limited to the city, and it is in it that everything takes place, with the outside world that can be visited ~through a third party~ through the missions (the ~jobs~) to be entrusted to the adventurers. The King must take care of many aspects in the management of his kingdom: constructing buildings, controlling financial flows, guiding adventurers and keeping the citizens' morale high. The temporal progression is marked by the succession of days, which cyclically propose the various actions necessary for the correct management of the city, and in some cases by the passage of chapters when certain narrative sections are reached (there is in fact, albeit very deferred, also a plot to follow). Inside our stronghold we can build various types of buildings (houses, shops and so on, a bit like in Sim City), properly managing the amount of Elementite (necessary to exploit the power of the crystal, the Architek) and of course of money. The income, as regards these two indispensable economic resources, is entrusted to the action of the adventurers - who can be recruited among the members of the people and sent on various missions outside the city - and to taxes. Every morning, the faithful assistant Chime helps us organize the daily work of the adventurers, setting the objectives to be pursued (explore, killing monsters and so on) and controlling the economic trend. If at the beginning the game action seems excessively guided and simplified, as the days go by the things to do and to keep under control increase exponentially: the army of adventurers needs new equipment to face the growing threats (yes must therefore build special shops and finance research on weapons, to then arrive at the possibility of changing the class of the various fighters), citizens need to keep their morale high in order for society to evolve in the best possible way (it is therefore necessary to listen carefully to their wishes, build what they want, and possibly organize city parties). All easily performed using the Wii Remote (or other configurations provided), through simple menus. Pay to Play My Life As a King contains the new, infamous ~pay to play~ option, i.e. micro-transactions according to Nintendo. In practice, the mysterious red dot identifies the presence of downloadable content sold separately, to complete the gaming experience. The feared danger was that these were mandatory purchases in order to enjoy the game, but the reality hasn't turned out to be so inclement. Additional downloads enrich the basic experience, but by adding elements that are not needed (additional dungeons or additional races to enlist as scouts at the moment, for example) for gameplay. It is therefore not a low-level commercial operation as might have been feared: the basic package is enough and more to enjoy the game to the full. Comment My Life As a King is probably the most complete game, among the titles present in this first WiiWare delivery, in terms of design and construction. Despite the budget regime, Square Enix has undertaken to pack a good level management system (atypical choice compared to the publisher's curriculum, however), despite the obvious limitations arising from the desire to keep the game accessible and enjoyable even by those who are not experts in the type. The simplicity of use and scanning in small fragments (the ~days~ of the King) make it perfectly usable even in small doses, with a slow and easy progression in the full game mechanics. Of course, for those used to Sim City or similar, it remains a ~rose water~ management system, but for all the others it can represent an excellent introduction to the genre, as well as a pleasant game in any case. The ~pay-to-play~ option does not prove to be intrusive, remaining a free choice, while a note should be made on the lack of translation of the texts, entirely in English, which can represent a major brake on the diffusion of the game in Italy, above all among the youngest. Pros: Good technical realization Fun and well structured as a management Balanced and simple even for newbies Cons: Dynamics too simple for experts Repetitive in the long run Only in English", "date": "2008-05-30", "grade": null}