{"name": "Lostwinds - Recensione", "ref": "https://multiplayer.it/recensioni/lostwinds-recensione.html", "text": "Ether Lostwinds is part of a rather unknown platform sub-genre, which has been little used in history and which for this reason has given less than it could have: beyond the controls and challenges typical of platform games, accompanied by puzzle-style puzzles , it is the open structure, not divided into levels, that most characterizes the game. In the past there have been experiments in this field, to remember Uforia for NES, among the most recent Kirby & the Amazing Mirror for Game Boy Advance and Knytt, an amateur work, but in Lostwinds for the first time the territorial unity is reflected in an equal thematic homogeneity. The idea for the project came to the lead designer, Steven Burgess, while observing some leaves blowing in the wind: instead of the leaves he inserted a character, instead of the wind the pointer of the Wiimote. The airiness of the gameplay, a primordial feature from which the rest was derived, led the Frontier musicians and graphic designers to study the customs and architecture of the buildings of the populations who live at high altitudes: thus a minimal aesthetic was born, inspired by Tibetan culture but filtered by a typically European grotesque style, characterized by large open spaces and a calmness that pervades every element, accompanied by an oriental soundtrack, tending towards ambient music, aimed at relaxing the player and amplifying the feeling of tranquility and lightness typical of Lostwinds. It looks like the playful transposition of a short story co-written by Hermann Hesse and Neil Gaiman, it combines a poetic vision based on the fantastic with the traditional and canonical oriental spirituality. On the wings of the wind Lostwinds is a peculiar platformer, where the protagonist, Toku, doesn't have the ability to jump. The movement of the character takes place through the analog stick of the nunchuk, while the pointer of the wiimote controls the trend of the wind, with which you interact with almost every element on the screen, whether it is an object, an enemy or the protagonist himself. The typical cliffs of the platfroms this time are not avoided by pressing a key, but by tracing a gust of wind that carries Toku in the right direction; even most of the puzzles are solved by making certain objects interact, such as spheres, fires or mushrooms, with air currents. Lostwinds lasts about four hours, but its brevity is an asset rather than a defect: the experience is very intense, and the moves introduced in these few hours of play would have been sufficient to dilute the length by at least double, if not triple . The variety of enemies, which are all too limited, as well as the strength of the rivals themselves, which do not constitute a real challenge, is not fully convincing. Another unsuccessful feature is the perennial presence of tutorials, which occur whenever a new move is introduced: rarely necessary, they often give the solution to puzzles that players could have solved on their own. However, Lostwinds is also a success in playful terms, and demonstrates, while waiting for LittleBigPlanet, how much two-dimensional platformers, reinvigorated by polygonal constructions and the use of physics, can still give to the world of video games. Comment Lostwinds is a small project that is successful in every aspect, in which the final result is corroborated by the common purpose of the single elements. Airy and unitary in structure and atmosphere, charismatic in design and mechanics, it is perfect for distribution via Wiiware, without which it probably would have been diluted beyond four hours, to the detriment of its uniqueness and the intensity of the experience that , as opposed to the calmness of the setting, will allow Lostwinds to be remembered in the future. Pro Based on an original idea Every aspect leads to the same goal Great game design Great atmosphere Cons Few enemies and not very aggressive Intrusive tutorial", "date": "2008-05-28", "grade": null}