{"name": "Overclocked - Recensione", "ref": "https://multiplayer.it/recensioni/overclocked-recensione.html", "text": "This is a great period for graphic adventures, with many titles on the way (little talk about them, but there are really many, trust me... maybe we'll dedicate a special to them) with old, big names returning to the genre (Jane Jansen and his Gray Matter, or Bill Tiller with the upcoming A Vampyre Story to name a couple of names) and with more recently formed development teams that are specializing, just as happened in the golden age of the genre. The latter is the case of House of Tale who, after the break-in done with The Mystery of the Druids, and the affirmation they had with The Moment of Silence, manage to consecrate themselves with their latest work, Overclocked, placing themselves among the top positions of a hypothetical ranking of the best graphic adventure developers. We actually noticed that there is a lot of debate on the narrative side of video games but, in speeches on this topic, the genre that most of all bases its charm on storytelling, as well as on solving puzzles, of course, is hardly mentioned. And yet, if you look closely, the best experiments have taken place precisely in point and click adventures, declared dead by many and on several occasions, but managed to survive by digging a niche in the market and staying out of the big industry circle, demonstrating among other things an indifferent vitality. Overclocked, in this sense, appears paradigmatic. Released quietly and almost ignored by audiences and critics, the latter often too behind technological innovations rather than the substance of video games (a little self-criticism never hurts), manages to involve and at times upset the player thanks to some excellent directorial choices. Delusions of five unstable minds The game begins with a cutscene that immediately makes the atmosphere tense: we are in New York on a rainy day, a semi-naked girl arrives at an intersection and starts shooting, making all passers-by flee. Immediately afterwards we find ourselves in a hotel room at the helm of the protagonist of the game: David McNamara, a psychiatrist called by the government to try to understand what happened to five teenagers, including the girl in the initial film, found walking around the city in a state of confusion. McNamara, also with a troubled past behind him, which will emerge during the course of the game, must be able to dig into the unconscious of the patients, coming to reveal the dark plot that lies behind their state. We don't reveal anything more about the plot because any extra word could ruin the many surprises it contains. Just know that the story is divided into five chapters and that the time frame goes from 11 to 16 November, practically six days of which each day represents a chapter, apart from the last two which are included in only one (the final one) . when we spoke of ~digging into the minds of patients~, we really meant getting into them Delusions of five unstable minds What we cannot fail to mention are the flashbacks, or the fulcrum of the playful experience. When we talked about digging into patients' minds, we really meant getting into them. In fact, most of the game is made up of flashbacks caused by McNamara in the five boys, using the classic pendulum to hypnotize them, who, when they remember the facts of their past that drove them to madness, call the player to experience them in the first person . Or, more clearly speaking, each flashback will put us in the lead of the young man examined by the psychiatrist and will require us to advance the memory. As? But in the most befitting way for a graphic adventure: by solving puzzles. Total immersion (no wetsuit needed) If you have read the previous paragraphs carefully you will have realized that we are not dealing with a standard adventure. For heaven's sake, the style of play is very conventional, with an intuitive point-and-click interface that has already been thoroughly tested: by clicking with the left mouse button on an interactable point, a list of possible actions appears to choose from (examine, use, take and so on); in the lower part of the screen there is the inventory, while in the upper part the descriptions of the objects and the subtitles of the dialogues appear (if enabled). Even the dialogues are handled in a fairly conventional way and require the player simply to choose a topic of conversation among those available. But don't be fooled, House of Tale has written some of the most beautiful lyrics read and heard in a video game. However, as far as game structure is concerned, Overclocked doesn't take a step further than the titles that preceded it. Where it excels instead is in the ability to involve the player from the beginning to the end, dragging him into a sick and passionate story, into which we find ourselves all the more hooked, the more we advance by discovering details about what happened. Each flashback reveals something more, each dialogue provides interesting details. We often find ourselves unable to help but continue playing, even if it's five in the morning, just to insert the next puzzle piece, trying to clarify the general picture that is slowly emerging. It will be the sick atmosphere (and a little depressed, you are warned), it will be the puzzles designed to integrate perfectly into the plot, it will be the story structured in such a way as to provide the right details to intrigue without ever ruining the surprise of the next discovery and without saying too much about the general picture, the music will be repetitive but very suitable for underlining the atmosphere and involving more; in short, it will be all these factors combined, but Overclocked allows you to abandon it only when you are finished. Damn eyes! Comment We want to be brave, rewarding a game that has arrived on the market without a shred of hype. Trust us: if you don't buy it, you risk losing one of the most beautiful graphic adventures of recent years. Overclocked deserves to be played just to follow the good and deep storyline. Think more about it. Pros Original storytelling Engaging storyline from start to finish Well written dialogues Cons Not great graphics Doesn't last very long Some loads are long PC - System Requirements Minimum Requirements Processor: Intel Pentium 1.3 GHz or equivalent RAM: 512 MB for Windows XP, 1 GB for Windows Vista Video Card: 3D card compatible with DirectX 9.0c and Pixel Shader 1.1 Operating System: Windows XP / Vista DirectX: 9.0c or above Hard Disk: 5.0 GB Recommended Requirements Processor: Intel Pentium 4 2.0 GHz or equivalent RAM: 1 GB Video Card: 3D card compatible with DirectX 9.0c and Pixel Shader 2.0 Test Configuration Processor: Intel Core 2 Quad Q6600 RAM : 3 GB Video card: GeForce 8800 GT Operating system: Windows Vista", "date": "2008-05-28", "grade": null}