{"name": "The Settlers VI: La Nascita di un Impero - The Eastern Realm - Recensione", "ref": "https://multiplayer.it/recensioni/the-settlers-vi-la-nascita-di-un-impero-the-eastern-realm-recensione.html", "text": "Buscar Levante for Ponente The Goddess of Green Fire intends to appropriate the power of most of the trade routes that cross Asia, passing through India and reaching the depths of China. If this were to happen, it would be the beginning of a reign of terror and oppression. It's up to the daughter of the Mogul, Saraya, to save the population from this terrible threat by building various cities and villages to protect the caravan track and the same territory from the assaults of the bandits and the minions of the Goddess of Fire. Flying over the banality of the plot that forms the backdrop to the single player campaign, let's focus rather on the (few) innovations that The Eastern Realm promises to give to the gameplay of its predecessor: new missions, new heroes, new scenarios. The new hero, easily guessed, is the princess protagonist of the mission, who makes extensive use of one of the ~well~ two new constructions added in this expansion: the general store, which will allow a continuous coming and going of goods between your citadel and the rest of the kingdom through the opening of various trade routes, increasing the proceeds of these trades. The change to the gameplay is instead given by the new desert and tropical climates of the scenario, and where in old Europe floods are the scourge of the people, here comes the roughness of the desert and the monsoon rains, which will be able to guarantee a good supply of water as the fountain (second building inserted) allows to store the rains and preserve them for times of drought. Obviously the animal species change, becoming zebras, antelopes, jaguars, lions and the appearance of the map takes on the soft and neutral color of the desert and the decisive green of a palm forest. Apart from this, however, the minestrone remains what it once was, perhaps heated with the addition of herbs, but repetitive in the long run. The structure of the gameplay is the same, the innovations are actually few and the introduction of the figure of the geologist (who will be responsible for restoring vitality to depleted mineral veins) is certainly not enough to change the usual mechanism of constructing buildings for the collection, the storage, transformation and finally the distribution of resources, in a mix between a classic management and an Age of Empires (especially in the management of troops), but all this, in addition to being already seen in the base title (and in general in all the series) is also present and better developed, in those titles that make management their strong point: the aforementioned Caesar IV is a clear example, while the strategic component fails to reach the level of the aforementioned Age of Empires III and indeed it is extremely simplistic (it sends soldiers to kill the enemies, if they are more numerous, on average, they make it, otherwise, they take them). The Eastern Landscape Instead, what continues to please without any negative note is certainly the graphic aspect, which renews the already excellent engine of The Settlers VI: The Birth of an Empire with a series of new landscapes that are decidedly evocative and remarkably cared for above all in their naturalness and simplicity . The buildings are in turn of pleasant workmanship and detailed, even if perhaps we could have expected a few more animations, even the little men who will give life to our community are cute and well done, who maintain the comic style that has always characterized them unchanged in the saga. The accompanying music is also good, the sound in general a little less, with somewhat repetitive character responses, bland recitations and decidedly unrealistic environmental sounds. On the Artificial Intelligence front there is very little to say: the settlers reach the places of work and supplies with constancy and repetitiveness, without ever running into clipping bugs with objects or choosing abstruse and illogical paths to go from a place to the other. The autonomy of the military units is also very limited and the enemies are a bit disappointing, who often seem to be guarding a certain place, completely ignoring the enemies who leave their line of sight and without ever bothering to chase someone fleeing (perhaps they will fear to fall into ambushes, boh). Last note, the game is completely in English, both in terms of speech and video text. Comment 7.0 It is not easy to judge a title like The Eastern Realm: this is because on balance the add-on does not present any real innovation in the scheme of the original product, but it is also true that those who buy an expansion do so precisely because they want some new scenario on which to develop a gaming system that has already been tested and of which he is now sure. The target has something to do with this objective The Eastern Realm, giving away, at an extremely low price (20 euros), new environments andnew goals for base game lovers. Surely, however, it does not include any element that makes The Settlers attractive to those who do not already consider it a suitable title for them: in fact, the monsoons and geologists are not enough to make a gameplay interesting to the general public that seems anchored to a cross between a management classic (Caesar) and an RTS (Age of Empires 3). Pros Reduced selling price Pleasant graphic appearance New maps Cons No real innovation Neither management nor RTS Strategic component reduced to a minimum PC - System Requirements Minimum requirements Processor: Pentium IV 2.0 GHz or Ahtlon 2000+ RAM: 512 MB Video Card: 128 MB Operating System: Windows XP/Vista Hard Disk: 3 GB Recommended Requirements Processor: Pentium 4 3 GHz or AMD 64 3400+ RAM: 1 GB Configuration of Test Processor: Intel Core 2 Duo 1800 RAM: 2 GB Video Card: GeForce 8400 GT Operating System: Windows Vista Home Premium", "date": "2008-05-29", "grade": null}