{"name": "Advance Wars 1+2: Re-Boot Camp", "ref": "https://multiplayer.it/recensioni/advance-wars-12-re-boot-camp-recensione.html", "text": "Memory plays tricks on you. If we had to remember the two original Advance Wars, released respectively in 2001 and 2003 on the Game Boy Advance, we would have imagined them exactly as they appear in Advance Wars 1+2: Re-Boot Camp. In reality, the two classics developed by Intelligent Systems are much more pixelated than it will be possible to enjoy on Nintendo Switch starting April 21, 2023. It is certainly an excellent business card for the modernization work of WayForward Technologies, of the famous North American veterans for Shantae and Mighty Switch Force!, but it shows how iconic and impactful the design of Max, Andy, Samy and all their UC colleagues was. Although it is not one of Nintendo's most famous and best-selling series, in fact, the Advance Wars can still count on a host of enthusiasts who fondly remember the likeable protagonists, the colorful design of the units, but above all the very clean and essential strategic gameplay, but not trivial for this. In the review of Advance Wars 1 + 2: Re-Boot Camp we will find out if WayForward Technologies has managed to keep the magic of the series unchanged, in the hope of seeing the other two remaining chapters arrive, or even new episodes. The story of Advance Wars 1+2: Re-Boot Camp The dialogues of Advance Wars 1+2: Re-Boot Camp are anything but memorable... Knowing the story of Advance Wars 1+2: Re-Boot Camp is not essential to understanding the game, since it is a sort of excuse found by the developers to push players to tackle the many missions that make up the single player campaign of Advance Wars and later that of Advance Wars 2: Black Hole Rising. The first game opens with the young Commanding Officers of Orange Star, Max, Andy and Samy, who find themselves having to face the sudden and inexplicable invasion by Blue Moon, a neighboring state with which there had been a conflict in the past. Battle after battle the war will widen and involve more and more nations and armies, each with its strengths and weaknesses. At the end of this journey through the Wars World, the conspiracy behind this invasion will be revealed and peace will be restored between the different countries. Peace, however, lasts only two years, the time for Intelligent Systems to develop Advance Wars 2: Black Hole Rising, the direct sequel to the first chapter that picks up the story, the protagonists and the game universe exactly where we left off . The gameplay of Advance Wars 1+2: Re-Boot Camp The gameplay of Advance Wars 1+2: Re-Boot Camp is the perfect recreation of the original games Despite being virtually identical to that of the original games, the gameplay of Advance Wars 1+2: Re-Boot Camp is still extremely fresh and fun even after more than 20 years. Intelligent Systems, in fact, had decided to strip its other symbolic series, Fire Emblem, of all role-playing trappings to focus on pure and simple strategy. The result is always a very classic turn-based strategy game in which each player can move all his units only once per turn on a board of variable but rather small dimensions. Each unit has its strengths and weaknesses that must be exploited in order to achieve the mission objective which, in most cases, is to eliminate all enemies or conquer their headquarters. The units of Advance Wars 1+2: Re-Boot Camp are the same for all armies, it is the skills of the commanders that give them small bonuses or malus What's missing are the weapon triangle, experience accumulation, troop uniqueness, and overall drama that characterizes Fire Emblems. Here everything is more colorful and lighter, despite the fact that every CU suffers and inflicts catastrophic losses in every mission; furthermore, each unit deals or receives a predefined amount of damage, with no success rates that introduce randomness (the classic factor C) into the equation. Simplification in this case does not rhyme with trivialization. It is true that all units are identical to each other, but through clever design of the missions and maps the developers have been able to always keep the attention high and the experience varied, especially in Advance Wars 2: Black Hole Rising . The first chapter, in fact, almost seems like a big prologue, designed to introduce the CUs, units and game mechanics that will then really begin to shine in AW2. The first Advance Wars looks like a big prologue: the most varied and beautiful battles will be those of Black Hole Rising In Black Hole Rising, apart from a new type of tank and a couple of unreleased buildings, it is the variety of missions, as well as the less linear progress of the story, that make the difference. Between timed battles, adverse climatic conditions, fog of war, missions in which to resist a certain number of shifts with limited units and others in which to penetrate opposing fortresses, it will be fun, also thanks to a greater number of commanders to choose, each equipped of a special power, also present here in an enhanced version. Resource management, the conquest of outposts and war strategy, therefore, will make each battle quite satisfying and also complex towards the end of the story. In case you are looking for an additional challenge, once the campaign is over you can both face those missions that the crossroads had precluded you, and unlock a higher level of difficulty. Gang War Playing Advance Wars 1+2: Re-Boot Camp against a friend is always fun The same fidelity that was used to recreate the campaigns of Advance Wars 1+2: Re-Boot Camp, Wayforward has used to recreate the other game modes. Battles are pre-defined scenarios to be completed to get the highest score, Challenges contain a series of maps in which you can battle against up to 4 players. Thanks to the capabilities of Nintendo Switch it will be possible to connect different consoles in a local network or take advantage of the internet to challenge opponents from all over the world. The most interesting mode, in our opinion, is the one called ~hotseat~, i.e. the one that requires you to pass the console to the next player after completing your turn. To be done possibly in portable mode and not with Switch attached to the TV, in order not to nullify the secrecy guaranteed by the fog of war, in case it is one of the many options activated to customize the challenge. To the many maps that it will be possible to unlock by completing the campaign, available in both the Advance Wars and Advance Wars 2: Black Hole Rising versions, a virtually unlimited number of ones designed by users are added. Through the Graphic Room it will be possible to draw maps of a maximum of 30x20 paintings using all the tools encountered in the two chapters. Your creations can then be used to challenge other players both online and locally, thus potentially extending the longevity of competitive play to infinity. The technical quality of Advance Wars 1+2: Re-Boot Camp The design of Advance Wars 1+2: Re-Boot Camp is modern, yet incredibly faithful to the source material Advance Wars 1+2: Re-Boot Camp is halfway between a remake and a remaster of the two chapters for Game Boy Advance. This is because, although the game has been rebuilt from the ground up using a 3D graphics engine, it is nearly identical to the original materials. As mentioned at the beginning, the graphic style is the natural and convincing evolution of the two-dimensional style typical of the GBA era, enriched by a whole series of well-kept anime-style videos that embellish the first hours of the game. These, however, being all the same, could get boring after a while, leading players to choose not to view them anymore to speed up the flow of the game. Too bad it's not possible to skip even the very long cutscenes that signal the activation of the CO's special powers which, especially when the situation on the battlefield becomes critical, slow down the pace a lot, as well as being able to create frustration. Excellent work also in terms of music and dubbing in Italian. The first are a collection of cheerful and catchy marches, while the second is composed of a series of well-acted sentences that underline the key passages of the light story. In terms of content, there is little to ask of Advance Wars 1+2: Re-Boot Camp: the two campaigns are long, fun and complex, the Battle mode offers new challenges, while the competitive modes could potentially expand infinitely the longevity of the game, as long as an active community is formed capable of always producing new challenges. One step away from glory The trio of friendly warlords from Advance Wars 1+2: Re-Boot Camp On balance this Advance Wars 1+2: Re-Boot Camp is a successful commercial operation that, with a little more effort, could have been perfect. The first question that came to mind is: ~where is Advance Wars: Dual Strike, the final chapter of this trilogy?~ It is true that it is a more complex game to adapt, having been created with the double screen of the Nintendo DS in mind, but it is the final piece of the Orange Star epic. Without considering that it introduces new game mechanics, vehicles, UC and buildings that would have been a great use in thein the Graphic Room. Speaking of this mode, it would have been interesting to have fewer technical limitations than those expected in the early 2000s. Nintendo Switch can handle more complex maps than 30x20 rectangles and it's a shame that the developers limited themselves to faithfully reproducing the tools of games for the GBA. Skipping these cutscenes, after watching them 20 times, would have been greatly appreciated This absolute search for fidelity has also involved the game interface. It is true that Advance Wars 1+2: Re-Boot Camp is extremely readable and understandable as it is, but over the years Intelligent Systems have introduced small improvements to the UI capable of making the experience more fluid (just think of the latest Fire Emblems). In Advance Wars 1 + 2: Re-Boot Camp, for example, it is necessary to press two different keys to know the movement range and the attack range of enemy units and it is not possible to select more than one at a time. Another element that would have been useful is knowing, in maps with the fog of war activated, whether or not our units are visible to the eyes of the opponents. And, as we said, not being able to skip the animations of the UC powers is something that could get boring after several hours. During our test we ran into some sporadic bugs and game crashes - which however left few traces since Advance Wars 1+2: Re-Boot Camp saves after every move - which in all likelihood will be resolved through the first patches. Even the artificial intelligence could be better refined, given that it occasionally does not use all the funds available or makes short-sighted moves. For the rest it is a solid and fun experience, which hasn't felt much the weight of the years.", "date": "2023-04-19", "grade": "9.0"}