{"name": "Speed Racer", "ref": "https://multiplayer.it/recensioni/speed-racer.html", "text": "~Mach 5 Supercars Go! Go! Go!~ it is certainly one of the most particular souls that have arrived in Italy. It is a series that was broadcast in Japan for the first time in 1967, so it arrived here that it was already an undisputed classic of Tatsunoko (production company responsible for the various Gatchaman, Tekkaman, Time Bokan, Polymar, etc. ), and to see it transformed into a live film in 2008, moreover by directors who are far from unknown, is a nice surprise. ~Speed Racer~ takes up the characters and events that made the cartoon popular, updating its contents just enough to keep it up to date. For the rest, it is a very ~special~ film, which looks a lot like an anime and which therefore must be seen in the right spirit, without expecting anything different. The tie-ins arrived on time, produced by the Warner Bros. Interactive division, on Wii and Nintendo DS. As for the mobile version, Glu's experience and expertise were relied on: an impeccable choice, apparently. Available in both 2D and 3D versions (the latter being the subject of our test), Speed Racer offers us the possibility to try our hand at a single race or with a challenge (survival or pursuit, modes clearly inspired by the latest console racers), or to follow the story. The latter represents the most substantial modality, and sees us face a series of races in sequence marked by minimum objectives that are different each time: at the beginning, just finishing in the first three positions is enough to unlock the next event, but the more you go on, the more the requests increase, up to the point of only claiming victory. Once we hit the track, we'll have to contend with other aggressive drivers, who won't fail to resort to prohibited maneuvers in order to put us out of the running. The structure is more or less the one that can be appreciated on Wii and Nintendo DS, with all the limitations of the case. The so-called ~karate car~, in particular, in the mobile version of Speed Racer is very limited and complex: if on consoles it perhaps represents the key to obtaining victory, here it will be enough to focus on the race and on the boosts to cross the finish line first. The control system appears immediately well organized: the acceleration of the car is automatic, you have to press the joystick left or right to steer or down to brake. Pressing the joystick up activates the boost, if available, while the 5 button is used to make jumps, in certain situations. Just like in the other versions of the game, in order to take advantage of the extra boost we will have to drive as best we can and go fast: in this way we will fill up the bar located on the left of the screen, and this will set aside a maximum of two boosts for us, which can be used separately. The graphics of the game are really excellent: the developers have done an excellent job, developing an engine that can handle a good number of polygons without problems and maintain a good frame rate at the same time. All the cars have been faithfully reproduced and there is a large number of different locations within which we will challenge the other drivers. Each scenario boasts a different choice of colors and a well-made background image, which is often hidden by the arrival of tunnels, loops or inclinations of the track. In short, a respectable result (a pity only for the obvious pop-up), accompanied by a relatively poor audio: the MIDI music that accompanies the action is quite rhythmic and engaging, but something more could have been done. PRO Polygonal graphics very well done AGAINST A good number of different modes Very marked pop-up effect The ~karate car~ was not rendered at its best Structure perhaps too classic", "date": "2008-05-26", "grade": "S.V."}