{"name": "Brain Assist - Recensione", "ref": "https://multiplayer.it/recensioni/brain-assist-recensione.html", "text": "Tired of Brain Doctors? Here are the nurses. Brain Assist represents the second title of the genre developed by SEGA for Nintendo DS, after the mediocre Mind Quiz: Exercise your mind. The recipe is roughly the same as the now innumerable software of this type: a collection of exercises intended to solicit different abilities of the right hemisphere of the brain. Exercises that in this title are proposed with a less serious than usual, more playful and colorful guise. Puzzles of all kinds, intended to stimulate and train concentration, memory, analysis, instinct and reflexes. The game, without much effort in an innovative sense, has two distinct sections: one for training and the other for evaluating progress. It is also possible to compete against an opponent, either by taking turns on the same console, or in wi-fi up to four consoles with a single cartridge. So, nothing new under the sun. ~The scarcity of exercises available seriously penalizes this title~ Tired of Brain Doctors? Here are the nurses. But the worst is yet to come, because even if one can postpone an over-tested approach lacking the slightest shred of freshness, there is a heavier problem on which one cannot turn a blind eye. From a title of this kind, inflated by various clones of the same ilk, at least two things are asked: many exercises, and possibly interesting ones. Well, do you know how many Brain Assist has? 25? 30? 50? No. Ten. Ten hit-and-run mini-quizzes. Stop. Some beautiful others much less, moreover. An absolutely unsatisfactory number, although some of them are well thought out. But some clarifications must be made; it is quite incomprehensible, for example, that in purely ~mnemomic~ quizzes the player is forced to hasten the insertion of the solution, due to a countdown of a handful of seconds. We would have had nothing to complain about the presence of such a small time limit in the case of mini-games based on pure instinct and reflexes, but if the exercise tests memory this makes very little sense, especially since in one of these the composition of the answer is rather cumbersome (it involves choosing a color from a palette, coloring some shapes, choosing another colour, coloring others and finally confirming the composition created, which must be identical to the model briefly viewed previously. Doing it with the stopwatch hand at footsteps is a bit frustrating, especially on more challenging difficulty levels). Each mini-game has difficulty levels to be tackled progressively, in some cases it is a challenge against time to find the solution, in other cases you have three attempts to guess the answer by choosing from those proposed. By guessing the solution, you move on to the next frame of the same game, which involves some kind of complication. Otherwise the game ends and the result is recorded, for which a graph is proposed which highlights the variation of performance over time. Said of the small number of quizzes, it should however be emphasized that, if nothing else, they are well differentiated from each other. If one game calls attention and visual perception skills into question (find any differences between two images that are identical at first sight), another tests memory skills (a grid of colored boxes is shown for a few seconds, after which you have to remember the corresponding color to each box and paint it), yet another tests the visual reflexes (a number made up of several digits darts quickly from one side of the screen to the other and then disappears, in this case you have to remember the digits and type them in the correct sequence), and so on between games with geometric shapes to identify, pairs of symbols to find at a glance, numbers to line up, etc. After all, Brain Assist would certainly not be a bad title, and if the yardstick were only the quality of the exercises, the game would not look bad even in the face of much better known bestsellers, such as Brain Training by Nintendo. Unfortunately, the sore point of this game, namely the scarcity of quizzes, is seriously penalizing and makes the title very unattractive even for fans of the genre. Comment In a market segment as young as it is saturated like that of ~mind games~, there is still a lack of a rich and complete product from every point of view. SEGA, on its second attempt, fails again by proposing Brain Assist which, when tested by hand, turns out to be a fairly tasty broth but really too small. Definitely few exercises included to claim to involve the player for more than a few hours. A potential inspirationresse comes from chasing the record for each of the mini-games or from challenging other players. Nothing that could not already be done with other titles of the genre, on this or other platforms. Pros Curious exercises... ...and rather original... Cons ...but really too few! (10) Mediocre technical realization Brain Assist is available for Nintendo DS. Imagine the ideal wellness clinic. A clinic where to take care of the mind, relax the meninges, relax the nerves, recharge the brain. A clinic where six zealous nurses will be at your complete disposal to improve your brain performance. Simply put, imagine Brain Assist, yet another variation on the theme ~train your brain while having fun~. Granted and not granted that it really is funny.", "date": "2008-05-16", "grade": null}