{"name": "Monster Madness: Grave Danger - Provato", "ref": "https://multiplayer.it/recensioni/monster-madness-grave-danger-provato.html", "text": "One more stick The main differences compared to last year's version are essentially two. The first concerns the control method, with ranged weapons losing (finally!) the use of the back button in favor of a more appropriate right stick, allowing us to shoot in all directions much more comfortably. These, many and varied, can be purchased from a bearded truck driver in some points, being also able to improve their effectiveness after using some bolts and various scrap metal hidden in red toolboxes. Always from the same peddler on the truck it is also possible to buy some items that give bonuses to the characteristics of the chosen character. On the content front, in addition to the four-player cooperative and the classic multiplayer challenges, the developers have added a series of mini-games, 25 to be precise, which range across all possible videogame genres, from racing with the most disparate means, to puzzle game, passing through platform sections and timed massacres. Lastly, the camera management system has been revised, which in this incarnation on the Sony flagship has finally corrected the critical issues that previously plagued the title. Pad in hand Monster Madness can be played immediately with extreme ease, the controls, as already written, now work very well. One button for melee weapon, racket, knife, sword, mace and whatever you can pick up around, and the right stick for long range ones. You start with a simple but effective nail gun, and then move on to tools that are much more suited to the challenge such as rifles and rocket launchers. It is also possible to carry out a special area attack, which is obtained after loading a bar that takes into account our fury among the swarms of zombies and various monsters. Grenades and Molotov cocktails complete the arsenal available, but to be used sparingly given the small number in possession of our alter ego. Finally, the long walking sessions alternate with parts on very peculiar vehicles, such as a swan-shaped boat with attached rocket launcher, armored jeep and a mech equipped with everything necessary for the destruction of the city. It's raining cats and dogs! Graphically, the title benefits from the Unreal Engine, obviously not the latest one: the game does not surprise for modeling and richness in texture detail, but can boast a granite frame rate even in the most crowded situations, and that is almost always given the uncanny ability of zombies to pop out of the ground like mushrooms. On the other hand, the general characterization of the game is remarkable, of comic and cinematic derivation (very 80s!) and impregnated with insanity and humor as if it were raining! How can we not forget the big-headed chihuahuas, the MacDonalds-style clowns with their search bubbles or the old lady who throws zombie cats and spanks us if we haven't eaten our vegetables! Ultimately, the version of Monster Madness for PlayStation 3 seems, after having fixed those critical issues that afflicted the two previous incarnations, a title that can appeal to all those looking for an old school shooter, cosmetically ~spartan~ but decidedly frenetic and fun . In June we will see if all the corrections made and above all the new additions will be able to make the South Peak Interactive title make the hoped-for leap compared to what was seen last year.", "date": "2008-05-15", "grade": null}