{"name": "Boom Blox", "ref": "https://multiplayer.it/recensioni/boom-blox.html", "text": "Cinema and videogames have been linked since the dawn of electronic entertainment, with a relationship based mainly on exchange: the most famous films often lead to games, just as the most famous games give rise to films for the big screen. There are, however, partnerships that go beyond this ~give and take,~ where cinematic talent is somehow lent to the video game industry. This is the case of Steven Spielberg, who once tried the Nintendo Wii had a bit of a shock, starting a collaborative relationship with Electronic Arts for the creation of some new titles. The first of them is precisely Boom Blox, developed exclusively for Wii but also transposed to mobile thanks to EA Mobile. Those who expected a game with an epic plot, full of emotions, with a cinematic cut, will inevitably be disappointed: we are faced with a simple puzzle game, with the stages that must be solved by engaging the gray matter... The structure of Boom Blox is very simple: there are blocks placed on some platforms, and we have to make them fall by shooting our cannonball. There are blocks that are worth two points and others that are worth only one: after having fired all the shots, the score obtained will be calculated to see if we have reached the minimum necessary to continue towards the next level. Put like this, everything seems very easy, but in reality there are a number of factors that complicate our lives quite a bit: in addition to the normal blocks, there are others that bear the symbol of a skull, and dropping them too results in the loss of points. It is clear, therefore, that in the end the calculations are made on the basis of the points earned and those lost, with the final result decreeing our victory or our defeat. The ~bad~ blocks aren't the only element to consider, however: as you progress through the stages, other blocks or other things to watch out for are introduced, such as bombs or ~directional~ blocks, which one once hit they move in the direction they have ~printed~ on the face. The more you go on, the more you need to reflect before making your own moves, also because often we won't have more than a couple of cannon shots available and we'll have to try to do everything possible to trigger a series of processes that will lead to the elimination of the as many ~good~ blocks as possible. To play you must use the joystick and move the crosshair that appears on the screen, then you can fire by holding down the 5 key and releasing it when the indicator reaches the desired power level. As could be expected, the technical implementation of the game is essential, functional to the action: the stages are very numerous, but the graphic elements are more or less always the same, only arranged in a different way. The use of colors is a bit ~strange~, in the sense that the background is often represented by a gradient, but perhaps it could have been resolved differently, using some stylized plot or shapes, in order to make things even more appealing. As it is, Boom Blox's graphics are very spartan and suggest an amateur production. As for the sound, we have a good mix of short music and sound effects: nothing groundbreaking, but they do their job well. Unfortunately the audio does not have an independent volume adjustment, and moreover its activation produces consistent slowdowns on certain terminals. PRO A large number of internships New elements are gradually introduced Simple and immediate AGAINST Technically mediocre Good starting idea, but up to a certain point Audio can slow down the action", "date": "2008-05-16", "grade": "S.V."}