{"name": "A Caccia di Umani! Big Willy alla Riscossa - Recensione", "ref": "https://multiplayer.it/recensioni/a-caccia-di-umani-big-willy-alla-riscossa-recensione.html", "text": "Big Willy? Also set in the 1970s, this new installment in the Destroy All Humans! sees us once again in the shoes of Crypto, with the aim of taking further steps forward in his mission of conquest. Our uncle Pox has seen fit to set up a fast food chain (whose mascot is precisely the enormous Big Willy) in which a very special meat is served... made from the corpses of people killed during the first two games of the series ! Unfortunately there are those who have discovered this little detail and would like to make it public, ruining our business. So we'll have to deal with it ourselves, and immediately. Crypto has very effective special powers: telekinesis and telepathy. The first allows him to move any object, even large ones, to use it against his opponents; the second makes him capable of entering people's minds and taking control of them, granting them access to crowded areas. It is a practice that Crypto often has to resort to, above all when he finds himself crossing crowded areas, where his presence could generate uncomfortable alarmism (and the rapid arrival of the police forces...). As a good alien, however, the character also has a respectable arsenal, which we can enrich and enhance between one stage and another, exactly as happens in the previous episodes of the series. In addition, we will also be able to drive a series of vehicles as well as the gigantic Big Willy, in what turn out to be the most spectacular sequences of the game. Our uncle Pox has seen fit to set up a fast food chain that serves a very special meat... An alien on Wii If on PlayStation 2 Destroy All Humans! could count on a classic type control system, on Wii the developers rightly decided to take advantage of the peculiarities of the Wii-mote / Nunchuck combination. We can therefore control Crypto's movement using the Nunchuck's analog stick, but to orient its direction we will have to point the Wii-mote at the screen, checking the viewfinder of the equipped weapon. On PS2 you had to complete a simple minigame to be able to activate mind control on people, and the same thing happens on Wii. In this case, however, once a person is blocked we will have to shoot ~flying brains~ to subjugate him. It is clear that the B trigger must be used to fire, and that it is possible to do so with all the weapons that we will have available. Things change a bit when you get behind the wheel of the flying saucer: at that juncture, the analog stick is always responsible for movement, but to gain or lose altitude you have to move the Wii-mote up or down. As mentioned, it is also possible to drive a giant robot, Big Willy, sowing death and destruction around the city. The controls of this nice mascot are similar to those of Crypto, with some differences as regards the weapons, much more spectacular and devastating (the laser beams fired from the eyes, for one thing). The game structure hasn't changed from the past, and sees us completing a series of objectives to move from one stage to another. Poles or poles? The Italian version of A Caccia di Umani! Big Willy to the rescue boasts a completely Italian dubbing, with the main voices entrusted to the ~Pali & Dispari~, which those who follow Zelig will surely know. Given the number of jokes and the particular characterization of the characters, it is clear that we are dealing with a complex and delicate adaptation work. The voices of the two Italian comedians are very different from the original ones, therefore a speech of ~name~ rather than loyalty was made. The final result, however, is certainly excellent. Technical realization As could be expected from a series born on PlayStation 2, On the Hunt for Humans! Big Willy to the rescue passes on Wii without exploiting the technical potential of the Nintendo console, indeed managing to achieve lower results than those obtained from previous episodes. We know how important smooth graphics are for a game that uses the Wii-mote's pointing system. Unfortunately, the weak point of this production is precisely the frame rate: never fluid, subject to numerous jerks and uncertainties, as well as slowdowns when the action gets confused. The big problem is that this aspect, although related to the aesthetic sphere, also creates problems in the gameplay: the control of the character becomes problematic and highly inaccurate on more than one occasion. It's really a shame that the developers didn't try hard enough to achieve something more, and that this lack of care can also be seen in the polygonal models of the characters, borrowed from the PS2 episodes without any improvement.or. Let's say that the best technical aspect of the new THQ title lies in the sound sector, which not only makes use of well-made music and effects, but also and above all of a high quality Italian dubbing, entrusted to ~Pali & Dispari~. Unfortunately, the weak point of this production is precisely the frame rate. Comment Hunting for Humans! Big Willy to the rescue, unfortunately, fails in an attempt to bring to Wii the strengths of a series that has had its moments of glory and that certainly boasts one of the most bizarre, craziest and funniest scripts to be found in the current video game market. The constant references to the American culture of the 70s and the jokes of Crypto and Pox, dubbed into Italian in an inaccurate but effective way, in fact represent the strengths of the product. Unfortunately everything else stagnates in mediocrity: the game structure is always the same, the technical realization leaves much to be desired and the control system via Wii-mote is imprecise and cumbersome. In short, it could have been done much better. Hopefully the devs will learn their lesson ahead of the Xbox360 and PS3 debut... Pro Dubbed in Italian: we won't miss a beat Very entertaining story You can drive a giant robot! Against Frame rate subject to jerks and slowdowns Inaccurate and cumbersome control No innovative element for the series", "date": "2008-05-13", "grade": null}