{"name": "Lucky Luke: Go West - Recensione", "ref": "https://multiplayer.it/recensioni/lucky-luke-go-west-recensione.html", "text": "In Italy, Lucky Luke has never been one of the most popular characters, either due to the fact that his comic strip is not published on a regular basis, or because the cartoon based on it was broadcast many years ago on national networks but not has enjoyed reruns. It was mostly video games that kept the charm of the sheriff with his infallible aim alive, on PC as well as on consoles, and therefore this Lucky Luke: Go West is just yet another tie-in, developed following the philosophy of minigames and clearly aimed at a very young audience. The plot of the game, which is expressed through some short animated sequences, closely follows that of the feature film: Lucky Luke has to escort the Dalton brothers to New York to be tried, but something goes wrong and the criminals manage to escape. We will therefore have to face numerous tests, putting ourselves in the shoes of the hero but sometimes also in those of the criminals. Towards sunset! As mentioned, we are dealing with a product designed for younger gamers, with a very simple structure, which unlocks the stages as you progress. The first ~path~ sees us follow the plot of the film, while the following ones act as a contour, offering us different situations. In any case, the minigames present are really numerous. We'll start with the shooter sections, moving the viewfinder on the screen using the Wii-mote's pointing system: to shoot you need to press the B trigger, while the A button is used to reload. This type of mechanic sets us different goals each time: hitting certain objects, while carefully avoiding others, for example. Or, moving on tracks in the style of Resident Evil: The Umbrella Chronicles, hit all the enemies on the stage before they hit us. The movement of the viewfinder takes place precisely and quickly, from this point of view no criticism can be made to the developers. The problem, more than anything else, is the precision that is required for the shots to hit: the enemies (or the objects to be destroyed) must be exactly within the viewfinder, or we will end up missing them. Another minigame sees us riding the faithful Jolly Jumper through the streets of New York, trying to avoid obstacles and reach the set goal within a certain time limit. To move we will have to use the Wii-mote horizontally, tilting it sideways to change direction and forward or backward to accelerate or brake the ride. The idol of the little ones... We will also use a very similar mechanism in the role of the Dalton brothers, aboard a tram during their escape from the city: always with the controller horizontally, we will have to dose acceleration and braking in the best way so as not to end up off the tracks . In this case, the tilt of the Wii-mote is used to tip the vehicle to one side or the other, in order to avoid the huge potholes in the roads. To complete the list of the funniest minigames there is certainly the one dedicated to the kitchen. In a sort of ~Cooking Mama~ mode, in fact, we will have to cook dishes using both the Wii-mote and the Nunchuck: the first to take the ingredients indicated on the screen and put them in the pot, the second to mix when the soup is about to come out from the container. We will also find a section where you just have to prepare the ingredients, in this case slice them and put them aside. Having said that, there is no shortage of simpler minigames: sometimes we will simply have to use the Wii-mote like a pencil, joining the dots on the screen to draw clothes that Lucky Luke has to put on or take off, or we will have to draw symbols in a sort of rhythm game , or again we will have to place pieces of a puzzle to compose an image. Technical realization As expected, Lucky Luke is not the type of product characterized by an exceptional technical realization: for what its characteristics are and, above all, for what its reference target is, this tie-in developed by Tate Interactive is limited at the bare minimum. That said, the various characters may not be able to count on sophisticated polygonal models or a certain type of animation (indeed, to be honest, animation is one of the most neglected elements in Go West), but they are faithful to what was seen in the comics and in cartoons. The most graphically successful minigames are those in which you have to control the tram through the streets of New York, given the very rapid changes of direction and the cartoony aspect of the city. Everything else appears decidedly less well-groomed, inevitably. A similar argument can be made for the sound: apart from some phrases dubbed in Italian, both the music and the effectsthey are reduced to the bone nor do they shine in quality. Comment From the point of view of younger gamers, Lucky Luke: Go West stands as a nice collection of minigames. The ~rewards~ structure, which unlocks the various sections as the available ones are completed, ensures a certain ~surprise effect~ compared to what we have not yet seen. It is clear that not all games are at the same level, there are some that are quite addictive and some that are really too simple and limited. The game asks us to try and try each stage again to score better scores, but in reality it is unlikely that we do, or at least not before completing all the sections to see everything that the developers have had the imagination to prepare. Always thinking of the reference target, maybe you can turn a blind eye to the technical implementation and some problems related to aiming in the shooter phases. Ultimately, a product recommended for the little ones: whether they know Lucky Luke or not, they will surely find some of the minigames valid and fun. Pros: Lots of minigames Suitable for younger players Fine controls... Cons: ...apart from a couple of occasions Technically limited Not very long-lived", "date": "2008-05-07", "grade": null}