{"name": "Tetris Blockout", "ref": "https://multiplayer.it/recensioni/tetris-blockout.html", "text": "By now we know everything about Tetris: created in 1985 by the Russian programmer Alexey Pajitnov, this exceptional puzzle game has conquered the world within a few years, finding one or more conversions for every existing gaming machine. Less known is Blockout, developed in the late 80s, which in fact transports the mechanics of Tetris into a three-dimensional context, greatly increasing its thickness and difficulty. With Tetris Blockout, the mobile division of Electronic Arts takes up almost entirely the characteristics of Blockout, but inserting the geometric shapes of Tetris... From the start screen you can access the settings to determine the type of game and then get into the action, using the mobile phone keyboard to move the blocks and rotate them in three dimensions. At the bottom of the stage, a projection of each block is displayed, so as to make us understand which spaces it will occupy. The ~marathon~ mode is the most substantial, with its fifteen levels of increasing difficulty: in each of them we will have to total a certain number of floors eliminated, covering all the free spaces and dealing with an ever increasing scrolling speed. The ~ultra~ mode is the most complex one, since we will have to not only achieve particular objectives but also do it within a time limit. Finally, the ~20 floors~ mode represents a sort of ~survival mode~ in which, in fact, the elimination of twenty floors must be achieved. The rotation of the blocks, unfortunately, is not intuitive and indeed cumbersome, since you have to use three different keys to operate on the X, Y or Z axis. All this translates into a relatively quiet action during the first levels, but which soon turns into something really complex, as the speed of sliding of the pieces increases. It must also be said that the game offers us two different levels of difficulty, which change not the objectives and the speed, but the shape of the blocks: they become smaller and therefore it is much less difficult to insert them quickly. As with any puzzle game, graphics aren't Tetris Blockout's strong point, however they do their job effectively. The interface is readable, in the upper right part of the screen the blocks that will start later are displayed, while the projection of the pieces on the bottom is quite visible. Unfortunately, the same cannot be said of the blocks in their wireframe version, in the sense that it is often difficult to understand whether a ledge is above or below, and given the general difficulty this can translate into an even fatal error. As for the sound, we have a sort of remix of the Tetris theme music or, alternatively, simple effects. Each game is automatically memorized to be able to be resumed later, but using only one slot (therefore changing modes will cancel the save). PRO Engaging and fascinating It's Blockout, with a few tweaks Quite challenging... AGAINST ...sometimes even too much Graphics are often difficult to ~read~. Little varied", "date": "2008-05-05", "grade": "S.V."}