{"name": "Dragon Quest Monster: Joker - Recensione", "ref": "https://multiplayer.it/recensioni/dragon-quest-monster-joker-recensione.html", "text": "Dragon Quest Monsters is a sort of ~rib~ series, born from the success of the original Dragon Quest, one of the most popular JRPG sagas in the world, much loved in Japan and mother of cartoons, comics and all kinds of gadgets inspired by it. To give Enix the idea in 1999, when the first episode for Game Boy Color (Dragon Quest Monsters: Terry's Wonderland) was produced, it was certainly Pokmon, the little Nintendo monsters at the height of their success. Dragon Quest Monsters was born from a sort of sub-plot in Dragon Quest VI and offers more or less the same concept at the heart of the Pikachu and company franchise: a protagonist in search of creatures to capture and tame to win competitions and prizes. A simple concept, which has undergone few but focused changes in the last ten years, becoming Dragon Quest Monster: Joker, to the delight of Nintendo DS owners who love the crazy world conceived by Enix and re-proposed, once again, in its colorful fantasy . An excellent technical test Dragon Quest Monsters: Joker features one of the most effective and spectacular three-dimensional engines offered so far on the Nintendo DS. The polygonal models are well made, varied (especially in the case of monsters) and detailed, the texturing is generally of good quality and the coloring decidedly imaginative, which makes everything very similar to a cartoon. Of course, the character design of the usual Akira Toriyama, well known as the author of Dragon Ball, and historical creator of the characters and monsters in Dragon Quest contributes. However, the game is not without flaws. Firstly, the 3D engine still has some discrete ingenuity and uncertainties, especially in the geometric construction of the various environments, which often have invisible walls and rather strange angles, making exploration sometimes tiring. Similarly, the various polygonal models suffer from an annoying pop-up effect, for which some monsters or individuals end up appearing out of nowhere when we are already in their proximity, in some cases causing unwanted and perhaps harmful interactions. For the rest, the animations of the various monsters are excellent and the visual effects of the spells are quite remarkable. The sound side, on the other hand, is rather disappointing: the themes and style used for the composition of the various music definitely belong to the tradition of Dragon Quest, but these are rather banal and forgettable songs. Sin. The road to success The plot is certainly not the focal point of Dragon Quest Monsters: Joker, but it is present in a small amount such as to be the leitmotif during the adventure: the player's alter ego is in fact a boy belonging to a mysterious secret society called CELL, and his dream is to participate in a renowned tournament for monster tamers. Despite the initial reluctance, the father of our protagonist, as well as the head of CELL, will allow participation in the tournament provided that he carries out some more or less dirty jobs for the association. It's a simple pretext to embark on an adventure, and to explore the various islands and regions that make up the world proposed by Square Enix, with the aim of finding and capturing the monsters that inhabit it. With them it will then be possible to fight other creatures or challenge other monster tamers to a duel, in order to perfect one's style of play, enhance the creatures and climb the ranking in the tournament. And it is the acquisition and training of new creatures that is the heart of Dragon Quest Monsters: Joker, which however should not be believed as a simple Pokmon clone: in its own way, the Square Enix title re-proposes a tested mechanic with a series of inventions and features that make it an extremely deep title, far more than it might appear at first sight. Unlike its predecessors, randomly generated dungeons are finally absent in Dragon Quest Monsters: Joker, and our anti-hero is able to roam around indoor or outdoor locations actually seeing the creatures that infest them: no random fights, therefore, and the player can choose which monsters to face or avoid, although of course combat is the fastest and most practical way to upgrade the monsters in our team, up to a maximum of three at the same time, capable of acquiring skills and experience points such as in a traditional RPG. ... the acquisition and training of new creatures is the heart of Dragon Quest Monsters: Joker, which however should not be believed as a simple Pokmon clone... The road to success The fights also have a really interesting level of management: in fact, it is possible to issue general orders and therefore watch automatic battles without engaging too much, or coDirectly control your monsters at each turn, manually ordering the next moves. At the beginning of the fight, an option is then available that allows you to leverage the strength of your team to ~impress~ the rival monster: if the latter is really fascinated, it could even join our group, whether it is wild or already trained . This system is called ~Scouting~ and is the new feature of Dragon Quest Monsters: Joker, a sort of recruitment that leverages percentages and probabilities: every monster can be captured, it just takes more or less patience. Moreover, the player in a short time acquires the ability to combine multiple monsters to generate a new one, which will inherit its power and at least one of the skills possessed by its parents: needless to say, in this way you quickly have access to a very wide range of creatures , while the player maintains total control over the characteristics of his team. Comment While not reaching the level of complexity and variety of Pokmon Diamond / Pearl, Dragon Quest Monsters: Joker is a title that will undoubtedly appeal to all fans of this genre. Technically it is an excellently made product despite some graphic defects, and from a playful point of view it does not fall into trivial commercial naivety, instead maintaining a good depth and variety for the twenty hours of gameplay required to complete the main-quest, obviously destined to multiply in the hands of an avid collector. Too bad for the absence of an online mode worthy of the name (the mechanics of online battles and the relative evaluations are rather abstruse and the artificial intelligence really mediocre). Pros Deep monster management Excellent variety Technically very good Cons Some graphical imperfections Plot practically non-existent Online mode lacking", "date": "2008-05-06", "grade": null}