{"name": "Football Manager 2008 - Recensione", "ref": "https://multiplayer.it/recensioni/football-manager-2008-recensione_a.html", "text": "Championship every day Football Manager is a football manager capable of embracing all phases of managing a team with the exception of the purely financial part. This means that once you have selected the team to train (and here the numbers could make your head spin) the game opportunities offered by the title start from the selection of your players and tactics then moving on to the transfer campaign (also in this case not it will be difficult to find in the proposed database, an old teammate who used to play with you in the pupil category and is now an honest C1 half-back), the selection of the technical staff (physiotherapists, assistant coaches or scouts), the training methods, the management of the locker room, the relationship with the media, with the fans and with the other coaches through an infinite series of other little big facets that truly embrace every aspect of the ~behind the scenes~ of the football world. There are really numerous aspects to take into consideration, and they concern both the more strictly technical elements of team management (signings, training sessions, calendar) and the more impalpable ones, such as the moods in the locker room following choices judged unpopular by the team or the management . For every even minimal and imperceptible action of the player, there is actually an appropriate reaction in the game events. A team between the fingers Unlike the PC version, which in this chapter represented a good step forward from the point of view of the ergonomics of the controls, this Xbox 360 version unfortunately stands out for a rather cumbersome and awkward interface. Rather than replacing the mouse with the controller, moving a cursor with the analog sticks as might have been expected, Sports Interactive has decided to focus everything on shortcuts associated with the various keys, which require a long period of learning and memorization, and in general they fail to give the sensation of keeping everything under control, as would happen using a mouse and keyboard. Unfortunately, this game confirms how difficult it is to adapt certain genres to consoles, proving to be linked to the PC world perhaps more than various graphic or strategic adventures, whose progress in terms of commands are, at least, decidedly commendable. For all novices, Help cards have been introduced which will try to explain to the player what he can do and how. This attention to newcomers can be seen from the moment of creating the first game, where by default the more technical options and terms are hidden in favor of a series of Wizard-style screens. Again from this point of view (but this time even the regulars of the series will be able to derive real benefits) FM2008 is doing its utmost trying to make the effects of our work on the bench even clearer and more obvious. Now, for example, there will always be a post-match commentary that will judge the performance of our team based on the expectations of the press (previously it was only done in the case of televised matches) also highlighting key players from both sides and - above all - we will have a direct line with the fans to get to know, from time to time, the criticisms, hopes and compliments of the curve. This philosophy has then been adapted to our relationships with management, enabling us to better understand our employers' judgment of progress on and off the field of play. Still speaking at the level of the game interface, we particularly liked the presence of a new screen totally dedicated to the transfer market where all the offers in progress, both received and made, are summarized, thus allowing us with a single glance to have a idea of the situation. Likewise, the new calendar view (now Outlook-style) and the new information center denote a further step towards the ease of navigating and organizing information. This is a truly crucial element, speaking of a title that makes the wealth of information one of the many strong points. Then there are unexpected introductions, such as the possibility of changing the size of the playing field to adapt it - within the limits set by the regulation - to the characteristics of our 11, or such as the use of Facegen technology to reconstruct the faces of the players and staff, so much so that we will see them age over time... Although partially revised, the financial management of the team remains detached from our work. FM2008 provides us with a new set of information and detail about the financial status of the club, butapart from the unprecedented possibility of agreeing prizes with the team for achieving the season's objectives (league or cups), the management of the team's coffers will remain in the hands of others. Little news, good news Much emphasis has been placed on the new Match Flow created by the developers for FM2008, defined by themselves as the biggest change since the introduction of the new Match Engine. In a nutshell, now the approach to the match has been further schematized by introducing a series of sequential and mandatory steps before being able to get to kick-off. We are not talking about any real innovation introduced, however it is yet another step towards simplifying the game interface, although - undoubtedly - someone could complain about having to make at least 4 or 5 steps before being able to get to the moment of the initial whistle. Once we arrive on the pitch, very little will have changed, if not for an enrichment of the comments and game actions and for the fact that - finally - we will be able to make changes of player and tactics in real time, during the course of the match, thanks even in the presence of a mini-screen showing the progress of the meeting. It is difficult to make judgments on the results of the matches here, the idea we have is that - while remaining the best engine on the market - the average results are still too rich in goals and that it is more ~difficult~ than expected to draw. After all, given the complexity of the data and the innumerable conditions of use, we imagine that radically changing the match engine could be an extremely risky operation with possible, extremely unpredictable consequences. We therefore await with curiosity that this restyling proves to be fundamental for the justification of a new chapter in the series. Also given the ever-increasing television vocation of the title, we would not mind perhaps seeing the highlights of the championship matches no longer with the usual 2D view but with a renewed graphics engine it is more realistic. Certainly, if the graphic aspect appears sparse but sufficient for the intent, the audio represents a real sore point of the entire production. For example, there is still no possibility of using an internal MP3 player and - above all - the chants and sound effects that accompany the game are monotonous and annoying. Comment On consoles, Football Manager sharpens its essence as a niche game: the inconvenience of the controls and its inappropriate appearance make it even more a title dedicated exclusively to managerial enthusiasts or football aficionados. Its excessive austerity and seriousness, both in terms of graphics and in terms of gameplay, make this title decidedly out of place, played on a television, with a controller in hand and sitting in an armchair. Nonetheless, it remains the best simulation in managing a football team, and practically the only choice of its kind on Xbox 360, but the PC version is recommended. Pros: Deep and complex. console) Realistic event engine Cons: Not really suitable for a controller The austere appearance does not facilitate identification The complexity can put non-enthusiasts out of the game", "date": "2008-04-25", "grade": null}