{"name": "Townscaper", "ref": "https://multiplayer.it/recensioni/townscaper-recensione.html", "text": "We often find ourselves discussing what a video game is and the answers are sometimes very detailed and sometimes very general. Impossible to please everyone, but - from our point of view - a video game is an interactive digital product that performs the task of entertaining the user. The ~how~ varies enormously depending on the genre and the creator's sensibility, but it also changes based on how the player approaches the product. In the case of Townscaper, what matters is how you deal with it. For some it will be a waste of time, for others a little surprise from which it will be difficult to break away for many hours. Here is our Townscaper review, a rather atypical title. build Townscaper makes us build a seaside town, or a flying megalopolis In Townscaper you do only one thing: you build a city. Don't think, however, of Minecraft, Dreams or SimCity, because the game by Oskar Stlberg (author of Bad North) reduces the idea to a minimum by doing the exact opposite of what games normally propose: it takes away control and does not give us no purpose. All you have to do, in the small empty sea that forms the basis for our city, is select a box, so as to place a building. The only freedom granted to us is the choice of the color of our building, for the rest everything is automated. On the first click we will place a street, an empty square. By pressing on the road, we will place a building, which will automatically appear as a small house. By pressing on the roof of the house, it will rise to a building and two floors, and if we continue it will become a tower. By widening the road around the house, we will have more space to place other houses, perhaps making large condominiums. These, if large enough, will lose their roof, which will become a new road, which can be used to create a new city level. Townscaper offers a fairly limited horizontal space (on Switch), but allows you to climb to unrealistic heights. The rest is up to you. You can aim to create a classic seaside village, a small city built as if it were around a hill, a series of islets connected to each other, or - as in our case - a deformed, sprawling city, with buildings that develop in a ring, in the air, around other buildings, streets in the void that revolve around the entire city. The procedural construction obviously follows certain rules and it will be up to us to discover the (few) secrets it hides, such as the ability to create a series of stairways if you place two towers side by side between two street levels (it seems trivial, but it is a very specific architectural choice). Game controls and versions Townscaper allows you to create very visually beautiful environments Our test took place on the Nintendo Switch, which allowed us to try to build the city using both the touchscreen and the normal key controls. Initially it is instinctive to touch the screen, placing streets and buildings with rapidity but, as our city has become wider and has begun to rise in height, we have transitioned very naturally to analog sticks and buttons. Townscaper, initially, could ~obsess~ the user and push him to play for even an hour in a row (in our case this was the case), but once the impact is over, it is likely that it will become a pastime game, to fill a moment of empty and let your mind relax for a few minutes. In other words, it's a perfect product for mobility. For this reason, between the PC and Switch version, the latter is probably the best compromise, since it offers portability and a double control system; know, however, that on PC you will have access to a larger building space. However, the Nintendo Switch fails to run Townscaper perfectly. We haven't had a chance to test other versions, so we don't know if it's a common issue or due to the limitations of the Japanese console, but as the city gets large, the procedural look of our builds slows down significantly. When placing a new building, it takes several seconds for the game to figure out what we've done, analyze nearby tiles, and change the new building's appearance to be consistent with the rest of the environment. Even the first load is far from instantaneous. These are limits that could annoy some players, so they should be taken into account if you want to approach it as a method of relaxation. A beautiful but somewhat empty city You can also change the time of day in Townscaper But let's talk about another Townscaper goal: to create postcard scenarios. There is no specific goal in the game, likewe said, but certainly we all want to create an environment that we find aesthetically pleasing. Even within its limits, or perhaps thanks to these, each of our creations will always be beautiful to look at. The procedurality merges all the elements into a coherent amalgam, also because the graphic elements are not many and the style of the city is unique. Asking a product of this type to propose different types of architectural styles is perhaps a bit much, but we would have liked a few more details anyway. The streets and buildings are embellished with trees, benches, panoramic binoculars, but overall they are empty and inactive. There are only a handful of seagulls that choose a roost and move around that change the structure of their chosen building, flying around and then repositioning themselves somewhere else. Being able to see small stylized inhabitants walking around the streets or even just seeing buildings that, instead of simple houses, sometimes become commercial places (restaurants, shops...) would have helped to give the impression of having really created a small city. As it is, Townscaper creates pleasant but sterile environments. It's not a real big flaw, but it's a small disappointment.", "date": "2021-09-02", "grade": "7.8"}