{"name": "Pain - Recensione", "ref": "https://multiplayer.it/recensioni/pain-recensione.html", "text": "Beast what pain! In reality, the physical pain will fortunately not be that of the player, but of his own digital alter ego and unfortunate protagonist of the mechanics studied by the programmers. In a nutshell, the aim is to launch a character with a huge slingshot and watch what happens between crashes and broken bones. A concept therefore absolutely insane, and which thanks to a rather inspired realization is able to offer moments of pure hilarity both to those who have the pad in hand and to any spectators of the ~massacre~. Obviously the graphic style, absolutely over the top and comic, allows the product to convey the harmless irony that distinguishes the SCEA production. Learning to play Pain is therefore really simple and immediate, and in any case the perhaps a little long-winded and obligatory tutorial will quickly make the gameplay clear. We were just saying that everything revolves around a huge slingshot, placed on the ground in a fixed and non-modifiable point within an urban context of a few hundred square meters; in short, a small neighborhood, made up of a restaurant, a hotel complete with a neon sign, a few houses, billboards, a bowling alley, a huge donut, some pedestrians and a handful of cars. Before the actual launch, it is only possible to decide the tension of the elastic (and therefore the range of the launch) and the direction and height towards which to point the slingshot. Once you have made your final choice, all you have to do is send the poor unfortunate person flying in a particularly sadistic way, and consequently enjoy the show made up of screams of pain but above all of chain reactions. Yes, because based on the use of Ragdoll physics (for the character) and Havok, now more than commonly used in various video games, the American team has managed to give great interactivity to the setting, which is affected in real time by the collisions of the protagonist . And so you can maybe throw yourself towards the huge pins on the roof of the bowling alley, to then fall from several meters onto a truck carrying glass plates, only to be hit by a passing car, pick up an explosive case and so on until until the kinetic force is exhausted. In reality, the launch phase and all that follows do not require the player to assist passively; on the contrary, there are a whole series of commands that can be imparted ranging from the possibility of assuming plastic and idiotic poses during the flight, clinging to objects of various kinds or still using in a limited way a sort of after-touch a la Burnout (called ~ouch~) with which to further move the slaughtered body of the ~hero~ towards new sources of pain. The sense of all this? But score points of course. In fact, the more the launch will cause shocks and pains in series, the more the counter will grow up to provide the overall score. In reality there are a couple of alternative ways, but the main one is still the most successful and the one capable of maintaining interest with a certain continuity. What crazy pain! But where Pain probably gives its best is in the local multiplayer mode, which marries perfectly with the hilarious themes and the craziness of the product, enhancing them even more. Unfortunately, however, the limits of Pain do exist. Starting with the fact that there is only one level available, which can be fully explored after a few hours of play. Sure, the programmers have promised to expand their creation with future paid add-ons, and already now there are a handful of extra characters to buy to replace the standard one. But in the current state of things there is simply too little iron in the fire to guarantee sufficient longevity. Furthermore, although Pain is conceived at the base to be a hit and run experience, the deficiencies in key aspects prevent the will to play it from ~growing~ once the novelty factor has faded. We refer, for example, to the impossibility of saving replays of one's performances, or the absence of an online multiplayer mode; these elements would have allowed the birth of a much more robust community than the current one. Comment Pain is an excellent premise that unfortunately takes shape too superficially. A genuinely fun game, with original mechanics, but that wears out of interest very quickly. The promises of the developers regarding new downloadable content have so far not been kept, except for a few characters and little else. In the current state of things, Pain is therefore advisable only to satisfy the curiosity of trying something new with the awareness that within a few days the interest will pass forI will definitely go for something sturdier and more durable. Pros Original and very entertaining Technically good Fun multiplayer Cons Only one setting Too little iron in the fire Currently unsatisfactory downloadable content", "date": "2008-04-24", "grade": null}