{"name": "Oktoberfest: Unlimited Fun", "ref": "https://multiplayer.it/recensioni/oktoberfest-unlimited-fun.html", "text": "For those unfamiliar with it, Oktoberfest is a celebration held every year in Munich, Germany, between the end of September and the beginning of October. It is an event of ancient origins, held for the first time in the early 1800s, in which millions of people participate: they gather in an area of the city, outdoors, and go on for more than two weeks drinking beer and eat traditional foods (wurstel, sauerkraut, etc.), dressing in a very picturesque way. Gameloft has tried to capture the spirit of this event, enclosing it in a game structure that is strongly inspired by that of Warioware: lots of minigames that follow one another quickly, in which you have to quickly understand what to do to move on to the next phase. The main game mode is divided into seven stages, each characterized by the presence of different minigames, which become more and more complicated. One of the tests will ask us to recognize the barrel in which a girl is hiding, in another case we will have to fill beer mugs ~on the fly~, or chronologically reconstruct the composition of a dish, recalling the various dishes in the correct order. Sitting on a table, with mugs of beer flowing sideways, we will have to be able to hit ten nails with a hammer in the shortest possible time, or block some beers that are thrown at us. Being able to fly a kite by pressing a single button, to make it gain or lose altitude depending on the obstacles in the air, or even running towards a girl trying to avoid colliding with drunks. Oktoberfest: Unlimited Fun is this and more, and exactly like in Warioware you have to immediately understand what to do to pass a test: the game only gives us a hint (for example: ~roll!~, or ~fill in!~, and so on) , then it's up to us to understand how the minigame works. Very often it comes down to using a couple of keys, rarely there is a need to use the entire numeric keypad. The feeling, in general, is precisely that of Nintendo products of the same genre, with a substantial difference as regards the technical realization. There is a second game mode, which simply allows us to try our hand at the tests already unlocked, to try to set records. The graphics of the game are very well done in most cases. The characters are nice, probably drawn on the basis of photographs, full of details and well colored, as per Gameloft tradition. Not all minigames boast the same aesthetic qualities, in fact in some cases we will be faced with small sprites with an approximate design. In any case, we remain very far from the ~essential~ choices made for the various Warioware. As far as the sound is concerned, we have a good selection of music, often short, which emphasize victories and defeats but which add little to the overall experience. Finally, the control system changes with each minigame; but whatever the configuration, the response to inputs is fast and precise. PRO A large number of minigames Good technical realization Fast-paced and fun action AGAINST Audio widely muted A bit limited", "date": "2008-04-22", "grade": "S.V."}