{"name": "Sonic Colours: Ultimate", "ref": "https://multiplayer.it/recensioni/sonic-colours-ultimate-recensione.html", "text": "Are you reading the Sonic Colors: Ultimate review in the hope of finding some color in these all too gray days, dominated by the return from the summer holidays? Even SEGA in 2010 had decided that the blue of the fastest hedgehog in the world was no longer enough (forgive the rhyme) and that it needed at least some company. For this reason he introduced a whole series of colorful aliens, able to renew ideas and gameplay, to which we owe the title of what was the successor of Sonic Unleashed at the time. After the preview dedicated to Sonic Colors: Ultimate, the time has come for the final verdict: after 11 years it is necessary to understand not only how the re-release of a highly appreciated chapter was managed when it first appeared on the market, but also how much still have to say today to the franchise itself. The remaster: lightning fast ideas and good additions Sonic Colors: Ultimate and its protagonists (the one on the left is called Wisp) Sonic Colors: Ultimate is a particular remaster: the developers of Blind Squirrel Entertainment were entrusted with the restoration of a chapter that had somehow remained engraved in the hearts of the players, so much so that later the alien Wisp had also returned elsewhere, for example in Sonic Team Racing. It is therefore an operation with calculated risks all in all (Sonic games sell well): pick up the episode for Nintendo Wii (not the one on Nintendo DS), change its controls, update it to today's resolution up to 4K and republish it on the consoles currently on the market (Nintendo Switch, PlayStation 4, Xbox One and in backwards compatibility also on the next gen). Not only that, because Blind Squirrel Entertainment has also worked on some good additions, which certainly please in a reissue of this type: usually, in fact, we limit ourselves to re-proposing a perfectly identical product, without stuffing it even with mere sops that anyone could all in all to expect, and this in the face of not too low introductory prices. Sonic Colors: Ultimate has thus modified, at least a little, its offer: in part by overhauling part of its contents, in part by enriching them with new additions. We point out, for example, the presence of the rescue points of Tails, in which the historical companion of Sonic runs to rescue him in case of falling into an abyss, bringing him back to the edge of the precipice; or the bonuses linked to the 100 rings collected in a given level, which guarantee not only momentary invincibility, but also much higher scores at the finish line, so as to more easily reach ranks such as A or S. There are even cosmetic items to buy (thankfully without paying real money) between levels: it will be enough to spend the yellow tokens with which players are rewarded as they explore the individual worlds. Nothing to tear your hair out about, but it's still a pleasant intervention. And it is certainly appreciable for the players of our country the addition of dubbing in Italian, which goes alongside the subtitles (the latter already present in the 2010 version on Nintendo Wii). The news, really, didn't even end here, but it is at this point that the uncertainties begin, which we necessarily have to tell you about. Lots of uncertainties Sonic Colors: Ultimate and a section designed to use the blue wisp (which turns Sonic into a cube) In truth, there are many uncertainties related to Sonic Colors: Ultimate, the same ones that leave a bitter taste in the mouth: because what is a decent remaster could easily have turned out to be an excellent or even an excellent revision. In any case, let's start from some points already analysed: for example from the dubbing. Good that there is, but it is impossible to overlook the problems related to mixing, with the voices of some characters at times truly incomprehensible, because they are overwhelmed by the soundtrack (this is the case with Eggman, Sonic instead is too vain to let his voice risk go unheard). Even the texts of the translation into Italian (remade from scratch) show many inaccuracies and uncertainties; the transition films between one level and another are literally unwatchable, which have undergone an upscaling process without any care, thus resulting ugly, grainy and in complete antithesis with the actual game, that yes in high definition, and discreetly cared for from the point of view of the new lighting system. Graphically Sonic Colors: Ultimate gets along very well, the problem is the movies Do not think that the uncertainties end there. In fact, you must know that the player, if desired, can reconfigure the gamepad keys: this does not, however, make the porcospino much more comfortable or precise, although compared to the Wii version (yes) there is still an abyss. It is above all the stages of the levels bristling with curves, where you have to drift, that are perplexing: Was it really not possible to improve the input system? And why the hell is Sonic only controllable with the analog sticks and not with the d-pad as well? Playstation 4 trophies Naturally Sonic Colors: Ultimate arrives on Sony consoles bringing with it the awaited trophy list; it is not yet clear whether there will be two separate ones for PlayStation 4 and PlayStation 5, or if you will opt for a single shared list. In any case, get ready to explore the SEGA title 100%, which will require you to play and replay all the levels present countless times, even to get S-ranks. Return of the Wisps Fortunately, in Sonic Colors: Ultimate, in addition to the six well-kept and moderately inspired game worlds, the Wisp are also back, the nice colored aliens who guarantee the protagonist unprecedented powers. The short sessions of the levels in which their use is required are on balance the most original and (almost always) satisfying ones: jumping into the air with the rocket (orange Wisp) and then going down slowly collecting as many rings as possible, for example, gives still his satisfactions; just as it is satisfying to take a pink Wisp and transform into a rotating blade that follows every flat surface available: in this way you can easily scale vertical walls, slaughtering every enemy along the way. The jade-colored Wisp, a newcomer to the family, is instead extremely situational: but crossing walls and being ignored by enemies can still have its why. Sonic Colors: Ultimate offers sessions in which horizontal and vertical scrolling alternate, but always in 3D (nothing has been carried over from Sonic Colors for Nintendo DS, and that's a shame): it's a bit like what they've been doing, since 2010 to present, the main titles in the series. Clearly some levels, especially among the initial ones, do not shine for level design or inventiveness, but the developers have recovered with the fascinating Sweet Mountain and certainly with the aquatic world. The boss fights, on the other hand, remain anonymous and confusing, net of the final one, about which however, just to be safe, we prefer not to tell you anything. Perhaps you have never played the first Sonic Colors, and then it seems cruel to us to deprive you of the pleasure of discovery for free.", "date": "2021-09-01", "grade": "7.0"}