{"name": "Warriors Orochi - Recensione", "ref": "https://multiplayer.it/recensioni/warriors-orochi-recensione_b.html", "text": "Control is everything The control system immediately annoys: using the keyboard is a drama. In addition to the movement keys, you need to map the four keys to attack, the jump key, the four keys to move the camera and the keys to change characters during the action. The PCist instinct pushes us to hold the mouse, but we are disappointed: it doesn't move; that is, it is not mappable. Only the keyboard can be used. We try to play but, having only two hands and not four, the effect is quite explosive, not to mention depressing. We exit the game and attach the Xbox 360 joypad to the PC. If math isn't an opinion, the game being a port from Xbox 360, this joypad should be ideal for gaming. In fact, it configures itself automatically but it doesn't recognize the right analog lever. That is, it recognizes only one axis (the vertical one). So are we forced to play without the ability to move the camera left and right? It would seem so. Let's try a second joypad from a different brand. Again it does not recognize the right analog stick. We know that the question you are asking yourself is: is it so much to move the camera in a video game like this? Unfortunately yes due to a bad design choice. Wanting to put the emphasis on the fights, the developers decided to close the shot on the main character (perhaps also not to show the settings lacking in detail and generally ugly) thus making the field of vision extremely limited. This means that it is difficult to explore the scenarios for extras using only the basic shot and looking around is therefore essential. We just have to go back to the keyboard and hire someone to lend us a pair of hands to handle all the keys. The cauldron As we mentioned in the first paragraph, the game is practically a fighting game in which you fight against dozens of enemies at the same time by increasing the body counter in the lower right corner. Of course, you can accumulate experience points, you can use the various characters with their peculiar styles and their special attacks, you can collect bonuses that facilitate the massacre (greater speed, more power, recharge of the energy bar of special attacks and so on) , you can collect extra weapons and fuse them to increase their power using experience points and there are bosses that require more hits to be knocked down and which, apparently, can use special techniques. Honestly it's not much, above all because the game structure is quite incomplete in several points. In fact, after a few minutes of massacring enemies, you realize some details that are quite annoying and ruin the gaming experience. Conscience probably comes helped by boredom, but when the futility of most of the combos and special attacks becomes evident and when you realize that by shooting in bursts you can go on peacefully, the initial excitement dies definitively and you continue for inertia force. The possibility of changing characters helps little, given that it is not very useful in terms of gameplay and that an enhanced character is enough and advances, with the others only serving to give him time to recharge. In an attempt to add variety, the developers have included the ability to ride and fight on a horse, which can be called with a whistle. Too bad that the enemies can unseat us with a single blow and that, therefore, the fights on horseback last as long as a breath. The same variety of enemies does little to improve the situation, given that the structure does not value them. What do we do with enemies with different attacks when all we have to do to move forward is shoot wildly shredding everything and everyone indiscriminately? At most, you can notice the presence of archers when you receive long-range shots that require you to move the massacre in that direction, in order to remedy the problem as soon as possible. Even the bosses are undervalued for the same reason: it is difficult to understand their strength if they are in the middle of the cauldron of enemies. As the levels progress, things improve, but only slightly. The repetitiveness does not change and at most you have to pay attention to the map to understand where to go in order not to fail the mission due to some event beyond our control. Technically speaking Warriors Orochi is not surprising from a technical point of view either. The characters are well done and the special shots are spectacular enough, but the scenarios are bare, banal and with poorly defined textures. The selectable resolutions are few and do not include the wide onesscreen, despite the fact that it is indicated otherwise on the official website, an incomprehensible choice given that we are still talking about the conversion of a title for Xbox 360. What is missing, however, is ... blood. Forgive us the sadism, but it is absurd to slaughter thousands of enemies and see the battlefields clean and tidy without even a drop of blood left to dirty the ground. Probably keeping all the corpses would have compromised the fluidity on less powerful systems, but thinking of a way to make the fights leave some tangible sign, well, it would have increased the immersion enormously. In this way the general impression is that of excessive asepticity that does not value the efforts made by the player. It's sad to walk around freshly cleared areas and find them completely empty and it's sad to see enemies fly after taking our blows, fall to the ground and disappear into thin air. Comment Warriors Orochi is a bad game that is essentially based on the side aspects of the gameplay, or on everything related to the growth of the characters. In fact, the only reason of interest to get to the end of the game is to upgrade the heroes. There is nothing else, given that the action gets boring from the first map. If you think this is enough to amuse you, take a seat, while everyone else can click elsewhere and change the article. Pros The character growth system If you don't get bored playing, it lasts a long time There are many selectable characters (77 in total) Cons The controls can give more than a few problems Repetitive from the first game Technically poor Confusing and not very satisfying PC - System Requirements Minimum Requirements Operating System: Windows XP/Vista Processor: Pentium 1.6 GHz or AMD equivalent RAM: 256 MB Video Card: DirectX 9.0c compatible and equipped with 64MB of DirectX 9.0c memory 6.0 GB of hard disk space Recommended Processor : Pentium 2.6 GHz or AMD equivalent RAM: 512 MB Video Card: DirectX 9.0c compatible and equipped with 128MB of memory Test Configuration Processor: Intel Quad-Core Q6600 RAM: 3 GB Video Card: NVIDIA GeForce 8800 GT with 512MB of memory Warriors Orochi is available for PC, PlayStation 2, PSP, Xbox 360. The tested version is the PC one. Shoot shoot shoot shoot. Take a few steps. Shoot shoot shoot. What is it about? But of the complete solution of Warriors Orochi, the first game that causes bed sores from excessive button smashing. The genre is that of Dynasty Warriors, with large battlefields, profusion of enemies, scattered bosses and various extras to be acquired during the various missions. Unfortunately, the repetitiveness is also the same and the developers have not managed to dampen it in any way. But let's not accelerate too much and calmly see what's wrong with this Japanese production, a port of a title previously released for Xbox 360 and PS2. The story is, more or less: Orochi, the bad guy of the moment, wants to dominate the world. To stop him, a bunch of very powerful warriors and with very different fighting styles take the field. That's all. It's not much? Well, let's say that the narrative cue is not the most original, to be good, but you certainly can't bury a title just for this. Starting the game, optimism pervades the spirit of the poor editor, who writes reviews by candlelight and occasionally needs the sun: in fact, you have to choose a group of three characters, who will be interchangeable during the action, between a real and its own army of warriors, all very different from each other, but which we can divide into three large groups: the powerful, the fast and the center-weighted mediums. As you may have understood, the members of the first group are strong and slow characters who do fearsome damage to enemies; the members of the second group, on the other hand, are agile and quick characters who take hours to kill a giant mouse; while the members of the third group are the classic all-rounder middle ground. Once the choice is made, the game begins.", "date": "2008-04-17", "grade": null}