{"name": "Pirates' Den", "ref": "https://multiplayer.it/recensioni/pirates-den.html", "text": "Beyond the elements mentioned at the beginning, there are few developers who have really tried to introduce something new in poker and blackjack simulations. Gameleons therefore tries to take this important step, offering us a truly atypical videogame: Pirates' Den. The game immerses us in the atmosphere of pirates, in particular of the meeting places for these sea brigands, places where they spent their time gambling and using dice. And here is the novelty: we will find ourselves playing poker and blackjack, of course, but using dice instead of cards. From the start screen we can start a quick game, with random settings, try our hand at a ~one-on-one~ poker game or start a career. The latter is the most substantial mode of Pirates' Den, in fact it sees us cross a large number of seaports with the aim of enriching ourselves at the expense of the pirates we will meet. From game to game, we will go from poker to blackjack and we will have to break the bank a good number of opponents before we feel completely fulfilled. Ok, but how does it work? In blackjack, as is known, the aim of each player is to reach twenty-one through a mechanism very similar to that of our ~seven and a half~ (also called ~seven-and-a-half~, when it comes to advertising beer). In Pirates' Den, this translates into rolling a pair of dice twice and adding up the result. You can decide whether or not to exclude one of the dice from the total, and you have to get closer to twenty-one than your opponent. Since these are two rolls, you can up the stakes and possibly reap the rewards once the second roll is made. As far as poker is concerned, it is clear that the dice cannot reproduce all the cards, but only those from one to six. We will roll five dice, then decide which ones to keep and which ones to roll again. It is clear that at the end we will count the pairs, the double pairs, the three of a kind and whatever else we have totaled to see who, between us and our opponent, has the winning hand. The game has a truly original graphic setting, with characters drawn and colored in a bizarre, pictorial style never seen before in a video game. Each pirate is well characterized and has a nickname that describes his physical defects, and also expresses himself in a picturesque language. We have an excellent use of colors, therefore, but on the other hand a general lack of animations and a sound sector (with independently adjustable volume) capable of accompanying the action in a discreet way, but nothing more. The artificial intelligence of the opponents is well taken care of, let's say it falls within the average of various mobile poker games. PRO Original basic idea Unique graphic style Different modes available AGAINST Limited Not recommended for poker or blackjack purists Sometimes boring", "date": "2008-04-10", "grade": "S.V."}