{"name": "Condemned 2: Bloodshot - Recensione", "ref": "https://multiplayer.it/recensioni/condemned-2-bloodshot-recensione.html", "text": "Less horror, more investigations! In the inevitable evolution that shooters are undergoing in recent years, Condemned is one of those titles to which the definition of FPS is certainly narrower and the Monolith's will to contaminate the basic structure of the genre, in this Bloodshot, becomes even more evident . As in the prequel, most of the clashes are decided with the objects that can be recovered from the various settings and, failing that, with bare hands. The importance of melee combat is marked even more decisively. The first level is nothing more than a long tutorial in which we are taught all the combos that it is possible to carry out and which are essential to be able to survive, also thanks to the excellent Artificial Intelligence that animates our opponents, able to repair themselves, go to look for objects to throw and, even, to jump down from balconies and parapets in search of a refuge. Parries, countermoves and the sequences of punches and kicks become one of the most important instruments of death in the game, which is certainly not stingy with firearms, which however, in a shot of true coherence, are not randomly collected left and right, but which must be recovered from the enemies and which become commonly available only in the advanced stages, when the bums of the first levels leave room for other opponents who we leave you with the surprise of discovering for yourself. The illness and anguish that pervaded the first episode here are diluted in favor of the more adventurous element Less horror, more investigations! The investigations are back, only this time they are enriched by the need to examine the backdrops, the corpses and objects at the crime scene with a light scanner and a camera and a multiple response system in which one must move thanks to the intuition and the spirit of 'observation. The correctness of the answers depends on the evaluation that is given to us from time to time and which, together with the discovery of all the secret elements hidden in the stages, determines the object or the bonus ability that is released at the end of the level (you go from shoes with rubber soles, to the puncher, to the bulletproof vest). Examining the hole of a bullet in a body, getting to determine if it is an incoming or outgoing hole, the type of weapon or the identity of the victim, are all fun elements that give depth to the game system. It is a pity that the occasions in which to do so are not very many and that there are only a handful of those in which one really has to embark on explorations of the seabed to the millimeter. The idea is good, only that the game designers should have given it more space. The sickness and anguish that pervaded the first episode here are diluted in favor of the more adventurous element, however giving a nice boost to the gameplay, which is really solid, and to the variety of locations which, although damn obscure, vary a lot here more easily between snowy mountains, cargo ships and classic offices populated by creepy monsters. These settings, some of which obviously mention Bioshock, could have been put to greater use, and are animated by breathtaking chases and even stealth sections a la Splinter Cell, which however are barely mentioned. The game, at first glance, seems very challenging, and in fact it would be, only that after each death you return to the previous checkpoint with all the energy restored and not with the one you had when you crossed it. Going to disperse the feeling of danger and fear a little, and making the longevity settle at about ten hours. Even the multiplayer in the shade In Bloodshot the Monoliths insert multiplayer which, given the results, doesn't do much to extend the longevity of the game. The mechanics are the same as the single game, with weapons and, above all, many punches and objects remedied by collecting them from the arenas, which are 9. In addition to the single and team Deathmatch there are two modes which are called Race of the Bums, basically a contest to survive in a scenario, and Crime Scene. In this the players are divided into two teams, one of special agents and the other of deviants, who must, respectively, hide the boxes and the other find them. Each deviant has a box and must leave it in one place and check that the agents do not find it and, if necessary, attack them to stop them (but without knowing where the other players have left the other boxes). Since the deviants have no weapons, the only possibility is to hide in the shadows to attack the agents and put the boxes in a safe place, given that the games are timed, after which, the deviants win if they have not been found all tests. In addition to multiplayer, the other novelty is a Fight modeClub in which, in different settings taken from the levels of the game, you have to score higher and higher before you die. How to deactivate 100 of the hell dolls that you meet in one of the most beautiful stages of Condemned 2: Bloodshot. Even the multiplayer in the shade A Nightmare of Special Effects Monolith has come a long way with the Condemned engine. Between defined textures and expertly used lights, the darkness that pervades the world of detective Thomas manages to be disturbing like few others. Not all locations are of the same quality level, but the use that the team has been able to make of post-processing effects, blur and a thousand other gadgets truly manages to return a unique experience. In some situations you will find yourself manipulating the brightness of the image, it has been dark for so long, but when it manages to show itself, Bloodshot is quite a good show. The commentary on the audio side was also very positive, above all thanks to the sound effects, always of a good standard, and the original voices. All subtitled in Italian, albeit with some minor omissions in the cut scenes, where sometimes some parts of the period do not appear in the Italian translation. Comment Agent Ethan Thomas is back with his ghosts, the most terrible monsters, but above all, with the desire of the Monoliths to enrich the FPS structure with unconventional elements. Condemned is confirmed as one of the most interesting sagas facing NextGen and improves the previous chapter in almost every respect, starting from hand-to-hand combat, up to the investigations which, if only they weren't so few, would be a game within the game. The only sector in which it loses something, and for some it may be important, is that of the horror atmosphere, which is dispersed a little in favor of purer action and much more varied mechanics than in the prequel. He still lacks something to compete with the masterpieces of recent years, but we can do nothing but invite you to take a look at him, while we wait to find out what happens to one of the most beaten policemen in the world of video games. Pros The combos in the fights The lights and effects The investigations... Cons ...which are few The multiplayer The checkpoint system It's less scary Xbox 360 - Goals Condemned 2 is rather stingy with points, on the first pass. After finishing it on normal level, we ended up with around 150 of the 1000 achievement points. To get the most out of it, you have to play online, at Fight Club and, above all, try to find all the hidden objects in the levels and play the Subjective mode, which is nothing more than a further level of difficulty that is unlocked after finishing the game.", "date": "2008-04-04", "grade": null}