{"name": "FlatOut: Head On - Recensione", "ref": "https://multiplayer.it/recensioni/flatout-head-on-recensione.html", "text": "violence! There are several game modes that we can access from the start screen. First there is the Carnage Mode, or thirty-six skill tests that are gradually unlocked and which see us engaged in truly eccentric activities, which often involve the violent death of the driver of our car: shot out of the windshield to reach certain heights or to knock down pins, as if it were a bowling ball. There is no shortage of derby deathmatches, or races in which you collide with other cars until they are all destroyed and only one capable of moving remains. The goal of Carnage Mode is simply to score as many points as possible, with a view to a short and carefree engagement. Of a completely different nature is the FlatOut Mode, a real career mode in which you move between three (four, actually) categories, each consisting of a total of almost twenty different races, which are unlocked gradually and are divided between normal races (in which you have to cross the finish line first) and tests of various kinds. To access each category you need to have an adequate car, but it is clear that limited finances will allow us, at the beginning, to try our hand only with the ~derby~ category, dominated by cheap and wrecked cars. Winning a race means earning money, which can then be spent to upgrade the car (with all the necessary details: engine, exhaust, gearbox, tyres, suspension, brakes and bodywork) or to buy a better one. The difficulty increases from event to event, so it will often be a must to upgrade the vehicle in order not to be outclassed by the opponents. It is interesting to note that each race is divided into several single races (so these are in all respects small score tournaments) but that the upgrade shop or dealer can also be accessed between sessions if necessary. Once we have collected a nice nest egg, we will have the opportunity to buy a car of a different category and try our hand at other races, climbing the rankings and demonstrating our skills to all our opponents. The framework of the modalities is completed by the presence of the single events (you can choose the single race, the single stunt, the single derby to face) and by a wireless multiplayer both locally and online. Cut the curves! Despite the strong arcade connotation, FlatOut: Head On boasts a fairly accurate representation of the behavior of front, rear or all-wheel drive cars. Each car is described through different parameters of speed, acceleration, control and resistance, parameters that can be modified through the upgrade. In this sense there is a sort of ~safe limit~, in the sense that you will hardly find the cheap car which, suitably modified, turns into a rocket and burns much more expensive vehicles. However, as mentioned above, upgrading is a necessary practice if you want to win, particularly if you often find yourself in the position of having to make up lost ground due to crashes. Collisions are the order of the day in FlatOut, that's for sure, and destroying the landscape in multiple ways leads to a growing nitro bar. Crashing into an immovable obstacle, however, is far from desirable: the pilot is shot from the windshield and smeared against the wall on duty, while you have to press the Triangle button to get back on track. The general impression is that repositioning is used too often, because the collision detection is not as precise as in the Xbox 360 version of the game and because the car control does not seem to have been optimized for the PSP analog stick: the answer to solicitations is not immediate, therefore to face the curves it is often necessary to operate rapid ~thrusts~ of the steering. From this point of view, the nitro has a very important function: not only does it allow us to obtain instant acceleration (especially useful when returning from an accident), but it also represents a ~coupling~ which pulls the car forward when we finish long in a curve. Stick aside, the control system performs very well, using a classic configuration: X button to accelerate, Square to brake, Circle to operate the handbrake. The nitro is activated with the backbone R, while the backbone L shows us what is happening behind our car where the Select button allows us to change the view among the four available. Technical realization Having to translate the graphics seen on the Xbox 360 on the PSP screen, the developers inevitably had to make some cuts. The vehicles have not been touched, as they still have rather complex polygonal models, equipped withexternal parts that ~disassemble~ with each impact, showing a gradual degeneration of the bodywork. The physics of the objects also seems to have remained mostly unchanged, which certainly requires a great use of resources: it must be borne in mind that in the game you collide with other cars and/or with elements of the landscape continuously, and that the interactable objects are so many. The cuts have been made on the tracks, which show simpler polygonal structures and, above all, low quality textures. In some cases, for example when running in a forest, the ~blur~ effect on the landscape improves the perception of it, making it almost photorealistic. The urban scenarios are decidedly less successful, unfortunately, and the frame rate is far from solid: generally the graphics flow quite smoothly, but the drops are very frequent. The action is accompanied by a signed soundtrack, composed of not very numerous rock songs, basically repetitive, and by well-made, fairly realistic effects. Comment There was a need for a game like FlatOut: Head On on the PSP. A product characterized by an excellent technical realization, which manages to deal with the Xbox 360 version without giving up too many things and which, above all, offers us a respectable choice as regards the available modes. Beyond the Carnage Mode and its skill tests, which represent entertainment without particular depth, the FlatOut Mode is really rich in substance between categories, races, upgrades and cars to buy. If we add to this a multiplayer that is not essential but very interesting, it is clear that this (yet another?) new version of FlatOut 2 lacks nothing. Just a shame about the analog control which seems to have not been optimized for use with the Sony portable console and therefore requires some practice. Pros Two great modes, lots of racing Fun and addictive Technically great... Cons ...shame about the frame rate drops Poorly optimized analog control Repetitive soundtrack", "date": "2008-04-08", "grade": null}