{"name": "Mega Man ZX Advent - Recensione", "ref": "https://multiplayer.it/recensioni/mega-man-zx-advent-recensione.html", "text": "Since the first episodes for the NES, Mega Man has come a long way: the series has evolved according to Japanese standards, so a main story has been built, numerous characters have made their appearances and everything has been given a style ~ anime~ quite modern and addictive. Mega Man ZX Advent is but the latest exponent of this new philosophy, and tells us the adventures of an atypical Mega Man model (Grey or Ashe, male or female, our choice) who is awakened by chance and is greeted by a group of bounty hunters. The world is in turmoil, there are whole armies of mechanical creatures (the Mavericks) who have conquered the cities and behind them hides the will of a mysterious scientist, who has created his own group of Mega Man to reign supreme. The experimental model In the role of the protagonist, we will soon discover that our character has different abilities from all the other Mega Man, that is, he can copy the data of his opponents to take possession of their external form as well as their powers. As soon as a boss is defeated, the transformation system is enriched with a new option and therefore we can acquire the form of another Mega Man or one of the biomechanical creatures we have come across. It is not a limited number of transformations, far from it: having reached almost four hours of play, we have counted fourteen different forms and certainly there are others to acquire. The structure of Mega Man ZX Advent puts us in a position to exploit the capabilities of our transformations to move forward in the stages. Each form has different attacks and special moves, but also peculiar abilities concerning movement: some can glide or cling to platforms, others are equipped with radar for objects to collect, still others can destroy barriers or attach themselves to columns such as creepers. It is a fundamental element in the gameplay, which greatly increases the thickness and variety: you must not only go forward and eliminate your opponents, but also think about what ability you need to overcome a certain obstacle. Game structure Unlike the previous Mega Man ZX, in Advent the RPG elements are present to a minimum and there is a greater emphasis on pure action. In any case, dialogue with the characters remains an important practice, which can open the way to otherwise inaccessible stages or give us the opportunity to accept recovery missions. The money earned by completing the internships is not used to enhance the character, but to make donations to characters who, with their work, can dig channels that lead us to secret areas of the map. Our position and that of the various locations are displayed on the lower screen of the DS, and to reach an already explored point again we can use a teleportation system. Returning to already beaten paths will become a must in the second half of the game, when we will have to think about which stages we have not completed and which skills we lack to open a door or activate a switch. Quite often, rooms containing a teleporter can also allow us to save the position. Technical realization Strongly anchored to 2D, the graphics of the game are really excellent, especially in terms of quantity and attention to detail. Our character doesn't have smooth animation, that's true, but the total of characters and enemies present is really huge. There is no lack of care for seemingly unimportant things: the enemies explode if we shoot them and end up in pieces if we hit them with a blade. The design of the bosses is always at a high level, and the characterization of the various Mega Man and the biomechanical creatures whose shape we will be able to reproduce is also exceptional. The locations are very beautiful and very different from each other, there is no shortage of ~labyrinths~ that must be solved by activating switches. The use of colors is always excellent and the short animated cutscenes are always engaging. In short, the developers have really done a slap-up job, and the slowdowns can really be counted on the fingers of one hand. Any fan of bitmap graphics couldn't help but be thrilled. The sound sector stands out less, above all due to too discreet music, which is barely noticeable and does not remain in the head. On the other hand, the effects are always interesting and sometimes even recall something famous (the lasers of the enemies that mimic those of Star Wars, for example...). The game has only one multiplayer mode, with a minigame that must be played with a friend in wireless play and adding virtually nothing to the package. Comment Mega Man ZX Advent is really a great two-dimensional action game. Made with care, but above all with exceptional gameplay, which is based on the transformation of the protagonist into many different forms, each with its own characteristics both in terms of offensive maneuvers and movement. The plot is engaging, typically Japanese, with our Mega Man who remembers nothing of his existence and desperately seeks information about him, receiving only fragments after defeating the bosses. Capcom proves once again that it is the undisputed master in certain videogame genres, and that 2D can still give a lot if done in a workmanlike manner, introducing elements that vary the action and make it more interesting. A product recommended to everyone, or almost. Pros: Playable, diverse and addictive Technically excellent A large number of forms, enemies and characters Cons: Maybe a little short Poor in terms of multiplayer If you don't like 2D action games...", "date": "2008-04-07", "grade": null}