{"name": "Vampires Dawn: Deceit of Heretics", "ref": "https://multiplayer.it/recensioni/vampires-dawn-deceit-of-heretics.html", "text": "We have already talked about how the role-playing game genre has found a second youth on mobile phones, given the technical possibilities of the latest devices. In practice, on the screen of our phone it is possible to play a classic RPG, such as those that were very popular on 16-bit consoles, without limitations as regards the length and number of quests, with a management of objects and fights that it has nothing to envy to the latest titles (also because, let's face it, there hasn't been a real evolution of the genre yet, if not of a technical nature). In the first sequences of Vampires Dawn we witness the extermination of a family by the father, who has turned into a vampire. The only survivor is little Lara, who thanks to the interference of another vampire, Vince, does not die from the bite but is in turn transformed into a creature of the night. Vince decides to take her with him, and this is how the initial team that we will control in the game is formed, formed by the two vampires and two skeletal helpers. The story will see the clash between our group and different factions of bloodsuckers, based on a rather classic structure, with the acquisition of quests through dialogue with other characters and movement in the four directions within more or less large locations . The fights take place with a turn-based system, we can decide to attack (with weapons or magic) or defend ourselves, even if the strategic elements are severely limited and the rule is often to level the characters and equip them with good weapons instead of studying an offensive approach , impossible to apply. The dialogues are numerous and play their role well, that is, they immerse the player in the adventure, with the only drawback being too simplistic and trivial on more than one occasion. The various characters have unique needs: Vince and Lara have to drink blood, their helpers have to kill people to feed on their life force. If you do not satisfy them, you will find yourself with reduced offensive possibilities. As far as mission management is concerned, we will be able to refer to a diary at any time which will indicate what to do to continue in the game, so it will be difficult to get stuck. The realization turns out to be slightly below the average. The character design, in particular, often turns out to be mediocre in the design of the faces. The sprites have just enough animation and move within stages that are not very populated or rich in details, afflicted by a general repetitiveness of the graphic elements. The texts are quite legible and the interface is simple and intuitive. The sound compartment is made up of fairly good quality MIDI music, with adjustable volume, but which too often are decidedly ~out of context~. PRO Funny dialogues Lots of items, lots of quests Solid construction... AGAINST ...but quite limited Technically mediocre Music often out of context", "date": "2008-04-09", "grade": "S.V."}