{"name": "Rambo Forever", "ref": "https://multiplayer.it/recensioni/rambo-forever.html", "text": "Despite being an icon of the 80s, known by all, the character of Rambo has inspired very few video games, none that deserves to be remembered. Perhaps the best tie-in was the one made for arcades, namely Rambo III: complete with Uzi connected to the cabinet, it was a crosshair shooter to play alone or with a friend (who played the role of Trautman) , well done and quite entertaining. Perhaps, therefore, it is no coincidence that the developers of Rambo Forever have decided to resume precisely that game structure, so suited to the issues addressed and to the concept of ~one against all~, but at the same time bound by numerous limitations. The rules of the game are simple: in the role (a few) of Rambo, we will have to face a series of missions with the sole purpose of eliminating anything that moves on the screen. Using the joystick we can move the viewfinder in four directions, with an increasing acceleration system to better cover distances, while the 5 key is used to open or close fire. The only other button to use is 0, which allows us to throw grenades (if we have any) or to enter ~blind rage~ mode after we have filled the appropriate bars. The background scrolls sideways and the various enemies gradually appear, on foot or stationed in different ways, on several floors and at different distances. After a few moments from their appearance, they will start shooting at us and taking their attacks will result not only in the loss of energy, but also in the interruption of the fire, which must be immediately restored. So it's all a matter of speed and quick reflexes: you have to hit enemies as soon as they appear and only later take care of buildings and anything else is just a bonus. Compared to Rambo III, the arcade, this episode for mobile phones has a more limited structure: our character cannot move, in fact, and therefore the ~action~ dynamics typical of games such as Sunset Riders are missing, one cannot avoid the enemy fire and therefore you can only strike first, taking advantage of any bonus that is dropped on the ground. The technical realization is of an excellent level: the graphics boast detailed sprites, animated discreetly, with an excellent use of colours. The most surprising thing is the optimization of resources, in the sense that there is no slowdown despite the large number of animated objects present on the screen at the same time. The stages are different from each other and boast a great design. As far as the sound is concerned, we have fairly good MIDI music, which accompanies the action without disturbing even though it is far from unforgettable. The control system responds promptly to inputs, even if the interruption of fire following damage often results in episodes of frustration, because some joysticks must be operated with two fingers and in that case you have to press the 5 button again. PRO Great graphics Well differentiated stages Immediate and fun... AGAINST ...albeit very limited Repetitive mechanics Without thickness", "date": "2008-04-03", "grade": "S.V."}