{"name": "WWE: Day of Reckoning", "ref": "https://multiplayer.it/recensioni/wwe-day-of-reckoning.html", "text": "The warmth of a hug As anticipated, the strength of WWE: DoR must be found in the game system, already dear to fans of the series, refined and revised for the occasion with the intention of reaching the maximum peaks of dynamism during matches. The control system takes up the mechanisms of the well-tested Aki Grapple System, and adds new ingredients to the recipe. Briefly and for those unfamiliar with the saga we explain the main rules of the game system. The big A button is assigned to grappling and the B button to striking. Holding down the keys results in a grab and hard hit, respectively. With the stick we can decide the type of hit/grip to perform (always in combination with the weak/strong choice). The heart of the game lies here. As elementary as this system may appear, it is the flagship of the series, also considering that this system adapts to the type of situation currently present in the ring: opponent from behind, on the ground, near the ropes, in the corner and so on. Street. The other keys are dedicated to running, and to performing other actions essential to the show. One of the exclusives of this episode is the ~Momentum Shift~, which allows you in really critical situations for your athlete, to perform an impropriety against the opponent and recover the grit necessary perhaps to close the match in your favor. This move together with the ~Specials~ allow you to make the encounters rather unpredictable. Furthermore, by means of an icon you will always be aware of the health status of the athletes (and their body parts). Hit an opponent repeatedly in the same spot and you will see both the athlete conspicuously cover the injured part, and the indicator which will light up in progression of a different series of colors until it reaches a worrying bright red. Also in this episode, a system linked to the weight of the wrestlers has been included, the ~Momentum Lift~: if you try to lift an opponent who is too heavy for your athlete, an icon will appear on the screen inviting you to fumble desperately on the ~A~ button.  to be able to lift the opponent in the required time, under penalty of the opponent's counter-move. Just the counter-moves make the game a real jewel, and they also reflect what has already been seen in similar productions. With ~L~ you release yourself from a hold, and with ~R~ you block yourself from a blow: it's useless to fiddle around at random, the game only rewards precision. The system of holds and counter-holds sometimes (if we are good enough and performing) delights us with some exciting moments, with a succession of truly exciting counter-moves. Although we can be considered totally satisfied with the gameplay item, the game is not free from defects, which mostly consist of some collision errors, especially with regard to running shots. It can happen, indeed it will certainly happen, that the shots that should hit the mark, in reality will totally miss the target. With a little practice, however, you will be able to understand when it is convenient to attempt the attack or when it is not really the case. Lost in a glass of water You can create the best gaming system in the world but if you don't apply it to a solid and interesting structure, you waste an opportunity. And that's what WWE was about to achieve. Once the Story mode is over, quite exciting at least by playing it for the first time, there is not much else left to do, if not for exhibition matches, which, although they provide an adequate number of choices, are not able to excite as much as a real tournament. Surely there is a lack of other tournaments, perhaps customizable, to play once the story mode is over. What is even more perplexing is the awareness that the game's major flaw derives from such a banality. The thought that they are precise choices dictated by the fact of having to place other copies with subsequent releases sincerely springs to mind. Back to us, it's time to talk about the core mode of WWE, the Story Mode. In the role of an unknown athlete, which you will have to create by means of the pharaonic editor, you will have to make your way through the various sports leagues. After following your manager's advice, you will have the option of signing a contract with either RAW or SmackDown. In reality the story will be identical for both leagues by changing only the characters with which you will recite the usual soap operas of the TV show. A peculiarity of the game is that some matches have certain requirements to be completed successfully, and they can consist of things such as performing your finishing move, or using aerial moves, or even letting your Tag partner close the match. At the end of eachmeeting you will be rewarded with ringing dollars, and some experience points to use to pump your character. Through the shop, on the other hand, you can indulge your spending instincts and buy various bonuses, such as arenas, move sets (which also belong to athletes not included in the DoR roster!), and some clothing items to use in the editor of the athletes. Among the characters included in the SmackDown roster we find names of undoubted thickness such as ~The Rock~, ~Undertaker~, ~Rey Misterio~, the relatives ~Guerriero~, ~Kane~, ~Kurt Angle~ and several others. It is also true that several well-known athletes are missing. For those who want to thanks to the superb editor (it's really something manic), and thanks to the sets of moves ready in the shop, it will be possible to create any wrestlers excluded. Comment If you've been waiting for some good cube wrestling, it's time to open your wallet. In fact, we can be considered fully satisfied with the game system of this DoR, which sins ~only~ in the scarce game options. A more articulated and dynamic story mode would have given a few more hours of fun, and the inclusion of other tournaments would have done the rest. Instead we have in our hands a title of great caliber, however undermined by a rather poor longevity and not up to the rest of the production, which heavily affects the final evaluation, which otherwise would easily settle at a higher point. In short, after the game, either start over, or it's time to call your friends. Pros: Good technical realization Flawless game system The editor is immense Cons: Only the story mode Which doesn't even last too long We are already in the third chapter on GameCube of the now established Wrestling THQ saga which has been coming out at regular intervals on all available consoles for several years. And with the third round, THQ also scores a basket on GameCube; the ball hit the backboard and he had some luck with the rebound on the rim, but in the end the two points arrived. If on the one hand, in fact, the latest effort by the Yukes offers a truly excellent gameplay system, on the other, such delight is mounted on a rather slender, short, and incapable of enhancing the game as it deserves.", "date": "2004-11-08", "grade": null}