{"name": "Miami Nights: Singles in the City - Recensione", "ref": "https://multiplayer.it/recensioni/miami-nights-singles-in-the-city-recensione.html", "text": "The Sims et sim-ilia business has reached truly remarkable proportions in recent years, and it seems to have found its platform of choice on the Nintendo DS. Having lost the purely experimental character of the first interpretation of Will Wright's ~life simulation~, these games have proved to be highly successful entertainment for a wider audience than that constituted by typical video gamers. The management of life on the screen, a mixture of voyeurism and delusions of omnipotence, is something that also attracts those who have very little to do with the actual video game: these products leverage the charm of collecting, transformism and the simple contemplation of a digitally reproduced micro-cosm. From the fundamental root constituted by The Sims, different interpretations of the original simulation scheme have been derived, each based on certain aspects of life: this Miami Nights  Singles in the City, as the title rather clearly suggests, deals with men and women looking of success, and of social affirmation: in two words, money and fame (sex, although constantly mentioned, is actually not very present). The cut given to the game is certainly adult, although Gameloft has done everything, even at the cost of the same general coherence of the product, in order not to disturb too many taboos or show more than what is allowed by parental common sense that keeps the world at bay video game. The result is a title that seems to veer strongly on incandescent, sometimes even excessive, themes, while trying to keep the handbrake on so as not to run into censorship problems: a rather hypocritical chastity, given that all the time you play on easy relationships with the opposite sex or unconventional means to achieve success. Single life Those who have played Singles on PC already have a rather clear idea of what they will be able to face with this Ubisoft product, although here the simulation side is strongly subjugated to the ~playful~ one, with the dutiful introduction of the typical mini-games Nintendo DS, used in abundance to somehow fill the small game structure. The question is simple: at the beginning we choose whether to play a man or a woman, we modify it through a rather simple editor, and we launch ourselves into life with the character thus created, with the sole aim of becoming rich and famous. You can choose the sector in which to concentrate your career (actor / actress, singer, model / a) even if this choice does not imply major changes in the course of the game, since the actions we will find ourselves undertaking are often completely disconnected from the character's ultimate goal. It is therefore a question of guiding our avatar within the city of Miami (obviously, only a few locations can be reached, however rather small in size and not in large numbers), making our way through society to the tune of part-time jobs and occasional relationships with the other characters. The play area, in 3D, is displayed in isometric (with camera zoom), and by approaching the various sensitive points of the scenario we will be able to undertake various actions (for example: in the bathroom, by approaching the shower we will be able to use it to wash, the same applies for the sink, where you can also choose to put on make-up or do your hair). There is the typical ~physiological~ management of our creature, whose situation is displayed by bars indicating the level of various vital parameters: hunger, sleep, hygiene as regards the natural ones, to which are added sex appeal, charisma, humour, courtesy and related negative parameters as regards interpersonal relationships. Obviously, to manage the former we will have to try to eat, sleep and wash ourselves regularly, while the other parameters depend on a series of different factors: from appearance care (make-up, tanning, haircut, fitness) to the actual management relationships through dialogue. Work and good life Despite the setting similar to The Sims, with parameters to keep under control and physiological needs to manage, Miami Nights turns out to be a decidedly guided game: the choices are practically obligatory, with a guide who continuously tells us what to do, step by step. The latter would then be our neighbor, who evidently has nothing better to do, who will constantly call us to tell us where to find work, which place to go to to find a partner, and generally what to do at any time of the day. The whole game revolves around the principle of raising money and spending it immediately: from simple purchases, such as a used car or the rental of a house, you progressivelyever more unbridled consumerism, up to new cars or yachts, as our earnings increase. All this in pursuit of the myth of the exaggerated lifestyle on which the game is obviously based. The strange thing is that there is no career for our character: regardless of the chosen field of work, we will still find ourselves performing a series of rather menial jobs, compared to the show-business aspirations of our avatar: ice cream seller, dishwasher and the like for most of the time they will be our daily tasks, obviously executable through the inevitable touch screen-based mini-games characteristic of Nintendo DS. The whole game revolves around the principle of making money and spending it quickly Work and good life On the other hand, there is the possibility of interacting with all the characters that we will meet around Miami and with whom it is possible to make a series of choices during the dialogue: ~conversation~, ~flirt~, ~offer~ and attacks are the possible options, which will be followed by a different effect based on our level of charm. Brilliant dialogues are not to be expected, as these do not even appear in superimposition, but that is not the point of the matter: the main thing is the possibility of taking the guy home (man or woman, regardless of the gender of our character ), where strangely we will continue undaunted with the foreplay without ever reaching the ~therefore~. Not to be morbid, but it is rather strange that, in a game entirely based on vida loca and exasperated flirting, one is eternally stuck in foreplay, with a forced chastity that clashes with the general approach manifested everywhere. At one point in the game we will even find ourselves being paid to bathe in a Jacuzzi while our boss watches us, and despite everything Gameloft has carefully avoided showing any nudity (with typical The Sims censorship) or any hint of a ~continuation~ of relationships with casual partners after the first kisses. Not so much an offense to the honest morbidity of the (adult) public, but rather a real nonsense, given the premises on which the video game in question is based. Miami by night The graphic sector of Miami Nights: Singles in the City probably represents the most convincing element of the game, although the judgment is determined more by the demerits of the gameplay than by a real expertise in modeling characters and settings. In any case, even if pixelated and very poorly defined, the characters, from a certain distance, make their right figure, and the scenarios in some cases are distinguished by the amount of elements on the screen and details, despite the playing area is very fragmented, and each zone is not excessively extended. However, the general climate gives a good idea of the ~city of vice~: colorful and cheerful as we imagine Miami to be on this other side of the world. The audio of the game, on the other hand, is completely forgettable: between remixed dance music of terrible quality, and a few, rare sound effects without personality, Miami Nights: Singles in the City confirms itself as a game that can be easily enjoyed with the console's audio reset. Comment It is difficult to find something that really differs from The Sims, and that can be remembered for some impact feature, in the now saturated life simulator market. Among these there is certainly not Miami Nights: Singles in the City, which indeed presents itself as one of the worst interpretations of the ~lifestyle simulator~ which is so fashionable these days. The depth in the management aspect of the character is completely missing, since there are few things to do and we are constantly guided in what we must do, closing all the possibilities in a one-way street that leads to the inevitable conclusion of the game. There is no trace of fun in the proposed gameplay: once the simulation-management component has been eliminated, the proposed mini-games are certainly not enough to build a noteworthy gameplay, and even those who expected a more adult and spicy approach to the structure will be disappointed of The Sims, because although this point of view is flaunted by the title and the cover, and hinted at continuously throughout the game, in reality nothing more gory happens than what can be seen in the Maxis game. Recommended, but with reservations, only for those who can't do without the genre and have nothing else to play at the moment. Pros: Good setting design Can appeal to Sims fans Cons: Monotonous and not very fun Extremely driven Practically non-existent the management component", "date": "2008-03-28", "grade": null}