{"name": "Puzzle Quest: Warlords", "ref": "https://multiplayer.it/recensioni/puzzle-quest-warlords.html", "text": "Puzzle Quest was a real bolt from the blue. Initially released for DS and PSP in 2007 without any hype or advertising push, the product developed by Infinite Interactive soon began to be talked about, finally becoming a real phenomenon that deserves the conversion on Pc, Wii and Xbox 360 And when a game manages to emerge from the crowd thanks only to its own strengths and qualities, then there really must be something tasty underneath. And in fact Puzzle Quest is the classic example of how the final result is really better than the sum of its parts. Basically, in fact, there is really nothing new or striking in the concept created by the programmers: in summary, it is yet another re-edition of the classic Bejeweled, interspersed with simple rpg/adventure sections. But the mix of a sense of progression, constant and continuous challenge and a perfectly balanced level of difficulty made Puzzle Quest the phenomenon it has become. The mobile version, while keeping the gameplay of the console edition intact, is significantly different, offering a slightly different plot and game map, as well as new spells. A positive point able to stimulate even those who have spent hundreds of hours with the original, and which pays tribute to THQ Wireless and the team in charge of the conversion, or rather Universomo. Therefore, even on this occasion it will be necessary to choose your character among druids, knights, magicians and warriors; the differences are to be found in a series of statistics that somehow influence the fights and the spells at one's disposal. We talk about fights, but in reality we are dealing with matches of this already mentioned variant of Bejeweled; the fulcrum of the game is in fact moving around the game map in search of missions of various kinds, discovering the development of the plot and improving one's characteristics. All this through one-on-one battles with opponents such as wolves, orcs, fantasy creatures of all kinds and so on; inside the grid it will therefore be necessary to align (at least) 3 objects of the same color, to thus see them disappear from the game plan to enjoy their benefits and make room for others. The colored spheres allow you to obtain the essential mana for spells, the coins the money for equipment purchases, the purple balls are experience points, while the skulls represent the real attack that affects the enemy's energy bar, up to to make it reach zero which represents victory. A perfect alchemy therefore between simplicity and depth, which also works great on mobile phones. The technical sector is good, with pleasant graphics and more than functional audio. Pros: Excellent game mechanics Simple but profound Valid in every respect Against: Nothing to report", "date": "2008-03-31", "grade": "8.8"}