{"name": "La recensione di Evil Genius", "ref": "https://multiplayer.it/recensioni/la-recensione-di-evil-genius.html", "text": "The heart of evil After a grotesque presentation that immediately immerses us in this surreal parallel world (and loaded with a good dose of irony) and having made the choice of our avatar (3 peculiar subjects that closely resemble James Bond's most classic enemies) , we find ourselves on a semi-desert island with a good bank account to invest in a crime multinational. The first thing to do will be to build our headquarters and what better place than the inside of a mountain expertly adapted to become the beating heart of our evil activities? Building our stronghold will require precision, order and control of all the details Building our stronghold will require precision, order and control of all the details starting with the various connecting corridors, to optimizing the available space. A crime empire needs many things: from a control center, to the interrogation room for prisoners, without forgetting the structures used for the leisure and rest of our men or the freezers for storing corpses and prisons. As I wrote previously, the island is not completely deserted since there will be no shortage of tourists and later also the secret agents of democratic nations who clearly want to stop our plans for power. For the former it will be enough to build luxury hotels, casinos and other places of entertainment to keep them away from our possessions. For the latter, however, we will have to devise hidden traps, control sensors and anything else necessary to keep up the defense of our hideout and I assure you that it will not be easy to stop the assaults of investigators, thieves, saboteurs and soldiers to the point that we will arrive at also use brainwashing to try to ease the tension on us and deliver the wrong news to our enemies. ...and his arms Like any self-respecting criminal mastermind, we too will have to equip ourselves with our own personal army. At the lowest level of our hierarchical scale are the ~simple~ soldiers, unskilled manpower of which we will not even have direct control but after having given an order, they will work to carry it out. However, the ~little men in yellow~ will be able to specialize in various fields (scientific, social and military) and degrees, but since we are not happy if we don't do things in an evil way, forget about training schools or the like: much easier to imprison policemen, waiter and so on, questioning them and acquiring their skills. On a higher step we will find the scientists and researchers, indispensable for the search for new objects up to the definitive weapon capable of bending the will of the nations (but it will take time ...). Every commander also needs good deputies and Evil Genius will not lack rather peculiar subjects (from voodoo sorcerers, to the funkytarro released from the 70s ...) ready to exploit their extraordinary skills and usable even under our direct control. At the top of everything there is clearly he (or she), the evil genius, the one who gives LA to every evil deed that can't be more evil and is even ready to kill his men if in his head only remotely passes the idea that someone does not have blind and total obedience. ...and his arms Let's go, let's go, let's go robbing When our empire of the dark side of the force (sorry I did a crossover) is on solid foundations, we will finally be able to launch our plan of domination on an international scale. Through a map of the globe we will be able to give orders to our men and check the progress of our activities. The ultimate goals of our actions are essentially two (in addition to unlocking new missions): to obtain increasingly higher wealth and acquire fame and notoriety that will exponentially increase our chances of development up to the final weapon. Clearly becoming famous, in every field, also brings with it negative sides. In this case, our ~popularity~ will make the shipments of enemy agents decidedly copious to our island and will force us to implement a very high control so as not to receive unwelcome visits ... It is not too long, in this case, to write that those who commit criminal acts injures, of criminal acts he perishes If we are good at repelling the attacks and in the meantime continue our activities on every continent, after a varied number of hours, we will finally reach the happy (?) ending And finally you will be able to scream without the risk of being taken for megalomaniacs: ~I am defended patron of the world!!!~ Through a world map we will be able to give orders to our men and check the progress of the various activities Crime isn't all pinkand flowers Far be it from me to start a long sociological discussion, the title refers to the limits I found in the work of Elixir Studios. After the long analysis of the game possibilities, you will agree with me that Evil Genius presents an enormous amount of actions to be performed and controlled. However, this depth of play turns out to be a double-edged sword: on the one hand, we must praise the game designers for having created a decidedly innovative alchemy (although it can be broken down into a melting pot of titles among which there is certainly Dungeon Keeper) and a structure composed of many parameters. On the other hand, however, these characteristics could discourage players who are less patient and willing to take into consideration many, many elements of primary importance for the success of the missions. Evil Genius is only suitable for an audience rich in experience on other titles of the genre Crime isn't all sunshine and roses This feeling becomes even more evident when the artificial intelligence begins to rise to decidedly very high levels and which make some levels similar to impossible missions. Nor does the bizarre behavior that some units assume in some situations and which still raise the difficulty help. Although therefore the command interface has been scrupulously created to make the control panel as clear as possible, once again the Elixir have perhaps wanted to exceed to outperform the competition in terms of depth of interaction but this thus limits Evil Genius to a audience very rich experience on other titles of the genre. Crime isn't all sunshine and roses The 60s of the future Before closing and moving on to the final comment, it is necessary to consider the technical aspect. Evil Genius will not be remembered for an impressive number of polygons on screen or even for a very high detail of environments and characters (all this, however, allows it to run even on low-end PCs) but the three-dimensional graphics engine proves to be functional in giving us a truly complete overview of an area. The aesthetic component of the game is also commendable: in addition to an almost maniacal care for the animations (with a varied number of sets for each action), the color palette and the construction of buildings and objects refers to that glamor seen and revised in Austin Powers and also in the No One Lives Forever saga. Those ~futuristic~ 60s will be very kitsch but also decidedly cheerful and fun and prove to be perfect for the many touches of humor (very English) that we will frequently find in the evolution of our criminal rise. If the sound itself holds up to sufficient levels, thumbs down for the total lack of localization. In this way, a product already for a few narrows its potential catchment area even further in our country. Comment Do you want to know what is the best term to describe Evil Genius? Simply said: elitist. In fact, Elixir Studios' work comes with a truly deep and varied game structure, so much so that even the most seasoned of players will find themselves in some moments in decidedly difficulty in controlling and managing all the foreseen parameters that combine elements of strategy with situations more like a management. For some of you these words will sound like manna from heaven but undoubtedly the ~average player~ will find himself lost if he wants to try the life of an international criminal and the tutorial is certainly not enough to give that frenetic pace of orders to be given especially in missions more advanced. If we combine this with the fact that the title has not been localized in Italian at all, the already elite audience shrinks even more and the catchment area becomes even more delineated. A title therefore intended for the expert and experienced player who has cut his teeth between RTS and management. To be avoided if it is one of the first titles with which you want to test your command skills: there are other productions that will certainly give you greater satisfaction. Pros: Innovative in many ways Intelligent humor Complex and profound Cons: Total lack of localization Difficult and not too immediate Frustrating in some missions Self-criticism is sometimes a virtue, in other cases a real necessity. What am I referring to? Clearly to Elixir Studios, authors of that Republic: The Revolution whose release was marked by massive doses of hype and high-sounding declarations (perhaps only Fable - Project Ego has surpassed it in the recent history of videogames) but later obtained heavy slating from the video game critics from all over the world and sales decidedly below expectationsfri. You learn from making mistakes and now Demis Hassabis & co. are back on the scene with Evil Genius but without that excessive load of expectations that had marked their previous production and this time things went much better In the Vivendi Universal title, we will find ourselves in the prototype of a criminal mastermind intent on conquering so much power that it enters into direct competition with the national states and submits them to our blackmail. Not an easy task and in fact on the long road towards mastery of obstacles we will find plenty of them But let's go in order", "date": "2004-11-03", "grade": null}