{"name": "Ratchet &amp; Clank: L'altezza non conta - Recensione", "ref": "https://multiplayer.it/recensioni/ratchet-amp-clank-laltezza-non-conta-recensione_b.html", "text": "The work done to propel the Ratchet & Clank series of video games has so far been admirable, and recent years have seen the release of Ratchet & Clank: Height Doesn't Matter for PSP, Ratchet: Gladiator for PlayStation 2 and of Ratchet & Clank: Weapons of Destruction for PlayStation 3. The passage of the first of the three titles from PSP to PS2 is certainly based on economic reasons, given the very large diffusion of the console and the relative simplicity of the operation... Size matters! If you've already tried the game on PSP, you'll find it practically identical on PS2. Our Ratchet and Clank are enjoying a well-deserved rest between one adventure and another, when suddenly they are interrupted by a young fan who would like to take some pictures of the two of them in action. Things get complicated when mysterious enemies kidnap the girl, and so our heroes will find themselves having to explore a series of planets to find her, also trying to discover the nature of a strange artifact ... role of tutorial and allow us to familiarize ourselves with the game control system, obviously improved compared to the PSP version thanks to the presence of the second analog stick. Ratchet can fight using his trusty giant wrench or draw on a rather vast arsenal, which can be enriched by collecting the weapons found in each stage. The ammunition is far from infinite, so we will have to be careful to collect the ~money~ that arises from the elimination of each opponent, and then spend it through special distributors of bullets and upgrades. Furry fury One of the peculiarities of Ratchet & Clank: Height Doesn't Matter concerns the use of weapons: apart from the wrench, which can also be used to operate some devices, firearms have a standard aiming system but also in first person. By pressing one of the back buttons, in fact, we will be able to aim directly at the enemies, thus making targeted shots. Maintaining the third-person view means accepting a certain degree of imprecision of the shots, but at the same time we will have the possibility of discarding to the side while shooting, an action that proves to be fundamental right away: the enemies will not stand by and will try to hit us in different ways. Weapon management is a bit cumbersome, in the sense that there are only two slots available (one occupied by the wrench) and to change the firearm you have to open a special menu, thus pausing the game. Each weapon can be upgraded, always accessing the usual distributors and paying a certain amount of money. It is clear that improving the tool we are best with represents a good strategy, but focusing on all weapons simultaneously can always offer us alternative maneuvers. Technical realization As mentioned above, the game in its PlayStation 2 version is identical to what has already been seen on the PSP, with the merits and defects of the case. As far as the former are concerned, it must be said that we have well-made polygonal models, equipped with a good animation. There are no glitches in the rendering or pop-up effects, the scenarios are quite ~populated~ and the frame rate is pegged at thirty frames per second, with no uncertainties of any kind. The enemies are quite varied and numerous, and generally have a good design. The other side of the coin is represented by a general lack of detail in the stages: there is the impression that the structures are all too simple, thanks to the presence of poorly defined textures, and the use of colors does not help. Let's say that there is little attention to detail, just take a look at how the water was made, and there are some small flaws in the management of the view. The sound sector can count on an excellent dubbing in Italian, accompanied by music and effects of discreet workmanship. Comment We are faced with an all too faithful conversion, which on the one hand allows all PlayStation 2 owners to try their hand at a well-crafted title for PSP, on the other it remains anchored to technical limits that could have been worked on in the transition towards a larger platform. Ratchet & Clank: Height Doesn't Matter is a fun game, quite varied, which however in comparison with a jewel like Ratchet: Gladiator comes out really run down, both in terms of the technical aspect and for the attention to perhaps marginal elements. but which put together can make the difference between a well-finished product and one that is not. If you are a fan of the series and own a PS2, Gladiator remains the episode to have absolutely: this PSP conversion certainly has its merits, but remains a step below. Pros: Technicianscally well done Playable and fun Excellent dubbing in Italian Cons: Locations too simple Control a bit ~slippery~ Not up to Ratchet: Gladiator", "date": "2008-03-13", "grade": null}