{"name": "Command & Conquer 3: Tiberium Wars", "ref": "https://multiplayer.it/recensioni/command-conquer-3-tiberium-wars_a.html", "text": "The strategy genre is experiencing a second youth on mobile phones, thanks to an action that develops at certain times and goes well with the joystick control system. In the case of Command & Conquer 3: Tiberium Wars, this translates into direct movement of the pointer on the screen, with the 5 key used for the action: you point to an area of the screen, press the button and the troops move in that direction. Such a simple and immediate structure, which has always distinguished the best products of the genre, can be almost entirely re-proposed in the mobile sector thanks to the technical possibilities of current terminals. From the start screen you can start a new game, continue the one already started (only one save slot is available) or try your hand at the ~skirmish~ mode, i.e. a game with random values within a scenario of your choice. There are so many text screens that introduce us to the story behind C&C, unfortunately full of very tiny characters, which will put anyone's eyes to the test. Then we will move on to the actual action, which is divided into two distinct phases: that of construction and that of combat. In the first phase, we will have to build our outpost, taking advantage of the new possibilities that become available with each new stage: we will be able to build an increasing number of buildings of various types, which in turn will enable us to create new soldiers and new vehicles. The values to keep an eye on are the available money and energy, both are spent on the creation of something and can multiply during the next level only if we manage them in the right way: a refinery must not be missing to produce money, nor a power plant. The rest is made up of barracks, technological establishments, watchtowers, etc. Once the construction is completed, we will have to face the fight: the Nod troops will arrive from every direction (punctually represented on the small radar located at the top of the screen) and we will have to move the various parts of the army that we have developed so that they interact automatically with the opponents, shooting everything they have at them. The interaction, in this sense, is rather limited: we will only have to indicate the point we want to be reached, after which it will be up to the skill of our troops (and their number, above all) to do the rest. Unfortunately, the game proves to be not very ~intelligent~ in certain situations: aiming directly at an opponent (with the indicator turning from green to red) does not force our soldiers to follow that particular target, but only to move exactly as if we had indicated a normal point on the map. Each stage ends after we have resisted a variable number of assaults (increasingly greater and more effective, it is clear), after which we will find ourselves continuing with the command post as we conceived it, with any damage to be repaired or, if we will have planned things well, with a certain surplus of money and energy to put into the creation of new attack units. The graphics of the game are well done, with sprites often tiny but with a decent level of detail and animation. The lion's share is played by the buildings, rather convincing, and by a fairly fluid scrolling. Each chapter, made up of several stages, is characterized by a different location, and in this case there are ups and downs: some maps are better than others, in particular there may be a certain repetitiveness in the graphic elements. The sound is really essential, and when it makes itself heard it doesn't shine. PRO Great game structure A large number of buildings, soldiers and vehicles Well done graphics AGAINST Simplistic combat phases Lackluster aiming system Mediocre sound", "date": "2008-03-17", "grade": "S.V."}