{"name": "Lost Via Domus: Il Videogame - Recensione", "ref": "https://multiplayer.it/recensioni/lost-via-domus-il-videogame-recensione.html", "text": "The trapdoor! Although the project is not the most important for Ubisoft, the graphics of Lost are anything but contemptible. The island is pleasant, full of details and the light effects are all in their place. From the Black Rock, to the Hydra station up to the Swan, all the most familiar places of the first two series are faithfully reconstructed with good textures and with the possibility of being explored freely, which will only please fans of the show. Even the protagonists, although the voices are not the original ones, are reproduced discreetly, a pity for the animations that leave something to be desired. The music is the original ones. Comment Lost Via Domus is damn close to being an interactive episode of the well-known TV series. The main character has a credible background and the air you breathe is precisely that of the episodes that many have learned to love. And it's not even that this Via Domus is bad, it's that it's almost not a game. It flies by in no time and none of the gameplay aspects, while fun, are developed enough. However, at the price at which it is offered, especially in the PC version ( 19.90), it is a purchase that any true fan will not want to pass up and, if you are willing to spend a little more, on 360 it will reward you with a thousand easy points for the gamertag. Those who don't follow the serial, however, beware, because they will find themselves with an adventure full of quotations and references that are not understandable, and very few things to do. Pros Price Setting Original jokes Cons Too short No replay value Little substance Lost Via Domus is available for PC, PlayStation 3 and Xbox 360. The tested version is for Xbox 360. Xbox 360 - Goals 1000 very easy points for Lost Via Domus. Just completing the adventure without hunting for it leads to more than 800 points. For the others, a little attention is enough and, perhaps, a look on the web.", "date": "2008-03-12", "grade": null}