{"name": "LEGO Bionicle Defenders", "ref": "https://multiplayer.it/recensioni/lego-bionicle-defenders.html", "text": "In fact, the Kiloo development team had already made an excellent impression with the previous LEGO Bionicle Challenge, an atypical but captivating racing game awarded on these pages with a more than positive evaluation. Now, with this variation on the Tower Defense theme, the software house once again confirms its harmony with the Danish brand, even without following the path of originality as happened with Challenge. The premises of LEGO Bionicle Defenders are exactly the same as dozens of similar products, and therefore see the user engaged in building defensive towers in order to stop the advance of enemy troops before they reach the end of the path. Just to give a pinch of plot, the object to be preserved over the course of the 16 levels is the so-called Mask of Light, an artifact as coveted by the ~bad guys~ as it is jealously guarded by the ~good guys~. A mere formality to justify the game action, and that's okay: one of the main advantages of LEGO Bionicle Defenders is precisely that it is a direct title, which without many frills takes the user straight to the heart of a gameplay that is as always simple but effective. Following tradition, each scenario opens by allowing the player some time to set up the initial towers (always to be built in relation to the available budget), with the possibility of expanding one's defensive lines as waves of enemies are defeated and money accumulates. There are six different types of towers, ranging from simple lasers - effective but short-range - up to devastating missile launchers with long range but rather slow rate of fire. To these must be added as many Toa Mahri warriors, or very expensive and cumbersome installations but with devastating firepower. Considering also the various qualities of enemies present (some faster, others more aggressive and so on), it is evident how LEGO Bionicle Defenders plays its cards well from a strategic point of view, offering a range of variables such as to satisfy even the most palates demanding. The rather marked level of difficulty is also a clear sign of the product's orientation towards a not too casual audience, an element that certainly proves to be an important added value. Fun and challenging, LEGO Bionicle Defenders disappoints a bit from a graphic point of view, especially in relation to the excellent results obtained by Kiloo with the previous Challenge. The game is limited to showing a bird's eye view that frames rather elementary and not very detailed 2D scenarios, while the sprites of the towers and enemies are certainly not surprising for their complexity, all immersed in a rather cold and dull color palette. Minimum effort also for the sound, which is limited to a little music in the menus and some sporadic effects during the battles. PRO Well thought out levels Fun and challenging Long enough AGAINST Mediocre graphics and sound A little trial-and-error", "date": "2008-03-05", "grade": "S.V."}