{"name": "Castlevania: The Dracula X Chronicles - Recensione", "ref": "https://multiplayer.it/recensioni/castlevania-the-dracula-x-chronicles-recensione.html", "text": "After centuries of peace, fanatics stage a sinister ritual to summon Dracula back to our world. The king of the vampires immediately unleashes his army of demonic creatures, who set fire to the villages that are located in the vicinity of the cursed castle. The only one who can oppose the forces of evil is Richter Belmont, belonging to a family that has hunted vampires for generations. Armed with a chain whip, Richter must fight his way through undead and monsters of all kinds to reach Dracula and kill him, before he turns his beloved Annette into a vampire... Rondo of blood After a purely introductory first level, the game is shown in its definitive form, with the protagonist having to explore eight stages and face a large number of opponents and bosses. Those who have played the latest incarnations of Castlevania will inevitably be amazed by an essential control system, which only allows us to jump and hit with the whip. The only extra actions are represented by a double jump backwards (which in Richter's case is almost useless, if not harmful...) and by the activation of the secondary weapon, which is obtained by pressing up the d-pad and attacking. As usual there are the various sources of artificial light that can be destroyed with the whip and which sometimes release money (to be collected only for scoring purposes), sometimes hearts. These are not bonuses that restore the vital energy bar (that happens through very well hidden and rather rare objects), but ~bullets~ for the secondary weapon: when they exceed a certain number, the indicator turns yellow and you can resort to a special attack (Triangle key) which varies depending on the equipment, but rarely makes a difference in a boss fight. We will be able to collect and use throwing knives, flying axes, holy water, rotating crosses, a holy book, etc. Each weapon has a different approach and a different effectiveness: it can be excellent in some cases, as well as bad in others. The Chronicles of Dracula As in any Castlevania, we will find ourselves exploring platform-based stages, usually with two support planes that develop vertically and which can be reached via flights of stairs. Our character behaves in a particular way in these cases: for the stairs to be tangible and passable, you have to press the d-pad diagonally. Otherwise, Richter crosses the ramp without touching it and sometimes this results in a dry game over due to the presence of ditches or pools of water (vampire slayers are not taught to swim, of course). This is not the only case in which the game turns out to be harsh and merciless, unfortunately: we are faced with a title that we could define as ~old school~, very demanding, in which sometimes not even the right maneuver can make us avoid an attack enemy. The difficulty rises from level to level, quite gradually, and this translates into both the presence of more resistant and dangerous opponents and the simultaneous assault of flying enemies who can really get us into trouble. To be able to survive there is only one way, that is to replay each stage several times, memorizing both the position and the behavior of both the ~simple~ monsters and, above all, the bosses. In the latter case it is essential to remember their movement sequence and the ways in which they attack us, with very little room for improvisation. The Symphony of the Night Sometimes we will find keys that occupy the slot dedicated to secondary weapons. But what are they for? Well, there must be a door with a big lock nearby, and such a case leads us to save Marie, a girl with very special powers that we can use as an alternative to Richter. The style of this new character is decidedly more ~light-hearted~, his primary attack is a flight of doves (yes) and his secondary weapons often consist of the call of various animals (cats, turtles, birds, but also dragons... ). Marie is equipped with a finally useful double jump, which allows her both to reach otherwise inaccessible areas and to avoid enemy blows more effectively. In general, playing the game with her is much easier than it is with Richter. The strange thing is that in addition to this second character there is also another, very important extra which, however, is not unlocked by completing all the stages, but by finding a particular object. The extra in question is none other than Castlevania: Symphony of the Night, in its full version, which will become accessible from the main screen and which we will be able to play on our PSP by accepting only the compromise of the sidebands (the resolutionis the original one, in 4:3). The decision to make this ~game within the game~ available is certainly a winner and greatly increases the longevity of Castlevania: The Dracula X Chronicles, but it is a prize only for the most patient and passionate players, given how it has been implemented. Technical realization The animated introduction of the game is really excellent, and in general we are faced with very well done graphics, with a mix of polygonal and bitmap elements. The former make up the characters and monsters, ensuring excellent fluidity of the animation. Richter moves convincingly, even though he doesn't have a large repertoire of actions, while Marie's poses are certainly less inspired and successful. The bestiary put together by the developers is really rich and varied: we will face the usual skeletons and zombies, but also mythological creatures (the minotaur, the medusa, a dragon, etc.) or taken from gothic literature (Frankenstein's creature, the wolf, the mummy, etc.), which is flanked by a whole series of minor but often very cunning opponents (flying heads, armored knights, ferocious goblins, giant bats...). The design of the locations is excellent, and the various places are all well characterized: we start from the burning village and then move on to the huge castle, made up of very different rooms and underground sections, which sometimes open up paths towards alternative routes. The game is very stingy when it comes to vital energy supplies, so we'll find ourselves hitting every wall in search of interactable points, and in some cases we'll be able to activate mechanisms that open doors, allow us to collect extra music tracks or various bonuses guy. The action is accompanied by the usual theme soundtrack, rich in organs and orchestral phases, very beautiful even if it lacks something to stay ahead. Alongside average effects we also find quite a bit of speech, available both in English (with a horrendous acting) and in Japanese, in each case subtitled in Italian. Comment Castlevania: The Dracula X Chronicles is a deliberately classic product, very demanding, which can often turn into a frustrating experience but which at the same time can refresh our memory of what the video games of our childhood were like, especially the first Castlevanias. We are faced with completely different values compared to those we see today: in a current game it would be unthinkable to have to start the stage over again every game over, as well as finding yourself in situations from which it is not possible to get out without planning each movement , repeating the same sections several times and memorizing the behavior and location of enemies. The same choice to make an important extra like Symphony of the Night unlockable only in a certain way (which implies the in-depth exploration of each location) only confirms the developers' intentions: The Dracula X Chronicles is not a game for everyone, but only for those who are not intimidated by challenges. Pros: Excellent graphics for quantity and quality Addictive and challenging. Great value extra... Cons: ...but not easy to unlock Very difficult, often frustrating Several secrets to discover, but all well hidden", "date": "2008-03-05", "grade": null}