{"name": "Nitrobike - Recensione", "ref": "https://multiplayer.it/recensioni/nitrobike-recensione.html", "text": "Excite Truck ushered in the genre of arcade racing games (very arcadey) on Wii, and it was clear that other developers would follow suit, trying to match the sensation of speed and visual impact. Produced by Ubisoft, Nitrobike is therefore the first attempt made in this direction. The player must select a rider and a motorbike, then embark on races of different types but characterized by the same interpretation: it will not be the fastest competitor who wins, but the one able to best use the possibilities offered by the reactor mounted behind the motorbike ... Game mode The main menu of Nitrobike allows us to try our hand at a single race, start a career or try multiplayer. The latter is available both locally (for up to four players in split screen) and online, by activating the Nintendo Wi-Fi Connection. In this case, only one opponent can be faced at a time, with a system that in turn allows one and the other player to decide the rules of the race (circuit, number of laps, etc.). The experience turns out to be absolutely lag-free and quite enjoyable, even if it lacks any possibility of communicating, with all the problems that come with it. Naturally, it is the career mode that represents the fulcrum of the game, with the beauty of nine events, each consisting of a variable number of races (from three to ten, with the number increasing as you progress). At the beginning, you can only participate in the first one, which you must successfully complete (arriving on the podium in each race) in order to unlock the next one, in a ~rewards~ structure typical of racing games. Finishing first also translates into unlocking new bikes and riders, with whom to start a career from scratch or simply to try out in individual races. Each race that we will face in the career mode may require the achievement of different objectives: in addition to simply crossing the finish line, we will find ourselves having to complete fast laps, cross a certain number of circles positioned on the track or participate in progressive elimination races, in which you must never stay in the queue of the group. Fast as a rocket! As mentioned at the beginning, being the fastest doesn't automatically mean winning every race. Apart from the presence of particular rules, from the first minutes of the game we will realize that you don't go anywhere without activating the motorcycle's reactor, but that you have to learn to dose its thrust so that it translates into an effective advantage during the race. Turning into missiles on the straights is a relatively simple practice, while resorting to the boost to straighten the bike when cornering proves to be a bit more complex, the fact is that it is there that we can really build an advantage over our rivals. And we'll always have to pay attention to the indicator at the bottom right of the screen: when the reactor has overheated, we'll have to shut it down immediately and let it cool down, or we'll risk exploding together with it. Nitrobike's control system involves using the Wii-mote horizontally (with no other possibilities), with button 2 to accelerate and 1 to brake or perform tricks during jumps (almost useless practice, actually), while the d -pad fires reactor (or selects stunt maneuver). To ~steer~ we will have to tilt the controller to the right or left, dosing the movement so as not to turn the bike too much. And this is where the problems begin, unfortunately: the control is not as precise as in other Wii driving games, but above all the tracks have edges full of interactable objects, which you end up colliding with all too often. Technical realization The graphics of Nitrobike are the ones to which, unfortunately, the majority of Wii games have accustomed us by now: very simple and angular polygonal models, poorly defined textures, locations lacking in detail and characterized by a mediocre design. To all this we must add an engine that is far from optimized, afflicted by continuous variations in the frame rate that lead it to be now fluid, now uncertain. The sensation of speed during reactor activation was rendered well, with the usual blur effect on the track, but it's too little to justify everything that is wrong. As for the sound, we have a series of ~bad~ music, typical of the genre, which does its job without being noticed too much, just like the effects. The multiplayer works well both locally and online, while not representing a particular extra value for the longevity of the game. Comment It's clear that Nitrobike stands as a direct competitor to Excite Truck, and it's clear that developers need to experiment within this genre of ggames in order to make something worthwhile. Taking into account the time available, however, one cannot be satisfied with the results achieved: this new Ubisoft product is technically mediocre and has a control system that is not bad in itself, but should have been better integrated with the dynamics of the races. Too often you end up crashing due to a lack of controller precision, suddenly finding yourself last; and the ability to operate the boost, fun as it is, doesn't cover episodes of frustration. If you manage to come to terms with its problems, Nitrobike can guarantee a good number of races and a nice online multiplayer mode, but don't expect an Excite Truck on two wheels: you risk being very disappointed. Pros: A good number of events Multiplayer also online Decent control system... Cons: ...but poorly optimized Mediocre graphics There is much better out there", "date": "2008-03-06", "grade": null}