{"name": "Mario &amp; Sonic ai Giochi Olimpici - Recensione", "ref": "https://multiplayer.it/recensioni/mario-amp-sonic-ai-giochi-olimpici-recensione_a.html", "text": "At the starting line... The game provides us with sixteen characters, taken from the Mario and Sonic series, divided into four categories: power (Knuckles, Bowser, Vector and Wario), balance (Mario, Amy, Luigi and Blaze), speed (Sonic, Daisy , Shadow and Yoshi) and abilities (Peach, Tails, Waluigi and Dr. Eggman). It is clear that each type has an advantage in certain disciplines and a disadvantage compared to others: tackling boxing with Knuckles is very simple, as is running the 100 meters with Sonic, and so on. The differences between the characters don't stop there, however, as different applications modify the controls and any special moves depending on who we choose to compete. Excluding the multiplayer (which can only be organized locally: unfortunately there is no online), there are three different game modes: ~single game~, ~circuit~ and ~mission~. The first allows us to become familiar with the philosophy of the game rather than with its control system (since the latter changes according to the situation) and to choose a discipline from nine major categories, for a total of twelve different sports. Each of them is also available in a particular ~dream~ mode, which overturns its rules and structure, effectively bringing the total number of disciplines to twenty-four. The core of the game The ~circuit~ mode is the most substantial and engaging, with three ~classes~ that are unlocked by completing the various circuits and which vary the number of disciplines that must be tackled, precisely, in the circuit (three for the ~beginners~ class, four for the ~advanced~ class and five for the ~expert~ class). Each class includes five circuits (the last six, actually): after selecting a character, we will have to face each discipline and proceed in a sort of scoring tournament, trying to get to the top of the standings in the end. To shuffle the cards on the table, adding a pinch of strategy, there is the ~lucky circuit~, i.e. a token that can be spent within a single race and which will double the score obtained: each of the four participants, including our athlete, they will have to choose when and whether to take advantage of this bonus, perhaps to build an advantage on a discipline they are very good at. Each circuit completed unlocks the next one, in a ~reward~ structure that fits well with the spirit of the game. The last modality, the ~mission~, consists of no less than six skill tests for each character, to be faced preferably when one is expert enough: the objectives to be achieved, in fact, are rather precise and particular, and require an excellent knowledge of every discipline. For example, we will be asked to throw the hammer three times, scoring a greater distance each time, or try our hand at the easel trying to obtain a score that falls within a certain numerical range. As an extra, there is a section that stores our records and a ~gallery~ that we can access to learn, through simple minigames, the history of the Olympics in general and those of Beijing in particular. Control system While generating a strong attraction, it is clear that in Mario & Sonic at the Olympic Games the main element is not the characters and their characteristics, but the control system studied by the developers. Each discipline makes its own story, with rather simple instructions that can be viewed before each session, and it is clear that the final result is divided between ups and downs. The system designed for racing is very simple and works well: you have to ~load~ by pressing the stylus on the touch screen before starting, then draw a line to the right to start and then ~rub~ quickly, horizontally, for the character to run. In the 400 meters this mechanic is made more complex by the presence of an indicator of fatigue, which prevents us from doing the entire course to the maximum and therefore requires us to slow down the ~rubbing~ when the energy starts to go down. In the presence of obstacles, all you have to do is ~tap~ on the screen to make a jump. The system used for running is recalled in the long jump and triple jump, as you need to pick up speed before jumping (which you do by drawing a rapid diagonal). The other disciplines have their own history, in the sense that practically each one boasts different controls: sometimes these are original and well-chosen choices (archery, hammer throwing, clay pigeon shooting, trampoline), which also refer to rhythm game; at other times one encounters excessive simplicity or uncomfortable solutions (see fencing or cycling). Ultimately, as is normal, there are sportsmuch funnier than others... Technical realization The graphics of the game do their job very well, that is, they manage to characterize the various characters in the best way, providing them with good quality animation. The use of colors is excellent, with the bright colors that everyone would have expected. The rest is not superfluous, but almost: the scenarios are rather poor and the audience at the limit of decency, but it is normal that the developers have concentrated their efforts to make the protagonists of the action well and to keep the fluidity always high. In this sense, the objective has been fully achieved. And the sound is part of the same operation: each character has a series of characteristic exclamations, which dominate the pleasant but not surprising effects, accompanied by music that does not remain in the head. The technical possibilities of the Nintendo DS are all used, even the microphone (albeit in a very marginal way), but it is the touch screen that plays a leading role and always proves to be up to the task, showing itself to be precise and sensitive. The game is completely translated into Italian in the texts on the screen (and in the spoken announcement of the title, to be honest), and provides us with three memory slots to save the progress of as many users. Comment Mario & Sonic at the Olympic Games is a fun title, capable of entertaining for several hours thanks to the ~circuit~ and ~mission~ modes. The solutions found for the various disciplines are generally guessed: sometimes very simple but engaging, sometimes inspired by rhythm games, only in some cases cumbersome and not very inspired. The input devices of the Nintendo DS always prove to be up to the task, with the only physiological defect of making us lose sight of the action when we are very busy interacting frantically with the touch screen. Technically well done and full of charismatic characters, unfortunately it doesn't have an online multiplayer mode and is limited to the possibility of organizing races for four participants. In conclusion, a must buy if you are looking for a nice and engaging party game. Pros: A large number of disciplines and characters Two substantial game modes Definitely spot on controls... Cons: ...with a few exceptions No online multiplayer Not very long-lived", "date": "2008-02-21", "grade": null}