{"name": "Turok", "ref": "https://multiplayer.it/recensioni/turok_a.html", "text": "While Turok and his team are on a space journey, they are attacked by Kane's troops and forced to make an emergency landing on an unknown planet. The ships scatter and the soldiers are decimated by the atypical population of this archaic world, made up of monsters and dinosaurs. Turok will then have to go in search of the survivors, eliminating any enemy he finds in his way. To succeed in the enterprise he will be able to count on three different weapons, each of which can be upgraded, and on the trusty dagger for close combat ... As written at the beginning, this mobile incarnation of Turok is very reminiscent of Black Thorne in structure: the stages are divided into various ~screens~, each of which can hide pitfalls in the form of chasms or enemies arranged in a certain way. During the early stages of the game we will learn to control the character and his movements, entrusted to the joystick of the mobile phone: left and right to move, up to jump forward (or cling to a handhold) and down to hide. This last action proves to be essential to eliminate enemies silently: when Turok hides, camouflaging himself, he cannot be seen or hurt by his opponents. Approaching one of them, taking it from behind and pressing the 5 key repeatedly, the protagonist produces a silent killing, which cannot be resisted. In the event that an enemy sees us, however, we can always press down on the joystick to dodge his attacks, calculating the reload times of the weapons to strike at the right time. We will start with a standard machine gun, which we will soon be able to add to a bow and a rifle: the first weapon proves to be balanced in all situations, the second is very effective up close and finally the third is only good for long distances. Every now and then the exploration and combat sessions are interspersed with shooter phases, in which we will simply have to fire at a rapidly approaching horde of velociraptors, using the 5 key to retreat and the 0 key to roll and turn rapidly, while the shot is automatic (and, if desired, aiming can also be). The game boasts a respectable technical realization: the protagonist boasts a good design, is animated discreetly and can perform a large number of different actions. Often we will meet companions of Turok, also well drawn, and of course a large number of opponents, all of good workmanship. However, the lion's share is carried out by the scenarios, which boast parallax scrolling on two levels, a good level of detail and a certain variety: the sections in the forest are very different from those in the dungeons, so the locations manage to never be trivial. The sound consists of a single piece of music, with the volume adjustable independently of the phone, well made and able to accompany the action well. The controls are quite simple, you find yourself being able to do many things by pressing a few keys, and this is good. Some notes can only be moved to the responsiveness to inputs, perhaps, given that hitting enemies while they are turned around and then returning to the shadows does not always succeed perfectly. Pros: Technically very well done Great combat system Original approach to fights Against: Subdued shooter sessions Only one accompanying music In some cases the controls are unresponsive", "date": "2008-02-23", "grade": "7.9"}