{"name": "Iridium Runners - Recensione", "ref": "https://multiplayer.it/recensioni/iridium-runners-recensione.html", "text": "The PlayStation 2 video game market now offers ample possibilities, from every point of view: the platform is well known by all developers, there are standardized graphics engines that eliminate a substantial part of the work of each team, and finally there is the possibility of put on the market products with a competitive price, behind which a certain amount of work is hidden. This is the case of Iridium Runners, a futuristic racer made by the Milanese Playstos Entertainment, which is clearly inspired by wipEout but also mentions Bioshock and Pixar cartoons. The game is based on a series of speed races that take place on circuits full of curves, jumps, tunnels and loops. Just a small detail: the competitors do not drive very fast vehicles, but run on their own legs. Iridium Championship The year is 2050, and the Iridium Championship is one of the most watched sports in the galaxy, with four corporations vying for the ultimate victory and a huge turnover. Each team is made up of five runners, each characterized by different values of speed, acceleration, agility and energy. From the start screen, we can access the single player mode or multiplayer (up to four players, only locally), with the first being divided between single races, cups and the championship. Once a character and a support ~pod~ have been selected, therefore, we will find ourselves facing the other competitors with the aim of crossing the finish line first. It takes a while to fully understand the spirit of Iridium Runners: the control system is typical of racing games (with X to accelerate, Square to brake, the left analog stick to change direction and the back buttons used to jump, activate the weapon picked up and quickly swerving to the right or left), only that we need to get used to the idea that what we find ourselves controlling is a powered runner, not a vehicle. It is a particular experience, far from being realistic and rather distant from what is seen in classic racers: the characters move sharply and quickly, however they have difficulty in setting tight curves. Multiplayer mode While it lacks online play support, Iridium Runners does have a good number of multiplayer modes for two, three, or four players (using the Multitap peripheral, for that matter). It is possible to face cooperative races or organize deathmatches, with a split screen that also divides the screen into four sections but does not lose the great fluidity that distinguishes the game. Energy, weapons and whatnot Each track is littered with ramps for acceleration, energy containers and weapons: they are all essential elements to win a race, since our enemies are always extremely quick and cunning. So let's forget the fundamental principle of racing games, according to which clean driving is enough to get the better of your opponents, at least during the first few races. Iridium Runners has a single level of difficulty, and it is rather selective: to win a race, it is not enough to know the track well, you have to take advantage of all the opportunities we will have to acquire some advantage. So we'll have to go up all the ramps we find, collect energy and use weapons whenever we get the chance. The energy bar located at the top of the screen, and which varies in level depending on the selected character, empties as we run and can be restored by collecting the blue containers found in the stages. When the amount of energy exceeds the bar indicator, we will have the opportunity to exploit the excess to produce rapid shots by repeatedly pressing the X button. As for the weapons, we will only be able to collect one at a time and use it using the L1 back button. We will have homing missiles, energy blasts, slime balls, lightning, shields, walls, mines and more at our disposal: a respectable endowment that our enemies will be able to use in the same way, without making compliments. Technical realization From a technical point of view, we are faced with a rather well-finished product, in some ways even surprising. A good animated sequence, dubbed in Italian, introduces us to the graphics of Iridium Runners in the best way, immediately introducing us to characters whose design is clearly inspired by Pixar feature films. Unfortunately, the polygonal models of the runners are anything but complex, so they have a certain angularity and lack of a good level of detail. However, this shortcoming can be easily forgiven when passingto analyze the high-quality graphics engine: the twenty-four available tracks, divided by location, run at a fixed 30 fps, without ever an uncertainty. All the tracks boast a good design, are very different from each other and present visual solutions of a certain impact, even quite original. The ~advertisements~ that are seen during the uploads are a clear tribute to Bioshock, especially for the style, even if they appear a bit rough in the realization. The music is not very numerous, unfortunately, but they boast a good quality: they are techno songs extremely similar to those that make up the soundtrack of any wipEout episode, and create the same atmosphere. The effects, on the other hand, are lagging... Comment There are several reasons to consider Iridium Runners a successful title: the graphics engine manages the tracks and characters in a very effective way, keeping the frame rate constantly high; there is a good number of game modes and racers, even if the latter tend to look a bit similar in terms of behavior on the track; weapons and energy management are a very thick element. Unfortunately, however, there is also a downside, which basically concerns two aspects of this product. Firstly, the idea of making people race rather than vehicles (of whatever kind) is quite original but not at all, not at all fascinating: the mere concept of having to ~set the curves~ does not fit well with what happens on screen, and character control is unnatural. Secondly, the difficulty is too high: the opponents are always faster and you have to conquer the victory tooth and nail, right from the first race. This translates into numerous episodes of frustration, which lead to a perhaps inattentive management of the various dynamics within a race. Ultimately, Iridium Runners is a title to be taken into due consideration, technically well done but not very friendly towards less experienced players. Pros: Nice tracks, which always run smoothly A good number of modes and characters Original basic idea... Cons: ...but not very exciting Very difficult, often frustrating Rough control", "date": "2008-02-19", "grade": null}