{"name": "Final Fantasy XII: Revenant Wings - Recensione", "ref": "https://multiplayer.it/recensioni/final-fantasy-xii-revenant-wings-recensione.html", "text": "Ghost Wings The story of Revenant Wings begins one year after the conclusion of Final Fantasy XII. We find Vaan and Penelo, busy looking for treasures with their personal airship, plowing the skies of Ivalice and competing with two old battlemates, Balthier and Fran: the life of the sky pirate lasts, but a haunted temple is certainly not enough to scare a boy who has faced far worse. However, the problem arises when the recovery of the current treasure seems to awaken a huge airship, which will end up in the hands of our young protagonists and their friends Filo and Kytes: the small group will be transported to the floating continent of Lemurs, once separated from Ivalice and now accessible again due to the destruction of the Suncryst in the prequel. After having fraternized with Llyud of the Aegyl race, Vaan and the others will find themselves having to defend this continent, and also Ivalice, from pirates who want to raid it, and above all a new threat: a mysterious winged Judge, endowed with extraordinary powers, who aims to destroy Lemurs by shattering the mystical Auracite crystals, the fragments of which allow the summoning and control of Espers. Our heroes will reunite with their old friends to face the danger, and will discover the mysteries behind the Eternals, the divine Feolthanos who created Lemurs and the Winged Judge himself ... in the course of forty missions that we will have to face to finish the game. Unlike a typical JRPG, in fact, Revenant Wings is structured precisely in ~missions~, main and secondary. Between one stage and another it is possible to explore a simple three-dimensional map and face optional battles to strengthen our heroes (who gain experience points and new skills like in a very common JRPG) and recover materials useful for forging new weapons and armor , which takes place on the Galbana, the airship ~recovered~ by Vaan and Penelo: this means of transport will soon become a sort of ~hub~ where it is possible to create objects, buy weapons and accessories, and keep an eye on the available quests , the glossary and the logbook. Despite the linearity imposed by the very structure of the game, the plot of Revenant Wings soon reveals itself to be extremely fascinating and compelling: less political than that of the prequel, the story written by Motomu Toriyama (former author of Final Fantasy X-2) has the advantage of characterize the protagonists and their opponents much better, making themselves much more enjoyable and exciting, even if there really doesn't seem to be any way to make characters like Basch or Fran, destined to be stereotyped supporting actors, more interesting... Ring of Pacts and other amenities A staple of Revenant Wings gameplay is the Ring of Pacts, which becomes accessible after a handful of missions, when Vaan and the others finally manage to get their first Auracite. Through these crystals it is in fact possible to ally with one of the Espers positioned on a sort of circular plate, which recalls the License Board of the prequel: depending on the power of the Esper (there are three grades) it will be necessary to spend more or less Auracite. The Espers include practically all the mystical creatures of the Final Fantasy mythology: from the Chocobo to the Cactuar, there are the Goblins and the funny Quetzacoatl, but also the Wyverns and, of course, the much more powerful third degree Espers, among which Ifrit, Shiva , Bahamuth and many more. Essentially, Espers are the player's personal army. In most missions, each party member (only five can be deployed on the battlefield) corresponds to two Espers by default, and more can be summoned with Summoning Gates, if present and belonging to the player, in the battle area. Each Esper belongs to a category and an element: flying Espers deal more damage than ground Espers but are more susceptible to ranged Espers, for example, and a water Esper will be more lethal against a fire Esper. Keeping in mind the rules of this sort of rock-paper-scissors, it is possible to plan the course of the battle, and the choice of which Espers to lead into battle, how many to summon (within a certain limit, of course) and how to position them is essential for the success of any battle. At the same time as the Espers, our protagonists will also battle: each of them has a series of skills and spells, which become available as the level of experience increases. Unlike the original chapter, in which each character could learn any spell or special ability, in Revenant Wings each character is distinguished not only by the type of combat (ranged, close and flying) but also by his skills. So while Vaan has various physical attacks that negatively modify the status of enemies, Kytes is able to cast traditional elemental magic, Penelo can heal and resurrect defeated characters, Filo can place traps and so on. Ring of Pacts and other amenities Getting to know the nine selectable characters and their specialties is really important, also considering the limitation of the Gambit system, which in this sequel abandons the complexity that distinguished it in favor of an all too simple mechanism: in practice, the new Gambit allows you to select a spell among those available for each character to be performed automatically continuously. This restriction basically obliges the player to open the spell menu and select them repeatedly as, especially in advanced missions, it is practically unthinkable to limit yourself to the execution of a single spell. Once you become familiar with the characters and the Espers, the possibilities are endless: you can create your own favorite teams or change them before each battle, developing very personal strategies that can be based on brute force or cunning. In general, however, the gameplay of Revenant Wings remains on a rather user-friendly level for the genre it represents, Real Time Strategy, and complex tactics or brainy management of resources are not necessary: when the player manages to focus on the point weakness of the opposing team, whether it is a less defended point of the map or a certain weakness of the Espers, Revenant Wings becomes what is defined in the jargon as ~zerg~, through the continuous summoning of the most suitable Espers for the purpose and the mass assault against the targets in turn. The result is spectacular clashes between dozens of sprites at the same time, in which the chaos of the action and the piling up of pixels makes it practically impossible to manage the battle without resorting to the simple quick menus for selecting individual units. Not entirely a good thing, but far less tragic than it sounds, and downright hilarious indeed. A tactical, real-time Final Fantasy? Square Enix had tried it with Heroes of Mana: it had transformed one of its most famous brands into a completely new product on DS, choosing the RTS field. The result had been bankruptcy. With Revenant Wings, however, the softco hits the target and succeeds in producing a strategic game that is decidedly accessible to all, simple to assimilate but nevertheless rich in depth, and caciarone enough to keep faith with the spectacular tradition of the last Final Fantasy. From a graphic point of view, the cartridge surprises for the excellent quality of the various computer-graphics films scattered throughout the adventure, and above all for the care taken in the creation of the locations where the action takes place, among the best seen on the console Nintendo: colorful and full of details and details, the various settings are so elaborate in their mix of 2D and 3D that Square Enix has preferred to freeze them, preventing their rotation on a virtual Y axis. A rather simplistic mistake, which has led to the dramatic frequency of situations in which it is practically impossible to view the position of one or more units, perhaps hidden by some elements of the environment, such as rocks or pillars. As can be guessed, in fact, the control of Vaan & company on the DS takes place through the use of the stylus: with simple pressures it is in fact possible to manage options and menus, select the various units and move them in the maps with a touch of the stylus. However, sometimes this operation is made daring precisely by the static nature of the isometric environment and its graphic complexity, as well as by the interpenetration of the various sprites who battle each other on the spot, a defect that is forgiven due to the technical excellence, but which does not fail to frustrate the player in the most chaotic situations. As for the sprites themselves, the work done by the graphics is decidedly pleasant: even if pixelated, the various characters are vaguely expressive and well animated, detailed and decidedly similar to their counterparts on PlayStation 2, although the influence of the new character is felt designer, the same Ryoma Ito who conceived the protagonists of Final Fantasy Tactics Advance. The adventure is accompanied by a respectable soundtrack, borrowed practically en bloc from the original on PlayStation 2: therefore the splendid music by Hitoshi Sakimoto returns, rearranged for this Nintendo DS version with exceptional skill, so much so that the difference is practically imperceptible, all in favor of our ears. Probably Revenant Wings currently has the bestior sound section in the DS toy library. Comment Square Enix seems to confirm its interest in the Nintendo DS not only as a platform for the development of important brands, in the form of spin-offs or not, but also for experimentation: the choice to transform a sequel to the talked about Final Fantasy XII, already revolutionary in itself, in a Real Time Strategy Game it is decidedly courageous. And we're happy to credit the cartridge as one of the best products for the Nintendo handheld. Although frustrating at times, Revenant Wings features all the best playful and narrative features of the famous saga, from the adventurous plot to the presence of the most famous creatures. To the thirty hours of game needed to complete it, those required to complete the numerous optional missions are also added, in order to uncover every secret and reach the granite 100% in completion. There are flaws, but in these cases they are forgiven with pleasure. Pros Technically well made Compelling storyline Simple and rewarding game system Cons Impossible to rotate isometric maps Difficulty sometimes unbalanced Sometimes a bit too chaotic Final Fantasy XII: Revenant Wings is available for Nintendo DS. Square Enix seems a bit confused lately, sometimes crazy. Final Fantasy XII on PlayStation 2 has been one of the most talked about games of the last two years: despite the very high quality of the product, it hasn't failed to arouse controversy, especially among fans, splitting the admirers of the world's most famous JRPG saga into two factions. There are those who have tired of twenty years of random turn-based combat and have embraced the innovations introduced in a now stale gameplay, and those who instead would have preferred a more traditional and less revolutionary Final Fantasy. Be that as it may, Final Fantasy XII was also part of the Ivalice Alliance, the mammoth multimedia project that includes the various video games set in the world of Ivalice, inaugurated in 1996 with Final Fantasy Tactics for PSOne. The plot of Final Fantasy XII, then, was at least as tumultuous as the story of its realization, which saw the heart of the project, Yasumi Matsuno, step away from the development of the game for health reasons: the initial epic adventure, a of war and politics seasoned with the supernatural, has somehow disappeared together with its creator. And despite the weakness of the plot, Final Fantasy XII has become a million-seller in no time, and a new benchmark for next-generation JRPGs. Therefore, the decision to make a sequel is a bit surprising. Or rather, the actual idea is not surprising (after all, Square Enix had already produced a sequel to Final Fantasy X, the much talked about Final Fantasy X-2) as much as the choice of the reference console: the best-selling handheld in the world , the Nintendo DS. A choice that has led to new revolutions.", "date": "2008-02-18", "grade": null}