{"name": "Devil May Cry 4 - Recensione", "ref": "https://multiplayer.it/recensioni/devil-may-cry-4-recensione.html", "text": "Playstation 3 vs Xbox 360 From a technical point of view, the two versions are practically indistinguishable from each other, with slight differences due to the different video output, which makes the image on PlayStation 3 slightly more defined. Both versions have an achievement system, which on Xbox 360 is always linked to the player's gamertag. Finally, compared to an installation on disk lasting about 20 minutes (!), the PS3 version offers more immediate loading than the 360 counterpart, sometimes marginal, sometimes halved. That said, they also remain perfectly acceptable on the Microsoft console at any point in the adventure. Comment Fun, spectacular, extremely replayable. These, in summary, are the three main positive aspects of Devil May Cry 4, which continues the path of its predecessors and takes advantage of new technologies to offer even more extreme situations and passages that remain memorable in the gamer's head. On the other hand, some mechanics are too tied to the past, such as the poor interaction with the surrounding environment and sometimes excessive backtracking. Also in light of the fact that there are not so many competitors currently, the Capcom title is positioned in the very first positions, and is certainly worthy of being taken into consideration by all lovers of the genre, who could elect Nero as their new idol or sacrifice it on the altar of the revived Dante. Pros Excellent control system Fun and with many extras Good visual impact Cons Retrograde mechanics in some ways Avoidable backtracking Innovation is not its forte Xbox 360 - Goals Devil May Cry will make you sweat the proverbial seven shirts to acquire all 1000 points available. By finishing the main adventure for the first time, very few are obtained (less than 100) and therefore you have to ~make an effort~ to obtain high style ratings, complete the title at each level of difficulty, acquire a certain number of red spheres, lead to finish 100 levels of survival mode and so on. In short, it will take quite a (many) few hours of play to achieve the much coveted perfect score to show in your gamertag. You, son of Sparda! Ready, go, select the difficulty level between the two initially available, and you are catapulted into the middle of the action and in the role of Nero, Dante's nemesis and also infused with demonic powers that manifest themselves in the form of his right arm , able to give him unexpected and always useful moves in combat. The initial part is well known, in fact it takes up the locations already seen in the demo available on PSN and Xbox Live and immediately absorbs the game structure, decidedly similar to the previous chapters. Twenty missions in all, interspersed with highly spectacular pre-calculated sequences, in which you have to reach a certain point and face the numerous enemies and bosses present, in an attempt to thwart yet another threat that this time sees the human nature trying to obtain more power. bigger than her, opening some portals that connect the human world with the demonic one. The key configuration, fully customizable by the player, involves the use of the triangle (or Y in the 360 version) for the sword, the square (X) for the pistols, the X (A) for the jump and the circle (B) for the grip, a peculiar feature of Nero. As per tradition, there is the possibility of using these keys in conjunction with the back keys to perform more sophisticated moves and above all the combos, which contribute to increasing the famous style points, useful among other things for make your attacks more powerful and acquire more orbs. The latter, as always, are of various colors, with the red ones dominating and necessary to purchase items that increase the various energy bars. At the end of each level, based on some factors such as the time taken or the style points themselves, the game will provide the so-called proud souls, which can be spent to add new skills to the main protagonist, and enhance one aspect rather than another. Nero, who apparently appears to be Dante's younger brother, with a cleaner face and a suit from a competing brand, obviously cannot spare himself from being in possession of various demonic powers, thanks also to the revived Yamato sword, full of power that can be released cyclically by increasing the appropriate bar and extremely useful in boss fights, the real dominant point of this fourth chapter. In fact, you will find them everywhere, small, medium, giant, some of which are truly spectacular and interesting to defeat. You, son of Sparda! Just when Nero she seems to have given everything, and that good boyish face of his begins to tire, the game takes a swerve and allows Dante to be governed (we don't tell you from which mission and until when, ti), who, while making some appearances already previously, at a certain point it enters history by force, with its own charisma and above all by proposing a different control and combo system. No longer a demonic arm for grips, but four different and customizable styles (we advise you to focus exclusively on one, at least in the first round), some accessory weapons worthy of the gadget inspector, and a lot of wickedness, which make, at least in our way to see, its use even more fun. Too bad that, on the other hand, the major defects of the game are concentrated and manifested precisely in these missions, equipped with a structure that makes its own somewhat antiquated mechanics, with not very interactive levels, some flaws such as the possibility of selecting objects only via the menu and above all excessive backtracking and reshuffling of the bosses themselves, who are faced several times instead of proposing new ones. To this we must add the presence of puzzles that are anything but demanding and above all amusing, indeed we would say a couple rather annoying. Style makes the difference Luckily, the extreme confidence that you immediately have with the two main protagonists, the excellent interlude sequences and the often spectacular clashes take care of keeping everything afloat, despite being so to speak retro the mechanics of Devil May Cry 4 remain in fact quite fresh, and the game ends with satisfaction, thanks also to the skilful reshuffling of the action. Another trademark of the series is replayability, a clear distinction between any game and a strong brand like that of Devil May Cry. In fact, completing the adventure for the first time represents only the beginning for a game with such a hardcore vocation, new difficulty levels, a survival mode consisting of 100 levels, photo galleries and videos are just around the corner, in an attempt also to acquire all the skills of Dante and Nero, which after a first round are obtained only in part and are necessary to unlock all the objectives, also present on the PlayStation 3, even if not linked to any gamertag. The graphic sector of Devil May Cry is a clear example of how the ~profession~ counts before the purely technical realization, in fact if the title is examined in detail the gaps are clearly noticeable, such as textures ranging from good to barely sufficient, environments never too big and manual camera only at the discretion of the programmers, on the other hand we have an absolutely satisfactory overall impact, thanks to the excellent shots, how the sources of light and shadows are used, and the animations, all always and inextricably at sixty frames per second. The music follows the common thread of the previous chapters and goes according to taste, we would have expected them to be less repetitive, especially in the fights, but in general they always guarantee an adequate accompaniment, and culminate with a song entirely sung in the end credits.", "date": "2008-02-13", "grade": null}