{"name": "Sam &amp; Max 203: Night of the Raving Dead - Recensione", "ref": "https://multiplayer.it/recensioni/sam-amp-max-203-night-of-the-raving-dead-recensione.html", "text": "They walk among them Narratively, the chapter begins with a device still unpublished for this serialization of Sam & Max, showing a video that sees them trapped inside a sort of Venus of Nuremberg, with spikes that threaten their life by approaching more and more menacingly. A few seconds and the flash-forward stops, bringing the attention back to the contemporary and specifically inside the usual, increasingly worn-out office of the two freelance policemen, with a zombie bursting through the door. An always very brilliant starting point, which from a now consolidated tradition develops first in the neighborhood and then through the new setting. The first big news concerns the recurring characters, who in one way or another have undergone small or big revolutions: Bosco is untraceable for the first time, so much so that the doors of his emporium are strictly closed, while poor Sybil is intent on interviews to find a replacement for her previous boyfriend, the head of Abe Lincoln, from whom she recently broke up and who is stationed, desperate, in the nearby Stinky's Diner restaurant. From a playful point of view, Night of the Raving Dead adds nothing to past appearances, placing the emphasis on the accessibility of the puzzles, increasingly perfectly balanced so as not to reset the challenge rate without at the same time being too complex and therefore slowing down the action. The gothic and gloomy atmosphere manifests itself by asking for improbable brain tosses, garlic cigarette poisoning and strange dances complete with limbs separating from their original locations. Among the moments that are difficult to forget, it is worth mentioning a couple singing performance with the player in the unusual guise of a lyricist intent on choosing from a series of inconclusive possibilities and a session in front of the DJ console, with some of the instruments that characterize those actually used in the musical field. Finally, good longevity, slightly higher than usual and able to prolong the events for about four actual hours. More Sam & Max for everyone What was most impressive when recovering the first print copies of Season 1 was the very small space occupied by the executables, evidently sufficient to contain such great quality. The well-deserved success achieved prompted TellTale to invest in the creation of a richer product, as it evident by the nearly doubled size achieved by this Night of the Raving Dead. The castle of the vampire Jurgen is large and very rich in details, as are practically all the inserted structures, increasingly full of objects with which to interact and characters from which to receive information, through the ineffable dialogues of all time, surreal and hilarious. The control system and the interface are unchanged in their extreme functionality, while graphics and sound are at truly remarkable levels and in particular the dubbing, is a candidate to be among the best seen in the last period. A couple of observations We take advantage of the monthly space dedicated to the Sam & Max review, to report how in all likelihood we will be able to talk about them again within a very short period of time. The first note concerns the new space dedicated to job offers on the TellTale site, which is now asking for people capable of programming on the Nintendo Wii. Difficult to say which project we are referring to, but one can imagine how well the Wiimote can be adapted to a graphic adventure, as recently demonstrated by Zack & Wiki. Finally the GDC, where the American developer will be present and from which we will certainly have the opportunity to report some juicy news, perhaps after a direct meeting. Comment The judgment on Sam & Max: Night of the Raving Dead is, as for almost all the previous chapters, really positive, seeing the virtues that are imposing this series as one of the most important in recent years maintained. The humor is of extremely high quality, as is the narration and the general impact given by the artistic-technical sector, which remains a feast for the eyes without overburdening the demands of the minimum configuration. To be bought without thinking about it if you are a regular in the series, for everyone else it is as good an opportunity as any to begin to get to know it. Pros The undead (and a vampire) walk in Europe Slightly longer-lived than usual Nice to see and hear Cons No major innovations We're already, almost, at the halfway point of the series PC - System Requirements Minimum Requirements Processor: Pentium 3 800 MHz RAM: 256 MB Video Card: 3D 32 MB Disk Space: 240 MB Recommended Requirements Processor: Pentium 4 1.5 GHz RAM: 512 MB Test Configuration Processor: IntelCore QX6700 RAM: 2GB Video Card: NVIDIA 8800 GTS 320MB Sam & Max 203: Night of the Raving Dead is available for PC. The theme of the season is now clear to everyone: Sam & Max have decided to accept only those cases that take them around the world, to destinations as exotic as they are mysterious. If the first two episodes dragged the intrepid duo to the Pole and then to Easter Island, this third outing certainly seems to have no less charm, standing out in the background an absolutely unprecedented Germany, home to vampires and the undead. Europe and its customs, as well as an infinite series of literary and cinematographic quotations, will therefore be the main themes touched upon with the usual wit and lightness, pressing the hand on the exasperated need to appear imposed by modern society, in addition to the homologation of customs and the fragility that often characterizes human relationships. As always, the events must be traced back to the presence of a formidable enemy - even if the traditional ironic and light-hearted characterization makes him very little credible - which in this case is none other than the heir of Nosferatu, a Eurotrash singer, as per the definition given by TellTale, who in his castle located in the town of Stuttgart is intent on creating a veritable army of zombies.", "date": "2008-02-13", "grade": null}