{"name": "Bubble Town", "ref": "https://multiplayer.it/recensioni/bubble-town.html", "text": "This title developed by Oberon Games is the mobile version of a semi-unknown pc game, Scrubbles, but not only. Bubble Town is above all one of the innumerable offspring of the legendary Puzzle Bubble arcade, even if there aren't the old dragons and marbles of the past but a cannon and lots of colored spherical aliens. We will use the cannon positioned at the bottom of our screen to direct the shots and go and attack the ~borbs~. Every time we form chains of three or more colored extraterrestrials they will fall to the ground, but we will have to hurry as the ceiling from which they hang gradually approaches the ground. The novelties presented in Bubble Town are certainly not of absolute importance but in any case they allow you to live a certainly satisfying experience. Let's take a look at these innovations together. First of all, the inclusion of power ups has made the gameplay more modern and above all with the use of some of them, the control and the possibility of managing shots becomes much more immediate and fun. For example, the viewfinder allows you to manage 3 consecutive shots with precision, or the Hotfoot shot that allows you to reach our goal without obstacle. The other novelty is given by the Borbs, which make the experience very cheerful and deeply characterize it. These funny extraterrestrials are very particular, among all we want to remember those who block shots, and must be canceled by matching other extraterrestrials, and sleepyheads who must first be hit with a sphere of the same color before being eliminated. The 31 levels that make up this puzzle game are certainly not very many but they will captivate you and in short you will no longer be able to do without them. Technically Bubble Town is certainly a nice surprise, colorful, with a precise control system and very defined in detail, just a pity for some inexplicable slowdown but certainly not very serious. PRO It's Puzzle Bubble Very colourful AGAINST Only 31 levels It does not excel in originality", "date": "2008-02-06", "grade": "S.V."}