{"name": "Gradius V", "ref": "https://multiplayer.it/recensioni/gradius-v.html", "text": "Throughout history it is completely normal that the changing tastes and playful habits of the public, as well as production models and market directions, determine the rise and fall of certain videogame genres. Many of these, in vogue years and years before, often continue a lethargic life in the shadow of fashions, perpetrating themselves with few but good specimens in the undergrowth of the few remaining enthusiasts or the few new followers. Nothing belongs to this category more than Gradius V, and the recent re-release in a single collection of the classic Gradius III and the almost-unreleased Gradius IV is proof of Konami's attempt to pull proven mechanics out of the drawer. Bread for hardcore gamers teeth, Gradius V goes alongside R-Type Final or Contra: Shattered Soldiers as a title certainly not within the reach of everyone's patience and application. Those who love or have always loved extricating themselves from thousands of lethal bullets on the screen, honing powerups with strategic tenacity and repeating levels to perfection in the fight against the complexity of the videogame monster - up to the coveted victory - will love Gradius V (with some reservations nitpicking) as he had adored Contra's similar (but better managed) project: Shattered Soldier or acclaimed the quality of the new R-Type. For those who do not fall into this category of players, trying before buying is certainly recommended. For their part, gamers in search of relaxation, lazy people and lovers of beautiful plots to watch from their armchair would end up spoiling the game DVD just as the game would appear to them to spoil their patience. Gradius V faithfully reproduces the mechanics that made the series an all-time classic. The movement is not analog but strictly digital, and the play area respectfully in 2D scrolling. But it enriches it, as well as with massive doses of polygonal cosmetics and light and effect shows, with some novelties in the control system which, although not perfectly implemented, adds considerable strategic depth to the new chapter. The typical scene of the Gradius player, since the first episode, sees him destroying the first ranks of enemies to collect the fundamental powerups. These will accumulate numerically in a horizontal bar, in which each type of power-up requires a certain number of power-ups collected. Thus, each degree out of six of the ship's increased speed, initially very slow (the focal point, this, and cross and delight of the series), will be worth a powerup collected and used by pressing the confirmation button; stacking two will provide us with lateral missiles; three of a double shot; four of the laser; five of one of the four cumulative ~options~, here for the first time called ~multiple~, which consist of a pod that will faithfully follow our spacecraft (quadrupling, if combined, our firing power); and six power-ups will be worth a shield that will deal with a good number of otherwise lethal attacks for our ship. Loyalty to tradition and renewed cosmetics Building and above all maintaining the powerups obtained and the modules, the only weapons that will resist the loss of a ship, is essential to make your way through the swarms of enemies that crowd the levels, against which the volume of fire is also an essential defensive factor. The choice between several alternative modules of power-ups that follow this scheme is typical of the series, but the big novelty of Gradius V consists in the possibility of controlling the pods of the spaceship in four different ways, determining directions and cumulation of attacks and adding a strong technical and strategic component to the already challenging gameplay. The first pattern is the classic one, but pressing the R1 key causes the rotating pods to lock in the position they were in. A second pattern inverts the first, as the R1 button causes the pods to rotate (excellent for self-defense), whose shot can however be combined with our solo with somewhat difficult maneuvers, which manage to move them back into alignment with the spaceship (therefore not indicated for surgical attacks). The third model features controllable movement from the aligned position to above/below the spaceship. The fourth model, the most innovative, allows you to fix the shooting direction of the pods, so that you can direct their fire towards the important points of the bosses or the action even if the spaceship is unable to move. Unfortunately, the choice of direction is roundabout, cumbersome and above all blocks the spaceship up to the choice of direction, making the operation more frustrating and pernicious than technical and executive. Despite these caveats, the introduction of pod control actually adds weight to the gioco, in the branching out of whose levels the choice of one model or another can be crucial and fatal, also given and considered the scarce credit concessions towards the gamer. Loyalty to tradition and renewed cosmetics With Gradius V Konami has kept the gameplay and feel of the glorious series of shooters intact, with the choice of strictly 2D control and with some innovations that have attempted to enrich the classic mechanics without distorting them. The experiment worked, but it could have worked even better. In the first place, the control of the pods seems to be only half completed, and risks crossing the thin line that divides the cumbersome from the technicality: it does not reach the levels of excellence of Contra: Shattered Soldiers, a different title but with which Gradius V nevertheless shares brand, polygonal engine, repertoire of textures and many programmers. Secondly, we would have appreciated a little courage on the side of analog controls: the possibility of choosing between digital and analog control, not to mention its applicability to pod control, would not have been blasphemous or disrespectful of tradition at all. In this way, however, we are witnessing almost a half step forward (it must be said that R-Type Final, in this, had even been stopped), with the problem that a title so far out of today's charts will hardly enjoy soon of a sequel. A pity, considering the excellent workmanship and longevity of the game: eight levels of increasing (up to excess) difficulty, imbued with a fantastic aesthetic proposal that is also worthy of the brand. No souls or urban contemporaneity in between, just a great hybrid between industrial mecha aesthetics and biomechanical and horrific elements worthy of the forgotten Salamander. Lots of polygons and a frame rate almost always nailed to fluidity, as well as a large variety of explosive and light effects that make good use of a 128-bit hardware, successfully manage to transport the gameplay of times gone by in the renewed technological dimension. Gradius V, along with R-Type Final, is a living fossil of a forgotten genus. It is fortunate that fans of the complexity and technicality of the ~zero degree~ game can enjoy a few but excellent titles like this, which in the eyes of the casual or non-enthusiast player end up being boring, frustrating or intractable. The purchase is therefore obligatory for enthusiasts (who can add an abundant vote to the total), also so that the genre is not precluded from an already difficult destiny. For others, the rule ~for many, but not for all~ applies. Pros: A great vintage shooter, with good news Excellent cosmetics and aesthetics A challenge for true hardcore gamers Cons: A challenge for true hardcore gamers Gradius V is an old-school side-scrolling shooter with tons of bullets, levels to master, no concessions to distraction or error, and the demand for sustained endurance: a dose of tenacity, memory, and reflexes that belongs in the cultural repertoire of a couple of playful generations ago and which Konami has dusted off and repainted with 128-bit graphic colors to the delight of hardcore gamers who love biomechanical aesthetics.", "date": "2004-10-27", "grade": null}