{"name": "Kingdom Under Fire: Circle of Doom - Recensione", "ref": "https://multiplayer.it/recensioni/kingdom-under-fire-circle-of-doom-recensione.html", "text": "Dreams and plot fragments The plot has never been the strong point of Kingdom Under Fire, but while in the previous episodes it was still possible to enjoy a logical development of the story, with a plot and some insights into the characters (although we never deviated too much from the parameters fantasy in the most ~epic metal~ sense) in this Circle of Doom we are witnessing an impressive dismantling of the canonical narrative structure, basically replaced by a non-story, which in fact does not take place, during the levels infested with enemies. As in the previous chapters, at the beginning of the game it is possible to choose one of four characters (plus two other secrets, unlockable by completing the main quest), each characterized by different parameters (speed, resistance, strength) and by a different background, with relative plot. Once the character has been chosen, after a brief introduction, one is immediately launched onto the battlefield, basically without understanding what is happening and why one has to fight and continue through the levels. The plot is not told through cut scenes or videos, but through a truly original initiative: within the levels we will find ourselves in the presence of some idols, with whom it is possible both to trade or modify the objects in our possession, and to sleep. When we choose to sleep we are transferred to a dreamlike plane, where we can interact with various characters, depending on the chosen protagonist. It is in this moment that the story advances, or rather it should advance, because in fact one gets the impression that practically nothing happens, or at least that what is said in the dream world is not then reflected in the game action. By talking in a dream, it is possible to both advance the story and activate the sub quests, useful for learning special attack techniques. The lack of narrative thickness is however evident, since the scarce lines of dialogue are not even enough to shed light on the fundamental elements (who we are, what we do, where we are going, essentially), and above all there is absolutely no connection or progression between the stories of the characters and the action, making this particular idea of dreams almost a ploy to be able to insert scattered plot elements disconnected from a structure that essentially aims at pure action, without being able to identify the player in any way. Hybrid nature The deviation towards a more action-packed meaning of the dynamics should not suggest a complete subjection of Kingdom Under Fire to the most vulgar line of button mashing. Although at first contact one may have the impression of being faced with a reduction in a simple arcade without thickness, complex role-playing elements remain which considerably deepen the structure. The parameters that characterize the characters are three, and on these the experience points that are collected by advancing in level can be distributed as desired: energy (hit points), ~stamina~ (attack points) and luck. The first and third parameter respectively represent the amount of hits that can be suffered before the game over and the possibility of finding more or less rare objects at the end of the battles with enemies. The second point is instead the one that more than the others characterizes Circle of Doom as an action RPG: the stamina bar is in fact consumed by carrying out any attack action (both hit and miss), in a manner proportional to the damage capacity of the weapon or magical attack. This represents the fundamental difference between the game in question and a button masher: every action must be well calculated and calibrated in order to minimize the possibility of remaining with the stamina bar at zero (it is automatically recharged in any case), and therefore face-up to enemy attacks for a few seconds. Obviously, by investing experience points in this parameter it will be possible to increase the possibility of carrying out powerful attacks in sequence, but to develop a balanced character it is also necessary to keep the other two at a good level. Different types of attack are available to be assigned to various slots, essentially summarized in: short-range weapon, long-range weapon and two of your choice of special and magical attacks. The latter can be learned by activating missions during the dream phases, which essentially require the elimination of a certain number of particular types of enemies, and can be removed or assigned to one of two hotkeys free from the two main attacks . The weapons, on the other hand, are personalized for each character, and follow the basic characteristics of the various fighters (specialists of white weapons, mace, firearms, etc.). The displaced idolsfor the levels they also serve to barter objects and weapons, or to modify the latter through the synthesis process. The latter works by combining a weapon with an object, and investing an appropriate amount of gold to ensure a good percentage of success. Depending on the value of the weapon, the object in question and the money invested, good evolutions of the initial tool can be obtained. One Man Army Once the most strategic elements of the game have been reported, it must be said that the actual action does not differ much from that found in Ninety-Nine Nights, just to give an example. You advance within dungeons with somewhat constrained paths, finding yourself facing various waves of enemies who will attack us in disproportionate numbers. There are no particular behaviors and complex attack patterns on the part of these hordes: in fact, the rather deficient AI allows us to easily get to grips with the most crowded situations simply by mowing down entire groups of enemies without them being able to propose a interesting diversion. The only strength of the various creatures is therefore their number, and the resistance to attacks which will increase as their level increases. Certainly, it is often necessary (particularly during the clashes with the occasional boss) to resort to long-range weapons, or to use special attacks to create variants, but it is not easy to find situations in which one deviates from a moderate button mashing, in which the main concern is to measure the amount of stamina to use and occasionally take advantage of a healing potion. This relative tranquility can be interrupted in some situations, in which a diametrically opposite situation occurs: in levels with narrower spaces, which do not offer escape routes, it can happen that you get stuck in a loop of enemy attacks which in fact do not allow any response, with a frustrating rhythm that leaves no time to dodge or fight back, and leaves us at the mercy of the enemy until a momentary drop in pace thanks to which we escape from the situation. In both cases, the gameplay certainly doesn't shine for its ability to offer a balanced and fun challenge, and above all it fails to prevent tedium from taking over after a few hours of play, unless you are an avid fan of dungeon crawlers. Convivial fray Circle of Doom finds its reason in the online multiplayer game action, which was not by chance considered a key point already in the design phase by Blueside. Basically, the gameplay and the general structure do not change, even all the defects that characterize the title in question remain unchanged (monotony and poor sense of identification in the first place), but the possibility of creating a company with up to 4 players, and with it, launching yourself into the enemy ranks by hitting all together is a decidedly more interesting prospect than doing the same things alone, without being able to count on the contribution (necessary, in the case of single player) of a good narrative substrate. Playing in multiplayer also increases (or at least this was the impression, during the test) the possibility of finding interesting and valuable objects and weapons. Treasure and equipment hunters will therefore find it necessary to go online. The gaming experience is also fluid, without any latency problems even in the most agitated sections. Lights and shadows Even the technical sector of Circle of Doom follows the sketchy aspect that characterizes its entire structure. The settings are very different from each other (although they are not very many) and some are very accurate and detailed, with a good characterization, but it is really hard to find the next gen spark in the midst of the chaos caused by the camera problems and other flaws . The shot is freely rotatable at 360 degrees, but despite this it never manages to fully satisfy. By default, it frames an insufficient portion of the screen, and in general tends to remain ~behind~ with respect to the sudden movements of the protagonist, or to literally get stuck in the narrowest spaces (such as interiors), where polygonal interpenetrations in the foreground and strange often occur geometries in front of the screen, due to an excessive zoom on the character imposed by the lack of a correct spatial calculation. As if the camera wasn't enough, the movement of the screen is affected by acute and frequent desynchronizations, and a generalized tearing problem, although frankly we don't notice an excessive squeezing of the graphics engine (which frankly seems to have been transposed without too much effort from a model of generation prplatform surplus). The polygonal models of the characters are saved, some really beautiful, according to the traditional artistic direction of the series, and particularly cared for in the ~dream~ phases, and the enormous quantity of elements on the screen simultaneously, a feature that had already made the history of Kingdom Under Fire. The audio sector consists of dialogues in Italian of somewhat fluctuating quality but with decidedly good moments, normal effects and a musical accompaniment which, a little opaque compared to the previous chapters, but with some themes of a discreet level. Comment The desire to innovate that characterizes Phantagram and Blueside is certainly commendable, but the idea that derives from this Kingdom Under Fire: Circle of Doom is that it would have been decidedly better to leave things as they were and concentrate on a simple improvement of the structure appreciated in the past episodes. The thing somehow seems to have become evident even to the producers themselves, considering how they hastened to reassure the public about a return to the original RTS-RPG dynamic that will characterize the next episode (which, however, will also draw something from this Circle of Doom in its heralded MMO essence). The fusion of genres didn't work this time: on the one hand the game looks like a button masher castrated by RPG ambitions, on the other an overly simplistic RPG. In any case, what emerges above all is the thread of boredom that surfaces after a few hours of play. Fans of dungeon crawlers or those who will be able to find Diablo for consoles in this title (which actually isn't there) might appreciate it, but all the others will hardly be able to enjoy it for long.Pros The idea of the dream plan is interesting. Excellent implementation of the online multiplayer Cons Graphics with different highs and lows Hybrid structure poorly blended and repetitive Plot practically non-existent Xbox 360 goals Circle of Doom contains 32 unlockable achievements for a total of 1000 Gamerpoints. Most achievements are achieved simply by progressing through the game, overcoming particular obstacles or completing the game for each character. Some other objectives are instead linked to the achievement of particular requirements (experience levels or results of some kind). In general, it is not too difficult to collect most of the points, especially for those interested in tackling the game in single player and completing it with the various characters.", "date": "2008-02-05", "grade": null}