{"name": "Hoa", "ref": "https://multiplayer.it/recensioni/hoa-recensione.html", "text": "Sometimes when we talk about indies we tend to classify games produced and created by small/medium teams as something that must remain anchored and relegated to the niche market of people interested in the various Kickstarters or other crowdfunding. Nothing could be more wrong, especially in the last period, in which all people with creativity and imagination can indulge themselves with the multitude of free tools for making video games. The Skrollcats are a studio that actually lies in the middle, in the no-man's land that divides indie studios from the more famous ones: this can be seen from many details of their beautiful Hoa, a game that really makes you think about how much artistic potential there is in tour. In Hoa's review we will see that the title is clearly inspired by the ~Ghibli~ style with its pastel colors and that glow that pervades every single frame, things that make little Hoa's journey a pleasure for the eyes and ears. Every creature, every tree, every component of the game dynamics oozes creativity and art from every single pixel. Story and pace One of our little Hoa's friends During the short journey that will lead us to discover the story and the motivations that prompted the protagonist to go her way, we will meet creatures who will tell us about the vicissitudes that preceded and motivated the journey we are on. There are no skill trees and no enemies to face, no obvious threats in any of the 5 game maps and you will never feel like you have to ~hurry up~ to do something. You can easily enjoy the fantastic soundtrack, masterfully treated in detail to accommodate the atmosphere of each individual game stage or run and collect all the butterflies that will lead you to advance in the story. Either way you will get lost in the colorful magic of Hoa. What is the protagonist you say? Well know that just revealing it would destroy the whole shack. The final twist is there and it must be admitted that the whole thing is a nice way of telling one of the real problems that grip us every day: the destruction of the environment and mother earth by man and machines. We leave it up to you to discover how we get to talk about it. The only thing we can say is that we were blown away by the emotions aroused during the final minutes of the game. Sore notes Fly with ladybugs! Leaving aside the well-known pleasant graphic and artistic style in general, we come to the game mechanics. Hoa (which is also the name of a Vietnamese ethnic group, the country of origin of the development studio) is a very simple platformer based on very basic dynamics. In a nutshell, in order to advance to the next level you just have to jump around the levels trying to get to collect the 5 butterflies that are requested by the protagonist's friends. So until the end of the game, with no particular enemies or chance to die. You never get the impression you're doing something wrong, thanks also to the minimal map and very simple reference points. The game has Metroidvania underpinnings, which sometimes force you to retrace your steps, albeit slightly, to find a missing butterfly or 2. Every time we bring the required amount of insects to the character on duty, we will be rewarded with skills that will allow us to be able to get where we couldn't before, such as double jump or gliding. The duration is also in the average of expectations for a game of this kind and is around 3-4 hours. Unfortunately, there are also no NG+ or extra content to unlock, but we trust in the talent of the development team and we are sure that the next products will be more complete from this point of view. Another really painful aspect is the price which, although below the triple A average (rightly) is too high for an experience so poor in content. The last hour or so of the game takes care of shuffling the cards on the table, which puts us in front of some really interesting dynamics and which we don't want to talk about so as not to spoil too much; know, however, that the very last level is, if possible, even more artistically sought after than almost the entire game itself. In short, Hoa is truly a feast for the eyes, for the spirit and for the ears. Perhaps more could have been done on the content and purely ~playful~ side but if the intent of the developers was to give us a little gem with undeniable artistic value, the goal was fully achieved.", "date": "2021-08-23", "grade": "7.0"}