{"name": "The Sims: Island Stories - Recensione", "ref": "https://multiplayer.it/recensioni/the-sims-island-stories-recensione.html", "text": "Tom Hanks? Robinson Crusoe? Amateurs. During the adventure it is possible to accumulate two types of resources such as food and materials, where the latter can be found by cutting wood or collecting the rubble present in various points of the island. The materials allow, through the Baratta menu, to acquire not only essential objects for survival such as bonfires, waste pits and beds, but also useful elements to improve the stay on the island, such as chairs, furniture, desks and lamps, for a total of over 100 items. Although you find yourself on a desert island, there is no shortage of work, and there are three careers such as: gatherer, hunter and craftsman. Depending on the path taken, from time to time you will come into possession of food and materials in different quantities. The gameplay of Island Stories provides a long and linear series of main and secondary mini-objectives which respectively allow you to advance in the game and improve the characteristics of the character. Each of these objectives proves far too easy, as there will be very explanatory descriptions on how to accomplish them. For example, at some point it will be necessary to look in the sand for a machete with which to make their way through the jungle, but digging anywhere on the beach, we will find the object on the first attempt, proving to be luckier than Gastone. In short, although the story and the setting are all in all pleasant, the title lacks a real difficulty to be completed, even if it must be said of how the secondary objectives add more spice to an otherwise too simple action. Outdated graphics During the game, it will then be necessary to keep an eye on our Sim's needs constantly, to avoid that the lack of comfort and characters to interact with (at least initially) lead him to drift even more than he is in the game. The island theater of events is divided into lots, accessible in a very functional way through a map that we will get hold of in the early stages of the game. Continuing the story, new areas will be discovered, making Island Stories very similar to an adventure. From a technical point of view, Island Stories offers a graphic engine more than 3 years old, which even if it is used in a quite functional way, cannot hide all the inevitable wrinkles, visible above all in the course of the numerous videos made with the same engine of the game. Although the PC on which the title was tested has hardware far above the system requirements, the times for accessing the initial screen and those for switching from one batch to another appear a little too long, considering also the fact that the zones are never particularly rich in elements to interact with. On the audio front, the background music is not very invasive and pleasant even if rather similar to that of the previous episodes. Comment The Sims: Island Stories can be played quite pleasantly, given the pleasant underlying idea and the game mechanics functional to the setting. The problems are linked, if anything, to the very specific choice to aim for limited and overly simplified gameplay compared to the main series. Longtime fans will find it all rather simplistic, while those who have never approached the series or prefer light games will find bread for their teeth. Pros: All in all engaging plot More like an adventure than a management Game mechanics functional to the setting Cons: Dated graphics Too simple Linear gameplay System requirements Minimum Requirements: Processor: Pentium IV 1.4 GHz or AMD equivalent RAM: 256MB Video Card: GeForce or Radeon with 32 MB of memory Disk Space: 3 GB Recommended Requirements: Processor: Pentium IV 2 GHz or AMD equivalent RAM: 1 GB Video Card: GeForce or Radeon with 128 MB of memory Disk Space: 3 GB Test configuration Processor: Intel Core 2 Duo 1.66 GHz processor RAM: 2 GB DDR2 Video Card: Geforce 7300 with 256 MB of memory The Sims: Island Stories is available for PC. The Stories miniseries has been representing Maxis' attempt for a year now to insert a plot within the world of the Sims, drawing on the settings and situations seen in the main series. Island Stories is the third and final episode after Life Stories and Pet Stories, which like the latter does not require The Sims 2 to work. Once the game has started, it will be possible to choose in addition to the tutorial, between two modes, namely Shipwreck Lonely and Wanmami Island. The former constitutes the actual story, while the latter allows for itselffreely read the starting lot and the Sims. Solitary shipwreck begins with the choice of the protagonist between Jessica and David, who however proves to be completely irrelevant for the continuation of the game, given that both show almost similar characters and moreover use the exact same phrases during the adventure. Once this is done, we find ourselves on an apparently deserted island, where the ultimate goal will be to return home. To do this it will be necessary to build a raft and create a comfortable environment, waiting for the preparations to be completed.", "date": "2008-02-05", "grade": null}