{"name": "Zack &amp; Wiki: Quest for Barbaros' Treasure - Recensione", "ref": "https://multiplayer.it/recensioni/zack-amp-wiki-quest-for-barbaros-treasure-recensione.html", "text": "The current generation of consoles has brought with it greater computing power, as regards Xbox 360 and Playstation 3, and an innovative control system, as regards Wii. However, the multitude of sequels to famous franchises seems to overshadow these novelties, in favor of a recycling of ideas and characters loved by the public. Capcom has been following this philosophy for some time but this time it presents a new product, with unpublished protagonists, which tries to exploit the peculiar characteristics of Nintendo's latest home console. Zack & Wiki is mainly a point-and-click adventure like you don't see often now, completely created around the Wiimote, the only control system provided. A fundamental part is played by the many puzzles that we will have to solve, all to be explored, manipulated and revealed thanks to the motion sensors integrated in the console's remote control. Zack is part of a group of pirates called Sea Rabbids and with his strange friend Wiki, a flying animal that can be transformed into a bell, decides to leave to be able to find the pieces that make up the body of the wise old pirate Barbaros Captain incurred a terrible curse. We will then get to know many of the characters who are part of the crew: from the eclectic Johnny Style, pilot of the group, to the oracle, able to give us advice on how to continue and to resurrect us in case of premature death, provided we pay a small amount of money. Plenty of puzzles The style of play is decidedly atypical and is inspired by an old series of PC adventures entitled Gobliiins: each level is fully visible on the screen, provided you move the camera away using the appropriate icon, and often the treasure, which represents the objective of our research, is there, a few steps from us, even if physically unreachable. We will therefore have to try to solve the puzzles that separate us from it by interacting with the environment and with the animals that inhabit the strange world of Zack & Wiki. In fact, every living being can turn into an object: just grab Wiki and shake it by shaking the Wiimote. Our funny companion will immediately become a bell which, with its sound, will change snakes into pincers, frogs into bombs, wild boars into drills and so on. We will then be able to collect the objects and use them to try to reach the treasure. So here is the best part of the game: each object must be used by mimicking with the Wiimote the movement that we would actually do during use. If we want to cut a tree using the scorpion - saw we will therefore have to keep the controller pointed at the screen, pushing it back and forth rapidly; the use of the boar - drill will see us rotate the Wiimote held horizontally like a crank, in order to set the tip in motion and so on. The movements are managed in a decidedly simple way: just press the A key and the duo of adventurers will immediately run towards the area framed by the pointer at that moment. By holding down the button and moving the pointer we will be able to make the protagonists walk with precision, simply by drawing the path to follow on the screen. The system works very well and interacting with the environment is a source of fun as each object practically activates a different mini-game that forces us to move by mimicking the various situations. Colors and sympathy The cast of Zack & Wiki is certainly one of the craziest seen lately: Capcom has decided to focus heavily on the characterization of the characters, portraying Zack as a young and inexperienced pirate who often indulges in reckless actions without imagining the consequences. Wiki for its part tries to represent the wise side of the duo and dispenses advice that helps the player to settle in better. Graphically, the game has a colorful and comic style, with the characters represented with good use of cel-shading and environments which, although not particularly rich in polygons or details, are always suitable for the context and decidedly pleasant. Unfortunately, as has already happened in many other Wii games, aliasing is definitely present and marked in this case too, especially if we're going to zoom in with the camera to frame the details of some obscure mechanism. A big round of applause goes to the animations, often hilarious, such as the one in which Zack, very greedy for chocolate, will start eating it profusely if we don't make him move for a few seconds or those in which the duo will particularly suffer from the heat or cold in certain situations . The sound front goes hand in hand with the graphic one, immersing the player in the strange world designed by Capcom, with very nice music and sound effects forfetti for the light-hearted and comical representation of the environment. All the characters will speak only using a few sentences that have been kept in Japanese and with subtitles in pure Nintendo tradition, with dialogues bordering on the surreal and comic situations that will elicit much more than a smile. The search for treasure The game structure is therefore organized in levels: the goal in each one is to reach the chest to seize one of the pieces of Captain Barbaros' body. As mentioned, each level is completely visible on the screen and the player will therefore have to try to ~read~ the environment to understand how to reach the treasure. The puzzles are divided between those based completely on logic, with puzzle-like games, those based on the use of objects, perhaps the most fun, and the totally crazy ones that will certainly put more rational players in difficulty. A peculiarity that could annoy you is the possibility of getting stuck: Zack & Wiki is a game that can be played in two ways, different in approach but identical in purpose. The player can spend long minutes studying the environment, trying to predict how it will change around him as a result of his actions and thinking about how to use the objects at his disposal to arrive at the solution. The other method, the less reflective one, is simply based on trial and error: we will therefore be able to try to use any object anywhere in the environment, hoping to be able to find the right combination perhaps helped by a stroke of luck. The second approach, which should therefore be used sparingly, carries with it a risk: precisely that of getting stuck. In fact, by solving the various puzzles randomly we will be able to run into some problems: we will be able to break an object that we will also need at a later time, or block an area of the level in which we will have to return to reach the chest. In these cases we will be able to do nothing but restart the level, paying more attention to our actions in order to avoid blocking ourselves again with no way out. The score will also be influenced by the style of play: each level has a number of points that can be earned by solving puzzles. The game will therefore give a vote to our work by rewarding actions performed correctly on the first attempt and punishing those that are clearly incorrect, sometimes even with death. The game therefore calls for shrewd behavior, which first involves a planning phase, followed by methodical and intelligent action. However, the severity imposed by the game mechanics is not as heavy as one may be led to believe at first: if you have no idea how to proceed, you can ask an oracle who will offer advice, even if often in a somewhat ' cryptic, to be able to continue. Even for the premature death of Zack there is a remedy, by paying a sum to the oracle we can be resurrected immediately before performing the fatal action. Rewards and rich prizes Comment Zack & Wiki is certainly an important title for the Nintendo console, as it innovates in the use of the Wiimote by offering not only mini-games for their own sake but integrating them into a complete adventurous context. The atypical nature of the style of play may annoy less thoughtful players and the possibility of getting stuck, having to restart the level from the beginning, could make the game unattractive for those who are always and in any case devoted to action. The possibility of playing in multiplayer adds greater depth to the title and can transform it into a different party game, where everyone can give their idea and contribute to solving the puzzles. Technically satisfying and rich in content, Zack and Wiki is certainly one of the most valid titles of this post-Christmas season at Nintendo.Pros Graphically satisfying Innovative for the use of the Wiimote and for the reflexive adventure approach Excellent in multiplayer Cons Difficult in some steps The possibility of getting stuck can be annoying", "date": "2008-01-22", "grade": null}