{"name": "Mega Man: Star Force - Recensione", "ref": "https://multiplayer.it/recensioni/mega-man-star-force-recensione.html", "text": "Comment Mega Man Star Force is a midway point. It is intermediate in the sense that it represents a small step forward compared to Battle Network (not so much in terms of the game structure, but in terms of themes), but which still cannot be considered in all respects as a 'new game'. It undoubtedly remains a good product for those who are ardent fans of the blue suit and for those who have not had the opportunity to try its new RPG guise on gba, for all the others it unfortunately remains a very avoidable product, waiting for Capcom to decide to roll up hands to bring back the shine on one of the most captivating and entertaining series ever. justify the presence of the game on Ds At times monotonous and frustrating gaming experience Mega Man Star Force is available for Nintendo DS Mega Man is one of the pillars of the history of video games, of the years in which the platform was taking its first steps, when Mario was just the name of an emerging mustachioed plumber and Rare invented the use of weapons for RC Pro AM racing player support. The story of Mega Man begins in the now distant 1987 as a classic horizontal scrolling platform: over the course of these twenty years its game structure has undergone considerable variations, passing from sports spin-offs and arriving at a hybrid RPG-Platform mode , which under the label 'Battle Network' (indicated as BN from now on in the review. Editor's note) has been able to give the character dressed in blue a new boost and breath of fresh air, so much so that the first chapters of that saga have been considered by many as among the best games featured on the GBA. However, times change and the world of video games often proves to be ruthless and very demanding, so the time has come for Mega Man to give a new twist to his long career, embarking on a new adventure called ~Star Force~. Just as BN suggested the themes dealt with by the game in advance (with characters that recalled the world of connectivity, and clearly internet-related environments), this ~Star Force~ easily lets the player understand what are the foundations on which the new adventure of Mega Man. In an unspecified future, terrestrials had proof of the existence of extraterrestrial lives, thus the 'Peace' project was born: an orbiting station with the express purpose of making contact and establishing any relations with aliens. Bad luck wants the station to disappear at any moment after an unforeseen event, leaving no trace but a small fragment; the years go by and the families of the disappeared are now resigned to the idea of never meeting their loved ones again, including the family of Geo Stelar, a young boy who is very little devoted to sociability and school life, who spends his evenings watching to the sky waiting for a sign of the presence of his lost father. Geo, one day three years after the accident, comes into possession of one of his father's tools, the Visualizer, an object that will prove to be the connecting bridge between the earthly dimension and that of the masses of energy, allowing the boy to travel between dimensions in search of clues about the disappearance of the Peace. The long-winded introduction to the adventure ends with a series of briefings on the possibilities offered by the game thanks to the expedient of the Transer, a kind of portable terminal in the possession of all human beings which is worn on the wrist, and which represents the presentation of the player and in the same way as the characters featured in the game. The transer works in the same way as a personal card and -at the same time- as a PDA: it receives the emails sent by the game (more often than not the real pretext for summarizing a series of commands just explained in-game), it allows the player to present his game statistics, to connect to wi-fi in search of challengers/travel companions, to write a short introductory sentence visible to all and - optionally - a series of 'secrets' visible only to 'Brothers'. The concept of 'brother' represents a large part of the gaming experience: it is in fact possible to associate with NPCs in order to be able to embark on the adventure together, as well as add a series of natural persons to your friends list, with whom it will be possible to exchange mails or thoughts (the famous 'secrets' mentioned a few lines above, potentially refer to this), or simply participate in fights. The game -unfortunately- has many similarities with the BN series, often ending up looking more like a spin-off with a rather different setting.to that a new course for this historic saga. The first deja-vu is represented by the visual setting of the game: colors, settings, character design and mega man himself seem to come from any chapter of the NL, leaving very little room for what could potentially be the game's innovative possibilities. The visualizer, as mentioned above, gives Geo the opportunity to physically see the world of energetic masses, and this is how he makes his first encounter with Omega-Xis, a mass far from his home planet who seems to know something about his father's disappearance of Geo, but which above all allows the boy to transform into a mega man and to face the EM viruses that are invading the planet earth. Geo's task is therefore to find the presence of viruses, enter the energy world thanks to the visualizer and eliminate his enemy thanks to the combined power of Omega-Xis. The battles are the second point too much in common with BN: like its predecessor, when GEO 'logs' in the energy world he finds himself fighting in a totally random way against some Beatable Viruses thanks to the use of the cards. The combat environment differs slightly from the rest of the game, temporarily abandoning the isometric 2D in favor of a more raw 3D view. The stage consists of a grid on which the enemies able to move horizontally and vertically are arranged; before each turn, the player chooses a pair of cards from the 6 in his deck, so that the choice reflects two simple rules: the cards taken must be on top of each other or they must be equal. The player has to move horizontally on the grid avoiding enemy attacks and making the most of the choice of the two cards, using the attacks selected at the right time to defeat the enemies as quickly as possible; in the event that the chosen attack is not enough to knock down the person facing you, just wait for a bar on the right of the screen to fill up, to have a new choice of cards. The biggest flaw of Star Force is unfortunately that of being nothing more than a mediocre chapter of BN, supported by a new setting, a new story and new characters: at a time when the series had to prove capable of changing course and detaching itself from limbo in which it had arrived, Capcom fails to lay the foundations for a new future in this direction. Also weighs the choice not to use the touch screen if for a few futile actions, which can also be done using buttons and the directional cross. In visual terms, the only improvement made by the ds concerns the possibility of keeping an eye on all the statistics and the actual game at the same time, definitely not much for what a game that wanted to be the beginning of a new branch of the saga. The idea of creating three different Mega Man Star Force (Dragon, Pegasus and Leo) is interesting (although not very original), but it is a pity that everything boils down to very few differences, including the largest represented by the mega man armor in the energy dimension.", "date": "2008-01-16", "grade": null}