{"name": "Soldier of Fortune: Payback - Recensione", "ref": "https://multiplayer.it/recensioni/soldier-of-fortune-payback-recensione.html", "text": "The important thing is not to lose your head Soldier of Fortune: Payback is a conventional and very short first-person shooter (the single player campaign is finished in five/six hours) which has the only outstanding feature being the possibility of dismembering enemies, whether they are alive or dead. In short, the limbs hit by our powerful blows detach from the bodies like black olives from the capricious pizza, in a riot of blood that splashes everywhere, coloring large portions of the ground red. Too bad that, after the sadistic exaltation for the splatter part, very little of beauty remains. Indeed, we can say without fear of contradiction that we are faced with one of the worst FPS of recent years, but let's go in order because the defects are really many. the choice of weapons is indifferent because around the maps you won't find bullets suitable for reloading them The important thing is not to lose your head Before each level you must select your weaponry: a primary weapon, a secondary weapon, a support weapon and grenades. The weapons are partially customizable, with the possibility of adding sniper sights (very useful, especially in the jungle) and silencers (completely useless, given that there is no stealth engine and that, whether silent or noisy, our shots will alarm everyone enemies in a certain area). Where is the problem? Simple: the choice of weapons is indifferent because you won't find bullets suitable for reloading them around the maps and you will soon have to change them with the more common ones used by terrorists, the only ones that will guarantee the possibility of replenishing ammunition. You will go through practically half the game holding the AK-47, the weapon most loved by the evil terrorist who must never ask. This wasn't enough, from the first weapon change you realize that the differences, in terms of damage, between a light machine gun and an assault one are minimal and that the only distinguishing variables between one weapon and another are speed reload time and aiming accuracy. Obviously there are different kinds of weapons (pistols, machine guns, shotguns, grenade launchers, missile launchers and so on) but they are almost all underexploited. Take for example the shotgun, the ideal weapon for disemboweling some corpse; unfortunately it is difficult to find a game section to use it and, above all, the bullets are so few that a couple of shootings are enough to be forced to change weapons. Moving limbs Someone may be wondering if at least the shootings are fun. One would instinctively answer ~no~, but let's see in detail what goes and what doesn't. The flying limbs and the blood that splashes here and there do their job and, in a sense, are the only spring that keeps the game going. However, most of the firefights take place from long range, with a rather ridiculous damage system for the player. Practically every shot received will cause a red vignette to appear which, becoming deeper and deeper, will indicate the deterioration of the state of health of our beloved mercenary. To recover health, just go undercover, wait a couple of seconds and you're done. We had already seen something like this in Clive Barker's Jericho, but there it was handled slightly better due to the supernatural powers the characters were endowed with and the presence of close-quarters firefights that made it more difficult to recover energy quickly . In Payback this system translates into: come out, kill some terrorists, when and if health has dropped badly go back undercover, recover, go back out, shoot, go back undercover, repeat until all enemies are eliminated. You arrive at the end of the game with a bad taste in your mouth due to the lack of close-quarters firefights, the only way to sublimate the possibility of tearing enemies apart. There are no heart-pounding moments, those adrenaline-pumping moments in which the body is filled with shocks due to the situation that has just been overcome. The lack of being able to enter a room with a weapon in hand, shoot wildly and see blood flow in rivers (Pierpi... put down that straitjacket, up). To get to the point, there is no level management that allows you to highlight the merits of the game instead of bringing out the defects. No, not the escort mission! Defects that, on the other hand, accumulate in front of the defenseless player who would just like to have fun. If you create a frenetic FPS and structure it as a tactical FPS you have to start reviewing your priorities, especially if you don't endow the villains with artificial intelligence such as to make the fights at least exciting. To call Payback's enemies foolish is to pay him a compliment. But it's better to do herealso specific example to make clear what a general exposition could lead to misunderstanding. First case. We are shooting at enemies from a distance, a terrorist (unseen) arrives from behind and positions himself right in our line of fire. Couldn't he attempt a surprise attack from behind? Second case. Three terrorists come out from behind a wall and run in the middle of the street. Obviously they don't think at all about staying undercover and they can't find anything better to do than kneel in the open field to get riddled with bullets (this fact is repeated throughout the game; you quickly realize that the terrorists absolutely do not know the concept of cover ). Third case. A handful of terrorists emerge from a shed and take a good few seconds to decide what to do. In the meantime we have already unloaded a lot of lead into his guts (this case repeats itself again and again). We understand the need to make them less reactive to meet the needs of those who play with the joypad, but a dazed enemy who instead of shooting us is waiting to be killed always makes a bad impression, especially on PC. Fourth case. You have to escort a prisoner to a secret passage. Well the dude has the same AI as the enemies. Practically during the shootings he does nothing but crouch in the middle of the battlefield, run towards the enemies without waiting for us, put himself in plain sight forcing us to make daring maneuvers to try to save him. Definitely the most frustrating section of the game. It didn't cost the game over he would gladly shoot himself in the head. Fifth case. A boss shoots us with a missile launcher that can kill us in one shot. What to do to beat him? Simple, just stay at the right distance and keep shooting at him when the crosshair turns red. The marrano will not in the least assume the possibility of getting close and will continue to shoot empty while we riddle him. If we wish, we could continue to describe the numerous cases in which the AI proves unable to create a minimum of tension and frustrates any tactical ambitions. The result is an easy game, very easy at times. Yet the third Soldier of Fortune is an extremely frustrating game... why? Checkpoint what a passion The save system is based on checkpoints, meaning you can't save freely but it's the game that saves at some specific points in the levels (as happened in Far Cry, to make the idea clear). Checkpoints are poorly laid out because they are sometimes very close together while other times they are extremely far apart. Actually this wouldn't be a big deal if there weren't two ~tricks~ that the CPU uses to kill us instantly: explosive shots and point-blank shots. Nothing too bad if one could save at will and weren't bound to checkpoints. Unfortunately, you often die without even understanding why and you therefore have to re-cross long pieces of level to try to find out where the lethal blow came from, risking suffering it a second time anyway. the most ridiculous moment is when a dozen enemies come out from behind a small fence that a few seconds ago was free as the air Checkpoint what a passion In some cases the enemies are positioned in such a way as to be invisible, so as to make our elimination safe. Another unbearable trick designed by the developers to embarrass the player is to make him emerge from behind the enemies. Not bad if the scenario motivated these ~apparitions~. Instead, often these are attacks that come from areas that have already been cleaned up and surprise more for the absurdity than for the difficulty to which they subject. A striking example of this defect is offered by the second level, in the area where a series of bridges must be overcome. Virtually the enemies appear invoked by some prankster magician. They don't come down side roads, they don't rappel down mountains, they don't leap from a helicopter. They simply appear out of nowhere in previously empty spots. The most ridiculous moment is the one in which a dozen enemies come out from behind a small fence that a few seconds before was free as the air. Soldier of Fortune: Payback is available on PC, PlayStation 3, Xbox 360. The tested version is the PC version. Miscellaneous and possible PC - System Requirements PC owners will be happy to know that you don't need a ninja PC to run Soldier of Fortune: Payback which, on the test machine, ran smoothly and playable at 1680X1050 resolution with details set to medium/ high. Minimum Requirements Operating System: Windows XP/Vista Processor: Pentium 4 2.5 GHz or AMD equivalent RAM: 512 MB Video Card: GeForce 6800 or higher / Radeon X800 or higherre with 256 MB of memory DirectX 9.0C DVD Drive Recommended Requirements Processor: Intel Core 2 Duo or Athlon 64 X2 2.0 GHz RAM: 1 GB Video Card: GeForce 7900 or Radeon X1900 with 512 MB of memory Test Configuration Processor: Intel Pentium 4 3.4GHz RAM: 2GB Video Card: NVIDIA 7800GT Comment We are very disappointed with this game. A B-series product with no highs and many lows that leaves the time it finds and whose only plus point is the possibility of dismembering enemies. A little bit. Too little to get him out of the limbo he deserves. Our advice is, unfortunately for the developer and publisher, to leave it on the shelves. Pros Enemy bodies can be torn apart Technically pleasing Cons Short Mechanical, low-adrenaline shooting All-time low AI Do you remember the first two Soldier of Fortune? Those programmed by Raven Software? It was then that video games discovered the joys and sorrows of the ghoul, the most advanced corpse dismemberment technology ever to hit our monitors. After five years from the second episode, Activision has decided to revive the series, producing the third episode. Unfortunately the development was not entrusted to Raven but to Cauldron, who in the past had delighted us with some medium-sized titles including Chaser and Knights of the Temple 2. Another notable absence is that of John Mullins, the protagonist of the first two episodes; absence that made many fans turn up their noses. What matters to know, however, is whether the final result is worthy of the name on the packaging or whether we are dealing with a mediocre product destined for eternal oblivion. The plot, inserted to justify the indiscriminate massacre of bad Islamic terrorists is very simple: in the role of a betrayed mercenary, you will have to get your revenge by thwarting the plans of a terrorist organization that has branches in different countries of the globe. Calculating that the only highly telephoned twist is in the first level and that for the rest of the game the narrative proceeds linear and flat like a surfboard, we are not starting very well. But let's not pay too much attention to the story and let's get to the action. Maybe it's fun.", "date": "2008-01-08", "grade": null}