{"name": "Sensible World of Soccer - Recensione", "ref": "https://multiplayer.it/recensioni/sensible-world-of-soccer-recensione.html", "text": "Always a game The title now available on the Live Arcade (at a cost of 800 Microsoft Points) is the direct porting of that ~World of Soccer~ released in 1994, which since 1992 had undergone numerous improvements and additions up to a stable and complete version after the The latest upgrade from 1996. SWOS is a magnificent combination of gameplay depth and management part, a synthesis as perfect as it is explosive and harmful to the free time of any football fan. The strong and synergistic combination between these two fundamental aspects has perhaps not yet been overcome, not even by modern next-gen titles, and it is for this reason that perhaps SWOS should represent a new starting point for the arcade football titles of the future. But let's not assume that everyone knows the title of John Hare. Sensible is a 2D game with a bird's eye view, super deformed characters made up of small bitmaps that run around quickly on the green mantle of the field and a number of teams and leagues that rival even its size FIFA08. Money management is very important, through the transfer market and a careful choice of players to sell or buy Always a game In addition to the classic challenge against a friend (now supported via Xbox Live), the highlight is certainly the single player career, which allows us to lead a team in the role of coach and lead it to cup and championship wins. Money management is very important, through the transfer market and a careful choice of players to sell or buy. You can choose between championships from all continents, starting from Japan, passing through Australia, Ghana, the USA, Europe, up to most of the South American states. Including the minor leagues, too. The characteristics of the players are indicated by three letters which summarize their main qualities: speed, kick, header, pass, effect, and so on; by evaluating these parameters we can then choose the players who best suit our type of game. Sore point that has always characterized SWOS: the names of the players are all mangled. Unfortunately it should be noted that the team has not bothered to update the rosters in our time, which have remained unchanged from those of the last version of 1996. Goal Scoring Superstar Hero! Describing the playability of Sensible is a difficult and complicated undertaking, suffice it to say that John Hare's title is one of those few games that makes you sweat every minute, experience the tension game after game, get furiously angry at every wrong goal but also exult like a child gone crazy by a well-crafted action that went well. There is depth, in essence, which means the possibility of being able to command and manage the ball as we want, through perfect control calibrated to the millimeter, with precise and never false collisions or arbitrarily decided for us by the CPU. In short, our actions on the Xbox 360 pad always generate faithfully expected reactions on the screen. The genius of it all was making the control work with one button, one button pass, shoot, cross, slide and header, combined with the analog stick. The additions made in this Xbox 360 version are numerous: first of all, the graphics have been completely transported in high definition, which allows us to look at those funny little heads in a new and satisfying way. Some details have been embellished and animated better, like the audience. The possibility of zooming on the field by pressing the analog has also been added, thus choosing the viewing distance we prefer. Being an Xbox Live Arcade game, obviously the possibility of playing online multiplayer has been included, and the achievements to unlock are also new for the series. The graphics have undergone other tweaks, such as the rain effect and other weather conditions, a concentric deformation during goals and some added bitmaps. John Hare's title is one of those few games that makes you sweat every minute, live the tension game after game, rage in a rage Goal Scoring Superstar Hero! Perhaps the only drawback is the difficulty of understanding how certain commands work; ourselves, accustomed to the Amiga version of SWOS, we have often found ourselves in difficulty in managing the various menus and options, as there are totally no commands on the screen. If two players are injured, for example, the one on the bench to be replaced with a teammate in the stands must not be selected on the name bar, but on his face icon, a small bitmap on the far left. Yet another example: to increase money offers during trades, one must hold prepress key A and move the digit to the right or left with the analog, increasing or decreasing it. Perhaps just pressing RB - LB would have been simpler and more intuitive, also given that SWOS must also be used by absolute newcomers to the series. In an absolute sense, however, we are faced with very few defects that are quickly put aside, in the face of such a great and fun game that has made the history of its genre and of all video games. Sensible Soccer is an absolute must-have for any Xbox 360 owner. Xbox 360 - Goals Sensible Soccer's 200 points are definitely tough to complete. Many of these will be unlocked in a completely random way, as they are linked to particular game combinations that are difficult to perform such as winning with 10 goals behind or scoring the winning goal in the 90th minute, while other objectives will be achieved by winning or playing for many consecutive hours . Comment Sensible Soccer represents the history of video games and one of the best football titles ever produced. What decrees the status of ~masterpiece~ to John Hare's title is there for all to see: after 16 years the gameplay is still fresh, fast, satisfying but above all extremely fun. As well as the management part, especially the very deep transfer market, equipped with an AI of its own and a vast database. The picture is completed by the welcome improvements of the HD graphics, the online game and some new options. A game to cherish and follow for a long, long time to come. Pros: Fast, immediate, perfect and fun gameplay Deep transfer market Online play via Live HD graphics Cons: Squads not updated Some difficulties to perform certain actions Sensible World of Soccer is available for Xbox 360. After months of waiting, the fateful Live Arcade version of one of the greatest video games in history is finally available for download on the Xbox Marketplace: we are obviously talking about the multi-postponed Sensible Soccer, which was initially supposed to return to our TV screens last summer, but was later postponed to the Christmas period after various vicissitudes. What better occasion to treat yourself to an old masterpiece? The New York Times only recently reported a short list of games that have represented an important turning point for the industry, a top ten made up of ten ~wonders~ also mentioned at the Game Developer Conference in San Francisco in 2007. Well, Sensible Soccer has had the honor of appearing alongside sacred monsters such as Tetris, Super Mario Bros and Doom. This brief anecdote helps to understand, for those who do not yet know the specific weight of the title in question, the depth and beauty of football according to John Hare and the legendary ~Sensible Software~ team founded together with his friend Chris Yates in Chelmsford, in England. It is known to most as ~Sensible World of Soccer~, but for old fans and friends it is always the good old ~Sensi~.", "date": "2008-01-10", "grade": null}