{"name": "Come d'Incanto", "ref": "https://multiplayer.it/recensioni/come-dincanto.html", "text": "To want to be hypercritical, one could immediately contest Disney for the fact that the Enchanted subject of this review has absolutely nothing to do with the film of the same name which appeared in theaters a few weeks ago: the plot is in fact totally different, and puts in the foreground a group of delightful inhabitants of the forest (a squirrel, a rabbit, a fawn and a wild boar) busy recovering useful objects to build a statue depicting the prince that Princess Giselle saw in a dream. In short, the game could easily have had another title, considering the fact that even in the gameplay Enchanted is anything but comparable to the film. Leaving aside similar considerations, it must however be noted that the Disney product turns out to be superior to what one would have expected. As mentioned, the title is made up of three distinct minigames, which are offered en bloc one after the other, for a total of 14 levels. The first, La Corsa di Pip, puts the user in the role of a squirrel who must jump from one platform to another in order to find his friend Bunny, in the meantime collecting various colored gems to increase the score: there is no shortage of enemies to avoid and obstacles of various types, which make up a platform section that is quite fun and certainly immediate, but also tremendously easy. The second minigame is Pull and Push, or rather the inevitable match'em up style puzzle: the goal, in this case, is to move the rows of fruits horizontally or vertically, bringing specimens of the same type closer, thus making them disappear from the grill. In short, a fairytale version of Chuzzle by PopCap Games, a gameplay that is always appreciated anyway. The so-called Jumps in the Forest closes the roundup, probably the weakest of the package: at the commands of a fawn or a boar, the user has to do nothing but avoid some obstacles by bypassing them or jumping over them, in an attempt to reach Giselle's cottage on as quickly as possible. Taken individually, the three minigames are very little, resulting extremely simple and devoid of a real coefficient of challenge: but united in a single product they manage to find a meaning, revealing themselves as a pleasant pastime which however risks becoming boring soon. Come d'Incanto is however a title aimed at a young audience, predominantly female (target which is the same as the film), as can also be seen from the cute and colorful graphics but which concedes very little to the virtuosity of connoisseurs. PRO Discreet graphics Great for girls and little girls AGAINST Challenge level zero Poor and repetitive sound It can get monotonous quickly", "date": "2008-01-08", "grade": "S.V."}