{"name": "Heroes Lore: Wind of Soltia", "ref": "https://multiplayer.it/recensioni/heroes-lore-wind-of-soltia.html", "text": "It has been quite some time now that mobile video games have gained their own identity, leaving the canons of simple ~thought-chatters~ to aspire to positions of far more relevance. Even the RPG genre, by definition rich in content and characterized by long playing times, has successfully landed on our terminals, representing an alternative choice to simpler and ~faster~ playful applications. Heroes Lore: Wind of Soltia is only the latest exponent of this successful trend, equipped with a decidedly classic structure that does not even have those small tricks (such as the automatic assignment of equipment) that make the experience smoother. A pure role-playing game, therefore, with merits and defects of the case. Once a new game has been selected from the start screen, we will have to choose our character from the three available (at first the choice is reduced to just one of them, the other two must be unlocked) and then assign him two elemental guardians. The latter have different characteristics depending on their nature, and will give us attack, defense or healing powers. Once this is done, we start in the traditional way: moving from our village, we will have to interact with the other characters and find the quests to face. The pause screen will give us an overview of the situation at any moment, also giving us the possibility to manage our inventory, equipment and so on. As in any RPG, the difficulty of the missions increases as you progress and it immediately becomes essential to provide for the enhancement of our character, which is obtained by defeating any enemy. In Heroes Lore, eliminating an opponent results in gaining points (to be spent on the purchase of improvements) but also money, with the latter which will allow us to enter various shops to get more powerful weapons, more resistant armor and various potions. It must be said that the enemies that can be encountered are really numerous and varied in appearance and characteristics, and furthermore the game does not have a random clash system: you can decide at any time to face an opponent or continue in the exploration, without any problems whatsoever. Of course, avoiding the level up will almost automatically result in defeat when we face enemies of a certain type. As for the technical aspect, Heroes Lore comes with graphics rich enough in detail, but really too small: playing at a resolution of 320x240 pixels, reading the numerous texts is really difficult as the characters are small, but in general a larger size of all the elements could only have benefited the playability, allowing us to fight with more ease. The great variety of enemies to face denotes a certain care, but even in this case the size of the sprites doesn't help and indeed limits the work done by the developers. The sound is basic, as usual, and can be safely turned off to prevent it from becoming repetitive quickly. Finally, nothing to say about the control system, which generally for RPGs does not present particular problems, is immediate and responds promptly to inputs. PRO Potentially very long-lived A large number of different opponents Interesting plot... AGAINST ...but the tiny texts make it hard to follow Very slow development Technically only fair", "date": "2008-01-03", "grade": "S.V."}