{"name": "Rayman Raving Rabbids 2 - Recensione", "ref": "https://multiplayer.it/recensioni/rayman-raving-rabbids-2-recensione_a.html", "text": "Around the world As the title suggests (and likewise their website), the theme for the return of the rabbits is just that: around the world. Tired of not knowing how to do anything except dance, the crazy and cross-eyed animals have given themselves over to tourism by mixing with ordinary people with the sole purpose of conquering the earth. Bad luck has it that Rayman comes to know of their evil and clumsy plan by pure chance, and that he rolls up his sleeves to defeat the entire gang. These are the premises from which Rayman Raving Rabbids 2 Ds takes its cue, premises that put the developers in the perspective of structuring the main mode like the chapter for Wii, with a series of locations to visit and mini-games to complete. And the biggest novelty of this chapter for DS lies precisely in the word 'minigames' which, unlike the first one that appeared a year ago, is no longer structured like a 'classic' scrolling platform (in the style that made Rayman famous). but rather to a genre that is certainly more appreciated on Ds and decidedly more loved when it comes to red-eyed rabbits: the collection of minigames. The main adventure unfolds through six postcards (United States, Latin America, Europe, India, Japan and Australia), each featuring six different mini-games to complete. Each mission is linked to a particular indicator which, if filled, unlocks an object to apply to your rabbit after the test is completed. The customization of the rabbit is in fact an element that is both absolutely accessory but of infinite fun: the objects to recover are divided into different categories, where the first collects the clothing (duly divided between hat, dress and accessory), the second of the backgrounds to color and customize and finally a series of applications/minigames like those already seen in wario ware (do you remember the tool for blowing bubbles into the microphone of the DS? Here, in that style). Making Fun (of everyday life) The proposed mini-games simultaneously exploit the ironic situations that made the saga famous combined with the classic controls present in games of this genre. The tests range from shooting balls of paper while the master is turned and then blaming the others, passing by the flight of the rabbit-superman making him avoid the bags, to the launch of the rabbit, a race on the logs, to then finish each block dedicated to a location with the now classic musical mini-game which, abandoning the 'samba de amigo' style legacy, takes its cue and quotes a much more famous and successful musical game on ds such as Ouendan (or Elite beat agent, as you prefer), where the task of player is to time press a series of balls that fall from the top of the screen. To complete the list of modes present, the points section should be noted, where the player is offered the exact same games present in the story mode, with the aim of beating a series of pre-determined records and with the possibility of uploading one's own best results online to compare them with other players. The multiplayer mode closes the train of modes offered by the game, with the possibility of challenging up to 4 players in local multiplayer (sharing or with multiple cartridges), on a selected list of mini-games, all of which can obviously be played in turns, one player at a time . Despite all the good will in wanting to give this episode for Ds equal prominence and importance to the one for Wii, there are many dark sides that pervade the game. The first and certainly more important and heavy (especially as regards the final evaluation) is the low longevity of the game: 6 locations for 6 missions make a total of 36 mini-games, of which 6 (the endings of each location) all similar with only backing track as an element of diversity; in addition, many other mini-games are repeated between the various settings, presenting trials based on the same rules and with different characters. To make matters worse, the fact of wanting to use the same games as the story mode for the points and multiplayer modes, is only useful to underline the fact that it only takes 2-3 hours to be able to see everything the game has to offer . Graphically, however, the product remains impeccable, not so much for the excellent quality of the final result as for the well-chosen design choices. Comment Rayman Raving Rabbids 2 Ds is a good game in intentions and a little less good in form, not so much for problems related to bugs or anything else, but for the actual poor longevity of the product, a real shame if you think of the amount of minigames featured in the Wii version. However, RRR2 is infinitely superior to its platfo predecessorrm, as history has already demonstrated, the true form of games based on rabbits is that of the minigame (initially even the first RRR for Wii was thought of as a 3D platform, and later transformed into the game appreciated by many) and therefore the path traced is the right one, now you just need to take what's good and continue the adventure of the craziest rabbits in the world. Pros Revamped game structure more suitable Many minigames are hilarious Customizing the rabbit as useless as it is, it's a good pastime Cons Too short Too many minigames similar to each other Limited multiplayer", "date": "2008-01-04", "grade": null}