{"name": "Mystery Detective - Recensione", "ref": "https://multiplayer.it/recensioni/mystery-detective-recensione.html", "text": "This crazy, crazy world Mackenzie is the young protagonist of our story, daughter of a well-known detective, and intending to become a renowned detective too: you, in her shoes, will have to accept the various cases that will be proposed to you (four main ones, plus a decent series of missions options) and use your wit, your powers of observation and the Nintendo DS stylus to solve them. Easier said than done: Mackenzie's world is not exactly normal, in fact it mixes an everyday atmosphere with surreal fantasy elements, anthropomorphic creatures and situations bordering on nonsense. The setting is intriguing and nice, but its illogicality also extends to the puzzles and missions that we will have to face, and here the whole concept of the game collapses. Anyone who played a product like Discworld more than ten years ago will surely remember the absurd world created by Terry Pratchet: here, in that adventure each puzzle maintained its own weird logic and was accessible to anyone who managed to grasp the clues and manipulate the ingenious and simple proposed interface. Mystery Detective completely fails in this simple but fundamental objective: the cases to be solved are already irrational from the outset, but the way in which one must proceed is absolutely senseless, given that in practice one plays by trial and error. The texts, although well written and entertaining, offer very few clues and the solution is often cryptic, requiring interaction with elements of the scenario that are not in evidence at all and that one would never think would be useful for narrative progress. In one of the first cases, a laundry net is obtained for catching insects: well, there is no reason or clue that makes this object useful for the purposes of the investigation, yet repairing it is essential. If the mere presence of the hole and of a butterfly that eludes capture suggests that that net can actually be fixed, it is the way that completely escapes any logic, clue or suggestion: how can you think that that spider web, tiny and almost invisible, mixed with the scenery and decidedly anonymous could this be the only way to repair the screen? Mystery Detective offers this kind of puzzles and practically no clues to solve them: after a scant hour of play you understand the mechanics and find yourself simply talking to every inhabitant of the city and then start pointing the stylus at random in every corner of the screen, desperately looking for an interactive element that allows to unblock the situation. And it's definitely not the right way to play a game of this genre. So cute! However, Mystery Detective presents itself as a captivating game, especially from a graphic and stylistic point of view: the character design is extremely funny and cartoony, and the various characters are decidedly adorable, from the protagonists to the simple supporting characters. The action normally develops on the lower screen, where it is possible to move Mackenzie using the stylus: the sprite of the little investigator enjoys a large amount of animations that make her nice and bizarre, as we explore the various detailed and colorful settings. At the same time, the upper screen proposes an original but half-successful idea: substantially a large artwork by Mackenzie represents his thoughts, so while in the lower screen we discuss with another character, in the upper one Mackenzie gets lost in her reasoning, often offering interludes comedians. The downside is that it is practically impossible to follow both the speech in the lower portion (which should be useful for solving the case) and Mackenzie's flights of fancy in the upper portion (which are amusing but often futile). It is a pity that the game does not live up to the technical sector, graphically irresistible, and decidedly good from the sound point of view: the abundance of texts did not allow the insertion of digitized speech (but after seeing - indeed, listened to - a product like Luminous Arc, this excuse leaves some time) but the various songs and jingles are pleasant and never intrusive. Comment Mystery Detective is a game that will only interest a small portion of the public, the same one who loved valuable products such as Trauma Center and the various chapters of Phoenix Wright. These text adventures are gaining ground in the Nintendo DS toy library thanks to the versatility of the small console, but Mystery Detective is not an example to be imitated, at least in terms of gameplay: if it is technically a well packaged and very pleasant product, the same cannot be said of the bare and raw game, which becomes frustrating in a very short time, due to the lack of clues and illogicality dand the puzzles to solve, despite - for once - the excellent texts in Italian. And in this genre, it's a really deadly flaw. That will be for another time, Atlus. Pros Technically very good Excellent Italian adaptation Cons Meaningless puzzles Buggy and frustrating mechanics Mystery Detective is available for Nintendo DS. Atlus is a fantastic softco: it is able to produce magnificent titles from every point of view, certainly not perfect, but the merits always shine so much that the defects become marginal. The best thing is that Atlus innovates many times, or in any case proposes courageous and certainly rarely abused mechanics, in order to offer always fresh and compelling videogame experiences. But even Atlus sometimes fails, and this is certainly the case with Mystery Detective: following the success of atypical games such as Phoenix Wright and Trauma Center, Mystery Detective offers a ~point and click~ adventure with clues that abundant use of the double screen and the touch screen, carving out a niche in that niche of particular games where you need to have what it takes to be noticed and appreciated. And unfortunately the story of little Mackenzie has only a few of those cards...", "date": "2008-01-03", "grade": null}