{"name": "D-Day: uno sbarco tira l'altro", "ref": "https://multiplayer.it/recensioni/d-day-uno-sbarco-tira-laltro.html", "text": "Historical commemorations The game itself has a part dedicated to the actual commemoration, complete with a video encyclopedia on the Normandy landing. Here the reconstruction follows the development of the game hand in hand, re-proposing the stages just played from a slightly more serious and austere point of view. The films present not only repertoire pieces but also interventions and testimonies gathered among the protagonists of the important landing. It is possible to play three different campaigns, always playing the role of allied troops committed to eliminating the Nazi threat and slowly pushing it back from the occupied territory. The campaigns retrace the landing and the immediately preceding and following phases from three different points, reconstructing the fundamental scenarios and historical missions with great geographical details. Let's talk a little about gameplay The gameplay belongs to the classic tactical RTS, in which the player is called solely to govern the units in battle. The player has at his disposal about thirty types of units that he can employ on the field, depending on the occasion. In fact, each specialization has its precise strategic use, which is truly fundamental on certain occasions. As is often the case in newer RTSs, any vehicles and buildings that are abandoned are reusable for their own purposes. This adds a considerable tactical component to the game, prompting the player to always give his best to develop sophisticated strategies, perhaps aimed at not completely eliminating the enemy, in order to be able to reuse his resources. The interface adds a new, not negligible, element, represented by the range indicators, with which the positions of the men can be accurately calculated, it being possible to also highlight that of the enemies (something that immediately brings to mind Commandos). Further increasing the tactical value of the game is a system of points and bonuses that increase the abilities of the various units in combat. In fact, depending on the use or success of an action, a unit can receive an increase in its skills. It must be said that the units can perform a wide range of actions, starting from the movements, presenting the possibility of proceeding on all fours or standing, or running; while, as far as heavy vehicles are concerned, it is possible to ~trench~, i.e. a series of protective sandbags can be arranged in a short time, to increase the unit's defense score, at the expense of the faculty of movement, reduced to fire turret rotation only. Among the various attack commands there is one capable of concentrating fire directly on the tracks, the real Achilles' heels of armored vehicles; once deprived of these, the vehicles will not be able to move, although they can continue to fire, until the arrival of the appropriate repair unit, the only one capable of putting a damaged vehicle back on track. The same thing applies to the action useful for aiming the turret of the tanks, in order to deactivate the offensive possibilities of the vehicle. All vehicles and buildings can be occupied by both factions, without distinction. The environment totally conditions the player's tactical choices, since some natural barriers can be easily removed with heavy vehicles, but not with simple infantry. There are also amphibious vehicles with which to cross waterways that would otherwise be impossible to cross. Then there are characters who are able to call up particular special attacks (such as airborne ones) at the player's pleasure or can use their own skills ad hoc, for example sappers are the only ones who can place and remove mines, really mines. and above all invisible. Note the possibility of pausing the game, using the spacebar; in this state the game is not completely blocked, but it is possible to plan each action, which will be performed when the game is restarted. This choice gives the game a ~turn-based~ nuance, very dear to all lovers of reasoned strategy. Multiplayer, why not talk about it? The multiplayer mode deserves to be mentioned because, in addition to offering, as often happens, a further element of fun in this specific case it also offers the possibility of controlling the axis troops, otherwise relegated to the sole role of enemies to fight. Furthermore, together with the game, an editor is also provided to create very nice maps to play on the net together with other players. The management of multiplayer matches is guaranteed by Gamespy, now a real monolith in this area. Technician's corner The setting of the game is completely similar to that gpreviously encountered in Desert Rats VS Africa Korps. The same thing can be said for the graphics. The game engine is nothing more than an evolution of the previous one, to which details such as the grass have been added, now totally three-dimensional. The camera is smooth and offers very differentiated and detailed views. The shadows and light effects are amazing, capable of faithfully recreating war scenarios. The version we received in preview still had some problems, especially regarding the AI, but the final version appears stable and refined, the enemy reacts intelligently to attacks, as well as the units controlled by the player behave intelligently without stumbling in dead ends or getting killed for mistakes related to their automatic behavior. Comment D-day is a very refined game, suitable for those who want to spend their time patiently developing sophisticated strategies. It is not easy to complete a mission and certainly all those who are accustomed to mass battles would find many difficulties, here only the cunning and the ability to exploit the specialization of the various men involved counts. For this reason, a Commandos sometimes comes to mind more than a classic RTS, and the weight that is given to the possibility of pausing the game to calibrate the action is proof of this. From a technical point of view, one can only enjoy the refined choice of textures and settings proposed. But the proximity to Desert Rats VS Africa Corps is really breathed, with which it shares so much, perhaps a little too much. For this reason it risks becoming repetitive, but those who love the genre will certainly find it hard to miss this opportunity to teach the old ~Krauts~ a lesson, more aggressive than ever in this title. Pros: Good graphic detail Excellent historical reconstruction supported by the Normandy landing encyclopedia The strategy has a very important weight Cons: Too similar to DR vs AK All in all it lacks originality Very high level of difficulty Guarantees of originality by now the market for PC games no longer gives them, and with the exception of some very rare cases one certainly cannot expect revolutions, at least these days. From this disaster that condemns the now elderly player to cyclically feed on the same digital soup, products emerge from time to time capable of rehabilitating, if nothing else, the desire to rediscover truly mistreated genres. D-Day is a prime example of this. Born from the same hands that produced Desert Rats VS Africa Korps, D-day presents itself as a tactical RTS, set, not even on purpose, in Normandy in 1944 in full Allied landing. Here the original initiative, if one can say so, is to combine ludicrousness with a more noble aim such as that of historical education and commemoration. In fact, this title is sponsored by the ~Normandie 1944: La memoire~ foundation, with the aim of retracing, in a faithful reconstruction, the stages of the most delicate moment of the world conflict, exactly sixty years after the fateful date.", "date": "2004-10-22", "grade": null}