{"name": "SWAT Elite Troops", "ref": "https://multiplayer.it/recensioni/swat-elite-troops.html", "text": "Along with the stealth elements, the application of low-key strategy to action games has led to an increase in their average depth in recent years. There are series like Rainbow Six and Ghost Recon that have made this feature their strong point, distinguishing themselves from a flood of titles that are often too similar to each other. Well, the application of the same principles in the mobile sector has produced excellent results, which we have been able to appreciate for some time on the screen of our mobile phones, with games that manage to blend immediacy and depth obtaining exceptional results. While remaining in the field of experimentation (as it should be, when the road to improvement is still largely viable), SWAT Elite Troops tries to make a strong contribution to the genre of strategic action games. From the main menu, we can access the fifteen missions available as they are unlocked, but the first thing to do is try our hand at a short tutorial, which shows us how many and what actions we can perform with our team of three special agents. From this point of view, the developers have tried to pack something very complete and multifaceted: we control the leader of the group and we can order our two companions to go ahead (by pressing the desired direction twice with the joystick), while faced with an enemy the team will open fire together. The aiming system provides for the appearance of a crosshair on each shooting target, a crosshair that varies in size until we pull the trigger: hitting the opponent when the crosshair is small results in a targeted shot; doing it when it's big means that we haven't been very precise and we have to insist. Each location is completely ~dark~ at the start, we don't know what awaits us in the next room; we must therefore decide how to proceed, using a contextual menu that appears when we approach a door: simply open it, take a look through the keyhole, blow it up or launch a flashbang inside to stun any lurking enemies. Stunned opponents can be eliminated with a single blow, or approached to handcuff them. By pressing the right function key, we will have access to a series of actions at any time, including equipping shields that can greatly increase our resistance during firefights. In each mission we will have to achieve certain objectives, and there will be variations in the gameplay: we will find bombs to defuse and computers to access, and these situations will give way to simple minigames in which you have to cut the right thread or block numerical sequences in order to to match a digit. The technical realization of the game is only fair, unfortunately, and leaves a bitter taste in the mouth because much more could have been done to make the action spectacular. The sprites of SWAT agents and criminals are in fact characterized by modest animation and an equally modest level of detail. On the other hand, however, the settings are quite large and are loaded in their entirety: it is clear that the developers had to make technical choices to make the game usable even by those who do not have a latest generation mobile phone. This is reflected in the sound sector, consisting of a series of music that can be largely deactivated. The control system is very simple and intuitive, despite the large number of actions that can be performed: everything is done with the joystick, the FIRE button and one of the function keys. PRO Well implemented strategic elements A large number of missions Character upgrade system AGAINST Technically average Rough firefights Poor enemy AI", "date": "2007-12-27", "grade": "S.V."}