{"name": "Playman Winter Games", "ref": "https://multiplayer.it/recensioni/playman-winter-games.html", "text": "After having created a successful series such as Playman, the developers of the Mr. Goodliving team return to the sporting theme, however passing from sunny beaches to boundless snowy expanses, the true protagonists of winter sports. Playman Winter Games allows us to try our hand at three different game modes: tournament, single event or training. The latter does not have the typical connotation of a tutorial, but simply sees us practicing in a particular discipline without our scores being stored. Participating in the tournament or in a single event, on the other hand, means competing with the game's records to achieve excellence in all types of competition. The disciplines featured in the game are biathlon, slalom, jumping and sled racing. The first is a speed contest in which, at intervals, you have to stop and shoot at targets. In practice, we will have to press the 4 and 6 keys of the numeric pad each time we pass over a point marked by one or the other number, then press the numeric keys corresponding to those represented on the targets to hit the target. Everything is based on reflexes, with a mechanism similar to that of rhythm games. Slalom, on the other hand, is something completely different and looks more like a classic racing game: we will have to direct our character using the 4 and 6 keys so that he passes under each pair of flags before crossing the finish line downstream. The jump sees us launch ourselves from a long ramp to stay in the air as much as possible: we must press 5 to take the leap, then maintain balance by using the usual keys 4 and 6, and finally press 5 again when we want to land. Lastly, the sled race has a very simple mechanic: we will have to move the bobsled to the right or left as needed, but trying not to leave the gully. These are four very different applications, therefore, which also have a variable degree of involvement: the worst discipline is certainly the jump, given its brevity but also the difficulty in keeping the character in balance before landing. The others range from mediocre to adequate, but never shine. There is a ~turn-based~ multiplayer mode for up to ten players, all on the same mobile. The graphics of Playman Winter Games is really well done, with the usual mix of 2D sprites on a polygonal scenario which in some disciplines (slalom and sled racing) really ensures respectable results. While not boasting a large number of moving elements, the backgrounds have a good level of detail and the colors are used in the best way. In biathlon and jumping, things are certainly less spectacular, but still work well from the point of view of the action. The sound sector makes a fine show of a certain number of well-made, quite catchy music, which moreover can be adjusted in volume independently from the telephone. We have already mentioned the control system: extremely simple, it basically uses two keys (4 and 6) apart from the ~target shooting~ section of the biathlon, where the whole numeric pad is involved. The response to the commands is prompt, without particular problems. PRO Well done graphics Some innovative ideas Four different disciplines... AGAINST ...but only two let themselves be played There is no real competition Very limited", "date": "2007-12-21", "grade": "S.V."}