{"name": "Full Spectrum Warrior  arrivato su PC", "ref": "https://multiplayer.it/recensioni/full-spectrum-warrior-e-arrivato-su-pc.html", "text": "the information necessary to carry out the missions will be given to you directly in the field Evil Terrorists: PRESENT! The game interface is very simple and functional and allows you to control the situation in a complete and rather precise way: with the right mouse button you order the movement of a single team thanks to light indicators to be placed on the playing field, while with the left key you order the fire in a rather large area, selectable with a rounded cursor (or almost). We will also be able to count on four nice ~gadgets~ that will prove to be precious allies on more than one occasion: the fragmentation grenades need no introduction, they will make it possible to kill the terrorists placed behind cover (although it is reasonable to wonder why our men do not can throw them only at a very short distance); the smoke grenades will instead allow us to hide our movements from the eyes of the enemies, allowing us to get out of the current cover to try to take them by surprise; the M203 grenades can instead be used as missiles (in reality they follow an arcuate trajectory) but we will only have one per team available in each map and, finally, an aerial bombardment can be requested if we encounter tanks on our way. A crate or a car? But how does the actual action take place? Quite simply you have to move from one cover to another, being careful not to get hit by terrorists. To our aid, to try not to be taken by surprise, we will have an electronic map of the area, with which we will also be able to request an aerial reconnaissance. Discovered enemies will be indicated by red icons. However, don't trust the reconnaissance too much: they often don't identify all the enemies, so you always need to move with a certain caution. The typical game situation is as follows: I arrive behind cover, spot enemies who, without thinking twice, also go behind cover. Beginning of teamwork: while with one team you will have to fire cover towards the target, with the other you will have to try to get around the enemy by hitting him from behind. The first team's fire grants the second the possibility of moving in a rather safe way, provided that there are no other hidden terrorists ready to fill us with lead. In case one of the men is wounded, it will be necessary to have him carried on the shoulders by another soldier, thus slowing down the movement of the entire squad. If a second soldier is injured, the game will end forcing you to reload from the last checkpoint. But let's talk about the saving method. It will be possible to save only in the presence of a particular symbol that will appear in very specific points and, usually, in rather safe areas. The inability to save continuously on the one hand makes some passages rather frustrating, but on the other hand it allowed for a greater balance of game situations. In short, in a title like this, checkpoints are a necessity, also because, being able to count on quicksaves, one would risk saving in situations from which there is no way out, forcing later to restart the entire mission. You may have noticed that we have mentioned the covers several times without talking about them in detail. These are, in truth, the cornerstone of Full Spectrum Warrior. There are three types: those that are imperishable (they are not scratched by bullets and guarantee unlimited protection), those of medium perishability (they guarantee long-lasting but not unlimited coverage and after many hits they lose their effectiveness) and those that are blown away very quickly (use them as little as possible and rely little on the protection they guarantee, an example of coverage that deteriorates quickly is a wooden crate). When behind cover, a full shield appears on a soldier's head. If the shield is only half full it means that the cover will soon be torn down. In this case, either you find another object to hide behind or you allow the enemy to take us out in peace the possibilities are few. When you are behind an imperishable cover, you are essentially untouchable. Our men will also be able to lean out and shoot without risking anything. This also applies to enemies, of course. The merits In the early stages of the game Full Spectrum Warrior is exciting and engaging as a strategic game has never managed to be. It will be for the beautiful graphic representation of the city destroyed by the war, with a burnt sky that seems to weigh on the heads of our men. It will be the control system that is immediately masterable, thanks to the excellent interface, which allows you to enter the game without trdouble problems. Finally, it will be due to the dynamics of the shootings which is exciting also thanks to the constant need to find a way to flush out those who shoot at us. In short, if FSW's judgment depended on the first hours of the game it would certainly be different from what it actually is. You literally remain glued to the screen studying the various situations, looking for the best move and watching our men follow our directions completely and precisely. When an event makes you particularly sweat, the satisfaction of overcoming it is doubled and the desire to move forward considerably increases ... it takes little, however, to realize that Full Spectrum Warrior of strategic has very little if not a vague aftertaste that remains hinted at but does not permeate, as it should, the entire production. and the flaws Terrorists will always be in the same positions and will inevitably move identically in every match. At most they will change cover if you get too close, but they will do it schematically and without any changes. This means that if you are killed by enemies who have ambushed us from behind, on the next attempt it will be enough to understand what the right cover is to avoid being surprised and act accordingly. As you can well imagine, in some places it does not even seem to be faced with a strategy game, given that there will be very few situations in which we will be able to choose an approach or think of a personal tactic of action. What we will have to do instead is understand the order in which to move the teams, being careful not to take too personal initiatives. Most off-the-rails attempts will end up wasting a large amount of bullets unnecessarily resulting in complete stalemate (or certain death). Stalemate situations that moreover will happen often, above all due to the cover system that makes certain shootings infinite. We understand that hitting a man behind a car is more difficult than hitting him when he's in an open field, but an alternative system could have been thought of that would allow for a certain margin of error, especially when the coverage is irregular (cars, carts, etc.), so as not to reach , moreover, to paradoxical situations in which a sniper fails to hit us because we are hiding behind a gate whose mesh is so large that a whole man could pass through it. Moreover, it sometimes happens that you can't hit enemies that are clearly in sight, which is quite annoying because it makes it clear that the game is driven more by the scripts than by us. We get to hate the accursed icon with the shield (that of the cover) and often the voluntary suspension of disbelief (which is ~voluntary~ if everyone forgets it) undergoes a radical stop in favor of questions such as: ~I see it perfectly, why Can't I put a bullet in his head? Fortunately, things change a bit at advanced levels where by increasing the difficulty, it is obvious that the tangle of the scenarios also increases. Too bad that the few possibilities of movement available soon make the game dynamics repetitive, making the excellent initial impressions diminish downwards. Moreover, it sometimes happens that you can't hit enemies that are clearly in sight, which is quite annoying because it makes it clear that the game is driven more by the scripts than by us. and the flaws Fortunately, two missions have been added compared to the Xbox version (even if the secret US Army mode is missing, which was a pleasant extra in the other version); these lengthen the overall duration of the game by a few hours, which is actually not very long and is difficult to replay if you are alone. On the other hand, the possibility of playing online in the cooperative mode is interesting, which deserves to be tried for how well it is done. Comment Let's hope that the version for the US troops of Full Spectrum Warrior is a little more complex than the version for gamers... otherwise you know what figures. Easy jokes aside, there is no doubt that the initial excitement must not deceive and must not lead to overestimating a product that has obvious and marked defects. Sure, it's fun. But fun is relative since it falls within the subjective factors of judgment. The reality is that FSW could have been a great game, but as it stands it is just a good product that guarantees a certain spectacularization of warfare without, however, going to dig its object deeply. It has many advantages but also many limitations which do not guarantee that it will remain in the memory for too long. Pros: Graphically excellent The initial stages are exciting Excellent cooperative mode Cons: A puzzle game rather than a strategic game Scripts of enemies too rigid and mechanical In the long run it tires to always doand the same things Evil Terrorists: PRESENT! Planet Earth is a strange place, filled with heavily armed creatures shooting at each other for the glory of who knows who. The story behind Full Spectrum Warrior goes something like this: in a fictional city, a local dictator is creating an army of terrorists; you, as good defenders of freedom, must stop him. But let's start the game which is better. Initially you will have various choices to start the war. You can take part in the very complete tutorial, which exhaustively illustrates all the possibilities of action on the battlefield, you can start the single player campaign or you can select one of the various multiplayer game modes. In the single player campaign you will be in command of men chosen thanks to accurate physical and psychic tests, both good at shooting and swearing. You will face a handful of missions in sequence connected to each other by a thin but flyable thread. You will lead two or more groups of soldiers (each group will consist of a maximum of four elements) with which you will have to complete various objectives in each map. Most of these (let's say all) will be set to make you go through the entire level (or almost). There will be no preliminary briefing phases, the information necessary for carrying out the missions will be given to you directly in the field.", "date": "2004-10-22", "grade": null}