{"name": "Age of Heroes IV: Blood and Twilight", "ref": "https://multiplayer.it/recensioni/age-of-heroes-iv-blood-and-twilight.html", "text": "The Russian team has always placed particular care in the arrangement of a convincing setting for the various chapters of Age of Heroes, and this Blood and Twilight is no exception: this time the user takes on the role of one of the last exponents of an elven race in decay, intending to organize an army of various creatures to fight their enemies. Although it can hardly be defined as original, the scenario of the Qplaze product is still quite compelling, with a gloomy and dark mood that is rarely found in a mobile game. However, a good part of the atmosphere is ruined by numerous unnecessarily verbose dialogues transcribed in very questionable English, an element that betrays the Russian origin of the development team and the absence of a translator worthy of the name. Storyline aside, Blood and Twilight shares the vast majority of playful characteristics with its predecessors: we are therefore talking about a strategic RPG framed from a bird's eye view, which is divided into exploration sections (including chats with NPCs, shopping in the various cities, etc.) and turn-based combat against enemy units that stand in your way. Which is already put to the test by the not exactly friendly interface of the Qplaze product, a defect already found in the other chapters and which obviously the Russian developers do not dream of improving. Anyone who tries his hand at Blood and Twilight therefore has to deal with countless overlapping menus and windows, to which must be added a cumbersome movement system and the total lack of a guide for the player: the total absence of tutorials or even simple hints force the user to learn everything by himself (an operation that is anything but simple or fun), with the real risk of finding himself without the slightest idea of where to go or what to do. Not exactly the best for a mobile game, which by definition should be a source of entertainment rather than boredom or frustration. The situation improves slightly on the fighting front, all in all enjoyable even if decidedly shallow and stimulating: it doesn't take much for this aspect of Nomoc production to show its obvious limits too. Too bad, because graphically Blood and Twilight is a little jewel, colorful and populated by a great variety of different creatures, each characterized by a respectable character design. PRO Good graphics Potentially long-lived... AGAINST ...but immediately frustrating The usual flaws of the previous chapters Archaic interface and control system", "date": "2007-12-13", "grade": "S.V."}