{"name": "Recompile", "ref": "https://multiplayer.it/recensioni/recompile-recensione-metroidvania-azione.html", "text": "Recompile looks very good. A game inspired by the Metroidvanias (Hollow Knight, Axiom Verge, Ori and the Blind Forest...), with platform sections, powers, a third person shooter combat system and also a useful hacking system against enemies and the environment: all potentially interesting features, especially if combined with an intriguing visual component. But did everything go right? We tell you about it in our review of Recompile, available on PC (via Steam, Epic Games Store and GOG), PlayStation 5 and Xbox Series X | S (included in Game Pass since D1, on console, PC and cloud). History: the Mainfrain Recompile places us inside a computer The story of Recompile is that of a small program with a big task: to enter an AI-controlled supercomputer and take control of a nearly destroyed computer system. However, it is also the story of who created and used that supercomputer. The narrative thus continues on two tracks: our present is told by playing, while the rest must be discovered by collecting collectibles scattered throughout the environment that will unlock various text documents. The most interesting part of indirect narration through collectibles is that it allows us to discover what the functions of the supercomputer were, how the AI that controls it was born and evolved and what was the fate of the people who used it. It is a very classic story, which refers to the most pessimistic trend of science fiction literature and which we all know: should we perhaps underline that making an AI more intelligent and even self-aware might perhaps not be a good idea? Although not very original, the story told by the collectibles is pleasant and manages to make sense of the whole adventure. Ignoring this part of the game, you simply find yourself advancing from area to area, not knowing exactly what you're doing. Our character, a nameless and faceless program, is just an empty avatar that is guided by the commands of a human being, who informs us of our goals and little else. While technically not mandatory, Recompile collectibles are a key part of the game: if you normally don't have the patience to read them, know that you may be disappointed by the Recompile game world. Indeed, unlike other titles (Hollow Knight, for example), the world of Recompile does not propose a ~silent narrative~. The environments are very generic, mostly gray-black blocks, with some platforms and colored lights (each area has its own color), with just a few minimal differences in the landscape. The environments tell us almost nothing about the functions of that region, and if it weren't for the collectibles, we wouldn't know exactly why restoring that area matters. A (not) metroidvania Recompile: One of the first areas Structurally, the play areas, accessible from a central hub, are fairly varied. One section focuses on simple exploration with combat, one introduces the hacking mechanic, and another is all about platforming and unlocking various additional movement abilities. However, don't expect a metroidvania structure: each region is completely separate from the others and, even internally, each area offers a very linear path. Furthermore, the new powers are not used to access blocked sections of old areas but only to access the next ones. Basically, even if it doesn't seem like it at first glance (and contrary to what the developers said), Recompile is by no means an open game. The real problem is that none of the gameplay pillars are really in depth or interesting. Furthermore, the entire adventure lasts between 6 and 7 hours (also counting a good exploration of the collectibles): the short duration means that many gameplay elements, which as we explain below are unlocked towards the middle of the adventure, are almost superfluous. Combat system and skills The last area of Recompile is a big empty space Let's start with the combat system. Recompile is a third-person shooter: as you play, various weapons will be unlocked, from a simple machine gun to a grenade launcher, passing through a shotgun. Within a couple of hours, however, the most powerful weapon is obtained, which will almost certainly become the main one; moreover, two out of five guns are practically useless. The combat system is charmless and not very central to the experience: encounters with enemies, which become more sporadic as the adventure progresses, are very repetitive and not very dynamic. First of all, in the whole game there are three or four common enemy types, however very similar to each other. Also, thecharacter is very slow and awkward when aiming his weapon, while opponents tend to be very fast and aggressive. What happened is that we played using one of the first abilities to unlock: time slowing. In fact, Recompile allows you to activate a slow motion that makes the clashes more readable. In all honesty we don't know if this was the way the developers intended to deal with the fights (especially against the bosses), but it turned out to be the only way to deal with the situation without frustration, due to the fact that the bosses are huge, very powerful and much faster than us. In any case, the battles lack intrigue as one only has to walk away from the boss and unload as many shots as possible before having to run away again. Focus: hacking Hacking enemies is a mechanic that should be central to Recompile We believe that part of these problems derive from a precise design choice: to push the player more to exploit the hacking mechanics, to make enemies our allies or to destroy them directly. However, even the latter is not particularly intriguing to use: first of all, the hack simply requires opening a menu that pauses the game and allows you to select an enemy near us, but it is not an interactive mini-game ( think NieR: Automata, for example). Furthermore, hacking enemies is not a starting skill, but it is unlocked towards the middle of the game and, as mentioned, this makes it of little relevance to the game economy: not to mention that converted allies are not very useful. Furthermore, hacking has a cost in points, which are obtained by defeating enemies: this is not an ability to be used indefinitely, since it is not possible to farm opponents (once defeated, they disappear forever). Hacking is also used to interact with the environment. For most of the adventure we'll have to go around looking for buttons to press, which will give energy to the section we're in: in some cases, hacking allows us to bypass this mechanic. From our point of view, it is a potentially interesting idea (if inserted in a puzzle game structure), but in practice it is little exploited and, in the very rare cases in which it is useful, it does nothing but eliminate a game piece in the most trivial way possible. Furthermore, hacking is useless against the three bosses (one of which we struggle to define bosses, in all honesty): a pity, given that clashes with more powerful enemies could have been a good situation to create more elaborate and intriguing mechanics. Other aspects of gameplay Recompile also offers platform stages In terms of gameplay, the platforming remains to be discussed. Out of the four main game areas, only the third has real platforming sections (throughout the game you have to hop around anyway) and, for a good chunk, it's quite frustrating. Recompile, in this area, offers some very awkward paths, both because of the camera which makes it difficult to see the distance and angle of the required movement, and because the platforms are deliberately small and placed in such a way as to require very precise movements. As it happens, once this section has been passed, additional movement capabilities are obtained which make the challenge much more bearable: a clear symptom of the fact that the team wanted to test the player and make him understand that a useful upgrade for environmental crossing was about to arrive (multiple jumps and, finally, planing). Once again, however, having obtained these powers we will have very little space to actually use them. In fact, shortly after you get infinite flying, jumping and dashing, as well as fall damage nullification. In other words, every platform mechanic disappears as we will be able to move without limitations. These powers are needed to access the last game area, which turns out to be a huge empty area in which to fly around to collect collectibles, with some harmless (and recycled) enemies to take down here and there. In all fairness, we also suspected that the development team was forced to speed up development and closed the game with a trivial area and no level design due to lack of resources. We have the impression that with Recompile the developers have dared too much Unfortunately, the average impression is just that. The ~micro studio~ (that's how they call themselves) behind Recompile is made up of three people and we believe they aimed too high for their possibilities. Recompile promises many mechanics and cites illustrious sources of inspiration, but controller in hand the result is a mix of elements that are not at all focused. We also don't really like the way the game is presented on Steam: there is talk of an interconnected game world, of choices that affect the adventure and there are various GIFs and images that show sections that are not actually present in the game and give the wrong idea of what the pacing and mechanics really are of Recompile. We assume they are residues of the team's aspirations, of sections created as an example of the idea behind the game. In the end though, most of what was promised isn't in the game. Finally, even visually the game is less promising than we hoped. Recompile is overall nice with its own neon aesthetic, albeit repetitive, but it features poorly integrated light and fog effects that make looking around annoying. At the very least, performance-wise the game is solid and holds 60 FPS smoothly at 1080p.", "date": "2021-08-19", "grade": "6.0"}