{"name": "Twelve Minutes", "ref": "https://multiplayer.it/recensioni/twelve-minutes-recensione-thriller-interattivo.html", "text": "12 Minutes is a game that has impressed since its announcement: not only because Annapurna Interactive is involved in the publication, which is hardly wrong in this sense, but for its concept and, above all, for having been created by a single person. an interactive thriller all set in the space of a handful of minutes, in which the protagonist finds himself involved in a loop: by its nature, this expedient forces him (and us) to relive the same scene again, again and again, until we find the reason behind this cyclicality and we are going to fix it. Only then will we be able to proceed but the game has so many surprises in store for us that there never seems to be a definitive solution: this is the beauty and at the same time the flaw of the game, which once the curtain falls reveals itself as a story-driven experience very interesting, full of twists and turns, with an intriguing but not always well-developed basic idea in terms of gameplay and, in particular, narrative solutions that often clash with each other. Let's find out 12 Minutes in the review of the PC version. History The protagonist and his wife embrace in a scene from Twelve Minutes Since it is a narrative video game, we will say the bare minimum of 12 Minutes. As anticipated, it is based on the time loop device and features three main characters: husband (the protagonist), wife and a mysterious policeman. Returning home from work one evening, the husband finds his wife waiting for him with a surprise, but before they can really enjoy it, a policeman breaks into their house and handcuffs them both. He then accuses the woman of a heinous murder that took place years earlier, of which she has no memory, threatening to give him a particular object. Regardless of how the story may go, at a certain point the husband goes back in time, exactly when he returns in home. From here begins a tireless search to understand the reasons behind this loop, finding himself having to work out a solution and gather clues in the handful of minutes available before everything starts all over again. To give voice to the three main characters we find an exceptional cast: Daisy Ridley, James McAvoy in the role of her husband and Willem Dafoe in that of the policeman; their performance, it almost seems superfluous to specify, takes this experience to high levels. Narratively speaking, 12 Minutes is a very well packaged thriller, full of twists and turns and capable of overturning our hypotheses at any moment, opening up scenarios we had not thought of. The loop and its solution A dramatic moment from Twelve Minutes There are so many possible interactions and if on the one hand this enhances the game, on the other the problem arises of making them all coherent, regardless of whether they lead more or less close to solving this loop. Our creativity is put to the test and indulged, in those few minutes that separate us each time from the end of the loop, but in some cases we have found the situations jarring, as if the developer told us ~nice try but that's not how I want you find out what you need~. We would like to be able to give specific examples but since it is an experience entirely centered on the story, every word too many would ruin it. In any case, this feeling of frustration, loop after loop, begins to feel heavy above all due to the brevity of the loop itself and due to the need to repeat the same choices every time with minimal variation. There is no way to speed up the process, other than occasionally speeding up conversations. Again, we are aware that at the basis of such a narrative device there is also the growing despondency of having no idea how to get out of trouble, but 12 Minutes proves to be too sparing of clues on how to continue and, as specified, sometimes too rigid in the way things have to proceed. We experimented with different ways in which the situation could have evolved anyway but, and here the characterization of the policeman especially comes into play, every time it was like hitting a wall. Therefore, while appreciating the history and the multiplicity of solutions, small or large, that we can implement to try to make sense of this announced tragedy, we are faced with the classic case in which too much damages and certain conclusions (or worse, bans ) clash very much in the general economy of the narration. Gameplay Twelve Minutes, the calm before the storm 12 Minutes is, in essence, a point and click with a top view: we can tell the protagonist where to move, make him interact with the environment to examine it better or simply get some more information and make him collect objects that he will keep ready for utilio in a small inventory, hidden in a drop-down menu at the top of the screen. These, together with the multiple choices during the dialogues, are the only actions available. Simple and at the same time elaborate, considering how many things we can do in the small space of our apartment (there are three rooms in all, living room, bedroom and bathroom). The time available is very limited and can pass without us realizing it, which is why the first loops are mainly used to understand how to optimize our actions by skipping the irrelevant ones - even if then we will still find ourselves trying even the least probable solutions. Very clever, and a bit of an impact in terms of tension, the fact that the main screen of the pause menu allows us to see how much we have left before events are inexorably set in motion. In some cases it is possible to speed up the tempo, so that you don't have to wait unnecessarily, but they are contextual actions and/or dialogues, often unlocked by doing something else first. As we have already explained when talking about the narration, 12 Minutes offers many, very many possibilities to try to find a solution to the loop, indulging most of our solutions, no matter how absurd they may seem. The characters have a remarkable range of actions and above all reactions, although in some cases it is clear where some of our choices can lead, and it is important to pay close attention to all the dialogues: the clues we need, even though they are sometimes too hermetic , reside right in the dialogues or in the setting itself. This helps not to create a disconnect with the current situation and enhances even more an overall very well-finished game. The protagonist of Twelve Minutes wanders around the house Paradoxically, it is precisely this excessive care, this desire to make everything or almost everything possible, that clashes in some cases, with the logic that is markedly bent to the rules of the game, leaving us helpless in the face of senseless solutions - to name one without going into spoilers, sometimes (obviously when we have stumbled upon the wrong solution, or which in any case will not have a happy ending) both the wife and the policeman are endowed with an inexplicable omniscience. It is here that the developer's willingness to leave us free but, at the same time, do as he wants emerges. Another example: we know that the policeman wants something and, once we understand what it is, we are able to get him to find it. Literally, we stick it in front of his nose and before he bursts in we hide so as not to be seen. He will completely ignore the object, search the house until he finds us and then, at that moment, he will take the object that has been in plain sight all the time without even a comment and then get rid of us. This is one of the many possible forcings: considering that the loop complies with its rules and forces us to start everything over until we find the reason, we would have trivially preferred that the policeman take the object, leave the house and the loop restart (which in some cases it happens, it doesn't always have to end in tragedy for it to start again). As mentioned, therefore, there is a lot of freedom of action but it often collides with these walls and unnecessarily lengthens a game that is already much longer than we expected: it took us more than eight hours to finish a run. Technical compartment The protagonist of Twelve Minutes dances with his wife by candlelight Visually, 12 Minutes is simple but neat, especially in the animations. The characters are very meticulous in carrying out their actions and, the wife in particular, has a quite varied routine that depends in part on us. Every movement is studied in detail, whether it's filling a glass of water at the sink, opening the refrigerator or moving the chair to sit at the table and putting it back in its place when you get up. It returns a lot of immersion, even in those few minutes that separate us from the tragedy. There is hardly an object in the small apartment that does not have a purpose or in any case cannot be used. The dubbing, as we said, is of a high standard, nor could we have expected otherwise given the actors involved. The soundtrack is not very impactful but its variations are a further indication of the direction the loop is taking, making us understand if we are taking the right direction or if we have done something wrong.", "date": "2021-08-18", "grade": "7.5"}