{"name": "Bee Movie Game - Recensione", "ref": "https://multiplayer.it/recensioni/bee-movie-game-recensione_a.html", "text": "Grand Theft Ape Bee Movie Game has a mixed structure, between ~free~ roaming and multi-event action game. The basic setting is the interior of the hive, which we can freely visit far and wide, and from where it is possible to access various activities and mini-games. It's a sandbox system, but developed to a minimum: in fact, you can meet various characters and have us entrust you with different tasks, borrow any of the cars present to move faster, but in essence it is simply a vast area from which to access different activities. The beehive is a real bee-friendly metropolis, made up of bizarre and fascinating wax structures, and an intricate network of roads and communication routes, which can be traveled on foot, by flying around, or using luxury cars. various shapes. In addition to following the sequential missions that make up the game plot (the main quest, it could be defined), we can roam the hive in search of alternative missions. Scattered around the city are terminals from which you can access various jobs, which represent real digressions into other genres: we can invent taxi drivers, with the game that transforms into an insect-sized Crazy Taxi clone, or we can participate in races racing cars complete with the use of Mario Kart-style power-ups, or access puzzle games of various structures. There are also six mini-games, unlockable during the game, which represent ~peach~ reinterpretations of old arcade classics such as Space Invaders or Galaga, as real pastimes to break up the (already fragmented) game action. In total, the dynamics with which we find ourselves dealing are different, with almost 20 variations between ~jobs~ and mini-games that make Bee Movie Game a sort of multi-event, connected by a common thread and a setting common. Big Big World The most complex action is the one that takes place outside the hive, in the vast surrounding world: it is here that the game takes on the classic progressive level configuration, and where all the narrative sequences are concentrated. Obviously, the environments have been reproduced on an insect scale, resulting in gigantic elements of the scenario. The main purpose, before things get even more complicated, is the collection of pollen with the trusted ~pollinator~ gun, but the events are multiple and varied. On many occasions the action takes on the typical ~quick time event~ configuration, and we will find ourselves busy following Berry in spectacular pre-calculated sequences, being careful to press the right button or the right direction on the analog stick, at the indicated moment. Not the best from a playful point of view, as always happens in similar cases, but of sure impact, also given the emphasis placed on the graphics in these particular sequences, which in some cases integrate completely pre-calculated rendered computer graphics. The actual action instead sees us flying with Berry within various areas (a park, a warehouse or an apartment, among others), trying to carry on his mission and at the same time avoid the lurking dangers. In these cases, we find ourselves within a well-defined game area, which we can explore by flying freely in any direction. There are many things to do: on the one hand, collect the pollen from the flowers with the ~Pollinator~, on the other, pollinate other flowers that are withering, or kill the enemies that populate the level (usually other types of insects, such as the terrible dragonflies ), at the same time dodging dangers of various kinds (humans armed with newspapers, or the rain always lurking). To make things easier, it is possible to activate the ~bee view~, which transforms the screen into a sort of Splinter Cell viewer, with which it is possible to precisely identify the objectives and targets present in the area, or to slow down time for a short period, with a significant ~bullet time~ effect that allows you to act with greater precision in hitting enemies or dodging threats. The level ends once the required objectives are achieved, such as reaching a certain point on the map or pollinating a certain number of flowers. It is clear that the sections outside the hive represent the true heart of the game, the only ones with truly structured gameplay, as opposed to the mini-games inserted within New Hive City. However, even here there is a certain simplicity and little depth of play to be recorded, with the Activision title revealing its origin as a product intended for a very young audience. Flowers and colors It is certainly not a game that pushes the Xbox 360 hardware to the maximum, but since it is a tie in taken from a ccartoon for children, things could have been much worse. The general aspect of Bee Movie Game is very accurate, with the graphics showing the best of themselves in the external sections. The hive is vast and full of life, with a great coming and going of bees and cars on the streets and a considerable extension, with many structures present, although the attention to detail does not make one cry for a miracle. The outdoor areas are more limited in terms of size, but are characterized by a better graphic quality, with colorful environments and surrounding elements, especially in the sections that take place in the park, or inside the apartment. The ~macro~ effect gives a good idea of being dealing with the world of insects, and the quick time event phases are certainly pleasant to see (although a little less enjoyable to play). In particular, a good job has been done on the main character, whose workmanship and animations are quite close to those of the computer graphics equivalent of the animated film. Generally the graphics sector performs its duty in an optimal way, restoring the spirit of the film with the construction of a lively and colorful world, although we are not faced with a great expenditure of polygons and high-level graphic effects, nice and funny cutscenes, in the purely narrative sections. The audio accompaniment uses some excerpts from the film, and catchy music, with a large amount of speech in Italian and well-made dialogues. Comment Obviously Bee Movie Game is, like the film from which it is based, openly dedicated to a very young audience, although the care taken in making it and certain skits wink at even the most savvy player. However, the repetitiveness of the action and the low thickness of the gameplay will hardly be able to excite the expert gamer for more than a few hours, while the fragmentation of the game structure into mini-games and ~chores~ makes it decidedly more attractive to the varied public than to the nowadays it is defined as casual. If you are looking for a game for children, which can perhaps also be enjoyed by the rest of the family, Bee Movie Game could be the right choice for this pre-Christmas period. The only advice, in this case, is that if you are interested in watching the film, it is advisable to do so before playing the game, given the frequent references to the story that would otherwise remain obscure, since it is a plot that in various parts proceeds parallel to that original.Pros: Fair technical realization Brilliant and cheerful, even in the dialogues Great variety of situations Cons: Fragmented and shallow gameplay Not very exciting for the not very young Sandbox structure not very engaging Xbox 360 - Goals Bee Movie Game contains 50 achievements for a total of 1000 Gamerpoints. It is not easy to collect all the achievements since most of them do not correspond to the simple progression between levels, but require the collection of a certain number of objects, or the achievement of particular results (killing a certain amount of enemies and similar things ). Beyond the first 4 or 5 objectives, reaching 1000 Gamerpoints requires a considerable commitment.", "date": "2007-12-11", "grade": null}