{"name": "Disney Sport Invernali", "ref": "https://multiplayer.it/recensioni/disney-sport-invernali.html", "text": "With the arrival of the winter season, video games also arrive on time, allowing us to try our hand at the typical sports of this period. Very fast sled descents, giant slalom and spectacular jumps are just some of the ingredients that make up these products, which in some cases take an ~alternative~ turn using very popular characters and a purely arcade approach. Furthermore, in the field of wireless gaming, titles of this kind are not even too widespread, therefore the arrival of Disney Winter Sports is greeted with even greater than legitimate enthusiasm. Once the game has started, you can choose to compete in three different modes: ~Paperslitta~, ~Snow Race~ and ~Flying Ducks~, in single race, in turns (alternating with two other players) or through a complete tournament. In the ~Paperslitta~, we will have to select our characters from Donald Duck's or Mickey Mouse's grandchildren, then launch ourselves on board a list and arrive at the end of a path dotted with various types of obstacles. To avoid them, a starry path comes to our aid: if we follow that trajectory, we will avoid any collision. Along the track it is also possible to collect time bonuses, shields or boosters. At the end of the race, whoever manages to complete the course in the shortest time wins. The ~Snow Race~, on the other hand, is not based on the stopwatch but is just a head-to-head battle between Donald Duck and Mickey Mouse: using a side view, we have to make our character run as much as possible, but paying attention to the jumps. In fact, arriving too fast will inevitably result in a crash and the relative loss of time. Finally, the ~Flying Ducks~ is a purely ~acrobatic~ mode: after selecting a competitor between Goofy and Jet McQuack, we will have to launch ourselves into a long jump and then perform stunts in the air. To pass each stage there is a minimum number of tricks to perform, but doing more can establish the difference between us and our opponents. The important thing is to be ready to land, or there's trouble... Technically, Disney Winter Sports looks very good, with at least two different graphics settings. The ~Paperslitta~ mode is to all intents and purposes managed like a racing game, therefore with sprites representing the characters, the sled and the elements of the scene, while the flowing track is made up of polygons. One of the problems that often afflicts this kind of game is the lack of an adequate ~scaling~ work of the objects, which end up appearing on the screen suddenly and without being able to see them approaching. In this case, luckily, things go differently and there are no problems identifying the dangers on the track, even if only for the presence of the recommended trajectory. The ~Snow Race~ and ~Flying Ducks~ modes instead show a side view and all the bitmap elements: in this case the results are more modest, but still functional to the action. The use of colors is always good and perhaps the only limit is represented by a poor differentiation of the numerous stages. As for the sound sector, we have two different music that alternate between the menu and the actual action, catchy and with the volume adjustable independently of the phone. Finally, the control system is the simplest one could think of, with the joystick to move the characters and the FIRE button (or 5 on the numeric pad) to possibly activate the objects or to set the landing after a jump. PRO Technically sound Three different modes Simple and fun AGAINST Numerous but little differentiated internships Only one music, very repetitive Pretty linear", "date": "2007-12-11", "grade": "S.V."}