{"name": "Diner Dash 2", "ref": "https://multiplayer.it/recensioni/diner-dash-2.html", "text": "Re-developed by Glu, Diner Dash 2 puts the user back in the shoes of the most indefatigable waitress in history, this time grappling with the problems of some restaurateur friends to whom she doesn't hesitate to help. In fact, this translates into an action game that is very similar to the previous one, whose lack of innovations is compensated by the excellent combination of simplicity and fun that we had already had the opportunity to appreciate in the first episode. Small summary for those unfamiliar with Diner Dash: the aim of the game is to properly serve the customers of your restaurant, taking orders, carrying the dishes and cleaning up at the end of the meal. All this through an extremely intuitive control system, which assigns a keypad number to each table and by acting on which all the necessary operations are automatically carried out (avoiding a couple of collateral activities, such as, for example, removing stains from the floor, entrusted to other buttons). As is evident, Diner Dash 2 does not require particular manual skills, but rather timing and organizational skills: the various customers must in fact be served promptly and following a certain criterion, in an attempt to keep them happy and accumulate tip after tip. There are other ways to increase the score beyond the speed of execution, such as carrying more plates at once or even placing customers on chairs of the same color as their clothes. Even the personality of the patrons themselves must be taken into consideration in order to guarantee them a pleasant meal: consequently, it will be better to seat the nerds immersed in reading away from the managers who scream on their cell phones, and so on. As already mentioned, Diner Dash 2 doesn't add anything particularly new, but to tell the truth, it wasn't even needed: the game is fun and balanced as it is, and anyone who played the prequel will certainly not mind repeating the experience. Also from a graphic point of view the progress hasn't been exceptional, but the Glu product still remains a beautiful sight, thanks to small but detailed sprites, various and well-made animations and above all a skilful use of bright colors. PRO Fun and immediate Efficient control system Great for short or long matches AGAINST Basically identical to the prequel", "date": "2007-12-07", "grade": "S.V."}