{"name": "Need For Speed ProStreet - Recensione", "ref": "https://multiplayer.it/recensioni/need-for-speed-prostreet-recensione.html", "text": "The whole game closely follows the exploits of our character, Ryan Cooper, a street racer, of legal races on non-professional courses. To cut the bull's head and not go into too much detail, obviously we will have to take Ryan to the top of the standings, until he becomes the best. The single player campaign puts us in front of several events called Race Days in which different types of challenges are proposed. Each time we get an overall victory on the day of the race, the next ones will be unlocked and so on. The whole style of the game, from the menus to the pre-race cut scenes, is set in a street style, graffiti on the walls with cans, colored tags and characters with a unique look. The same board that will allow us to choose the Race Day is made with a lot of style, as if it were a single real graffiti. Each race day consists of different challenges, many of which will surely be familiar to fans of the saga, from the fight against the clock to races against 7 other opponents, to races of speed. Drag races are one of the juiciest novelties and consist of a fight to the last hundredth of a second on a straight course starting from a standstill. Each race revolves around three challenges and they will all start with the tire warm-up phase, we will have to dose the right trigger of our controller to warm up our tires sufficiently without exaggerating, this will give us bonuses at the start and a more decisive cue. After setting off by engaging first gear, we will have to accelerate to the maximum and use the gearbox perfectly so as not to waste precious moments. We will also be able to use the nitro to reach a crazy speed even if only for a few seconds, therefore a careful dosage of this component will be necessary in order not to finish our momentum too soon. If these kinds of races initially have a strong appeal on the player, after a short time they become boring, given the constant need to redo that sort of mini-game which consists in bringing the tires to the right temperature and also given the fact that each challenge is divided into 3 events essentially identical to each other. The other types of competitions offer nothing new compared to the previous installments of the Need For Speed saga. Each race will allow us to accrue points that will allow us to climb the Race Day ranking, obtaining good results we will be able to win the event, we will then be able to continue racing to dominate it and thus obtain better bonuses, both in terms of money and in exclusive cars and in new events. Points will be awarded based on three distinct aspects: how quickly we finish the course, our position and the damage suffered. However, the element that weighs the most is certainly the victory, even if we will not run perfectly. It is important to remember that we will only be able to bring one car into the race for each type of different competition, so if our choice is not calibrated to the opposing cars we will find ourselves in serious difficulty. Moving on to the action on the circuit, we were not very satisfied with the work done by the developers in two unfortunately fundamental aspects: the driving model and the artificial intelligence of the opponents. The first was certainly developed by looking for a synthesis between an arcade driving feeling and a simulation one with the result of not expressing either of the two potentials to the fullest. The cars (especially up to about halfway through the game) are ~stationary~ on the circuit, they move with difficulty and above all the ability to steer at the right moment is affected, so it will sometimes be a challenge to overtake in the corners or find the right timing to the detached. The same goes for the opponents who don't fight with the due grit and often let themselves be overcome without resistance, certainly an unrealistic behavior, it greatly reduces the fun and the feeling of challenge. We then regretted not seeing the policemen, the police patrols that had revived the previous episodes constituting a further element of difficulty and therefore of satisfaction in the event of a positive outcome, reproposed in this new chapter. We will be able to drive many cars only that we did not like the fact that to get to the real racing cars like the Lamborghini we had to complete almost the entire game, we would have preferred to run immediately with the fastest cars. All racing cars will be able to suffer damage during the most heated competitions, (in this regard, an objective on Xbox 360 will reward us if we complete 5 races without making even a scratch to our vehicle) and before tackling the new circuit we will have to choose whether to carry out or not the repairs. Repairs obviously cost money but if we don't make them, the possibility of seeing dist will greatly increaseburn our car (this is also an unlockable achievement for Xbox 360). As in the previous episodes, we will be able to buy new vehicles and upgrade them until they look like completely different models, real rockets on four wheels. As in the previous chapter, the Carbon, through Autosculpting we will be able to model the various pieces of our vehicle polygon by polygon to make them more effective and more aerodynamic, then certainly the possibility of applying graffiti and decals using an editor very similar to the one could not be missing already seen in Forza Motorsport. The online component of the EA title has certainly succeeded very well and is probably the most intriguing part of this new game. We will be able to create and share a Race Day with other users, everything will not take place in real time but the ~event~ will remain online for a certain period so that anyone in the world, regardless of the time zone, can face the challenges from us chosen and prepared. We will be able to set not only the type of races but also which cars to use, therefore whether to put limitations or simply let the fastest one take home the entire prize pool. In the Xbox 360 version tested by us for this review, we were particularly amazed to see that it is possible to buy all the cars at any moment of the game by choosing between the points accumulated during the campaign or real Microsoft Points, essentially with real money . The user who wants to buy a fireball immediately will be able to do so without having to wait for the progress in the campaign, this not only affects the difficulty level of the title but makes it almost useless to play the single player. A system that we do not approve of and which has certainly been implemented in a decidedly incorrect way by the developers. From a technical point of view, the title made in Electronic Arts is certainly not one of the best exponents of its genre, the circuits are limited and almost never offer ideas for breathtaking visuals or demonstrations of the game engine's brute power. As for the cars, however, we can't complain since they are all faithfully reproduced down to the smallest detail. The attention that has been dedicated to the bodywork is evidently noticeable, but unfortunately not in the event of an accident and consequent damage to the structure of the car, with rather improbable dents. The sensation of speed hasn't always seemed convincing to us, the game engine in essence is only discreet, the scenarios are too bare and we have noticed more than a few bumps in the frame rate. A note of merit goes instead to the cut scenes and to everything that has been created by the developers around the races, the shows and the music are of sure impact. In essence, the game on PlayStation 3 and Xbox 360 is very similar, with a more stable engine in favor of the Microsoft console certainly not a difference that makes us prefer one of the two versions. A separate discussion applies to the Nintendo Wii, for which all games must be studied separately not only for the difference in hardware power but above all with reference to the control system. In Need For Speed ProStreet this aspect, which should be the point in favor of the Wii, was poorly done and using the Wii Remote to steer it by swinging it up and down was not a very good idea. Better to say, the system does not work as well as it should and if in most of the times we manage to paint the curves on the track, it will happen many times, especially in tight curves, that we will not be able to control our vehicle properly. Xbox 360 - Goals The 1000 points available are not very easy to obtain and rely heavily on online play and the contribution made to the Xbox Live community. They range from sharing a Race Day to dominating them all, from wrecking your own car to getting the perfect grip in drag racing. Comment Need For Speed ProStreet is the umpteenth chapter of a much loved saga that year after year finds itself forced to present something new without however distorting the canons that have made it loved over time. This ProStreet seemed to us in all respects a middle ground, a merely discreet title that tries to involve the player without completely succeeding. You will feel like Ryan Cooper for a few moments during the Race Days, but this is not enough to overlook certain obvious defects, first of all the driving model. The single player is only partially able to entertain, while the online multiplayer offers, surprisingly, many more reasons to play the EA title. The bottom line is that it's not easy to reinvent yourself every year, and ProStreet is the obvious result of this difficulty. Pros Good online build Street style Cons Some slowdowntoo many Driving the slow cars Low level of challenge", "date": "2007-12-06", "grade": null}