{"name": "Mario &amp; Sonic ai Giochi Olimpici - Recensione", "ref": "https://multiplayer.it/recensioni/mario-amp-sonic-ai-giochi-olimpici-recensione.html", "text": "But if Mario and Sonic race? The heart of ~Mario & Sonic at the Olympic Games~ is naturally given by the various disciplines that can be tackled both directly from the menu and by following the order of the various tournaments prepared by the developers. Tackling the races in the ~Circuit~ mode becomes essential, given that by completing them you will unlock new tournaments and new disciplines. ~Circuit~ is the story mode of the game, without the story. It is the one that gives you back a sense of accomplishment, of progression and that will allow you to access any type of discipline. Provided you play it alone, however, otherwise you can only use it for recreational purposes. The game offers the possibility of playing up to four, even with a single pad for the disciplines that alternate the challengers in the tests (that is, almost all apart from the running / swimming competitions and those with direct clashes). Once the game mode has been chosen, you will have to choose the type of competition or tournament in which you intend to participate, and finally the character. The latter are taken from the mushroom kingdom, and from the Sonic universe. There are as many Sonic characters as there are Mario characters, and the count rises to sixteen in all. Divided by category according to their characteristics, i.e. power, speed, resistance and skill, the characters are not excluded from any type of race. For example, if you take a powerful character like Bowser or Knuckles, you don't necessarily have to lose at 100 meters, also because each statistic is balanced by another. Sonic may be fast, but his stamina is among the lowest ever. In other words, choosing the right character for the right discipline can be useful for breaking records, but it is not essential for achieving a placement. I used to go to 100 then to see my baby Once in the heart of the action we will finally discover how Wiimote and Nunchaku were used. Each type of sport does it in its own way, although common actions such as running always involve the same movements. In the 100 meters you have to shake the peripherals as fast as possible, in swimming the same, but the type of movement will depend on the swimming style, for example you will have to shake them sideways, alternately, or paired. The jump races have an initial run that will be fixed at a given moment, and while the character continues running at the speed reached you will have to give an upward swipe of the wiimote to decide the height of the jump. Too little jerk means a short jump, but too strong a jerk means a bad jump which will give you an unsatisfactory score. The rules of athletics are more or less always the same, and some innovations come from other sports, such as skeet, archery, table tennis or fencing. In skeet you will have to aim directly at the targets that will be launched from the pits, and you will have as many shots as clay pigeons at your disposal. In archery it gets more elaborate. Sega has ventured into a curious experiment that allows you to simulate a bow in your hands. After shooting the virtual bow, you will have to aim by means of the combination of the pointer of the Wiimote, and an indicator controlled by the inclination of the Nunchaku. Once you have matched the two icons you can shoot the arrow. In fencing you will simply have to keep the measure from the opponent using the stick, and sink the blows with a shake of the wiimote, it is also possible to parry the opponent's blows and make feints. Finally, ping-pong sees you engaged in repelling the ball by means of a stroke with the wiimote. By making an upward shot you can dampen the shot, and by combining the move with the B key instead you can crush the ball. Like any self-respecting Mario game, there are also some madness races, reinterpretations of some of those described and which provide bonuses and objects to be thrown against the most annoying opponents. 20km a day, 10 outward, ten back Apart from some somewhat more approximate disciplines such as fencing and ping-pong, the rest all works diligently and pleasantly. Every now and then we can miss a few jumps but human error in a type of control like that of the Wiimote is more frequent than in the others. However, the action can be repetitive in a short time, especially if you play in single. Certainly after several games fatigue will come. Shaking the controllers like crazy to break the world record or to reach maximum speed to make the jump tires your arms. At the end of a session you will not have competed at the Olympics but you will have done some movement too, in short. Although the controls do not create problems and indeed make the action more fun and less obvious than the pressing indemonic, does not mean that your stay on the athletic fields is always fun. In Mario & Sonic at the Olympic Games there are no overly marked flaws, everything works as it should and has been given due care, yet the simplicity of the game comes to light too soon. Taking the structure of the classic athletics games and the Olympics (we mentioned Track & Field but many games of the genre are based on this structure) and using it equal-equal with the difference of the Wiimote is perhaps not enough. There is a lot of craft but little invention in this title, and the most experienced players will get to the heart of the game in a very short time. Sonic, Mario & Miis Comment Mario & Sonic at the Olympic Games may be the Christmas choice for many, either because very little comes out on Wii in December, or because the Sega and Nintendo mascots have a strong influence on many fans. The game is there, the realization too, but unfortunately the touch that could have made the result better than it is is missing. In single the game immediately exhausts its potential (despite the presence of different game modes), in multiplayer the situation inevitably improves, but even in this case one could hope for something more. The direct competition between players, the one at the base of the versus and which makes things more fun than a run-up to the best performance, is almost completely missing. Having said that, Mario & Sonic at the Olympic Games remains a product made with care and which achieves the not too ambitious goals it set for itself. Pros Good technical implementation Lots of different disciplines Controls respond well Cons Poor in single player Outdated structure Some sports are quite stretched out Mario & Sonic at the Olympic Games is available for Nintendo Wii and Nintendo DS will be available. It finally happened. Ever since Sega and Nintendo fought to the sound of Killer Application, there were those who dreamed of a game that brought together the two antagonists par excellence, Mario and Sonic. Many years later that dream came true and responds to the title of Mario & Sonic at the Olympic Games, a production that boasts the official license of the Beijing 2008 Olympics, and which includes the main Olympic disciplines. The older ones of you will remember Konami's unforgettable Track & Field released in arcades in 1983 and on the NES five years later. In fact, the structure and type of game is very similar, but if once it was necessary to press like madmen on the pad keys, now thanks to the introduction of the Wiimote it is possible to wave and ~mimic~ the movements of the athletes.", "date": "2007-12-05", "grade": null}