{"name": "Carnival - Recensione", "ref": "https://multiplayer.it/recensioni/carnival-recensione.html", "text": "The software house that created this Carnival has dozens of games on the PC platform, and is taking its first steps on consoles right on Nintendo Wii, published by 2K Games. We are talking about Cat Daddy Games, which has recently been taken under the protective wing of a new label called 2K Play, created specifically to give life to titles dedicated to ~casual gamers~, or people who like to play but are scared of a excessive difficulty, rather looking for a quick and simple entertainment. In fact, Carnival seems to meet this requirement: to be immediately accessible to everyone, adults and children, in a cheerful and playful context like that of the Luna Park. Add a seat at the table Carnival is a collection of mini games that have the Luna Park as their only common thread, the setting used to recreate that old feeling we had when we were younger wandering through the stalls full of prizes and puppets. In the Take2 title we enter a real virtual amusement park, with the possibility of choosing our favorite games, fishing for puppets and gifts from the coin-operated machines and collecting cute soft toys, just like in reality. At the beginning you have to create your own personalized avatar, a customizable virtual character that we will use both in single player and with friends. Carnival is a collection of mini games that have the Luna Park as their only theme The possibilities of modifying our virtual alter ego are not very many and are limited to a few facial features and the colors of the clothes, it is just the possibility of making each player immediately recognizable during the rotation of the rounds in the various games, nothing more. Once you have accessed the main menu you can choose whether to start alone or with a group of friends, for a total of four players maximum. Obviously a title like Carnival lends itself well to this second option, much less to solitary fun. Rich prizes and cocktail parties Carnival's main menu allows us to choose from numerous ~streets~ of the amusement park, each with three or more mini-games in their path, so that the game design recreates the sensation of wandering around an amusement park just like in reality. The effect is very nice and the atmosphere is very well done thanks to the use of suitable colors and well-chosen music. Once the direction has been chosen, you enter a ~wharf~ and start playing: in total there are 25 attractions, plus some bonuses to be unlocked later. Every amusement is faithfully taken from the really existing ones, even if many are perhaps rare to find in our Luna Parks but more frequent in American ones, such as the American Football ball throwing test. Many others are instead immediately recognizable to everyone, such as the test that sees us busy throwing disks trying to hit the bottles, or horse racing, or even shooting with an air rifle. By winning these games, you earn ~tickets~ that can be used in the prize-collecting machines scattered in every street, for example the Ufo Catcher (where we have to fish for soft toys by moving the mechanical arm), or the ingenious attraction of the coins, which sees us busy inserting money to make others fall on the edge ready to lose balance. Better in company than alone The reward system involves winning gifts and puppets every time we complete a minigame. Finishing it to the max will earn us a bigger and more important prize, with a minimum score, instead we will collect a small one. By collecting many of them, they can then be exchanged for something more important, to slowly get to the final prize. The system faithfully reflects what happens in real Luna Parks, but in the videogame context, winning virtual soft toys made of polygons gives infinitely less satisfaction; surely it would have been better to give away or have something new unlocked to entice players to go on and finish all the attractions to the max. But on the other hand, it's no coincidence, Carnival is a budget-priced game, which offers satisfaction directly proportional to the price we spent to bring it home. The title of the new 2K Play label gives maximum fun in the company of three other friends, like any other video game of this type. Carnival is a budget-priced game, which offers satisfaction directly proportional to the price we spent to bring it home Being designed primarily for non-habitual players, and therefore having implemented extremely simple controls, it will soon appear too simplistic to the more veteran players.or perhaps trivial, while it will be appreciated by aunts, grandparents, cousins and possibly girlfriends who have never tried a video game. The laughter and fun, however, in this case will be ensured not so much by the game itself, rather by the unusual reactions of those in front of the television monitor. Graphically, Carnival is very dull and shows things that are decidedly below average. Few polygons, no effects, no lights and shadows, no defined textures. It looks like a first generation Playstation 2 game, which is a shame as the Wii has all the potential to do better. On the other hand, the general design of the game was spot on, which makes the feeling of a real amusement park, as well as music, sounds and the Italian dubbing which is well executed and helps in identifying with the environment. Final comment Carnival is one of the first projects of 2K Play, a label born to create titles suitable for players who want to have fun in a fast and immediate way, without many frills. According to the foregoing, the game achieves its goal thanks to an excessive ease of the tests it offers and the all-too-essential controls. Carnival is a collection of minigames inspired by an amusement park, where the only reward, however, is to win some virtual soft toys, a bit unattractive as an idea. Maximum entertainment is given in the company of friends, where, however, the general hilarity will be triggered not so much by an exceptional creation of the game, but by the reactions of those present: the single player is practically non-existent. Graphically and technically it is very dull, and the only factor above the sufficiency is a design and audio sector that recreate a good amusement park atmosphere. The budget price is right, ultimately Carnival is a game that can offer some carefree fun together with our friends. Pros 25 minigames Fairground atmosphere For those who want to enjoy multiplayer Cons Gameplay too simple Another collection Graphics and audio Wario Carnival? Most of these mini-games are extremely simple and last a few seconds, just like for example in Wario Smooth Moves, also for Nintendo Wii. Some are really too simple, even disarming, like the one in which we have to shoot by hitting the red star in the center of the target: just keep your hand still and hold down the fire trigger to hit the target exactly, moreover assisted by the fixed viewfinder on the screen. In others it is necessary to observe an aiming indicator that always makes the same turn when moving, to finish its run on the target where we have to shoot, in this case it is enough to study the movement of the sight and press at the right moment, when it is positioned on the target. Other games are more complex, perhaps too much, as a matter of difficult control. This is the case of ~Nerves of Steel~ where we have to move a metal circle through an electrified wire without ever letting them touch: the Wii control is precise but the contacts are drawn so close together that it won't be easy to avoid the shock. Some mini-games have to be played in turns, while those to be played all together at the same time are the most amusing and entertaining, as they are more frenetic.", "date": "2007-12-04", "grade": null}