{"name": "OutRun 2: Recensione", "ref": "https://multiplayer.it/recensioni/outrun-2-recensione.html", "text": "Splash Wave A lot of water has passed under the bridge, the arcade has moved into our living rooms, Outrun is still with us. 18 years have passed, there is no more bitmap, but an unstoppable rain of polygons and colors, visually everything has changed. But it remains a manifesto of arcade dignity that still moves today, albeit with a few more wrinkles on the face, a pleased smile cannot help but appear in front of those sunny palm trees. Outrun 2 thus arrived on Xbox, with that promptness you didn't expect, because after all it was an unexpected appointment, but no less enjoyable for this ... Based on the Chihiro card, the original arcade has been quite successful, so it's not surprising the fact of being faced with an almost perfect home port, considering the close relationship of the Microsoft console with the aforementioned hardware. Abandoning all kinds of frills, the Sega title catapults the player into the main menu, depriving him of high-sounding fmvs or nihilistic proclamations. Outrun 2 is eager to get you playing, without wasting too much time, and with good reason. The menu does not limit itself to slavishly reproducing the coin-op, offering a curious mission mode, which immediately attracts attention. But instinct asks for the arcade perfect, memory claims hidden sensations, and the first game is the one that wants to blur the line between the games room and the living room. Outrun 2 is a real feast for the eyes, thanks to a powerful, fast engine, rich in polygons and quality textures Splash Wave The last practice before tying up the seat belts may seem atypical for the new, but it is heart-pounding for the old: the selection of music. There is no bmp hand fiddling on the car radio, but there are the old melodies, intact in their elusive splendor, rearranged like any self-respecting sequel. And there are obviously the Ferraris, we speak in the plural because the choice is quite vast, but the best performing cars will have to be unlocked with the sweat poured on the pad. Time after time And finally we get to the track, with a beautiful girl by our side. And everything is as we left it, the palm trees, the seaside metropolis that mimics a cartoony, colorful version of Miami. But it's all much nicer to see. Graphically, without going around too much, Outrun 2 is a real feast for the eyes, thanks to a fast, high-performance engine, rich in polygons and quality textures, only partially marred by sporadic drops in framerate, but they are trifles. What counts is the childish wonder in front of the thousand touches of Sega class: ups and downs, endless bridges, castles suspended in time, the variety of routes is so marked that, very improbably, when the checkpoint arrives we see the whole scenario magically transfigure to make place to new. But on the other hand, even the first Outrun was like this, as the crossroads that allow access to different scenarios remain unchanged, according to the player's choice: easy left, difficult right, as per tradition, but decide quickly, time is running out . In fact, the loved/hated timer is still present, so generous on certain occasions, too cruel on others, which forces you to an absolute race, to painstaking trajectories, to avoid contact with traffic and the edge of the track at all costs. And there is the drift, new, so emphasized that it ideally refers to the Ridge Racer saga, but also to Sega Rally. 'or am I weird? Obviously the coin-op mode, implicitly self-contained, cannot guarantee prolonged entertainment. The aforementioned missions section will take care of that for you. By tackling this mode, the game offers an abundant amount of objectives to complete, not very dissimilar to the licenses already seen in Gran Turismo. Initially short events, limited to a few stages, which gradually become larger and more demanding. But it is the tasks to be carried out that arouse hilarity: any racing game has asked you to reach the stage in a given time, probably no one has dared to expect to take photos while drifting, make your traveling companion fall in love with your road behaviour, carry out sums and subtractions to hit the right fork. None so far It is the claim of a category that has fascinated entire generations 'or am I weird? Needless to point out the fun induced by these missions, so varied as to never bore the player, but don't take them lightly, some could be almost frustrating due to their severity. Even a hesitation is enough to see the completion of the mission fade, but the ability to persevere to the bitter end, without losing the hard-won progress, helps a lot. As the various objectives are completed, the game will reward the efforts co new cars, exclusive remixes and the possibility to travel the various scenarios in the time trial. And the most tenacious players could get to race on the Scud Race and Daytona tracks, or go back to the first, unforgettable, Outrun A tribe that plays We've left Outrun 2's primary feature, gameplay, for last. Magnetic, irresistible, painstaking in offering the player a soft but rigorous learning curve. You start running instinctively, trying to reach the cursed checkpoint, then you master the skid, more and more, to arrive at endless sessions designed to dilute the disharmony of the trajectories, until you stubbornly seek the record time. But above all, having fun. Live support is also complete, which allows multiplayer challenges in the main mode, an addition not quite similar to the nature of Outrun 2, but certainly welcome. Outrun 2 is that sequel you don't expect, because it's much more than a sequel. It is the claim of a category that has fascinated entire generations, it is the sensation of taking home an entire cabinet without the smoke and confusion of the arcade. It is a traditionalist, rigorous, perhaps archaic philosophy, but also an experience that every true gamer should not miss out on. Because there could be no other possibility to relive (perfect) arcade racing in its most essential form. The Sega title doesn't want to evolve, it wants to remember the primary task of a video game: entertainment. An obligatory trip down memory lane for the enthusiast, a new experience to live for the neophyte. Warmly recommended to all. Pros: Playability and sky-high fun Excellent graphics engine Exhilarating mission mode Live support Cons: Occasional shooting Simple gameplay may not appeal Some difficult missions It was back in 1986 when Outrun landed in arcades around the world, and it was a riot. It was the golden years of Sega, it was the period of great technical innovations, when expertly manipulated bitmap images managed to give us the sensation of three-dimensionality, leading us to whiz through exotic places, with dream cars, at disproportionate speeds. It was the apotheosis of the arcade experience, of afternoons spent admiring the phenomenon on duty who boasted of his performances, dreaming of another token in his pocket.", "date": "2004-10-19", "grade": null}