{"name": "Chessmaster: L'Arte di Apprendere - Recensione", "ref": "https://multiplayer.it/recensioni/chessmaster-larte-di-apprendere-recensione.html", "text": "In the words of Garry Kasparov, perhaps the greatest chess player of the modern era, chess is ~the most violent sport there is~. Why such a statement, which at first glance may seem like a solemn exaggeration? Anyone who has faced a few games with an opponent of the same level will not struggle to find an answer: being able to checkmate the opponent's king requires a lot of strategy, a lot of mental machinations and a lot of ability to confuse the antagonist that no one would ever wish to face , in the role of strategist of an enemy army, one of the greatest exponents of this art, which when he moves to a competitive level becomes a true triumph of the all-human ability to reason. Ubisoft, always attentive, immediately saw the possibility of anchoring the Chessmaster saga, a glorious point of reference for the virtual chess player since 1986, to the winning trend inaugurated by Nintendo's Brain Training, and the DS version of the simulator includes many options in this sense. Josh's school In a game that has the subtitle ~The art of learning~, one cannot expect anything else, as a first requirement, to be faced with a complete, in-depth and sufficiently clear tutorial. For some time now, Josh Waitzkin has been dealing with this aspect in the various Chessmasters, a champion of the discipline as well as a lover of martial arts, who just this year published a book called, coincidentally, ~The Art of Learning~, with which he intends to spread at a popular level the knowledge of chess, to then extend the discussion to a more general level, on the ability of human beings to learn and the right way in which to learn any art, craft or discipline. The good Josh, in this version, appears on the upper screen with short digitized films while all the text is only written, and he talks to us, very deeply but with simplicity and great ability to synthesise, of all the concepts of the game, starting from the chessboard, continuing with the skills and values of each individual piece up to the most deadly advanced techniques. In this part of the game, absolutely fundamental and the first obligatory stage for those who are only now approaching this world, we can fortunately find only two defects: the first is of a technical nature and is absolutely negligible, namely the omission of the last line in the text. A bug that has very little effect, as the explanation almost never exploits all the lines of text available, and generally it does so with an adverb that does not hinder understanding at all. A little more serious is the fact that no distinction is made between real ~special moves~ such as castling, in which the pieces make movements that they normally could not perform, and those that should instead be treated as advanced concepts, the fork or nailing for example, which are techniques that arise directly from the normal characteristics of each piece. This thing contrasts a bit with the rigorous precision of the rest of the tutorial, precision which, moreover, never goes to the detriment of simplicity and clarity; after all, as Josh himself says when you meet him, the rules of chess are very simple, while giving life, like all great games, to tactics and strategies of a complexity that is unimaginable at first sight. Jack, horse and king However, Waitzkin's work for the DS version of Chessmaster was not limited to just the tutorial: the American champion is also responsible for those aspects that refer us directly to Brain Training and company, namely the ~Training Program~. This basically consists of a series of real mini-games on the one hand, and one of more classic chess problems, of those you would also find on Puzzle Week, to be clear, on the other. The mini-games in particular, while remaining strictly bound to the rules of the game, show a certain effort of imagination: by moving the pieces you will in fact be able to face classic puzzle game challenges such as eliminating identical pieces of fruit, finding and defusing mines in a minefield ( ehm), compose a hidden painting (but this is Gal's Panic!) The difficulty of these mini-games, among other things not always very immediately understandable, soon reaches rather high levels and this can be a problem, as initially they you will have only one available and to unlock the others you will have to demonstrate some skill with the previous ones. the rules of chess are very simple Jack, horse and king The Chess Problems, on the other hand, are classic, such as, for example, giving checkmate in a single move, finding the only move that allows you to avoid checkmate in turn, making a ~fork~ (i.e. simultaneously threateningtwo pieces with the same unthreatened piece in turn) and so on. Both mini-games and problems, once completed, analyze your analytical, concentration and memory skills according to the score and the time spent, and should thus represent the evolution of your skill in numerical terms. The result is not fully achieved, as there is always the feeling that the computer calculates your abilities in a weird way: it is not clear, for example, according to which criterion each minigame and each problem is linked to a single ability and not to the others ; in general, this aspect of the game that should have represented the flagship of Chessmaster DS is not completely convincing, mainly due to the poor accessibility of the mini-games and the scoring system. All this bearing in mind that, on an ~empirical~ level, often tackling the mini-games and above all the problems can only train your chess skills seriously, despite any poorly understood scoring system! Dog eat dog Beyond tutorials, mini-games and problems, however, the true heart of Chessmaster comes out when, finally, we are faced with a chessboard, an opponent and a complete game. Even in its prince mode Chessmaster offers various options, starting with ranked matches, real clashes that use the universally recognized rules. Here the ~The King~ engine, which has accompanied the series since the first version, is a stainless guarantee of quality as, probably, it is the best chess engine on the market at a consumer level, obviously without going to bother monsters like Deep Blue built specifically to put the greatest champions in difficulty. On the DS processors, The King manages to give life to a Chessmaster DS (the mythical bearded gentleman who looks so much like Santa Claus) with an Elo score (the standard used internationally to classify the skill of players) of 1850, which an honest champion would do in real life (to be clear, Waitzkin, who never reached the Grandmaster stage, had an Elo of 2464 in 2004), and certainly we are far from the results achievable on the most performing PC processors, but still able to make healthy blows to the majority of those who will buy this game. Here the ~The King~ engine, which has accompanied the series since the first version, is a stainless guarantee of quality Dog eat dog In total there are 24 different virtual personalities, equally divided into three levels of difficulty, each with an Elo rating but also with a particular way of playing, so much so that you could easily struggle to beat a certain player and instead find few difficulties with a higher one only because his play is ineffective against your tactics. One thing, this, which contrasts with the classic concept of difficulty in a video game, but which, on closer inspection, is just the umpteenth confirmation of The King's qualities. In addition to the ranked games, in which you too have an Elo score that will change based on victories and defeats, there is the obvious training (which also allows you to take advantage of various aids) and the presence of situations taken from some games history that will then be up to you to solve. Finally, you can have fun creating your own starting situations. There is also a two-player multiplayer mode, with a single card, which in addition to a classic game also includes clashes with special rules, but we note the absence of an online option, which would have been very inexpensive to implement in a game of chess and which would have given practically infinite longevity to a title that already has plenty to spare. Never as in Chessmaster DS is the technical aspect to be considered as the very last thing: the 2D graphic engine and the ambient music are both pleasantly anonymous, clear and all subservient to the optimal condition for playing a game. Finally, it must be said that the control system via stylus and touch screen, which although it must not have required who knows what efforts from the programmers, turns out to be on a par, perhaps superior, to the mouse control of PCs, and certainly unattainable, for intuitiveness and simplicity, on consoles. In 21 years of history, a series of chess simulations that were already notable from the outset can only have improved, and in fact we can only reiterate that, even in its DS version, Chessmaster is the de facto point of reference for the genre, finding among other things on the Nintendo laptop also a perfect control system. Unfortunately, however, what is an admirable attempt by Ubisoft to offer something more to DS users cannot be said to be perfectly successful, and the ~outline~ rit is therefore not up to par, although not at all unpleasant, of the main course. Even the lack of an online mode weighs on the final score of what remains an obligatory choice (it would be even if it weren't the only one...) for those who always want to carry a virtual chessboard and many tough opponents with them! Pro Chessmaster means trust Tons of options and modes Perfect controls Cons Innovations that don't fully succeed Where's the online?", "date": "2007-12-03", "grade": null}