{"name": "Euro Football", "ref": "https://multiplayer.it/recensioni/euro-football.html", "text": "Euro Football is precisely one of those products. Developed by a young company like Gameleons, which does not boast other equivalent sports titles in its catalog and is therefore at its first football experience, the game allows us to use a large number of national teams and try our hand at a friendly match, with a cup or with a championship. It is important to say right away that there is also a multiplayer mode via bluetooth, which allows two people in possession of the game to challenge each other: a certainly welcome extra; as well as the possibility of adjusting the volume independently from the phone, to remedy the shortcomings of some smartphones (in these cases very little ~smart~, given that the audio level adjustment in games is also present in cheaper phones) . While debating what kind of view is best to implement in a mobile football game, developers Gameleons take probably the most ~natural~ approach in relation to the display, i.e. a top view with the field placed vertically . A choice that goes well with the workmanship of the joysticks of most terminals, notoriously not ergonomic at all. Unfortunately, however, Euro Football has a control system that does not exploit this advantage in any way: the players move regardless of the inputs, and by pressing left or right we can simply change their direction using an arrow placed at their feet, which ~ rotate~ to one side or the other depending on the key pressed. It is a solution that, especially at the beginning, catches you unprepared, and it takes a while to get used to moving players in this way. In particular, it is difficult to jump over the opponents to reach the conclusion, therefore it is necessary to force the ball to circulate (using the 5 button to make the pass) and then shoot near the net (8 button). In case of non-possession, the game automatically changes the player we control and we can make tackles with the 5 button to win the ball. Fortunately neither fouls nor injuries have been included, because more often than not you end up hitting your opponents from behind with a certain amount of violence, and in the presence of real rules you would see extremely fragmented matches. On the other hand, training can be done in a very free way, and it must be borne in mind that the teams are made up of seven starters instead of eleven (with fictitious names, only inspired by the real ones). The technical realization of Euro Football does not shine for quality. The players boast a nice design, in practice they are represented as children (a sort of ~super deformed~ style, in short), but they boast an animation that is only sufficient in quantity and not very fluid. The biggest problem, however, is the scrolling of the field, rather jerky and slow, like the pace of the games in general. The sound is based on music that is not very catchy and a little repetitive. As for the control system, already described in detail above, there is a certain slowness of the game in responding to inputs, therefore in order to be able to put together some actions it is also necessary to ~calibrate~ in this sense and anticipate the moves a little. PRO Visual guessed Good player design Multiplayer mode AGAINST Excessively slow action Jerky scrolling", "date": "2007-11-28", "grade": "S.V."}