{"name": "Aliens vs Predator: Requiem - Recensione", "ref": "https://multiplayer.it/recensioni/aliens-vs-predator-requiem-recensione.html", "text": "Alien Vs Predator, P. Anderson's film from a few years ago, let's face it, wasn't that great, beyond the success at the box office. Fortunately, however, the homonymous game dedicated to it on PC, by Rebellion Studios, proved to be an excellent product in 1999, as if to reiterate the strange concept according to which ~a title inspired by a good film is usually never available lives up to expectations, but a game inspired by a bad movie can actually be good. So, years later, while waiting to see if the sequel to that film will be better or not than its predecessor, the guys from Sierra go ahead, publishing under their label a game inspired by it, made by chance by aforementioned Rebellion (better get your hands on they will have thought) and exclusively for PSP. alien vs. Predator: Requiem, this is the title, is in fact a third-person action tie-in based on the Hollywood film of the same name due out in the states this Christmas, where the player is called upon to take on the role of a solitary Predator grappling with hundreds of unleashed aliens and some humans in Gunnison, Colorado. The Predator possesses a wide variety of weapons and abilities to best give vent to its atavistic hunter instincts: its proverbial ~arm~ blades, spears, shoulder cannons and the ~sharp~ disc to throw at opponents are just a few of the devilry in his possession. With the cloaking device to deal with certain environments in stealth mode, other automatic aiming weapons, shields, thermal vision even at night with built-in zoom (the view switches to first person) and a discreet arsenal, the Predator is in short the usual terrifying war machine that we have come to know in all these years, both at the cinema and in games directly dedicated to him. The hunt is open AvP: Requiem is a rather linear title in its development, at least in the main single-player mode. On balance, the game scheme is extremely simplistic: each level (there are 15 in total) is structured in sub-levels, all set in three different areas, related by respective storylines (but all leading to the same ending), which concern underground areas , industrial and suburban areas of the city where the action takes place. Here hordes of enemies will jump out from every corner while the predator will be busy making his way to the end of the explored area, among other things solving simple puzzles and collecting objects (parts of the spaceship on which the ~hunter~ was himself) . That's all. And the introduction of an element such as the ~honor points~ which, according to the intentions of the programmers, should have given the title greater depth, is useless. These, which consist of a series of points that can be accumulated in relation to the number of kills and combos made during battles to unlock upgrades for weapons and protective armor, in fact, are managed directly by the CPU, which counts everything in a sort of ranking and automatically unlocks the special items, thus not allowing the user a certain personal choice. It must be said, however, that at least each location offers a specific challenge for that area. For example, in the sewer one you need to find the generator that controls the flow of water to activate it and open the way to the exit. Multiplayer and not AvP: Requiem offers its best in the battle phases. It is here that the user forgets the defects of the product for a moment and starts having fun. You can slingshot against enemies by slicing them with blades, hit them with your bare hands or shoot them at them, or you can lure them into a trap, in some isolated corner, camouflaging in the shadows thanks to the concealment option and then eliminate them from behind. etc. Very interesting then the counterattacks that can be performed by our Pg. For example, it is possible to grab the ~alien~ on duty by the tail, then overturning it to the ground or throwing it against a wall. Among the other game ~modes~ we point out the ~skirmish~ one, in which one of the levels (also five) must be completed within a predefined time frame of 5 minutes, killing all the enemies that separate the Pg from the end, also obtaining in this case some honor points. Multiplayer is also confirmed to be rather simple to play and short. In this mode, available only for wireless and for two players, each of whom has a copy of the game, as in the ~skirmish~ mode, you have to eliminate hordes of enemies without however being rewarded with a typical 1Vs1 challenge score (actually there is no winner, each player can't see the other's result!) or directed to action by a specific goal. And it all comes down to one continuous shootingmeaningless ory. Graphically the title Rebellion is not too bad. Certainly on PSP we have seen much better and the almost always dark settings of the game help perhaps to camouflage some imperfect details, however the Predator is recreated quite well, even in the animations, and the enemies, the xenomorphic aliens of ~Gigerian~ memory ditto . Even the locations, however visually well differentiated and which make use of an ~ad hoc~ color palette for the genre. The audio component has a good dubbing and above all a series of sound effects taken directly from the film, and therefore very close to perfection in quality. Comment Alien Vs Predator: Requiem is a decent action title which, like many similar products based on films of the same name, plays much more on the incipit of the film rather than on the actual quality of the gameplay. In fact we are faced with a game decidedly below expectations and in some ways difficult to judge: it has interesting elements but also many things that are wrong. This time, in short, not even the Rebellion have performed the ~miracle~, creating something that can't hoist itself above the stunted sufficiency. Therefore recommended to anyone who is a fan of the film(s) or to anyone looking for a particularly simple and quick title to play. Pros: Predator always has its charm. Fast-paced and fun combat stages. Cons: Not long-lived. Fairly simple to complete. Absence of a fixed perspective.", "date": "2007-11-29", "grade": null}