{"name": "La recensione di Rome: Total War", "ref": "https://multiplayer.it/recensioni/la-recensione-di-rome-total-war.html", "text": "The Total War saga is characterized by a winning combination of strategy, military tactics and politics; in addition, two very different concepts are fundamentally merged in it, capable, if exploited with the due experience, of completing each other in a precisely ~total~ product. Basically at the base of all three main titles that make up the saga to date there is the goal of providing the player with the tools to manage the political and military situation of the past in all its forms, touching every single facet of the art of warfare. A game capable of distilling drops of wisdom and military maxims, capable of reproducing the smallest nuances of Ping Fa, the ancient Chinese war treaty written by General Sun Tzu, applying them with extreme ease to the total enjoyment of a video game that is enriched of the most modern technologies in the field to reproduce the typical situations of war with extreme fidelity. Not to get confused As already mentioned, the game is deeply linked to the previous titles, but, as it was obvious to expect, there are some substantial innovations that are worth mentioning. First of all, the dislocation of the units on the strategic map has definitively abandoned the ~zone~ system in favor of a positional policy, so to speak. In fact, each unit, once selected, will bring up its own area of action, within which it can be moved, therefore we will no longer think about regions, but about the exact positions of the units. Furthermore, the role that the Roman Senate plays towards the player if he wants to start the game in the role of a Roman family is completely new. In fact, initially the Senatus, under the classic acronym S.P.Q.R. (Senatus Populus Que Romanus), will offer its protection so that it can enrich itself and boast of the player's conquests, to then unleash a conspiracy against him in the moment of maximum splendor of the gens in question. Another series of small improvements at the interface level complete what was left pending in the previous chapters, such as the simple, but comfortable ability to select units with the left button (both on strategic and tactical maps) and move them on the territory using the right button, or to move them to battle always using the same button. Finally, the presence of a massive tutorial and the mentor (a sort of spoken guide that illustrates all the secrets of the game) round off the array of novelties in style. Finally, the excellent localization of the product must be mentioned which in the Italian version can count on an excellent dubbing, both in the tutorial phases and in the battle preparation speeches, which are truly impressive. Total War is always Total War As mentioned, the characteristic structure of the series remains unchanged, and the gameplay, despite being more advanced than its predecessors, does not betray expectations. In a nutshell Rome: Total War offers a series of experiences to the player in order to revive the greatest battles of the times of the ancient Romans. The game offers the maximum potential through the campaigns, which reproduce the historical reconstruction of the Roman epic, since the fourth century BC. For the benefit of all those who have never had the good fortune to play the previous titles in the saga, it is worth presenting at least the structure of the game. In the campaign mode the player is faced with a map of ancient Europe, divided into the provinces of the time of the great Rome; on it it is possible to identify the main cities and a series of military units scattered on it which represent the forces deployed by the various factions. Total War is always Total War The game structure in the so-called ~tactical map~ mode is bound by the turn-based system, so that every move can be taken with extreme calm and reasoning, weighed with extreme caution. Each round covers a relative time of six months, during which it is possible to start the construction of buildings in the cities, manage any damage suffered in sieges or battles, deal with internal politics, diplomacy, economy and train new armies. Unlike the majority of strategic players, the player does not play the role of an improbable commander immune to the effects of the passage of time, but takes control of a Roman faction by controlling its leaders, possessions and armies. The generals, as well as the governors, pivotal figures of the game, age until they die of old age (when death does not occur due to other accidents, such as death in battle or due to a plague). Therefore, in order to maintain control of one's own cities, it will be advisable to guarantee a future for one's gens, bbased on the birth of heirs capable of transmitting the power of the family over the centuries. From time to time the women of their gens will give birth to male heirs and daughters, in both cases the future of these young people can be counted on as valid resources. In fact, once they reach adolescence, males will be ready to join older relatives and other generals, perhaps leading an army, in order to be able to attempt the climb to power and aspire to the highest offices of state; daughters, on the other hand, will be an excellent means of forging alliances with other gens and bringing eminent figures not belonging to one's own family to one's side. More handling, more realism The management of resources has a fundamental role, guaranteeing the supply for the population and the right compensation in sesterces for the cause of Rome. The map is decidedly enriched with details and has gained a three-dimensional appearance, far from the one proposed in the two previous chapters, which preferred a stylish, stylized map without reliefs. The pawns representing the armies moving on the territory move on it. The decision to abandon the decidedly stylized look, which could recreate the atmosphere of the desk of a strategist of the past, has left room for a new look that seems to be directly inspired by Civilization III. In this phase of the game you can enjoy the more calm and reflective aspect of Total War, in fact the rounds have no time limit in duration and every move can be made with extreme calm and caution. As in reality, in fact, sending troops away from a city, or moving huge human resources, can have a considerable impact on the management of a vast territory, and the player should ponder his every move. The development of cities involves considerable efforts both from the strategic point of view and from that of population control. Misconduct in urban management can lead the population to revolt, with disastrous consequences for the economy and possessions. Each city can receive a large number of improvements, sixty in all, capable of transforming the smallest of villages into a powerful capital. Each construction has the ability to increase certain characteristics of the city, both from a military point of view and from that of the well-being of the civilian population. Violence is not everything To achieve power it is not always necessary to use the brute force of arms, as there are units capable of meeting these needs, such as spies, useful for understanding the enemy's weaknesses and diplomats, essential for coming to terms with the enemy. Political negotiation can be very beneficial, as it minimizes casualties and creates alternative communication channels with allies and adversaries. In this regard it is essential to understand what role the characteristics of notable characters such as generals and diplomats play. In fact, there are a series of characteristics that identify its social weight and influence; these characteristics heavily influence the outcome of diplomatic proposals and the offers made. Therefore an elderly diplomat, endowed with a certain prestige will be an excellent ally in the negotiations. But when even the best of peaceful intentions fails in the face of an enemy who is aggressive or unable to communicate through diplomatic channels, or when the urgency of new territorial conquests becomes urgent, then one must take the field and wage war, or rather the other side of Total War. The purely strategic essence offered by the general map of territories leaves room for military tactics when choosing to fight. And here, incredibly, the charm offered by this title becomes even greater. In fact, the fights fully offer the possibility of enjoying one of the most fascinating aspects of a campaign. The player can choose at any time to be able to skip the direct combat phase by opting for the automatic resolution of the battle, which provides details of the losses and the outcome, victory or defeat, in an instant. But when the forecasts are unfavorable or uncertain, and above all when a battle is worth playing, both for its importance and for the grandeur of the forces deployed, then one can choose to personally command the army, knowing once for all the real time aspect of this game. The battlefield Projected onto the battlefield, the grandeur and finesse of this mode are immediately relished, perhaps the true essence of Total War. First of all, great space is given to pure realism, starting from the geographical reconstruction of the setting. Indeed thehe map, totally three-dimensional, faithfully represents the place where you were until a few seconds before on the stylized strategic map. Therefore, if for example we were near a mountain landscape, we will find the same mountains, woods and rivers seen on the general map. At this point the sides that will take part in the battle are shown. The two formations directly involved are not always the only ones to take part in the clash, in fact if another formation, allied or enemy, is present nearby, it is possible that this independently chooses to take part in the clash, at any time. Depending on the type of battle you are about to face, it will then be possible to prepare your troops by arranging them on the field during the phase preceding the actual battle. Within certain perimeters, limited to the side of the field that is being occupied, it is possible to organize the deployments in order to study the best plan to wipe out the enemy forces, or at least to push them back forcing them to surrender. The quality of the reconstruction is nothing short of breathtaking, the views offered by the camera, combined with the animations of each individual man arranged on the field independent of each other, perfectly convey the idea of the pathos-charged atmosphere of a great pitched battle . The purely war aspect is combined with the equally pleasant one of the direction and the screenplay. In fact, during the preparation phases, the commanders of the deployment encourage their men by explaining the reasons for the battle, the merits of their own army and the defects of the enemy. The charm resulting from these reconstructions really leaves you speechless. War as a form of entertainment Once the preparation phases for battle have been completed, the time finally comes to get into the action. Each type of unit, suitably arranged on the field following the criteria of the field strategy, can be commanded by platoons, they can be given an attack formation. The behavior of the soldiers is extremely realistic, both from the point of view of the reaction to the attacks and in response to the enemy offensive, and from the point of view of the reproduction of the clashes. The scenic elements play a fundamental role and become part of the action itself. For example, during a siege it will be possible to literally raze enemy buildings to the ground or set fires, all this will have an impact on the future conquest of the territory since it will be necessary to take into consideration that any damage done to the structures will have to be remedied once they become governors of the city . The morphology of the territory at the same time should not be underestimated in any way since it provides in any case an important element for the purposes of the battle. Venturing into a ravine or recklessly approaching a steep wall without knowing the exact position of the enemy can in fact prove fatal, even for the most battle-hardened army. This kind of thing must be constantly monitored to avoid unpleasant surprises in the midst of a battle that perhaps seemed already won. If only one criticism can be made of this mode, it is that of being a bit chaotic in the hectic phases of the battle, since the troops tend to blend in with those of the enemy and it is difficult to maintain control of the situation. Now, whether this is a coincidence or not, we can also acknowledge that the result is even more realistic, as it provides the exact situation of a hand-to-hand fight between hundreds of men. Think of pitched battle scenes from a movie like Braveheart and you'll get an idea of what we're talking about. It certainly cannot be ignored how much weight the managed combat mode has in the game, to such an extent that Total War can almost be defined as a double game, in which two imposing monoliths coexist, that of pure strategy and that of military tactics. If desired, the player can finish an entire campaign without ever directly taking part in the development of a battle, by choosing the automatic calculation of the outcome; likewise, he can totally ignore the strategic mode by choosing to play only the historical battles proposed in the appropriate mode. The offer in terms of available populations and territories to explore is truly impressive. Greek phalanxes, Roman legions, barbarian hordes, Carthaginians and all the most famous peoples who revolved around the splendor of the great Rome. The interaction between the various populations is able to reproduce the typical historical situations, such as the antagonisms with the Gauls, the difficulties of containing the rebel armies in the Italian peninsula and the subsequent phases of expansion throughout the Eur", "date": "2004-10-18", "grade": null}