{"name": "Assassin's Creed - Recensione", "ref": "https://multiplayer.it/recensioni/assassins-creed-recensione.html", "text": "The success of Splinter Cell and the desire for a high resolution Prince of Persia were the two reasons behind the hype generated around the Ubisoft assassin project. Since 2005 the production of Jade Raymond has been granted to our gaze, suggesting a natural fusion between the two brands of the French house. Now Assassin's Creed is out, we've played it, and we can draw conclusions. It's not Splinter Cell, it's not Prince of Persia, but a hybrid full of enthralling magnetism and a discreet ambition. But also several flaws. Nothing is real, everything is permitted The protagonist is Altair, a mysterious hooded figure, cynical, ruthless, agile performer in a distant, medieval, gloomy period, that of the Jerusalem of the third crusade. An adventure from other times, or almost, given the incredible twist, the big twist superbly concocted by Ubisoft in the very first minutes of the game. Revealing its contents is a real crime, but we can anticipate it, those who expect a conventional storyline will be very surprised. There will be a lot to discuss about the choices made for the narration, the hidden messages and the subtle metaphors, exactly like the controversial meta-works of Hideo Kojima (which, not surprisingly, he greatly appreciated!). But what interests us in the review is the Assassin's Creed video game. A term that fits a little tight (for better or for worse), AC is more of an experience, an experience that, however, not everyone might be able to appreciate. The beginning of the adventure sees our hero deprived of all power and ready to climb the ranks of the sect to which he belongs, as befits large productions (who said Metroid? Castlevania?). We soon find ourselves wandering the hostile lands with our trusty steed, in search of nine victims chosen by the leaders of our clan. Altair must find these people through a series of investigations in each of the three main cities built for the game: Damascus, Jerusalem and Acre. And once you have collected the clues, agree with the heads of the relative mansions of the assassins to eliminate the target. I'm here among you to issue a warning! Cities are undoubtedly the absolute protagonists of this production, the cornerstone on which all playful ideas are developed. And we have to admit, their rendering is simply sensational, thanks to the proprietary engine developed by Ubisoft Montreal. The amount of polygons on the screen is breathtaking, with an almost infinite field of view, which allows you to see even the most irrelevant details. All this is not dependent on the detail, textures, effects, hdr and rendering of the protagonist and the countless inhabitants who populate the streets is excellent. A new generation graphics engine cannot achieve a similar effect on its own, the enormous involvement felt by the player towards his digital alter ego and the world around him is also obtained thanks to skilful artistic research, which includes architecture, the costumes, the animations, the sounds. We are at the levels of the best cinematographic productions and, let us repeat, Altair is one of the most successful characters ever seen in a video game, undoubtedly to be combined with Capcom's Dante in terms of charisma and fascination. Everything is visually treated in a maniacal way, the result of careful studies on the weapons, uniforms and customs of the time. From the painstaking work on the same cult of the assassins, who present the left hand without the ring finger, in order to favor a retractable dagger hidden under the arm, simply fabulous. Not least is the soundtrack curated by Jesper Kyd, former author of Hitman and Kane & Lynch. The music is a combination of cold ambient sounds and delicate symphonic pieces, a contrast absolutely in tune with the visionary story written by Ubisoft. The two versions of the game are very similar, with the Xbox 360 slightly ahead of the Playstation 3, thanks to a more stable framerate in some passages and the lesser presence of tearing phenomena. Massacre in the Holy Land Unfortunately, the aspects are not all positive, some bad news comes from the gameplay side, which suffers from some questionable choices by the programming team. Abandoned the road of the classic adventure (the phases on horseback are quite specious) it was decided to embrace the philosophy of the sandbox game, so dear to Rockstar in its greatest exponent GTA, enriching it with some platform element. Especially during the climbs on the roofs to escape the numerous guards scattered in the cities through contextual shelters. In essence, all this would work if the militia possessed adequate offensive power, but unfortunately this is not the case, and it is enough to advance in the adventure to make a modor that Altair acquires special moves capable of defeating every attack, even making escape useless and almost counterproductive. The fights are quite fun, and they see the protagonist show off a galvanizing series of choreographic moves, but in the end, thanks to the underlying simplicity and the low enemy reactivity, it all resolves into authentic massacres that require the minimum effort from the player, but without It's another big dose of patience for their durability. The matter is complicated in the final part, excessively unbalanced on the clashes with the white blade, the epilogue is rather redundant and repetitive, without ever feeding a real sense of challenge in the player. Massacre in the Holy Land Very high! AC continuously urges the player to exhausting climbs, these are used to reach the panoramic points to obtain the coordinates of the objectives. Dizzying heights are often reached, from which our hero will perform the characteristic ~leap of faith~, ergo with a soft bale of hay underneath waiting for him! In one particular moment, in the medieval city of Acre, we will be able to climb a gigantic cathedral. It will be a more demanding task than usual, since unlike the other viewpoints, we will have to carefully evaluate the areas of grip. It is probable that the undertaking will require more than one attempt, but the satisfaction of reaching the top will be enormous. This is by far the highest point that can be reached in the whole game, where you can enjoy the impressive field of view of the polygonal engine, and be careful not to fall! Many will wonder about the meaning of this box. Well, we wouldn't mind having more moments like this throughout the adventure... Second comment by Antonio FucitoThe crusades, the Templars and the assassins represent an extremely fascinating subject. From this point of view, Ubisoft has been extraordinary in reproducing a charismatic and engaging world in the form of a video game, which enraptures you in its narrative and which has lively cities teeming with people. The impact with the game is therefore exceptional, the class can be glimpsed in every smallest detail, and personally I really liked the control system, which if it had been less ~automatic~ would have negatively affected the desire to reproduce an extremely skilled and capable of doing all he can in the most disparate actions, causing frustration to occur. It is a real pity therefore that the purely playful part is undermined by some basic problems, which start from the sections on horseback, which could have been exploited in a decidedly better way, to arrive at the lack of diversification between the various quests and cities, with tasks that they are repeated continuously and which in the second half of the game often lead to being skipped to complete the title. We are facing a brand with very high potential, which in the next few chapters can explode by proposing even more adequate mechanics and finally making better use of the possibilities that such a well-made realization of cities makes available. Don't miss it anyway, it absolutely deserves to be tried. Comment Assassin's Creed finally arrives on our consoles, failing to fully satisfy the hype generated by its presentation. The decision to set the gameplay on complete freedom of action collides with some gaps and a certain tendency to repetitiveness. Elements that could annoy those looking for an adventure capable of continually reinventing themselves, which unfortunately the Ubisoft blockbuster fails to do, in addition to not presenting a consistent challenge over the many hours needed to finish it. The compromises accepted for a production that would have required infinite times to be completed are fully evident. But even with its shortcomings, we have a visually magnificent title, with a unique highly immersive atmosphere, a must-try experience, you may fall in love with it. For our part, we do not hide a certain displeasure for what could have been not only a masterpiece, but a reference for a new genre. Despite this, it is a promising start for the future of the saga. Pros: Technically majestic Charismatic main character Great involvement and storytelling Cons: In the long run very repetitive Little challenge The fights deserved a better care", "date": "2007-11-23", "grade": null}