{"name": "Sinking Island - Recensione", "ref": "https://multiplayer.it/recensioni/sinking-island-recensione.html", "text": "After Paradise, a title that in many ways had left his fans disappointed in their expectations, Benoit Sokal returns to offer us his work, this time definitely changing course and giving us a game with more markedly investigative characteristics, with atmospheres closer to a yellow Agatha Christie than to the worlds that merged reality with dreamlike fantasies of her previous works. Sinking Island changes course in more than one way, starting from the setting, far from the tundra and snows of Siberia as well as from the warm and mysterious African scenarios, making us land (literally) on a remote atoll in the Pacific, Sagorah Island . Its existence was discovered by an American tycoon, Walter Jones, who decided to invest his billionaire capital in the construction of a monumental hotel, a soaring tower of extreme luxury designed to welcome the world's jet-set. For the first time since Amerzone, a title that is considered by many to be the best adventure game of all time, giving Sokal the honors of celebrity, we return to play the role of a male protagonist, detective Jack Norm, shipped on the island to investigate the death of the now billionaire, whose lifeless body is found at the foot of a cliff, thrown from the wheelchair he used as an invalid. The first thing to establish is of course whether it is accidental death or if there are the conditions for a murder investigation, which of course we will ascertain, thus starting a purely investigative adventure, another great novelty in the production of Sokal, which evidently aims to remain dynamic and explore new narrative options. A new paradise lost The setting in which the narrative is inserted, the island of Sagorah, is shaken by a terrible storm, which rather than reminding us of tropical paradises in which to spend luxurious and refined holidays makes us want to turn on a dehumidifier and hope to do not suffer from early rheumatism. The island is beaten by rain and wind and the atmospheres are consequently characterized by that twilight light typical of summer storms. The graphics, in 2.5D, do not fail to give the player the visual satisfaction to which Sokal's style has accustomed us, thanks to a good number of animations (such as the palm trees perpetually swaying in the wind) and a very high care of the details. We will spend a good part of our time carrying out the main activities of the game: talking to the various actors in the story, choosing between different dialogue options and questioning them about the various clues that we will discover during our investigation, whether they are objects and evidence, whether it be indications from other characters or our own conclusions. The management of the controls will be entrusted to the click of the left mouse button to guide Jack Norm and the right button to open the inventory. All the evidence, the objects, the dialogues collected will be recorded in a sort of PPA (~Personal Police Assistant~), in which we will reconstruct step by step (and literally) all the pieces of a puzzle that will take us from picture to picture to the solution of the problem. main puzzle: who and why killed Walter Jones. We will not lack the typical tools of every budding CSI: we will be able to take photographs of scenes and clues, detect fingerprints, collect objects, photos, documents and any clue that may be useful to us. Luxury and decadence There are, of course, many potential suspects in the murder, a billionaire, you know, always has many enemies. And in this atmosphere of ostentatious wealth and excessive luxury, a tropical storm, enslaved natives and a certain climate of depression in general, the definitive symbol of the island's decadence stands out: its sinking. The construction of the tower, like a modern Babel, in its exaggerated grandeur has in fact caused the slow but inexorable collapse of the very structure of the island, which is destined to sink, with all its secrets, like a new Atlantis. The story is rich of charm, in this sense Sinking Island certainly does not disappoint the player. Where, on the other hand, it makes you feel limping is precisely on the gameplay, afflicted by a frankly too slow development that leads us to spend the vast majority of the time extricating ourselves from multiple-choice dialogues that are a little too long to be considered ~lean~ and usable. Without detracting from the narrative value which is an integral and extremely important part of any self-respecting adventure title, in this case we find that it is too weighed down and aggravated by moving from area to area, indispensable if you have forgotten to ask or discuss say somethingwith a character, in a back and forth that could perhaps have been avoided. The long-awaited ~warp~ option on the map, at least for the areas already visited, has unfortunately not been implemented, preserving a tradition that we find at least obsolete. Tempus fugit As for the story, we are unfortunately forced to point out another flaw: compared to the previous production, a sui Sokal had pleasantly accustomed us, in Sinking Island the characterization and deepening of the characters and their related stories is a tad superficial. We will hardly get the feeling of having ~known~ the victim in question or the other characters in the criminal story. This tends to create a certain detachment, in the player, with respect to an involvement that is instead stimulated by the settings and by the sense of anxiety of the passage of time, which separates us from the inevitable conclusion of the very existence of the island and, with its disappearing among the waves, with the sinking of the memory of the crazy dream of a billionaire. The temporal component is in fact an element that is not neglected to exploit, thanks to the introduction of an alternative game mode, literally an ~against the clock~, which will challenge us to conclude our investigations against the passing of the clock, which it will take place in a real-time simulation. Events will unfold independently of our will and the characters will not always be available to answer our interrogations and, as if all this weren't enough to give us some anxiety, our boss will often call us to put pressure on us and find out at what point of our investigation we are. If we are unable to meet all of our objectives for a certain stage, we will automatically restart from a pre-set point, this time trying to beat our race against the clock. PC - System Requirements Minimum Requirements Operating System: Windows XP/Vista Processor: Pentium 4 1.5 GHz or AMD equivalent RAM: 512 MB Video Card: 3D 64 MB memory DirectX 9.0C DVD Drive Test Configuration Processor: Intel Core 2 Duo 2.0 GHz RAM: 2 GB Video Card: NVIDIA 8600M GS Comment If you loved Syberia and Paradise, you will also appreciate Sinking Island, the hand of Benoit Sokal is in fact impossible to ignore and, as always, able to re-propose his narrative universes with his mastery and unmistakable artistic touch. In addition to extremely pleasant and engaging graphics, the game makes use of some highly appreciated innovations, including an in-depth investigation system and the ~timed~ mode which gives a certain pathos and certainly a new challenge for those accustomed to the classic dynamics and relax in a point and click adventure. Unfortunately, however, the game lacks in the characterization of the characters and in their background, leaving us suspended in a climate of narrative superficiality that we are unable to fully penetrate. The dialogues that are sometimes really too long and the absence of the possibility of teleporting us from one place to another on the map, at least among those already explored, make the gameplay sometimes tedious. Definitely recommended to all fans of Sokal, as well as of the genre , Sinking Island remains one of the best adventure productions of 2007, even if the glories of Syberia are long gone. Pros Sokal's unmistakable artistic touch Good management of the investigative sector Innovative timed mode Cons Superficial background Sometimes the dialogues are too long Connections between non-optimized areas", "date": "2007-11-22", "grade": null}