{"name": "Star Wars Battlefront: Lo Squadrone dei Rinnegati - Recensione", "ref": "https://multiplayer.it/recensioni/star-wars-battlefront-lo-squadrone-dei-rinnegati-recensione.html", "text": "After Battlefront 2, there seemed to be not much room left on the PSP for other chapters in the series dedicated to the Star Wars universe. The peculiarity of the genre combined with a gameplay undermined starting from the intrinsic difficulty linked to the controls (simultaneously controlling the movements and aiming of the weapon, without having two analog sticks, is hard) and the absence of a real single player campaign, seemed to have closed the doors of the Sony handset to one or more sequels. But it wasn't like that, and indeed LucasArt even wanted to exaggerate by creating an ~ad hoc~ episode exclusively for PSP. Star Wars Battlefront: The Renegade Squadron, this is the title, is mainly a third-person shooter in which everything revolves around the typical key elements of the genre, such as action, strategy, conquest of certain control points and multiplayer component. The latter is the real novelty of this episode, given that it has undergone a marked improvement compared to the recent past and is in fact the main one of the title in question. Proof of this is the fact that up to 8 can be played in local wireless with as many PSPs and copies of the game (double compared to BF2) and, above all, also online on the internet. In fact, up to 16 players can now clash on the maps made available by the game and, if there is an insufficient number of human players, an adequate number of bots will automatically be added. In this case, the excellent performance offered by the product must be highlighted, with a lag that allows good game fluidity even in more ~extreme~ situations, i.e. with many gamers on the same server. Provided of course that you have an ~ad hoc~ network connection and a decent access point. The game modes supported for online are the classic ~Conquest~, ~Capture the flag~ (complete with a variant for the occasion that allows the player in possession of the flag to become a Star Wars hero), plus others that they give the game a great longevity. Renegades During the missions you have to achieve several different objectives, often related to the conquest of an area or its defense. Because, as mentioned before, the key element of the game is the appropriation of certain control points. Having reached and conquered one of these, it is necessary to remain close to it for a sufficient period of time to annex the area corresponding to one's faction, in order to obtain victory or a greater amount of reinforcements or still prevent the opponents from obtaining new troops, etc. It depends on the purpose of the level. And in 15 maps set on various planets plus 7 in deep space where you are called to drive some of the starships of the Star Wars saga, there is certainly no lack of variety in the ~expeditions~. Renegade Squadron obviously also has a single player component. But this time it's a ~real~ single player campaign. Each mission is in fact supported by a simple but effective plot, which also incorporates salient moments from the film saga, and introduced by sequences composed of semi-dynamic illustrated backdrops and a splendid soundtrack, namely that of the legendary John Williams. Once you start the level you get into the action. The player assumes control of a Pg (about which we will discuss in detail in the next paragraph) through the aid of the analog stick while with the right trigger the enemy is ~pointed~ with the so-called ~progressive auto-pointing~, a feature that allows lock visible targets with a scope whose aiming accuracy will increase over time. In fact, the more it remains on the enemy, the more its effectiveness will increase to the point that a possible shot fired by the user can in many cases be able to knock down the opponent immediately, with the first shot. If it is true that this option makes a firefight simple in many respects, it is also true that the gameplay gains, considering the obvious absence of a mouse, given that you don't have to mess around looking for the right combination of keys for effective manual aiming. In these phases, the possibility offered to the gamer of being able to use a fair number of vehicles, whether terrestrial or space, and means of all kinds, mechanical or animals, to carry out his mission is interesting. Other modes Finally, other modes available in the UMD are Instant Action and Galactic Conquest. In the first you can immediately configure a series of maps in succession to play without wasting too much time against the CPU, while in the second you can try your hand at a variant of the real game, inserting a small dose of strategy in the combat sections. And now we come to the characters, who, as anticmentioned in the previous paragraph, deserve a separate study. In fact, each of them can be customized, both from an aesthetic and physical point of view, and from that relating to the equipment at any control point in your possession. In practice, compared to the previous Battlefront it is no longer necessary to choose the type of fighter, since it will be sufficient to change the weapons or the Items supplied to acquire new skills or lose others. To make these changes to the equipment, however, the player will have to use a certain budget in money, so it will not be possible to equip your PC with a disproportionate amount of mega-weapons. We conclude this review by taking a look at the technical component of the LucasArt title. Graphically, Renegade Squadron is discreet, one of those products that don't make you cry for a miracle when you see it, but which still leave the view overall satisfied, especially if you make a comparison with what was in the previous version. What is certain is that in any case better can be done and we hope that in the near future, in a possible sequel, the aesthetic sector will be definitively improved. The audio, on the other hand, is splendid, which as mentioned above boasts the soundtrack of the various films, by Maestro John Williams, and themed sound effects always worthy of the film. Comment Star Wars Battlefront: Forsaken Squadron is to all intents and purposes a valid exponent of the PSP saga. The latest LucasArt effort manages to fill practically all the gaps of the first Battlefront on the Sony portable and to improve it in several points. With a real single-player campaign, an online mode and a simplified control system, it is a fun and unmissable title not only for fans of the Star Wars saga, but for all lovers of the genre. Too bad for the graphics not always up to par, but on the other hand it is still a multiplayer shooter on a portable console. Pros: Effective control system. Well done online multiplayer mode. Great variety of weapons and vehicles. Cons: Graphically improved. Short single player.", "date": "2007-11-20", "grade": null}