{"name": "Silent Hill: Origins - Recensione", "ref": "https://multiplayer.it/recensioni/silent-hill-origins-recensione.html", "text": "Travis Grady has to make one last delivery as yet another tiring day comes to an end, such as those of those who have to drive a truck hundreds of miles for work. Weakened by the insomnia that has haunted him for years, he chooses to take a shortcut towards his goal and therefore to cross Silent Hill. But he has to stop suddenly when he sees the silhouette of a little girl crossing the road dangerously... so he gets out of the truck and tries to reach her, but it seems impossible to do so. On the other hand, after a while he realizes that he is not surrounded by fog, but by smoke: there is a house on fire, and someone still inside. Entering the building for Travis will mean crossing the threshold of a different world from the one he knows, which reconnects to the lost memories of his childhood and to a reality made of horror, blood, nightmares. Truck driver in the fog Who is the mysterious little girl? What happens to Silent Hill? What are the secrets buried in Travis' memory? The game answers these questions through fragmented information, which gradually find its place like pieces of a puzzle. Everything proceeds in a rather precise and schematic way, with the protagonist finding himself having to explore settings until an event occurs that concludes the ~stage~ and directs us to another place to reach. It is clear that our walks through the streets of the mysterious town will be anything but peaceful, with the usual amount of gruesome creatures stalking us. To defend ourselves from their attacks, it is possible to resort to a combat system that is activated by holding down the backbone R (Travis puts himself on guard), then pressing X to strike and the analog stick to determine the type of attack. As a good truck driver, our character manages to knock out the monsters even using his bare hands, with truly spectacular one-twos, but it is possible to use a huge amount of improvised and non-improvised weapons. By accessing the inventory (Select key), we can in fact equip a melee weapon (there are dozens of them: pointed sticks, iron clubs, knives, screwdrivers, swords, wrenches, hammers but also lamps, bottles, filing cabinets, small televisions, etc.) or a firearm as well as key items and supplies (medicines, health drinks, ammunition...). You can also select a weapon without pausing the game, using the d-pad, but this practice is very risky, especially in the presence of opponents of a certain level. As per tradition, knocked down enemies must be ~finished off~ with a coup de grce to prevent them from getting back up. And weapons certainly don't last forever, but are equipped with their own resistance value that decreases according to use, until they break. In the case of firearms, it is clear that this value refers only to available ammunition. However, we will not be forced to fight all the time, especially in the streets, and we will be able to decide to sow the monsters simply by running (Square button), even if we must be careful not to run out of breath at the most beautiful moment. Deprivation and abundance The combat system of Silent Hill: Origins works well and falls within the canons of the series, apart from some innovative solutions (the automatic aim, for example) and some problems with the visuals (sometimes you can't center the camera as you would like). In the first phase of the game you find yourself having to deal with a chronic lack of supplies and weapons, which leads you to manage your inventory in a very rational way and to explore every alley in search of something useful. In the second half, on the other hand, it is possible to afford the luxury of wasting a few bullets even for insignificant opponents and arrive at the boss fight with an arsenal still ready to be used, the collection will be so abundant. Mysterious mysteries As mentioned, Silent Hill: Origins moves on tracks that leave very little room for chance. Each setting must be explored in detail to collect notes and objects, as well as to eliminate any threat. Once you enter a new environment, you quickly find a map to refer to to gradually locate the barred and locked doors, as well as the save points and finally the mirrors. The latter have an extremely important function, in fact they allow us to move to a different plane of reality, where everything has been eaten by fire and the walls are stained with blood: in that dimension there are not the same barriers and obstacles, therefore more than one occasion it is possible to take advantage of it to reach otherwise inaccessible areas of the map and find another mirror nearby to return to our world. riddles dthese types are accompanied in some cases by real puzzles, in the form of devices that must be activated in a certain way and which, if successful, release objects necessary to continue the search. In any case, everything contributes to the drafting of a story with decidedly adult tones, which often borders on the morbid and the supernatural, told through details and impressive cutscenes. Finals and extras As per tradition, the game has multiple endings (three, to be precise) that can be reached depending on our behavior, more precisely on the basis of the results achieved. Once the adventure is completed, it is possible to create a special save file that allows you to start over with a series of nice extras (alternative outfits, hidden keys, etc.) that spice things up. For this kind of title, it's the only possible choice to promote replayability. Technical realization The developers of the Climax team have done an exceptional job, adopting a series of highly effective solutions to represent supernatural events: an extraordinary alchemy that blends graphics and sound in a single element at the service of the atmosphere. Leaving aside the great quality of the cutscenes, the game itself is equipped with a surprising level of detail, which tries to overcome the limits of the Sony portable console also through the inclusion of a series of undoubted touches of class: Travis leaving bloody footprints after having trampled on the corpse of a creature, footprints that gradually become less intense until they disappear; or the on-screen image that shows a series of disturbances in some situations, recreating the defects of the old tape films when we are in the vicinity of enemies; or even the reflection in the mirrors, which shows us the alternative dimension that has always distinguished Silent Hill. The monsters and bosses draw on the bestiary of the series only minimally (the armless creatures, the nurses), introducing a whole series of more or less fearsome new enemies, characterized by a horrible and disturbing appearance. The graphics engine manages to handle the polygons without ever a problem, probably varying the frame rate in the most complicated situations but always keeping above 30 frames per second. And the sound sector? It can only be called majestic, really. Between songs of exceptional atmosphere, noises as deafening as they are disturbing and effects that always contribute to the construction of the typical scenario of the series, the audio of the game does not skimp on touches of class that place it at the top on PSP. Silent Hill: Origins must be played strictly in the dark, using a good quality pair of earphones, and is probably the ~strongest~ experience that PlayStation Portable owners can aspire to right now. Comment Silent Hill: Origins is an exercise in style that is revealed from the very first bars and shots. Travis's walk to the Cursed City is punctuated by a great atmospheric piece as the credits roll, and then the real action. The sensation, after a few hours of play, is that we are faced with an episode that takes what has been done so far and puts it together, using a series of highly effective and quality visual and sound solutions as a glue. This prequel gives us a strong and engaging experience, clear and linear enough to lend very little side to dead spots and moments of tiredness, linking up with what we saw in the four Silent Hill films and in the film based on them in the best way, with a history full of mystery and atmosphere. Technically exceptional, Origins is a bit short and easy, but in general it stands as one of the best titles available for PSP as well as one of the most successful episodes of the series. Pros: High quality graphics and sound Incomparable atmosphere Effective combat system Cons: Not very long Maybe a little easy Some problems with the camera", "date": "2007-11-19", "grade": null}