{"name": "Super Mario Galaxy - Recensione", "ref": "https://multiplayer.it/recensioni/super-mario-galaxy-recensione.html", "text": "The review in front of you is useless. If the meaning of an article of this kind must be to judge a game, examine its strengths and weaknesses and finally give an evaluation, in the case of Super Mario Galaxy it is a superfluous exercise, an avoidable effort for both the editor and the reader. as well as a waste of time which, on the contrary, should be spent holding wiimote and nunchuk alongside the latest, true and stainless icon of the world of video games. The space plumber We were all a little disappointed with Super Mario Sunshine, an episode for Gamecube that was certainly brilliant but too full of expectations and unable to surpass the revolutionary chapter for Nintendo 64; someone had even dared to insinuate doubts about the real ability of the mascot (now a prehistoric term) of the Kyoto house to find meaning in the modern videogame market, clearly directed towards an exaggerated search for realism, in a race to the last polygon through shootings, killings , gruesome storylines and ~mature only~ ratings. There were those who had even seen in this trend the antechamber of the very disappearance of Nintendo, dragged into that abyss that had already swallowed the former bitter rival Sega a few years ago. Few would have bet on a rebirth of the Mushroom Kingdom and in general of all those enchanted and fairy-tale worlds that at a certain point seemed to have gone out of fashion, like a once beautiful shirt but now one is ashamed just to wear it. Super Mario Galaxy is the epitome of everything Nintendo is all about The space plumber And instead the big N, the house that made millions of people fall in love with video games, first overturned the rules of home entertainment by producing a console based on concepts in clear contrast to the more popular ones, only to then observe the resounding success gained within to a philosophy of user expansion that everyone hoped for but that no one was able to achieve. And this same console today becomes the exclusive theater of the rebirth of the aforementioned old mascot, which after having put its face in many (too many?) Productions belonging to practically every videogame genre, returns to those platforms that decreed its immortality and which on this occasion once again sanction its triumphal entry into the list of the best games ever. This is Super Mario Galaxy, which is also the sum of all that Nintendo means, with a concentrate of that oft-cited N-difference that even detractors can't help but see as a unique feature of the Japanese house. The adventure begins once again with a letter from Princess Peach, with which she wishes to invite Mario to the castle to give him a special surprise during the Star Festival in which the whole kingdom participates. Arrived near the house, however, the (un)predictable happens; the evil Bowser together with an entire fleet of spaceships kidnaps not only the sovereign but even takes the whole manor with him, dragging him into deep space. Obviously, the moustached Italian can only immediately decide to take on the role of the fearless hero, going in search of the archenemy with the intention of putting all things in their place. A hero for every season The true sequel to Super Mario 64. This is the label that Galaxy has been given since the very beginning, and today, when the work is ~completed~, we can honestly say that this is exactly the case. Indeed, the latest plumber's adventure manages to give right from the start that extraordinary wave of emotions that the revolutionary three-dimensional progenitor was able to bring with him, above all as regards the absolute and perfect sensation of cohesion and completeness that is felt in every moment of play. All of this while not, of course, the turning point or milestone that was on the Nintendo 64; and if therefore it is difficult to see Galaxy in perspective as a title as ~important~ (in the strict sense of the term) as Super Mario 64, in the same way it is possible to say with certainty that the final result is simply a better game. The basic structure maintains the concept of stars to be collected, still 120 in all, but is immediately distinguished by the ingenious introduction of the subdivision of the levels into planets. In fact, as anyone who has followed the development now knows, the adventure revolves around a place that serves as a link for all levels; yesterday it was the castle, today it is the Comet Observatory. And yesterday we threw ourselves into paintings, today we visit rooms (bedroom, kitchen, bathroom, etc.) through which we reacheras the different galaxies, or rather the real levels. And it is precisely within these that Mario Galaxy shows the best it has to offer; in summary, with rare exceptions, the aforementioned levels are divided into small planets, each characterized in a different way and equipped with a puzzle to be solved in order to continue. Being in space, the gravity factor comes into play, a fundamental element to consider in each situation. This often allows you to explore the planets in all their parts, moving freely from one hemisphere to another, finding yourself upside down or reaching apparently inaccessible areas. It is therefore exploration, supported by a level design that defining masterful is an understatement, the keystone capable of making Super Mario Galaxy take off; each section is a surprise, a novelty, an unexpected moment capable of making even the most experienced and experienced gamer smile. The solution of the planets has in fact made it possible to give greater variety within a product that already changes all the cards on the table from one galaxy to another, transporting the player within 5 minutes from a house haunted by ghosts to a Caribbean atoll to a space galleon and so on. It is therefore exploration, supported by a level design that defining masterful is an understatement, the keystone capable of making Super Mario Galaxy take off A hero for every season And here we are on a small asteroid with its enemies, its design, its perfect coherence; after a few seconds the puzzle is solved, the Launch Star is activated and with it you reach the next planet and so on, in a whirlwind of pure gameplay that is so perfect as to seem normal, alive, real. And in a context of this kind, for example, the sections with two-dimensional mechanics fit, a tribute to the very welcome origins, or the various suits that allow Mario to transform himself by gaining new skills. Alongside the possibility of becoming invincible for a short time or throwing fireballs, already known to fans of Miyamoto's creature, the transformations into bee, spectrum and spring make their appearance. The first, priceless for the appearance of the mustachioed plumber complete with wings and sting, allows you to fly and climb the honeycomb walls; the spectrum allows you to take on the appearance of a round and white ghost to cross certain walls, while the spring, as you can guess, makes you bounce up to otherwise unattainable heights. In all cases these are absolutely amusing and enjoyable situations, with the partial exception perhaps only of the spring due to a certain difficulty in managing the hero's continuous jumping. The galaxies in which it is possible to try their hand at gaming experiences far from the standard ones are also splendid, and which exploit the wiimote in an excellent way; you can find yourself in front of a sort of Monkey Ball, or a race riding a manta ray, throwing Mario from one elastic larva to another by pulling them as if they were  precisely  rubber bands and so on, in a continuous succession of surprises and emotions. Perhaps someone could complain of a downward calibrated difficulty, at least to reach the first goal of 60 stars, but in reality there is no shortage of challenging passages and in any case reaching 120 stars is a goal capable of engaging even the most experienced. One star for friend The world of Mario Galaxy, we said, is alive; and this not only because of the huge amount of enemies, with old and new acquaintances, but also because of the allies alongside Mario. The inseparable and faithful Toads, without a doubt, but also the Lumas and the mysterious Rosalind; the former are a population of obese and absolutely irresistible star babies, while the latter lives in the company of the latter and watches over the Comet Observatory, giving the plumber essential help in trying to reach Peach. And Rosalinda is the protagonist of the ~story within the story~ told in the library; a simple, clear and touching fairy tale that in many ways recalls Antoine de Saint-Exupry's masterpiece ~The Little Prince~. A detail, this, which once again underlines the scope of Super Mario Galaxy and the level of attention and care placed in every single aspect of the Nintendo masterpiece. A quality that can obviously also be found in the control system, which uses just enough of the qualities of the wiimote, finding a balance between continuity with an almost perfect model and the right exploitation of exclusive potential. And so if all the actions Mario could count on on Nintendo 64 are present here, there are a couple of unpublished ones linked precisely to the Wii controller; one is the new spin attack, executable danI give the wiimote a shake and it's useful against most enemies. In order not to abuse it, the programmers have decided to make a short ~recharge~ of about a second between one and the next necessary, thus giving a strategic component to the whole. The second novelty is instead linked to the collection of astroshards, colored star fragments scattered practically everywhere in the levels. To get them you can either walk on them, or much more simply pass the wiimote pointer without the need for Mario to be nearby; it is thus possible to collect any astroshard that is actually visible, even very far from the protagonist (and it is also the only task of any second player). The latter also have a double function once collected: in fact, by pressing B they can be shot and used as a weapon against enemies or to reveal hidden secrets, but at the same time they should not be wasted since they can be used as a bargaining chip to unlock additional galaxies . A game enhanced by a sublime, unique, joyful, vibrant artistic direction One star for friend However, the novelties are integrated within a construct without weak points, an authentic extension of the player within the three-dimensional world; a few minutes of play are enough even for an inexperienced user to appreciate the precision, reliability and consistency of a control system that leaves no room for criticism. Instead, it happens occasionally to find some flaws in the pointing of the camera, which if in 9 cases out of 10 is perfect, can rarely be embarrassed to follow the evolution of the plumber. As far as the technical component is concerned, Super Mario Galaxy is simply the best title available for the Nintendo Wii. A game enhanced by a sublime, unique, joyful, vibrant artistic direction that delights the eyes and brings back atmospheres that are now increasingly rare and not very popular with market trends. The animations, the stroke of the drawing, the use of colors are so perfectly successful that one manages to effortlessly forget how the new Nintendo console is to all intents and purposes little more than a pumped-up Gamecube, while offering textures and effects (such as fur shading, metallic and reflective surfaces, transparencies, etc.) of great value. The one thing that's really hard to digest is the 480p resolution limit; despite what the Kyoto house says, ie that HD televisions are still a minority, it would be nice if the Wii could make a worthy figure even connected to this type of screen without showing aliasing and defects of this kind. On the other hand, the sound is impeccable, especially for a musical accompaniment which, between old and new re-orchestrated, offers a sensational quantity and quality of songs capable of immediately entering the ears and whistled throughout the day. The effects are also very good, which find the most valuable point in Mario's screams within a picture of great quality. Comment Super Mario Galaxy is just that Mario we've been waiting for over 10 years: the true sequel to the Miyamotian revolution that appeared on the Nintendo 64 in 1996. Certainly this time there are no new dimensions of the video game to which to give a direction and an indelible imprint; the result is therefore ~simply~ a masterpiece of game design that borders on perfection and makes everyone, truly everyone, damned happy to be part of and love this bizarre world of electronic entertainment. Pros True successor to Mario 64 Awesome in every way Nintendo magic is all in here Cons Some rare camera awkwardness Painful to see at only 480p", "date": "2007-11-20", "grade": null}