{"name": "CSI: Prova Schiacciante - Recensione", "ref": "https://multiplayer.it/recensioni/csi-prova-schiacciante-recensione.html", "text": "Crime shows have changed radically in recent years: young men in Hawaiian shirts and Ferraris, awkward lieutenants in trench coats and old bourgeois ladies with a passion for crime (and a worrying tendency to always find themselves with a dead man around) have given way to a less fictionalized approach to crime and its resolution. CSI is probably the symbolic series of this new trend, where the policemen are scientists who, with scientific technologies and methods, unhinge the dark plots of the criminals on duty. Within the evidence collection - deduction - interrogation scheme there is also room for a certain narrative component, but it is quite easy to imagine, given the rather aseptic and pragmatic setting of each episode, that a video game based on the series could easily be built. And this is certainly not new, since this ~Crushing Proof~ is only the fifth chapter of the video game version of CSI, but the first to arrive on Xbox 360, simultaneously with the PC. So the structure of the show, in itself, facilitates the transposition into a video game, being based on detached and linked compartments, which is found precisely within the title in question, with a digital reproduction of the typical phases of the investigations conducted from TV's most famous police and forensics lab, but was the operation successful? Can an evident structural affinity be enough to justify the production of a new video game? It is clear that this is a project that Ubisoft did not immediately consider as a potential hit, and this can be deduced both from the somewhat muted release and, above all, from the somewhat hasty realization. Work at the LVPD In CSI: Crushing Evidence we therefore find ourselves interpreting a newcomer within the Las Vegas Police Department, in the scientific police sector. We will find all the protagonists of the corresponding series reconstructed in 3D graphics, some with original voices dubbed by the corresponding actors. The game allows you to experience first-hand 5 different cases to solve, all original and unpublished, which range from various locations and different situations within the Las Vegas metropolitan area. It is a graphic adventure, of the investigative sub-genre, and with a first person view. Ubisoft has seen fit to entrust this new chapter to the care of TellTale Games, which would have several things to say on the subject, given that they are the authors of the new episodic series of Sam and Max, and boast past within LucasArts, forge of top notch graphic adventures. The chosen approach makes the game, however, a sort of spurious graphic adventure, if we take as a standard the typical point and click adventures that have evolved from the SCUMM system onwards. The idea that derives from CSI, if we approach it by thinking of Monkey Island, Broken Sword or others, is that the game is extremely driven, leaving no room for inventiveness or for an alternative and original use of objects and scenario. The setting obviously makes it necessary to remain firmly anchored to realistic and extremely functional procedures: the only objects with which we can interact are evidence, and we know that they will come in handy if subjected to certain procedures. This takes away a lot from the normal charm of the graphic adventure, which is largely based on the constructive and unexpected use of the objects available, but on the other hand it is an obligatory choice, to remain faithful to the procedural structure of CSI. The dynamics of the game are very similar to what we see in the episodes of the television series: we are assigned a new case, we go to the crime scene, collect the evidence, analyze it in the laboratory, and put the suspects under interrogation, until their possible arrest the final. It should be noted that both the collection of evidence and the interrogations are very linear and guided: it is possible to interrupt and resume them several times, but they do not allow you to take paths other than the pre-established one. The objects to be collected are well signposted, and those that can be collected are indispensable for the progress of the game, while during the interrogations no ~paths~ other than the pre-established one are allowed: the choices on the questions to be asked are minimal, and in each case they only concern the order in which they can be placed, since they must all be selected in any case. Forensics for Dummies The game is essentially based on two phases: on the one hand the collection of clues at the crime scene or other external locations, on the other hand the analyzes in the laboratory, the morgue, any garages to check the vehicles, the interrogation room and the Police Captain's Office. ANDessentially, the action takes place either inside or outside the LVPD, with locations unlocking as the investigation progresses. The places are framed with a first-person view, which can be visited by scrolling on imaginary ~rails~, practically scrolling the screen in various directions. The user interface is based on a cursor, which takes on different forms depending on the context: when it is possible to zoom in on the details it turns green, when it is appropriate to use an object for investigations it shows a toolbox, while when it is on a character it turns into a speech bubble, to activate the dialogue. Essentially, the game dynamic is based on having the foresight to pass the cursor carefully on all the screens, revealing the sensitive points from time to time and acting on them accordingly. The only choice placed before the player is which specific object (split between ~detection~ and ~collection~) to use to collect a particular piece of evidence, and involves using the vast arsenal of forensics: instruments for collecting tissue samples, liquids, fingerprints, various fluids or torches to enhance stains or the presence of particular substances, and in general all those fantastic tools that we see the protagonists of the film use. Again, the freedom of action is relative, since the analysis can only be carried out with the right tool: until this one is selected, our smart-ass teammate will keep telling us to choose another one, until the right choice, of course . Once the evidence has been collected, we can move (with the use of the PDA-handyman, a tool that allows you to select locations, review the dossiers or access the options) within the laboratories. Here we find several tools, but the embarrassment of choice is mitigated by the fact that the game immediately suggests which ones to use, signaling them with a flashing icon, which disappears only once we have concluded all the current searches. There is the microscope to analyze the tissues, the DNA analysis machine and the fingerprint machine, among other things. In general, we proceed by comparison, inserting a sample taken at the crime scene with another, or with the internal database. In this case, the difficulty lies in understanding which tests may contain positive feedback, but the choice is never too wide. Once we find a suspect, we can subject him to the famous interrogation. To reach the conclusion of each case, it will be necessary to go through the various phases of the investigation several times, gradually discovering new locations and new characters involved to question. Aesthetics of crime The fact that it's not exactly a very high-level production by Ubisoft is clear simply by looking at the game: the graphics are spartan, built without too much expenditure on polygons and effects, trying exclusively to make it functional without surprising anyone. The scenarios and the characters seem to come directly from the games of the previous generation of platforms, with the addition of a few effects that are absolutely insufficient to make the title aesthetically valid, an unjustifiable saving even considering that the scenarios can in any case be visited only by following the pre-established tracks (at the time of The 7th Guest, at least, this choice was counterbalanced by a screaming graphics, but those were different times). The latency of the commands is rather annoying, which involves a general slowness that makes you regret using the most suitable mouse, instead of the Xbox 360 controller, for such a game. The audio accompanies the calm progress of the game with sporadic music, while the dubbing, carried out with some of the original voices of the show (in English with Italian subtitles), although not excellent, is convincing. In particular, the dialogues are well structured and composed, non-trivial and ~adult~, which is essential to give credibility to the whole game structure. The characters don't spare themselves speeches on controversial topics and ~forbidden~ terminologies, complete with an ironic vein taken directly from the show. The script itself on which the 5 episodes present are woven is surprisingly valid, compelling and not obvious: certainly the strong point on which this CSI  Crushing Test can count. Comment CSI  Crushing Test can thrill the fan of the television series, and perhaps even those who are not, by virtue of the well-crafted script on which the cases are based. However, the game structure itself has several flaws: freedom of action, or the creativity and openness of the best graphic adventures is the furthest thing from this game. The gameplay is limited to a precise procedure for collecting clues (passancarefully review all scenarios until the cursor changes color), lab testing (trying all combinations of evidence gathered and possible options), and interrogation (simply asking all questions, in any order). The difficulty arises more from problems of a structural nature than from a real challenge posed by the game designers: if we don't know what to do, we will simply have to go through all the places and talk to all the characters until the situation is unlocked, and often regardless of any hidden links that need the old graphic adventure ~stroke of genius~. At the worst, however, our teammate will be able to tell us exactly what to do from time to time, if asked (however, the advice affects the final assessment of the case). The gameplay is way too driven to be fun. We would expect more from TellTale and Ubisoft. Pros: Well-crafted storylines Well-written dialogues and believable characters Experience CSI first-hand! Cons: Poor technical realization Game structure too closed and guided Interface a bit slow and woody Xbox 360 goals This game represents one of the most simplistic interpretations of the Microsoft unlockable achievement system that can be found on the market right now. There are 5 objectives for a total of 1000 Gamerpoints, each assigned at the end of each case, regardless of the final evaluation. For point hunters, this game represents a truly privileged prey.", "date": "2007-11-16", "grade": null}