{"name": "La recensione di Colin McRae Rally 2005", "ref": "https://multiplayer.it/recensioni/la-recensione-di-colin-mcrae-rally-2005.html", "text": "Cross-platform fever Multiplayer has tested both the Xbox and PS2 versions of Colin McRae 2005. The impressions confirm once again a situation that is difficult to dispute: multiplatform titles are always in favor of the Microsoft console, which makes the most of its potential, offering faster loading and a better definition. To tell the truth, the two versions are very similar to each other, and the PS2 one isn't excessively penalized by flickerio or aliasing, but having to choose the best one, also considering the efficiency of the Live service, it's advisable to focus on that crusade. Watch out for the mud However, it hasn't always been an easy road for Codemasters. Just like in a real rally, the evolution of the titles dedicated to Colin McRae had to go through a tortuous path, with dangerous skids. Perhaps intoxicated by the resounding success of the second chapter, the programmers were unable to fully reproduce its spirit on the new generation consoles, so much so that the third edition received mixed opinions. The fourth arrived perhaps too soon, and with no real possibility of positively balancing the situation. Probably this awareness has motivated the modification of the suffix, as for an identity recovery. Colin McRae Rally 2005 wants to reach a new significant stage in the saga, ideally referring to the legendary 2.0 version. And we have to admit, it succeeds. Where to improve an already solid foundation? First of all, I smooth out the most incomplete (or criticized) aspects, and enhance the positive ones. No sooner said than done. Codemasters certainly does not choose the path of innovation, but wisely draws inspiration from Electronic Arts in the work of accumulation for features, and graphic embellishment. But above all, it focuses on a justified online mode, which transcends the mere side dish option, and we really needed it. But let's go step by step. One of the most contested aspects of the previous chapters was the impossibility of tackling the career mode (the spinal cord of the game) with a team at will, being exclusively bound to the Ford driver, and related car. With the new edition, however, it will be possible to tackle it with your favorite car (and there are many), an aspect that raises the replayability factor. The pre-race setup has also been improved, another well-known thorn in the side of the series, now more fun to manage, and functional for the performance of the car on the track. A dutiful mention also for the number of circuits available, decidedly high. Both in terms of quantity and variety, this is certainly the richest edition of those released so far. Comment Colin McRae 2005 undoubtedly represents the evolutionary pinnacle of the Codemasters saga, since its 32bit debut. All the aspects that have decreed its success have been raised to power, with excellent results. So much so that we can consider this last incarnation at the same level, if not superior, of the second episode. As a natural result we have the best simulation dedicated to rallying, at least on the Microsoft console, while on the Sony one it finds the WRC series as a valid antagonist. The graphic sector does not reach the levels set by other productions, but is overall good, while the playful one perfects an already very solid base. Those coming from the previous chapter may not find substantial news, but on the other hand the various improvements and online support represent in our opinion a more than valid reason for the purchase. Pros: Run-in gameplay Many tracks and cars available Support for online play (both versions) Cons: Outdated graphics engine Few substantial changes since last year Not suitable for those looking for an arcade rally More than a rally, an impreZa Pad in hand, the rigorous nature of the Codemasters title is presented in all its splendor, proposing the well-known simulation-style driving system, but also inclined towards the less practical user. We could define it as a hybrid between immediacy and learning severity, what matters is that the result proves to be tremendously effective. The controls of the cars are easily assimilated, the management of the curves much less; dominating crazy racing cars under your hands, looking for the best time, represents an exciting challenge for everyone. As expected, the crucial factor is represented by the drift, the basic maneuver of the rally, the mastery of which is the real passepartout of progress in the game. We at multiplayer couldn't help but make a comparison with the Sony rally saga (WRC), the only one able to compete on equal terms with Colin. And we cannot deny the greater playfulness of the Codemasters title, which offers a more fun and more enjoyable driving experiencelinked to the ~playful~ concept, while not renouncing the realism factor, where the Evolutions one emphasizes its simulation purpose to an excess. The crucial factor is represented by the management of the drift, a basic maneuver of the rally, the mastery of which is the real passepartout of progress in the game. More than a rally, an impreZa The visual impact is less impressive, substantially similar to the previous version. Although not without improvements, the game engine now seems unable to offer the fateful qualitative leap that one would expect. Let's cite as an example the public, still represented with two-dimensional sprites, but also the level of detail on the settings. Limits probably also imposed by the multi-platform need to produce a scalable engine for all consoles, but the fact remains that, in the Xbox environment, Digital Illusions' RSC2 offers a graphics system of a very different bill. We were talking about Live support at the beginning. Well, Colin 2005 offers a very interesting and suitable modality for the Microsoft online service, that is the possibility of eight players competing on the same track. It is a choice that slightly distorts the philosophy of the title, but which is spot on in the context. On the other hand, it is established that the purely solitary nature of a rally simulator lends itself very badly to this type of use. Obviously, the success of this mode will be determined by the amount of users willing to try their hand at the challenges online. Colin McRae. All rally enthusiasts know well that this name does not only identify the famous driver, but one of the most popular video game sagas for its simulation depth, a real point of reference in the 32-bit era. Although today's situation is slightly more complex, the flagship Codemasters continues to shine in its own light, and the abandonment of the numerical suffix for the year of the current season suggests a serialization very similar to that of EA Sports sports titles. We are talking about a complex situation due to the decidedly high quality level achieved by the competition. If years ago there was no other title that could rival Codemasters racing, today the WRC saga (but also the rally mode of the next GT4) represents a respectable antagonist on PS2. On XBox however, Colin is still the undisputed pinnacle of the genre, considering that the only real competitor is RSC2 by Digital Illusions, a title however more oriented towards an arcade mold. Colin McRae Rally 2005 wants to reach a new significant stage in the saga, ideally referring to the legendary 2.0 version. And we have to admit, it succeeds.", "date": "2004-10-15", "grade": null}