{"name": "Fabbrica Frenetica", "ref": "https://multiplayer.it/recensioni/fabbrica-frenetica.html", "text": "In Frenetic Factory, the user takes on the role of a kind of production supervisor, who has to make sure that the product on duty arrives at its destination by going through all the various assembly stages. In playful terms, all this translates into a series of stages in which you have to build an assembly line, putting all the pieces in the right place and correctly connecting the point of origin to the destination. Especially in the initial levels, you have to do mainly with simple pieces of conveyor belt to be joined together, but it doesn't take much for machinery of various kinds to appear which must necessarily be included in the production process, otherwise the realization of an incomplete object and the consequent game over. The devices must first of all be fitted with criterion in the narrow spaces offered by the stages (fortunately it is possible to rotate them to obtain the best result), to then be joined to each other by the conveyor belt, until the exit is reached. There is no shortage of other types of elements in addition to those just listed: therefore, there are catapults to climb over walls, sorting pipes, teleporters, fittings and even gates to be opened by passing the assembly line through certain portals. In Fabbrica Frenetica, however, time is money: an indicator at the top of the screen indicates the compensation that will be received for the finished work, a figure that decreases second by second. As you continue, the complexity of the scenarios increases, together with the quantity and variety of machinery to be inserted within the production process, making a game that still has the defect of being a little too easy more and more competitive: the time available it is always very abundant, and the stages almost never force the user to puzzle over the possible solution. However, Fabbrica Frenetica has no hardcore puzzler ambitions, so it certainly cannot be crucified for its relative simplicity. The play offer is in any case discreet, with three difficulty levels corresponding to as many different ~fragmented~ factories in twenty scenarios each, and the always welcome possibility of entering one's score in an online scoreboard. Even the graphics of the Glu product do their duty without stating: the action is framed from a bird's eye view, with fairly detailed two-dimensional elements (although not very varied) and a color palette that perhaps deserved a a little more liveliness. Finally, the music that forms the background is quite harmless, and at least it does not induce the player to deactivate them after two seconds flat. PRO Simple, immediate and fun Technically well done Suitable for anyone AGAINST Easy and short for the more savvy A bit cumbersome control system", "date": "2007-11-13", "grade": "S.V."}