{"name": "Pixel Junk Racers - Recensione", "ref": "https://multiplayer.it/recensioni/pixel-junk-racers-recensione.html", "text": "However, this variety found in the modes fails to compensate for too flat game mechanics, which after an initial moment of euphoria gradually disassemble the enthusiasm until it turns into boredom. In the more advanced levels the difficulty rises and the challenge becomes more demanding, but not even this is enough to push Pixel Junk Racers over the border that separates a shallow game from one with solid foundations, also because after a certain level the cars become strangely uncontrollable at high speeds. There are 10 circuits in total, and they can be tackled both alone, competing against the computer, and in local multiplayer with up to seven (!) participants at the same time. It certainly won't be easy to find six other Sixaxis and above all six other friends willing to come to your house to play Pixel Junk Racers, but knowing that it is possible to do so is still pleasant. Graphics and sound Despite the heralded support for 1080p resolution, Pixel Junk Racers was certainly not born to amaze with a particularly accurate graphic design. Ultimately the glance cannot be considered too evil, but the backdrops, for example, are rather sparse and static even for an icon of minimalism of the genre. The audio is also quite simple, and combines a handful of music tracks with rather apt and nice sound effects, but also an announcer that you will begin to hate after 15 seconds of play. Comment Pixel Junk Racers is a fun game, with some features common to very few other titles (such as 7-player local multiplayer) and with a simply disarming immediacy. Yet all this is not enough, because the interest curve goes into free fall after a short time, and nothing can keep the desire to continue playing afloat. Let's say that, for the price at which it is offered, it is an honest purchase. Nothing more.Pros Immediate like few others Seven players in local multiplayer Cons Tired soon Shallow Pixel Junk is available on the PlayStation Network for PlayStation 3. Pixel Junk Racers is yet another driving game where small cars compete in fantasy circuits, all from an overhead view, just like the historic Championship Sprint, also available on PlayStation Store, or Micromachines, the title that best has represented this particular genre of games in more recent times. Like these esteemed colleagues, Pixel Junk Racers is very easy to master, and makes immediacy its main weapon. The controls are the mirror of what has just been said: one key to accelerate, one to turn left, one to turn right. There are 16 game modes available, which must be unlocked by playing in the single-player tournament, which become 32 if we consider the change in difficulty, effectively making Pixel Junk Racers a sort of collection of mini-games with a racing character. Of course, many of these events are very similar, but they still manage to offer us a more than good variety, ranging from the most classic races to the most bizarre and extravagant ones.", "date": "2007-11-13", "grade": null}