{"name": "Glory Days 2 - Recensione", "ref": "https://multiplayer.it/recensioni/glory-days-2-recensione.html", "text": "Comment We are dealing with a fresh and fun game, despite its unusual horizontal setting for a modern game and graphics that are not in step with the times. The title of ODenis Studio brings to mind old glories such as Dath Tank, Desert Strike, Herzog Zwei and strategic ones such as Advance Wars. Take all these titles a little, mix them together and you will get Glory Days 2, improved on the first chapter and now long-lived, varied and exciting, which manages to get along with strategic enthusiasts, but also those looking for faster and more frenetic.Pros Fresh and original gameplay Long-lived and deep Strategy and action together Cons Graphically not excellent Initially difficult controls Poor exploitation of DS features The first Glory Days, released years ago on the old Gameboy Advance, turned out to be a game with a unique gameplay, with a particular feeling due to the unusual graphical perspective for a military strategy game and unique opportunities. Unfortunately, some structural defects, such as controls that weren't exactly excellent, didn't elevate it to the headlines that it otherwise would have deserved. Fortunately, the sequel intended for Nintendo DS manages to improve the original chapter in all its aspects, refining its controls and making it one of the most original and fun strategic games of recent times. The software house responsible for this sequel is ODenis, a subsidiary of the English Ghostlight, already authors of some minor titles for PSP and the western versions of Shin Megami Tensei on Playstation 2. Strategic but with a certain arcade frenzy. The gameplay of Glory Days 2 is at the same time original, for a modern video game, but also classic, because it is inspired by almost forgotten 2D concepts. The legacy from the old 80s, when the games were almost all fast and frenetic arcade, you can hear everything. The view is two-dimensional and develops entirely on a horizontal level, with a lateral scroll that moves in both directions. The concept behind Glory Days 2 is simple: you start from your own base, located at the beginning of the level, and you must try to destroy the opposing one, located at the opposite end of the level. Everything that happens ~in between~ is the game itself, a Desert Strike-style arcade on the one hand, an Advance Wars-esque strategy on the other. The legacy from the old 80s, when games were almost all fast and frenetic arcade games, you can hear everything Strategic but with a certain arcade frenzy. There are many ways to destroy the enemy; in the first levels we learn the basics, or how to fly helicopters and air fighters, how to save civilians by getting them on board and escorting them to safety (as in the titles of the ~Strike~ series mentioned above) and how to manage resources by deploying and moving our troops. With the passing of time and as we proceed in the missions, we refine our guerrilla techniques and learn to use new weapons, increasingly powerful and destructive, such as the V2 rocket, heat-seeking missiles or bombers. The commands are given directly on the lower part, the touch screen, while on the upper screen we see the game action. The aircraft can be controlled in two ways: through the use of the directional pad, or with the touch screen. Using this last option, however, it is more difficult to have control of the keys as the hand that uses the stylus is busy and with it all the fingers. You can freely switch from one mode to another by simply pressing Start or the R backbone. Initially it is difficult to find the right balance and the game may appear more difficult than it actually is, but with little experience time everything will appear clearer and effective. With the touch you can also target thermal sensor missiles and deploy your army in the field. Initially it is difficult to find the right balance and the game may appear more difficult than it actually is To place land units it is necessary to have resources, and to increase the latter we have two possibilities: to take control of enemy bunkers, controlling them with soldiers just like with the conquest of cities in Advance Wars, or by rescuing and rescuing civilians . The latter must be made to board vehicles or ambulances and brought back to the base, and we get money or special weapons in exchange. All land units, from soldiers to jeeps, from tanks to artillery, are controlled by the CPU's AI and perform their duties without our intervention, following an attack/defense logic worthy of a tabletop RPG. Every half or man has well pr characteristicsecise, and with an enemy in front of it automatically attacks by asserting its rpg-style values. The use of the touch screen makes Glory Days 2 more accurate than its predecessor, even if the dual screen could have been used better. The horizontal map of the game is displayed on each of the two small monitors, albeit in two different points. Perhaps it would have been better to focus the action on the upper screen and concentrate commands, statistics and so on in the touch one. The microphone has no use, and added to that of stylus control, we are a bit sorry to think of what this title could have become if the peculiar characteristics of the DS had been exploited to the maximum. And by this we also mean the lack of the game through the Wi-Fi connection (multiplayer up to 8 players in LAN is however possible, but with more cartridges). Graphically the game is nice, with colorful and parallax-rich levels Graphically the game is nice, with colorful and parallax-rich levels, but definitely backwards by today's standards enjoyed on the Nintendo DS. The animations are sometimes sketchy and not very fluid, like those of civilians to be saved, other times good, like for fighters or helicopters. The audio compartment is instead good, thanks to the intelligent use of both microspeakers which give a pleasant stereo effect of the sounds and background music, always spot on and exciting, assisted by the introductions of the missions written in epistolary form, cared for and profoundly human in the their style and content, suitable for immersing the player in a real war context.", "date": "2007-11-14", "grade": null}