{"name": "Crash of the Titans - Recensione", "ref": "https://multiplayer.it/recensioni/crash-of-the-titans-recensione_a.html", "text": "Originally created to play the role of Sony's ~official mascot~, the Crash Bandicoot character introduced innovative elements to the platform genre from the very first episode on PSone, i.e. at a time when the genre was still struggling to find its place in the world. inside the new three-dimensional mechanics. A lot of water has passed under the bridge since then, Crash has produced a number of ~classic~ and spin-off appearances, abandoning the Sony exclusivity to aspire to the multiplatform product market by Radical Entertainment. Crash against the titans In this new episode, Crash must once again face the threat of Cortex, who suddenly appears and kidnaps his sister Coco and his friend Aku Aku. The situation is more complicated than in the past, however, because the evil scientist has invented a weapon capable of transforming small animals into enormous and very strong titans, endowed with various powers. The first phase of the game sees us becoming familiar with Crash's basic capabilities and with the control system, entrusted to the Wii-mote / Nunchuck combination: we can throw punches by pressing the B button and kicks with the Z button, while the analog stick moves character and the A button is for jumping. As you progress, however, new actions are added; for example you can shake the Wii-mote to rotate Crash after a jump and therefore perform a sort of ~glide~ to reach great distances. Furthermore, as soon as Aku Aku is recovered, the most significant elements of the gameplay come into play, which in fact differentiate Crash of the Titans from the previous episodes of the series: after having stunned a titan with a few shots, in fact, we can press down on the d -pad and we will see Crash jump on the creature's back and put Aku Aku on it as a mask. From that moment on we will take control of the titan and we will be able to use his strength and his powers to eliminate the very unlucky henchmen of Cortex as well as all the creatures in his service. Size matters The titans that we will find in the various levels differ in size and characteristics. The first one to attack us has armor and spikes, has a fair amount of physical strength and can create a sort of ~spiked trap~ that hits anyone around him, or charge a powerful running shot that can also destroy barriers. But mere physical strength isn't the only distinctive trait of the titans: one of them is quick and fast, and possesses the ability to fire shots of energy from a distance even using a scope (which we'll operate via the Wii-mote, of course). We will also be able to take command of huge creatures, including a sort of very slow but absolutely devastating mammoth. Furthermore, the principle of control through Aku Aku also extends to the end-of-level bosses, so in some cases we will be able to pilot truly gigantic creatures, which with a single blow can defeat dozens of enemies. This feature of Crash of the Titans is intended to vary gameplay by putting us in command of always different characters, which offer the protagonist the possibility of attacking in a much more effective and spectacular way. Sometimes controlling a titan also allows us to access sections that go beyond the classic platform structure: one of the creatures can curl up and roll at great speed, and while we ~ride~ it we will be able to cross tracks dotted with traps and obstacles. Technical realization The control system offered by Wii does its duty in situations where a pointing device is useful, or when controlling the titan capable of shooting or when there is to collect gems in the distance, in which case just hover over it with the cursor. For the rest, the infrared of the Wii-mote has only ancillary functions, in this case it can transform the pointer into a pair of moustaches, a wig or a pair of glasses to put on the characters during the cutscenes... It's different the speech relating to the motion sensor, which is called into question when Crash has to spin to stay suspended in the air longer after a jump, and which performs quite well. The rest of the controls have a decidedly classic setting (we would have to add ~thankfully~) and respond promptly to inputs, furthermore you don't feel the lack of additional buttons to control the view as this is completely managed by the game, as usual. rest in all Crash Bandicoot. Among the peculiarities of the Wii version there is not only the use of the Wii-mote and the Nunchuck, but also an excellent technical realization, which differs from what was seen on PlayStation 2 and Xbox 360 for greater fluidity in the management of the polygons :sixty frames per second, which suffer drops only in the most agitated situations. As far as the textures and the quality of the light effects are concerned, we are slightly above the PS2 version, while the sound sector is identical for all versions and is embellished by a high quality Italian dubbing, which manages to make the most of the numerous comical situations shown in the interlude sequences. Comment Crash of the Titans did not appear on the ~wish list~ of Wii owners, and its nature as a multiplatform title did not bode well, as this type of product on the Nintendo console has always left much to be desired. Yet we are not only faced with a great game, but at the same time with a truly successful transposition, which beats all the other versions for fluidity and further benefits from a well-chosen and effective control system, which lets itself go to very few uncertainties . Crash's new adventure features solid and engaging gameplay, with the various titans varying the experience just enough to keep it fresh. The cooperative multiplayer mode, then, gives us the possibility of playing together with a friend and multiplies the fun, which is hardly undermined by the movement limits imposed by the fixed view. The game is not very long or too demanding, but it really stands as a valid purchase if you are a fan of Crash Bandicoot or if you simply want to try your hand at a well-made and very enjoyable video game. Pros Technically great Really playable and fun Well thought out control system Cons Not very long... ...nor very difficult Some drops in frame rate", "date": "2007-11-08", "grade": null}