{"name": "Port City Ship Tycoon", "ref": "https://multiplayer.it/recensioni/port-city-ship-tycoon-recensione-gestionale-navale-mobile.html", "text": "Port City Ship Tycoon's review shows how the solution adopted by Pixel Federation to translate the complexity of management into the mobile sector is actually functional and can therefore be adapted, as a real standard, also to different areas while keeping the general structure of the game. To have a more precise idea of what it is, you can take a look at the previous review of Trainstation 2: Railway Empire, because we are almost facing the same game, only in this case, instead of trains, we are dealing with ship traffic. The aim is to manage various ports around the world, starting from San Francisco and unlocking other naval hubs of great intensity, trying to sort out the traffic of materials in the best possible way and solving some contextual problems that may emerge at various critical points. Port City Ship Tycoon puts us in control of a port area with heavy ship traffic As we have seen in Trainstation, this game also essentially relies on two elements: the management of naval traffic, with the production and transport of resources on the one hand, and collecting on the other, which pushes you to always conquer new ships to be used inside the fleet, with the possibility of closely observing its characteristics and progressively enhancing them. On the other hand, the general layout lets the model-making spirit that underlies this particular experience shine through, presenting the various port areas as models to manage, take care of and improve. Like any management software, this too relies on the innate tendency to control of most players, but this does not only derive from the desire to balance everything in the best possible way to fall within the imposed parameters, but also from a certain push towards purely aesthetic contemplation of the collector of ships/models, which clearly emerges in the menus dedicated to these. A seaport in your pocket The management of ports in Port City Ship Tycoon is stratified and takes place through different menus relating to different aspects of naval traffic, even if everything is clearly very simplified and made particularly digestible even for users less accustomed to the strategic approach and more inclined to titles mobile ~hit and run~. It starts from the selection of the port area (four can be unlocked: San Francisco, Rotterdam, Scandinavia and Japan) and from an aerial view of this area, to move on to various other menus concerning more specific micro-managements, scaling between different levels . The macro-area allows you to see the traffic of ships in real time and select the various points of interest, which assign different tasks to be completed usually related to the transport of raw materials or semi-finished objects, with the possibility of improving some elements of the map and add new services and facilities. Port management opens up to a sort of city builder structure At a more specific level, other menus allow you to improve ships in order to increase their capacity or other characteristics, buy materials, unlock new ships and captains to perform various tasks. Particularly important is then the management of the port, which opens up a real and proper sub-section of the game by introducing almost city builder dynamics: in this case we are dealing with a closer shot of the port area, which allows you to build new structures and manage them better, in order to create new areas for the production of semi-finished objects starting from raw materials, which will be part of naval traffic, or to expand trade and other activities. Another important element is the expansion of the fleet, which takes place with the opening of typical prize boxes by spending the keys conquered by completing missions or by spending money for the various in-game currencies, and this is the aspect that most recalls the collecting. The conquest (or purchase) of new ships is a fundamental element of the game As befits a mobile game distributed in the form of free-to-play, all gameplay is based on a system of expectations that push towards micro-transactions, even if these are not mandatory in order to move forward. As usual, we start with micro-pauses of a few seconds and arrive rather quickly at missions that require half an hour of waiting, which can be avoided with the usual expense of gems (purchasable with real money) or with game time management in way to fill those moments with other in-game activities or simply interrupting the session.", "date": "2021-08-12", "grade": "6.8"}