{"name": "Roots of Pacha", "ref": "https://multiplayer.it/recensioni/roots-of-pacha-recensione.html", "text": "The history of farm simulators is marked by the desire to escape from the daily grind, a characteristic that unites both the protagonists of video games such as Harvest Moon and Stardew Valley and passionate players of this genre. In prehistoric times, however, the rural life of hunter-gatherers was not an escape from everyday life, but an obligation and also a continuous discovery: the small team of Soda Den, made up of ten people and divided between California and Argentina, has decided to set his Roots of Pacha in a fictional place, but with many contacts with the life of the tribes who, in the past millennia, have defined the course of human history. Roots of Pacha look much to Stardew Valley, but manages to create its own, distinctive and often original path. This happens above all thanks to the mechanics of Ideas, capable of creating a strong sense of progression and radically changing the entire village, and not just our protagonist's farm. The adventure turns out to be very choral, based as it is on collaboration with the other members of the tribe, on the fulfillment of rituals and on the increase in the prosperity of the clan, which is decisive for allowing us to unlock new skills and areas to explore. We tell you about this prehistoric life simulator in our Roots of Pacha review. Under the shade of the Pacha Tree Taming and raising animals is essential to progress in Roots of Pacha After a simple editor, which allows you to choose the body type of the player character, the hair style and the color of the eyes, clothes and decorations - and is capable of creating very beautiful avatars to look at - we begin to follow the story of a tribe of primitive men and women, told through dialogues (the images in the boxes of each character are beautiful) and cinematic sequences. The elderly Tetih tells the younger ones the story of the group and how it came to settle in that place: the spirits, questioned by the shaman, had forced the tribe to move east, in search of a Pacha tree near which to settle The bond with spirits and divinities remains alive throughout the adventure, which in a long flashback follows the history of the group and its development, in the name of new discoveries - agriculture, cattle breeding and much more - for a duration of about forty hours of gameplay. The events told, divided into days (as per tradition in the genre, it begins in a splendid spring) are strongly based on the need for cooperation and dialogue between the members of the group: overall, the story is much less ~solitary~ than other titles belonging to the genre, such as Stardew Valley, and is full of events, surprises and rituals capable of keeping the players' involvement alive, marrying perfectly with the proposed game mechanics. Harvest, sow, raise In Roots of Pacha it is essential to collaborate with other tribe members to develop Ideas and advance life in the village What leaves you amazed about Roots of Pacha is the overabundance of possibilities offered to the player, both in the offline campaign and in the multiplayer mode, combined with small tutorials that always make the mechanics implemented within the game clear. As the days go by, new explorable zones are introduced, and the cinematics that open the days give little hints to the player about the activities they might be focusing on. And the possibilities are always many: if at the beginning it will be natural to focus on exploring the woods surrounding the settlement to find seeds of various plants and experiment with their cultivation in our rudimentary farm, continuing on you will be tempted to enter mysterious caves, fish , taming animals and building wells. Everything happens gradually, of course, but the days of Roots of Pacha are always full of things to do. Compared to other farm simulators there is a strong simplification in the tools to be used: with a simple amygdala rocks are broken, weeds are uprooted and branches are eliminated, thus expanding the space in which one can dedicate oneself to agricultural activities, and they can also fish for fish that populate nearby streams. The fishing minigame is unfortunately rather monotonous (you have to keep the cursor on the fish icon until the right moment, moving it if the animal notices you) and the same goes for animal taming (you play the flute by pressing a key to time), but overall the activities are well thought out - and being very numerous, you never suffer from boredom. All this must be done by paying attention to the barstamina, replenished by eating delicacies that can become increasingly complex: after all, part of humanity's progress has also gone through the improvement of culinary technologies. As we said, a feature that distinguishes Roots of Pacha is the strong focus on group dynamics and the progress of the primitive community as a whole. The indicator of the Prosperity of the clan is fed by the contribution of all the members, and over time it will only increase, naturally also thanks to the contribution of our protagonist: collaborate with the offer of fish, fruit, vegetables and other goods collected thanks to our hard work is essential to unlock upgrades and new skills for us and our companions. Observation of the surrounding world is also essential to fuel progress: for example, by watering the fields going back and forth from the river with our simple animal skin to fill, we will be able to get the idea for building a well and make it happen with the help from another farmer. The dynamics that are created in this way are engaging and fun, without downtime, also thanks to the gradual expansion of the lands that can be explored by the protagonist. We did not appreciate, at least initially, the challenges proposed by the mysterious cave which becomes explorable after a few days, but fortunately the continuation of the adventure has made even these sections more interesting. A world to explore Some mini-games could have been more engaging, but fortunately the variety of activities in Roots of Pacha never leaves a sense of boredom Continuing the adventure will lead us to enter more and more into the woods, clearings and caves of the prehistoric world designed by Soda Den. Although the team is very small - just ten people - the developers have been able to create a cohesive and beautiful world to look at, colorful and varied, with simply excellent art direction. The menus are very reminiscent of those of Stardew Valley, while the rest of the interface is based on the protagonist's belt and divided into a bag dedicated to seeds, one containing the tools of the trade and finally a grid dedicated to the objects that are collected while working in the fields or exploring the game world. Even the map is clear and pleasant to see at the same time; on a visual level, everything is very consistent with the prehistoric setting chosen by the team. In the version we tested before the release, there was no localization in Italian; we played Roots of Pacha in English. The sound design adequately accompanies the adventure in all its parts and is well thought out both in the effects and in the music, which communicate the joy of living and of discovering every corner of this pristine world; we point out that we occasionally experienced some audio glitches that completely removed the sounds connected to the protagonist's actions, but a reset of the game was always sufficient to eliminate the problem. The occasional crashes are more unpleasant, also because saving takes place only at the end of each day (exactly like in Stardew Valley) and this has led us, in some cases, to lose our progress.", "date": "2023-04-24", "grade": "7.5"}