{"name": "NBA 2K8 - Recensione", "ref": "https://multiplayer.it/recensioni/nba-2k8-recensione.html", "text": "The NBA, in one way or another, has now entered all the homes of basketball enthusiasts, thanks to increasingly impressive television coverage, to some initiatives aimed at publicizing it in Italy as well (see this summer's league year, which also touched Rome) and in the presence of two of our basketball players, namely Andrea Bagnani in the Toronto Raptors and Marco Belinelli in the Golden State Warriors, who represent a bit of Italian pride in this sport. The absolute protagonist as regards the videogame transpositions of this sport is the NBA 2K series, developed by Visual Concepts, which arrives on the market just before the start of the new American season, obviously with all the updated rosters. The evolution of basketball One of the major criticisms we made to the last chapter was addressed to the game interface, very cumbersome. This year there are several improvements in this sense, even if it is still not very intuitive, while allowing quick access to most of the available options. The modes are as always present in large numbers, first of all it is possible to choose whether to create a team from scratch and made up of NBA characters, modify your profile or visit the trophy room and characters unlocked during the games. At this point you can choose to learn the basic techniques of the game through training or try your hand at one of the different modes available. Also this year the most important and complete is the one called ~The association~, which allows you to reproduce the American basketball season in all respects, with the 82 games of the season, the playoffs, the choice of rookies and the type of training, aimed at enhancing certain characteristics at the expense of a decrease in physical fitness. Therefore, complete management of your team, which makes the player become a real General Manager. Compared to last year, the greatest improvements have been made in the management of transfers, which also takes into account the personality factor of the various basketball players, who are satisfied with lesser wages in order to play in the most famous teams. There are also a number of interface changes and a few more options, but in general this mode is an evolution of the previous one, without completely new factors. If in any case the association for some may be too expensive in terms of time, there is always the possibility of organizing customized tournaments in terms of length and number of teams, try your hand at a quick game or still face the Blacktop, which does its return in enhanced version. This mode is closely linked to the all-star game which takes place every year around February, and in fact, in addition to the possibility of playing a game between the rookies (freshmen) and the Sophomores (professionals in their second year in the NBA), there is of the three-point contest and above all of the dunks, which has a personalized control system. With the left analog stick the player moves, with the right one, approaching the basket, he prepares the type of dunk, with the R2 key, pressed with the right timing (calculated by a special time bar) he finalizes the same. Really a lot of fun, thanks to the possibility of playing this mode online for up to four players. Before taking the field, it is also possible to choose the level of simulation with which you want to compare yourself, in such a way as to make the title of the Visual Concepts usable by all types of passionate sports gamers. The first aspect that can be modified at will is obviously the skill of the Artificial Intelligence of the computer-controlled characters, passing through the single enabling of all the rules that make up a basketball game, up to the frequency of whistles for infractions such as fouls, second , steps and so on. Attack and defense Once again, playing NBA 2K8 is currently as close as possible to a real basketball game: the movements of the players are fluid and realistic, further improved in the transitions between one animation and another, a crucial component for this type of game. The management of the various schemes such as pick and roll, blocks and penetrations is particularly appreciable; Visual Concepts has in fact done an excellent job in order to make the action even more varied and believable, and for the most part it has succeeded. Thanks to the circle button, for example, it is possible to play a duo with another teammate, furthermore a sort of transparent circle placed at the player's feet indicates the recipient of the pass if made with the X button. For the rest, control is very similar to last year's and well suited to the PS3 pad. The front buttons are used for shooting, the two types of passing, defensive blocks and interception of the ball, the back buttons instead for aggressive running and specific passing based on your teammate. The left analog stick controls the player, the right one allows him to shoot, while for each direction of the digital cross it is possible to recall the aforementioned patterns, even during the game. Finally, with the select button it is possible to recall the timeout when in possession of the ball, and the intentional foul in defense, for example in the last remnants of the game, when your team is behind by a few points and you want to recover by stopping the clock . The management of free throws remains anchored to the tilt sensor of the Sixaxis pad: moving the controller backwards the basketball player will load the shot, bringing the pad forward will release the ball. Attack and defense Going back to the progress of the match, however, there are still some things to review especially at the level of Artificial Intelligence, which, although improved in various situations, still denotes some conspicuous flaws in the defensive phase, much more unbalanced than in the offensive one, with a series of ~ artifices~ aimed at making the percentages of the various players as relevant as possible to the real ones. On the other hand, the characterization which concerns above all the most famous basketball players, who are better at certain types of shooting than others, is commendable, as in the case of Tracy Mc Grady, very good at the jump shot, a little less so at the set one. To increase the sense of identification in the game we think the excellent outline and technical sector of the game which has been further refined compared to the other versions. The animations in the first place, the fluidity always excellent, the realization of the players convincing, with a high number of polygons and definition of the textures more than satisfactory, especially as regards skin and clothes. The creation of the faces is of less impact, which clashes alternately between some close to the real counterparts and others completely different, almost caricatured. Lastly, a special mention should be made with regards to the arenas and the public. The scenographic impact is in fact simply perfect, with an entirely polygonal stadium, enriched by details that only those who attend the match as spectators will be able to grasp. The home team's mascot moves non-stop, running between the seats, annoying the public, or bursting onto the pitch during time outs and intervals. It's priceless to score a 3-pointer at the end and see the whole home crowd jump up and cheer, or even just having taken the lead and hearing your crowd shouting ~De-fence! De-fence!~. Online for all tastes On the online side, NBA 2K8 takes the already excellent foundation of its predecessor and improves it even further. In fact, it is possible to download the updated rosters, play ranked or unranked matches, entire championships and online tournaments, complete with dedicated lobbies. The attention paid to relationships with the other players is particularly appreciable, the phases dedicated to team management are not visible to the opponent, and a small, interesting survey is proposed at the end of the game. It will be possible to report to the servers if the player has assumed correct sporting ethics in the match, in order to filter the subsequent ones in order to obtain a balanced online experience. During our games we were almost always able to appreciate the absence of lag, and the gaming experience always proved to be enjoyable and satisfying, except that, due to some problems with the netcode, one match out of three did not go to successful and we were unable to connect with the challenged opponent in one of the lobbies. Also interesting is the possibility of playing dunks and three-pointers against other opponents on the net. Comment NBA 2K8 represents to all intents and purposes an evolution compared to the past, with small improvements at every juncture that only consolidate the position of the best basketball simulation on the market today, the one that best manages to recreate all the sensations of a real game and to offer a feeling with the players unmatched elsewhere. It arrives on PlayStation 3 only a few months after the previous version, and is therefore recommended for those who have not purchased it or for the most ardent fans of the genre, who will still find new bread for their teeth. Pros Simulation of the match at the highest levels Parquet and spectators reproduced in a great way Online for all tastes and great longevity Cons Still some difficulty calibration problems Few new features rcompared to the previous version", "date": "2007-11-01", "grade": null}