{"name": "Shadowalker", "ref": "https://multiplayer.it/recensioni/shadowalker.html", "text": "The world of wireless gaming never ceases to amaze. The progress made on a technical level compared to the first applications of the genre are indisputable, and by now the new generation of mobile video games has reached (and in some cases exceeded) the results obtained with 16-bit consoles. In this sense, it should come as no surprise that the most important developers in this sector are dedicated to nothing else: to reach a certain level, you need to specialize and find effective solutions in what is a market with enormous potential (just think of the number of terminals in circulation), which moreover requires a relatively low investment of resources. Glu is certainly not the latest arrival, having been founded in 2001, and for some time now it has begun to produce truly cutting-edge products, of which Shadowalker is only the most recent example. The game is a pure action game, characterized by numerous platform elements and by the presence of upgrades that can be purchased between one stage and another. In each of them you have to complete a different objective (find a person, activate a device, defeat an enemy, etc.), making your way through ranks of more or less dangerous opponents. It is immediately clear that one must be familiar with the combination of jump and attack to defeat enemies without losing energy, and on more than one occasion finding footholds can open the way to otherwise unreachable areas of the stage, where to collect treasures that will replenish the total amount of money available. At a certain point in the game, however, our jumping ability will improve and we will be able to move with much more ease on the platforms. A similar argument also applies to weapons and character resistance: buying upgrades translates into a real and visible improvement, which makes us able to complete each stage much more easily. For the rest, the game structure is always solid and rich in the depth that distinguishes the best action productions, with the presence of numerous different enemies, bosses, interactable objects and characters with whom to talk. As anticipated, Shadowalker is part of a new generation of video games for mobile phones, which exploit the technical capabilities of high-end terminals to obtain hitherto unthinkable results in the mobile sector. This means having a scenario that scrolls in parallax on two or more levels of depth, characters full of details and with fluid and very well done animations, as well as an absolutely exceptional use of colors. Visually, the Glu branded product is truly something stunning, setting new standards and paving the way for equally spectacular productions. Even the sound sector, usually the poorest element in mobile games, has its own dignity and identity in Shadowalker, between beautiful music and good effects. Finally, the control system is absolutely immediate and intuitive, relying only on the joystick to move the character and the FIRE button to use weapons (the sword when the enemy is close, the pistol when he is far away). The game is completely translated into Italian and offers three slots for saving the game. PRO Outstanding graphics Immediate and engaging Solid structure AGAINST Not very original The quality of the joystick is reflected in the playability Requires a powerful terminal", "date": "2007-11-02", "grade": "S.V."}