{"name": "FMX III Hardcore", "ref": "https://multiplayer.it/recensioni/fmx-iii-hardcore.html", "text": "FMX III Hardcore had been heard about for some time, either for the illustrious precedents of the series (the first two chapters enjoyed an excellent reception from the public and critics), or for the greedy details provided by I-play through press releases and screenshots. Now, after testing the game thoroughly, we can finally confirm all the positive impressions that FMX III Hardcore gave us in the preview phase. Let's start with the graphic design, this time completely three-dimensional: the work done by Xendex is truly commendable, both for the relative polygonal complexity of the various scenarios and for the enviable fluidity at which the game runs on medium-high range terminals. However, the lion's share in the technical sector of FMX III Hardcore is carried out by the physical routines that regulate the motorcycle and the rider, so convincing as to deserve a special mode within the playful offer of the product. Which, let's say it right away, is really excellent. Instead of relying on classic events such as races and championships, the game is divided into a vast series of small missions, divided between various disciplines: therefore, we find ourselves racing against the clock, engaging in competitions based on tricks or collecting the most number of loops scattered across the track, and so on. As anticipated, there is also the so-called Big Kamikaze mode, in which you have to crash your motorcycle against an obstacle in an attempt to project the rider's body as far as possible: a mode as grotesque as it is fun, and which is also an intelligent exercise style of the never too praised physical model ragdoll. Reaching the milestone set in a mission unlocks the next scenario, all interspersed with bike upgrades that are granted by meeting certain objectives. Completing all the stages of FMX III Hardcore is not exactly a titanic undertaking, but the situation changes if you want to get all the gold medals, perhaps even at the highest difficulty levels: in this case, the Xendex work turns into one of the most challenging mobile video games in history, for the sake of anyone looking for real challenges on their mobile too. Fun and tough at the right point, FMX III Hardcore doesn't give up on simplicity in terms of the control system, which allows you to perform a large number of maneuvers using just a few keys. The sound, on the other hand, is far from unforgettable, but we're used to this on mobile by now... PRO Fun and challenging Excellent 3D graphics Excellent physical routines AGAINST Mediocre sound", "date": "2007-10-26", "grade": "S.V."}