{"name": "Ratatouille - Recensione", "ref": "https://multiplayer.it/recensioni/ratatouille-recensione_a.html", "text": "Take a cute little sewer mouse, surrounded by rubbish and dirt, and put him in a Paris with infamous suburbs but decorated with shiny and clean buildings and squares. What more could a rat that eats only leftovers for its entire existence want, than to become a famous French chef? Dreams are the soul of Pixar animation studios, which for years has been giving us stories made up of funny characters suspended between disbelief and wonder, accomplices superb animations and designs and a way of intertwining one's stories with irony and fun. Like any self-respecting cinematic blockbuster, especially if it is a cartoon of this importance, its videogame transposition arrives promptly, on all consoles, mobile phones, PDAs and so on and so forth. Let's discover the dilapidated but cheerful world of Ratatouille together! A small sewer rat, but with gusto The title is developed by a team with great experience in the field of film transpositions: Heavy Iron Studios who have already made Scooby Doo, The Incredibles and SpongeBob. Ratatouille has all the classic ingredients of a light-hearted, colorful platformer with simple and intuitive mechanics, suitable for a large audience and from the most diverse ages, but above all for the little ones. In Ratatouille we play the ~clothes~ of Remy, a gourmet rodent who sees his undisputed hero in Auguste Gusteau, a famous and admired chef. Ratatouille has all the classic ingredients of a light-hearted, colorful platformer with simple and intuitive mechanics A small sewer rat, but with gusto In the game we will go through all the locations already seen in the big screen film, finding the main characters and key situations of the storyline. The gameplay takes place by tackling these levels with mini-games, cooking trials and head-to-head races against our opponents. Given our ~mouse~ situation, we also become prey to stray animals, as well as hunters of delicacies. Simple but not stupid Between one level and another we enjoy cut-scenes directly compressed from the film, interspersed with others created with the game engine itself. Through these clips, the plot unfolds from the beginning, which sees a confused Remy, a mouse who wants to eat and cook French delicacies instead of garbage, and the surprise grand finale that we will not reveal for those who have not been able to appreciate the feature film. The level design, thanks to the film's settings, is quite varied and manages not to get bored, and is designed to offer purely platform sessions, a little too guided, such as the Incredibles, Shrek or similar games. The level design, strong in the film's settings, is quite varied and manages not to get bored Simple but not stupid The controls are few and simple, designed to be tamed right away even by children with little gaming experience: Ratatouille is an easy game, but not trivially simple like others. Some tests must be performed a few times before learning the mechanism on which they rest and passing them. The purely platforming ~jump and go~ gameplay is thankfully interspersed with many sessions of well-crafted mini-games, playable in some cases even by more than one person by hovering the main controller. Graphics and Audio On a technical and graphic level, the comparison with the Pixar film obviously cannot be made, but the game offers its moments of visual satisfaction. Given its cross-platform nature, the Xbox 360 version does not seem particularly exploited and suffers from multiprogramming for technically inferior consoles: the textures are not always beautiful, especially up close, and apart from the excellent particle effects, occasionally you don't see much else on the screen which causes the famous ~wow~ effect. The game is all spoken and the music is taken from the soundtrack of the film, therefore of excellent quality. Comment Ratatouille is a discreet game intended mostly for young children. It is an undemanding game, easy but not trivial, fun but not exciting, cute but not beautiful. As tradition teaches, cinema-videogame portings often don't offer flawless products. The characters are well done and well animated, but other than that the graphics don't offer any other great ideas. The gameplay is absolutely not original but for this reason it will be familiar to those who love to entertain themselves with this kind of video game, looking for entertainment rather than a masterpiece. Pros: Good adaptation of the film Immediate and fun gameplay Sound taken directly from the film Cons: Too easy for longtime players Nothing new if you have already seen the film Nice graphics but below average Xbox 360 - Goalthe Like every Xbox360 game, Ratatouille also offers the canonical 1000 points to unlock. These are for the most part simple objectives that will be obtained almost automatically by carrying out the main plot. Each minigame offers a 20-point goal, as does each level you beat. Finishing them all, however, will earn you the beauty of 100 points in one fell swoop. Another 100 will come if you manage to find every object hidden in the depths of the Ratatouille levels. Basically it is about getting a large amount of points by playing quietly and without worries for a few hours. Optimal.", "date": "2007-10-25", "grade": null}