{"name": "Second Sight", "ref": "https://multiplayer.it/recensioni/second-sight_a.html", "text": "Patient John Vattic The beginning studied by the now renowned English softco is one of the most disconcerting. We start with a confused, at times chaotic, subjective view. We glimpse some shady figure immortalized in the silhouette of a policeman, then a doctor, presumably devoted to cure us. Cure us from what? We will soon understand that, however battered, we will not be inside that institution not very dissimilar to a hospital to receive treatment, but to undergo experiments of who knows what sort. We will wake up thus chained to a bed, then something amazing: a power, arising from our body, so powerful as to break the metal connections that prevent our movements. In this way, the Free Radicals have decided to debut with a game with an articulated plot, made even more so by the continuous flashbacks that will continuously put new details in a considerably twisted and distorted context. The idea of the coders to divide the game, and the consequent learning of its basics, into two sections is excellent. We will soon understand that, however battered, we will not be inside that institution not very dissimilar to a hospital to receive treatment, but to undergo experiments of who knows what sort. Patient John Vattic At the beginning, in fact, despite a decidedly incorrect textual translation into Italian, we will be in the present, full of scars and bandages, and in the continuous discovery of new paranormal powers. Next we'll flip the calendar pages back six months, involved in a military operation with the usual preamble format of any necessary training. Then we will find the present in which to practice our psychic powers, such as telekinesis, the mental projection of one's body and the possibility of regenerating health; then, taking a step back in time, we will learn to handle a good variety of weapons, as well as learning the various stealth components. Structured in missions, Second Sight manages to divide, at least initially, the two types of approach to the game, and then expertly mix them up to give the player complete mastery of his alter ego, practically without realizing it. I'll take you, squeeze you, put you in my pocket and maybe I'll take you out when and if I feel like it. All without even touching you. The various levels of the game will range mostly in missions in which to escape from a building full of guards, others in which a skilful infiltration in certain establishments will be required, or some in which to advance between one shelter and another by knocking down enemy after enemy. In the general context of the game, the control system does a great job, which thanks to some well-implemented ideas always manages to be appropriate to the circumstance, therefore effective. Too bad for the lack of optimization of the key used for particular actions, such as hanging from grates or accessing a terminal, which will only be executable in a precise point in the background, and, consequently, tortuous in execution. It would have been advisable to expand the interaction area to improve access. For the rest, the Free Radicals have done a really good job in these terms, with many solutions placed to sweeten even the most intricate of passages. We will have a lock on with which to hook objects and people, which in the aiming phase will aim straight at the enemy's chest and then leave the burden of focusing on the pre-set point to the player. As for level design, the British softco seems to have thoroughly examined every possibility given by the powers of the protagonist... I'll take you, squeeze you, put you in my pocket and maybe I'll take you out when and if I feel like it. All without even touching you. We will be able to hide behind a shelter, and then come out and fire, without however losing the position, to which we will return once we release the key used for this function. In terms of level design, the British softco seems to have thoroughly examined every possibility given by the protagonist's powers, proposing a great variety of situations in which to give vent to one's paranormal fantasies. Thanks to telekinesis we will be able to interact with otherwise unreachable mechanisms, such as cameras to be deactivated or buttons to be pressed located in inaccessible places, but we will also have the ability to double our physical presence in order to trigger gadgets to be planted with our main IO. Too bad that this abundance of ideas is partially thwarted by the excessive dispersal of some levels, left incomprehensibly without the possibility of viewing a map, albeit too labyrinthine. And the bad news doesn't end there. The enemy AI is often and willingly inadequate to the circumstances, with a handful of almost blind dummies relegated to overly predictable scripts. Also from the technical side the coif they don't excel, showing some shortcomings both in terms of graphics engine and polycount. Above all, certain settings denote repetitive and low-detailed textures, which partially obscure the well-constructed and animated polygonal models. Frame rate dancer in the most convulsive situations. Excellent light effects and good physics, albeit at times excessively 'light'. Normal sound, with themes always related to the action but never driving and a well-finished dubbing, even if only in English. Now the most painful note: the textual translation into Italian. If for the various typos one could even turn a blind eye, for the gross translation blunders absolutely not, as some of them totally distort the understanding of the plot and its alternation of events. So watch out guys Last notes reserved for the differences between the almost identical Ps2 and Xbox versions, except that the first runs at 50Hz while the second at 60. Comment In Second Sight we notice the skilful hand of those who have been living with video games for years. A title, this Free Radicals, which amazes for the conception of a plot that is never banal, to which is added a gameplay that is several times precious and enlightened. Too bad for the bad translation, a standard technical sector and an underdeveloped AI, otherwise the tones used here would be different. Glass half full? Definitely yes, even if a bitter thread remains in the mouth. Ultimately this title is aimed above all at lovers of the genre, at those who appreciate well-told stories or, more simply, at those who have always found a form of fascination in the paranormal. Pros: Engaging storyline. Good control system. Lots of ideas well implemented. Cons: At times dispersive. AI just mentioned. Bad and misleading translation. Mental itineraries. The great John Lennon called them Mind Games in one of his most famous solo songs, and, although he did not specifically allude to the journeys that the brain of a single person is capable of making, he managed to perfectly draw a cerebral war between two individuals. For some time now, the industry has set its mighty eye on what are the extra sensory powers, and finally apparently incongruous games in this regard find themselves beautifully full of these interesting elements. The new Free Radicals production is one of these: a conglomeration of old and new ideas which, put together, have decidedly appetizing ambitions. Second Sight therefore aims to bring fresh meat to the action / stealth genre, paying particular attention to the development of a complex plot and varied game action.", "date": "2004-10-12", "grade": null}