{"name": "Madden NFL 08 - Recensione", "ref": "https://multiplayer.it/recensioni/madden-nfl-08-recensione_a.html", "text": "The month of September usually marks three major events: the end of the holidays, the start of school and the release of the annual Madden, the first Electronic Arts game to inaugurate the sports season on all consoles on the market. The current year is no exception to the rule and, with the portable version for Nintendo Ds, EA is ready to correct the not exactly successful shot with Madden 07. The Canadian publisher's 'quarterback' remains the developer Tiburon, studio behind the which almost ten years of development of the franchise dedicated to American football are now hidden. Will this 2008 launch succeed in winning the hearts of fans of this sport? In the following lines, the arduous sentence. The first, very first thing that must be highlighted and underlined is one: Madden NFL 08 is the perfect exponent of the care that Electronic Arts has always poured into all the sports genres it follows and publishes. Madden NFL 08 is first of all a rich game: despite finding itself on a platform that is not very congenial to what is the spectacular nature of this overseas sport, EA has confirmed its ability to expand, detail and make the park ever wider available to the player. Madden, in addition to presenting the classic game modes that have always been linked to EA productions (league, tournament, custom league and friendly), allows the player to completely customize his gaming experience. The personalization of the team starts from the creation of the name and logo, from the choice of the stadium, from its name and from the maximum capacity of spectators, to then continue with the creation of the 'social' colours, in the two versions of official game kits (from home and away from home). And given that a team would be nothing without the players, the expert football player is given the possibility (now rather classic, it must be said) of creating his own player or his entire team. The third and final element that is part of the recipe for a good team is the creation of 'games', of attack and defense actions useful for unhinging any opponent and thus reaching the much-dreamed-of superbowl evening. For all lazy players, or simply fans of one of the 32 National Football League teams, there obviously remains the possibility of not having to start from the basics and immediately enter the game thanks to the modes that now represent the starting points of every sports video game. This Madden has, in addition to customization, a real trump card represented by one of the most convincing multiplayer (wi-fi and otherwise) ever seen on a DS game, especially in the sports genre. With the ability to battle up to 8 players online (with virtually no lag or slowdowns) and a download mode that allows a second player without a cartridge to take part in the action, Madden also offers the option to challenge a friend. to a series of decidedly unattractive mini-games with the exception of the now known Paper Football (an equivalent of the football game made with coins on school desks). Unfortunately, it is when facts turn into practice that Madden loses much of its appeal. In fact, as in previous versions, although it has been properly reworked, the game structure has obvious bugs that compromise the experience. American football is a very particular sport, like rugby and baseball, essentially divided into two large parts that can practically be considered independent: attack and defense. Both phases in Madden can be considered as separate games, both undermined by a series of serious flaws. The attack phase has lost the use of the stylus to make 'kicks', the kicks with which you go to score the additional point after the goal or simply start the game. The use of the stylus has been relegated to the simple choice of strategy before starting each action, a choice that can still be easily made using the directional cross and the buttons. However, the attacking actions have been enriched with the classic quick decision buttons, thanks to which when the quarterback is preparing to throw he sees the letters of the buttons colored in gradations from green to red appear on the heads of his teammates, to indicate with precision and speed the feasibility of the pass (a throw to a green has many chances of success, one to a red practically none). One of the biggest defects arises precisely from this novelty: if on the one hand it is in fact possible to evaluate the probability of success of one's throw, on the other hand the receiver - even if in a 'green' situation - does not always show particular intelligence in catching, limiting himself to touch it with ua limb or simply (and in a very comical way) having it bounced on his head and then losing it. The game is thus often reduced to a 'grab and go', in which the player as soon as he receives the ball from the scrum simply runs to get as many yards as possible towards the opposing end zone. In the defensive phases the story does not change, and the game developers thinking of inserting a movement useful to the player in the preparation for contact, complicate things further; with the pressure of A it is in fact possible to make one's own player take a sprint of four steps forward, with -also in this case- the comical situation of seeing one's defenders running for a short distance in one direction without opponents and without having the possibility of returning them to the right position. A further problem is linked to the phases of contact between players who, except in very rare cases, have serious difficulties in resisting any contact. One of the major difficulties - it must be said - remains the understanding of the game strategies and the subsequent 'plays': the schemes are represented in a tiny way, obviously they cannot be excluded from the game and require a certain preparation and basic understanding of football to understand when a 'shotgun' can be more useful than a 'split backs'. The game uses the two screens in the only way allowed for this type of very tactical sport (just think that in real football there are several coaches who follow the game from below and above to study attacking and defensive actions), i.e. positioning the game action in the lower screen and representing the field and the position of the players (with relative icons according to their roles) in the upper screen. On the graphic side, things don't improve particularly, and while presenting the best graphical representation of this sport on DS, the game engine gets lost in slowdowns and frame losses despite finding 22 players on the field with decidedly blocky and poorly defined features. In terms of sound, however, applause goes to EA for having managed to bring most of the songs that characterize the major versions to the laptop which, albeit with low quality, manage to give the game a greater sense of completeness. The audio side is completed by a whole series of effects and voice overs (in English) which very little manage to increase the identification with this complex sport. Madden 08 is not a bad game, it simply remains a title that is not very suitable for the gaming dimension offered by the DS. Despite all the methods and possibilities introduced by EA, the game structure collapses under the potential offered by the two-screen laptop from Nintendo. Madden remains a game made and designed for home consoles, where the spectacularity of scrums, runs and throws comes to light in all its beauty. Perhaps, given the assumptions, on Ds EA should think of something more 'managerial' and less played, a different approach but undoubtedly more suited to what this sport -in this dimension- can offer. Pros: 360 customization of the game Excellent multiplayer section (both offline and online) Cons: Still too many problems during the game Graphically far from excellence Completely in English", "date": "2007-10-23", "grade": null}