{"name": "Teddy Factory", "ref": "https://multiplayer.it/recensioni/teddy-factory.html", "text": "Teddy Bear does not make its debut in the video game world with this mobile reduction, having originally been developed for PC some time ago. In any case, the game mechanics practically remain unchanged even on the screen of our phone, and draws on the world of puzzle games in an atypical way. In fact, rather than solving logical puzzles, in Teddy Bear we will have to be quick and coordinated, reaching the goal of a certain number of teddy bears to build in each stage, to make as many children happy. At the end of each level, a check is made between happy and disappointed children, then eventually proceeds to the next stage for a total of thirty. Once a game has started (two different modes are available: the standard one and a ~survival~ one), we are faced with an assembly line with a conveyor belt. From a loophole appear the various pieces of teddy bears of different colors, and we have to join them together until we finish each plush. At the bottom of the screen are the children, each of whom has a different preference for the color of the teddy bear. It goes without saying that our job is to make them happy, making the desired teddy bears first and paying attention to the scrolling of the tape, because if the machine gets clogged it's game over. So there's not much to think about, on the contrary you just have to be pretty quick, assembling the stuffed animals as quickly as possible and taking advantage of any special objects that momentarily slow down the tape. There is no shortage of extras, represented by limited version teddy bears which, once complete, will go to crowd one of our ~trophy room~. After some stages, ~universal~ pieces will also begin to appear, which we can add to the incomplete bear that needs it most. Each plush is made up of a total of six parts: head, trunk, two legs and two arms. Clearly, the further you go in the game and the more complex it becomes to build the teddy bears without the machine jamming or managing to please all the children. Teddy Factory boasts a technical realization of sufficient quality. Beyond the sound, consisting only of a discreet musical theme but an end in itself, we have well-designed sprites and a good use of colors. The locations are basically identical to each other, only with a different arrangement of the same elements. In general, the graphics are functional to the action and nothing more: there are no animations and therefore the game is also suitable for use with medium and low-end terminals. As far as the control system is concerned, it is the pinnacle of simplicity and immediacy: the joystick controls the cursor, while the FIRE button ~hooks~ the piece of plush we have indicated while waiting for the button to be pressed again indicating a piece of the same color, which will lead the two sides to unite while waiting for the rest. PRO Simple and immediate Nice graphics A tough challenge... AGAINST ...maybe too much It tends to be repetitive Sometimes cumbersome", "date": "2007-10-19", "grade": "S.V."}