{"name": "Recensione di Conflict: Vietnam", "ref": "https://multiplayer.it/recensioni/recensione-di-conflict-vietnam.html", "text": "Straight to hell Conflict: Vietnam takes up the tried and tested concept of team control, but in a more arcade key, with a third person view (you can switch to the first, but we'll see better later) and a series of commands simplified to the max, so as not to distract too much from attention from the actual action. The player assumes super-partes control of a team of four men, commanding one at a time at will, but being able to give elementary orders to all the others and at any time you can switch from one man to another. It goes without saying that each of them has a different specialization from the others, so we will have the sniper, the doctor, the gunner and the handyman soldier. Fairly standard, I'd say. I said that the view is in the third person, but you can freely switch to the first one, in which, however, the screen is largely obstructed by the profile of the weapon in hand. The alternative is to disable that profile altogether in the options screen. Ok, you can play as if it were an FPS, but it's not the same thing, there isn't the same feeling, you lose the overview of the rest of the team and anyway, terrible, you can't jump in the game! On the screen we will see just the essential information: a minimap as obligatory as it is useless, given the level of detail, a cumbersome panel with the images and the status of the four soldiers and the selected weapon, with relative ammunition indicator. Giving orders is easy, just hold down the right mouse button, choose the soldier to command and point the cursor in the appropriate direction. The actions to be undertaken are completely automatic, so if we aim for a fixed position, the soldier will receive the order to reach it and use it, if we indicate an object to him, he will pick it up, a wounded man, he will cure him (having the medikit available) . In short, Pivotal Games has inserted a convenient order system contextualized to the game. You can decide whether to command the soldiers individually or all together, in the latter case the available orders are very few, just ~follow me / stop~, ~fire at will / cease fire~ and ~belly on the ground / standing~. Straight to hell A note that must be moved to this game is that it does not seem to have its own soul, but seems to draw from what has been proposed in the past by more successful titles, and so here is the combination of 60s music, colorful language and atmosphere from the film, which decreed the fortune of a game like Vietcong, combined with the game system of the previous Conflicts. Personal considerations aside, let's go back to talking about the game in more technical terms, let's see, for example, who we will have to deal with when we are in the dense Vietnamese jungle. The Viet Cong will swarm like bees out of the hive, in certain situations, and there are always ~damned gooks~ lurking, hidden in the leaves, this will make the fights rather treacherous, but certainly not because they are intelligent enemies, on the contrary far from it, given that the artificial intelligence in this game is at very low levels. As long as the opponents are foolish, never mind, but unfortunately the idiobit syndrome also affects the soldiers under our control, given that in many situations they are quietly shooting under enemy fire without even seeking cover. Unfortunately. There are extreme situations in which a specific target, for example a sniper, cannot hit it alone, until you directly take control of the soldier who is dealing with it. Unfortunately, I had to find a certain intricacy of the game, due to the team management and the control system, as if the authors had wanted to simplify, but in the wrong direction, with the final result of tangling the interface. Another thing that is missing, and this in my opinion is quite serious, is the possibility of giving waypoints, a pre-established route for the soldiers to follow, but if we think that there is not even a map worthy of such name... In short, Conflict: Vietnam pushes in the direction of action without too many compromises, yet requires us to manage a team with very unfriendly means. My band plays rock The protagonists of the game are four soldiers like many others and, like many others, they will find themselves experiencing the horrors of a meaningless conflict that has already been talked about enough. Each of them has a historical background, strictly reported in the manual, and specializations. The interesting thing about this new chapter in the series is that we will be able to assign skill points at the end of each mission, for each member of the team. In addition to the primary objectives, each mission will have secondary objectives that will manifestfrom time to time during the game, depending on the actions we will do. By completing more objectives, you earn more points, which we can then distribute to each member of our team, increasing their specializations or completely distorting their abilities. At first, the four soldiers will have more or less the same skills, with some differences, sure, but few. As you progress through the game, the sniper will get better and better at sniping, the machine gunner will get better and better with heavy weapons, the medic will heal faster, and so on. The careful management of these points is essential in order to be able to have a team capable of surviving the more advanced missions, when the yellow peril will become increasingly lethal. Fortunately, you can keep these points, or some, to spend later. Unfortunately, however, this thing can only be done between one mission and another, so forget about putting that couple of stars in ~Machine Gun~ to dear Hoss, just because you can't get over that damn bridge. I'm sorry, but you'll have to wait for the end of the mission, otherwise too comfortable. The characterization of the characters is more than fair, indeed in the cutscenes the more human sides of their relationship come out, the dubbing is more than good and the music is appropriate with the setting (but the Vietcong holds the record in this). Comment How to judge Conflict: Vietnam? Under which banner to issue the final judgment? The problem with this game is that it is a title that distances itself from all genres, but it does so in a negative way, because in the end it is found to be neither fish nor fowl, as they say. It's not a shooter, it's not tactical, but a mix appeal of all of these. Was it good or bad? You can have a lot of fun, at least in the short term. Where, then, is the game giving way? He has given up on longevity in the long term, because commanding a team with such approximate methods and with such limited artificial intelligence is frustrating and killing tons of Viet Cong in a jungle without a feeling capable of capturing and involving can be boring in the long run. Pros: Team play Vehicles can be used Lots of action Cons: Very low AI Poor graphics Messy team control Try again Sam! ~You don't change a winning team~ they say, right? Well, if the Conflict series has sold so much in the world, why ever change it for something else? Pivotal Games has so far offered us a whole series of titles based on team combat, currently reaching its third chapter. After Desert Storm 1 and 2 and after the game based on the film The Great Escape, this new Conflict: Vietnam arrives to us, which keeps the game scheme unchanged but moves the action to the other side of the world and to another era . In short, we cannot say that these guys have an abundance of imagination, but it is certain that they have been able to find a formula that is able to sell and this is certainly no small fact, far from it. So, after having been in the Arabian desert to fight during the Gulf War, let's get ready to be projected more than thirty years back into that bloody conflict that inflamed souls and inspired so many future changes.", "date": "2004-10-11", "grade": null}