{"name": "Neverwinter Nights 2: Mask of the Betrayer - Recensione", "ref": "https://multiplayer.it/recensioni/neverwinter-nights-2-mask-of-the-betrayer-recensione.html", "text": "Some things never change Too bad that the latter is almost worse, given that it now seems to forget the settings chosen all too often, resetting the viewing angle in an apparently random way at the end of each zoning. It really seems that it is an aspect of the game born badly or in some unfortunate way: one wonders where was the problem of limiting oneself to using the same camera as Nevewinter Nights, which at least shone for effectiveness, despite its elementary simplicity. Even glaring glitches, such as fixed-angle views of characters during dialogue, have not been fixed, with the result that if one or more of your party members are under effects such as ~Enlarge People~ or similar, you'll end up with fascinating close-ups, more or less at the height of their respective genitalia. In short, there remains a whole series of systematic bugs which, at this point, we suppose the developers have given up on correcting. From the interpenetration of polygons to the sometimes jerky animations, up to the almost comical pathfinding of the characters (who keep getting stuck in the most basic obstacles), it is clear that in all these aspects we are still ahead of NWN2. From this point of view, there is only to bite the bullet and think about how much good this expansion has to offer... which is by no means a little. Connoted by real role-playing game In general, the success of a role-playing game in videogame form can be summed up in the good balance between fighting, exploration and narrative component, which must of course be of a completely different level than games dedicated to pure action. From this point of view, Mask of the Betrayer not only does not disappoint, but perhaps represents one of the most successful combinations of these factors. Indeed, it represents everything that NWN2 was not and should have been, but comfortably eclipses even the first chapter of the series, proposing an absolutely ~old school~ storytelling formula, fully on par with Planescape: Torment in quality of dialogues and descriptions, if not for their quantity. The very long descriptions of objects, characters and their respective moods seem to be dedicated to the still numerous fans of this by now ancient masterpiece: each element is meticulously illustrated, with a care that can only make RPG lovers happy pen&paper and makes NWN2 look like a trivial hack&slash without the slightest narrative depth. Connoted by real role-playing game Plot and characters are equally excellent, especially since the first one will unfold in an equally enjoyable way even for those who haven't had the strength to complete the tedious single-player campaign of the original game. The protagonist will still be the one who defeated the Shadow King (whether you import the old one or create a new one of eighteenth level), but the references to facts and individuals of the past are minimal and in any case well contextualized, while his companions , although in many cases attributable to the usual ~role~ stereotypes, they still have well-cut personalities and the fantastic dialogues help in their characterization. There are also some decidedly original, if not disturbing, ~exemplars~. The general theme of this expansion is in fact much darker than the original, starting from the devastated wasteland of Thay, home of the most ruthless and cruel magocracy of Faerun. Considering the size of the Forgotten Realms world, it's about time someone decided to let us visit areas other than the surroundings of Neverwinter and the usual Sword Coast and in this respect Mask of the Betrayer takes us to the discovery of some of the more exotic lands of the Forgotten Realms . Returning to the dark style of this expansion, while wanting to avoid any type of spoiler, it is enough to know that the decisions to be taken will be extremely serious and (also given the range of epic levels reached) enormous in scope and that this time the moral dilemma will be more than a simple excuse to offer players a fork in the road. The path to the ~Dark Side~ will be a tangible temptation and not just a way to role-play in the style of Grand Theft Auto. The choices that will be able to influence the final outcome of the story (four alternative endings, two of which are neutral, one good - considered optimal by the developers - and one evil with not indifferent charisma) are truly innumerable, as well as the different reactions that these will arouse in our comrades. The influence system has in fact been significantly improved, and even if it is possible to predict its moves and act accordingly in a speculative way, at least it takes on more acceptable connotations compared to the behavior of the almost ridiculous automatons of NWN2. To theon the contrary, every element of Mask of The Betrayer is functional to the rendering of a sense of epicness that has so far been lacking in the series and this concerns not only the plot, but also the fights, given that from the very first moments we will come across creatures that you will have so far probably only dreamed of meeting, leafing through the D&D Monster Manual. However, this is not a pure crowd, like NWN2 where every situation was, in the final analysis, solvable with violence: the commitment to diversify the gameplay of this expansion was also commendable, introducing a significant number of successful puzzles and original, which break the monotony and the idea that the whole game boils down to a single problem of maximizing our ability to cause damage. Comment The norm is generally to recommend an expansion to those who have already appreciated the original game, have not yet tired of its formula and would rather want more. In this sense Mask of the Betrayer is an atypical product because it takes a decidedly different direction compared to NWN2, to the point that we feel we can recommend it above all to those who may have been disappointed by the overall approximate experience of Obsidian's RPG. Even those who had intentionally decided to avoid it, as they moved away from a trivial plot and two-dimensional characters, or simply discouraged by the hardware requirements, should in our opinion give this expansion a chance, since the story and dialogues are so good that they deserve to be be appreciated by fans of the genre and the computer needed to run the game is no longer so expensive. Pros Excellent plot, descriptions and dialogues Technically optimized Excellent sound Choices and moral dilemmas finally intriguing Cons There is no shortage of bugs Outdated interface Easily speculable influence management System requirements Minimum Requirements Processor: Pentium 3 GHz or equivalent AMD RAM: 1 GB Video Card: Compatible with DirectX 9 or higher and equipped with at least 256 MB of RAM DirectX 9.0c DVD Player Test Configuration Processor: Intel Pentium Core 2 Duo 1.83 GHz RAM: 2 GB Video Card: NVIDIA 8800 GTS Neverwinter Nights 2: Mask of the Betrayer is available for PC. Some things never change Neverwinter Nights 2 was an ~honorable~ sequel and nothing more, for a title that already struggled quite a bit before picking up on the legacy of classics like Baldur's Gate and Torment. Every aspect of the game showed clear signs of a rushed release, which exposed its many rough edges and identified it as a product that left something to be desired on many fronts. As mentioned in our previous preview, Mask of the Betrayer aimed to solve precisely these problems and for good measure we can see that he succeeded, even if on the technical front it might have been legitimate to expect something more. If NWN2 was illicitly heavy and slow to run, with little justifiable hardware requirements given the results on the screen, credit must be given to Obsidian for the degree of optimization achieved, since it now runs smoothly and without too many hitches) on the same hardware as last year . The camera problems have also been partially resolved, albeit with a compromise that is not entirely acceptable. Now the default setting is that of a third-person shot, easily playable even if certainly not oriented to the tastes of the purist, who will not fail to reselect the isometric ~free view~, freely rotatable.", "date": "2007-10-16", "grade": null}