{"name": "Project Gotham Racing 4 - Recensione", "ref": "https://multiplayer.it/recensioni/project-gotham-racing-4-recensione.html", "text": "Project Gotham Racing 4 is a rather significant chapter in a series that has literally marked the arcade racing genre on Microsoft-branded consoles, since the first Xbox. This relationship inevitably changes with the acquisition of the team by Activision and with the PGR brand remaining in the hands of Microsoft which, however, has not yet clarified how it will continue the saga and at the hands of which development team (without being able to completely exclude the possibility that it is Bizarre herself who is dealing with it). After having already talked extensively about all the innovations introduced in this episode, and having tried it for a long time, the time has come to draw conclusions on this new full-speed race, two years after PGR 3 and the release of Xbox 360 . New career Gotham The most important novelty of the structure of PGR 4 is the one that has affected the career mode. Where in PGR 3, the Gotham career consisted of a series of events that had to be tackled at different levels of difficulty, each of which offered a medal of a different color and different amounts of Kudos, this time a real and own simulated championship. Made up of stages, trophies (each made up of a variable number of events) and divided into four categories along a single world ranking, to be climbed with the points obtained at the end of each event, which works like a small championship. The Kudos have been integrated much more closely into this mechanism, since to get to the first place of each single championship it will not only be necessary to place on the podium, but the number of Kudos earned in total, which will be the sum of those obtained depending on of the result on the track and of the evolutions made during the races. On the one hand, this choice gives the career a great sense of fluidity and continuous progression, on the other, however, it allows you to easily climb from position to position even obtaining just discrete placements, leaving the player with the possibility of advancing from event to event with the awareness of being able to reach the first places in the world rankings even if only with greater perseverance (at least up to the top category, where things get really challenging). You gain peace of mind, since you always have the impression of being able to do better at the next opportunity, and since you don't damn your soul too much for a bad race, but you lose a little the malice with which you forced yourself not to lose any competition in the other episodes, in which you ended up repeating each competition until perfect. Among other things, once a mini-league has finished, it cannot be repeated until the following year, given that the virtual season follows a succession of months and rigorous stages that cannot be replayed. The problem is that the following year the player will hardly be able to remember what he did wrong the first time with the only possibility of either interrupting before the end each race that he thinks he can run more effectively or relying to the greater driving ability that, inevitably, is acquired race after race. For the rest, however, the pleasure of driving in one of the best titles of the genre available on Xbox 360 remains, thanks above all to the new tracks (Qebec in particular), which introduce back into the series those ups and downs and that goodness of track design that has always marked the Bizarre games. Worth noting is the introduction of special invitation-only races in which you can win out of the ordinary or timeless classic cars and which must necessarily be won, constituting truly demanding tests. In a game where you can still choose the level of difficulty to race on, the Artificial Intelligence of the opponents, even more developed than in the past, and the tight time limits of speed races make it quite challenging to get the best placements right from the start. normal level. The canonical medal structure has been left alive for arcade races, which in essence are a ~quieter~ version of the old career and which will probably be played by those who want to unlock the objectives related to it. Two-wheeled show in the rain and in the snow! Obviously, the introduction of two wheels was the most unusual surprise of this new chapter. The result is positive in itself, given that it's a lot of fun to ride motorbikes and given that the selection of vehicles available is really excellent, but coexistence with cars only partially works. The tracks, especially the more demanding routes full of hairpin bends, are much more affordable by wearing the clothes of the centaur even compared to the fastest cars, given the greater agility with whichi can be slipped into every corner, making life much easier, despite the greater difficulty in races that end at the ~bracket~. Furthermore, obtaining Kudos is much easier, thanks to the spectacular evolutions that can be carried out on the saddle of a motorcycle. On balance, there is always the feeling that driving a car is much more fun than a motorcycle, also due to the fact that, when you wheel up or make evolutions, the view from the front fairing makes everything more complicated, making you lose sight the road and forcing, in fact, to switch to the external view, losing speed and adrenaline. On the other hand, the introduction of variable climatic conditions arouses only satisfactions, with rain and snow (the former is truly spectacular) that gradually fall on the tracks, creating plays of light and landscapes that are truly unique in a racing game, and which, above all, they significantly and convincingly alter the response of the vehicles to driving, with a truly out of the ordinary degree of involvement. The engine, especially from the internal view, never disengages from 30 frames per second and the HDR used to render the sun reflecting on the bodywork, often beaded with drops of water, manages to restore some moments of pure visual enjoyment. All this, combined with the glance of settings such as Macau and Quebec and the great sensation of speed that is obtained with the most powerful vehicles, especially with the internal view, makes PGR 4 one of the most visually beautiful racing games, despite some aliasing problem. Thanks also to the small tweaks made by the team to the driving model and to the feeling of greater heaviness of the vehicles, the driving experience offered by PGR 4 is still superior, while not distorting what Bizarre has already achieved with the third chapter. Maintaining that right balance between simulation and arcade that has conquered so many players over the years. Always in the name of greater accessibility of all the game's contents, also the idea of shopping in which to invest the hard-earned Kudos on the track with a system that does not oblige you to buy each car individually, but packages divided by origin or car manufacturer . In addition to cars and motorcycles, new tracks, modes and some surprises for the most assiduous are unlocked. Two-wheeled show in the rain and in the snow! Network Challenges The Bizarre series has always been at the forefront in implementing all the most anticipated innovations related to Xbox Live. Even PGR 4 is no exception and, like Halo 3, the new chapter allows you to save replays of races, to share them with friends and players, and to create photos that can be rated and downloaded to PC after uploading them on the game's official site. The possibility of finding the new images taken by other players hanging on the walls of their garages is very nice, in which it is already possible to express one's preference for each of them and, possibly, transfer them to one's console. Furthermore, images and replays are easily traceable using a practical and complete search engine that allows you to rummage through the archive by distinguishing between routes, car and motorcycle models and the type of events portrayed in the images themselves. Online races undergo a nice boost with the introduction of matchmaking along the lines of the one seen in Halo 2, with the possibility of creating groups of friends with whom to face ranked matches, in which the winner is the team that, overall , earn more Kudos. In the matches we tried we did not encounter any lag problems, but we will undoubtedly have to evaluate this from now on when Live fills up with players. Finally, it should be remembered the presence of the new chapter of Geometry Wars, called Waves. This time, instead of a demo, there's a full version in the garages that gives you only one life to make the most of to achieve scores that end up in the online world rankings. Compared to the previous episode, in addition to having to avoid enemies, to raise the multiplier, you have to collect small yellow triangles that are released every time you destroy one of the opponents. It goes without saying that the magic of the game is intact and that it will be craze this time too. Goals 360 PGR 4 is quite generous in giving out achievement points, especially at the beginning. Unlocking the first 500 points will be a matter of a few in-game days. Different speech to reach the full loot, but we are sure that most players will have something to be satisfied with. Comment In certain moments, Project Gotham Racing 4 manages to convince to the point of giving the impression of being the best episode of thethe series made by the Bizarre, since the days of Metropolis Street Racer. In others, however, there is a bit of a lack of substantial novelty to a tried and tested formula, but all too familiar, and which would have needed the two-wheeled mechanics to be successful across the board to leave a significant mark. PGR 4 will make fans of the saga as happy as and perhaps more than the third chapter, but, probably, it will not be able to conquer those who have not until now been ensnared by one of the funniest racing games around. The atmospheric effects, then, are a gem to experience in person, for the novelties that lead to this that will be remembered as one of the best driving games, on four wheels, of the year. The two wheels consider them as a nice addition, to be evaluated according to taste. Pros: Atmospheric effects Longevity The new Geometry Wars The bikes work ... Cons: ... but only in part Few substantial changes Some aspects of the career mode", "date": "2007-10-15", "grade": null}