{"name": "Naruto: Ultimate Ninja 2 - Recensione", "ref": "https://multiplayer.it/recensioni/naruto-ultimate-ninja-2-recensione.html", "text": "It's really a lucky period for Naruto, who is enjoying an indisputable popularity at home and abroad, and here in Italy he can count on the daily broadcast of the animated series (already collected on DVD as well) as well as on the publication of the manga and two reprints of the same. A respectable result for the work of an author who is almost a newcomer like Masashi Kishimoto, who has been able to effectively mix all the themes that distinguish highly successful serial products. Namco Bandai did not miss the opportunity to bring Naruto to the world of video games on different consoles, and the Ultimate Ninja series for PlayStation 2 represents the flagship of this production. The ultimate ninja Naruto: Ultimate Ninja amazed everyone a bit because of some original ideas inserted in the context of a normal two-dimensional fighting game. Instead of facing each other on one level in the first place, characters can quickly move to another level to catch their breath and try to catch their opponent off guard. Secondly, the stages have numerous interactable elements that can be destroyed to collect power-ups of all kinds, from the throwing weapon to the roll that increases the chakra, passing through the classic snack that restores some of the vital energy. By pressing the Square key, shurikens or blades can be launched which are not intended to inflict who knows what damage to the opponent, but which can cause him to move or perhaps to open his guard in view of a much more significant assault. And in this juncture, Ultimate Ninja shows its most spectacular aspect: the special moves translate into even rather long animated sequences that show the characters as they produce their most devastating ninja techniques, with three different power levels and with an execution system which is not automatic but which requires a certain skill in pressing the right sequence of buttons, or in quickly rotating the analog stick, or in pressing a key faster than the opponent. Knead the chakra! This second episode of the Ultimate Ninja series has a particular setting compared to what has been seen previously. From the home screen, in this case, you can access a series of side modes (~Duel~, or the classic versus, ~Iruka's training~ to become familiar with the moves of the various characters, ~Tanzaku market~ to buy all the extras with the money earned and ~Naruto's House~ to view the unlocked content) and only one ~thick~ mode, namely the ~Supreme Road~. This immediately turns out to be different from the story mode present in the first Ultimate Ninja, as it makes us control various characters according to the needs of the plot (which starts from the chunin selection exam to arrive at the advent of the prosperous Tsunade and beyond) and it doesn't simply require victory in every fight, but the achievement of certain objectives that do not always imply the defeat of the opponent. Sometimes we will only be asked to win, sometimes to do it using a level 3 special move, or to resist for a certain period of time, or even to beat an opponent whose vital energy is continuously restored. It is clear that the story mode of this Ultimate Ninja 2 combines all the more consistent modes seen in the first episode, in an experiment which however turns out to be a double-edged sword because it drastically reduces the variety of the product just to get something different and not necessarily better than what has already been seen. Ultimate missions The main game mode also consists of phases in which you move around the Leaf Village (complete with a map), talk to a large number of characters and you can access a whole series of special missions of various type, which in any case imply the fulfillment of certain conditions in order to be completed. After finishing the game, these missions will constitute a sort of extra that adds further elements to the plot ... which will be resumed on the occasion of a possible Ultimate Ninja 3, of course. Levels and characters The numbers of this new Namco Bandai production are respectable, with a total of thirty-two selectable characters (many of which to unlock) and sixteen different locations for the fights. Most of the latter have already been seen and have not undergone any changes, while the new ones show a willingness to do some experiments on the theme of the different levels on which one can move. The stage set in the Tanzaku market is an excellent example of this trend: you move to two levels that are different in height butequal in depth, and the interactable objects are bigger and more peculiar than those seen previously. In another stage you fight in a forest and the second floor sees the characters moving on the water of a lake, unfortunately without reflecting their own image (it would have been a welcome touch of class). It is clear that any defects of the locations already seen can only recur, and so we will also find ourselves fighting in the area used for the clashes for the selection of the chunin, characterized by an underground gallery that winks at close exchanges but makes it difficult move on the surface. The key sequences that you need to press to perform special moves are the same for all characters, but each ninja is really different from the other for basic attacks as well as for efficiency in the offensive and defensive phases. Technical realization The graphics of this sequel do not revolutionize the work done for the first episode, but are limited to polishing it delicately and adding new characters and new settings. In the case of the former, there is no particular change in the polygonal models as regards the level of detail, while the new stages are generally distinguished by a better realization under various aspects. With the new characters also come new animated sequences for the respective special moves, characterized by a much more marked cel shading than that present in the normal game action. Loyalty to the anime is absolute, and in such situations the humorous implications are wasted. The graphics engine manages to handle everything without problems, always maintaining a certain fluidity. In fact, Ultimate Ninja 2 expires only in the ~exploration~ sections present in the ~Supreme Road~ mode, probably because in that case the developers make improper use of models designed for a different area, or for fighting only. Moving on to the sound sector, we have the usual selection of well-made music, accompanied by average effects and speech that fortunately can be set to Japanese, unless you like voices (terrible!) in English. The screen texts are all in Italian. The control system hasn't changed one iota: you can move the character with the left analog stick or with the d-pad (better), attack with the Circle button, use collected items and throwing knives with the Square button, jump with X and activate chakra for special move with Triangle button. The primary back keys are used to scroll through the objects we have, the secondary ones to perform the parry (which, performed at the right time, will make us fall behind the opponent with the most classic of ninja tricks). Comment Let's immediately clarify the concept that Naruto: Ultimate Ninja 2 is a title to buy absolutely if you love Masashi Kishimoto's manga and / or follow the cartoon on TV with enthusiasm. Beyond the enthusiasm of the enthusiasts, we are faced with a fighting game characterized by a considerable depth: do not be fooled by the fact that the special moves are performed in the same way for all the characters, because each of them has characteristics peculiar to each other. attack maneuvers that can radically change your approach to combat. The presence of throwing weapons and countless counter-moves can really transform every fight into something exciting, and the presence of two different planes on which to position yourself in each stage adds a further element of interest to the gameplay. Unfortunately in terms of modalities there has been an involution compared to the first Ultimate Ninja, as the ~Supreme Road~ alone does not represent a challenge such as to make the product very durable, nor does it push in any way towards the discovery of the different controllable ninjas , which must necessarily be used in a classic versus mode, the kind you end up snubbing right away. It's a pity that the developers didn't have better ideas to add variety and enhance the (undoubted) strengths of a title that still has its say both in the field of tie-ins and in that of fighting games. Pros: Technically good Lots of characters and settings Thick fights Cons: Only one game mode Limited longevity in singles Little variety", "date": "2007-10-16", "grade": null}