{"name": "NHL 08 - Recensione", "ref": "https://multiplayer.it/recensioni/nhl-08-recensione.html", "text": "Of all the EA Sports sports lineup, hockey is the one that has been most affected by the transition to the nextgen. Also because of the riots in the US league, which brought various problems on videogame licenses, the 2006 edition was even cancelled. While the 2007, while bringing a brand new graphics engine, suffered from some defects of youth and an uncertain framerate. But these are shadows belonging to the past, the 08 edition is in great shape, and brings the Canadian software house back to its former glory. Like all the next-gen titles presented this year, NHL 08 also shares the same graphical interface of the menus, set as a flag and completely detached from the backdrop, however, unlike Fifa 08, it is not possible to train with shots while loading the game . In our opinion, this graphic setting is still confused and not very intuitive, the player is not clear which submenus to open for setting the controls, just to give an example. On the positive side, it looks very elegant on an HD TV. Boundless, in pure EA tradition, the options available. It is possible to play the canonical quick match, customized tournaments and the entire NHL season. But this year we definitely wanted to exaggerate, including all the teams in the AHL youth league. As if that weren't enough, there are also national formations (including Italy) for a decidedly impressive overall database. This is also the first episode of the saga to fully support online tournaments, a feature already extensively tested by 2K sPorts and now practically mandatory. As a sound accompaniment, the canonical selection of indie songs, always of excellent workmanship in pure EA style. However, users can easily enter the custom ost from the dashboard. Face off! Once they hit the field, it's pure ~showtime.~ The graphics engine is the same as last year, but with important improvements, especially in terms of framerate. Now the game runs at a constant 60fps, it is possible to glimpse some uncertainty in certain situations, but these are decidedly negligible moments. The general impact is simply splendid, thanks to the new realization of the faces, which show off an impressive realism and a series of hi-res textures that are particularly appreciated in the rendering of ice and billboards. The court progressively deteriorates under the players' skates, going from an immaculate shine to a dull effect. Late in the game it is even possible to glimpse the scratches of the blades on the ice. The modeling of the stadiums itself is also remarkable, with a 3D audience that shows clothing with the colors and logos of the teams, incites or alters with exciting relevance, so as to distract the player. Everything is further embellished by a television direction of sure impact, which focuses on the coaches, the players on the bench, those booked, and much more. Not least the sound sector, the match is characterized by the typical organ breaks in conjunction with the face offs, but it is in the realization of the home team's goal that it is possible to admire (or rather hear!) the splendid work done: the stadium explodes literally in a blaze of screams, an impressive roar that hits the stands, a swirl of exultation and lights as the scorer's name is highlighted on the screen. The involvement reaches new and unexplored peaks, it is useless to add the extent of the impact if the game is enjoyed with an adequate stereo system. Nextgen controls? The most important evolution can be seen in the gameplay sector, this edition also makes use of the control system for passes and shots through the analog stick, decidedly revolutionary, but difficult to master. Alternatively you can always restore the classic controls, to do this you need to scroll through the options, select controller and set to classic. It is possible to modify all the parameters of the match, from the removal of the rules to the speed of the puck, for an unprecedented customization. There is no doubt that this year the focus has been on pure simulation, after the arcade digressions of the previous chapters. This results in less forgiving but more fulfilling gameplay. The implementation of the opposing AI has been further improved, and now the CPU adapts to the player's performance, making use of an endless series of instructions designed to make the games always fresh and unpredictable. There is no safe way to go online, not even through the notorious one-timer passes that used to be the safest route for newbies. That doesn't mean these aren't possible, our comrades place themselves effectively on the field, offering multiple cues for combined and complex actions. The player almost never finds himself alone in attack, even during line changes which, as fans of this discipline will know, do not imply the interruption of the game. However, it is in the multiplayer that the EA Sports title manages to shine at its best, a bit like any sports simulation, the involvement resulting from facing an opponent in the flesh is difficult to repeat from the CPU. But certainly better than that was difficult to do. So much to go back to the golden age of this saga, we are referring in particular to the legendary 16-bit versions, from which EA seems to update the verb, in the splendor of hd. The greatest uncertainties at the moment are in the online part, afflicted by lag that does not allow you to make the most of the game. We hope EA Sports fixes the problem soon. Goals 360 Unfortunately, EA Sports sports titles, after a generous start, have never been characterized by an affordable, let alone guessed, system of goals. NHL 08 does not deny this trend, with half of the points dedicated to online goals, which are difficult to obtain given the lag. Many questionable, such as getting into the top 50, a decidedly difficult task for those who are not accustomed to the discipline. The same goes for the objectives that require the maximum difficulty setting, a condition in which the CPU becomes a truly formidable opponent. So get ready for a particularly challenging hunt... Comment EA Sports is in a state of grace, so much so that it represents an important stage in the path of next generation gaming. The 08 editions of their sports franchises are therefore to be taken into serious consideration, especially this NHL, which not only returns to the glories of the past, but is a candidate for the best sports simulation of the genre. A mature, refined product that testifies to the enormous care lavished by the Canadian software house. Nothing is left to chance, starting from the boundless database, to the splendid graphic design, passing through an incredibly effective gameplay, there is very little left to complain about. Excluding perhaps our country's lack of interest in this sport, and an online feature plagued by lag problems. This does not mean that we are at an arrival point, a mandatory but also dangerous recognition for an annual product. It's perfectly legitimate to ask what EA will be able to invent for the next edition, but it's really difficult to expect anything more from this one. Advised. Pros Technically splendid 60fps Excellent gameplay Cons Not very palatable for our laggy country Online", "date": "2007-10-09", "grade": null}