{"name": "My Sims - Recensione", "ref": "https://multiplayer.it/recensioni/my-sims-recensione_a.html", "text": "One thing must be clarified immediately: MySims is an Electronic Arts product, it takes advantage of the brand that brought so many pennies and awards to Will Wright's Maxis and is designed for an international audience. But it was made in Japan, by the Japanese EA studios, and all in all it shows, if it is true as it is true that, playing, you can't help but notice that among the sources of inspiration the most obvious one is not so much the Wrightiana work that continues to depopulate on PC, but that Animal Crossing so dear to Nintendo players, which at the time of its release for N64 was such a Japanese game that we had to wait a generation to see it in our parts. Many elements remain of The Sims which, however, as we will see, are mostly pertinent to the ~outline~: the substance is a ~Communication Game~ set in a village populated by many nice super deformed little men, each one very characterized, and that you will have to do everything to make you happy and satisfied. Once upon a time Mastro Geppetto EA's intention to address a so-called ~casual~ audience is clear from the outset, as MySims does not provide any options at first start: you watch an introductory movie and start playing. You will soon learn that you are moving to a small semi-abandoned village, where you will only find the mayor and four other Sims. However, this small village was once graced by the presence of a Sim who was very skilled at building everything from tiny ornaments to entire houses, giving them a special touch and making his fellow citizens so happy; unfortunately, however, one bad day this Sim left, and little by little the town lost all attraction and was abandoned. Well, it just so happens that you are endowed with the same abilities as this mysterious individual, and the mayor was only waiting for your arrival to restore prestige to the community and make it lush and populated again! But it was made in Japan, by the Japanese EA studios, and all in all it shows Once upon a time Mastro Geppetto After a short creation of the character, which does not give a wide range of customization (but since they are super deformed and cartoonish style characters, that's okay), and having built your house, you are immediately thrown into the fray, with the mayor who will explain the situation well . Already during the construction of your home, you become aware of the six ~interests~ that every Sim can have: study, entertainment, the dark, the pleasures of the table, pretty and nice things and finally everything that can revolve around the concept of geek (comics, sci-fi, RPGs, video games). There are, among the pieces that you can use for the home, some that are neutral and others that instead increase a certain parameter: the column, for example, increases the ~studied~ aspect of your home, a somewhat bizarre lamppost that fun and so on. You are free to do what you want, but as far as the other Sims are concerned, you will have to take into account that each of them has a primary interest, a secondary one and, on the contrary, something they just can't bear. Once established and before tackling the first mission, you will want to take a tour of the surroundings and talk a bit with the other Sims, thus discovering that the area you can initially access is rather limited and decadent, and that there are few ways to interact with your new fellow citizens: talking is self-explanatory enough, being kind will improve your relationships, being cruel will make them worse, that's all. But by performing these actions as well as exploring the village you will come across what is perhaps the most important concept of the game, the essences. Digging, shaking the trees, fishing, arousing particular reactions in the other Sims, are all actions that will give you particular objects, precisely the essences, which can then be used to decorate your objects either as they are or, much more profitably, to color a block; unlike blocks, then, an essence always increases a certain parameter, and in fact when a Sim will ask you for an object, he will also ask you to color it or decorate it with a certain number of a given essence. The essence of the matter Receiving assignments, finding the essence, building the object: this is therefore the leitmotif of MySims which will never abandon you throughout the course of the game, constituting its backbone but also its main limitation. Carrying out an assignment will make the Sim who entrusted it to you happy, improving the esteem they have of you and above all making them happier and more inclined to take care of the village on their own. However, the main objective is to achieve the five-star rating of the village, and this will be possible as it is more beautiful thanyour village will come, the more Sims will move there, the more extensive the explorable and buildable area will be for a continuous and potentially fascinating cycle which however translates, in practice, always and only into the same identical sequence of actions, which in the long run is boring, and considering that you will have to build a lot of houses and objects before reaching the five stars The social component of Wright's games is extremely limited here, or rather, there is, but it has no practical evidence. You can build yourself anything, a stereo and listen to music, a tub and take a bath and a fridge for a snack, but what's the point since you personally have no needs to satisfy? And you can do it for others too, to improve your relationships: you probably won't resist the temptation to build something particularly dark to impress your neighbor who loves ghosts and horror, but how long will it last since your relationships are already carrying out the mandatory tasks Will they get much better? It's nice to see that two Sims with common interests will love each other while two with opposite tastes will even come to blows, as well as enjoying the various areas of the village which, as they populate with increasingly happy Sims, go from abandoned and depressing to lush and well-kept , but when to get all this the only thing to do is a continuous repetition of the same actions, sooner or later the thing will inevitably lose part of its charm. How much depends on personal tastes: what is certain is that in MySims, even with so many things to theoretically take into account, you always do the same thing. I've lost my compass! A repetitive and monotonous process is (slightly) aggravated by some defects. First of all the loadings, which at least at the beginning of each game are really long, and there are some for each phase of the game, from entering a house to starting the construction of a new object. Luckily the later ones are much faster then. Exploration and building, which is what you'll be doing 90% of the time, are also made a bit frustrating by having a camera that's too close and a map that's too small, which things will tax your sense of direction, and the other from a control via Wiimote, used here as a mouse, which precisely in the construction phases loses some of the precision that it instead demonstrates without hesitation in the exploratory phases. Defects to report more for the record anyway, because they are all well below the tolerable threshold. The sensation of an above average technical realization is confirmed by the fact that, despite the initial appearances go in the direction of yet another GameCube engine, as clean, colorful and fluid as you like but still from a generation ago, going forward and adding to the town houses, trees, objects, Sims and whatnot, there doesn't seem to be any significant framerate reduction. Even the voices of the characters, who speak the classic ~simmesco~, are clean and well done, while the music and sound effects fall within the most classic of the ~without infamy and without praise~: the music in particular is made so as not to weigh too much on the gaming experience, behave wisely as there will be one or two pieces that will stick with you much more than the others. Finally, it should be noted the absence of any multiplayer component and the translation, only textually speaking of Sims, into good Italian. The merits and limitations of MySims are very clear: on the one hand, an immediate, fun game system and an excellent implementation, on the other, the fact that, even with all the parameters to follow, you never do anything other than the sequence~ talk-explore-build. It is with this thing in mind that you will have to approach the game, bearing in mind that seeing your town grow and improve gives you a sense of satisfaction, but that, in the end, you can intervene in this growth process only and only in one way. The vote you see on the side is a solomonic middle ground between how much the game system could bore you or vice versa fascinate you. initials too long", "date": "2007-10-08", "grade": null}