{"name": "Line Rider Mobile", "ref": "https://multiplayer.it/recensioni/line-rider-mobile.html", "text": "~The soldiers' boots, the mother's eye, the pram going down the stairs...~. This is how ~The battleship Potemkin~ was commented in ~The second, tragic Fantozzi~, and now we have a sort of wheelchair that also runs around on our mobile phone thanks to the mobile reduction of Line Rider. A true mass phenomenon on the internet, where it is available free of charge, this particular and simple videogame has unleashed the creativity of many people, curious to see how the protagonist of the game would have behaved in the face of a dizzying jump or a particularly rigid. Because the spirit of Line Rider also and above all lies in experimentation: until the wheelchair crashes (which happens very often, at the beginning), we cannot understand how it ~works~, which trajectories it is best to make it follow in its crazy race to the finish line. But how does Line Rider Mobile work? In practice we have a white sheet (literally) on which we can draw lines, whether straight or curved, in order to build a sort of path that goes from a starting point (from where the wheelchair will descend) to an arrival point. On mobile, the experience is enriched by the presence of numerous puzzles to solve in addition to the basic mode, which is completely free and allows us to save the stages we have designed (as well as to exchange them with other mobile phones via bluetooth). What is certain is that the developers had to deal with the profound differences that exist between drawing the paths with a mouse and doing it with the joystick of a mobile phone, which inevitably makes the creative phase very, very cumbersome and at times even frustrating . That said, this version of Line Rider includes all the tools of the original, which we can scroll through by pressing the asterisk and hash keys on the numeric pad: the pencil (for drawing trajectories of different types: normal, acceleration, deceleration, etc.) , the curve (to ~soften~ the angular sections of the path), the eraser, the magnifying glass, the ~cancel~ button and the ~play~ button, which starts the character and checks the goodness of the work done . The technical realization of Line Rider Mobile, in accordance with the original version, is absolutely essential. It is clear that mobile phones are not the best device for managing vector graphics, but in the face of such limited and bare elements it was reasonable to expect at least a certain fluidity, which unfortunately did not occur. As far as the sound sector is concerned, it consists only of a small number of very simple effects, therefore it is completely negligible. And we come to the matter relating to the control system, which in this case is really central to the enjoyment of this type of application: unfortunately the difference between the mouse and the joystick is sharp and clear, therefore drawing the paths becomes laborious and stressful, which with the experience improves only in a limited way. PRO It's still Line Rider There are puzzles Created routes can be saved AGAINST Absolutely cumbersome Technically insufficient Reduction on mobile ~thought~ badly", "date": "2007-10-03", "grade": "S.V."}