{"name": "Sonic Rush Adventure - Recensione", "ref": "https://multiplayer.it/recensioni/sonic-rush-adventure-recensione.html", "text": "A pinch of adventure... Sonic Rush has certainly satisfied the need for pure action of all fans of the blue hedgehog, but the need for a more complex and multifaceted structure was felt. So Sega thought of this Sonic Rush Adventure as a product less focused on overcoming stages for its own sake, enriching it with elements that add depth to the whole experience. Sonic and Tails, during a plane trip, end up in a blizzard and find themselves in a mysterious archipelago. Here they are found by Marine, a little pest with a great desire for adventure, who decides to accompany them on their expeditions as soon as the threat of pirates arises, led by the perfidious (how stupid) Whisker. Starting from Southern Island, Sonic must locate his destinations on the nautical map and reach them with four different types of boats (jet ski, ship, hovercraft and submarine). These vehicles are not available immediately, but are built by Tails using the materials that Sonic collects by completing the various stages. Each island of the archipelago is rich in a certain mineral, and completing the stages implies collecting it in different quantities depending on the degree of success (the ~C~ ranking is equivalent to a single piece, ~B~ to two and ~A~ to three). The fact of having to collect certain quantities of each material translates into having to replay already completed stages, which can then be accessed freely. The game Each island includes three stages, the first two ~normal~ and the third in which the boss of the moment is fought, in a structure that repeats itself identically for each location. To move from one island to another we will initially use the jet ski, then the other vehicles that Tails will build using the materials collected. Changing the island is not an automatic procedure, but contains many of the innovations introduced by Sonic Rush Adventure: the arrival point is identified on the nautical map, where there should be a new land to explore; then with the stylus a route is traced whose length is determined by the vessel being used. Finally we leave, controlling the vehicle with an effective combination of touch screen and back keys: the jet ski and the hovercraft are controlled by moving the stylus on the screen, with the hovercraft which can also fire with a simple ~tap~ or load a stronger hit by holding down the screen; the ship and the submarine, on the other hand, are controlled by Tails and we will only have to take care of eliminating the enemies that will hinder us, using a whole series of weapons always with the stylus. As for the levels themselves, they appear practically identical to what was seen in Sonic Rush, only shorter and equipped with a greater number of ~variations on the theme~ which manifest themselves in improbable launches with cannons, drums, tongs, etc. etc. Is Sonic still Sonic? There are also elements that have always characterized the series, or rather the ~rapid~ approach that leads us to complete each stage in a few minutes, gaining more and more speed, or a more reasoned and targeted approach to conquering as many rings as possible. To underline the possibility of choosing, there is also the availability of a second usable character, Blaze, already after completing some internships. Slower than Sonic and perhaps more devoted to offensive maneuvers, the fearsome purple cat can make our lives easier when the enemies become more powerful. Not that their presence is massive, mind you: the developers thought the levels so that the greatest threat was the environment itself, with its traps and chasms, which have distinguished Sonic since the very beginning. However, there are enemies and they are also quite cunning, so much so that the more you advance, the more you have to pay attention to their weapons, which can cause us to lose all the collected rings with a single blow... A similar argument can be made for the bosses, very similar to those of Sonic Rush, which must always be eliminated in the same way (with a few exceptions) and which boast a design with ups and downs. Outline elements The starting island allows us to do several things after just a few internships. First of all, it is possible to access one hundred extra missions by talking to the various characters, missions devoted to the recovery of the Sol Emeralds. Furthermore, on the nautical map, from time to time we will find ourselves having to face speed races on jet skis, by winning which we will be able to conquer the Chaos Emeralds. But that's not all: one of Marine's friends will offer to ~beautify~ the island with a whole series of works of art, which we can buy by spending rings and collected materials. Finally, there is no shortage of Time Attack mode and a multiplayer mode both locally and via Nintendo Wi-Fi Connection: nothing major, but definitely a nice addition that increases the longevity of the game. Technical realization Sonic Rush Adventure takes a few steps forward compared to the old Sonic Rush, even if there is nothing so obvious to cry out for a miracle. The drawing style of the characters is excellent, as is the construction of the stages, which thanks also to their smaller dimensions manage to be much less repetitive as regards the elements that characterize them. The speed is exceptional as always, and the locations flow very quickly without losing pieces along the way, without any flaws in the rendering. The mix of bitmap and polygonal graphics works very well, with slight drops only during boss fights, characterized by a discreet design but lacking a high level of detail. The zooms and the ~variations on the theme~ are more numerous, in some cases even very nice (see the dolphin to ~ride~...), while the realization of the ~nautical~ phases does not shine but is functional to the action. The sound sector is excellent, with a series of very rhythmic and catchy songs, together with the usual classic effects. Finally, the control system is immediately immediate and responds very well to inputs. A praise goes to the developers for the solutions adopted in the water sections, with the stylus that manages to control the vehicle in a rather precise way and paves the way for some new experiments in this direction. Comment It took a while, but finally all Sonic fans can try their hand again with an episode of the series, less action-packed for the occasion but with a certain depth. Technically excellent, Sonic Rush Adventure introduces many innovative elements and makes it pleasant to replay already completed stages to collect the materials Tails needs to build the boats. There is therefore a ~growth~ phase, in relation to the available vehicles (which allow you to cover greater distances, therefore to discover new islands), alongside a very large number of extra missions and speed races that must be tackled to complete everything as quickly as possible. 100%. We are not facing a revolution, that's for sure: the game mechanics are the same seen in Sonic Rush and are undermined by the same level design flaws, which prevent us from surviving certain traps if we don't already know the characteristics of the stages . But the result achieved by Sega is still excellent, where it manages to re-present a successful product, enriching it with precious elements and on which to focus also in the future. Pros: It's still Sonic Lots of cool innovative elements Quite long-lived, thanks to the extras Cons: It's still Sonic Difficulty leveled down Sometimes frustrating Sonic Rush Adventure is only available for Nintendo DS. It has been quite a while since the release of Sonic Rush for the Nintendo DS. The Sega title had the onerous task of collecting the legacy of the best 2D Sonic episodes, redesigning them on the characteristics of the portable console. The first step taken by the developers was to extend the action on both screens of the DS, creating stages that often developed vertically, with numerous ~lanes~ that could be traveled to reach the end. The second innovation introduced was the turbo bar, which could be filled by performing stunts and allowed Sonic to run as fast as possible, overwhelming every enemy in his way. The result was a fast, frantic and immediate game, which embodied all the good (and not so good) that has always characterized one of Sega's most popular franchises.", "date": "2007-10-04", "grade": null}