{"name": "Medal of Honor: Airborne - Recensione", "ref": "https://multiplayer.it/recensioni/medal-of-honor-airborne-recensione.html", "text": "Who, how and when In MOH: Airborne we come from above, plunging into the midst of the fiercest firefights of World War II. Battles where the strategy of waiting is a distant memory, clashes that have pure survival as the protagonist. Once again, we see crowds of Nazi soldiers who, from an advantageous position, find themselves facing the largest counter-offensive ever conceived. We therefore find ourselves in the uncomfortable shoes of Boyd Travers, a chosen soldier and paratrooper of rank, engaged in the annihilation of forces literally cornered in those places, now familiar to all fans of the genre, who decided the fate of the war more great and deadly ever fought. The six maps are very large and take about an hour each, without considering unexpected events and the level of difficulty that can dilate the experience up to 8/10 hours in duration. It starts from southern Italy and, passing through the rear of the dramatically famous Utah Beach, you arrive in the heart of the conflict where the Nazis are desperately trying to protect their bulwarks, their secret weapons and the chimera of their superiority. First the mess tin, then the fun To give life to the tragic magic of a conflict without rules and borders, EA has created a system that allows the protagonist's highly trained buttocks to be parachuted into a vast freely explorable area and to leave him free to reach the objectives in the desired order. Unfortunately, parachuting outside the safe zone, indicated with a green smoke bomb, is a very difficult task which, almost invariably, ends in any difficulty other than easy with an untimely and inevitable death that cuts off a potentially interesting feature. The enjoyment of the first three maps also falters, showing the side to obvious design defects by presenting repetitive objectives and already faced thousands of times in the same way by every average active gamer. In this case the possibility of being able to take down a cannon before another does not improve the situation much. Among other things, the missions are so long as to make one think of a real apprenticeship to have to face before having the opportunity to conquer some healthy and bloody glory. parachuting outside the safe zone results in an unavoidable premature death that cuts off the legs of a potentially interesting feature First the mess tin, then the fun Fortunately, part of the third battle offers some surprises and is proposed as a prelude to the second part of the game in which the register changes considerably. Finally it becomes relevant to choose whether to shoot down the snipers, the guards, the troops first, whether to climb towers or approach a building from one side rather than another and all this happens in maps that are much richer in details, buildings and above all enemies in a crescendo which leads us to face situations so epic as to remember the same landing of the first Medal Of Honor or the charge of the Soviets of the second Call Of Duty. Beloved, damned, needed gameplay Hands-on controls Airborne is a classic first-person shooter. The gameplay can be summarized in the canonical cover, sprint, strafe, grenade, cover, shoot. Fortunately, this new chapter of Medal Of Honor also follows the trend that gradually gives more and more importance to coverage and strategic placements. This importance, beyond the design of the map, is underlined by the possibility of gradually protruding the head outside a shelter, millimeterly regulating the vertical and lateral exposure of our precious skull in a placement mode that is activated by holding down the left trigger. To reinforce the strategic importance relating to the position of our beloved paratrooper, EA has seen fit to specialize the opposing soldiers in flushing us out. In fact, not all of them have the same characteristics and some are very skilled in shooting for the basket, obviously with grenades, and they do everything to force us out to target us with an almost infallible aim. This from stationary and placed. Unfortunately, once they have been flushed out, the opposing troop seems to suddenly lose its reactivity to transform into a group of immobile targets without a spirit of conservation, if not for infallible aim. This element, which in certain moments in normal and difficult difficulty borders on the surreal, given that even the most short-sighted of opponents is able to hit us at astronomical distances, depends on the choices of the programmers. In fact, Airborne conceals a skill increase system which is based on the use of a specific weapon. It is one ofstrengths of good old Enemy Territory never adequately employed subsequently. In this case, the possibility of increasing the rate of fire of a weapon or applying an optics to it represents an incentive to specialize in a certain approach to combat, and this is certainly an element capable of increasing the player's identification with the hero. Unfortunately EA has also decided to implement the reduction of recoil among the specialization bonuses, a factor which, combined with a greater precision of Germanic weapons, gives life to the aforementioned and surreal ability to aim with which the opponents are equipped. Detail or greatness? In MOH: Airborne draw distance and richness of detail are exceptional but cost a lot in terms of models, polygons, effects and textures. Despite this, especially in the three maps that make up the second part of the game and thanks to well-chosen chromatic choices and lighting, the overall effect is valid and is more than sufficient to recreate the idea of a frantic battle of the Second World War. However, the sound compensates for the shortcomings of the graphic engine which, from the main theme to the voices of the Nazis, is of cinematic quality and fully respects the high tradition of the series. The multiplayer supports 12 players and all the classic online modes that take advantage of the peculiarities of MOH: Airborne. The rate of fun can only benefit from decidedly large maps, cover game and the possibility of parachuting behind the opponents or in support of the allies. Medal of Honor: Airborne is available for PC, Xbox 360 and will be available for PlayStation 3. The version tested in this article is the Xbox 360 version. Comment This latest Medal Of Honor is a boon for a lover of first-person shooters with a backdrop of World War II. It is one of the few titles that have tried to innovate what was becoming an essential pattern for an entire gaming category. Sadly Airborne suffers from some design naiveties that prevent it from taking off mid-game. However, it remains a dynamic, fun and wide-ranging title that manages to have its say in a decidedly crowded panorama. Pros: freely explorable maps increase in multiplayer skills enhanced by the peculiarities of the game skydiving is an interesting feature .... Cons: .... but badly exploited in single player takes off from mid-onwards explosions and old generation models Goals 360 Landings, shots with the butt of the pistol and a series of specific actions are the canonical side dish. Most of the points obtainable in single player comes from the simple completion of the six missions and the less simple finding of all the bonus skills scattered around the maps. Unfortunately, most of the points are related to multiplayer and above all are related to ranked matches that force you to play with unknown players. When you come into the world moments before a guy in shining armor named Master Chief and you have all the photographers at your couch, you have to hope you have something very, very unique to offer if you want anyone to notice you. Luck has it that, out of necessity or creative drive, EA is in a golden moment and finally does not disdain new paths and new approaches to the genres it has been riding for a few years. The main problem in these cases concerns the how. It is not at all easy to innovate an inflated, abused and cloned genre that has its warm refuge in the Second World War when ideas are scarce and other conflicts appear too limited, unknown and it is too difficult to transform them into romantic memories of generations now gone. For Airborne the solution is called parachuting, a possibility that appeared timidly in Battlefield in the form of a spawnpoint and never explored from a playful point of view.", "date": "2007-10-01", "grade": null}