{"name": "Boogie - Recensione", "ref": "https://multiplayer.it/recensioni/boogie-recensione.html", "text": "Dance for me dance dance all night you are beautiful The dance mode is the most original thing that Boogie has to offer, in fact karaoke has already been enjoyed in other titles, such as the famous Singstar series for PS2. EA seemed very enthusiastic about the system designed for Boogie, a system that allowed the player to dance in a creative way, freeing him from the chains of timed indications. All this thanks to the Wiimote sensor which gives (should give) the possibility of making the aspiring dancer exhibit more loose and articulated movements. In truth it's just a matter of shaking the Wiimote in one of four possible directions (up, down, left, right). The controller speaker will act as a metronome, marking the beats of the song that is playing in the speakers of your TV or amplifier with its unmistakable sound. Following the rhythms of the music you will have to make your character dance in the middle of the stage. You are not forced to move at each bar and you can also leave pauses between one and the other, the important thing is to move in time. With each move, the score multiplier will increase until your technique is ~hot~, a status that will be lost as soon as a rhythm is wrong. In addition to this, the player will have to worry about not always repeating the same figure (read direction), under penalty of a lower score for the step being performed. Through the nunchuk stick you can move the character in one of the nine positions of the stage. The interesting thing is that even these movements become dance steps and will have to be done in time. Moving through the level serves both to vary your performance a little which would risk boring you before reaching the end of the song, and to collect the bonuses that every now and then a kind of little devil will kindly provide us from his hands. In addition to what has just been described, some events have been inserted to vary the formula. When a gauge is full enough you can perform a pose or combo of your choice. The first involves aiming at a series of targets by rotating the nunchuk in your left hand with the wrist, the second will allow you to perform a series of steps following the directions set on the screen and being careful not to miss the tempo. These operations, in addition to bringing some panache to the stage, will guarantee you other essential points for breaking records. In EA's die this system was supposed to guarantee freedom and fun for everyone, but in practice things are different: in addition to some imprecision in the response that occasionally will make you miss a combo undeservedly, and perhaps excessive fussiness in judging the rhythm, the The most serious lack of this system is the absolute autonomy left to the player, who is neither stimulated by an adequate level of challenge, nor amused by the repetitiveness of the steps. Singing, hands in pockets singing. If the test of the dance mode leaves a bad taste in the mouth, the taste does not change with singing. First of all the USB microphone that comes with the game is not good quality. It's quite solid to the touch, but you'll soon find that to hear your voice coming out of the TV you'll have to hold it very close to your mouth. For a title based half on karaoke this situation seemed frankly incomprehensible. As for the rest, our tests have always proved unclear and unsatisfactory. Sometimes it seems that just sing any note is enough to please the software, sometimes it seems that even if you sing well, the software is not satisfied. To the right, an indicator will signal the intensity of our voice, which can be adjusted by singing louder or by bringing the microphone under the lips. However, everything seems to pass from a state of deafness to one of saturation with consequent distortion of the voice. Meanwhile, the words flow quickly with the pitch indicator that seems to go on its own for the various notes without the singer changing intonation. On the other hand, sometimes they splash up and down the score without understanding where to position themselves. These situations discourage an already embarrassed player (a normal karaoke would put less difficulty), and to make the situation more disheartening come the songs, which, however famous and beautiful to listen to, prove too difficult to sing. The tracks are certainly appealing, all quite well known, but singing them will be much less pleasant than listening to them. While you perform your character meanwhile in the background on the screen will continue to move to the rhythm, a friend of yours if he wants (or you if you feel capable) can control the character and make him dance as he would in the dance section. Sing you, that makes me laugh The initial menu offers several ways to challenge yourself, but in truth they are allyou many similar. First there is the story, where you will have to choose one of the 5 characters and complete the 5 trials for each one, three for dancing and two for singing in random order. After the performances you'll unlock a garment or item to customize your character, and at the end of each story you'll unlock a new song. By winning tokens (in any mode) you can buy new stages, new objects, and above all new songs. In addition to this mode, and being able to choose the dance and singing test individually, you can choose the create video mode, where you first have to perform a performance of your choice and then edit the video of your performance (which can also be done by playing the single modes). Editing consists of applying effects to the scene and changing the camera that frames the stage. Among the effects, as anticipated, there is one that allows you to view the shot with the two red / green images, to be viewed with glasses for a 3D effect. Finally, for those who want to involve some friends in the game, there is the multiplayer mode where two players can take turns competing in scores and trials. Comment Boogie is the product of good intentions employed in a project born under an ill star. The commitment of the developers is perceptible, but it was not enough. The result is a formula which, beyond some rather incomprehensible oversights, suffers from basic structural deficiencies. The dance part is simplistic: instead of bringing a novelty or a variation to the genre, it achieves the result of simplifying things without making them ~better~. The only goal will be to outdo each other from time to time, but after the first curiosities the players will get bored even reaching the end of the song. The singing part, on the other hand, is frustrated by problems relating to the microphone and voice recognition, which make everything less serene than it should be. With these premises, everything else, such as the excellent graphic design and the spot-on soundtrack, simply takes a back seat. This first appearance of Boogie is unfortunately a hole in the water, but it could have laid the foundations for something more complete. We just hope that if EA is willing to try their luck with a sequel, they may have better luck. Pros Good characterization of the design Catchy and classic track list Could liven up your parties Cons Obvious structural deficiencies Mic inaccuracies Challengeless Boogie is available for Wii and will be available for PS2 and DS. The tested version is the one for Wii. The generally immobile EA tries to reinvent itself on the Wii, with a game that will appeal to both casual players and rhythm game enthusiasts. The result, however, we say it immediately, fails to satisfy fans and risks leaving indifferent even the new catchment area on which Nintendo has voraciously set its teeth. It's a shame to find Boogie a hole in the water, because the game seemed supported by good intentions and original ideas. It is clear that there was the will to do a good job right from the first game screens and from the packaging it offers in a fragile cardboard case, game, microphone and goggles with red / green lenses to watch the videos of our games in 3D performance. The menus are very elegant, as is the graphic style of the game which combines some cinematic and theatrical clichs with fictional characters drawn in a mixed technique between comics and cartoons. Meanwhile, all this explosion of elements is accompanied by one of the pleasant soundtracks included in the game. First impressions therefore leave more than well disposed towards Boogie. The first disappointments begin to creep in though, when you start exploring the game modes. Leaving aside all the variations offered by the title for a moment, let's analyze the two pillars of the project, dance and song.", "date": "2007-10-02", "grade": null}