{"name": "Skate", "ref": "https://multiplayer.it/recensioni/skate.html", "text": "In Skate, the user plays the role of an anonymous skater eager to get the coveted cover of the prestigious Thrasher magazine. To do this, it will be necessary to favorably impress photographers, industry experts and sponsors, completing small missions with the most varied objectives: ranging from the simple execution of a series of tricks to the discovery of a particular object, passing through the most classic races in points. If up to this point Skate does not appear very different from the direct antagonist Tony Hawk, things are starting to get interesting regarding the control system, which here succeeds in the difficult feat of being both immediate and quite profound. In addition to moving the skater using the arrow keys, the user manages almost all of the tricks using the OK key, which allows you to jump and perform evolutions in mid-air, while grinds and the like are performed automatically once you get on above the element of the scenario prepared for the purpose. Beyond a few other ancillary functions, Skate is all here, and this is one of the major strengths of EA Mobile production: the game manages to be simple and fun, thanks also to a decidedly well-calibrated game structure. In addition to being quite differentiated, the various missions do not last more than a couple of minutes each, proving to be optimal even for short sessions. Not only that, even the level design has been taken care of at the right point: set in an imaginary American metropolis, Skate offers two-dimensional levels extended both horizontally and vertically, whose nature pushes the user to explore them carefully in search of the most profitable in terms of achievable tricks. The technical realization is also of considerable depth, starting from the graphics: the EA product can boast scenarios full of details, well-defined and animated characters and an impeccable selection of colors. Also noteworthy are the good results of the sound, for once sufficiently present and even plausible in the reproduction of some effects. PRO Immediate and well-studied gameplay Remarkable technical capacity Complete and long lasting AGAINST Nothing too original A little easy", "date": "2007-10-02", "grade": "S.V."}