{"name": "My Friend Pedro: Ripe for Revenge", "ref": "https://multiplayer.it/recensioni/my-friend-pedro-ripe-for-revenge-recensione.html", "text": "Do you remember My Friend Pedro, the action shooter developed by Deadtoast Entertainment and released a couple of years ago, in which we played a sort of mix between Deadpool and Max Payne engaged in spectacular firefights in rigorous bullet time? Well, the the authors of the game have seen fit to bring that experience to iOS and Android as well, albeit in a very particular version, substantially simplified on a narrative level and characterized by a ~chibi~ style for the characters. A successful experiment? We tell you about it in the review of My Friend Pedro: Ripe for Revenge. History My Friend Pedro: Ripe for Revenge, a firefight with the new control system. In the original My Friend Pedro we controlled a masked hit man, deprived of his memory for some reason, who found himself talking to a banana. The only thing he remembered was his mission, which was to take up arms and wipe out a criminal organization: a task that only a madman could have accomplished, or a ruthless and infallible killer. Or both. In My Friend Pedro: Ripe for Revenge there isn't a mysterious subplot to reveal, let alone references to ultra-violence: that type of system has been replaced by a chibi style that transforms both the protagonist and the various villains into super deformed figures, eliminating the blood but leaving the bullets intact. Tons. And the talking banana? We'll have to help her save her family. Gameplay My Friend Pedro: Ripe for Revenge features several interesting puzzles throughout the campaign. Although in theory it was possible to translate the action shooter gameplay of the Deadtoast Entertainment title on mobile, the authors preferred to revolutionize the experience also in terms of mechanics, designing a control system based on the touch screen which on balance brings the game a sequence of puzzles to solve. Basically this was the big limitation of My Friend Pedro: the impossibility of creating spectacular situations in a free way, as happened in the aforementioned Max Payne, while remaining instead anchored to the context and the scenario, i.e. to the puzzles created for the occasion that we had to somehow try to solve without leaving our pens. My Friend Pedro: Ripe for Revenge also includes short guide sections. The movement of the character in Ripe for Revenge is not direct, but works with a sort of Angry Birds-style slingshot, which however turns into an arrow when we tilt it in a certain way, allowing us to slip under any obstacles. The aiming of the weapon is instead even more immediate: just touch the targets in sight to shoot them. land to take the next leap, breaking the rhythm of the action quite a bit. Secondly, even for small trips you have to proceed hopping, and when that happens a little frustration inevitably arises. Structure My Friend Pedro: Ripe for Revenge, if we wait too long the enemies will hit us. It's nice how the developers of My Friend Pedro: Ripe for Revenge have exploited the new mechanics to create interesting situations, trying to reproduce certain elements (see the pans, switches and skateboards) but putting them in a different light, in the 'field of sequences that we will have to solve from time to time. The campaign is made up of thirty-six missions which are actually completed rather quickly, but which can be replayed in a speedrun mode with rather stringent time limits. In our opinion, however, this is not the ideal dimension of the game, which in such a difficult and limited context ends up emphasizing its cumbersomeness. Technical realization Finally we come to the graphics, which are less sophisticated and spectacular than the original My Friend Pedro, which could count on some truly memorable moments on a visual level, but defends itself well and seems to have found a good compromise with the chibi style. This expedient makes the characters are nice, although the scenarios are always quite bare and a bit repetitive. Nothing to say instead about the sound sector, which can count on engaging and rhythmic music, accompanying the action in the best way.", "date": "2021-08-05", "grade": "7.4"}