{"name": "Tiger Woods PGA Tour 08 - Recensione", "ref": "https://multiplayer.it/recensioni/tiger-woods-pga-tour-08-recensione_a.html", "text": "Only six months ago, in March, we were able to get our hands on the previous Tiger Woods chapter for the new Nintendo Wii console. The impression aroused was more than positive and the new course of the series therefore represented a breath of fresh air in the genre of sports simulations. In the vein of Wii Sports, the game Electronic Arts added its classic completeness and longevity to create an unprecedented golf video game; here we are already reviewing the 2008 chapter, released for all home consoles (and not), and tested in its ~classic~ incarnation on Xbox 360: will it be able to give us some ~new~ thrills even without remote controllers? Is golf a sport for the rich? This sport is certainly not one of the most practiced in the world, let alone in Italy. It is often associated with the words exclusivity, wealth. Despite this, the group of fans and enthusiasts becomes more and more solid and consistent every year, forming a hard core of virtual golfers every year dedicated to videogame practice, perhaps dragged along by the new flourishing of golf due to satellite television broadcasts. Electronic Arts practically reigns unchallenged in the genre, and it is for this reason that it is difficult, every year, to seek but above all to try to offer an ever-improved, fresh and new product, in a sport that has very little fresh. Much of the work has gone into multiplayer and multiplayer modes, though there is of course always a robust set of online options via Xbox Live. Electronic Arts is one of the best software houses to implement the game via the internet and always focuses on total connectivity: a good example is the integration with ESPN and their live news that continuously arrives on screen. Modernize the classic controls With the release of the Wii, some games were profoundly affected by Nintendo's new course on controls. Athletes in particular have benefited from the invention of the remote control, automatically relegating the ~old~ joypads to something outdated and outdated. On traditional consoles such as the Xbox 360, Electronic Arts had to do a good job of rejuvenating the controls, trying to use analogs and buttons on the joypad in a creative way. To use the golf club we therefore find ourselves ~mimicking~ the shooting movement with a large half-sphere in the Street Fighter style, loading the shot downwards and then pulling the final shot upwards. Accuracy is key: deflecting the analog travel slightly to the right or left is equivalent to sending the ball too far to the side of the court, or directly out of par. Several factors influence the force used in the ~swing~: height of the grass, sand, slopes or elevations are just some of them that determine the distance to which we can send our ball. Electronic Arts had to do a good job of rejuvenating the controls, trying to use the analogs and keys on the joypad in a creative way Modernize the classic controls Next to the latter there is a mace positioning indicator, which makes us understand the inclination with which it strikes, while a numerical display indicates the percentage of maximum force available from the position in which we find ourselves. Studying the green is essential before making a shot. Thanks to the multiple viewing angles it is possible to look at the course in its entirety, furthermore a grid appears which shows the slope through direction and intensity. The ~study~ phase, therefore, is perhaps the key element of this game, but of all golf in general; Tiger Woods' gameplay builds on this, and is supported by a myriad of camera and control options. A novelty is for example the preview of the Putt, or the possibility of visualizing the trajectory that we are going to execute with our ball in preview: it can only be used once, and not by playing the Professional Tour. Option that caters to casual players and which as a result only makes the game much, much easier: our advice is not to use it if you want a more challenging level of challenge. A role-playing game about Golf Tiger Woods, as well as a good sports simulator, is also a bit of a small role-playing game of its kind. In fact, there are some typical elements of games such as Oblivion or Two Worlds, such as character customization and the various skills (skills) to learn and improve more and more. In the EA game it is possible to create our digital alter-ego from scratch in a very complete and satisfying way. Just like in Rainbow Six Vegas on 360, the Microsoft USB camera has a reason to exist and can be used to recreate our face in 3D thanks toie to a frontal photo and another in profile. However, the possibility of acting on the polygons has increased, and here we have to go and arrange all the various contact points which will then influence the facial animations, and then modify textures and colors. The options are numerous and contribute to a very powerful editing. Once our golfer has been prepared, we can start among the various game modes, all of which have in common the fact that by playing them, our performance gradually increases thanks to the MySkills system. In fact, the skills screen shows us a long list of scores in various strokes and techniques that increase hand in hand with the progress of the game, every time we make perfect or exceptional shots. If a skill grows beyond the line of the appropriate limiter, this turns into unrealized potential, which in order to be exploited requires victory in Tiger Challenge matches or by completing PGA season events. The skills are heterogeneous and numerous, and to develop them all you need many hours of practice and training. Once a satisfactory degree of skill has been reached, the strokes and the game in general will become more and more satisfying thanks to a more accurate and precise control. Game mode Tiger Woods' beating heart is once again his career with his PGA Tour (hence the name of the game). You make your debut as a rookie trying to rank among the top hundred positions in the world and win the prestigious FedExCup: the normal season is made up of 16 events in which the most important tournaments give away more points and money and the possibility of accessing the playoffs. After each of the four playoff tournaments, the top thirty golfers are then awarded a certain number of points based on their placement, and the athlete who manages to get the most takes the grand prize. In this mode you can choose to impersonate a rookie Tiger Woods or create one of our characters from scratch, while playing the so-called ~Tiger Challenge~ you will face a series of opponents in the hope of accessing the final challenge against the absolute champion Woods. In addition to the classic golf specialties present every year, new features have been added in the 2008 edition such as the ~Bingo Bongo Bongo~, a challenge that rewards players who unlock particular situations such as being the first to arrive on the green, at auction or to make the highest score. Tiger Woods' beating heart is once again his career with his PGA Tour Game mode In the arcade mode there is the classic Battle Golf where you can choose between 16 classic fields and play against an opponent, or the One Ball mode that is played with up to four participants who alternate with shots using the same ball until someone can't make a hole. With each shot, each player must hit the ball within a ~Circle of Confidence~ to preserve their place in the shooting rotation; if the ball remains outside the circle, the shot is called a ~Betrayal~ (betrayal) and the player loses his turn, while any dirty or wrong shot becomes a ~Double betrayal~ and causes him to lose two consecutive turns. The mini-games present are many and range from ~Twenty One~, similar to Blackjack in which you have to get close to 21 points without going bust, the ~Seven~ in which you have to score seven points, the capture the flag where you have to hit objectives , the T-I-G-E-R based on H-O-R-S-E, a basketball game in which our friends have to match our shot in order not to receive a letter, and many ~contests~ where whoever makes the longest or most accurate shots wins. Xbox Live and graphics Xbox Live is well exploited and includes the possibility of accessing online tournaments, challenges and even saving our shots, holes or entire rounds to share with our virtual golf colleagues, who will thus try to improve and exceed our performance; thanks to the collaboration with ESPN, then, this Electronic Arts title also enjoys sports updates that run live during all phases of the game, just like a constantly visible news bulletin. As for the technical implementation, not many words can be said about it: Tiger Woods 08 is a graphically good title but one that is definitely placed in the vicinity of anonymity: you will never exclaim ~ohh~ with a tone of amazement and you will never shout to the technical-graphic miracle. Fields and weather conditions are done well, with great textures and perfect visual depth, without clipping or other tricks. Having said that, perhaps the defect of this ~too clean~ and perfect graphic is its nature: a real lawnty is never exactly the same and green in the same way throughout its surface, to recreate a sensation of reality it would be necessary to dirty some features a little and insert more varied textures. The polygonal models of the athletes are decidedly average and suffer from slight aliasing, watched in Full-HD 1080p which the game supports. On the audio front, we confirm the feeling of anonymity already experienced with the graphics: the ambient noises are well sampled but the variety is too limited. Goals 360 Tiger Woods PGA Tour 08 offers the canonical 1000 points, and this time they will all (or almost) be hard to conquer. The first two easily obtainable are those that are unlocked by creating a male and female character with the help of the webcam, while the others are quite difficult as they are completed only by completing entire races such as the FedExCup, or online rounds where we must be winners , or even special shots such as the hole with a shot or the hole from outside the green. In short, Tiger Woods will make you sweat all the prize money up for grabs! comment Tiger Woods PGA Tour 2008 is without a doubt the best chapter of the golf simulation par excellence that has ever appeared on consoles. The improvements, modalities and filings given year after year find in this edition an absolute pinnacle of completeness and variety of options. Graphically there is certainly no miracle, despite having the best technical sector of all the golf games released so far; the same goes for the audio. Playability is excellent thanks to the innovative use of analogs and the skill advancement system as if it were a role-playing game: longevity is thus assured. The package is completed by many game modes, minigames, multiplayer and online challenges via Xbox Live, for the ultimate virtual golf experience. Its being fundamentally a ~more of the same~ than what has already been proposed in the past weighs on the final vote. Pros: Lots of events and modes Skills to learn Excellent integration with Live Analog controls Cons: Anonymous audio-graphic compartment Few changes compared to the 2007 edition Tiger Woods PGA Tour 08 is available for PC, PS3, PS2, Nintendo Wii and Xbox 360. The tested version is for Xbox 360.", "date": "2007-09-21", "grade": null}