{"name": "Scarface: The World is Yours - Recensione", "ref": "https://multiplayer.it/recensioni/scarface-the-world-is-yours-recensione.html", "text": "Starting from scratch... Scarface: The World is Yours leaves us very little time to think: the early stages of the game see us busy beating the henchmen that our enemies have sent us home, in the re-proposition of the film's ending. After a desperate escape, our character finally returns to Miami and gets back in touch with his lawyer and the most trusted ~entrepreneurs~, to get back on track. In this context, let's also familiarize ourselves with the ~managerial~ aspect of the game: we have to rebuild our empire by earning money, buying businesses and recovering all our influence over the city. The first step is to bargain with simple street drug dealers, sell them cocaine at the most advantageous price and raise the first ten thousand dollars, which we will need to bribe the narcotics agents assigned to seize our house. With our mansion available again, we will be able to control the whole territory, bring young damsels home and organize every expedition. By simply pressing a button on the Nunchuck, we can at any time access a map of Miami which not only indicates all the businesses (which we will gradually have to buy, transforming them into our ~sales points~), but also the presence of any gangs ( which we can defeat if we wish). Through the same interface you can consult an extremely detailed catalog from which to buy cars of all kinds, boats, furnishings and even planes. Each new purchase increases the value of our ~respectability~, so we will end up buying practically everything, even useless things. But when money doesn't abound, it's a case of selecting the purchases in the best way: cars fast and robust enough to withstand the mad chases through the city streets, but also all the most effective weapons (to be purchased at street dealers) and maybe some professional who can do some work for us (in which case we will control another character). ...on the Wii The Wii version of Scarface: The World is Yours is identical to the one released for PS2 and Xbox some time ago. We are faced with a huge, full-bodied game, full of depth and many facets, which on the Nintendo console finds itself a bit like an outsider due to its extremely mature contents. And which gains a control system adapted to the Wii-mote / Nunchuck combination: the analog stick moves the character, whereas orienting the Wii-mote changes its view and therefore its direction. The innovation is especially strong in combat sessions: you select a weapon from your arsenal and fire by pressing the B trigger, aiming directly at your enemies. You can also lock onto targets by pressing the Z button, which makes aiming a lot easier. The most spectacular thing, however, is the control of some alternative weapons, above all the chainsaw: we will be able to direct their blows by cleaving the Wii-mote and cause different damage depending on the area hit. Unfortunately, this type of application often doesn't pay off: it's unthinkable to fight a group of enemies without an adequate firearm, which is why in most cases we'll have to give up on tearing them apart with the remote control. The new input system does not affect the driving sections, the backbone of the game structure, since the vehicles are controlled via the analog stick and therefore without using the Wii-mote as a steering wheel, a solution that would actually have made things more complicated. In addition, some very important functions, such as the transition to ~blind fury~ mode, have been entrusted to the horrendous system that consists of ~shaking~ the Nunchuck. Technical realization The conversion of this game for Wii took several months, which unfortunately were not spent in the best way: unfortunately Scarface is still part of the ~first generation~ of titles for the new Nintendo console, i.e. of that (large) group of games made in a hurry to support the launch of the machine first and then to ride on its success, without any optimization and with a yield identical to that obtained on much older consoles. This certainly does not mean that graphically Scarface on Wii is to be thrown away, only that at this point it is legitimate to start demanding more from the developers, because there are defects in the rendering of the polygons that it is not normal to see on a machine that is almost a year old life and on whose functioning (given the close relationship with GameCube) the software houses should already know enough. Going into details, this version of Scarface supports 480p progressive scan and widescreen, but the management of polygons appears at times less fluid than on PlayStation2 and also the change of lighting (inday/night switch) is less successful. As far as the sound is concerned, absolutely nothing to say: the game boasts a superlative soundtrack, assisted by absolutely exceptional dialogues, recited by an actor with a voice extremely similar to that of Al Pacino in the film and a punctual and well done. Comment The goodness of a game like Scarface: The World is Yours is not affected by the transition from one platform to another: the Vivendi title is really excellent, huge, spectacular, engaging and full of strong content. On Wii it acquires the merits relating to a renewed control system, not exceptionally precise but effective already after a few games, which makes the whole experience more ~immersive~ but which does not touch the numerous driving phases (good or bad? We won't know never). And it also acquires defects, unfortunately, which are revealed only in the graphics: not very fluid, poorly defined, certainly not above the PS2 version. Hoping that the ~first generation~ of Wii games will soon become a thing of the past... Pros: Huge, immersive and addictive Great sound Brand new control system Cons: PS2 graphics, again Some unfortunate controls Sometimes frustrating Scarface: The World is Yours is available for PC, Xbox, PS2 and Wii. The version subject of this review is the one for Wii. The American dream according to Tony Montana: arriving in the USA from Cuba after a stormy past, making his way into criminal organizations and drug trafficking to become the most powerful person in Miami. But also losing sight of everything that has been achieved, until it is suddenly lost. This is what Oliver Stone wanted to tell us in the 1983 cult movie ~Scarface~, played by the excellent Al Pacino. And Scarface, the video game, doesn't just repeat what happened in the film: it starts from the ending and modifies it, saving the protagonist from being killed by dozens of armed killers. Wounded and stripped of all possessions by the police, Tony Montana must return to the city and take back everything his adversaries have taken from him.", "date": "2007-09-17", "grade": null}