{"name": "Blue Dragon - Recensione", "ref": "https://multiplayer.it/recensioni/blue-dragon-recensione.html", "text": "The beginning of a long journey The plot of the game conforms to the most classic line of the JRPG tradition: the protagonists are a party of teenage youngsters who, starting from their small village, will discover that they have great powers and an enormous mission to complete during the typical journey of training that will transform them into great heroes. In this case, Shu is the typical boy full of energy and vitality, with a positive and daring soul, who lives in the village of Talta. This village is regularly marred by the arrival of a sort of monster, such as ~Land Shark~, which appears in conjunction with a purplish cloud bringing tragedies and destruction. Our hero then decides to try to stop the ominous guest, and with the help of Jiro (his companion in adventures, wise and thoughtful, unlike Shu) manages to partially foil the attack with the intervention of Kluke ( third component of the party, a sensitive and generous girl), in a daring action that will lead them to discover the origin of the mysterious monster and the diabolical mind that maneuvers it and is plotting in the darkness, a certain Nene. To escape the forces of evil, the three will be forced to swallow a sort of luminous sphere, which gives them extraordinary magical powers, transforming their shadows into gigantic spirit guides with the appearance of anthropomorphic animals, capable of fighting and using magical attacks. Later, the boys will meet other adventure companions, with whom they will share the power of the shadows and the same destiny as protagonists of the great mission to stop Nene. As it is easy to understand, the story of the game is a concentrate of clichs and stereotypes taken from the Japanese role-playing tradition, albeit well told through the numerous cut scenes and full motion videos that underline the salient phases of the plot. The plot does not involve major surprises, and the characters appear decidedly flat, when compared to what has been seen in numerous other JRPGs: Toriyama's characterization, however, is able to give that pleasant ~cartoonish~ touch which makes a rather childish plot enjoyable. True to the line The first Japanese-style RPG to land on Xbox 360 (with the exception of Enchanted Arms) could not be more traditionalist: Blue Dragon is an RPG with turn-based combat, structured according to the typical dynamics of the genre, based on the two rails of exploration and combat. Those with experience with the type of game will immediately find themselves at ease, given that this Mistwalker production limits itself to smoothing and perfecting a gameplay well established by decades of videogame activity, without daring any particular new introduction and presenting itself to the relatively fresh Xbox 360 public as an academic product of excellent workmanship, perfectly packaged. During the exploration phases, the party is synthesized by the single figure of Shu, who interacts collectively with NPCs and scenario objects. Exploration takes place in different types of environments: the ~safe~ ones are the cities and villages that dot the game world and intersperse the actual action, where it is possible to meet characters, buy objects, spells and equipment and where unravels much of the plot. The other two environments are the areas where the action takes place, and where the fight is imminent: one is the game map through which all the various locations can be reached, and the other is obviously represented by the dungeons, real receptacles for monsters and treasures, as per tradition. It must be said that the game duly rewards the accurate exploration of the vast game environments, with hidden objects and treasures to be discovered in large quantities, although there are no particular secrets or sub-quests of great interest, still offering the cues just so as not to go mechanically to the next points of interest in the main quest or simply run towards the exit of the dungeon. A note on the latter: as is the case in many other games of the same genre, the dungeons are not structured in a very elaborate way, presenting a simple design and extremely basic puzzles (use the hexagonal prism in the hexagonal hole to access the bridge, for example, complete with a shot that makes it known, as if it weren't already obvious enough, where exactly to use the objects found during the exploration). However, it is clear that the intent of the game is not to offer a challenge based on Zelda-like level design, for example, but rather long, partially labyrinthine levels suitable for leveling the characters. A shadow for a friend The characterizing element of the game is the presence of shadows: sort of guiding spirits of the protagonists, endowed with magical powers. They are godsbeings in the form of anthropomorphic animals (a blue dragon for Shu, a Minotaur for Jiro, a phoenix for Kluke, a tiger for Marumaro and a bat for Zola), capable of fighting and casting spells, which the characters find themselves attached to their shadows after swallowing mysterious magic balls. The fights are entirely focused on the use of these shadows, which could perhaps have represented elements of greater break with tradition, while as they are they are in fact limited to merely replacing the main characters in the action of the fight. Consequently, in the game we will not have to deal with weapons or armor for the protagonists, as in the more orthodox RPGs, but rather with the care of the shadows (the only items that can be equipped are in fact the ~accessories~, such as bracelets, necklaces , earrings and rings, able to modify the characters' stats). This structural streamlining is counterbalanced by an accurate management of the spirits that accompany the fighters, who replace the human protagonists as far as strategic preparation is concerned: for each shadow it is possible to select a class (broadly divided between magical or ~physical~ fighters ), which determines the fighting style and the use of special attacks and abilities, which can be assigned for each shadow in limited quantities within special ~slots~. Classes can be freely assigned to each shadow, and new ones can be unlocked by increasing one's level. By earning experience points we will also be able to increase, in addition to the general level of the character, the ~rank~, ie the level of experience of the shadow in the use of the single class, with the progress of which we will learn new special abilities (~skill~), which allow for new attacks or defensive maneuvers. The procedure, a bit complex to describe, is in truth very flexible and intuitive, masterable within a few hours of play. Basically, the strategic choices aren't many, and are mostly reduced to trying to develop some characters more prone to physical attacks, to be kept on the front line (there is also an elementary management of party formation on the field) and others more inclined to use magic to be placed in the rear. The fact of being able to hire any class for any shadow actually tends to standardize all the characters to one another, leading to a preference for the use of a few fundamental skills for each one, often the same (~magic sword~, ~white magic  and black magic for everyone, for example), in particular by making the aforementioned magic or physical characters perfectly superimposable with each other. Combat System The combat system, in its classicism, is decidedly refined, with slight introductions on the typical basic structure that make it quite enjoyable. The turns are clearly marked between our party and the enemies, with the typical drop-down menus that appear at the time of the attack to calmly decide the best action to take. Physical attacks, spells of various types or any other action that can be performed directly depend on the class chosen for one's shadow and on the skills active at the moment, while obviously the effectiveness of the various blows or types of spells will depend on the characteristics of the enemies we face. The most characteristic element of the combat system is the presence of a bar at the top of the screen, which graphically summarizes the temporal sequence of the various rounds during the fight (something similar to what we saw in Grandia, for example). Spells or special shots require a certain loading time, directly proportional to their resulting power, which can be implemented through the different duration in pressing the attack button. In this way (with a certain sensitivity to the thumb, of course) it is possible both to manage the force impressed in the attack and, above all, to have control over the exact moment in which to launch it, adding a certain strategic depth in the organization of one's turn. Encounters with enemies are not random: both when moving around the map and inside dungeons, enemies are always perfectly visible, and this allows for different approaches to battle. In addition to offering the possibility of simply avoiding the clash, it is possible to attack an enemy from behind by receiving a surprise bonus, or, what is original, to chain several clashes together all together. Pressing the right trigger opens a circle around the party, if more enemies fall within this, it is possible to trigger a fight that includes them all. This can lead to a long fight against various waves of enemies but also to particular situations: in some cases, when in thecircle monsters of various kinds are included, the ~monster fight~ can be triggered, in which we will witness a clash between the same enemies. It is also possible to use some special skills (~field skills~) specific for the phase of approaching enemies, which allow to obtain various immediate effects on monsters without necessarily triggering combat (make them run away, eliminate them directly, immobilize them or, on the contrary, attract them) . An interactive anime? The particular trait of Akira Toriyama is able to properly characterize the world of Blue Dragon, although the general realization is somewhat fluctuating. Some locations and several dungeons are rather anonymous, while other phases of the game demonstrate a marked personality (the monsters and the city of the valley of the murals, for example), but the general impression is that the famous mangaka does not seem particularly inspired in this production . The characters have an extremely cartoonish appearance, obtained through a particular realization, which gives the protagonists, the shadows and the NPCs a somewhat ~plasticky~ look, while integrating perfectly within the surrounding scenario. What the characterization leaves a bit to be desired is the modulation of the expressions, with the faces of the characters that barely reveal any emotion, which in any case remains in line with the poor psychological insight of these, who remain practically faithful to their own stereotypes throughout the adventure, without touching particularly deep emotional chords. In principle, the graphics of the game are still pleasant, with some really well done effects (water and shadows above all). However, there are some problems related to the management of the blurring effects (which sometimes affects the elements in the foreground inappropriately, causing an annoying ~myopia~ effect) and in some cases precisely the shadows, which seem to gradually form a few steps in front of Shu, with a somewhat contrived effect. As for the audio sector, which as previously stated we were able to test in the English version, it stands at good levels, with some notable peaks, where Uematsu's inspiration manages to blend perfectly with the narration of the story and Toriyama's settings, while the English dubbing is well done. For further information on the musical level, refer to the special on Blue Dragon dedicated to the soundtrack. Xbox 360 goals Blue Dragon is an excellent example of the chronic incompatibility of Japanese developers with the system of unlockable achievements designed by Microsoft for Xbox 360. As is often the case with Japanese titles, this too does not enjoy a perfectly understandable logic in assigning the coveted points to add at Gamerscore. In fact, continuing in the story does not unlock practically any recognition, with a large number of achievements from a few points scattered within the sporadic mini-games or some more substantial ones reachable with enormous efforts in leveling the characters. In essence, the already daunting task of simply completing the game will not be accompanied by any particular prize. Need help? If you find yourself in difficulty, or you simply want to be guided through the world of Blue Dragon without fear of getting lost, you can rely on the guide published by Multiplayer.it. The exhaustive paper volume, in Italian, contains the walkthrough, the secrets and the official artwork of the new Mistwalker game. Comment Blue Dragon is a title that seems to focus mainly on the nostalgic recollection of the classic era of Japanese RPGs, identifiable with that of 16-bit consoles. A feature that can work well on the Japanese market, this nostalgic force may not find great supporters among the audience of Western markets, which may not have actually experienced this gaming era. Paradoxically, however, Blue Dragon is also one of two Japanese-style RPGs on Xbox 360, which effectively makes it an original title, and can reawaken interest in such a rare genre on Microsoft consoles. Had it been released on PlayStation 2, it would have easily taken second place to other productions of the genre present on this console, but contextualizing its release in the current Xbox 360 offer must be evaluated as a rarity. This does not mean that the story and the characters are not excessively interesting, that the plot and the game structure itself develop at a decidedly mild pace, but it cannot be said that Blue Dragon is not a good representative of its category, especially in the absence of competitors. Who is able to enjoy the rev", "date": "2007-09-15", "grade": null}