{"name": "Pokmon VerdeFoglia & RossoFuoco", "ref": "https://multiplayer.it/recensioni/pokemon-verdefoglia-rossofuoco-2.html", "text": "A jump into the past Certainly, Nintendo did not want to distort or heavily modify the original structure of Green and Red: it is essentially the same game. At least initially, nothing changes: you are a Pokmon trainer and your task is to capture them all. It begins as in 1995, with the good Professor Oak who allows us to choose our initial monster between Charmander, Bulbasaur and Squirtle, and with our rival, nephew of the scientist, who will put his hands on another, becoming our thorn in the side right from the start. Then, it's all like it used to be: we start from our hometown, on a journey towards adventure. The inhabited centers and the paths are the slavish copy of those seen years ago, the same position as the buildings and fences, the elements of the scenario or the wild areas where we will meet the capturable pokmon. Even the main quest has remained the same: the order of the Gym Leaders that we will have to defeat to obtain the various Medals and proceed in the adventure (they will, in fact, allow us to use particular Pokmon skills to make our way across the Indigo continent) is the same , and old acquaintances like Brock, Misty or Koga are still there, in their gyms, ready to battle us. So nothing seems to have changed, even the arrangement of the 151 Pokmon in the vast playing area is the same and the training of the captured creatures is still of great importance, which translates into the infinite number of fights that we will have to win to increase the level of the our team of monsters. But is that really all? Well, no. Starting with the small guide that can be called up at any time by pressing the backbones or from the summary that opens each new loading of the saves. Elements of Ruby and Sapphire persistently enter the scene, from ~two-on-two~ fights to random trainers ready to fight us again, for example. But it's not so much these elements that make Pokmon LeafGreen and FireRed an ~unprecedented~ experience for those who played the historical versions almost ten years ago: there is a good 25% of the game that is completely new, which allows you to capture pokmon that still don't even existed in Red, Blue and Green and to get their hands on equally elusive monsters, in order to complete the new PokDex which lists 353 Pocket Monsters; in fact, it is possible to connect LeafGreen and FireRed to Pokmon Colosseum or Ruby and Sapphire, and download the pokmon laboriously captured and trained in the past. But this is not the most innovative element, there is also the Wireless Adapter, a completely new system for connecting Game Boy Advances: instead of exploiting the canonical link-cable, Nintendo has included a small radio transmitter in the package via the which it is possible to exchange pokmon with other players, challenge them to a duel or simply chat via a simple chat system. Although to be perfected (the lag is frequent and annoying), the Wireless Adapter is an excellent and really interesting idea, which if exploited properly could become a must in future productions for the large N laptop. Two eras compared In the technical field, VerdeFoglia and RossoFuoco are nothing more than the reworking in Ruby and Sapphire versions of the originals for the monochrome Game Boy. As already mentioned, even the arrangement of the elements in the various locations has remained unchanged: in Celadon City you will find the casino exactly where you left it years ago: a few new paths have been introduced, mostly connected to the unpublished quest. Even the Pokmon have not changed: those that appeared in Ruby and Sapphire have the same sprites, for example. The entire field of visual effects has been recycled from the previous Advance version and, in short, we are faced with an absolutely identical product and for this reason still extremely convincing from a graphic point of view, although certainly it is not about anything that makes you cry to the miracle. As for the sound, all the old themes and jingles present in the originals have been remixed: the result is convincing, and although the Game Boy Advance audio is sadly known for its poor performance, in this case we have a job painstaking that allows us to listen to pleasant and never boring tunes. Comment Pokmon VerdeFoglia and RossoFioco succeed in a difficult task: to excite newcomers to the series and to convince those who have already loved the originals. Without a doubt, we are dealing with a truly brazen commercial operation, but it is the care with which it was carried out that allows us to forgive the big N for the revolutions that all Pokmon-fans are clamoring for and which continues to do not arrive. FireRed and LeafGreenthey are a dive into the past, an opportunity to relive one of the most beautiful videogame adventures ever in a 2004 to which monochromatism is tight. Of course, everything would have been perfect with the return of some of the most convincing elements of Ruby and Sapphire (such as beauty contests and gardening) but the new additional quest does not make us regret the prequel. Finally, the ~new~ generation of Pokmon has an incredible longevity: a main adventure of at least 40 hours, a PokDex to be completed with 353 creatures (truly a titanic undertaking) and the possibilities offered by link play, now enhanced by the Wireless Adapter. A remake in style, albeit with a touch of bitterness. Pros: Well-tested mechanics Appreciable additions to the original game Wireless connection is a big step forward Cons: Obvious commercial operation The revolution is still far away Everyone knows the history of Pokmon by now. How they were born, why they decreed the success of the monochrome Game Boy, how they have become a worldwide multimedia phenomenon. These are facts that every self-respecting gamer has in mind, regardless of whether or not you appreciate Nintendo's pocket monsters. Simply, Pokmon are a slice of videogame history of fundamental importance, in many respects and without knowing them it is not possible to understand, in most cases, the videogame market as it is now. On the other hand, an element that is an integral part of the Pokmon phenomenon is also that of ~recycling~: each new generation of video games dedicated to Pokmon has always introduced new elements into the gameplay of the series, but has also brought with it the characteristics of the prequels , in a continuous deja-vue now all too evident. This brings us right to FireRed and LeafGreen, the second generation of Pokmon for the Game Boy Advance. Bizarre initiative indeed: RossoFuoco and VerdeFoglia are nothing more than the remakes of the historic Red and Green versions (in reality, the Green version was only released in Japan: the Blue version arrived in the West), updated in 2004 according to the technical-playful schemes of Pokmon Ruby and Sapphire. But if in 1995 Pokmon was a fresh and innovative product, capable of decreeing the success of the Nintendo handheld, does it make sense today to propose a remake of a title that adds nothing to those we played last year?", "date": "2004-10-04", "grade": null}