{"name": "Wave Race 64 (Virtual Console) - Recensione", "ref": "https://multiplayer.it/recensioni/wave-race-64-virtual-console-recensione.html", "text": "What was it yesterday Wave Race 64, for critics but also for those who limited themselves to holding the tricorned pad of Nintendo 64, was not so much a sports simulation game. It was, rather, the game of waves that seem real, of the unstable fluidity of the sea surface under the polygonal water scooters, of the small, further step towards the presumed verisimilitude between game and reality promised by technology. After all, at the release of Nintendo 64, the console-late response to the Playstation, more powerful and revolutionary in its technical and playful conditions but also ineffective on a commercial and popular outlet level, the public discourse and the corresponding mythology on videogame representation were dominated by the exaltation for the polygonal paradigm and for the radical transformation of genres in full swing. In this sense Wave Race is fully part of a policy of experimentation by Nintendo tragically stalled in commercial results, but decidedly pioneering and successful on the linguistic level of the medium. Wave Race promised exactly the kind of vertigo that, like the thrill of control in Super Mario 64, had never before been experienced by players; or that thrill that PilotWings borrowed from simulators not yet able to challenge reality in terms of representation and which transported, with its more accessible playful spirit, its analog control and its dives, on a home console. Wave Race, then, was something more: it was the game of nautical intoxication, of routines that always seemed to make the waves a little different, of aquatic vertigo to be opposed by analogue control. What is it today Today Wave Race remains a perfectly balanced ~racing game~, with its simple yet highly refined control, well balanced between an intent of pure entertainment and one of simulation. But Wave Race is above all and intimately, in the same assumptions of the code, a challenge to the waves: in each track it is their physics that requires the right thumb play on the analog, which must be different depending on whether it is a stormy sea near an islet or the peaceful expanse of water near the port metropolis, waves that risk making you lose control without calibrating the inclination of the hull or slight ripples that allow you to go hard-nosed. Even the very few polygons follow this naturalistic illusion, appearing in a dark blue veined with white foam or reddened by elementary textures that provide the illusion of a stylized sunset, almost transparent and eager to make us see pleasant hints of marine fauna or impenetrable by the gaze. Wave Race is thus still today a very pleasant aesthetic experience, even if the waves are only apparently unpredictable as in nature and the expert player soon becomes able to predict their patterns and developments to exploit them to their own advantage. What is it today After all, physics presents a type of interaction whose playful-acrobatic possibilities offered are never disconnected from the correct proceeding on the track. Whether it is a question of tilting slightly to respond to a wave or catching the moment when this best allows us to use a trampoline, in fact, the relationship between track and medium, between thumb and player, is always the cross and delight of the experience . The Wave Race game has a multifaceted way of being played, rightly exploited in its dimensions by a presentation that offers a series of game modes capable of enhancing its souls (Time Trial, Stunt Mode, Tournament, two-player Multiplayer above all). Wave Race 64 is a small, great experience that has both the flavor of a memory, of a little forgotten thrill, but also that of a solid entertainment system. And even if its sequel for the GameCube is substantially unchanged in spirit, supported by a remarkable technological advance, this has not been matched by an adequate ~naturalistic~ effort and, as has been rightly pointed out, in comparison with the few polygons than its predecessor, its sea simply appears ~less liquid~. The polygonal waves that amazed players in the 1990s are back on Wii together with Wave Race, a small Nintendo experiment which, despite having an official sequel, is still worth dusting off thanks to the Virtual Console catalog (at a cost of 1000 Wii Points).", "date": "2007-09-07", "grade": null}