{"name": "Space Giraffe - Recensione", "ref": "https://multiplayer.it/recensioni/space-giraffe-recensione.html", "text": "Although the game's tutorial states the exact opposite, Space Giraffe is decidedly similar to Tempest: as in the latter, in fact, the user must move horizontally what would appear to be a spaceship, positioned at the base of a grid that composes the playing area. From the opposite side of this structure come a variety of threats, such as enemies, projectiles, and even flowers that must be quickly removed in order to preserve the length of the grid. All using a directional shot entrusted to the right analog stick, similar to what was seen in Geometry Wars. If what has just been described seems confusing to you, know that playing Space Giraffe the situation probably wouldn't improve: Jeff Minter's latest birth is in fact a real psychedelic nonsense, in which the only possible solution is to act instinctively. As we mentioned at the beginning, the title does include a tutorial section, but so approximate as to succeed in carrying out a task opposite to the designated one, confusing the player's ideas instead of clarifying them. However, there are two main features of Space Giraffe, namely the Power Zone and the Jump Pods. The first is obtained by reaching the maximum extension of the game grid (to be achieved by destroying enemies and shooting the aforementioned flowers), and allows you to increase your score and ~shoulder~ all opponents who reach the level where the own ship. The Jump Pods, on the other hand, are unlocked following a sufficient accumulation of power ups, and thanks to them it is possible to momentarily detach from the grid and wipe out all the enemies that threaten the base of the structure, here too with a considerable benefit of the score. A simple smart bomb available for each of the 100 available levels completes the picture of this Space Giraffe, a bizarre but certainly not revolutionary shooter and which unfortunately suffers seriously from the consequences of a literally hallucinating graphic creation. The plethora of acid colors, light effects, explosions and geometric shapes that crowd the screen not only leads the gameplay to be extremely confusing (often making threats indistinguishable from bonuses or causing frequent deaths caused by objects lost in the chaos just described), but it is even annoying to the eyes. Not to mention the eerie silhouette of J Allard's face constantly visible in the background... Comment Space Giraffe could certainly have value as a psychedelic work of art, but it has very little value as a video game: hardly playable both for incredibly confusing graphics and for gameplay poorly explained by the inefficient tutorial, the work of Jeff Minter it is unfortunately a bitter disappointment: also because, after all, it is still the umpteenth clone of Tempest. Pros 100 game levels Graphically bizarre... Cons ...but also confusing and annoying Gameplay rather basic Frustrating and not very satisfying Goals 360 Space Giraffe's objectives are not many, but a good part of them require considerable dedication to be achieved: we therefore pass from requests to maintain a certain status for a certain number of levels up to the titanic undertaking of completing the game all in one breath. Jeff Minter is undoubtedly one of the ~grand old men~ of the gaming business, author of several games for the Commodore 64, as well as father of the historic coin-op Tempest: and after having dabbled for years in the field of ~light synth~ graphics (a example is what you see on Xbox 360 when you play a music CD), the good Jeff is back to video games with this bizarre Space Giraffe, available on Xbox Live Arcade.", "date": "2007-09-07", "grade": null}