{"name": "Naval Battle: Mission Commander", "ref": "https://multiplayer.it/recensioni/naval-battle-mission-commander.html", "text": "Card games and board games have monopolized the playful applications of mobile phones since the first generations, when the technical possibilities offered by modern terminals certainly did not exist. There has also been a revamp, taking classic games and adding new features as well as a captivating aesthetic. And that's exactly what Gameloft has done with this Naval Battle: Mission Commander. The game, in fact, is nothing more than the revival of the classic naval battle, which for the occasion has been made much more engaging thanks to a whole series of modifications. Forget about a dull and dull grid: here you will have incredibly detailed isometric graphics, with ships rendered in great detail and a large number of animated elements on the screen. The starting menu allows us to participate in a quick battle or select one of the various game modes present. The main one is the Campaign, which allows us to select a commander among the four available and start a long review of stages (eighteen) that share the same central objective (the destruction of all enemy ships) but which vary in secondary objectives , in the number of our ships and the opponent's as well as in the elements of the scenario, which very often can turn the tide of battle. The development of each stage, as in the classic naval battle, works through rounds in which a square on the opposing table is selected and fired upon, with the possibility of hitting an enemy ship or not. To make things livelier there is an energy bar that each commander can fill up more or less quickly depending on the hits landed. When it is full, the bar allows us to carry out a special attack among those that our ships make available to us: a simple reconnaissance (three planes reveal the contents of as many opponent's boxes), the launch of a torpedo (which covers a complete line of squares until hitting the target, if any), the production of a whirlwind (which hits nine adjacent squares, stopping when it finds something), a carpet attack, the launch of magnetic or depth mines, etc. etc. The sequence of attacks and counterattacks, further enlivened by the presence of bonuses and upgrades of various types (which must be hit to be activated), goes on until one of the two fleets is completely sunk. The technical realization of Naval Battle: Mission Commander surprises from several points of view. Firstly, the graphics boast a truly exceptional level of detail when compared to the resolution of the screen. The ships are drawn very well and there are several animated elements on the screen, to which all the special attacks and related animated sequences must be added. In all of this, the only (big?) problem lies in the fact that the game is quite demanding in terms of computing power, and if your mobile phone isn't at the top, you could run into heavy slowdowns in the more advanced stages, i.e. where there are more sprites moving. The sound sector defends itself well, with some catchy music and some good effects. As far as the control system is concerned, everything is very simple: move the cursor on the table with the joystick (or with the relative number keys), fire with FIRE (or 5) and open the special attacks menu with the 0 key. Naval Battle also offers us an interesting multiplayer mode, both in two players on the same phone and via bluetooth on two different terminals. PRO Very neat graphics Fun and engaging Very long-lived AGAINST Sometimes it slows down a lot AI not always up to par", "date": "2007-09-03", "grade": "S.V."}