{"name": "Luminous Arc - Recensione", "ref": "https://multiplayer.it/recensioni/luminous-arc-recensione.html", "text": "Sacred and profane The plot of Luminous Arc is decidedly original: set in a typically Japanese fantasy world, Luminous Arc has as its protagonist Alph, a soldier of the Fatal Hounds, a group of young warriors trained in a kind of orphanage from an early age to become witch hunters on behalf of the armed wing of the Church. The world of Alph was in fact shocked by a mythical cataclysm caused by the war between the witches and the dragons, held back only by the direct intervention of the god Luminous, who after having sealed the witches and destroyed all the dragons entrusted the future of the world to his Church. The task of the Fatal Hounds is to annihilate the witches who still roam the world, their motto ~Protect the Light, condemn the Darkness~. However, things get complicated right away when the group discovers that not all witches are as bad as they have always been taught, and that their history is not exactly what they know. And when Alph and his brother Theo discover that they are not truly human, and that the Church is not exactly on the right path as they believed, the Fatal Hounds can only team up with the good witches to fight the evil ones and the Church itself, in a whirlwind of narrative evolutions and twists that will leave even the most experienced fans of the genre pleasantly surprised. After the beautiful and original Riviera for Game Boy Advance, Atlus once again touches on heresy by touching on topics such as divinity and the Church, playing with the darkest and most ambiguous sides, emphasizing how appearances can always be deceiving. The highlight of Luminous Arc, however, is the incredible cast: the many characters who will make their appearance during the adventure are full of personality and simply adorable. From the stubborn Alph to the tender Cecille, passing through the maniacal Nikolai and the grumpy Lucia, there isn't a character who doesn't shine with his jokes or an original characterization or bordering on caricature: moreover, as in the Riviera, the dialogues between the various characters (and many, optional, allow you to get to know our heroes and their relationships better) that elicit wide smiles and loud laughter between gags and jokes. It is true that hostility to intransigent religion is now an all too recurring - and we would say tiring - theme in Japanese adventure video games, but in Luminous Arc the plot is so delicate and fun that it never borders on the banal or the predictable . Tactically yours Luminous Arc draws heavily on the legacy left to it by the most famous turn-based strategy games of the last generation, in particular there are many affinities with Final Fantasy Tactics, combined with the ideas that Atlus has proposed in recent years with its games, refined and adapted in this new context. However, it is striking the possibility of advancing in the plot or stopping to boost one's characters a little when one wants, so that the player never finds himself dominated by the narrative sequences, which manifest themselves with the classic dialogues between the characters, represented by the relative artwork that stands out against well-kept two-dimensional backgrounds. And as in Final Fantasy Tactics, the world and the cities are not completely explorable: the geographical map shows points, corresponding to the various locations, which can be cities (where it is possible to replenish items and equipment or talk to the villagers through some options ) or battle zones passing through which there is a possibility of being attacked by monsters. Naturally, the Luminous Arc battle system is essentially its own gameplay, and we can say that Atlus, without engaging in the development of abstruse modes or options, has managed to offer a simple but fun and rewarding game system. Unlike many other games of the genre, such as the aforementioned Final Fantasy Tactics or the beautiful Tactics Ogre (Game Boy Advance), in Luminous Arc it is not possible to create or recruit new and anonymous characters, nor manage their classes: each cast member has certain weapons and magic that make him unique. If on the one hand this expedient limits the player's customization possibilities, it must be said that on the other hand it implies positive notes: firstly, the difficulty is more balanced (and Luminous Arc is not at all as difficult as Fire Emblem, for name one), and furthermore the various characters have decidedly more personality, when their spells are linked to their characterization or to the weapons they equip by basic design. And therefore, Alph fights with the sword while his special attacks are based on the use of firearms (he is in fact a ~Rifleman~) while Cecille the cleric is specialized in the use of healing magic;Nikolai is a long-ranged unit: with his crossbow and its attached anomaly attacks he is a good support in attack, but his enhancement spells are much more useful. And again, the various witches who will join the party each have spells linked to different elements: in a volcanic area where the enemies are similar to the element of fire, it is not very sensible to use Vanessa's burning spells, while Mel's aquatic ones they are much more effective. [CC]It is not possible to create or recruit new characters, nor to choose their classes: each member of the cast has certain weapons and spells that make him unique[CC] Tactically yours Therefore, before each fight, the player can choose up to eight characters from his small army (which will eventually be made up of fifteen heroes) who he will control via stylus or directional cross in areas divided into classic blocks, with an isometric view and all the ambaradan that characterizes this genre of games: natural elements linked to the terrain, gradients, obstacles and singing company. And so, attacking from above increases damage as well as attacking from behind, swampy areas restrict the movement of slower units, which act less often than faster units, et cetera, nothing new under the sun. The level-up of the various characters is also a deeply tactical element, given that a different amount of points is acquired depending on the actions performed: the weakest units, generally concentrated on healing the characters, with a little strategy can finish off enemies to get more experience points than a simple cure. It is up to the player to decide how and when to exploit these possibilities. Luminous Arc also offers a great variety of skills and spells to face the fights, which is a slight flaw: there are in fact too many offensive possibilities. In addition to basic attacks, our heroes have Skills (physical attacks or stat modifiers), Magic (healing, enhancement and attack), Flash Drive and Synergy. The Flash Drives, borrowed directly from Riviera, are linked to a bar that fills up from turn to turn: each character has three Flash Drives (which are obtained by passing levels or advancing in the plot) and are essentially super-attacks devastating and spectacular. Synergies use the same bar as Flash Drives, but require at least two nearby characters: they are in fact extremely powerful and pyrotechnic combined super-attacks. Beyond the amusing, albeit simple, combat system, Luminous Arc also offers some nice playful-narrative interludes: after each fight it is possible to answer the question of a certain member of the group, in an attempt to increase his affinity with Alph, who will bring to the acquisition of items or bonuses. Furthermore, the now very abused object creation system could not be missing: after obtaining particular minerals it is possible to have them ~recognized~ in order to then be able to apply them to certain weapons, enhancing them or transforming them into better objects. Class is not water Right from the introduction, completely cartoony and complete with a song in Japanese (Brilliant World, by Kaori Oda), we realize that Atlus has placed particular care in the technical implementation of Luminous Arc. Graphically, the new portable effort of the Japanese company does not make your eyes roll (not after admiring the 3D of Final Fantasy III and the next IV, of course) but it is certainly a top quality product at least in the field of two-dimensional graphics. The sprites are large and well animated, detailed and colorful: each player unit is unique and there is not the slightest hint of monotony, thanks also to the variety of enemies that we will meet, including goblins, chimeras, bandits and other amenities. Let's turn up our noses a bit for the special effects of spells and Skills, which all tend to look a bit alike at least for a good half of the game, remaining pleasant but certainly not spectacular or surprising. The detail and aesthetic quality of the various locations in which you fight are therefore striking, often rich in details or animations and quite diversified, but the impossibility of rotating them on a vertical axis remains a decidedly flaw: in practice, often a square can be difficult to be selected because, perhaps, each adjacent box is occupied by a certain sprite, making the pressure on the touch screen a little frustrating, fortunately followed by a request for confirmation on the action just performed. The excellent two-dimensional graphics during the combat sessions are combined with the enormous amount of artwork related to characters and backgrounds, curatedimmeasurable in design and colours: you can breathe an all-Japanese air, a decidedly cartoonish style that winks at the most famous comics productions of the Rising Sun, without however falling back into the bland or predictable. However, the audio department of the Luminous Arc cartridge is surprising, which unexpectedly boasts a quantity of digitized speech never seen before on Nintendo DS: although not all the dialogues or sentences are vocalized, the most crucial moments of the narration (let's say a good 70%) are excellently dubbed, showing excellent sharpness and an apt choice of actors (Nikolai and Pollon are very good). Even the fights are far from silent, with various opening and closing bars for each character, moans of pain and screams of assault, accompanied by excellent quality tunes, which are never annoying but perhaps sometimes repetitive in battles that go on for too long. Luminous Arc shows a technical simplicity counterbalanced by a truly exemplary attention to detail, and in short, you play with the pleasure of being faced with a product that, despite the small console on which it runs and the traditional 2D, demonstrates a truly commendable commitment from Atlus. Comment Luminous Arc is the surprise of the season in portable RPG territory, but it's not without its flaws: beyond the non-rotatable maps, the flaw of the Atlus product is that it doesn't offer players the possibilities and freedom already present in older titles such as Tactics Ogre, Final Fantasy Tactics Advance or its esteemed progenitor revived for PSP. In reality, more than a lack, it is a precise choice of design in a product that skilfully mixes the flavors of a turn-based strategy and a classic linear JRPG supported by a plot of considerable depth, embellished with unique characters both in terms of characterization and purely playful possibilities. The gameplay is not surprising and there are no particular innovations, but everything that Luminous Arc offers in the approximately 25 hours of the main-quest is decidedly of excellent quality. And once you have completed the main adventure, explored the secret maps and forged the most powerful items, you can always connect the DS to the Internet and challenge other players via the pleasant, if simple, multiplayer mode. Pros Compelling story and intriguing protagonists Simple but fun battle-system Technically excellent, especially the audio Cons Isometric maps cannot be rotated Difficulty fluctuating Main-quest rather short The DS toy library doesn't offer much choice for those who love turn-based strategy games, the main exponent of which is certainly the by now legendary Final Fantasy Tactics for PSOne, just recently re-proposed on PSP. Final Fantasy Tactics A2, sequel to the title of the same name for Game Boy Advance, is arriving in a few months, and in June Hoshigami Remix also reached the shelves, porting a fairly well-made title for PSOne from which it inherited the same strengths and weaknesses . And the softco right now seem to be starting to take an interest in real-time strategy, as demonstrated by Square Enix's Heroes of Mana and Final Fantasy XII Revenant Wings. In short, there is a lack of a slightly more classic but not retro title (like Hoshigami) capable of enthralling players and addicting them as only this genre can do when two main conditions are met: the game must be fun and the plot must be exciting. Atlus, which usually stands out when it comes to RPGs, thought it could fill this hole with Luminous Arc, so it rolled up its sleeves. And honestly we already want a sequel.", "date": "2007-08-30", "grade": null}