{"name": "BioShock - Recensione", "ref": "https://multiplayer.it/recensioni/bioshock-recensione.html", "text": "It is 1960, the plane you are traveling on crashes and crashes in an unspecified area of the Atlantic Ocean. Emerging from the icy waters you find yourself in front of a chilling scene: around you there are only burning wreckage, and no trace of other survivors. Not far from the accident area you see a strange tower that stands out black in the night, illuminated only by the full moon. Without asking yourself too many questions, you can swim to it: after all, your life is still in serious danger. The inside of the building is even more strange and flashy, with luxurious and elegant furnishings, full of statues, bas-reliefs and strange propaganda slogans. But now is not the time to waste time. Downstairs you see a kind of spherical capsule, which seems to be the only way out of the tower. You enter and operate the lever, but only to realize that the capsule, or rather the ~bathysphere~, is not used to leave, but to descend into the depths of the sea, to descend towards an incredible underwater metropolis which, despite majestically standing in front of you, you still struggle to believe it could be real. Welcome to Rapture. Utopia for masses Rapture was born on the basis of a utopia: to secretly gather a community of enlightened minds in a place where intellectually inferior men (often called ~parasites~) could not curb their creativity or benefit from their labors. An oasis where scientists and artists could give life to their creations without being bound by censorship or moral principles. But the billionaire Andrew Ryan, the man behind the whole mammoth project, hadn't taken into account that many of the scientists he surrounded himself with were even crazier than him. Crazy like their main discovery: a genetic remapping and enhancement system based on a substance renamed Adam, which allows men to become stronger and acquire superhuman powers but which at the same time creates addiction and leads to a slow but inexorable decay of 'body. And the Adam, which soon became a bargaining chip, is at the origin of the strongest quarrels on the upper floors of Rapture, which soon degenerate into a sort of chain reaction. All that remains of the great utopia is a ghost town in macabre decay, full of mutants willing to kill anyone for a small dose of the controversial substance. And the Adam, which soon became a bargaining chip, is at the origin of the strongest disputes on the upper floors of Rapture But then comes our heroic Jack (that's the name of the protagonist), destined to change things. And it is from here that BioShock begins, the first-person shooter of those Irrational Games (now 2K Boston/2K Australia) which first in 1994 and then in 1999 astonished the specialized press with two small pearls called System Shock and System Shock 2, which BioShock should inherit, confirming itself as an FPS with a great exploration and adventure component heavily contaminated by RPG elements. The plot written by the developers is fairly compelling, and is articulated and full of twists and turns. Jack learns of past events and important information both from various audio diaries recorded on tape and scattered everywhere and from a portable radio, through which he is contacted by various characters, primarily Atlas, his personal Virgil who will try to escort him out of this underwater hell. Even the characters are well characterized, even though they always turn, in one way or another, towards some form of madness or alienation (Dr. Steinmen and Sander Cohen are fantastic). BioShocked The first weapon that is made available to make your way into Rapture is a simple but effective wrench, which represents only the tip of a real iceberg. The arsenal of conventional weapons is quite varied, ranging from the usual machine guns and shotguns to grenade launchers, crossbows and flamethrowers. Each weapon can be loaded with three different types of projectile: in the case of the rifle we have normal, explosive and electrified buckshot; for the flamethrower we have napalm, liquid nitrogen and electric gel, and so on. But the offensive tools that our hero can use also and above all include plasmids, particular combinations of Adam capable of modifying the genetic code by conferring particular powers, ranging from the ability to unleash fire from his fingers to that of launching a powerful electric discharge. , from being able to freeze enemies to moving objects using telekinesis. To use these powers it is necessary to consume Eve, the counterpart of the ~mana~ of the RPGs, which, just like in the case of medical kits, can be found around the levels or in vending machinesthe. In addition to Plasmids, there are tonics, which share the same basic principle but work in a different way: each tonic, whether physical, combat, or technological, if equipped, guarantees permanent effects, like the classic magical objects seen in role. very interesting and vaguely RPG-istic is the camera, with which it is possible to take pictures of enemies BioShocked There's the tonic that increases movement speed, the one that releases an electric shock on an enemy that hits us, or the one that makes you more resistant to frost-based attacks, and so on. Initially, the slots available to equip plasmids and tonics are only two per category, but thanks to the recovered Adam, you can buy additional slots and skills on vending machines called ~Gatherer's Garden~. You got it right: strange to say, the whole RPG part of BioShock essentially develops around the use of various types of vending machines, where ammunition, objects, medical and Eve kits and all the other trinkets needed to survive can be purchased. The annoying thing is the inventory management, absolutely unfortunate: the only way to see which tonics are equipped or which other objects have been placed in the inventory is to access one of these machines, not being able to call up a special menu during normal game phases. Another very interesting and vaguely RPG-istic element is given by the camera, with which it is possible to take pictures of enemies. Research points will be awarded for each successful shot, which will accumulate to earn bonuses against those particular enemies or unlock new, very useful tonics. Big Daddy and his brothers BioShock therefore offers a remarkable arsenal of weapons and a fairly deep level of customization of powers, which serve to make the clashes unique experiences in themselves. The splicers - this is how the genetically modified inhabitants of Rapture are called - can be faced in a thousand ways: in addition to the conventional methods, we can decide to block an enemy with an electric discharge and then shoot him or attack him melee (too bad there isn't a parades), set it on fire and let it burn (or electrify the water when the unfortunate person jumps into it to extinguish himself), have him attacked by an angry swarm of wasps, throw a rubbish bin at him with telekinesis, have robots attack him guard. Yes, because one of the most interesting features is being able to circumvent, or rather tamper with, any electronic device, whether it's a vending machine, a watchtower, a combination lock or a safe. While the advantages of bypassing a distributor are that you can buy a greater number of objects at a lower price, watchtowers and cameras are much more interesting: the former shoot anyone who attacks our alter-ego on sight, the latter no longer do raise the alarm by seeing us, but our enemies. Putting two and two together, it is easy to understand how it is possible to organize real defensive strategies or ambushes, as well as bypass a helicopter-bot and carry it around Rapture with us. The circumvention can be done automatically with the appropriate tool or manually, by tackling a nice specific puzzle-game. Big Daddy and his brothers The most formidable enemies, and paradoxically the least hostile until they are attacked directly, are the already famous Big Daddies, strange beings of powerful size with an armor derived from diving suits. There are two types of Big Daddy, namely the bouncer, the one with a giant drill instead of a right arm, and the Rosie, armed with proximity grenades and nail guns. The clashes with the Big Daddies require much more effort than those with the normal splicers, and often lead to an abuse of medkits and ammunition, but they are also the most fun that can be found in the game (even if to be honest with certain particular combinations of weapons and plasmids the fight becomes much easier). The purpose of these grotesque creatures is to act as bodyguards to the so-called ~little sisters~, aberrant creations of Dr. Tanembaum on behalf of Andrew Ryan, used to recover Adam from corpses. These subspecies of zombies are real key figures of BioShock. Once they were real girls, and of their previous nature they still retain some behaviors; it is also for this reason that the player is faced with a hard choice when it comes time to face them: kill them and recover a large amount of very useful Adam or free them,getting half of the precious substance and a ~gift~ from Dr. Tanenbaum (read: money, ammo, medkits and, above all, interesting tonics)? The fate that will be reserved for the little sisters will influence the evolution of the plot of the game, as well as the ending itself. From a gameplay point of view, BioShock's biggest design flaw, which is not accidental, but expressly wanted by the programmers to recreate the immediate respawn mechanics seen in many multiplayer games in a single player game, is related to the system it manages death and rescues. There are no checkpoints, and you can save at will, but dying you do not face any type of penalty: you do not lose ammunition, medkits, information, weapons or powers, but, above all, the energy of the enemies remains that of the moment immediately before our death. This means that while we ~resurrect~ from a life chamber we regenerate, they do not regain life force, and can be killed much more easily on the next attempt. This takes away a lot of pathos, a lot of suspense, it takes away that sense of anxiety and that fear of dying which is the salt of the earth in many games of the genre. Are they beating me up? Why run away: even if I die, nothing changes. Who will be around that corner? Well, let's see, so much even if it kills me... In short, a sort of unfortunate splash of paint on the canvas of a masterpiece, this pseudo-immortality does much less damage than expected, and integrates fairly well with the mechanics of the game which evidently it was born around this concept. Big Daddy and his brothers Otherwise, BioShock is huge, solid, full of touches of class. Mechanically it's nothing particularly original, and in the end it's limited to the usual ~go here and do this~, ~kill this~, ~find these objects~, but it's a living world whose various zones can be revisit at will even after completing all objectives, where everywhere, even in already ~cleared~ rooms, a new Splicer can be encountered strolling around. One of the most notable things that can happen is this: bypass a guard camera in a corridor connecting two areas, and let some time pass; on the return it can happen to find the camera on the ground, destroyed, and two splicers who were placing a new turret right nearby. Simply fantastic. Played properly, i.e. not believing oneself to be John Rambo in the middle of the Vietnamese forest, but enjoying the experience at the right pace, admiring the scenarios, listening to the diaries and so on, BioShock is a very long-lived title and, above all if tackled on a difficult level , can guarantee a duration well over 20 hours. Different endings based on the behavior held with the little sisters and ad hoc unlockable achievements also guarantee a decent replay value. Graphics and sound One of the main reasons BioShock will be remembered for years to come is the artistic aspect. The great merit of the developers is that they have managed to recreate a world apart, believable and extraordinarily fascinating. The design of the underwater metropolis of Rapture, which seems to symbolize a real challenge of man to the forces of nature, seems to have come out of one of those visionary futuristic films of the 50s, and manages to superbly mix highly advanced technologies with a sublime Art Deco style. In its magnificent retro decadence, Rapture seems to have its own personality, a dark aura of charm and mystery that traps the player forcing him not to be in a hurry, to read that billboard that he would have snubbed in any other game, to admire every detail of the environments, dark and visionary like Andrew Ryan's utopia. Every time you arrive in a new level you will be ready to bet that the scenario will not be able to compete with what has already been seen previously, and every time you will be wrong. It is also surprising how monotony can be avoided: despite taking place within the same city and having environments linked by the same denominator of decadence, BioShock always manages to renew itself and offer acute and interesting variations on the theme: Arcadia, with its luxuriant vegetation, or the delirious Fort Frolic are emblematic examples. Enemies also play their part, from the mighty and seemingly clumsy Big Daddies to the splicers, no longer so human beings with sinister movements and a disturbing appearance. Of course, in the case of the latter, a little more variety in design would not have minded. every time you arrive in a new level you will be ready to bet that the scenario will not be able to compete with what has already been seen previously, and every time you will be wrong gr", "date": "2007-08-29", "grade": null}