{"name": "Stuntman Ignition", "ref": "https://multiplayer.it/recensioni/stuntman-ignition.html", "text": "As many know, Stuntman is an intellectual property of Reflections (the same as Destruction Derby and Driver), originally released on PlayStation 2 and with a sequel in the works for current consoles. Which, given the market trend, could not fail to be accompanied by a mobile game, this time fortunately with a well-defined personality. Stuntman Ignition is a sort of ~acrobatic racing game~, in which it is necessary to take on the role of a stunt driver and perform a series of evolutions commanded by the director within different stages: 27, to be precise, divided equally into three imaginary films with rather improbable titles. Everything is resolved in two-dimensional scenarios marked by checkpoints indicating which move to make at a given point of the path (destroy or avoid an obstacle, jump backwards and so on): however, care must be taken not only to hit all the objectives the cancellation of the scene, but also to carry out one's task in a hurry so as not to leave the frame. To enrich the dish there are also silver stars to collect to increase the score and bonuses that reward improvisation or the execution of particularly successful stunts. At the end of each internship, with good results, gold stars are obtained which must be accumulated in order to guarantee a positive evaluation of the critics for the entire film. Stuntman Ignition is a decidedly original and extremely engaging title: although the trial and error mechanics may annoy some, achieving perfection in all the scenes is a goal as coveted as it is challenging to achieve. The Universomo product can also count on a fair variety of landscapes and situations, as well as on a simple and intuitive control system. In addition to the main career mode, the game features a section dedicated to free play and even a multiplayer component: the so-called Co-Star Mode, in which you take turns on a scenario in search of the best score. Graphically, then, one can't really complain: even if the backdrops are a bit bare and the surrounding elements are always the same, Stuntman Ignition offers excellent fluidity, two tasty layers of parallax and accurate physical routines of the car, the all functional to the gameplay. A couple of pleasant dynamic music worthily conclude the picture of an absolutely valuable product. PRO Original concept Fun and addictive gameplay Quite long lasting and demanding AGAINST Pure trial and error Little else beyond hi-score research", "date": "2007-08-29", "grade": "S.V."}