{"name": "Guitar Legend: Get on Stage!", "ref": "https://multiplayer.it/recensioni/guitar-legend-get-on-stage.html", "text": "With the advent of rhythm games, it seems that no video game genre has escaped the call of mobile phones. On the other hand, it is natural that slowly, with the gradual strengthening of the terminals, it is possible to play on the screen of our phone even games that previously seemed impossible to even consider in the context of wireless gaming. In this case, Gameloft draws heavily on the successful Guitar Hero series to create a product that can boast the same strengths even if it is smaller in every respect. The structure of Guitar Legend: Get on Stage! it's simple: you choose a character from those available, select a song and go on stage to ~play~ it. As in any rhythm game, there's actually very little to play, mostly you have to press certain buttons at the right time, presumably in time with the music. On mobile, all this translates into pressing a few buttons on the number pad when, on the guitar fretboard, the notes arrive at our ~picks~. The more time you press the keys, the higher the score will be, which will translate into cash gain, the acquisition of extra items and the filling of a bar which, once full, will make us perform a sort of combo musical. Obviously, Guitar Legend has a series of very recognizable international songs, which are presented in an increasingly difficult way to reach a total of fifty-one levels for just eight songs. In analyzing the technical characteristics of a game like this, it is clear that the sound, otherwise relegated to secondary roles, is taken into serious consideration. And it is unfortunately precisely in this area that Guitar Legend gives some problems: eight songs are not very many, first of all, and their MIDI quality is not exceptional. Also, and this is the most annoying thing, when you ~play~ by pressing a key at the right moment, the song stops for an instant. This is clearly a bug, which occurred on two different terminals (SonyEricsson W600i and W810i) and which could undermine the playability of this product on some phones. As far as the graphics are concerned, however, there is absolutely nothing to complain about: the characters are well drawn and the developers have found the best solutions to represent the guitar fretboard and the sound of the notes. PRO Good graphics Fifty-one internships Eight international songs AGAINST Sound glitches on some cell phones MIDI quality not great Repetitive", "date": "2007-08-20", "grade": "S.V."}