{"name": "Pacific Storm - Recensione", "ref": "https://multiplayer.it/recensioni/pacific-storm-recensione.html", "text": "Pacific ... not so much! PS takes place between 1940 and 1948, initially a silent peace reigns in the Pacific Ocean even if the drums of war from afar begin to make their echo heard. Inside the game we find, in addition to the possibility of clashing with other players via local network or the Internet, the following single game modes: historical campaign (related to real events), free campaign, tactical missions (famous and not famous battles and missions , with particular objectives) and a completely free mode, in which to invent the conflict in which to take part at will. The game mechanics of PS are quite complex, it is no coincidence that there is a very full-bodied tutorial, one of the longest in circulation, through which to learn all the secrets of the various phases of the game, in which we still have the possibility to activate the management automatic: for example, in the various bases it is possible to let the CPU manage the requests for materials, thus relieving part of our responsibilities. In the strategic part of the game, a map of the Pacific appears, on which various areas of the ocean are displayed, together with the bases and ships participating in the conflict. This is the phase in which to manage the human resources at our disposal, divided between pilots, sailors, soldiers and engineers, to be assigned to the means of competence and, if necessary, transported from one base to another for the creation of new deployments. The engineers have the task of dealing with the construction and maintenance of the base buildings: the more there are, the more the buildings will be completed in less time. The construction of ships and buildings requires money, aluminum, iron and diesel: these are the raw materials of PS, without which it is not possible to expand one's army; to obtain the materials it is therefore necessary to build the industrial building first, and then to devote oneself to the construction of warehouses, barracks and everything that can concern life inside a military base. It will then also be necessary to deal with another aspect: the technological research. Without it, in fact, our means will not be at the forefront and, over time, will find greater difficulties against the enemy, more in step with the times. Pacific ... not so much! The tactical mode is merged with the simulation one: having abandoned the map, in fact, our lineup appears within the area in which the battle takes place, to which we can issue orders (for this purpose it is also possible to pause the game) and hold all under control from above, or immerse yourself in the conflict by driving a plane, a submarine or a ship. The funniest means, but also the most difficult given the nature of the controls (the use of the joypad is recommended), turns out to be the plane, with which it will be necessary to do a lot of practice before acquiring complete dexterity. What is the weather like? PS battles are also influenced by atmospheric agents, depending on which it becomes mandatory to pay attention to perturbations that could require a change in our tactical plans. The weather conditions are rendered quite well by the game engine, which although dating back to several months ago behaves quite honestly, both in terms of performance and detail, taking into account the fact that within the game there are 24 classes of ships, 36 types of aircraft, 20 types of bombs and rockets, including guided ones, one of the most attractive gameplay hoots of PS. A little less satisfying is the sound, attributable to a soundtrack all in all quite suitable for the purpose but not very varied and therefore, in the long run, repetitive. System requirements Minimum Requirements: Operating system: Windows 2000/XP Processor: Intel Pentium 4 at 1700 MHz or similar RAM: 512 Mb Video card: 3D accelerated, DirectX 9 compatible, with at least 64 Mb of RAM (NVIDIA GeForce FX 5200 or ATI Radeon 9200) Free Hard Disk Space: 3 GB Recommended Requirements: Processor: Intel Pentium 4 at 2400 MHz or similar RAM: 768 Mb or more Video Card: 3D accelerated, DirectX 9 compatible, with at least 128 Mb of RAM (NVIDIA GeForce FX5600 or ATI Radeon or higher models) Test Configuration: Processor: Intel Centrino Duo T2300 RAM: 1Gb Video Card: ATI Mobility Radeon X1600 256Mb Comment Had it been released before the progenitor of the Total War series, PS would certainly have been appreciated more compared to the times we are in, where Creative Assembly's strategists are the masters within the market and, consequently, constitute a term of comparison for anyone who wants to enter this sector of the gaming industry. While not really offering anything innovative, PS still has a very deep game structure, which will make all the strategic-management maniacs happy, while the others will risk getting lost in numbers and names, with a fairly high learning curve: it is true that it is possible to leave management almost completely CPU intensive, but especially in peacetime this is tantamount to spectating. Driving the means of war is not exactly the easiest, given that among the many keys to press on the keyboard there is often the risk of making a mess: the use of the joypad is only partially met. However, the merit of the Russian developers is that of having created a strategic-tactical-simulation hybrid in a historical context in which, strangely, this type of game was missing before: a very interesting product for fans of the genre. Pro Historical fidelity guaranteed 3 games in 1 Huge strategic depth Cons Depth itself could be a deterrent Tricky simulated controls Nothing new under the sun Very often it happens that a game is unable to find distributors for a certain territory, thus causing enormous delays in the possibility of certain enthusiasts to enjoy a product that they may have been waiting for a long time. Pacific Storm (from now PS) is unfortunately one of the examples of this type of unforeseen events, so much so that an expansion has also been released beyond our borders, which in any case we should also see for the next month of September, thus recovering at least part of the delay accumulated compared to others more fortunate to enjoy the effort of Buka Entertainment and Lesta Studios, both flying the Russian flag. The game is set during the final phase of the war in the Pacific between the United States and Japan, much as seen in Battlestations: Midway, to which PS bears some resemblance. The similarities with the DDE product concern purely the simulation side, given that in the numerous battles that can take place among the 40 scenarios available within the Pacific area, we also have the possibility of putting ourselves at the wheel of war vehicles involved, namely planes (fighters, bombardiers, torpedo launchers), submarines and ships (aircraft carriers and destroyers), appreciating one of the aspects of the game which, as already mentioned, appears to be a hybrid between strategy, tactics and, of course, simulation, very reminiscent close up game setting from Creative Assembly's Total War series.", "date": "2007-08-21", "grade": null}