{"name": "PicoPix", "ref": "https://multiplayer.it/recensioni/picopix_a.html", "text": "Beyond the jokes, one certainly cannot point the finger at the guys from Runestone, indeed in some ways they should be thanked for being the first to transfer the winning formula of the Nintendo puzzle to mobile phones. Whether played on DS or mobile phone, the substance of the game does not change, the only variant is represented by the different control system (keypad vs. stylus), obviously more cumbersome and less agile here but still up to the situation. PicoPix therefore offers the opportunity to try your hand at solving 64 puzzles, divided into five different settings that provide the background to the various illustrations that you will discover. And yes, because the ultimate goal of the PicoPix stages is precisely that of composing a ~hidden~ drawing under a grid of small squares which are suitably colored according to logic. In fact, on each of the rows and files that line the game box there are one or more numbers that indicate how many blocks there are to mark, and the key lies precisely in trying to do it by making as few mistakes as possible: unlike the original on Nintendo DS , here there is no stopwatch to mark the time taken to complete a puzzle, but a score that decreases as mistakes are made, and whose reset leads to a relentless game over. Drawing liberally from a source as rich as it is simple in its structure, PicoPix carries out its task in an orderly manner, even if the Global Fun product lacks naivety in more than a few sectors. In balancing the difficulty, first of all: the title offers in fact a series of training stages useful for learning the basic mechanics on elementary images, but already from the very first level you find yourself with huge boxes, very many (too many) numbers and rather complex drawings. There is not the slightest semblance of regular progression, for example by proposing small-sized schemes in the early stages, which was instead done as a work of art by Nintendo with Picross. The serious consequence is that less passionate users could find the game too bizarre and abandon it before even starting it. It must also be said that PicoPix does not offer much in terms of content beyond the main mode, but in this sense our judgment is clearly influenced by the plethora of extras offered by the ~master~ Picross, which is objectively on another planet. Taken as it is, therefore, the title Runestone is a somewhat incomplete but all in all satisfactory puzzle game, which will certainly make puzzle enthusiasts happy, thanks also to essential but pleasant graphics. PRO Winning play structure Good number of internships Very challenging AGAINST Difficulty level completely unbalanced Total absence of extras It may be too brainy for some", "date": "2007-08-14", "grade": "S.V."}