{"name": "Sonic the Hedgehog 2 - Recensione", "ref": "https://multiplayer.it/recensioni/sonic-the-hedgehog-2-recensione.html", "text": "What was it yesterday Sonic 2 is the sequel to Sonic the Hedgehog and therefore it is impossible to talk about it without at least introducing its progenitor. Spinning, hurtling, smacking us in the face that a Motorola 68000 and an uninspiring color palette could make our hair stand on end on 360-degree gaming ramps, Sonic the Hedgehog had revolutionized the platform game system, proving that Sega's experimentation could go far beyond the highly appreciable variations on the Mario theme that the various Wonder Boys, Kid Chamaleon and Alex Kidd had represented. Sonic imposed a new mascot on the public and on all players a new, memorable way to play. It was a radically new experience, four directions and a single button were enough to transport you to a digital world different from those seen before: this time, the platforms creaked, they wore out under the high speed, they were almost circuits where stopping was possible but never as beautiful as dodging obstacles, breaking through walls by rolling while running, continuing to accelerate with supersonic shoes, overcoming loops of death upside down at high speed. In this sense Sonic 2 is really ~more of the same~, but in a good way. Sonic was such a revolution that it managed to oust the success of Nintendo's Super Mario and, at the dawn of its success, Sega obviously decided to strike while the iron was hot, presenting a game with practically identical mechanics and implanting a limited but decisive squad. of features: in-place acceleration for lightning-fast starts, a playable sidekick for Sonic and a two-player split screen mode. What is it today Sonic the Hedgehog does not just present itself to our eyes today as a very important piece of videogame history: it remains an impressively crafted platform game, more frenetic than its predecessor, equipped with multiplayer, and equipped with a state-of-the-art audiovisual sector sixteen bits. The inclusion in the following of the ~loading~ start in place, ducking down and pressing the button as if it were an accelerator and then shooting away once the button is released, so sums up the historical importance of this game (which must be seen in the degree of exhilarating novelty proposed at the time) as much as the intrinsic thrill that it continues to give to any fan of games that stand out for the simple genius of their design. Compared to Sonic the Hedgehog, Sonic 2 also adds a second character, the fox Tails, halfway between a playable character by picking up the second pad at all times and an autonomous CPU-controlled pod, often useful for doubling damage to enemies or collect rings more successfully. Tails can be used with a cheat mode to enjoy an additional ending, but its real function is another: it serves for two-player multiplayer, done in split screen and decidedly well thought out in the mix of research, collection and racing, too if ruined by the excessive computational load produced on the cpu by two parallel screen areas. What is it today No two-player mode, however, can reach the degree of exhilaration procured by racing at enormous speed in Chemical Plants, between breakneck descents, automated tunnels and tracks in which the hedgehog and the fox jump, spin on themselves, the axis and inclination of the run change, graced by an elegant and ironic character design, by a successful, exhilarating and evocative musical groove and by a level design attentive to the enormous speed as to the single detail, to the parallax as to the animation, to the single, tiny little animal freed from the evil electronic shell imposed on him by Robonik as the huge mecha that acts as the final boss. The bonus level further enhances the experience, transporting the player into a vector gut in which Sonic and Tails run and rotate in a circumference in an almost first person view. Playing Sonic the Hedgehog 2 is almost imperative. Sonic 2 returns today to Wii, available in the digital catalog fifteen years after its publication for Megadrive. We should rejoice, as the return of the electric blue hedgehog is one of the most important platform games in the history of electronic games and one of the best-selling videogames of all time.", "date": "2007-08-22", "grade": null}