{"name": "Another Fishermans Tale: la recensione del nuovo puzzle game in VR", "ref": "https://multiplayer.it/recensioni/another-fishermans-tale-recensione.html", "text": "Who has never dreamed of being able to detach a hand, throw it towards a distant object, take it and have it within reach in an instant by calling one's limb back to oneself? Another Fisherman's Tale is here to grant your wish through the magic of virtual reality. This sequel to A Fisherman's Tale, a 2019 VR puzzle game, isn't afraid to drastically change its original formula to tell a new story, with more puzzles and more grounded in reality.Developed by InnerspaceVR and published by Vertigo Games, this game takes what was done well from the previous chapter and adds more layers and more emotional depth. After the criticisms leveled at the movement system of the previous title, then, the developer has done an excellent job to make the gaming experience fluid and almost completely free of elements that can cause nausea. In this review of Another Fisherman's Tale we will tell you about the new puzzle solving methods that the developers have invented and the heartfelt story that you can experience in virtual reality. Once again this game investigates the relationship between what is big and what is small by exploiting the world of modeling to tell of individual growth and the relationship with the past. Lend a hand, or a claw, or a hook The most important novelty introduced by Another Fisherman's Tale is the possibility to throw both hands and head around the game world to find objects and change perspective by solving a puzzle The main novelty of Another Fisherman's Tale level is the ability to throw both hands and head around the game world to reach distant objects, change your point of view and explore the scenery in new ways. As soon as you start playing you will find yourself stranded on a deserted island and to save yourself you will have to put your body back together. Bob, the protagonist of the series, can launch and remotely control his hands which, thanks to the long rope, grab what he wants and bring it back to him. So you'll start rebuilding your legs and body to try and escape from that lost cave. A few minutes after starting, the game already provides you with the second and third essential tools for progression: the claw and the grappling hook. After a barter with an old rival you can exchange one of your hands with the claw of a crab to cut the ropes and open mysterious doors while after having come across the corpse of an old adventure companion you can take his hook and use it to climb rocky walls and other facilities. It is even possible to equip two hooks and enjoy short sessions of climbing in VR to reach higher positions. Each level is on rails and explorability is limited, but the game provides helpful hints and tips if you find yourself stuck in front of a puzzle for a few minutes. It takes little time to get used to the controls of Another Fisherman's Tale, aiming with your arms and throwing your limbs is quite intuitive even if sometimes it takes five or six attempts to hit the target We really liked the limb-throwing system for retrieving items and unlocking doors even if the hand controls when it lands away from the body aren't immediately intuitive. In fact, to move it, you don't use the analogs, but you have to orient it by turning the controller and push it forward by pressing the relative trigger. Indispensable for some puzzles and fun for others, then, the launch mechanism of Bob's head amazed us above all in its activation method: in fact, to detach it and throw it somewhere, you will have to aim with your gaze and guide its trajectory by turning the boss. In the puzzles where this mechanic is indispensable there is a magnetism system that helps a lot to reach the correct destination, but if you want to use it in the rest of the world get ready to practice. A story of adults and children The narrative of Another Fisherman's Tale very well mixes a pirate tale for children with a story of personal growth and managing life's many responsibilities The real protagonist of Another Fisherman's Tale is Nina, the protagonist's daughter, whom we see (after the first level) engaged in what appears to be a move, surrounded by boxes full of her father's models accompanied by photographs and notes. Here we understand the fairy-tale tone that has accompanied us up to that moment. In fact, as you play, you will hear a dialogue in the background between Bob and a little girl who asks him for more details on his crazy stories of seafaring adventures. Bob narrates what is happening and together gives instructions to the player explaining the logic behind the puzzle that is being facedor. In the second level, then, the two worlds mix because (without making too many spoilers) you will find yourself playing not in Nina's memoirs, but in the model that she is packing in the cellar. At one point, in fact, you will see Bob stepping out of the model for an instant and seeing himself surrounded by scissors, tape and glue before returning to the adventure. In Another Fisherman's Tale, quietly finished in 5-6 hours, the conflict between Nina's adult present and playful past is evident and the narrative uses this friction between lightheartedness and responsibilities to leave you with a strong message when you put down controllers and take off your headset. Bob also tells a story within the fairy tale that reminds his daughter: the search for Libertalia. This mythical island nation founded by the pirate Henry Avery (those who played Uncharted 4 will remember it) are said to contain the great treasure of the many pirate lords who founded it to escape the tyranny of the absolute monarchies of the late 1600s. Bob, like a true sailor, is determined to find her. This adventure leads him to deal with pirates and sea monsters and, intertwined with Nina's events, balances the very adult issues faced by the protagonist with the lightness of a fairy tale.", "date": "2023-04-23", "grade": "7.0"}