{"name": "Harry Potter e l'Ordine della Fenice - Recensione", "ref": "https://multiplayer.it/recensioni/harry-potter-e-lordine-della-fenice-recensione-2.html", "text": "A tough school year Also for this school year, Harry Potter will have to contend with a large number of problems: far from being able to enjoy the college life made up (we assume) of magical toga parties and alcoholic potions, the bespectacled thaumaturge will be greeted immediately by trouble, at his return to Hogwarts. The inconveniences already begin during the summer holidays: Harry feels kept in the dark about what is happening around him by his most trusted friends, while he is confined to Privet Drive at the Dursleys' house. In Little Whinging, to help his cousin Dudley Dursley attacked by two ~dementors~, our hero is forced to use magic in front of prying eyes, and for this he is forced to present himself at a disciplinary hearing before the Ministry of Magic . After moving to the godfather Sirius Black's house for the rest of the summer, Harry will learn of the secret kept in his house: the Grimmoud Place home is actually the headquarters of a secret organization, called the Order of the Phoenix, led by Albus Dumbledore, who aims to fight against Lord Voldemort and his evil hosts. At Hogwarts, things don't seem to be going much better, quite the contrary. Harry finds himself at the center of the rumors as the Ministry of Magic, through the Daily Prophet, has denied the possibility of Voldemort's return, cataloging the protagonist's ideas as a simple search for everyone's attention, and spares no harsh words even for Dumbledore, considered an old man inadequate for his role. The apotheosis is reached with the arrival at the school of a new defense against the dark arts teacher, such Dolores Umbridge, who as senior undersecretary of the Minister of Magic is actually the arm of the institution that aims to steal the school from Dumbledore's control, and bring her closer to Ministry positions. This will assume more and more power at Hogwarts, until it reaches the rank of Supreme Inquisitor. Soon, there will be a direct confrontation between the oppressive power of the Inquisitor and those rebellious students who have decided to fight against such abuses of power With the wand between your fingers Harry Potter and the Order of the Phoenix is an action adventure with a third person view. For this Nintendo DS version, the developers have chosen to frame the action through fixed cameras, making the 3D characters move in a two-dimensional world, which is actually quite vast. The game structure is essentially based on the exploration of the large environments that make up the game zones (basically all the various areas of Hogwarts) and on the solution of various quests, which usually require the overcoming of some mini-games, obviously based on on the use of the stylus and the touch screen. The latter is the cornerstone on which the entire gameplay is based, and the breaking element with respect to the other, more traditional, versions of the game. With the nib we can do several things: usually, it simulates the use of the magic wand. All the most famous spells of the film are introduced in this video game version, and to be performed they require particular movements of the stylus, following intricate designs on the touch screen, after which it will be necessary to press a series of points on the screen as soon as possible, trying to don't waste too much time. The recognition of signs by the interface is very good, and we will soon be able to cast spells with great speed and precision. The various spells are used as a means to solve the pseudo-puzzles present in the game: to put the destroyed objects back in place it will take the reconstruction spell (Reparo!), to raise elements of the scenario the levitation spell (Wingardum Leviosa !~) etc. However, the use of these is rather guided, usually the solution to the problem is obvious, when it is not really suggested clearly by some interlocutor. During the game, in most cases we will find ourselves solving problems for the other Hogwarts companions, who will have endless requests to keep the bespectacled protagonist busy. The structure is decidedly simple: talk to a character, reach the point within the setting, perform the necessary magic or mini-game. The narrative value of these fragments of adventure is somewhat limited, as is the level of challenge, focusing everything on the immediacy of the gameplay in the use of the stylus-wand or the mini-games with which it is possible, for example, to elaborate magic potions (mixing the right ingredients in sequence, and turning everything with the stylus), recover the lost chocolate-frogs (by pressing on the right ones in the shortest possible time), or recover materials to allow someone to compose thethe new potions. With the wand between your fingers Continuing the story, in some cases we will also find ourselves facing RPG-style fights: in these cases, we will have a party to manage within a turn-based structure. We will therefore have to perform the attack and defense phases in the best possible way, all based on the use of magic, choosing which spell to have each character in our group do, divided in principle between attack and defense. These fights are generally easy, but they succeed quite well in trying to break up the monotony of the quests, which always see Harry and company running around the school solving someone's problems. The exploration phases highlight the vastness of the game world, all made up of intricate roads, fascinating environments and secrets to discover, but they also suffer from numerous defects: the control style adopted is in relation to the position of the character on the screen, i.e. if Harry is at the top of a shot, and needs to go down, we'll have to press down, for example. It is a solution reminiscent of Devil May Cry, and completely different from, for example, Resident Evil, where movement is always relative to the character. The choice could be positive, were it not for the fact that the shots are crossed with incredible speed, and confusion is created in the moment of detachment between one and the other. When you move from one shot to another, in fact, by continuing to press in the same direction, the character often takes different paths, and in most cases you find yourself jumping between two shots trying to figure out where to go. The little hand highlighted on the screen to indicate where to go creates more problems than anything else, considering that it always indicates the immediate direction to follow, and not the point to reach (if you have to get to the top of spiral stairs, the little hand it will indicate the beginning of the stairs, and then it will begin to go around like crazy to indicate the fact that we have to go up the stairs), a system that soon turns out to be rather cumbersome and confusing. Hogwarts two and a half sizes In the 90s, after the release of the first Resident Evil (which in turn followed the style taken by Alone in the Dark some time ago), there was an invasion of games with 3D characters in pre-rendered scenarios fixed, therefore in 2D. Some were of fine workmanship, but many were characterized by the crudeness of the settings and the lack of general inspiration. Unfortunately, Harry Potter and the Order of the Phoenix is reminiscent in principle of this second genre of games. Some parts of the scenario are actually pleasant and full of atmosphere, but for the most part they are gray environments, almost monochromatic, with a few elements on the screen in which crude polygonal objects are inserted, which immediately and without possibility of error indicate which are the interactable items in the area. The 3D characters are made quite well, but they have decidedly mechanical animations, and they always find themselves excessively detached from the surrounding environment, not at all amalgamated within it. As if that weren't enough, in most cases the settings are not built in such a way as to accommodate well the 8 directions in which it is possible to move the character. In fact, with the control system adopted, Harry and his companions have only 8 fundamental degrees of rotation, which clashes even more with the scenarios. Most of the time, you will find yourself zigzagging inside oblique corridors that do not follow any of the 8 positions of the character, so it will be necessary to continuously correct the direction to try to take the right path, with a decidedly ugly effect. However, it cannot be denied that some areas are more successful than others, and Hogwarts in general maintains its magical charm intact, albeit curtailed by the defects listed above. The main story of the game is told through cut scenes, where comic-style still images follow one another by staging the most important events and dialogues between the characters. Now, perhaps one could not expect the majesty of some full motion videos seen on the Nintendo DS by Square Enix, for example, but a little more effort would have been welcome. In Harry Potter, the key scenes are essentially taken from stills of the film, digitized in a rather crude way and inserted in order to explain the events, a truly old-fashioned solution, which does not do justice to the pathos and emotion of the original scenes from the movie or book. The audio sector settles for most of the time on un level of general anonymity, with standard sound effects and music taken from some of the original themes of the film, often reproduced here as somewhat monotonous litanies, but in keeping with the general atmosphere of the game. Game Boy Advance version The Game Boy Advance version of Harry Potter and the Order of the Phoenix is basically the small adaptation of the game for the Nintendo DS. Comparing the two hardware, the somewhat poor look of the game on the Nintendo DS becomes a very respectable graphics on the Game Boy Advance, this being almost identical to the version for the larger handset. The substantial difference obviously concerns the absence of the second screen which, purely scenographic in the exploration phases, severely restricts the field of vision, without however affecting playability, and the absence of the touch screen interface, which takes away a lot from the fun of the minigames and the execution of various spells. Instead of using the stylus, we find ourselves here performing the same actions by pressing sequences of keys within given time limits, or performing certain skill tests always linked to pressing the buttons. Clearly, it is a reduced version of a game that in itself does not shine from a qualitative point of view, but contextualizing it to the current (scarce) offer for Game Boy Advance it takes on greater value. Furthermore, the graphics against the hardware in question proves to be quite convincing, proportionally more convincing than that for the Nintendo DS. Rating: 5.2 Comment The rating of Harry Potter and the Order of the Phoenix on Nintendo DS can only be insufficient. Overall, the game does everything possible to fall within the typical prejudices that afflict the multiplatform tie, which find full justification here: it's really hard not to think that this is a game created to exploit a high-sounding license with little effort, on a console with large user base such as Nintendo DS. The amount of mini-games present are not enough to make this portable adaptation look like a simple botched reduction of the game for home consoles, built in such a way as not to omit the use of the touch screen, but without inspiration. The three blocks that make up the gameplay (exploration, mini-games, RPG-style battles) also integrate quite well with each other, but the problem is that they aren't particularly fun in themselves, and they don't all compete together to create a good gaming experience. The poor technical realization does the rest, placing this game far from other contemporary productions for the Nintendo portable. Ultimately, unless you're a die-hard Harry Potter fan and can't get hold of the game in any of the other versions, the advice is to skip this chapter on the Nintendo DS. Pro: Ehm, it's Harry Potter! At times nice graphics Some fun mini-games Cons: Globally poor technical realization Total lack of bite Botched and unfunny gameplay The observant gamer knows that the tie-ins, the games taken from the great cinematic blockbusters, are hardly top-level titles. The expert gamer, the snooty one, almost, realizes that multiplatform titles can often not turn out to be really excellent products, from a qualitative point of view. These two ways of thinking have long since become almost prejudices, and largely unfounded nowadays, given the high quality of many of the products that belong to one or the other category. Harry Potter and the Order of the Phoenix fully falls within the cases examined: it is a tie-in to a film that is sure to be successful at the box office, and moreover it is the version for Nintendo DS, or the portable adaptation of a multiplatform title, created for a console that clearly cannot compete with the computational power of current home consoles, and which focuses more on the freshness of innovative ideas and concepts than on modern technological ambaradan. Will EA be able to dispel the prejudices mentioned above? Well, in this case, one would rather say no: Harry Potter on Nintendo DS was born with the need to bring the new adventure of the bespectacled wizard to the vast user base of the Nintendo portable, rather than presenting itself as the development of a concept original and specifically designed for the machine in question. It is true that the touch screen is widely used in the game structure, and the double screen is used regularly, but the title as a whole seems to want to resume the characteristics of the home versions of the same game, clearly failing in the attempt to propose a different approach , either for the limited hardware, or for the absolute lack of depth and originality of the f", "date": "2007-08-03", "grade": null}