{"name": "Vesper", "ref": "https://multiplayer.it/recensioni/vesper-recensione.html", "text": "Some video games have a magnetic charm, that love at first sight that makes us say ~it will be beautiful~: a sort of sixth sense developed after years and years spent playing, suddenly teased by that title that makes no noise and yet, for us, speak louder than everyone else. Of course, then he must pass the exam and actually demonstrate the value he seemed to convey: some first impressions could be deceptive, we are not infallible or omniscient and we cannot know what lies behind the good face that the video game in question has decided to show us. However, it was not the case with Vesper, an Italian platform that gave us back, with interest, all the excellent sensations experienced at first glance. We didn't play the demo so as not to spoil the complete experience, so we started from an almost completely blank sheet, dotted here and there with small notes of color due to trailers and promotional images: it was a journey of discovery , not too short and intense, which is inspired by many video games from the past and not (Oddworld and Limbo come to mind) but builds its own identity, distinguishing itself in a particular way for being a title created by developers at their first project. Let's find out in Vesper's review of this fascinating work. Little androids in a lost world Vesper's style is excellent What strikes first, in Vesper, is the artistic sector. Impossible to remain indifferent to a similar aesthetic, a sharp and clean 2D, enhanced by intense colors that at the same time manage to convey a sense of abandonment, of oppression - of a suspended time that is just waiting for us to resume its course . A desolating beauty, well, these are the best words. Which is echoed by an equally punctual soundtrack in dictating the rhythm of the narrative and of the game in its entirety. We don't know what will happen yet, but, thanks to a dramatic introduction, we immediately have the feeling that ours will prove to be a bittersweet journey, one of those experiences where the happy ending, if there were any, would still be half a victory. In the role of the little android Seven, we will take our steps on a planet that has fallen into ruins which, despite everything, or perhaps precisely because nature has returned to reign undisturbed over the ruins of a lost civilization, conveys an inexplicable feeling of peace. Were it not for the ruthless machines that hunt us down, it might even seem like a happy oasis. Instead, to accompany our steps there are the tragic vestiges of a past to be discovered: what do those few initial minutes mean? What happened to those who preceded us on the planet? What is our purpose? All questions that will be partially answered during our first game, thanks to the help of the environmental story and some documents scattered along the levels. However, Vesper is a game that hides more mysteries than you might think and our advice is to start it all over again, once it's finished: not only will the narrative be more extensive, going to reveal backgrounds left waiting for our return, but it will present a surprise in terms of gameplay. We will not go further, hoping that this timid invitation will intrigue you enough to return to the role of Seven. Playing we felt brought back to Limbo and even to Hollow Knight, not in terms of mechanics but in the choice to build a story that can change its outcome based on our actions. Will we save what is left of us, or will we condemn it forever? It's not an easy choice, not when there are too many nuances to figure out what's right. Escape, absorb and control Vesper platforms Vesper is a platformer and as such, the whole experience revolves around this element. There are paths to unlock, puzzles to solve, enemies to avoid since one hit is enough to be killed, in a race whose purpose we don't quite understand, but we have no other choice but to continue. The peculiarity of the game lies in the use of light for everything concerning the interaction with the world around us. At first we can only run away, using our wits and timing to get out of dangerous situations unscathed. Then we will come into possession of the Drive Gun, a weapon capable of absorbing and infusing light at will. From this moment on, our approach will still remain reasoned as regards the puzzles, but it may be a little more ~aggressive~ in terms of the threats to be faced; however we will always have to exercise caution both for any environmental traps and because the enemies are by no means helpless. There are three types in all, if we exclude the fearsome entity that chases us in some sectionsOnes of the game: dogs, foot sentries and flying sentries. Each is different from the other not only in appearance, but also in behavior: the dog is faster and can attack us with a leap, from the right distance; the sentry on foot is slow but has a Drive Gun on his side with which to make us tit for tat, destroying us in seconds; the flying sentry is more insistent in the pursuit, as it is able to overcome any obstacle, and is also faster in the use of the Drive Gun. We must be careful not to be discovered and, where it will be inevitable, demonstrate all our reflexes and overview to understand how to react. Since enemies are also machines like us, the Drive Gun can hack them through the use of light, giving us the opportunity to take possession of them and push them to do what we want based on need. We could use them to violate the security of the place, since the systems only recognize them, or eliminate other enemies nearby, or collect and exploit the light in our place to facilitate our passage. Whatever their use, once their function is exhausted we will destroy them and return to our body, ready to continue. It is interesting to note how, based on the technological evolution of the machine in question, the signal that allows us to keep them under control is more or less extensive: the dog, in its most basic form, can move away relatively shortly before regaining control of itself ; the two sentinels instead, especially the flying one, can travel greater distances. This comes in handy in some situations and overall it's a little touch of perfectionism that we appreciated. Vesper's Enemies Enemies are rather limited in their actions and their pattern is easily predictable, but the basis is the fact that literally a glance is enough to be hooked and identified. There is no early warning system, once we enter their field of vision, regardless of the distance, we will be marked and chased until we manage to block them in some way or push us out of their reach. This, combined with the fact that they often appear after having performed a specific action, catching us by surprise, helps to keep the attention span high. Seven can also blend in with the environment (except when she carries a light with her), through a simple but ingenious system that is well integrated with the character: her face being her only source of light, she can blend in with the bushes and turn off. This way enemies will pass by him without noticing him. As we have mentioned, then there is her, the supreme entity with unimaginable powers. It is called Black Light and will give us a surprise hunt during our journey, without the possibility of being addressed directly. It can be slowed down by intelligently exploiting the light that seems to escape, but these are decisions to be made in the blink of an eye, since the intelligence of this mysterious entity far exceeds that of machines and there is no obstacle that can stop it. In a crescendo of tension, puzzles and difficulties, which however always keeps itself in the right perspective, without exceeding but inviting us to use our heads, Vesper is a game which from a gameplay point of view can be summed up in three words: escape, absorb and check it out. You don't need anything else to overcome the dangers that dot this ruined planet but you must be quick in reasoning, because defeat is around the corner. Puzzles are at the heart of Vesper From the level design point of view, we were equally satisfied: although there is sometimes linearity, there are several sections in which the areas open up and become more tortuous, developing on several levels and making great use of verticality. It's not a game that needs a map, which is why we don't have one available, because although there are scattered crossroads to collect documents, it's always easy to retrace your steps. In the approximately five hours necessary to complete the first run, we have not collected all the clues, which are sometimes well hidden in the environment, but we have found the perfect duration for what it wants to tell in part: let us remember that in order to have the complete picture of the story we have to play it a second time. It is not only a narrative necessity but also a practical one because, as we have mentioned, the gameplay will not be entirely the same as the previous one and the outcome of the second game revolves around this. Overall, Vesper is a complete and fascinating adventure, mixing active threats with environmental puzzles very well, never really keeping them separate and presenting an increasing level of difficulty, in accordance with our experience. The controls are smooth and responsive but Seven comes closest to Limbo's protagonist, in termini of ~weight~: it is not slow, however it cannot sprint and its jumps must be calculated precisely because the movement is weighed down. The artistic sector and the soundtrack are exceptional and although sometimes the aesthetics can take the upper hand a little too much, or become redundant in some settings, it maintains an excellent level and offers truly memorable glimpses. The cryptic story may not appeal to everyone, but anyone who has enjoyed games like Limbo, or the Hollow Knight itself which is a little clearer in its explanations scattered throughout, will have no difficulty finding Vesper's narration pleasant too.", "date": "2021-07-30", "grade": "8.3"}