{"name": "Rainbow Six 3: Black Arrow", "ref": "https://multiplayer.it/recensioni/rainbow-six-3-black-arrow_a.html", "text": "Like Loretta Goggi in Freccia Nera Let's start by talking about the offline mode of Black Arrow, which presents a couple of new features compared to the Rainbow Six 3 counterpart. The substance, needless to say, has remained the same: in the role of Domingo Chavez the user must lead his own team made up of three elements within terrorist infested scenarios, with various objectives that differ from mission to mission. The team element, in this case, has been slightly reinforced: if in Rainbow Six 3 it was in fact possible to complete the vast majority of the maps relying only on one's shooting skills, in Black Arrow various situations are proposed in which the correct coordination of the team is reveals key element. Once again, the direction of one's men can be carried out both via pad (thanks to the intuitive on-screen menu) and via voice commands via microphone, which also in this case are not always correctly understood by the teammates led by the CPU. The ten missions that make up the campaign mode are convincing due to the variety of settings and quality of the level design, but they are unlikely to leave a deep mark in terms of actual gameplay; thanks to a (still) rather poor AI of the opponents, with enemies that are not very smart and with pre-set patterns, completing the Black Arrow campaign does not require large amounts of effort and time. And precisely because of the relative ease of the single player experience, the introduction of a more accurate briefing section is a useful addition more to the scenographic component than to the actual game. In any case, Black Arrow partially remedies its offline weakness with an unprecedented two-player cooperative mode via split screen, which while far from exceptional, at least provides the title with an extra pinch of variety. You are not behind doors! But as Rainbow Six 3 fans will certainly know, the real appeal of the Ubisoft product lies in the online mode, which in this Black Arrow has undergone significant upgrades. To begin with, the title supports the new features of Xbox Live 3.0, with the ability to send voice messages to your friends, to create and manage your own clan on site and to organize challenges with other teams. These elements which, in a title in which the cohesion factor between companions is decidedly important, are at least welcome and well implemented. At the actual game level, however, Black Arrow presents the beauty of ten new maps (much larger and more complex than those of the prequel) plus four drawn from Rainbow Six 3, and above all two new team modes. In this case, we are talking about Recovery, to all intents and purposes a Capture The Flag with containers of radioactive material instead of flags, and Total Conquest, comparable to Domination of Unreal Tournament and which sees the players committed to maintaining control of three satellite stations As long as possible. More than in their quality itself (still very good), the two new modes enrich online matches in terms of variety, a deficit element in Rainbow Six 3 due to the imbalance towards the Survival Team option, which outclassed in terms of fun and popularity the remaining game types. On the other hand, the lack of balance in the arsenal made available to the player is disappointing, which has remained almost unchanged compared to Rainbow Six 3: although the strongest sniper rifles have been eliminated (replaced by more human counterparts), the choice relating to one's weapon is reduced necessarily two or three specimens, simply too powerful and accurate to be set aside in favor of others. Although its nature as an add-on rather than an actual sequel is clear, it is sad to see how the Red Storm title has not enjoyed particular graphical improvements: although the new maps enjoy greater attention to detail, the graphics of Black Arrow is substantially identical to the already not exactly spectacular Rainbow Six 3. The vast majority of textures (some with a truly embarrassing lack of definition) turn out to be particularly not very nice to look at, while the polygonal models always remain rather rough and orphans of a shading system worthy of the name. But for a title released less than a year after the prequel and available at a reduced price, these are all in all venial sins. Comment Rainbow Six 3: Black Arrow is an add-on. Starting from this irrefutable assumption, the Ubisoft product performs its task in an orderly manner, even if it only partially fills the margins for improvement of its predecessorking. Therefore, if the poor balance of weapons, the poor AI of the enemies and the subtle consistency of the offline mode have not undergone appreciable corrections, on the other hand the new maps and the unpublished game modes, combined with the support of the Xbox Live 3.0 service, infuse new lifeblood to a title that still remains a cornerstone of online gaming on the Microsoft console. Even if far from being revolutionary, therefore, Black Arrow will certainly make fans happy, also thanks to a price consistent with its contents. Pros: Great online multiplayer Well thought out new modes and maps Greater variety than the prequel Cons: Graphically dated Not very stimulating offline Enemy AI still crude Acclaimed as one of the best online products available on Xbox, Rainbow Six 3 undoubtedly represented an excellent choice for Microsoft users eager to try their hand at an experience that somehow deviated from the frenetic frag-respawn mechanics of traditional FPS. Tactical team shooter with a markedly realistic tone, the Red Storm title was accompanied by a good following of the public, such as to induce Ubisoft to release this Black Arrow. The new adventure of Ding and his companions is now presented to Xbox users with the double task of filling the margins for improvement of the predecessor and of providing online gamers with an exciting experience, able to withstand the attacks of the competition. Let's see if the mission was completed.", "date": "2004-09-23", "grade": null}