{"name": "Pac-Man Championship Edition - Recensione", "ref": "https://multiplayer.it/recensioni/pac-man-championship-edition-recensione.html", "text": "His mouth sparkles The new chapter released on Microsoft servers, and downloadable for 800 mp (about 10 euros), adopts a new approach to the game, no longer based on mere survival, but on time. All the available modes are consumed along a pre-established amount of minutes, after which, it will inevitably be Game Over. The aim therefore is to obtain the best possible score for the online rankings, in addition to the inevitable objectives. This unexpected setting gives a whole new look to the experience we were used to, especially in terms of adrenaline and dynamism. The countdown weighs like a sword of Damocles on the player, and the last seconds are spent with an enthusiasm and excitement that is difficult to describe in the review, unfortunately, however, the new arrows in Pac-Man's bow also represent the major flaw, as we will see in following. Of course, the historic ghosts also return, initially locked up in the central house of the labyrinth, but soon free in the corridors ready to capture our hero. The ectoplasmic creatures are more aggressive than ever, fast and lethal, but Pac-Man has also changed, for the better. Its speed has significantly increased and this time it is equal to its pursuers, an element totally unknown to the saga, also by moving the stick before making a curve, we will make the turn much faster and it will be embellished with an exhilarating effect of sparks on the walls! The novelties do not end here, in line with the new daring pace of the game, the labyrinths are characterized by a non-linear structure. The map is divided into two distinct parts, after each of which the infamous bonus fruit that we all know will appear. But once ingested, we will open a completely new part of the labyrinth that will replace the old one. The initial sense of disorientation is quickly cushioned by the speed of Pac-Man, and it soon becomes clear to the player that the aim is not to clear the mazes of balls, but to score as many points as possible. Maybe by ingesting the famous super pill, and stocking up on ghosts! Nostalgically stylish Technically Pac-Man CE faithfully respects the dictates of the old school, presenting the beloved two-dimensional graphics of the early days, but enriching them with an exceptional stylistic aspect. Each bitmap is embellished with colored trails, the walls of the labyrinth deform or light up like neon as our spherical friend passes by, the soundtrack recalls the tunes of the past, emphasizing them with bombastic techno rhythms. Everything plays with the pixelatedness of times gone by, but with the taste of a luxury reinterpretation. Really light years ahead of the revival of a cabinet twenty years ago. Also not to be underestimated is the full widescreen format support, which makes the title easier to play on compatible TVs, and specifically HD displays, absolutely delightful to look at. Most important in the player economy is the fun that comes from this new incarnation, largely derived from the excellent implementation of analog control. One of the major defects of the previous titles released on XBLA was in fact the poor precision of the directional cross, so it is nice to see the improvements made by Namco for the occasion. Unfortunately, as we mentioned at the beginning of the review, the timed nature of the various modes tends to make them unattractive in the long run, after having achieved the objectives the only bite is that of the score. There are no cooperative or versus modes, online support is limited to leaderboard management. Goals 360 Goals in Pac-Man follow the canonical pattern of XBLA titles: 12 for a total of 200 points. Obtaining them is not particularly prohibitive, indeed we could say the exact opposite, if we perhaps exclude obtaining the crown, the last ~fruit~, the most rewarding, extremely difficult to obtain in the standard 5-minute mode. However, this is a practice to be completed in a few hours of play. Comment Pac-Man Championship Edition is an authentic jewel in the XBLA panorama, an adrenaline-pumping, highly entertaining edition that cleverly plays with the past and nostalgia, but knows how to stand out as a completely new experience. The problem is that it is an expensive jewel in light of what is offered. Because the fun risks running out too quickly, mainly due to a structure unable to attract the player's interest in the long term. And it's a shame, because the basis is there. A layered method would have been enough, in compliance with the progenitor, to obtain a safe productrarely longer-lived. This shortcoming would be amply forgivable for 400 Microsoft Points, but at double the expense it makes Namco's latest effort a purchase worth carefully evaluating. Pros Gorgeous graphics Awesome Fun Much improved controls Cons Unattractive in the long run Overpriced It's a real pleasure to write about an old friend, companion of countless adventures, our Pac-Man. How many coins have we consumed in the old cabinets in search of the super pill? The voracity of the yellow ball hasn't diminished after all these years, two versions dwell in the Live Arcade firmament, was there a need for another edition? According to Namco it seems so, but this time it's not a matter of exhuming memories, no acrobaticism between indulgence and pragmatism. Pac-Man returns in a new form, respectful of the past, but at the same time modern. It seemed like an impossible feat, but Japanese coders have performed a real miracle in giving new life to a classic.", "date": "2007-07-31", "grade": null}