{"name": "Minigolf Revolution: Pirate Park", "ref": "https://multiplayer.it/recensioni/minigolf-revolution-pirate-park.html", "text": "It certainly cannot be said that minigolf is a new theme for mobile gaming: beyond the countless downloadable video games dedicated to it, this ~sport~ (if it can be defined as that) has often proved to be the first choice of manufacturers of mobile phones about the default applications to be included in their devices. It is therefore difficult to be surprised by the announcement of yet another exponent of the genre, even if it comes from the award-winning company Gameloft: yet, this Minigolf Revolution: Pirate Park not only proves to be an excellent representative of the category, but also one of the most original and complete. Divided into four courses of nine holes each, the game is pirate-like not only in the setting, but above all in the play mechanics: in addition to trying to stay within par, the user is in fact called upon to collect a whole series of treasures (doubloons, emeralds and chests), which make up the final score. An aspect that is anything but accessory, as at the end of each path it is necessary to reach a certain amount in order to move on to the next one. For this reason, in Minigolf Revolution: Pirate Park you have to have a good game in compensating for reaching the hole in as few strokes as possible with collecting a sufficient amount of loot. As if that weren't enough, Gameloft wanted to fill its title with other interesting material, such as the end-of-level bosses (to be fought with shots), the pinball-style minigames inserted in some stages, and the extra content that can be purchased in the appropriate shop spending the money made from victories. A wealth of elements that is accompanied by a fortunately more than adequate gameplay: the control system is precise and essential, the on-screen indicators are all useful and easy to consult, and the various holes are genuinely diversified and full of bizarre and ingenious obstacles . Too bad that all this was ~wasted~ by Gameloft in a title oriented exclusively to the single player which, despite the considerable amount of unlockable material, tends to end quite soon: a very simple pass-and-play mode would have been enough to make Minigolf Revolution : Pirate Park a little gem, but evidently the French developers didn't want to try too hard. However, what remains is a good product, characterized by really well-made graphics: the scenarios are colorful and literally overflowing with side elements, and the sprites of the various characters appear generous in size and attention to detail. Standard instead the sound, which does its duty without particular fanfare. PRO Minigolf is always minigolf Some original and spot on elements Graphically excellent AGAINST Non-existent multiplayer A little short", "date": "2007-07-28", "grade": "S.V."}