{"name": "Smash The Mole", "ref": "https://multiplayer.it/recensioni/smash-the-mole_a.html", "text": "In the intention of the developers, the three games that make up Frenzy Island should come out one every two months, let's start by talking about the first. Smash the Mole is a curious puzzle game with a strong action component, which refers to the arcade title that we have all tried at least once. It is that simple video game, usually hosted by a nice cabinet, in which you have to hit all the moles that come out from under the ground with a rubber hammer. The plot of the title developed exclusively for our mobile phones is trivial and has the sole purpose of introducing us to the action: our neighbor, a certain Vlad Furry has hired an army of mercenary moles to devastate our character's garden... are we going to let him? Certainly not. The garden of our hero, for the record Sven Tomato, is ruined by nine holes created by the mischievous creatures. We will have to run from one side of the holes to the other and hit them with our big hammer. Furthermore, the moles will not just randomly pop out of one of the ditches but after a few seconds, if we let them, they will throw vegetables of all kinds at us, making us lose precious life. We will start with 5 hearts of energy and every time we are hit this will go down. After a few minutes of play and as a result of shots placed continuously, the frenzy will unleash, i.e. there will be a mass assault by the critters for a limited time, and to defend ourselves we will be able to take advantage of special bonuses that will allow us to hit more than one at the same time. The power ups take advantage of elements such as earth, fire and ice to do as much damage as possible. More than a hundred levels await us and lots of new bonuses to discover. However, we challenge you to complete them all, given that after a while it becomes repetitive, not presenting significant news and certainly the new power ups and faster moles are not enough to exponentially increase longevity. The game is essentially immediate and fun, supported by controls that work well even if we would have preferred to use the hammer with the central button of the joystick of our Nokia N70, rather than resorting to the more awkward asterisk. Technically it makes a good impression, with very colorful sprites and a good background fluidity. PRO Immediate and frenetic Great for short games AGAINST Short lived and repetitive", "date": "2007-07-25", "grade": "S.V."}