{"name": "Last Stop", "ref": "https://multiplayer.it/recensioni/last-stop-recensione.html", "text": "Good storytelling never hurts, especially when it comes to video games. This does not mean looking at all costs for something socially engaged, full of emotions and philosophical digressions. To make a compelling and interesting narrative, sometimes even a nice, light story is enough, able to speak directly to the player without particular beating about the bush. This is precisely the case of Last Stop, a video game developed by Variable State and distributed by Annapurna Interactive. The team previously debuted another story-focused interactive title, Virginia, which won multiple awards, including a BAFTA Game Award. Let's see how much and, above all, how the horizons of this small team have evolved in the Last Stop review. Interlaced narratives Last Stop: three stories ready to collide Last Stop is presented as a third-person game strongly focused on the narrative sector. After a short prologue, the player is taken to experience three different stories set in London, which are themselves divided into six chapters. It is possible to choose the order in which to approach the different narratives, although you can never proceed in a story without first completing the same chapters as the others (essentially, after passing the first chapter in all stories, you can move to the second and so on). This is because the events are obviously linked to each other (in a way that we will not reveal to you, don't worry). This subdivision is quite apt, as it allows the various events to be staggered well, bringing them all on the same level and not making the interest in one story or another. The fact of wanting to characterize each story with a particular narrative trope is also appreciable (the first linked to comedy, the second to espionage and the third to adolescent science fiction), a tendency born of a tradition that goes from literature to television, with the which shares several elements in common, starting from the episodic structure, up to the summary of what happened in the previous chapters (in full Telltale style). Last Stop: the episodic structure allows you to enjoy the story at your own pace Precisely this ~television~ nature of its own brings different possibilities of approaching the title, which can be played in one breath, or even weeks later, without the problem of leaving behind some details. Furthermore, if we add that the narrative content is not excessively intricate (even if sometimes quite compelling) nor particularly long-lived (the game is easily finished within five hours), this choice is even more apt, given that a more linear storytelling methodology would probably have weighed more on the assimilation of the proposed contents, also losing the effect of the twists and turns that more or less close all the chapters. A film director Last Stop: directorically speaking, the title asserts itself As often happens, these narrative video games are staged through highly cinematographic direction, which follows the rules of the camera and tries to emulate it through the game camera. We must immediately say that in Last Stop the player has no power in the visual field. Everything shown passes through the developers' filter, who have set fixed camera points, strategically positioned to make the scene look its best. The result is not always exciting, however it must be said that the Variable State team managed to manage this enormous weight in an excellent way, creating particularly attractive and dynamic shots, able to exploit the graphic weaknesses of the title to the advantage of the visual narration. the editing of the different scenes binds quite well, without particular discordant elements that undermine the pleasantness of the story. Obviously it's not all precise to the millimeter, but it still turns out to be a painstaking, carefully crafted and relatively harmonious work. Video game interactivity Last Stop: Multiple choice dialogues don't seem to have relevant consequences, narratively speaking A video game, in order to be considered as such, must contain a minimum of interaction with the game environment. As these types of titles have accustomed us, the gameplay is narrow to the bone, but it is still present. Indeed, in the case of Last Stop, you can also find segments ranging from the puzzle to the game of skill. Nothing too complex, but undoubtedly an addition that manages to give a little more character to the title, not making the pad move too far from the player's hands. In addition to these short segments, the game is divided into several choice of dialoguesmultiple. There are three answers available and, usually, you have to make the choice within a certain time limit (marked by a circle that becomes increasingly empty). Unfortunately, they don't seem to affect how things unfold much, but rather the immediate attitude of the character you're playing. In short, what you choose to say does not seem to have relevant consequences capable of overturning the narrated events. During our game, only three choices (one per character) had an effective impact on the story. The others seemed rather sideline, only useful to bring the player closer to the various characters. Furthermore, the relative ambiguity of the sentences (perhaps it would be better to call them ~suggestions~) to be selected very often leads to unwanted or unexpectedly altered results, which amplifies the idea of the relative uselessness of our choices, given that the narration will lead always in the same direction. A simple technical compartment Last Stop: animations don't always manage to enhance the narrative The importance of staging should never be underestimated in any type of visual medium. Ultimately, this is what decides a convincing narrative from an unreadable one. Last Stop gets away with it from a directorial point of view. However, in the technical sector as a whole, it turns out to be limping from time to time. One of the main critical points are the animations, very sparse and not very evocative. While the models are all pleasant enough (if at times overly angular and sketchy), the way they move is decidedly mechanical, which is particularly evident when it's our turn to command them through the linear streets of London. This little attention to the movements (in addition to a general cleaning not really successful) negatively affect the narrative experience, weakening some narrative moments that would need more fluid expressiveness. It must also be said, however, that the choice of placing the characters in a world in which every irrelevant living being is represented as a sort of mannequin without distinctive features manages to partially mask these technical flaws, bringing them more towards the direction of a precise stylistic choice that is not a lack or a limit (but we don't believe it much). Last Stop: different sounds for the three stories Another ballgame in terms of sound. In addition to a splendid musical score created by Lyndon Holland, the same composer who secured the BAFTA award for the team's previous game for best soundtrack (the winning team doesn't change), we noticed an obsessive attention to even the smallest details audio, which helps to compensate for the shortcomings mentioned above, but also to create a perfect atmosphere for each narrative segment, characterizing it with specific sounds that, sometimes, manage to speak even better than the individual dialogue.", "date": "2021-07-30", "grade": "8.0"}