{"name": "4 Wheels Xtreme", "ref": "https://multiplayer.it/recensioni/4-wheels-xtreme.html", "text": "The product developed by Xendex is a three-dimensional racing game with an absolutely arcade setting. We will have to show all our talent to emerge in the challenges against the CPU-driven American champions. To progress in the game we will have to overcome a series of events linked together. By overcoming the first one we will unlock the next one or more depending on our performance. Yes, because at the end of the competition we will be judged with gold, silver and bronze medals; this evaluation depends not only on our position in the final classification but also on the time taken to complete the track. The game published by I-Play is divided into four different levels with increasing difficulty, each one is made up of five stages and two bonus events, which become three at the last level. We will only be able to unlock the bonus stages by obtaining all the gold medals. The tournament allows us to compete in different ways: the normal race, the time challenge, duel, the countdown, the checkpoint challenge, the checkpoint battle and the capture the flag. Of the ~race~ it is useless to speak, the ~time challenge~ consists in reaching the finish line with the least waste of seconds, in the ~duel~ instead we will directly face a single rival, the champion of the region. In the ~countdown~ we will have to run from one checkpoint to another before the seconds run out. Checkpoint challenge and checkpoint battle are similar, only in the first we will race alone and in the second against other opponents. In steal the flag, the player who maintains control of it for the most seconds will win, to steal the flag it is sufficient to hit its owner. We certainly cannot say that there are few modes, on the contrary this is one of the undisputed advantages of the game developed by Xendex. At the beginning of the game we will have the possibility to control only one vehicle, but with the successive victories we will be able to unlock others, more powerful and with characteristics that definitely differentiate them from each other. The driving style of 4 Wheels Xtreme is absolutely arcade, accentuated by the fact that we will be able to use the nitro as a turn, to dash like rockets from one bend to another on the course. Technically we are in the presence of a good game engine that certainly does its duty, perhaps more could be expected as regards the level of detail of the cars. The control system is valid even if cornering isn't always an easy task, given that the steering will always be abrupt and all too sudden. PRO Scary arcade Lots of modes AGAINST", "date": "2007-07-12", "grade": "S.V."}