{"name": "Actraiser - Recensione", "ref": "https://multiplayer.it/recensioni/actraiser-recensione.html", "text": "What was it yesterday Halfway between a god game and an old-school scrolling slasher, suspended in fantasy and gothic atmospheres with strong mythological hues, Actraiser was both a demonstration of the technical, chromatic and sound capabilities of the SuperNES, a design experiment aimed at reconciling two genres decidedly distant and an emotional device capable of arousing strong emotions in the player. Actraiser worked on two opposite but complementary tracks: on the one hand it presented itself as a scrolling slasher similar to games like Rastan or Castlevania; on the other hand it resembled a simulator-god game or showed characteristics similar to those of Sim City or games like Populous. In the role of a god committed to implanting civilization on an earth invaded by monsters, the player would have to alternate between descending onto the battlefield and managing the colonization events through a cherub angel flying over the territory. Taking the field would have unlocked access to a section of the game world, through passing a level and defeating a monstrous boss. But this would not have been enough: later, the player would have to defend the outpost from wandering monsters, promote the expansion of the city, favor the climatic conditions and find the hidden resources on the virgin territory of the map to gain mana, level up and power take on subsequent expansion and combat sections with renewed power and new capabilities. The interrelation between the two aspects, in addition to being fresh and exciting in the alternation between planning and attack, gave life to a virtuous circle of design, capable of overcoming the relative simplicity of the features of the individual game modes if considered separately. But if the keystone of Actraiser was in this complementarity, its true soul resided in an audiovisual sector capable of suspending the barriers that separate game and player. What is it today When evaluating games that carry more than fifteen years of seniority on their shoulders, corresponding to three or four ~computer eras~, one is generally led to ascertain the resistance of the winning designs despite the interconnected obsolescence of the technical aspect. Actraiser partially escapes this trend: the game mechanics should show more evidently than in the past the limits already evident at the time, but the artistic aspect of the music and graphics of the game, which have nothing to do with with the latest technology, they join together in proposing, yesterday as today, an original and exciting experience, which has its strength in the fact that the final result is greater than the sum of the parts. Mind you. From a simulation point of view, Actraiser offers nothing in particular to fans of the genre who, on the contrary, would be disappointed by the scarcity of available variables and the guided linearity of the experience. From an action point of view, Actraiser is little more than a Rastan subjected to color steroids, enriched with level bosses of large proportions but fundamentally limited and not very varied. And technically the glitz and artistic taste that uses the colors, parallax and dimensions of many enemies, including dragons, centaurs and chimeras, clash with the paucity of animations and with the visual poverty of the sections with a top view. Yet, together, elements such as aesthetics and the alternation between combat and expansion, welded into a winning general concept, generate an unexpected sense of exaltation, a small videogame epos absolutely sheltered from time. What is it today If there is a glue for all these elements, then it is undoubtedly the music of Yuzo Koshiro, historical music designer and composer of Sega. Koshiro alternates dramatic scores, high-sounding marches, haunting accompaniments and poignant engraved, which accompany the action of the game with a constant sense of interactive crescendo. And it is precisely the compositional quality of the material that makes it exciting in any case, that even today its midi timbres do not pale too much in comparison with the analogue and high definition sound of contemporary electronic games. Just like Actraiser does, a little jewel to be rediscovered for all those who don't experience games with technological performance anxiety. ActRaiser is an absolute classic for SuperNES. And now that it's available in the Wii catalog, no gamer worth their salt should risk missing out. Developed by Enix, Actraiser fulfilled the role of killer technological application for the launch of the sixteen-bit console Nintendo, but was at the same time an innovative hybrid between two seemingly irreconcilable styles of play, graced by an augod and high-level aesthetics. If there are, moreover, games for which the past decades seem to only serve to increase their charm, the original Enix slasher-sim fully falls into this category.", "date": "2007-07-18", "grade": null}