{"name": "Driver: Parallel Lines - Recensione", "ref": "https://multiplayer.it/recensioni/driver-parallel-lines-recensione_a.html", "text": "Similarities and differences As soon as you start Driver: Parallel Lines leaves you dumbfounded: it is practically a port of the Xbox version with some textures adjusted for the occasion. Basically it is a driving game with some stages to be carried out on foot. After the first tutorial missions, you start playing seriously by going around looking for jobs to do (red dots on the map) or by following the main plot (yellow dots on the map). There are enough things to do: chases of other criminals or personalities hated by organized crime; deliveries of hot stuff to ambush spots on the map; daring escapes from the police; escort missions of important characters; car theft; missions in which it will be necessary to discredit rival gangs. In all cases the obstacles will be represented by members of the rival gangs, the police or a time limit, as well as the traffic of New York. If desired, it is possible to take part in real competitions, on a circuit or on the street, with which to accumulate money. The latter have two main purposes: to finance the gang and to repair and modify the stolen cars brought to one of the affiliated garages. It will then be possible to repaint the vehicle or buy better parts to increase its performance, an essential investment if you want to have a chance in competitions. what is indignant is seeing how games are still being released a year later without bothering in the least about exploiting the machine on which they will run Similarities and differences Speaking of vehicles, Parallel Lines offers no less than eighty, between those from 1978 and those from 2006. Most are cars, but motorcycles, trucks and coaches can also be stolen. The differences between the various vehicles are not very sensitive, if not between very different classes. Furthermore, the basic versions are quite uniform. There are some differences, in terms of acceleration and speed, but it is at the driving model level that the biggest gaps emerge. In short, controlling a fire truck shouldn't be as easy as controlling a small car, just as driving a custom one should be more problematic than driving a custom one. Obviously we don't ask for an accurate simulation of each vehicle, which would have ruined the arcade nature of the game, but surely a greater emphasis on the differences would have been good. One of the best features of Driv3r was certainly the model of the damage of the cars, replicated without major changes in Parallel Lines. Despite the years it remains the best part of the entire production, even if the various Burnout and Flatout have gone further by offering more spectacular crashes and expanding the possible damage to vehicles. Run and smash After all, it is not the repetitiveness of the missions that scuttles Parallel Lines or even the plot, as trivial as it is poorly developed. What is indignant is seeing how games are still being released a year later without even bothering to exploit the machine on which they will run. We understand that the PC market does not offer many guarantees in terms of sales, but did it seem bad to eliminate the pop up of vehicles and people? Did it seem bad not to immediately make the bodies of the invested pedestrians disappear and review some of the defects already widely debated at the time of the console version's release? Artificial intelligence is also problematic. The police and other pursuers must have had a crash course in Cepu since they not only occasionally fail to detect blatant infractions, but are also quite poor at pursuit. In short, accustomed to the breathtaking pursuits of Just Cause, which moreover gets along better even in the phases on foot, and to those of San Andreas, we were a little disappointed by the fact that a Driver is the least fun. But we were talking about walking sections. Fortunately they are very rare because, despite the progress made compared to Driv3r, they look disfigured in comparison to the competition. Leaving aside the animations of the characters, who all have some strange movements with an unidentified purpose, the shootings are simply not fun. There is no pathos, there is no strategy. Nothing. You shoot in bursts trying to eliminate enemies before they eliminate us. The more powerful the weapon possessed, the easier the fight is. In such a scenario, looking for cover makes little sense, even for enemies, since the automatic aim makes the search for cover futile. Technically speaking We have already mentioned the technical problems of Parallel Lines, clearly visible from some screenshots, but it is good to reiterate them. Firstly, the graphics are those of the console versions, and therefore are inexorably old when compared to games from a year or so ago. Thetextures are washed out, the buildings look like lifeless blocks and the details leave something to be desired. Just take a walk around one of the city parks to notice the paucity of the graphics sector. The argument is valid both for the New York of 1978 and for the modern one. Even the special effects are poor and poorly done. Take, for example, light cones from missions, sparks from crashes, blurring of screen edges when gaining speed. Everything reminds of distant eras, when DirectX was in its seventh incarnation. And unfortunately, in this case, the discourse that graphics are not everything leaves the time it finds, given that the substance is lacking. The only positive note is the fluidity: excellent on old machines even in the most chaotic moments. The soundtrack is also excellent, with a selection of tracks including Public Enemy, Suicide, Arthur Baker and other bands. Obviously you may not like the genre, but undoubtedly certain songs help the general atmosphere. System requirements Minimum Requirements: Processor: Pentium 3 1.8 GHz or AMD equivalent RAM: 512 MB Video Card: One 128 MB Direct X 9.0c and Shader 2.0 compatible Disk Space: 5.0 GB Test Configuration: Processor: Intel Pentium 4 at 3.4GHz RAM: 2GB Video Card: NVIDIA 7800GT Comment What was a barely adequate game a year ago on last-generation consoles becomes a mediocre game in all respects on modern PCs. Not only does it not excel in anything, but it pays the price of fierce competition that beats it in all sectors. From Reflections we expected a wave of pride to return to the list of the best developers in the world. Today it's only good for fans of the genre who can't wait for GTA IV. The others look elsewhere. Pros Lots of vehicles Smooth even on older PCs Great soundtrack Cons Graphically outdated Gameplay is just passable Trivial story Driv3r would be better forgotten, let's face it. It was an incomplete game released before the end of development to try to curb Atari's financial haemorrhage (the same top management admitted it), which still seems unstoppable today. The result was the discredit for one of the brands that had contributed to the birth of the free roaming genre and that had reaped enormous critical and public success with the first two episodes. What was billed as the anti-GTA instead became its own worst enemy. To remedy the tragedy, it was decided to bring out a sort of counter sequel, this Parallel Lines with the aim of bringing the series back to its former glory. The versions for the consoles of the past generation (PlayStation 2 and Xbox) came out more than a year ago and have not shocked in quality. In the meantime, the Xbox 360 version has been canceled while the PC version (the one of this review) and the Wii version have been confirmed. Furthermore, the game is no longer distributed by Atari but by Ubisoft, which in July 2006 acquired the rights to exploit the brand. Will the guys at Reflections (the developers) have managed to take advantage of this year to improve their game? But let's go in order. The story is typical of all games of this genre: in the role of a young hopeful who has just arrived in the thriving New York of 1978, our only purpose in life is to make a career in the local crime scene to get money and dolls in quantity . To do this we will have to follow the orders of a well-known and powerful local boss and perform a series of jobs that will test our driving skills. Unfortunately not everything will go smoothly and The Kid, the protagonist, will be betrayed by his employers. After 28 years in prison, TK has only one immense desire: to take revenge. Our aim will therefore become to carry out other jobs in a very modern New York to find those who framed us in 1978.", "date": "2007-07-09", "grade": null}