{"name": "The Sims 2: H&amp;M Fashion Stuff - Recensione", "ref": "https://multiplayer.it/recensioni/the-sims-2-hampm-fashion-stuff-recensione.html", "text": "The shop of your dreams Well, your H&M dreams, at least. Because if H&M Fashion Stuff implements a large number of clothes to renew our wardrobe, it is true that a non-secondary part is entrusted precisely to the material added to the brand's premises. In addition to the presence of three new pre-built stores that will fit into the panorama of our neighborhoods, obviously in pure H&M style, the package also includes a good number of accessories with which it will be possible to customize the premises. In fact, we will have at our disposal a series of mannequins, cash registers, clothes racks and changing rooms that we will be able to arrange in the way we deem most appropriate to decree the success, pleasantness and enjoyment of the shopping experience of our virtual alter egos. the focal point of the package is actually the possibility of feeling like a stylist in the first person. In fact, it is envisaged that we can create our own clothes and participate in the opportunity to see them parade on a virtual catwalk on the official website of the competition. The problem, unfortunately, is that in the game, however, we will not be able to parade. Despite the presence of a catwalk available in the H&M stores, in fact, and despite the possibility of creating one's own clothes using the tools made available, those with ambitions for fashion shows will be able to satisfy them only online, at the website indicated or at the official website of the chain of sponsored shops. In fact, this fact left us a little perplexed, given the advertising of the possibility of fashion shows which is made on the back cover and in the attached instruction manual, but in the end we had to accept the fact that this add-on is nothing more than a mere implementation of objects for theme shops and designer clothes from the H&M brand. The initiative is certainly to be considered rather nice, and unusual. If it is not the first time that we have seen partnerships between commercial brands and video games, we are in fact used to seeing them manifest in the form of advertisements and not real game elements as in this case. Nonetheless, we feel a little disappointed in the expectations created. How much variety, what will I wear? In fact, there isn't all this variety. We have to choose from a number of complete dresses, we have practically no upper parts of clothing, while the trousers have what we must consider a certain defect, unless we want to adhere to the belly dance fashion: if worn with the traditional from The Sims 2, H&M's hipster jeans are definitely a little too hipster. In short, an exaggerated portion of the belly is really uncovered. The charm of the navel is fine, but the feeling is that something has not worked in the right direction. On the other hand, the music that has been implemented is very nice, which makes the environment relaxing, especially that of the stores that bring a touch of modernity and freshness to the gaming environment. System requirements Minimum Requirements: The Sims 2 for Windows installed Windows 98/2000/XP/Vista with DirectX 9.0 Pentium III / Athlon 1.3 GHz RAM 256 MB (512 MB RAM required for Vista or more than 5 expansions installed) NVIDIA 5700 /ATI 32 MB RAM T&L DirectX 9.0 Compatible Sound Card 1.5 GB Disk Space 8X DVD-ROM Drive Game was tested on a system with AMD Athlon 3.2+ / 2.00 GHz with 1.5 GB RAM and GeForce 7600GS 512 MB video card, without suffering slowdowns or problems of any kind. Comment The evaluations to be made on this add-on do not differ much from those already carried out for the previous ones. This is the implementation of clothes and objects for the H&M brand stores, an addition that wants to bring a breath of fashion and fashion to the world of Simmini. However, the collection of clothes is rather limited and what has left us most dumbfounded is the absence of the proposed possibility of having fashion shows except at the sites officially dedicated by EA and A&M for a competition. No catwalk, therefore, no interactions with other Simmers, we can only do a little more shopping. However, it is an interesting package to be considered if you don't have an Internet connection or if you want to complete the collection with the proposed additional material. Pros If we want to feel fashionable, this package is for us. and objects No new interactions It is not possible to parade with one's own creations, except via the Internet What happens when a large and established European clothing chain like H&M and a life simulator like The Sims 2 meet? That the Simmers wear designer clothes. And that's exactly what we experienced thanks to the new add-on~stuff~ series, that is the possibility of abandoning for a moment the clothes released in the original game and implemented in its various expansions as well as forgetting for a moment in our wardrobes the clothes created by users, which have certainly superbly enriched our wardrobe. And after having abandoned and forgotten them, we found ourselves experiencing the same emotion in the dressing rooms of the undoubtedly ~fashionable~ and characteristic premises of the H&M stores scattered throughout our cities. And, in fact, the choice we have among the various items of clothing signed by the fashion company is quite interesting, including complete dresses, jeans, t-shirts and various accessories. Even if it must be said that the definitive target of this add-on must certainly not be different from the one who habitually frequents the real clubs, considering that the clothing items for men and children are extremely small in number. In fact, the vast majority of the garments present is dedicated to adult simines.", "date": "2007-07-06", "grade": null}