{"name": "The Fast and the Furious: Fugitive 3D", "ref": "https://multiplayer.it/recensioni/the-fast-and-the-furious-fugitive-3d.html", "text": "In fact, thanks to the license of The Fast and the Furious, the American software house has created a series of racing games that have proved to be real blockbusters, reaching the enormous number of 7 million downloads since their debut. In reality this episode, subtitled Fugitive, was not born with any film behind it, but on the contrary it was created by the programmers on the basis of an original plot that ideally fits between the first and second film episode. The protagonist played by the player is Brian O'Conner, an ex-cop on the run from one part of the United States to another for reasons that we prefer not to reveal so as not to spoil the surprise. The game, as easily understood, is a racing game mainly based on clandestine races and souped-up cars, therefore very similar to the last chapters of Need For Speed by Electronic Arts. And also from a graphic point of view the similarities are evident, in particular with the editions that appeared on GBA; it is therefore a rather good 3d considering the capabilities of current mobiles, but which finds its best aspect in the great fluidity of the action, in the visual depth and in the robust frame rate. The models of the cars, while not being able to count on real licences, are in any case credible and well modeled; the tuning component, both for the modification of performance and as regards the aesthetic aspect, is decidedly full-bodied enough to make all enthusiasts happy. The game structure, in the main mode called ~story~, allows you to take part in competitions of different kinds within four cities: Los Angeles, Santa Fe, Baton Rouge and Miami. Each city brings with it both classic competitions against opponents and missions with specific objectives, such as eliminating an enemy with doors or escaping from police cars. In any case, the goodness of the track design provides an extra stimulus in tackling the races, thanks to the numerous crossroads and shortcuts present that stimulate the player to find faster ways to reach the finish line. The driving model, on the other hand, cannot be particularly complex, both due to the technical limits of mobile phones and due to the purely arcade mold of Fugitive. Therefore, controlling the car is all in all quite simple, and there are no major differences between the different models; for example, even when cornering at full speed it is impossible to drift or lose grip, and the management of damage and impacts is rather approximate. The sound is acceptable, with very few effects but on the other hand with some spot on and not annoying songs. More generally, the effort of I-Play reveals itself in all its aspects as a well-finished and well-made game, without serious flaws or evident shortcomings. PRO Curated in every respect Fun Good graphics AGAINST Shallow drive pattern Minimal sound effects", "date": "2007-07-03", "grade": "S.V."}