{"name": "Mario Party 8 - Recensione", "ref": "https://multiplayer.it/recensioni/mario-party-8-recensione.html", "text": "Cut 'n Paste Design Mario Party was and remains a game intended for multiplayer, and the eighth episode of the main series is no exception: the ubiquitous card-collecting modes to win extra rounds in the options, the single player or story mode, the possibility of replaying the mini-games separately from the game on the board, or placed in slightly different contexts of advancement (free play, relay, best of five, and so on), were and remain extras that barely affect the flavor of the main course. And the main dish is the game board on which, up to a maximum of four players, chase the stars, accumulate coins, wait for the turn to challenge the others in daring mini-games, minimal and essential as fun and capable to unleash joypad boycott neighbor syndrome. In this sense, Mario Party could also be able to confirm the annual success of a series which, despite the progressive disenchantment of critics, who have well noticed the stagnation of the formula, continues to reconfirm itself in sales. It is also true that with Mario Party 8 the historical maximum of repetitiveness has been reached, resulting in a production level that many critics have rightly defined as ~cut and paste~, and which is particularly evident if the following aspects of the game are kept in mind . Firstly, the introduction of the series on Wii has not brought the expected benefits, namely a profound rethinking of the interaction system, a streamlining of waiting times, a more intuitive and fun control, but it tastes like the last conversion -minute from a project born for GameCube. This finds embarrassing confirmation in the observation of how Mario Party 8 is the only Wii game not to support 16:9 (be prepared for sidebands), but this is not the only one. The mini-games, the highlight of each episode of the series, are here as usual about fifty, but they seem more beautiful to look at than they actually amuse. Comment Mario Party 8, like all episodes of the series, has real multiplayer potential. The board, the mini-games and the pure and simple fun that ensues in at least three players can be worth the purchase of a product that, not surprisingly, has been back on the shelves practically identical for ten years. The point is that the mini-games often work poorly this time due to the lack of effort in the conversion of the control system, and that the productive choice of eternally reselling the same technology can no longer be forgiven: Mario Party adds absolutely nothing relevant to the series and, on the contrary, it seems to curl up in its defects, experiencing a decline that gets worse from year to year. It certainly doesn't seem like yesterday when we complained about the lack of innovation for the fifth episode, and today we find ourselves at the eighth, on Wii, and nothing seems to have changed except for the worse. The Wii-style control does not exploit the technology adequately, the technological presentation and production are recycled from those of systems of one or more previous generations, and all the typical defects of the series, such as dead times and boring dialogue, have remained identical . Mario Party then proves to be a game certainly capable of entertaining, but only if you are a huge fan of the series, if you have at least two friends willing to play with you and if you don't already own more than one previous episode of the series. Pros: Fun in Multiplayer Some mini-games work great Cons: Unsustainably slow in single player Presentation and production bordering on annual recycling Poor actual use of the Wii-mote controller Mini-games: between old-school approach and wii-mote While many are ostensibly designed for the Wii controller, all of the mini-games betray a common origin and subsequent ~reset~ on the Wii interface. Thus, in some cases, functions that intuitively appear the same to the player are fulfilled by different control styles. Variety, freshness of approaches? Not exactly. Having to control go-karts, from time to time to hit balloons before your opponents or to reach the finish lines first, you will find yourself tilting the controller left and right while kept in a horizontal position and therefore using the wiimote, but the feeling control will not be as faithful as in applications such as WiiPlay or Excite Truck. The control will prove, however, cumbersome and, combined with the use of the A key in a vertical position, slightly botched, capable of giving the player very little of that breath of freedom in the interface promised by the potential of the Wii controller. There are few fun mini-games based on the Wii controller, but there's certainly no shortage of them. Row a single paddle coordinated withanother player is very shallow but damn hilarious, as is hitting baseballs. But even when hitting the balls with a club is fun and immediate, there is a lack of freedom in movement, and moving a club translates into a gesture that is just as minimal as pressing a key in the traditional way, subtracting meaning from the experience. In this sense, even when the characters walk in a completely traditional way by holding the controller horizontally like a pad (as in the mini-game in which it is necessary to punch each other in the face and recover the gems hidden in the icicles), the unclear alternation in the approach to the game generates a feeling of vague confusion, it is immediately evident as a work of hasty recycling. And it betrays the absence of an attempt to innovate, to understand how to make the experience evolve by exploiting a new support rather than easily implanting minimal variations on the usual, hackneyed formula. Different day, same system The fulcrum of Mario Party, the soul of the series, thus falls exclusively on the mini-games which, although in most cases not very fun and equipped with inaccurate mechanics in terms of control, are as always present together with the board, the skirmishes for position changes and accumulated coins, to sprees with the controllers that have made the fortune of the series. Unfortunately, however, the moments of pure fun of the best mini-games do not last long, and the return to the board is mostly an occasion for boredom and annoyance due to the ubiquitous dead times between game rounds. To make the judgment on Mario Party 8 particularly serious there is also the fact that the copy-and-paste attitude of the formula has included a total disinterest in improving the existing defects in the series, sanctioning an eternal postponement that is no longer bearable . The dialogues and the times that elapse between the rounds of rolling the dice are often superfluous and cannot be skipped, even sanctioning an involution compared to some previous chapters of the series in which it was at least possible to vary the speed. An attempt to endow the game with a somewhat Wario Ware-esque pace, made up of style and speed in turns, or at least a set of options with which to regulate the pace in which to tackle the game would have been very welcome, but dead times are left and, if four pass more quickly, are particularly unsustainable in two or even one player. Fortunately, the presence of free play modes without the board ensures adequate use of the best mini-games, but it is difficult that a handful of good games, none of which have original mechanics compared to those of the other seven chapters, can justify the This game is a purchase for anyone who isn't a huge fan of the Mario Party experience or doesn't have like-minded friends. Then it must be said that Mario Party does not excite at all from a technical or artistic point of view: in Hudson's latest product, we witness the same graphics, the same presentation, the same technology used for the chapters of years and years ago , used for consoles a couple of generations back. The paucity of presentation, options and design research find a clear parallel in the graphic and aesthetic presentation: while the hardware generations tend to become more powerful, the Mario Party series remains at an N64 technical level on steroids, daring to present itself with frame rate drops and knows an aesthetic crystallization that makes the boards, character design and characters more flat and banal every year, condemned by the Hudson Soft team to a non-place limbo, from a third-level entertainment chain. While the Mario and Nintendo universes expand, diversify, evolve and cross and come to reflect and joke about their own foundations (Smash Bros and Paper Mario brands above all), Mario Party remains nailed to a characterization from the profile of pure merchandise and offers no more original gimmicks to Nintendo fans than a licensed cereal box. The Mario Party series was born just under ten years ago, consecrating in a real annual event what video games had already tried to do for years: hybridize with the game of the goose and present themselves as interactive versions of the board game . Offering an alternation between progress on interactive boards and a series of multiplayer mini-games, Mario Party has built an intelligent and successful advance-and-challenge system, which has given the series a truly consistent longevity. Landing on Wii, Mario Party 8 brings the brand to its tenth effective chapter, and to the third generation of home hardwarenext game since the first episode on Nintendo 64. The formula, however, already unsustainably stagnant for at least three years, seems to have reached the decisive terminus and even the expectations of those who hoped that the Wii controller would bring a necessary breath of fresh air into the series seem , unfortunately, highly disregarded.", "date": "2007-07-03", "grade": null}