{"name": "Jewel Quest II", "ref": "https://multiplayer.it/recensioni/jewel-quest-ii.html", "text": "Armed with our trusty Nokia N70, we carefully tested the latest I-Play product, Jewel Quest 2, a little gem that quickly leads to addiction, and which will soon force you to spend every free minute moving jewels that are on the screen of your mobile phone. The concept is simple and closely resembles Tetris, only that here the blocks are made up of gems and are static, in fact they do not descend from above but we will have to move them on the playing field, simply by dragging them one at a time into the adjacent box trying to form chains of three or more gems of the same color. Once these chains are formed, the gems in question will disappear, leaving room for others that will fit into the hole created. Once we get the ~disappearing~ effect, in addition to earning points we will see the land turn into gold, fulfilling the purpose of the game. In practice we will have to form the chains over the entire surface indicated on the screen, completely changing it into the precious metal. We sincerely hope that you have been lucky enough to play the first chapter since this sequel is really complex, immediate yes, but with a particularly high difficulty that will put you to the test after just a few levels. After a few successful missions we will be asked not only to transform the ground into gold, but to subsequently turn it into silver after having covered it with new jewel chains. Don't forget that every challenge will be a race against time, a relentless stopwatch will mark the few minutes available to us. The greatest difficulty we found was to create the right combinations to go and fill even the strangest corners of the two-dimensional playing field, in fact some areas are difficult to reach except for careful planning of the strategy. If nothing else, the ~gold~ function comes to our aid, enabled by a special button located on the left of our mobile phone. This option is activated only by our skill and that is only after having composed long chains of colored gems, it will allow us in a few words to change the single box we have chosen into gold. The game engine of the I-Play title certainly doesn't put the hardware on which it can run on the ropes, it's all two-dimensional, certainly colored but nothing more, it still manages well in the function for which it was created, making the gaming experience very agreeable. PRO Addictive Immediate and suitable for short matches AGAINST Very difficult", "date": "2007-06-27", "grade": "S.V."}