{"name": "Fight Night Round 3", "ref": "https://multiplayer.it/recensioni/fight-night-round-3.html", "text": "Yes, because the aspect that immediately catches the eye when playing Fight Night Round 3 is undoubtedly the graphic component, totally polygonal and of excellent workmanship: the bulk of the work was obviously done on the boxers, reproduced in a credible way and with a good level of detail accompanied by defined textures. Even the animations, considering the mobile platform, are of high quality and help to define the realistic mold that has always distinguished the EA series. In fact, Fight Night Round 3 is not an exponent of the ~Punch Out~ genre; on the contrary, the will of the programmers has always been to make the experience as close as possible to the real counterpart, and this philosophy is also an integral part of this mobile episode. Therefore, in the main mode, the career, it is possible to create a boxer from scratch by choosing the somatic features and the color of gloves, shorts and shoes; but the most important aspect is to manage statistics such as strength, endurance, heart and so on, first assigning the points available by default, and then gradually adding those earned from victories in the ring to thus grow and improve your alter ego . The progression within the career, initially simple against very weak challengers, soon becomes much more demanding, forcing you to guarantee a certain commitment of both time and concentration to successfully complete the match. Fight Night Round 3 is certainly not a ~simple~ game, and the use of most of the keys on the mobile phone keyboard confirms it: the variety of punches available is remarkable, as is the possibility of parrying high and low blows, to perform incorrect actions or to provoke the opponent. The limits of the interface come to light partly due to the ease with which you can press the wrong key without wanting to, but above all due to the very limited mobility of your legs, given that it is only allowed to move forwards or backwards . But even with these cuts, playing the EA production is undoubtedly pleasant and stimulating, above all for the excellent management of the challenge factor which invites you to continue continuously in an attempt to climb the world rankings until you reach the top. On the other hand, the sound is insufficient, with few sound effects that rarely interrupt the total silence of the matches. PRO Great graphics Fun and challenging Stimulating AGAINST A little too ambitious Reduced mobility of legs Insufficient sound", "date": "2007-06-26", "grade": "S.V."}