{"name": "Armored Core 4 - Recensione", "ref": "https://multiplayer.it/recensioni/armored-core-4-recensione.html", "text": "The most loved and famous mech series in the console world lands on Next Gen consoles, with the tenth episode of the Armored Core saga. Don't be fooled by the numbering, in fact the number 4 we are going to tell you about does not take into account the first chapters that appeared on other gaming platforms. Every fan of robots and manga/anime with a sci-fi setting, like Evangelion to be clear, cannot miss a look at the new Sega product. History? The story behind the main mode of the title developed by From Software, the classic ~campaign~, is actually quite trivial and only provides the motivation to see our mech involved in exciting battles. The world of the future in which Armored Core 4 is set has been devastated by an atomic war, the survivors find themselves oppressed by six large corporations led by men greedy for power, our character fits into this dramatic setting, who will find to fight together with a group of rebels to escape the oppression of the powers that rule the world. The 35 missions plus the two bonuses present a fairly low level of challenge, which only increases towards the end of the game. The title From Software follows a linear trend since each chapter consists of different levels and to face the next one we will have to finish the previous one, it is however possible within the same chapter to choose the order in which to face the proposed challenges. The typology of the levels is quite varied but does not introduce anything new in the genre, it will be a question of destroying all the enemy mechs that we will encounter, escorting certain convoys or structures on the ground such as bridges or buildings. The variety as mentioned is not lacking but certainly the brevity of the various levels is quite annoying. Before each fight, the objectives will be introduced by a well-curated briefing that will highlight every decisive aspect to complete our task. Before starting, a short tutorial is proposed, which in truth could also be omitted given the simplicity of controlling the mech and the clarity of the information on the screen. In fact, the HUD provides us with the status of our ammunition, the armor level of our robot and that of the available boost in real time. Fast and tuning! One of the features that has always distinguished the saga, and that also in this new chapter could not be missing, is the ability to customize our robot. Once the campaign missions have been successfully completed, we will receive a cash reward that we can use, either to buy a new robot or to upgrade the one we already have. The tuning is very detailed and in addition to the choice of new colors for the vehicle, it will allow us to insert all types of new weapons, which will obviously affect the remaining part of the Campaign still to be completed. Technically, the 505 Games title suffers from too many ups and downs, the robot models are rich in detail and show a truly exceptional attention to detail, the other side of the coin, however, is made up of too sparse arenas, a visual horizon that is too limited by the  fog artificial and with far too dull colors. We have already said about the animations that they are not up to par, and in the same way we can only censor the very inaccurate collision management. The explosions, particle effects and lighting, on the other hand, are well done. The multiplayer has not been neglected by the developers of From Software, allowing clashes through the split screen, the system link and of course Xbox Live. The arenas also in this case are a bit too small and not well cared for but still allow you to play up to 8 players at the same time, divided into teams or in a large and chaotic Battle Royal. Conclusion Armored Core 4 follows in the footsteps of its predecessors, not presenting significant innovations and trying to make the most of the new potential of the next generation. If all in all the game is discreet, the technical part is decidedly subdued with a limited horizon and with meager and poorly cared for scenarios. The only notable exception is the detail of the mechs and the care for particle effects. The development of the title is linear, with a superficial plot and which immediately presents itself as an excuse to stage the fights that take place in unfortunately too short missions. We recommend it to all Mech enthusiasts, all others should think twice. Pros: Mechs in the next generation! Good control system Cons: Technically subdued Missions too short and simple Goals 360 Armored Core 4 offers the usual 1000 points divided into 39 objectives (8 of which are secret), the task is up toquite simple if you want to get around 500 points, to get to have them all, however, you will have to play each mission over and over again in all of them in different degrees of difficulty, dedicating a lot of time to the Sega game. Fast and swift as rockets The control system is fundamental in a game that involves immediate and death-defying battles against other robots willing to do anything to destroy us and the rebel organization. The developers, thanks to the experience in the field given by real ~pearls~ of the recent past, such as Chromhounds, have provided immediate and intuitive controls that in a short time allow the player to take possession of his war automaton without hesitation. Control of the mech is centered around the left analog stick, while the right analog stick controls the view. By pressing the left stick we will also create a convenient lock-on on enemies, while at the same time the best distance from the opponent will be displayed on the screen to be able to carry out a winning attack. The task of managing the arsenal has been assigned to the A, B and X keys, while our energy for the boosts has been assigned to Y. The dorsal triggers complete the work by changing weapons and allow us to make acceleration shots. The movements of our mech lend themselves to more than a few criticisms, presenting animations that are sometimes woody and decidedly not very fluid, inadmissible on a Next Gen console.", "date": "2007-06-28", "grade": null}