{"name": "Pirati dei Caraibi: Ai Confini del Mondo - Recensione", "ref": "https://multiplayer.it/recensioni/pirati-dei-caraibi-ai-confini-del-mondo-recensione.html", "text": "Sponge! Gallows pendant! As for the actual game, we are dealing with a third-person adventure/action title, where fights against hordes of stubborn enemies will be alternated with the classic moments of exploration and solving simple puzzles. Eurocom, i.e. the developers, looked around to get ideas for creating the combat system for their game, and they saw that currently a winning model is the one that combines free combat with pre-calculated events that require the pressure in sequence of some buttons. This system launched to good effect by Resident Evil 4, has been taken and developed beyond expectation from the PS2 action revelation God of War, raising its level of integration while raising its depth and level of challenge. It is clear that in the future, this mix of genres will dictate the directives for the combat system (just think of Heavenly Sword), at least until even more intriguing solutions are found. We were saying that the developers have treasured what they have seen in these years of action games and have tried to re-propose this vision in their game as well. The result is rather classic third-person fights, which will sometimes require pressing the C key to start a micro-scene (the actor throws a coconut at the marrano's head) which will facilitate the fight, which will then restart normally. In some precise game moments you will also be called to perform other combinations with the pad, always suitable for overcoming the challenge. The actual fights, on the other hand, are carried out using the sensors of the wiimote. There are three recognized gestures, the horizontal attack, the vertical one and the lunge, which can be performed at the end of the combo (replaced by the keys in the ps2 version). The attacks are recognized quite well, sometimes something is lost, but it is not easy to succeed in the midst of the fighting fury to be able to perform a precise movement even if it is simple as a vertical or horizontal jolt. When you are surrounded by enemies it usually ends up that you start messing around like crazy. By keeping calm, on the other hand, you can almost always do what you want. The combat system also takes into account the number of combos that you can chain (in the end you will unlock 4 types) without being hit and without downtime. The combos will serve among other things to meet the criteria of one of the side missions that will always accompany the main one. The game setting is the classic one of fixed shot games. The camera is stationary in one point and will change the camera angle as the player moves through the level, sometimes hiding enemies and more or less fundamental parts or objects during the clashes. Interaction in the world is quite limited, and characters don't have a huge move set, can move around the level and use sword (or other weapons) to smite enemies. There is no jumping, and all extra actions will be performed by pressing the C key in context-sensitive areas. Example: there is a rope, by pressing C the character grabs it and uses it to get to the other side. Am I the captain of this filthy ship or not? The game is divided into levels that describe precise moments from the two films. Each level carries on a story, but in the meantime you can also worry about completing the sub-quests, which can go from helping some henchmen or damsels, to collecting some bonuses hidden in the crates to break and winning the sub-games inserted in the outline of the whole : dice and texas hold'em up (which are now everywhere, it seems that even the Mulino Bianco is moving in this direction for the collections in its snacks). Basically there are always common goals, but almost every level offers its own. The achievement of these missions will favor your fame, and will guarantee you access to some unlockable bonuses which, however, can also be won in a secondary mode of the game, which we will discuss later. Even the adventure in general, which in the end always and in any case required going from point A to point B, tries to renew itself over time by presenting some variations, which in truth fail in their intent. From time to time, real quicktime events will also start that the game calls ~Jackanisms~, both in exploration and in combat, some will necessarily have to be completed and will be repeated until victory, while others can be attempted only once in the game, and if completed correctly they will unlock some bonuses. The movements required are in addition to pressing the A and B keys, the vertical and horizontal movement of the wiimote. One of the issues related to the versionand Wii (which is otherwise identical to the one for PS2) is that the movements required are quite intense, not necessarily large, but decisive. So during the fights it is easy to tire both the wrist and the whole arm, also because they are quite recurring, interrupted only by a few minutes of pause dedicated to exploration. Frankly however, it seems to us that the adjustment of the sensor could have been made with more care. More generally, however, the other problems of the game are a chronic banality and its short development time. It is noted on more than one occasion that the game lacks the finishing touches. Game sequences are truncated unexpectedly, such as fights or failed quicktime event stages being interrupted and restarted without any message or feedback. On the first occasion it seemed to us that we also ran into some kind of bug. Some of the cutscenes themselves, suffer from a frankly embarrassing backwardness at times, some seeming to come out of a high resolution N64 game. For the rest in this sense, we are in the medium productions of tie-ins and games in general, for GC and PS2. Sometimes some textures surprise, and the use of the color palette is certainly good. The thing that disappoints the most however, always speaking of the technical aspect, is the creation of the water that is really approximate, in a game where the water is staged so many times then, the disappointment is double ... but you know, time he is tyrant. Closing the disappointing picture is the screen format, an antiquated 4/3. In addition to the main campaign there is the section called ~challenge~ which can also be played in multiplayer, and where you will have to complete three missions in each game level. Respectively they are the killing of a certain number of enemies, the achievement of a high combo, or the collection of a certain nest egg to be earned by killing enemies. Have you found the thread that binds them? It's always about killing enemies. 360/PS3 version The review you are reading refers to the Wii/PS2 version, different from the one for 360/PS3, but if the game system is different, what doesn't change is the general quality of the title, which stands at the same mediocre levels. If graphically the versions for the new generation are not bad at all, the same cannot be said of the rest. In fights, the combos disappear and give way to a more articulated, but still repetitive and truly elementary attack system. The expanded platform sections do not allow practical advantages to be drawn in level design solutions, and the puzzles are not even better than those seen on the Wii / Ps2. It is like a cake prepared with different ingredients, which seems more satisfying to the eye than the previous one, but which actually has the same bitter taste. Off the trampoline also these versions, maybe next time. Comment Pirates of the Caribbean: At World's End, will surely delight the youngest admirers of Jack Sparrow or those who are so fascinated by the character that they manage to overlook a hasty realization and lack of ideas. The combat system works for the most part, the missions seem varied in background and objectives, but they all resolve in the same way. It must be said to its advantage that some fights or game points are quite cinematic and manage to capture the original spirit of the film. The adventure can be completed in about 5 hours, but you can go back to playing to unlock all the secret characters or bonuses, either by replaying the missions to complete the objectives, or by carrying on with the single challenges (these too can be unlocked by advancing in the game). Technically it comes with ups and downs (many) enough, little, especially on the Wii, which for now seems destined to host conversions of a console from 7 years ago. Pros Two films in one game Lots of unlockable and playable characters Cons Lack of ideas and stimuli The adventure lasts about 5 hours Hurried realization After the global success of the third film, recently released and which once again tells the exploits of the unthinkable pirate Jack Sparrow, brought to life by the eccentric acting of Johnny Depp and his misadventure companions, the new licensed game also arrives . Although the title refers to the third feature film, the story of the second episode (The Dead Man's Chest) is also narrated in the game. You can play both the effeminate Jack and the rest of the crew, such as Will Turner, Elizabeth Swan and Barbossa. The digital reproductions are all quite similar, and particular attention has been paid to the funny movements of Jack Sparrow. The least successful copy is probably that of Keira Knightley, perhaps a hidden compliment, as if not even a pcharacter modeled to taste may be able to rival the authentic beauty of the actress.", "date": "2007-06-22", "grade": null}