{"name": "Wario: Master of Disguise - Recensione", "ref": "https://multiplayer.it/recensioni/wario-master-of-disguise-recensione.html", "text": "The usual suspect The adventure begins with a very bored Wario in front of the television: without warning his attention is captured by a program in which a funny thief, who calls himself Silver Zephyr, spreads in criminal enterprises to the limit of the incredible, all thanks to a magical talking wand, Graziano, which allows him to transform himself into whatever he wishes. The rest is easily imaginable: the thirst for treasures and robberies that has always characterized Wario, perhaps just a little dormant in recent years, comes back to the surface, and so in less than no time ours finds itself facing Count Cannoli (this is the real name of Zefiro Argentato...) for the possession of the wand. Graziano thus changes ownership, the Count is still a tough nut to crack but what began as a simple challenge for whoever turns out to be the best thief around (and now Wario calls himself none other than Brezza Olente...) soon becomes a adventure in search of the pieces of the mythological Pietra del Desio, a legendary artifact which, it is said, will allow its owner to see his every wish come true... A large part of the game mechanic consists precisely in figuring out which power best suits a situation The usual suspect The search takes place across ten levels and a slightly lower number of settings, with a peculiar level design which, combined with the system of disguises, gives Master of Disguise a strong puzzle game aspect, in which the reasoning on how to pass a certain point or how to seize this treasure often takes the upper hand on quick reflexes and manual dexterity. The control system involves the combined use of the directional cross (or push-button panel for left-handed people) for movements, and stylus + touch screen for all other actions, numerous depending on the disguise we wear. And, needless to say, even the use of disguises, to be found and strengthened throughout the game by finding certain gems, is subject to particular drawings to be made on Wario's sprite. A large part of the game mechanics consists precisely in understanding which power best adapts to a situation, if the greater agility of the normal thief outfit, the possibility of shooting of Wario Astronaut, the ability to create blocks from nothing of Wario Artista and so on ... The levels are then overflowing with objects to collect, whether they are trivial and not very precious coins up to very precious treasures hidden inside some chests, to obtain which you will first have to face a mini-game, of different types and difficulties, all to be played with a stylus and all made with skill, but never particularly exciting as one would expect when the words ~Wario~ and ~minigame~ are associated ... A heartless thief? The obstacles that stand between Wario and his insatiable thirst for precious are of many kinds, from sensitive enemies each to a different power to various puzzles, up to the same labyrinthine nature of the levels that will very often lead you to return to areas already visited by reinterpret in the light of the new powers acquired in the meantime. On paper all this, together with the disguise system, is well thought out and nothing seems to have been left to chance, but unfortunately you will soon realize that the Suzaks have limited themselves to carrying out the task according to the rules without adding anything in particular and above all without groped to touch those ropes that the great video games, or more modestly the ~only~ very entertaining ones, always know how to move. And so here are the fights that, once the enemies' weak point is discovered, turn into a monotonous routine to be faced over and over again due to the massive backtracking and respawn of the enemies, or the puzzles that manage to be sometimes annoyingly detached from the context without however requiring a mental commitment worthy of the name. Here, above all, an unnecessarily complicated level design in which backtracking, which in the great Nintendo adventures is always an exciting source of pleasure, becomes more of a nuisance to the point of making the entire progress in the game unappealing, and a disguise system that pays the price for a non-optimal management of the touch screen: in order to carry out the various drawings one must in fact be very precise, and this does not go along with those moments, numerous despite the after all bland gameplay, in which a very quick change to get on top of a situation. The fact that energy is often lost not because of the difficulty in and of itself but because the screen has not interpreted your movement as due, is obviously a source of great frustration... the Suzaks limited themselves to carrying outere the task according to the rules without adding anything in particular A heartless thief? The situation resumes when we talk about graphics and presentation: we are in the realm of delusional humor that has characterized Wario's videogame performances for quite some time now, but declined in a different way than the acidity of Wario Ware, with strong influences ~ kawaii~ and super deformed Japanese, for a singular and successful encounter between insanity and assorted cuteness. The main sprites are well done, and despite being smaller than what we remember in the other Wario platformers, rich in detail and animations; the same cannot be said for the enemy sprites, which suffer from a singular lack of coherence in style and which in general are much more cobbled together than the protagonist and his nemesis, and not even in the backdrops, in any case detailed, colorful and well designed, it is possible to see a particular flash of personality that makes them stand out from the anonymous mass of 2D platform / adventure games. We end with the sound, but the speech is no different: anonymous music (it's a more serious sin than one might think in a platformer produced by Nintendo!) is answered by a little present but amusing speech, which contributes well to the characterization of the whole together with dialogues, as usual, extremely absurd. The Suzaks worked hard to package a product without any particular flaws, technically sufficient, well thought out and in a word complete, but unfortunately they forgot to put their heart into it. All the limits of Master of Disguise can ultimately be traced back to the lack of care placed by the team in what are the elements of each game capable of arousing sincere and spontaneous amusement in the player, and thus completing Wario's last adventure it will often take on the contours of a duty and a job rather than a pleasure in itself, as a video game should be. MoD remains a well-crafted game, but considering the protagonist, his glorious platform origins and the branding of the production, we can only be a little disappointed. Pros It's all very interesting on paper Great characterization and plenty of humor Cons tactile recognition Complicated and heavy level design In general, the heart is missing Oh yes, lately the Nintendo anti-hero par excellence had evidently discovered a vein that was too greedy not to exploit it properly, that of Wario Ware's delusional mini-games and his many incarnations... So much so that perhaps not everyone remembers that the twin lost and bad of Mario and Luigi was born first as the final boss and then as the absolute protagonist of a series of platformers, the Mario/Wario Land which on Game Boy, until a few years ago, enjoyed clamorous and deserved successes. And it's actually since the last Wario Land, the 4 released in 2001 on GBA, that the very pot-bellied garlic eater hasn't ventured into an adventure made up of jumps, labyrinths, treasures to find and the occasional blow; six years have passed in which ours has ventured into every imaginable videogame profession, could it be that now he has lost a bit of his edge?", "date": "2007-06-19", "grade": null}