{"name": "Phoenix Wright", "ref": "https://multiplayer.it/recensioni/phoenix-wright.html", "text": "If you've played a Phoenix Wright title on Nintendo DS, you know exactly what to expect on mobile. The transposition of the game, in fact, is really successful and fits perfectly with the technical characteristics of the current terminals. After all, we are faced with a simple mechanic, which wisely fits predetermined sequences with moments of interactivity. This is how things work: we are introduced to the case and its protagonists, then we move on to the trial in the courtroom and the walkway of witnesses. Between one deposition and another, reports and evidence are presented to the court which can be analyzed in an archive that is always accessible. The key to solving any case is carefully analyzing each statement, pressing the witness where his story seems unclear to us or presenting evidence that disproves it entirely. As a false deposition is dismantled, elements come to light that will then allow the case to be closed. On a technical level, Phoenix Wright's conversion is excellent. Most likely the developers limited themselves to resizing some images and thinking of alternative ways to display the texts and access the menus. Whatever the workload the team had to endure, the result is technically one of the best products out there, in this case both in terms of graphics and sound. The character design is impeccable and the characters boast a good number of different expressions, which is accompanied by a sound commentary that is finally up to the task, both in terms of the music (rather varied and catchy), and for the voice effects ( ~Objections!!!~). It's really a shame that such a well-crafted, engaging and innovative product (as far as wireless gaming is concerned) is also so terribly short and short-lived: in order to create a sort of ~episodic~ publication, Capcom thought of including only one level of play, effectively making this Phoenix Wright more like a beautiful demo than a full product... PRO Technically excellent Very addictive Perfect conversion AGAINST Absurdly short", "date": "2007-06-19", "grade": "S.V."}