{"name": "La recensione di Gorky Zero - Beyond Honor", "ref": "https://multiplayer.it/recensioni/la-recensione-di-gorky-zero-beyond-honor.html", "text": "Moving on to the technical side, the Jowood on production goes beyond mere functionality: it is true that it does not affect the gaming experience in the strict sense and that there is some bright light effect, but the polygonal composition of environments and characters is rather modest, still most evident in the cut scenes made with the same engine as the game. The virtual actors then do not have a set of animations remotely comparable to those of their direct competitors and this is an element of primary importance in a stealth game. The virtual actors do not have an animation set comparable to those of their direct competitors and this is an element of primary importance in a stealth But even in this case the major flaw is the repetitiveness: if we exclude some chromatic variations, the 8 levels of play are practically completely identical to each other and this element will not go unnoticed even to the less expert eye. The positive note comes from the very minimum hardware requirements: think that the recommended ones stop at 800 mhz for the processor and 32 megabytes of memory for the video card: more or less what is required by Doom 3 and Half Life 2 Moving on to the sound component , a decidedly positive judgment for the dialogues present (remained in English but with subtitles in Italian), and also the background compositions are always punctual with respect to the action and capable of increasing the adrenaline-pumping production rate especially in waiting situations. The problem, also in this case, is a lack of variety in the tracks present. Perhaps Metropolis Software has misinterpreted the well-known Latin saying ~Repetita Iuvant~. Two visuals is better than one An element that distinguishes Gorky Zero from its direct competitors is the presence of a double view which also affects the interactive experience. The first shot is very close to the one seen in the Commandos saga or a bird's eye view with a wide visual horizon. In this way our Sullivan will be able to perceive the various obstacles present in the environment (also helped by the map which also displays the human presence) and therefore try to act in the best possible way. Pressing the space bar, the camera will move just behind our backs, making the perspective very similar to that seen in Kill.Switch (a title with which there are not many other matches anyway). Shifting our attention to man-machine interaction (of the double view we are talking about in the specific box), Gorky Zero has an excellent command system on its side: in addition to the keyboard (set by default in a practically perfect way) with which we will have control of movements of our alter ego, the interactivity of the environment will take place via mouse. It will be sufficient to click with the right button on a killed soldier or on a security system to be ~cracked~ to bring up a drop-down menu in which we can choose the action to be performed. The pointing system takes place via the mouse with a rather showy viewfinder to be placed in the middle of the forehead of the various antagonists and it will be important to be as precise as possible for a quick and above all silent elimination. Although the elements that I have exposed to you are not original taken individually, their combination proves to be effective and capable of keeping up with the noble titles already mentioned above. I hate repeating myself If potentially we have a satisfactory product, also in terms of weapons (sawn-off shotgun, normal and silenced 9mm pistol, uzi submachine gun and the indispensable knife to kill bad guys by surprise) and many ultra-technological gadgets available, when it comes to taking the field there are many perplexities, above all related to the level design which suffers from one of the worst defects for a stealth game: repetitiveness! The eight levels, in addition to being almost identical in structure (huge floors made up of warehouses, clinics, dormitories and rooms used for security) they will make us constantly wander in search of the right computer that will unlock that indispensable door for the purposes of the mission with the only variation of the obligatory steps in the huge ventilation duct. A rather gross mistake made by the programmers was not to distinguish the interactive elements from the exclusively decorative ones, forcing the player to get close to all the computers and machines he will come across (in some rooms there are even dozens!) to find him: in addition to make the game more difficult, this operation will prove easily annoying especially when we have repeated it hundreds of times. Mine doesn't want to be a total slam because the tension that so many situations create in the player is to be appreciated but certainly Metropolis Software will have to do a better job in the future especially in beta testing: GZ is really too difficult and one gets frustrated much, indeed, too easily. The guards are too monstrously ready to react to our every little mistake and the lack of an indicator of our visibility / noise makes the task of us poor players a truly difficult undertaking. Perhaps the professional ~videointruders~ will love the level of challenge proposed but all the others will probably go looking for some cheat after the umpteenth attempt gone wrong... [CC]The eight levels, in addition to being almost identical in structure, will make us wander perpetually looking for the right computer that unlocks that door essential for the mission with the only change of the obligatory passages in the huge ventilation duct[/CD] Probably few of you will remember Gorky 17, a title released some time ago rather quietly that tried to best combine RPG elements and turn-based strategy. The guys from Metropolis Software (authors in the meantime of the not too appreciated Archangel) have nevertheless decided to propose a sequel, again produced by Jowood and distributed in Italy by Koch Media. The release time tends to be perfect: at the end of September the hype for the third episodes of Splinter Cell and Metal Gear Solid will have almost reached its peak and GZ, belonging to the same genre as the already predestined sales champions, can follow suit and take advantage of the positive trend European Pride Finally we Europeans too can boast of a super secret agent among our ranks! Cole Sullivan, the protagonist of Gorky Zero is in fact in service with NATO intelligence and is its spearhead in terms of infiltration and stealth. As usually happens in this genre of games, the problems come once again from the former Soviet Union where a former major of the Russian army, a certain Trafimov is at the head of a terrorist organization with the infamous name of ~Brotherhood of the Redemption~. a sect capable of transforming its followers into silent and above all obedient human robots. Finally we Europeans too can boast of a super secret agent among our ranks! The mysterious death of the soldier, killed with two shots to the head, does not erase the danger and so Sullivan is sent to Ukraine to make a clean sweep of the laboratories capable of bending people's will at will. When the mission now seems over, our digital alter ego discovers that the truth is very far from what his superiors have exposed him and his life will hang by a thread. The plot, even if it borrows something from Metal Gear Solid, is certainly the most valuable element in Gorky Zero and discovering what really lies behind our mission will be the greatest motivation to complete the 8 levels provided. Is there still room in the world of stealth for another secret super agent besides Sam Fisher and Solid Snake? This is the question I asked myself at the time of the preview of Gorky Zero and after seeing it in its entirety, we can say that the European Cole Sullivan is a much younger brother and that he still has to grow up a lot to become a character capable of rival the two superstars just mentioned. The guys from Metropolis Software have also had some excellent insights starting with the double view that could lead to school in the genre. GZ also does not fail to present an excellent command interface and an intriguing plot (although by some it can be interpreted as a reduced version of the Kojima saga) which will undoubtedly be the main motivation to conclude the 8 expected levels. Unfortunately, however, the excessive repetitiveness of the game scheme and level design, as well as a purely functional graphic level and a difficulty that makes it frustrating too many times, make it a product suitable only for professional ~videointruders~ who want to kill time for the third installments of Splinter Cell and Metal Gear Solid. The (sluggish) sufficiency is by virtue of the good intuitions had by the Polish programmers who we hope will want to try again in the field of stealth, however carefully evaluating the strengths and weaknesses found by critics and the public in this Gorky Zero. Pros: Intriguing plot Dual cameras and good control system Duration above average Cons: Repetitive throughout Technically modest Frustrating in many moments", "date": "2004-09-07", "grade": null}