{"name": "Shin Megami Tensei: Digital Devil Saga 2 - Recensione", "ref": "https://multiplayer.it/recensioni/shin-megami-tensei-digital-devil-saga-2-recensione.html", "text": "Nirvana, at last? Digital Devil Saga 2 immediately immerses us in the story, picking it up exactly where the prequel ended, leaving new players decidedly disoriented: Serph and his companions of the Embryon clan have finally reached Nirvana, after having thwarted the mysterious Karma Association in their old world dungeon, called the Junkyard, in which they had been forced by a cataclysm that had made the sun's rays deadly. However, the ~Promised Land~ doesn't look at all like they imagined it: it is decidedly similar to their guerrilla and old world, and we will soon discover that in reality the Junkyard was nothing more than a sort of virtual warfare training program, in short, a simulation in which Serph, Argilla and all the other companions and enemies were nothing but computer data, now transformed into real beings by ~ascending~ to this elusive Nirvana through the support of the mysterious girl named Sera. From this moment on, Digital Devil Saga 2 becomes an incredible barrage of twists and revelations, in which almost nothing is what it seems: only the true identity of the protagonists will leave the players displaced, and the pressing narration, raw and adult , will satisfy even the most discerning palates. The characterization of the various characters is excellent, despite the truly disturbing and grotesque design with which they were made which is really a difficult obstacle to overcome: but beyond the rough surface of these demonic guerrillas, there is a deep psychology and a mix of religious and scientific themes that make this final act of the saga truly special. Mantra et cetera But as mentioned in the incipit of this same review, beyond the unexpected and shocking narrative developments, Digital Devil Saga 2 does not present any particular novelties at a playful and technical level that can really distinguish it from the prequel. Graphically, the two titles are practically identical: the cel-shading used is remarkably accurate and the chromatic choice truly perfect in every context, the graphics really knew their stuff since each location or creature integrates perfectly with the complex and disturbing plot, in a whirlwind of visual suggestions that manifest themselves not only in the cinematic cutscenes, but also in the fights, where the sobriety of the various ~magic~ and special attacks fits perfectly into the serious and decidedly raw context of the plot. Even the soundtrack proves to be atmospheric, mixing mystical and solemn musical themes with other rockers and pops, always suitable for the action taking place on our screen: it is certainly not one of the most memorable soundtracks we have heard, but it is suitable for the type of game without particular flaws. The discreet English dubbing completes a decidedly positive picture. Mantra et cetera As for the gameplay, Digital Devil Saga 2 presents very slight improvements compared to the previous chapter of the bilogy, especially related to the Mantra System: the previous mechanism has been abandoned, now the System looks like the Sphere Grid of Final Fantasy X or the License Board of Final Fantasy XII, with a table of skills and spells that all characters can learn by consuming the points earned in combat. By advancing in the table and learning the various skills, others will be unlocked, and of course to learn the most powerful ones it will be necessary to obtain all those that surround them: the new system encourages an unbridled ~grind~ of the Mantra points necessary to learn all the skills for everyone the characters, it is not necessary to do this to complete the game but the ability to fully customize the various protagonists stimulates the player to conquer as much of the grid as possible, needless to say that the most voracious and perfectionist users will devote many hours to upgrading and expanding the own favorite party. And then it is in combat that the Mantra System really develops, of course, and in this case Atlus has made practically no changes: always using three characters at a time you will battle the hordes of monsters and demons that will attack you randomly in the corridors of the various location to explore, with an irritating frequency at times. Strategic enough, the battle-system has a classic turn-based setting with a notable variation: using the right skills, in fact, our party will earn one more turn than the enemies. This means that, for example, casting an ice ~magic~ on a demon weak to this element will allow us to attack once more before the enemies do it, obviously with a pinch of tactics it is possible to obliterate an entire opposing teamia without giving her the chance to fight back, but the opposite is also true and a mistake on our part will allow the enemies to get rid of us in a few turns, perhaps preventing us from healing or protecting ourselves from another attack: the difficulty of Digital Devil Saga 2 is remarkable, but not due to an erroneous balancing on the part of the programmers, but due to the need for players to approach each new random encounter with a certain inventiveness and strategy, and if on the one hand it is a positive element that forces the player to stay alert , on the other hand, the frequency of fights and the effort required to win them make progressing through the game more tiring than it needs to be. Comment The bilogy of Atlus is another piece of the huge mosaic of Shin Megami Tensei, and will go quietly due to the competition (Final Fantasy XII and Rogue Galaxy in primis), but it is a high quality project that will satisfy hardcore RPG players , despite the rather grotesque style that you may not like. However, the script is one of the best written for a JRPG, deep and thoughtful without falling into the ridiculous and extremely adult, supported by a very good technical realization. The gameplay is the most interesting side, with a combination of old-school and innovative elements that make it pleasant but above all challenging: the combat system is ingenious and the possibilities for upgrading the characters are remarkable, but the frequency of random fights, combined with the The breadth of the various dungeons and the general difficulty of the product make Digital Devil Saga 2 a bit out of reach for the casual user. Fans of the genre, however, do not give up: this bilogy is undoubtedly one of the best productions of the genre on PlayStation 2. Pros: Excellent storyline Technically good Satisfactory battle-system Cons: Too frequent random fights Definitely difficult The style may not appeal to everyone The very long Shin Megami Tensei series continues with the second chapter of the Digital Devil Saga bilogy, which has been able to surprise gamers not only with simple but well thought out gameplay, but also with an adult plot, full of twists and really well told. In one of its very few conversions for the European territory, the first episode of Digital Devil Saga met with good success, thanks to the positive judgments of the critics, despite some marginal flaws, such as the excessive frequency of the fights: a flaw, if one can call, stemmed from the global quality of the product and now so common in the field of JRPGs that it can almost be defined as their characteristic. Digital Devil Saga 2 offers itself as a real second part of a game so conceived from the beginning, unlike other mini-sagas such as XenoSaga, in fact, it does not present substantial changes from the previous title: fans will feel at home, it won't take newbies long to immerse themselves in the dark world of Serph and his allies.", "date": "2007-06-15", "grade": null}