{"name": "La recensione di Silent Storm", "ref": "https://multiplayer.it/recensioni/la-recensione-di-silent-storm.html", "text": "In addition to the more canonical parameters, our intrepid soldiers will be able to acquire ~exceptional~ skills in a hierarchical tree system Once the adventure has begun, the first mission (in both sides) will see us alone in achieving the set goals. We will soon discover that in reality it is only an interactive introduction: the real game begins immediately after when we will build our ~party~ which will face the various planned schemes and also the battles generated in a ~random~ way with which we will be able to advance level up our characters. In addition to the more canonical parameters, our intrepid soldiers will be able to acquire ~exceptional~ skills in a hierarchical tree system, which can therefore be unlocked slowly as we advance. Chain reaction Therefore, if we have already explored the RPG characteristics of Silent Storm, now is the time to describe the turn-based strategic part. In reality, the game will become turn-based only in war situations while it will behave like a typical RTS as long as it's exclusively about moving (however optional: whoever wants can play it all in turns or change when they want at any time). Conflict management is definitely valid thanks to a very versatile interface with which we will have total control of our men. In addition to the good choice of highlighting the percentage of probability we will have in hitting an enemy, the most surprising aspect of the game is the total interactivity of the environment which will react in a chained way to our actions. In addition to an excellent graphic representation and unprecedented physics, referring to the gender of belonging, this involves a careful study of the actions we are going to perform, especially with regard to the side effects that we are going to activate. The Nival programmers have really done a painstaking work given that the interaction will take place with an infinite number of elements, making enthusiasts happy while perhaps keeping newbies at a safe distance who could already look at the title warily. Chain reaction A gameplay still excellent if not free from defects. The most annoying one is certainly the excessive slowness with which the CPU moves its soldiers: in the most intricate situations the waiting times will become decidedly long and with the consequent annoyance derived from being only the spectator for too long. A more subjective note of demerit is regarding an excessive similarity of the levels and battles: although there are very different objectives to accomplish, the heart of the action does not differ too much but perhaps in this genre it is not so easy to diversify more. The Nival programmers have really done a painstaking work since the interaction with the environment will take place with an infinite number of elements We then come to the technical aspect of Silent Storm and here the Nival Boys deserve a standing ovation from me. The fully 3D graphics engine (so rotations and zooms are just a click away when you want) as well as not being too heavy and running very smoothly even on a mid-range PC, it manages to manage the interaction with the environment that I have already told you about previously. It is a real spectacle to see the chain reactions that a bullet can have on a motorbike or the throwing of a grenade on a drum full of oil. Even the animations of the characters stand out positively and if all this were not enough, after killing your first 10 enemies, you will find that the way they will expire will not always be the same but will depend both on the weapon and on the point in which you have it impressed simply sublime from a gaming point of view, of course. Finally, applause also for the detail with which the various buildings and natural elements were made (the blades of grass are almost at the level of an FPS ...) which constitute the background of our actions. The sound component of the Encore - Jowood production cannot be praised in the same way since it stands at levels that are no more than sufficient both for excessively anonymous musical tracks (although their epic and military character are very much in empathy with nature itself of the game) and for the not too inspired ~interpretations~ of the dialogues (in English but with subtitles in Italian as well as the rest of all the texts) during the cut scenes. Comment Fans of turn-based strategy on PC have to rejoice because they can finally get their hands on an excellent title. After the latest disappointing performances of the X-Com series and the ~hiding~ of Jagged Alliance, Silent Storm represents an excellent combination of RPG and strategic elements, in the highly abused scenario of the Second World War (albeit with some ~fantapoliticoscientifiche variations on the theme). With a completely 3D graphic engine, rich in some rather refined features and capable of managing completely interactive settings, the Jowood  Nival production proves to be an almost unique product and almost free from defects (the only non-venial one is the excessive slowness of artificial intelligence to move) in the panorama of the most recent productions and absolutely unmissable for lovers of non real time strategy. And after finishing it, do not despair as the add-on from the fascinating title of Sentinels is already expected. Never again without turns in your gaming life Pros: Excellent graphic engine Total interaction with the environment Excellent combination of RPG and turn-based strategy Cons: Artificial intelligence very, too slow A bit repetitive Only for enthusiasts I'll tell you a little secret: if a few years ago someone had asked me for an opinion on a possible videogame revival of the Second World War, I would never, ever have answered in the affirmative. As they say in these cases, nobody is perfect and in fact from Medal of Honor onwards there has been a flourishing of productions dedicated to the terrible conflict. And the trend seems far from decreasing given that in the coming months Brothers in Arms, Call of Duty - United Offensive, Combat Elite, D-Day, Axis & Allies, Pacific Fighters, Midway and many others await us. Silent Storm, Russian production of Nival (the same authors of Blitzkrieg, Etherlords and Rage of Mages), therefore tries to exploit the interest around this particular historical period but applied to a genre that certainly does not enjoy good health on PC. In fact, the game refers to the trappings of turn-based strategy with many elements taken from RPGs. Is it the right time for fans after the latest disappointing performance of the X-Com series and the ~hiding~ of Jagged Alliance? Anticipating the ending, fortunately the answer is positive... Once the installation has been carried out and after having appreciated a quick introduction in which it is perceived that the scenario is not exactly faithful to the real events with ~political-scientific~ variations on the theme, I am ready to throw myself in the main game campaign. The first choice to make is whether to side with the Italian-German-Japanese axis or those of the allies (here represented by the USA, the USSR and Great Britain). In addition to two different campaigns, the choice will also condition the characteristics of our digital alter ego that we will be able to choose from among the armies present in the two sides on the field. We will be able to ~customize~ many characteristics of our soldier, from gender to physical characteristics and, like any self-respecting RPG, skills and class (there are 6).", "date": "2004-08-31", "grade": null}