{"name": "After Burner: Black Falcon - Recensione", "ref": "https://multiplayer.it/recensioni/after-burner-black-falcon-recensione.html", "text": "Dogfight forever The plot is as subtle as it is negligible; a band of mercenary pilots has stolen 13 secret jet prototypes equipped with cutting-edge technology and enormous firepower. A problem that obviously we are called to solve, playing the role of one of the 3 protagonists: the very fast Sonic, the rude Bull and the charming Shinsei. The only difference that involves choosing one over the other lies in the secondary objectives, which are different for each of them. The mold of the gameplay is obviously faithful to the arcade roots of the original, therefore in a significantly different way compared to products such as Ace Combat X, just to name a name. Yes because in the Sega production, as well as in the progenitor, the possibilities of moving are much more limited being an ~on rail~ title; in practice, the only possible direction of travel is forward, as inside a tube with invisible walls, so to speak. A limit in some respects, which obviously affects the possibility (or rather the impossibility) of exploring the settings outside the established boundaries; on the other hand, such a solution has always allowed the series to guarantee a particularly high pace of play, and Black Falcon is no exception. The moments in which your finger is not constantly pressing the fire button are really rare and short, and on the contrary most of the time is spent shooting down enemy planes, radars and ground positions, and dodging the missiles and bullets that we get fired at all the time. The only thing you need to pay attention to is your own energy bar, since rockets and missiles are often and willingly replenished through bonuses. An exhilarating picture then? 20 years ago and in the arcade for short sessions, certainly yes, but today the feeling of limitation and inconsistency appears evident after just a few minutes. The variety of missions and level design certainly doesn't help; in the vast majority of cases, the only difference lies in the nature of the objectives, but the gist of the game is always the same. The ability to buy new jets, upgrade them or customize them with a series of liveries does not change the substance much; Black Falcon is a truly ~old-fashioned~ product, to be tackled for short sessions, unplugging the brain and leaving room for one's reflexes instead. Aerial technique The graphic component obtains the sufficiency without great efforts, but certainly the potential of the PSP is not fully exploited by the effort of the Planet Moon Studios team. The fluidity of the action is undoubtedly the most valuable aspect, with a stable frame rate; the polygonal modeling of the various planes is discreet, while the quality of the settings is very fluctuating, however characterized by a good variety. In fact, during the 24 overall missions we go from fighting on the coasts of the ocean to the middle of the desert up to the frozen tundra; pity for the rather marked aliasing and for the limited visual depth, which takes away more than something from the general glance. On the same line the sound, never capable of affecting or being noticed in a particular way, but not even annoying both in the effects and in the musical accompaniment. Comment After Burner: Black Falcon is the classic game for fans of the ~old school~ arcade genre. In fact, the programmers must be given credit for having managed to package a product with a philosophy very close to that of the illustrious original; pure and simple action, without frills and with such immediate gameplay that you can already show everything in the first game. Those who have started to water in the mouth when faced with this description can run without risk to the nearest shop; others, on the other hand, would do better to look for something more profound and modern. Pros Faithful to the original Immediate Rather stimulating Cons Limited and repetitive Technically improvable Sega is no longer the one of the golden age, that's obvious. However, the big names in the games that have decreed its unforgettable past success still enjoy a particular appeal, and the awareness of this has led the Japanese software house to often exploit them to create new products and reissues. This is also the case of After Burner, an aerial shooter that in the late 80s made people spend a lot of coins in arcades all over the world, to then be converted to a huge number of consoles, not counting the various sequels. Today is PSP's turn, ready to welcome this new After Burner: Black Falcon.", "date": "2007-06-13", "grade": null}