{"name": "Forza Motorsport 2 - Recensione", "ref": "https://multiplayer.it/recensioni/forza-motorsport-2-recensione.html", "text": "A career of real pilots. The single-player section is made up of a career mode, which is decidedly long to finish, and an arcade mode consisting of free racing or time trial events, useful for unlocking the purchase of some car models. Forza 2 was developed to keep the player's involvement always high and constant, each step forward in his career, through the acquisition of credits from the races played, unlocks more events available in different categories, ranging from simple 2-lap practice races , up to endurance competitions of over 30, with related pit stops for fuel and tire changes to be made. Credit management, especially in the early stages of the game, is quite difficult, to our advantage we will find a careful differentiation of the aids that can be activated and the relative level of difficulty that can be selected. The developers have in fact assigned percentages, which increase or decrease the number of credits won in each race, based on the activation or not of the various driving aids available; such as ABS, traction control, dynamic driving to choose the best trajectories when cornering, up to the settings related to the game's AI. In this way, each player can avoid extremely frustrating races, perhaps by lowering the difficulty, and at the same time make the gaming experience as close as possible to their own tastes and driving styles. Among these options we can focus in particular on the level of the opponent's AI, and on the implementation of the level of damage to the vehicle. During the career we will not find anonymous opponents, but real drivers, each with their own driving characteristics and skill level. As you progress in your career, the category limits that impose the choice of one vehicle over another also increase, this factor also affects the level of difficulty of the races. With the same car and with limitations in its set-up, the races are quite demanding, in particular with disabled aids or AI set to a difficult level, which in some cases causes the opponents to be too aggressive in trying to maintain their position on the track. The implementation of damages falls within this context, which, if activated, radically changes the type of approach to races, leading us to be more cautious when overtaking as well as avoiding taking unnecessary risks when controlling the race. From this point of view Forza 2 is extremely balanced and customizable, but for the more experienced the real challenge comes from online racing, an area in which the Turn10 product has a lot to say. Runner, Tuner or Artist? Forza Motorsport 2 is undoubtedly one of the driving titles where it is easier to get lost among the various possibilities offered to the player, indeed it is more correct to say that Forza 2 offers the player different possibilities in which he will inevitably get lost according to his tastes. The approach to the game is the same for everyone, but after a few races our preferences and habits will make us make distinct choices. We will be able to think only of racing and competing, using the cars as we find them, or we will be able to spend hours choosing the modifications to apply to our favorite cars, making them move up in class and making them more and more competitive thanks to the changes in the set-up. Finally we will be able to enter the editor for the car bodies, with over 4000 layers and hundreds of decals applicable to the cars, together with new options for creating and saving liveries that allow us to give vent to our artistic side. The more creative could even leave racing in the background and think of becoming professional tuners who sell their creations in the online auction system integrated with the official website, obtaining the same degree of satisfaction as the best drivers. Arcade, Simulation or Come on The behavior between the various categories of vehicles and the driving models implemented according to the type of traction, the position of the engine, the weight and relative modifications applied to the cars, is certainly the heart of the game. The model has not been completely revised compared to the first Forza, but the creation of routines dedicated to physics, thanks to the power of the new hardware, have allowed it to be further refined and optimized. Forza2 is not a title based on the most maniacal simulation, rather it can be defined as a highly modular game depending on the aids and damages activated. The two extremes, the totally arcade one and the totally simulation one, are not reachable regardless of the selected options, but everything in between can be associated with the Microsoft title. This compromise is optimally achieved, so thatand to cover the range of players who don't want to waste hours on the most improbable settings, as well as those who want to shave off the last tenths of a fast lap. Not surprisingly, one of the aspects on which the developers wanted to focus is the creation of telemetry, which can be viewed in real time. By calling up this menu, integrated into the game screen, it will be possible to analyze even the most insignificant behavior of the car, moment by moment within the tracks. Enthusiasts will then be able to evaluate whether the modifications applied to the vehicle's tuning bring the desired benefits, such as a decrease in tire wear, the vehicle's performance on bends, by comparing the values present in various rather technical sub-menus. Having said this, it should also be noted that telemetry analysis, or the constant use of vehicle tuning and settings, are by no means mandatory in order to be able to enjoy the game right up to the last race. All these tools, in fact, influence the behavior of the car, but the choice of using them or not is entirely up to the player. Perfection does not exist Forza 2 is not free from defects, or rather shortcomings. The downsides regarding the technical aspect can be found in some color choices that affect the game's on-screen rendering. Regardless of the graphic compromises for the choice of 60 frames per second, one could have chosen a more realistic rendering of the colors, or increased saturation and contrasts to emphasize the chosen style, which in certain game situations does not do justice to the qualities of the graphic engine, which focuses everything on the fluidity and depth of the field of vision. Returning to the shortcomings, the absence of the internal view in the cockpit is relevant, which had literally depopulated at the exit of Project Gotham Racing 3, partly justifiable by the very high number of vehicles available, and the lack of implementation of different weather conditions such as rain or wet track, which could have provided very interesting results in this kind of title. For the rest, Forza 2 alternates good things with others that could be improved, such as some aliasing defects present in certain situations, while there is nothing to say about the choice of 60 frames per second which represent the most suitable for a game like this. We have already talked about the more or less shareable decision not to reproduce an extremely realistic color rendering, but we must point out that the lighting in certain tracks together with the rendering of the sky are excellently reproduced. As far as the environments are concerned, one cannot fail to notice that the choice of mainly using motor racing circuits pays off exclusively from the point of view of game mechanics. The only city track, New York, in addition to being the most unlikely for a racing game like Forza, is also the most beautiful to look at. Of course, especially those who have already played the previous chapter on Xbox, can not help but feel the lack of the inclusion of a greater number of new and original circuits. Despite the fact that the Turn 10 title manages to give a feeling of speed like few others before now. Speaking of the sound department, however, there are no complaints whatsoever, the work done by the team is excellent, both for the soundtrack chosen for the menus, full of licensed songs, and in the implementation of the sound effects during the ride, which obviously vary depending on the components fitted to the cars themselves. The title is completely localized in Italian, together with the settings guide, which can be recalled with Y in the relative menu, which it is always advisable to read before modifying one or more parameters. Online what a passion With regard to the multiplayer section, we can report that during our game sessions we did not encounter lag problems even in races with the maximum number of players, i.e. 8. There are single events, but there is also the possibility of creating tournaments, without forgetting that there are also races in split screen. The matches can be customized in various ways, in addition to the choice of carrying out classified matches or not, and obviously limiting the use of particular cars. In multiplayer we don't just talk about challenges or tournaments, in fact in the Turn10 title there is a strong integration with your user profile and the official site, where you can upload your images taken from replays or races. At the same time, it is possible to participate in online auctions, strictly guided by the credits earned in the game, to sell one's own designs created through the editor or to buy vehicles already modified by other users. Last but not least there is the Forza version of a Gotham TV, where you can watch the races of the champions or defriends with the liveliness given by the carousel of bodies put on the track by the most creative riders. Xbox 360 goals Forza Motorsport 2, unsurprisingly, offers a large number of achievements to unlock. The points are obviously 1000 divided into 44 steps, 4 of which remain secret until they are reached. The points awarded for each achievement range from 1 to 75 Microsoft Points. Some are very easy to achieve, but for the most part you will need to spend a good number of hours on the game. Comment At a casual glance, Forza Motorsport 2 may appear to be a simple upgrade of the Xbox version, brought to high resolution with a few other changes. Fortunately, playing it for a long time, this first impression disappears, and the title shows its greatest quality in all its parts. The shortcomings highlighted deprive it of that something extra that could have made it a true masterpiece in the genre, but even so it is the current reference point for racing games on Xbox 360. Long and engaging offline mode, virtually infinite online replayability, and which will be refreshed with various additional contents in the coming months, vehicle customization and editor, which is almost an entire subgame, and a decent technical realization, without the 30fps handicap, are just some of the positive sides of the title developed by Turn10. The combination of all these, and many others, elements makes Forza Motorsport 2 a title to be recommended without reservations. Pros: Sound Driving Model Great online structure Challenging single player Cons: Few new environments No cockpit view Lack of different weather conditions The best way to approach the new Microsoft racing is to rattle off some numbers. There are over 300 car models, divided into categories starting from the classic and affordable production cars, up to the most powerful racing prototypes around. The vehicle fleet represents in an excellent way all the main producers of the various American, European or Asian manufacturers. A separate note is represented by the lack of Alfa Romeo license, currently under contract with other titles. There are 12 settings and 47 tracks in all, including real or less real circuits, unfortunately many of these had already been seen in the first Forza and this is one of the points of greatest regret. The transition to the next gen has certainly benefited their graphic representation, but a little more variety in the chosen locations would not have hurt.", "date": "2007-06-12", "grade": null}