{"name": "Cooking Mama - Recensione", "ref": "https://multiplayer.it/recensioni/cooking-mama-recensione.html", "text": "Better than Mama... The game of Cooking Mama is centered on the preparation of a large number of dishes from cuisines all over the world, ranging from Sushi to Lasagna, from Chili con Carne to Cous Cous, and whose preparation complexity ranges from buttered popcorn to spaghetti with squid ink, in which it is even necessary to clean the shellfish before moving on to the preparation of the sauce and possibly preparing the pasta by hand. In terms of aesthetics, everything has an anime style with a mainstream aesthetic and a distinctly pop flavor, accompanied by user-friendly menus and constantly inspired by the national identity of the dishes, at least to the extent that this is allowed by the stereotyping of the characters from comic book. In the concrete practice of the game (declined in free play, in computer and timed challenges and in the challenge mode with another player, exclusive to Wii) each recipe is divided into phases, and each phase implies a different, generally fun and creative use , of the Wii controller. Thus, it will be necessary to peel vegetables, cut them into cubes, chop the garlic and onion, clean the fish, grind the meat, prepare mixtures and mix them by hand, insert all the various ingredients into the pan at the right time, controlling the fire, the cooking times and times, and even grate the Parmesan and beat what remains attached to the grater, prepare the pasta with the machine, drain the pasta once it has boiled or decorate the dish. Better than Mama... A bit like in Wario Ware (but without the graphic variability and extreme frenzy, on Wario's stopwatch) the variety of actions that make up each single dish (which is the final result of this ~stage circuit~) is remarkable, and each action clearly translates into a different way of holding and moving the Wii controller, resulting in an original and fun experience. Frantically chopping an onion, crushing herbs or frying panzerotti with the Wii is something that often really makes you smile, and the system is a godsend for anyone looking for an original playful entertainment, a ~companion~ game whose spirit tends a bit towards the party game. Not that the system is perpetually entertaining, and for a simple fact: just like in real cooking, some actions are fun or engaging (composing the dishes, cutting the meat and fish, throwing the ingredients in the pan, shelling the prawns), others simply boring or even tiring (peeling the vegetables, folding the sushi rolls, mixing, turning the lever of the mincer). Of this, giving concession to the ~realism~ of the experience, nothing can be reproached to Cooking Mama. Better than Mama... But if there is one thing where the experience really falters it is the conversion of the actions on the Wii controller which, as is natural for a system conceived on a different interface (that of DS), does not give the impression of a response always natural and plausible. While the nib gave the game an almost tactile sensation with the ingredients, waving a controller in the air is not the same, even more so when the interaction system is not always conceived perfectly to guarantee fluidity and leeway to the actions. Let's take the case of peeling vegetables: the peeling action can only take place in vertical strips and, once a section has been cleaned, the player has a dead time of almost a second before being able to enlarge the peeling area. The result is poor coordination of movement with the screen and a feeling of boredom and cast. Even at the expense of ~realism~, the conversion, in this and other junctures, could have offered a slightly more frenetic experience, a slightly wider range of motor interaction with objects, a little more freedom to mess around (collateral component of cooking and necessary part of entertainment). Cooking Mama is certainly not a realistic cooking simulation game. This will be impossible until we see an ingenious controller full of puncture blisters full of food and odor samples, until, in short, a console to come does not at least incorporate odorama. Looking forward to the future, Cooking Mama leaves the fulcrum of cooking and food (smell, taste, touch) on the street and takes the cue to transform it into a kind of sport, to capture at least the motor component. The DS stylus control, of course, worked much better, offering an almost tactile sensation absent here and far greater precision. But even so, Cooking Mama is recommended for all those looking for some original action, healthy laughs in company and the feeling of doing something a little silly but never tried before. Bearing in mind the fact that the frustration of foodphotorealistic to look at and not touch enough, in the medium distance, to induce salivation, transforming the multiplayer game into an obligatory dinner out with friends (add the bill to the actual cost of the game). Pro Definitely unusual Fun and ~light~ Cons It worked better with the stylus Detection sometimes not very precise The kitchen, like all the other experiences in the world, has never been completely neglected by that emulative and simulative monster that is the digital game. Cooking Mama for Nintendo Wii, which is the conversion-sequel of a previous version for Nintendo DS, is therefore not an absolute novelty: just think of the only progenitor of the ~food~ inspiration, the legendary Burger Time. Cooking Mama, however, is a game explicitly inspired by the kitchen and not simply covered in a culinary aesthetic. Its originality is undeniable, but it does not only have to do with the theme: it also lies in the fact that Cooking Mama belongs to the new line of Nintendo Wii productions, focused on ~light~, fun mechanics, dedicated to a vast and different audience from that of the ~typical player~, characterized by pop aesthetics and inspired by everyday themes and imaginaries. As always, for some time now, the core of the idea revolves around the motion sensing interaction with the Wii controller which, even in comparison with the DS stylus, proves to be the cross and delight of the experience playful.", "date": "2007-06-08", "grade": null}