{"name": "Tomb Raider: Anniversary - Recensione", "ref": "https://multiplayer.it/recensioni/tomb-raider-anniversary-recensione.html", "text": "There is madness and madness At first, you are a bit taken aback. It seems that the designers have taken the task of honoring Lara very seriously and have deliberately decided to recreate her difficult adventures like those of the past. While keeping all the new moves and while updating the structure of the levels, the feeling is that of the time and the difficulty as well. I'm one of those who found Legend all too easy and the comparison with Anniversary, which proceeds in a completely different direction, only confirms how in recent years it has been chosen to favor simplicity, making some games too quick to finish . An adventure game needs adventure. The player wants to find in it a challenge and a confirmation of his imagination: you pull a lever and a boulder collapses, you jump into the void, you throw a grappling hook and you get to the other side of a ravine and so on. In short, there must be all those situations that make it possible to deal with danger feeling it as present and that require a minimum of dedication to be overcome. Right from the start Anniversary proves to be a difficult challenge, especially for the casual player, accustomed to video games in which you just need to press a button at random to make a massacre of enemies or to overcome an apparently insurmountable obstacle. The developers wanted to re-read the intricate levels that so many players had fallen in love with, adapting them to the new graphics engine and remodeling them around Lara's new moves. The result is spectacular and we are not even going to explain the thrill of finding yourself jumping here and there again on the precarious platforms of a level like the Folly of San Francesco, which today as then is a small miracle of level design; something that makes us proud to love video games despite everything. Of course, it is also true that less practical users will find many difficulties in moving forward. In this sense, completely forget Legend, designed for less savvy users, and consider the fact that in some sections you die very often, especially in the advanced levels where the attempts to overcome traps will have to be multiple. Death in slow motion There are many moves available to Lara: she can run, jump, crouch, use weapons, throw a grappling hook, run along walls (only if she is attached to a rope), climb, swim, dive and perform other actions based on her situation. As in the original, there are objects to collect, levers to pull and enemies to fight against, even if the latter are much smaller in number than in Legend, where some levels were essentially dedicated to combat. the developers wanted to re-read the intricate levels that many players had fallen in love with, adapting them to the new graphics engine and remodeling them around Lara's new moves Death in slow motion One of the innovations introduced concerns fighting: when an aura shines on an enemy's head, it indicates that he is preparing for a lethal assault. In these cases, by continuing to aim at the target and combining the crouch key with a directional movement, it will be possible to perform a dodge in slow motion, during which two white crosshairs will appear which, when superimposed and turn red, will indicate the possibility of perform a lethal blow to the head. Learning to dodge is essential to be able to survive the clashes because normally the assaults of the enemies are not avoidable in any other way. In addition, some bosses, such as the tyrannosaurus, will require the use of this technique in order to be overcome. The system looks complicated but it is not difficult to master. Of course, compared to other action titles it is slightly cumbersome, but you soon get used to it and you no longer notice it. Facelift and silicone As already mentioned, the level design largely takes up the original one, but the differences are still evident. Obviously, the technological upgrade is immediately noticeable with the less angular and more harmonized levels, in which the protrusions are more in line with the rest of the scenario. We also note the new model of Lara, paradoxically the ugliest graphic element of the game, which is far too slender in proportion to the breasts. The effect is that of a broom with two balloons attached to it. The visual aspect is generally quite accurate, even if it is not surprising for the effects and quality of the textures. In general, it was decided to favor fluidity, very high on medium-sized machines even with maximum details, rather than implementing random features that would have made everything unusable on low-end machines. Obviously we are referring to the PC version of the game. Console users need not worry. that toothose who have finished the original several times will have a good time Facelift and silicone The control system is the classic one of the series as well as the user interface, reduced to the bone but complete with all those elements necessary for the action. PC owners, using the mouse and keyboard, will gain some precision in movements and jumps, but will be penalized in fights that sometimes require pressing four keys almost simultaneously (one key for movement, one for holding aim it at a target, one to initiate dodging and one to fire at the right time). In short, we are faced with one of the best chapters of the series, fun and exciting, despite some shadows. System requirements Minimum Requirements: Processor: Pentium 4 1.4 GHz or AMD equivalent RAM: 256 MB (Windows 2000/XP) or 512 MB (Windows Vista) Video Card: From GeForce 3 Ti or Radeon 9 series with 64 MB (DirectX 9.0c compatible ) Disk Space: 4.0 GB DirectX 9.0c DVD Drive Recommended Requirements: Processor: Pentium 4 3.0 GHz or AMD equivalent RAM: 1 GB Video Card: GeForce 6xxxx series or Radeon X series with 64 MB (compatible with DirectX 9.0c, vertex and pixel shader 2.0) Test Configuration: Operating System: Windows XP Processor: Intel Pentium 4 3.4 GHz RAM: 2 GB Video Card: NVIDIA 7800GT Comment There is almost nothing new but the work of Crystal Dynamics is punctual in reproducing the atmospheres that many players loved back in 1996. Tomb Raider: Anniversary is an intelligent and well done tribute, capable of entertaining for many hours without never expire. Obviously the difficulty factor must also be considered, which could discourage more than a few players. But it's worth a try; at least download the demo and adjust with that. In short, a game recommended to all fans of the beautiful archaeologist and to anyone who wants a pure action adventure without particular defects. Pros Beautiful level design Fluid even on non-state-of-the-art systems Gives a lot of satisfaction Cons Difficult for newbies Graphically not excellent Lara's model is a bit disproportionate Amarcord He is now more than ten years old but fortunately he looks a few more. It was 1996 when Lara Croft began hunting for treasures in the most diverse places on the planet on PC, PlayStation and Saturn. At the time, one could not even suspect the global success that the first Tomb Raider would have achieved, a success that led to the creation of six sequels, the last of which came out last year with good results. Everyone knows the vicissitudes of the series: after the first episode, Core Design rested on its laurels by producing sequels / clones that had practically no innovations and that alienated many fans, now more attracted by the size of Lara's breasts than by the actual gameplay. In fact, each new chapter was an excuse to discuss Lara's new curves, which in some episodes had reached inhuman proportions. In the moment of attempting the turning point with Angel of Darkness, Core misses the blow producing the worst episode of the series. It's 2003 and Lara's star seems to have definitively faded, buried under bugs and under a bad control interface, but Eidos doesn't want to lose his most lucrative character and entrusts the production of a new episode to Crystal Dynamics, effectively excluding Core, which manages to revitalize the brand with the good Legend released in 2006. Shortly after the seventh episode was released in stores, Eidos announced the production of a celebratory title of the series, the one we are reviewing, always entrusted to Crystal Dynamics. Tomb Raider Anniversary is a remake of the first Tomb Raider using the Legend engine. The story is the same, with Lara hunting for the Scion, a three-part artifact that once haunted her father and now haunts her. Even the levels are the same, but don't worry right away, the make-up work done by the developers is truly remarkable and even those who have finished the original several times will have a lot of fun.", "date": "2007-06-08", "grade": null}