{"name": "Mad Tracks - Recensione", "ref": "https://multiplayer.it/recensioni/mad-tracks-recensione.html", "text": "Toy life Mad Tracks is not a real racing game, it's good to clarify that right away. Not even with the extended meaning of ~racing game~, with which Mario Kart can also be understood, for example, is it possible to define this title by Load Inc. It is a set of mini-games, all to be played on board of toy cars. The main mode, ~Adventure~, leads us to face a series of different tests, completing which others open up until the completion of the ~map~, made up of 15 disciplines. The general impression is that of being faced with a sort of four-wheeled party game, since only a small percentage of the tests are real races, the others are competitions of various kinds, all to be tackled aboard the tiny vehicles: matches billiards in which you have to push the balls corresponding to your color into the hole, a particular interpretation of table football in which you have to score a goal by hitting the ball with your car, car mini-golf and so on. The game structure during the racing game-style phases is typical of the race-with-power-up, by now very familiar to every player with a minimum of experience: in addition to running on intricate tracks, which develop mostly inside inside domestic environments and among gigantic objects (obviously the cars are tiny), trying to arrive first with driving skills, we will be able to count on the help of various weapons scattered around the track, which will allow us to hit the opponents with a large series of assorted atrocities (missiles, oil slicks, mines, turbos, etc.). To remember that these are toy cars, you also have to keep an eye on the level of the mechanical charge, to be dosed carefully during the race, even if this almost never represents a big problem due to the speed with which you can solve the problem (releasing the accelerator button for a few seconds). It's not a great racing experience, undermined by very lackluster track design and a general lack of balance and bite to the game. That almost perfect balance between driving skills and ability to use weapons that made the fortune of illustrious predecessors of the same genre is missing, making everything extremely flat and very little fun. Obviously, in multiplayer you gain in quality, but in any case, you don't reach the gameplay peaks that those who were expecting a successor to Mario Kart, for example, would have hoped for. The mini-games, on the other hand, appear a little better designed, some of which are quite fun, obviously also in this case to be faced exclusively in multiplayer, to be fully enjoyed. Some of these challenges are truly original and fun, the problem is that, generally, they are resolved in a very short time, like small flashes of pleasant gameplay, but which leave the players a bit suspended. Also noteworthy is a strange organization of the multiplayer game, which does not allow users to stay connected together within a lobby, once the few minutes in which an average test takes place: after the conclusion of the game, in fact, Mad Tracks forces players back to the home screen, increasing the feeling of a fragmented gameplay experience. What are we playing? The two main game modes are Adventure and Arcade. Basically, the first allows you to discover the various mini-games by progressively advancing from challenge to challenge, while the second allows you to tackle the various games unlocked in the adventure individually. The specialties are truly numerous, and in practice represent an adaptation of various types of game to the use of cars. In mini-golf, for example, we will have to drive through winding tracks up to a final jump, to be calculated properly in order to land as close as possible to the hole, in the aforementioned table football we will find ourselves playing in teams within this game, trying to push the ball into the net with the car, in one modality we have to run on a table set for breakfast, trying to knock all the opponents down with pushes or with the use of weapons, in another variation we will have to try to knock down all the objects present, clearing the table. The alternatives are many, and probably expanding, given the possibility of purchasing additional level packs. Toy Race It is clear that Mad Tracks is a title aimed at everyone: the simplicity of use and the speed with which you learn the dynamics of driving and using weapons actually leads it to approach decisively towards a casual user. The simplicity in the driving model is certainly explained dto the fact that you are dealing with toy machines, but this and the abundance of weapons available, as well as their inefficiency, cut away much of the sense of challenge in the game, and fail to make it very engaging the clash, even in multiplayer. A minimum of strategic depth is given by the possibility of keeping several slots dedicated to different weapons during the race, collected along the way. The weapons are limited in number, but it is possible to conveniently choose between one and the other at any time, which applies a bit of reasoning to simply pressing the accelerator. Technically, the game features excellent graphics, which in part clash with the facetious aspect of Mad Tracks. That is, the scenarios are suitably modeled in order to represent typical domestic environments in which the machines run around, but there is a sort of logical discrepancy between wanting to appear ~toy~ and the extreme realism of some details (the reflections of the scenario on car bodies, for example). In any case, leaving aside considerations on style, the graphics are very well done. The audio sector, for its part, stands on a general anonymity, with standard sound effects and music that entertains for the few minutes of the duration of a challenge, without too many pretensions. Xbox 360 goals Like any Live Arcade title, Mad Tracks contains 12 different unlockable achievements for a total of 200 Gamerpoints to add to your Tag. Given the structure of the game, the achievements are closely linked to the different actions to be performed within each minigame. The first objectives that can be unlocked with a certain ease concern the placements and medals of the first races, the simplest, but later on things get more complicated, with the need to perform certain actions within the mini-games, such as not collecting power- up during a certain race, don't touch the black snitch in the game of pool or similar. Given the general accessibility of the title however, it will not be too difficult to collect all the points in store inside it. Comment When it comes to evaluating a title from the Live Arcade offer, one cannot ignore the budget regime in which it was conceived and developed. As a simple pastime for a few minutes per game, or a game for casual users, Mad Tracks does its job well. Technically well packaged, the game has its major weakness in the lack of depth and bite, and in the low level of challenge that follows from these shortcomings. Those looking for a simple multiplayer party game will certainly appreciate the immediate gameplay of the Load Inc. title, while those who were looking for the first original racing game for the Live Arcade, capable of following in the footsteps marked by Mario Kart or Micromachines, will be deeply disappointed. It must also be said that the initial offer of 15 challenges runs out in too short a time, and to be expanded it requires the additional download of further level packs (Encore and Bravo, for the moment), from 350 Microsoft Points l 'one, which partially lowers the assessment in terms of value for money. Pros: Small fragments of fun gameplay Technically good, albeit with questionable style Cons: Low level of challenge Lack of game depth Fragmented and dispersive game structure It took a long time for Load Inc. to bring Mad Tracks to Live Arcade, despite the fact that the game was practically ready and perfectly modeled to fit within the offer of the Microsoft online service. The PC version has been available for almost a year now, downloadable for a fee directly from the developers' site, and the first images of the Xbox 360 version had already been circulating for some time, but the decision to expand some game mechanics, and above all to insert the fundamental multiplayer mode, combined with the scrupulousness of the certification procedures to become part of the Live Arcade offer, have made this product wait a long time. Despite having come in a period of frenzied activity of the Microsoft digital delivery service, the title of Load Inc. has managed to maintain the primacy as the only original racing game present on Live Arcade, although when tested with the pad it is immediately revealed as Mad Tracks is not limited to being a miniature car race, but a sort of container for games based on toy cars. The images of the game piqued the curiosity of the players, especially in view of what Mad Tracks looked like, and could have been: memories related to Micromachines or even Mario Kart crowded into the mind, electrifying us at the thought of merging the gameplay of those giouch to support for online multiplayer via Xbox Live. Unfortunately, the test of the game gives us a much more bitter reality.", "date": "2007-06-05", "grade": null}