{"name": "Fronte del Basket 2 - Recensione", "ref": "https://multiplayer.it/recensioni/fronte-del-basket-2-recensione.html", "text": "Taking advantage of the experience gained in the development of the first version of the video game and also based on the comments received from users, the Idoru software house has therefore prepared numerous improvements to the product in an attempt to offer a title that is as close as possible to real basketball as well as making it more fast, playable and rich compared to what was proposed with the previous video game. Once a game has started, the first striking element of this new edition is the introduction of some game mechanics that had not been included in the previous release. In particular, the presence of the movement of the ~pivot foot~ finally makes it possible to carry out turns and crossing steps, actions which decisively increase the number and quality of movements available to the player and which reduce the ~skating~ effect which it was present in the old version of the video game. Another possibility offered by the new control method is that given by the ~backs to the basket~ game, an element that is loved and used extensively in offensive actions in basketball simulators such as, for example, EA's NBA Live. At the simulation level, we notice an improvement in the attack patterns both when used by your team and when having to deal with the formation of moves from the computer. The players on the pitch respond better to game variations even if in some moments the system's AI falls into some defaillances making counter-attacks or elaborate series of passes useless. Among the various implementations aimed at increasing the realism of the simulation, we point out the introduction of expulsions and technical fouls: two penalties that were not present in the first version of the product and which now cover all possible basketball infractions. For all lovers of the managerial part of sports games, Fronte del basket 2 offers a small and limited team management, giving players the possibility to buy and sell their team members, thus allowing them to modify the rosters of the league teams during championships and seasons, avoiding the possibility of running into repetitive clashes or remaining too anchored to the original formations of the teams. Comment Fronte del Basket 2 looks like a good videogame dedicated to the game of basketball, certainly suitable for all lovers of the genre and in particular for those who follow the Italian league. Although far from the graphic and technical finesse of the most famous titles dedicated to the American championships, one can only give a positive vote to a video game distributed at a decidedly low price and supported by a continuous release of patches dedicated to updating player data based on to their actual performances recorded during the current championship. Pros All the teams, players and arenas of the Italian league Good implementation of game tactics Database updatable online Cons Player characterization can be improved A.I. of opponents at times uncertain The true strength of the title certainly remains - thanks to the license of the Lega di Pallacanestro Serie A - the presence of a database containing all the teams of the 2006-2007 championship as well as an archive of over 200 players each accompanied by their own real statistical data extracted from official tables of the championship. All constantly updated thanks to the continuous releases of new statistics freely downloadable from the game site. After a few games we can say that many of the defects that were present in the previous version of the product have actually been corrected; above all there is a greater speed of play and a more accurate management of the actions as well as a marked characterization of the individual players who, although not reaching the extreme realism of other video games on the market, appear to be clearly superior to the anonymous implementation present in the title of the last year. In fact, from a graphic point of view, various detailed textures have been added to the three-dimensional models of the players which have led to the introduction of details such as beards, mustaches and sideburns as well as tattoos, leg and arm braces, medical bandages, bandages and the forehead. Continuing to analyze the implementation of the players, we point out that the movements related to them have been doubled by adding a further 150 animations again created thanks to the motion capture technique; all to reach a total of over 300 movements visible in the game. As for the environment in which the various championship matches are held, there are all 18 arenas where the matches are played.tite of the top basketball championship and, as per tradition, every single game action is underlined by a well-made commentary. The Italian basketball championship is back In all sports, passing from one season to the next, the teams are renewed, the coaches change, the sponsors alternate and the only element that usually remains constant and unchanged is that linked to the sporting ~faith~ that binds the fans to the teams for which side. The same happens in Fronte del Basket which has therefore changed compared to the previous edition thanks above all to the large community of enthusiasts who did not fail to purchase the only product on the market that can boast the license on the Italian basketball championship and which, thanks to the interaction with the programmers made possible through the forums on the web, he was able to comment and point out the elements that could be retouched to give life to a better video game.", "date": "2007-06-04", "grade": null}