{"name": "Eledees - Recensione", "ref": "https://multiplayer.it/recensioni/eledees-recensione.html", "text": "Scaramakai Coincidentally, Kai's father forgot the capture gun at home, a kind of super liquidator, however, equipped with the ability to capture the Eledees anarchists; and this is obviously the aim of the game, in order to get things back to normal. The gameplay is based in terms of mechanics on a sweetened version of that of first person shooters; in fact, the action takes place through the eyes of the young Kai, and it is possible to move within the three-dimensional settings with the nunchuck stick, instead rotating the gaze by moving the pointer via wiimote to the edges of the screen. However, unlike the fps, in the Konami production there is no threat to one's life, nor will we be forced to meet brutal enemies of enormous dimensions. On the contrary, quite simply, we will have to search and capture all the hidden Eledees in the rooms of our house; some of these, the less aware, can be met immediately while wandering around without too many problems. But most of them will instead tend to hide in the most remote ravines: inside vases, behind shelves, under piles of books, hanging from chandeliers and so on, for a long, long series. This aspect certainly constitutes one of the funniest components of the game, since the interaction with the objects present in the various rooms is really high and well done, even if it rests on a physics that is often questionable. Virtually every single thing on screen can be grabbed, manipulated, rotated, and finally thrown, all via the versatile beam of the all-important capture gun. In most cases, however, the nice (??) Kai will not be able to take it too easy, since for each level a time limit will be provided within which to reach a certain energy threshold. In fact, each captured little creature supplies a few watts, and by reaching pre-established quantities it is possible to activate some electrical objects such as computers, vacuum cleaners, radio-controlled toys, microwave ovens, etc. All this in order to find a different species of Eledees, the yellow ones, with which to increase the power of your capture gun and consequently the ability to move and manipulate objects of greater weight and size. Fun? Without a doubt, and indeed the first tens of minutes spent in the company of the Konami title, after the long-winded and exhausting tutorial, represent a decidedly fresh, intriguing and engaging experience. The power of love Too bad that inevitably such a simple type of gameplay that shows all of itself from the early stages of the game tends to become repetitive quite quickly. Aware of this, however, the programmers have tried to refresh the formula with some variations on the theme which in reality tend to be more of an unjustifiable annoyance than anything else. We are referring to the limitations placed in certain levels, such as the need not to make too much noise or not to destroy the furniture; in addition to the illogical reasons (why shouldn't I make noise if no one is home?), these rules limit and emasculate the most valid aspect of the experience offered by Eledees, i.e. the possibility of free interaction and the fun linked, simply , to make a battlefield what were previously tidy rooms of a normal house. As for the graphic component, Konami has certainly improved this aspect a lot compared to the very first embarrassing appearances of the game; nevertheless, for the umpteenth time we are faced with a ~Gamecube level~ game, and although the childish and cartoony style adopted by the designers can partly justify the reduced polygonal complexity and the level of detail, on the other hand the paucity of the textures and the inconsistent frame rate make evident a programming that could certainly have been better from a technical point of view. We prefer not to dwell too much on the bad multiplayer, really to be avoided, while the fun edit mode deserves applause, with which it is possible to create your own levels within the settings already present, and then send them via connect24 to your friends. An interesting addition capable of increasing the overall longevity, otherwise too small since just over 5 hours in total are enough to get to the end credits. Comment Eledees is a fascinating game, which in the first hours of play is really capable of involving and entertaining, thanks to a gameplay that is simple and immediate, but also satisfying and intriguing. Too bad that everything runs out too quickly, without being able to provide new elements capable of keeping the interest alive in the long term. An occasiontherefore lacked it; what remains is a product certainly not to be rejected, but which could have been much better. Pros Concept original and valid Initially very funny Edit mode excellent Cons Soon repetitive and too short Technically mediocre Bad multiplayer According to Konami, energy is not produced prosaically through the methods we are used to knowing and have always studied; on the contrary, it is in the hands of the Eledees, cute little creatures delegated to supply electric light, move cars, and in general to make most of the objects that surround us and that we use every day work. During a dark and stormy night, however, something suddenly changes, leaving everyone in the deepest darkness; at that point a couple of scientists, great experts of Eledees, decide to go out in a hurry to find out the cause of the serious blackout, leaving their little son Kai alone at home. And guess who we will be called to take on the role of? But the brat, of course!", "date": "2007-06-01", "grade": null}