{"name": "Recensione di La Pucelle Tactics", "ref": "https://multiplayer.it/recensioni/recensione-di-la-pucelle-tactics.html", "text": "The World of Paprika The population of the Kingdom of Paprika is plagued by the constant attacks of a large number of demons and monsters of all kinds. The fragile balance that allowed the forces of good and evil to coexist in a perfect cosmic balance has been broken and now the dark forces have taken over. To put an end to the horrendous invasion and try to bring relief to the citizens, the local church, called the Church of the Maiden of Light, headed by the ambiguous Father Salade, decides to form a team of demon hunters called, precisely, La Pucelle ( the name says it all). This team of demon-hunters includes the very likeable Sister Prier, the irritable and aggressive protagonist of the story, her brother, the shy Culotte (a character who often also has the role of narrator during the adventure), and the always loyal duty Sister Alouette. As is logical to expect from a strategic RPG, as the game progresses, other elements will join the initial party. Among these I point out the mysterious Croix and the crazy, nice band of pirate kittens led with a more or less safe attitude by Captain Homard. As you may have guessed from these few lines, the plot of the game seems to mimic other titles of the genre, almost a parody of those RPGs with dark and serious stories, made fun of with the typical humor of Japanese anime productions. La Pucelle is a strategic RPG divided into 12 chapters, each of which is characterized by its own ending, which in turn is available in three variants. There are in fact three possible endings, namely Bad, Good and Special ending. Although they do not affect the actual ending of the game that much, they constitute an interesting addition to the genre, especially in terms of replayability. Not to mention that depending on the score and the type of ~ending~ obtained, you can have special items and more or less money to invest in the shops. The structure of each chapter is quite particular. At the beginning of each of them we will almost always find ourselves in Father Salade's study, who, with his particularly unreliable air, will explain our daily tasks to us in a sort of pre-mission briefing. After that, like any self-respecting Rpg, we can start playing. First we can decide to explore the city in an unusual side view, platform style of 16Bit consoles, talk to other citizens or make purchases in the local shop. Otherwise we can kick off our mission by going outside the city walls and starting the exploration of the outside world. Once we get outside the city we will find ourselves around the kingdom of Paprika. Here our characters will move on a traditional two-dimensional map where the various villages or dungeons are represented by simple dots. As soon as you have decided what to do, just position yourself on these ~signs~ to be able to access the areas. In the case of the villages, as usual, once you enter you can interrogate the various inhabitants to collect clues or something else for our mission, or you can access the local store to go shopping. And there are a lot of interesting items to buy in the shops of La Pucelle. Above all when, having increased our level of loyal customers (it increases based on the number of deals successfully concluded in that shop), we will be able to make available some very interesting advanced options such as those that allow you to set the level of enemies to make them stronger or to triple our EXP, as well as the option called Survey which will allow the player to intervene directly on the assortment of objects and weapons available in the game. In the case of a dungeon instead, we will have to prepare for a long series of battles, the real fulcrum of any self-respecting strategic RPG. The areas that make up these levels are made up of various maps structured according to an isometric view in a pseudo 3D of the past. These arenas cannot always be rotated at will, unfortunately, and this can create some problems, as the user is sometimes prevented from being able to see any hidden enemies or portals. Be that as it may, to proceed from one map of the dungeon to another, simply reach the exit or defeat all the monsters first. The battles The fighting system of La Pucelle is very similar to that of almost all the other strategic RPGs in circulation, including Disgaea: at the beginning of the battle we will be able to deploy our units on the playing field (up to eight characters can compose our party) . After that, in the next turn, we will be able to move the units and make them perform all kinds of actions, such as physical attacks ormagical, and so on. One of the peculiarities of this last Ichi effort are the group attacks. In fact, our characters can perform two different types of combined attacks: support and simultaneous attacks. The former allow some elements of our party to help the character who attacked the enemies first, while the latter will cause the whole team to attack at the same time causing huge damage to opponents on the map. As always, it is important to plan our attacks in the best possible way, given that being able to hit an enemy from behind, perhaps from an elevated and therefore easily defensible position, will cause him to suffer greater damage, allowing us to earn more bonus points. The battles But the characterizing element of La Pucelle's battle system is undoubtedly the so-called ~purification~. Its double function as a ~cleaner~ of evil from monsters and dark portals is something interesting and at the same time innovative, not to mention its intrinsic usefulness in the context of a clash. This system consists in performing two basic functions: that of purifying an enemy before eliminating him (in this way he will go over to our side), and that of purifying the so-called dark portals. In almost every map, in fact, there are ~dimensional gaps~ called, precisely, ~dark portals~. From each of them dozens of demons can come out or a negative energy flow capable of running through the scenario and creating serious problems for everything in that area. If you meet a character, be it friend or enemy, this energy can lower some basic parameters such as Defense or Attack points, and change direction of movement depending on the position assumed on the map by the aforementioned victim, thus affecting whoever is next to him. However, like any ~weapon~ out of control, this evil flow can also be exploited to our advantage. And this is where the Purify command comes into play. Using it after having channeled the right amount of energy into an object or into an enemy's body, we will be able to generate a Miracle, a very powerful magical action capable of causing massive damage to all enemies on the map. Miracles are generally based on the four key elements that make up magic in La Pucelle (Water, Fire, Wind and Lightning), and also allow you to purify the offending portals to prevent other demonic creatures from coming out of them and infesting the area. The allure of 2D Graceful, ~tender~, there are no other words to give a correct definition of La Pucelle's graphics. Everything is colorful, rounded, playful, almost as if it wanted to faithfully reflect its clear anime inspiration in every detail. Even the ~bestiary~ seems to ~reflect~ the cheerful atmosphere of the game. During the various stages of exploration or combat, in fact, you will be able to admire a whole sampling of absolutely laughable creatures, and which vary from pacioccosi teddy bears to absurd hairballs up to very nice talking and singing mushrooms. Even the most fearsome enemies, such as skeletons or demons, ultimately have a good-natured and reassuring air. For those who love ultra-detailed graphics, full of polygons, high-resolution textures and film-like special effects, this La Pucelle can almost constitute an affront to the potential of the Ps2, presenting antiquated graphics worthy of the old 16Bit ~machines~. However, passing over this aspect and comparing the game engine to titles of the j-strategic genre, which almost all adopt a similar style, those who also appreciate the good old 2D will find in La Pucelle satisfying graphics, with vivid colors, with characters cared for and well characterized, even if they do not reach the level of detail of those of Disgaea. Finally, moving on to the audio sector, the game has quite catchy tunes all in all. While not showing an excellent quality in their realization, with the exception of the beautiful ~Maiden of Light,~ main theme ~of the Ichi title, they perform their duty well, characterizing the various game situations with ad hoc sounds. The sound effects and speech are also excellent, available upon option, both in English and Japanese, as in Disgaea. Conclusions Someone defined Nippon Ichi Software as the new Squaresoft, recognizing them, in fact, the same merits that were recognized to the Chochobo house at the time of the SuperNes, at least in terms of the general quality of their games. Perhaps the comparison is a little risky, however it seems undeniable that Ichi is really making very interesting and technically satisfying titles, in some ways just like it did years ago.behind the Square. For all those who loved Disgaea, La Pucelle is a real godsend, sorry, from Japan. With a cast of very likeable and in their own way fascinating characters, and an entertaining story, this RPG seems able to compete with the more touted ~predecessor~. Despite being a production prior to Disgaea, in fact, La Pucelle still appears excellently made and manages to offer the gamer many hours of absolute fun, engaging even the most experienced fans of strategic RPGs hard, with a decidedly deep Battle system and a longevity of everything compared, thanks to the approximately 40-50 hours needed to complete the basic adventure, or 100 if you want to complete the Dark World sub-quest. Too bad for the censorship work carried out by the guys from Mastiff LLC who took care of the localization of the product for the USA, who had to eliminate religious (crosses) and anti-social (cigarettes) references. Hoping to see it soon here in our area in the Pal version, perhaps in the new guise announced just these days by Ichi Software and which should be called La Pucelle: Hikari no Seijo Densetsu and contain some new features, we just have to strongly recommend it to all lovers of the genre. Pros: Characters and settings spot on. Level of difficulty well calibrated. Original language dubbing worthy of an anime. Excellent longevity. Cons: Graphics may look dated at first glance. The New Game is missing. Not perfect localization and some censorship. After snubbing it for years, except for a small circle of enthusiasts, the West finally seems to have rediscovered a genre that in Japan has always been considered one of the most important and loved by every owner of a video game platform. We are talking about strategic J-RPGs, i.e. those, to be clear, in which, in addition to the plot, the fights take on a key role in the gameplay. In such fights, the user needs a large dose of strategy and planning to bring his party to victory in clashes that usually take place on pseudo-3D maps with an isometric view, ala Final Fantasy Tactics for instance. This resurgence of interest by Western users in this genre of role-playing games is due, at least in the United States, to the software house Nippon Ichi Software, author of that Disgaea: Hour of darkness which has recently found so much success also from our set off. Driven by the success of Prince Laharl's adventures on American soil, therefore, Ichi decided to try an encore by ~exporting~ one of her old successful titles to Japan, La Pucelle (Tactic's in the USA), a real spiritual prequel of Disgaea itself .", "date": "2004-08-18", "grade": null}