{"name": "Pokmon Unite", "ref": "https://multiplayer.it/recensioni/pokemon-unite-recensione.html", "text": "The MOBA was just missing from the list of genres that Pokmon has embraced. Since its debut twenty-five years ago, the Japanese franchise has not missed an opportunity to expand and change its skin numerous times, while remaining deep down always itself. From classic RPG to pinball, from fighting to racing, even going to augmented reality with Pokmon GO and an open world still in the pipeline, we thought that Pokmon had really touched the boundaries of the gaming world. But we had forgotten about MOBAs: no problem, it recovered on that front too and here, fresh, Pokmon Unite. Needless to hide behind a finger, when it was announced in June 2020 the reception received was lukewarm to say the least: let's say that Lorelei's Lapras would probably have felt at ease in the climate generated. Seen with suspicion and as a kind of betrayal of historical fans, or as an opportunity to earn money without any respect for the franchise and what it has represented all these years, Pokmon Unite was for a while the target of criticism; then we forgot about its existence until the first leaks of the beta and in the end, on July 21st, we found it on our Nintendo Switches completely free of charge, also waiting for the mobile version scheduled for September. After trying it, we were pleasantly surprised: it's certainly a game with ample room for improvement, but it's fun and, in our opinion, looks like the right entertainment while waiting for Shining Diamond and Shining Pearl, first, and the famous Legends Pokmon: Arceus poi.Let's find out Pokmon Unite in the review for Nintendo Switch. Welcome to Aeos Island Our story begins on the Isle of Aeos, where a force fittingly called Aeos Energy gathers in high concentration. Phorus, a professor who makes an appearance in a very quick introduction before leaving us in the hands of her assistant Erbie, informs us that the so-called Unite Battles 5v5 exploit this energy, which is seems to be very positive even if initially we don't know exactly why . So here is the genesis of Pokmon Unite. It has the structure of a MOBA, a League of Legends game, so to speak, but its goal is not to destroy the enemy base, but to score the most points within the time limit: a small deviation, therefore, from the mechanics typical of the genre. It almost looks more like a hybrid between a sports, basketball if you want, and MOBAs. At the helm of our Pokmon, we must defeat the minions scattered around the map to increase our level, obtain Aeos energy (we obtain more from opposing players but wild Pokmon also leave some) and fight our way towards the enemy bases, where we will score points to gradually destroy them. All this while taking care to defend our area, under the same pressure from the opponents. Don't be misled, when we wrote that the goal is not the destruction of the enemy base, we really meant it: tearing apart the intermediate bases serves to reach the main one, where we can accumulate even more points, and above all it allows us to cancel the slow effect that is applied to anyone attempting to pass without first destroying intermediate stations. The basic experience of Pokmon Unite is enclosed in a 5v5 challenge (with some variations in Quick mode) where the winner is whoever accumulates the most points when time runs out. Pokmon Unite, the main screen In other words, forget about MOBAs with grueling one-hour matches: each game is a ten-minute bite (less in Quick Plays), which we can access after a quick tutorial that goes over the basics of combat and scoring. This means that even the most closely fought matches will end when time runs out and you will not be able to choose to continue indefinitely until a team is defeated. There are currently twenty Pokmon available, most of which can be purchased using in-game currency or real money , depending on how quickly you want to master them, but some can be unlocked by increasing the trainer level or completing the daily challenges: microtransactions are a free-to-play classic, and Pokmon Unite is no less, however it should be specified that even without spending real money it is possible to safely advance. Just don't get caught up in the frenzy of getting everything immediately. After all, if it is true that in MOBAs (but in multiplayer in general) part of the work is done by team composition, the rest falls entirely on the shoulders of the players: you can have all the strongest Pokmon on the roster, but if you still don't know how to use them, the problem remains. Above all because they must be taken into considerationaction the roles covered by each to act accordingly, putting together a group of five that is cohesive and functional. An all-support or all-attack team won't get you very far, despite the game's rather simplified mechanics. Pokmon have two abilities (linked to R/ZR) and a super move that you unlock as you level up. In this regard, the leveling system manages to reconcile the MOBA genre and the core of the Pokmon experience thanks to the evolution mechanic: for obvious reasons, the levels at which Pokmon evolve do not reflect the real ones (to say , Charmender will not evolve into Charmeleon at 16 or Charizard at 36, but respectively at 5 and 9) but the fact that the game proceeds in stages and links the need to level up to evolution fits perfectly. Furthermore, leveling up allows you to perfect the moves you have chosen to learn: at the beginning you have two default skills, which can be replaced by choosing between two others and subsequently, the selected one can become +, then further enhance and often activate additional effects. The downside is that a starter pokmon will be quite different to play than an evolved one and some very effective moves at the beginning (think Pikachu's electric grid) are no longer available as the game progresses. That said, MOBA archetypes are alive and well in Pokmon Unite, tied to specific characters: Pikachu favors distance, Charizard the melee, Zeraora is a speedster great for chasing down fleeing opponents or taking objectives stealthily, Slowbro a suitable defender for holding opponents back while the rest of the team comes in support, and so on. There's enough room for Pokmon Unite's small meta to grow, waiting for players to discover the best strategies and combinations to dominate the battlefield. Fighting against wild Pokmon isn't very exciting, but when you get involved in head-to-head with the opposing team (or with special Pokmon like Zapdos, Rotom, Drednaw and others) things become more captivating there. Pokmon Unite, we bought Greninja with coins earned by playing and it turned out to be a great buy To give greater depth and stratification to the gameplay there is the fact that the Pokmon can also be equipped with battle items, up to a maximum of three at a time, which combined together can change the game. Also because by enhancing them they will be able to give progressively more substantial bonuses. Furthermore, it is possible for us trainers to equip an object of our choice to use during the game to support our Pokmon - be it a potion, an increase in attack, speed or whatever. Naturally, the use of the item in question is linked to a cooldown, so we must be careful not to waste it. The same attention that must be paid to the passives of each Pokmon: although simplified compared to other MOBAs, it does not mean that Pokmon Unite lacks strategy and it is no coincidence that Pokmon are also differentiated based on how manageable they are on the field. Charizard, for example, is suitable for novices while Greninja is already for experts given its tendency to use moves that confuse opponents (Double Team or Smokescreen). At the moment there are three game modes available: Standard, available immediately, Ranked , accessible by owning 6 pokemon and Quick, which are unlocked at level 8 instead. The differences between Ranked and Standard are minimal: what differentiates them is that the former will affect your global level. The only change can be seen in the Quicks, which on the basis of a pre-established rotation make a different map and number of participants available, halving the time available. In these maps you will always need to score more goals than your opponents, but the positioning of the baskets, the presence of ribbons and different pokmon make the experience quite different from the others. We are also sure that Pokmon Unite will evolve just like its protagonists do, but as a start, perhaps we would have expected a richer dish, especially if the game will have to deal with the hundreds of warriors and options of League of Legends Wild Rift and Arena of Valor. Of course, there is the question of collecting all the Pokmon available so far in a genuine way, relying on in-game coins, or the desire to obtain the various cosmetics, but it may not be enough to make a fanbase not used to this kind of experience fall in love with it. . There are also those who show the slightest interest in these things and prefer to throw themselves into the fray. Where Pokemon Unite falters a bit is in the contentstarting point and in the rigid progression that characterizes it: the single map and a handful of free-to-play characters in rotation, the latter an aspect that pushes towards microtransactions, give a bit of a setback. The most unpleasant element is the limitation of 2100 coins per week, against the minimum 6000 necessary for the purchase of a new Pokmon license: the game obviously relies on the haste in having the most efficient Pokmon available and this strategy from ~only a taste~ has already hit the mark, as far as buying with real money is concerned. Pokmon Unite, the store is divided into three categories We do not completely penalize the presence of microtransactions because, right now, it is possible to win a game even without spending a single euro. However, we have to see with time and the introduction of new Pokmon to what extent you can resist without opening your wallet. The hope is that the experience remains as balanced as possible (on the other hand TiMi, being also the developer of Arena of Valor, already has considerable experience in this genre of games), but without knowing what are the future plans for the expansion of the game, we navigate by sight. As for other expenses, especially in terms of cosmetics and alternative versions of Pokmon, there are very few elements for which you actually need to spend real money: with a little patience, everything else can be bought using the in-game currency, which is also obtained by completing different daily tasks. Overall, we find Pokmon Unite to be a well-crafted game: the stadium doesn't offer much variety, but the character models are decent while not being too detailed. The attacks are sufficiently choreographed, especially the super moves, and typical MOBA elements remain such as hiding - in tall grass - to attack unaware enemies. help. If you are facing a Pokmon, let's say a Rotom with the intention of weakening the opposing bases, it is enough for a player to pass in the middle to be immediately targeted, ignoring what you were doing up to a moment before, thus forcing you to manually take aim it so as not to lose sight of the main objective. It's not a huge issue but we'd find the ability to lock onto enemies particularly useful. There is the possibility of splitting the basic attack between opponents and minions, or to put the auto lock, but they may not be suitable options for everyone. In summary, however, Pokmon Unite is a great introduction to MOBAs, suitable to both the youngest and the most experienced players, and we hope it will expand quickly enough to offer more possibilities than the current ones. Played on the television, it reaches 60fps while in portable mode it stops at 30fps: it is however possible to push the game towards better performance from the settings. Surprisingly entertaining, Pokmon Unite has given its contribution to the MOBA genre and with the right support it could become even more enjoyable to play. In the hope that microtransactions don't take over the total experience.", "date": "2021-07-25", "grade": "7.8"}