{"name": "Lunar Knights - Recensione", "ref": "https://multiplayer.it/recensioni/lunar-knights-recensione.html", "text": "Chevaliers du Soleil Real Vampires are still our bitter enemies, in this new adventure set in a remote future, where the Earth is a planet obscured by ParaSOL, a device that allows creatures of the dark to block the sun's rays: our world is immersed in perpetual darkness, and vampires have even designed armor technology that makes them even more powerful. Between them and the extermination of humanity, there are two forces that walk parallel: one is the Guild, a secret society of vampire-slayers who use the mystical power of the Sun and the legendary Solar Guns, and the other instead is represented by one man, Lucian, armed with an equally legendary sword and able to manipulate the energies of the dark. The personal revenge of the grumpy Lucian will cross the path of Aaron, a young apprentice of the Guild, son of a famous vampire hunter and heir of his own Solar Gun: the two will find themselves in spite of joining forces to defeat the Duke, lord of the vampires, to restore peace to the galaxy. A decidedly intriguing techno-fantasy premise, that of Lunar Knights: the plot is certainly not particularly complex or surprising, but it reserves significant twists and a series of very well-characterized characters. For the rest, it is a pretext to immerse the player in a world, divided into various areas, where the creatures of the dark must be defeated with gunshots or swords: the isometric view immediately betrays the setting of an action-RPG of the type dungeon-crawling, retracing some locations massacring everything that happens will in fact be vital in order to collect the objects necessary to upgrade the various weapons in possession of our two vampire-hunters. The war skills are simple: while Lucian is able to launch several consecutive sword blows at close range, Aaron can shoot enemies from afar; both have a shield to parry blows, and can summon natural spirits who will join the group as they proceed in the plot to unload real super-attacks on the unfortunate enemies. Dulcis in fundo, Lucian can merge with his talking cat Nero, while Aaron can do it with the animated plant Toasty: respectively, the two will become super-beings in possession of the powers of darkness and light, able to fill the enemies with various special attacks. ... The isometric view immediately betrays the setting of a dungeon-crawling type action-RPG... Chevaliers du Soleil Real Among the occasional visits to pubs and shops, hunting for items or information, the adventure obviously develops through the overcoming of the various locations infested by the vampire on duty and his band of monsters. The puzzles to be solved to proceed from room to room are rather elementary, but the most interesting thing lies in the fact that, as mentioned, real sunlight is no longer used in Lunar Knights: the upper screen of the DS in fact shows the sky and the atmospheric conditions, day and night, which obviously influences the performance and powers of Lucian and Aaron, interchangeable on the fly. Taking advantage of the right character at the right time is essential, especially in closed areas where energy cannot always be recharged and must be saved in anticipation of more dangerous situations. In the advanced stages of the adventure it will even be possible to manipulate the ParaSOL to change the climate, drying or humidifying the areas, to take advantage of the relative consequences in order to solve a certain puzzle or explore a certain area. If all this appears decidedly original, and much more accessible without the constraint of playing outdoors and in the sun, in the mix of RPG, action and puzzle elements that make up Lunar Knights, Kojima Productions also slips in a little space-shooting : defeating a boss with sword and gun is not enough, you also have to take him beyond the ParaSOL, into the stratosphere, and expose him to the concentrated energy of the sun's rays thanks to the specially built satellite. To do this, Lucian and Aaron will pilot a sort of robot-spaceship, which we will actually move with the stylus, and always via the touch-screen we will aim at the various enemies who will attack us, up to the direct confrontation with the space boss of the moment. The control system in these phases is a bit cumbersome and the spatial stages initially clash a bit with the rest of the game-design, but they are undoubtedly fun and spectacular, made in an excellent three-dimensional engine, and constitute a hilarious interlude between already various stages of the game. Boktai Reloaded Technically Lunar Knights proves to be a good quality product, while not particularly squeezing the Nintendo DS hardware: in the isomet locationsriche our protagonists move, detailed and excellently animated, but also the sprites recycled from the Boktai trilogy for Game Boy Advance. The same zombies, ghouls and bats are back to which are added new creatures that rarely reveal the same care for the animations reserved for the two heroes or their arch-enemies, the end-of-stage ~bosses~ who are often enormous and truly menacing. The variety of settings and the decidedly complex and varied design of the dungeons, together with the three-dimensional engine reserved for the shooter phases, demonstrate that Kojima Productions has not really limited itself to recycling old sprites: even in its modesty, Lunar Knights shows a excellent visual sector, also assisted by spectacular cartoon sequences that show the most epic moments of the adventure, decidedly of excellent workmanship, despite the compression which degrades the quality a bit. The classy touches don't end there: some bars of the numerous dialogues are even reproduced vocally to increase the spectacularity of the non-interactive sequences, and at the same time the music is striking for its frenzy and excellent composition. From the cheerful tunes that form the background to the exploration of the various menus in the city, to the more agitated and combative rhythms as you face monsters on monsters in dungeons of all kinds, there is something for all tastes or rather, for all ears. The absence of the solar sensor has deprived this fourth Boktai, even if it pretends not to be, of its originality, but in spite of everything it is better this way: not being bound by the real sky makes this new gaming experience even more enjoyable and compelling. The simple plot does not spare decent twists, the protagonists have charisma to spare, the action is frenetic and full of depth, despite the lack of the ingenious puzzles that had characterized Boktai the dungeons flow pleasantly, with final bosses, in two phases , really funny. Lunar Knights has everything a gamer needs to entertain -- even a simple multiplayer mode, and the graphic style not too distant from the Game Boy Advance editions does not weigh at all on the excellent game design: evolving that too, a possible sequel for this new saga would be really great. Pros Very good game design Technically very good Long-lived and fun Cons Together with the solar sensor it has lost some originality Graphically the DS can do more Shoot'em-up sequences sometimes suffer from frame drops The name Hideo Kojima in recent years has increasingly been associated with innovative, different and decidedly original games. His Metal Gear Solids were probably among the most sophisticated products, from a playful and technical point of view, of the last videogame generation: the only care placed in the scripts, with an extremely cinematic cut, says a lot about the abilities of this ingenious little Japanese man. Moreover, Kojima also invented Boktai, in one of his rare excursions into the world of the Game Boy Advance: we could say that Boktai was literally a bolt from the blue. Not so much for the game, excellently packaged and built, as for the ingenious and decidedly new idea of the solar sensor: Boktai was played by truly exploiting the sunlight, and this was the strong point, but also the greatest weakness of the trilogy (Boktai 3 unfortunately never crossed the Japanese borders). Let's face it, the mechanism underlying the action and puzzles, centered on the painstaking use of sunlight, was truly intriguing, but forced players to turn on the Game Boy Advance only at certain times of the day, without being able to play in the evening. and worse still by forcing them to stay out of the house, given that the light of a simple light bulb was recognized and not considered suitable by the sensor. Yes, a good idea, but a good portion of casual users was cut off from it: so the success of Boktai faded quickly, despite the significant improvements in game-design made from chapter to chapter. Lunar Knights is a new beginning, however, even if in Japan the game continues to be part of the Boktai saga, Bokura no Taiyou: Django to Sabata is in fact the original title of this DS cartridge, and the American adaptation has deliberately altered some names to distance this episode from the GBA trilogy as much as possible: Django has become Aaron, for example, and even sunlight is no longer needed. Or rather, the real one is no longer needed.", "date": "2007-05-29", "grade": null}