{"name": "Cyberpunk: The Arasaka's Plot", "ref": "https://multiplayer.it/recensioni/cyberpunk-the-arasakas-plot.html", "text": "With the advent of polygonal graphics and 3D, we have lost sight of the best things that bitmap graphics have given us, especially as regards its use for play. The current incarnation of Prince of Persia tries to translate into today's language a game structure that owed a lot to the two dimensions and that Delphine Software had the merit of further enhancing first with the historic Another World and later with that absolute masterpiece that is Flashback. Well Cyberpunk - The Arasaka's Plot, the latest effort by Mayhem Studio, from the first screens it appears to be a close relative of the Delphine title, and this can only be a positive note. Furthermore, the intertwining of that gameplay and the narrative content provided by one of the most famous RPGs ever could only produce an explosive mixture, which has the clear objective of shaking up the world of wireless gaming. The gameplay of Cyberpunk - The Arasaka's Plot (which, if desired, is explained to us in detail through a tutorial at the beginning of the game) is based on the platforms and on the different actions that the protagonist is able to perform. These range from simple walking to running (with automatic jumping, in this case), from jumping to crouching, from rolling to clinging and so on: a repertoire that is second to none for mobile video games. Just like in Flashback, our Sam must use lifts and platforms to move around the stages, with the aim of reaching certain areas. This path sees the presence of various obstacles: dangerous jumps, closed doors (which must be opened by retrieving the key), enemies ready to shoot as well as electronic guards capable of launching stun discharges. In our favor we will have a firearm (with infinite bullets, but often with a ~short~ magazine) that can change depending on what we find on the bodies of defeated opponents, but also on the cybernetic implants that give us numerous extra capabilities . In general, the protagonist levels up as in any role-playing game and improves himself by collecting new weapons, new protections and various gadgets. Our contact outside, a hacker as cunning as fascinating, will help us every time we find ourselves in front of a terminal. In some cases, however, it will be our job to enter computers and try our hand at an imaginative ~hacking~ to get hold of the codes necessary to continue, through a screen that lets us use the telephone keyboard as if we were writing an SMS (but without T9, of course). After completing each stage, the game will automatically be saved in one of the slots selected at the beginning. On a technical level, the game surprises in every respect. If one of the strengths of Flashback was the fluidity of the animations, which for the first time ran at twenty-four frames per second, the same can be said for Cyberpunk, which in the current mobile entertainment market has no rivals: where the other products offer lean movements and a reduced amount of animation frames, the title Mayhem Studio puts us in front of a protagonist who does everything and who moves convincingly within locations that are never banal or repetitive. The addition of animated sequences with vector graphics, also very similar to those present in Flashback, closes a circle made up of obsessive attention to detail, as well as pure talent. If the graphics are an absolute strong point of this product, together with an engaging and quality plot, the control system is no different. The layout of the buttons is classic, but the speed of reaction to inputs is surprising as well as the convenience with which it is possible to move the character using a mix of joystick and numeric keyboard. The fights we will have the opportunity to engage with would be unthinkable in other games, yet in Cyberpunk they are as natural as they are frenetic: absolutely exceptional. PRO Technically extraordinary Addictive and thick gameplay Interesting plot AGAINST", "date": "2007-05-23", "grade": "S.V."}