{"name": "SOCOM: Combined Assault - Recensione", "ref": "https://multiplayer.it/recensioni/socom-combined-assault-recensione.html", "text": "Back to action The members of the American task force specializing in international crises must once again face a threat to world peace: the failed attempt to free an important prisoner becomes the starting point for a new adventure, which will see us explore numerous locations around the world in attempt to complete a series of missions. Those who have had the opportunity to try SOCOM 3 will have no problem trying their hand at SOCOM: Combined Assault, as the new episode is more of an add-on than a real sequel: identical structure, identical graphics, same settings but a good number of unpublished maps. The reasons for this extremely ~conservative~ choice are to be found in the developers' intent to transport the series to PlayStation3 in the best possible way, without using many resources in its latest appearance on PS2. Each mission starts with an animated introduction and a very detailed briefing spoken in Italian, in which the objectives to be achieved are highlighted with an eye to the type of location and the enemies that populate it. We then move on to the management of the team, made up of four agents whose arsenal is freely modifiable, with the only imperative to remain below a certain load threshold. We will therefore be able to experiment with the numerous firearms at our disposal, passing from machine guns to rifles, from pistols to bazookas, from explosive to smoke grenades and so on. There is no shortage of accessories, which can radically change our approach to combat: telescopic sights, in particular, make it possible to eliminate a target from a great distance with a targeted shot to the head, without exposing the team to enemy fire. [C] The close clashes hide many pitfalls. As usual, &ldquo; possible to take cover and then lean over to fire. Unfortunately, the locations are not very detailed and the frame rate is slow. mediocre. [/C] Game structure Once on the field, our most important reference is the map, which shows the position of each objective. As we move, an on-screen radar warns us of the presence of enemies within shooting distance, perhaps allowing us to issue orders to the team so as not to be caught unprepared. The possibility of commanding our companions in SOCOM has a different value compared to titles such as Rainbow Six, as it is possible to complete the missions (most, at least) without ever worrying about giving orders, relying above all on the action of your alter ego ; something that in the series based on Tom Clancy's novel would be inconceivable. Each map has fundamental and other optional objectives, and at the end of the mission we receive an overall evaluation that shows us our efficiency percentages as well as the time spent. Compared to SOCOM 3, in Combined Assault we will often have the opportunity to choose the mission to try on, leaving the doors open to replayability in case you want to start over and recover the skipped stages. As far as character control is concerned, there is nothing new compared to the past: the left and right analog sticks are used to move and to manage the view (and the viewfinder, consequently), while the directional cross allows us to use zoom or thermal view where available. The shoulder buttons are used to issue quick orders, change weapons or fire the equipped one, while the main buttons of the Dual Shock 2 are assigned to the generic action, the list of orders for the team, the change of position of the character (standing , squatting or lying down) and jumping. [C] Choosing your weapons before a mission can be difficult. turn the tables. In SOCOM, giving orders to your teammates is not an option. paramount... ...and sometimes we will be faced with episodes of blatant ~artificial stupidity~. [/C] Technical realization What has been written so far on the nature of SOCOM: Combined Assault mainly concerns the technical sphere, as the game engine is the same as SOCOM 3 and unfortunately no one has bothered to optimize it in some way. The result is a really low frame rate, together with a low level of detail: two unacceptable things for what is the level of maturity reached by some productions on PS2. The speech is very different as regards the sound sector, which makes extensive use of music of exceptional quality which contributes to the involvement, but which lacks in freshness as it has already been used previously. The sound effects are normal, and the game boasts a complete localization in Italian, with a good quality voice acting. The discourseor the lack of optimization unfortunately also concerns the artificial intelligence of both our teammates and enemies, so don't expect surprises in this sense. The online game mode deserves a completely different consideration, which allows us to participate in games of as many as thirty-two players within very large and well-designed maps: more than an added value, this mode represents the fulcrum of this Combined Assault, giving the product an unexpected longevity. Comment There are teams of developers who have managed to work wonders on PlayStation2, even and above all in this ~conclusive~ period for the console, and SOCOM, for what it represented, perhaps deserved a more prestigious farewell as regards the technical profile. To be honest, the strengths of the series have always been others: the solidity of the structure, the strategic elements and the online mode. In this sense, Combined Assault does not disappoint and offers fans a series of missions and maps of a good standard, especially for network play. So if you've always loved SOCOM and are ready to turn a blind eye to its (historical) technical shortcomings, this latest episode remains a recommended product. Waiting for a decisive step forward on PlayStation 3. Pros: Tested game structure Well-made and well-finished online mode Good level sound Cons: Graphically inadequate AI that can be improved A SOCOM 3 add-on, in practice Over the years, Sony has been able to enrich the PS2 toy library with high quality products, which have since become successful series. SOCOM is a great example of the genre, a solid action game that has undoubtedly pushed online multiplayer. This latest ~old gen~ episode seems to want to give a further blow in this direction, given that it allows us to play on the same servers that host the SOCOM 3 games, thus already finding an established base of people with whom to share the experience.", "date": "2007-05-22", "grade": null}