{"name": "Kamikaze 2: Way of Monk", "ref": "https://multiplayer.it/recensioni/kamikaze-2-way-of-monk.html", "text": "This new chapter in Fujiyama's adventures, now more than ever convinced that he is entrusting his strength to God to help the weakest, is also set in medieval Japan. An evil artifact, hidden by Fujiyama himself several years before the events narrated, will be the trigger for a new terrible threat of invasion by a horde of undead. This action rpg confronts us with 10 quests to solve, particularly interesting and overall well done, so as to occupy our efforts for about four hours of play. We are therefore not in the presence of a disposable game; we will have to dedicate more than some effort to the Herocraft title, but it is a normal consequence given the role-playing structure that has been placed at the base of the title by the developers. If the samurai fights using all the white weapons he has at his disposal, first of all the beloved katana, the monk instead wins using his hand-to-hand fighting techniques and his agility becomes the real strength of each attack. Our monk will be able to take advantage of one of his special moves, making all the rivals around him blind with a surprising attack, thus having time to use his deadly tools. Like any RPG the hero will develop and grow in his abilities as the game progresses; will not only increase its characteristics but also its arsenal will be developed properly with nunchaku and other white weapons. Compared to the first chapter, this Way of Monk has improved in various aspects, not only in the sound, which in any case has a certainly relevant part in the game, but also in the now more detailed graphics and in the interaction with the textual parts which now do not hinder the view of the field of action. The gameplay is satisfactory and the Monk's adventures are decidedly intriguing, from a technical point of view we certainly cannot complain even if we are on only discrete levels. The character development is good and gives a good deal of interest to the Herocraft title, which overall therefore deserves the promotion. PRO Good RPG elements Intriguing story AGAINST Not for too short games Technically only fair", "date": "2007-05-16", "grade": "S.V."}