{"name": "Fire Emblem", "ref": "https://multiplayer.it/recensioni/fire-emblem-3.html", "text": "The Battle System The protagonist of Fire Emblem is an ~apprentice tactician~, which is simply a pretext to kick off the game and be able to control the action in battle. While the game's characters address you directly as the story unfolds, your job will be to guide them and choose your actions in battle. The battle system is introduced through a rich tutorial that lasts roughly the first 10 chapters of the game, and although very simple, they are really useful as after these Fire Emblem will start to get really tough. The combat system is typical of turns, in which you will have to direct the characters towards the enemies and choose the type of attack to perform. For ~melee~ attacks there is a triangle weapon which has the same effects as the famous ~rock-paper-scissors~ game, i.e. establishes precise damage ratios between the main weapons: the sword defeats the axe, the ax defeats the spears and the latter defeat the swords. Three basic spells also work in the same way. In addition to this, once on the battlefield, other very important information will appear: the probability of hitting, the probability of counterattacking and the total damage inflicted or suffered. The game action is always varied, and ranges from battles, to the assault of some fortress, to the protection of particular characters or simply surviving for a certain number of rounds. Many new friends and travel companions As previously mentioned, the game will soon get tough, and the difficulty curve that started on the sly will soon rise, even reaching levels of frustration in the player. But we are still talking about a strategic one. The characters in the game are many and varied, and each one is incredibly well characterized. These will join your party during fights, or by visiting villages and towns. It is very important to always look for new characters because they could be fundamental to the resolution of a particular quest. It ranges from warriors, wizards, thieves, pirates, archers, knights, assassins and many more. Each will join us for a particular reason, and if they fail in battle, they will be gone forever. This is why at a certain point in the game you begin to feel a certain affection for some characters, and on the battlefield we will try at all costs to make him win, because defeat would mean never seeing him again. Each character can be upgraded and leveled: his appearance will change and he will acquire the power to use new weapons or perform more powerful magic. This is why empowerment is so important. Fire Emblem images, sounds and noises Visually the quality of Fire Emblem is mixed. The maps are (rightly) schematized and structurally very simple, on the other hand the cut scenes with the characters are very, very accurate and offer a nice carachter design in full manga style and excellent animations. The menus are simple and easy to use, although in battle there are many options to choose from. The audio sector is certainly the strong point: a lot of music, all well done, evocative, epic, warlike, peaceful, relaxing. Each made with care. The sound effects are the same: the various swords make different noises, the ax swinging in the air causes the classic ~missing~ sound and the heavy armors, walking, seem really heavy, emitting squeaks and clanging. The save system is excellent and allows you to record the game position at any time, and it is possible to save between chapters. Or by choosing the ~suspend~ option, you can interrupt a fight in progress. The adventure lasts approximately 30 hours, and many battles can last a very, very long time, so there are three save slots. There is also a multiplayer mode, which although not as fun as the main adventure is useful for testing the strength of our characters against some friends. For the avoidance of doubt and clarification, Marth and Roy were not included in this Fire Emblem. And for this reason they will still remain unknown to gamers from the Old Continent, how much longer should we wait to see them again? Comment The final answer can only be extremely positive. The time waited to be able to play Fire Emblem in a language understandable to most has paid off: Fire Emblem (Rekka no Ken) for GameBoy Advance is one of the best episodes ever, an excellent Jrpg and a fabulous strategic game, in the style of Advance Wars, but only for us Westerners who have known each other before. The combat system is functional and practical, the compartmentfluctuating but always pleasant graphics, fabulous sound, deep and atmospheric. Longevity is guaranteed by the myriad of battles, characters and locations to face, but the great thing about Fire Emblem is that rarely will you become so attached to the characters of a video game you are participating in. A game in which emotional participation plays its big part, and for this, at least to be tried. Pros: A myriad of spells, weapons, missions and locations to discover Excellent characterization of all characters Immersive audio compartment Intelligent save system Cons: Sometimes very stylized graphics Some battles too long Has the wait paid off? If we exclude a fleeting appearance as unlockable characters in Smash Bros Melee for GameCube, Marth and Roy have never appeared on a European console: this is therefore the first ~contact~ of our audience with the Fire Emblem series. For this reason, the two Nintendo characters will be almost unknown to the general Italian public who have never played an episode of Fire Emblem in Japanese on NES and SuperNes; in any case it is assured that in the land of the Rising Sun the two enjoy a great fame like all the other characters of the great N. The arrival of Fire Emblem on GameBoy Advance is thanks to the guys from Intelligent Systems, first party Nintendo already author of the Advance Wars series. The original title of this new chapter of Fire Emblem is ~Rekka no Ken~, omitted in the old continent as if to make it seem that it is the first. In reality it is the seventh chapter of a long and glorious series of strategic JRPGs, inexplicably never reached us. However, it seems that the wait pays off, because today we are faced with one of the best episodes ever. A deep adventure, with a story that unfolds slowly but incessantly, strategic but which will give all JRPG lovers interested in trying something ~new~ a good feeling of freedom.", "date": "2004-08-13", "grade": null}