{"name": "Theme Park - Recensione", "ref": "https://multiplayer.it/recensioni/theme-park-recensione.html", "text": "What a life in the theme park. Theme Park is a management game where you have to manage and bring to success a chain of playgrounds around the world. It's not just about keeping accounts positive, even if it's what will give you the most problems, but you'll have to organize every little thing within your structure. First the attractions, at the beginning only a handful, then it will be the turn of placing around the various shops and fast food restaurants. Each element can be positioned as desired within the boundaries of its own terrain (very large). You will have to create the streets, set up one-way streets if necessary, and place the indications. You will have to build the toilets, or decorate the park with some greenery. All this can be done using the stylus, just choose the category from the menu below, then choose the structure by drawing a dot or a check mark on it, and then place the object in the free space. However, managing the park is a much more difficult job than you think, or remember, in case you've already dealt with this game. You will have to keep every element under control, the queue that leads to the attractions must be long enough to accommodate a fair number of visitors, but not excessive as to cause too tiring a wait, in the shops you will have to constantly keep an eye on the inventory, the price of foods and some of their properties (such as the infamous salt on chips to quench the customers' thirst). On top of that the rides themselves are a cause for concern, lap after lap each game will begin to wear out until you see a blanket of smoke rising from the structure, that's when you'll need to hire one or more mechanics to repair your rides when they show signs of yielding. Then you'll need to hire street sweepers to keep litter and puddles of vomit out of your park (the rides are bad!), wardens to keep an eye on the rowdy visitors, and masked men to entertain park guests. These are all expenses, which affect a budget that always travels on a razor's edge until a system is found to fleece customers as much as possible and with their blessing. Not an easy task at all. Research and development At the opening of each park (once you have met the criteria of a level you will have to buy a new land, and start over in the new area) your resources, as mentioned, are limited. This is why there is a research and development department which, paid with precious cash, will try to make your life easier. You can choose how to invest your earnings in six different researches, ranging from the invention of new attractions, new shops, to staff training to improve their efficiency. You can also improve the reliability and capacity of already built attractions, create new decorations and services, and increase the size of the warehouse and the bus that will bring more and more people to the park. The more advanced attractions will also give the opportunity to actively participate in the creation of the same. Roller coasters, or raft and car tracks, require the user to draw the track, and in the case of roller coasters, to also place loops and build ups and downs. It should be noted that if the route is created without criteria you will see people thrown off the track, and it is not nice. Also from the management menu you can keep the visitors' thoughts under control, which are divided into three main categories, the happy ones, the unhappy ones, and the indifferent ones. Beyond this first level of reading, however, there are a thousand different nuances, there are those who are hungry, those who are bored, those who cannot find the way out, and so on. Trying to please customers could be a good move to make them spend happy hours and spend money, but it won't be easy. In this regard, during the preparation of the park you will be able to choose an adviser who will help you manage each element as best as possible, even if their indications in the end are rather limited, and are not always well accepted by the patrons themselves. DS vs PC The DS conversion offers identical elements to the PC counterpart, some interface changes and some side additions that do not alter the gameplay. The major changes are obviously to be found on the new control system and on the game options. As regards the first aspect, it is essentially a new interface that replaces the mouse leaving the rest unchanged. Everything works perfectly, each management screen is within reach of a few strokes of the stylus, and one absolutely does not regret the mat and mouse. The two screens are usedin combinations to show the play area and the data area, and will switch as needed. Everything runs smoothly except for some problems deriving from the 2d view of the game which covers some spaces behind the buildings and which will then become unmanageable, a defect carried over from the original version, in fact. Secondly, EA has tried to adapt the game to an audience less accustomed to the genre, less practical and patient. There are now three levels of management, where the most advanced is equivalent to the original game, and the simplest instead saves you the trouble of managing inventory, negotiations and other less ~playful~ parts of the simulation. Then there are also three levels of difficulty which will affect the tenor of the actual challenge. Other than that, nothing else was done, and it wouldn't have been a problem if it weren't for some annoying bugs that weren't even considered bugs at the time, but now you notice them like flies in a sugar jar. Bugs like the janitors and mechanics going crazy somewhere in the level, some pointing at each other in the corners, others start running wildly without stopping. Bugs like those of visitors who get stuck on a piece of road moving frantically in place, and those who, regardless of the barriers you have placed, will cross them as if they didn't exist. Even some of the AI's choices make little sense to us, such as people just wandering around looking for their exit when every intersection is accompanied by signage. All these imperfections, years later, make the experience less enjoyable and more discouraging, even given the level of difficulty decidedly from other times (at least at a normal level). To say that this aspect nullifies what is good there would undoubtedly be an exaggeration, but we must at least take it into account. Comment Theme Park is a great classic faithfully brought back to the DS. There are some small side embellishments for a game that appeared on a more sober PC, and apart from the options that allow you to limit the difficulty and management simulation for the less experienced, the actual game is identical. The stylus controls are a godsend and the dual screen helps keep everything under control. Unfortunately, even all the small bugs of the original have been reported identically on DS and in this sense it was reasonable to expect some corrections that avoided those collateral annoyances that are not caused by the player's inability. Furthermore, the game has been fully translated into Italian (even here there are some sporadic oversights such as some inverted captions). Theme Park was undoubtedly one of the best titles of the genre, and it seems to fit perfectly on DS, even if it is undeniable that the years have passed for him too, and that certain defects have now become less forgivable. The game is recommended to those who love the genre, and to those who were crazy about the original and would like to replay it in a practical way, others think carefully about it, certainly Theme Park is a viable option, but it is also true that on DS there there are many great games just waiting to be bought. Pros The real Theme Park in your pocket Deep and immersive Good adaptation to the DS Cons At times daunting Original bugs not fixed The DS would seem to be made for management and strategy, the stylus to take the place of a mouse, and the second screen to compensate for the problems of low resolution, yet apart from a couple of titles, not many games of the genre have landed on the laptop Nintendo. Several, and fortunately interesting, are under development, while the conversion of a great classic for PC, Theme Park, brought to two screens thanks to EA, has just been released in stores.", "date": "2007-05-11", "grade": null}