{"name": "Harvest Moon DS - Recensione", "ref": "https://multiplayer.it/recensioni/harvest-moon-ds-recensione.html", "text": "But let's go in order The connections with the aforementioned Friends of Mineral Town are several not only in terms of gameplay, but starting from the setting and characters: although the village in which the game is set, Forget-me-not, is different from the one where we lived and worked hard by now well four years ago, retains all the features as well as a fair number of non-player characters. Furthermore, the new friends of the farmer who we will play seem to have the events of the previous title very clear in mind, if it is true that the mayor of our town, one of the first characters we will meet, will keep us engaged in a long dialogue in which a good half will focus on the ~heroic~ deeds of his colleague from Mineral Town... This time, however, there is a premise, as a backdrop to our rural misadventures, a little more complex and borrowed, albeit in a very simplified and parodistic way, from the universe of classic Japanese role-playing games: we immediately get to know what should be the ~bad~ of the situation, Little Witch, who in reality is not bad at all (and this is demonstrated by the fact that she is one of the girls that we will be able to woo and marry in the course of the game, albeit observing very particular rules), rather she is a little bit distracted, that's it! It happens that she can't stand the Goddess of the Harvest, her ~good~ counterpart, certainly not for who knows what philosophical reasons of Yin and Yang and cosmic dualisms, but simply because the Goddess announces herself in every appearance with a ~Tadaaaaaaa!  which Witch finds extremely irritating; the intention is therefore to play a trick on her by stealing her voice with a spell, but only for a while, to laugh in friendship, except that things don't go exactly as Little Witch predicted and the Harvest Goddess ends up in another dimension ! All 101 of the Harvest Sprites go after her to try to recover her, whose job in theory would be to help the farmers of the village, and Little Witch is in big trouble! The sense of the next passage, that is the one in which with a rather disconcerting naturalness Witch assigns to us, young offspring who have just found a large farm in their hands to put back on track, the task of bringing back Goddess and Goblins as if it were the most natural and obvious thing in this world, it escapes us a little, but never mind, because the mission entrusted to us will be accomplished by working hard on our plot, exactly as will be accomplished what are the true objectives of all the factors that respect each other, i.e. eat healthily from the products of their own land, make a lot of money and marry the most beautiful girl in the village with whom to have many children to put to work in the fields and live off the rest of their lives! Ale! I want to go live in the country Having received the accolade for the most banal caption possible in a review of a Harvest Moon, we quickly move on to describing the blend of RPG, management, dating simulator and Animal Crossing-esque communication game that is this Harvest Moon DS. At the beginning you will find yourself simply with the bare minimum in terms of tools and a couple of bags of turnip seeds: all you have to do is free the soil from any weeds, hoe it, sow, water once a day, and in a few days you will have your first harvest! At this point, with the first pennies collected, a real forest of possibilities will begin to open up before you, ranging from buying seeds of different plants to diversify the crop and earn more money, to building new sheds, stables and so on. have purchased or collected the necessary material yourself; what will you have to put in these stables if not chickens, sheep and cows? Well done, you buy them, take good care of them and as simple farmers you will also be skilled breeders! A game, therefore, that never leaves a moment without something to do, with an extremely wide choice of activities I want to go live in the country And then you can buy groceries to support you during work or devote yourself to cooking, but not before having made the necessary improvements to your cottage (a kitchen in this case, but the samples are quite varied), to then give away your succulent dishes to friends or the girl of your dreams. Courtship is an important part of every Harvest Moon: several women looking for a husband live in forget-me-not, and to impress the one you have chosen you will have to indulge her tastes in food and gifts, as well as be a hard worker and possibly in excellent shape. financial health. And in your spare time? A nice ride in the country, for a whochat with friends or a trip to the bar, or a trip to the sea, or a visit to the archaeological excavations and mines to recover, here the game takes on the connotations of a role-playing game, some metals useful for upgrading the tools. And again, on special occasions such as the commanded holidays, devote yourself to this or that activity, and then simply go around that sooner or later something new to do always turns up ... All without forgetting to look for the Harvest Elves, who later , when you would no longer be able to manage on your own what you can potentially do with your money, they will be almost indispensable to you to continue to expand and enrich yourself. A game, therefore, that never leaves you without something to do, with an extremely wide choice of activities; the problem lies in the fact that all this tastes too much already seen, not having changed practically an iota from Friends of Mineral Town, widely correctable defects including such as the excessive speed of the passage of time, the control of the character still anchored to the four cardinal directions , the tediousness of always having to carry out those three or four basic operations every day Fortunately, however, what made the series great also remains intact, the fantastic sense of progression, the satisfaction when in the evening you see the fruits of the own work, the sympathy of characters and situations. Time passes and you never seem to change. Said to a girl it would immediately make you her hero, but compared to a video game series with a few years behind it, it's not exactly a compliment. Compared to FoMT, even the graphics and sound don't seem to change here, in the sense that we have the distinct sensation of finding ourselves exactly in front of the same assets: the sprites and backdrops have been cleaned up here, a small increase in resolution there and a couple of more details in general, to music and special effects a couple of tweaks and an extra channel or two, but absolutely nothing we see and hear will ever make us think that it could not have been done on the old, glorious GBA. Compared to FoMT, even graphics and sound don't seem to change here Time passes The style remains clean and sugary, and the static images of the characters during the dialogues will appeal to more than one player, but it is nothing, nothing that cannot be done on much less performing systems. We wouldn't be completely honest if we didn't say that in fact this HMDS tries to bring something new into play, and it's a couple of related features, but it seems to us really the minimum, dual screen and tactile properties. In fact, on the lower screen, while the game continues on the upper one, the general menu will make a fine show of itself, on which we will be able to juggle easily with the strokes of the stylus between the save and loading screen, inventory, interactive map, general and detailed game statistics and a handy in-game tutorial presented in the form of a TV show by the ubiquitous Leprechauns. Furthermore, when we have to take care of the various animals on our farm to make them feel good and thus make them more productive, a sort of Project Rub sub-game will start, in which our task will be to pet and stimulate the critters, represented in this case with the only polygons that we will see throughout the game, via stylus. There is no shortage of cons to these interesting efforts, represented in the second case by a technical realization that does not make one cry for a miracle and by a substantial inertia of the whole: the novelty of having to pet the animal passes quickly and we will soon identify it as another routine task not unlike the canonical mow the grass / hoe the earth / sow / water. In the case of the menu, on the other hand, we note a graphic/stylistic level that remains anchored to the dictates of a few years ago, the incomprehensible choice of deputing the confirmation of most of our choices in any case to pressing the A key, as well as the fact that, as regards the inventory, while we work the hours will continue to flow making us waste precious time, which, we repeat, is very little. If Harvest Moon DS were the first game in the series, there could be no substantial criticisms: it's a huge, free, full of things to do, fun, well done game. The problem is that nothing there is really new, and in particular the similarities with Friends of Mineral Town for GBA are so evident as to make them heavy and difficult to accept. Even when we go to enumerate the strengths and weaknesses we realize that they are the same as all the 2D Harvest Moons you have ever played! And then the vote can only be punitive in confronti by Natsume, who despite the presence of the first truly innovative console released in twenty years of video games has done nothing to change its formula. It must be considered that the game was released in Japan two years ago, practically at the dawn of the DS era, and then an ~extreme port~ which HMDS ultimately is was more justifiable, but even this, if we want, can be taken as a reason of severe judgement. After all, if you're new to the HM universe or if you can't wait to start over a career as a factor that, despite being the same as the previous one, you still find stimulating, you can as well ignore the vote and rush to buy because what you will find here is made with great skill and gives a lot of satisfaction; vice versa if you are well accustomed to the life of a portable farmer you will not find anything new, and even if you know the 3D exploits of the saga on GameCube and PS2 it will seem to you that you have taken quite a few sensational steps backwards It's time to revive the formula : it is no coincidence that Rune Factory, the next chapter in the saga on DS, promises just that Pros It's the usual Harvest Moon Full of things to do A complex but expertly balanced formula Cons It's really the usual Harvest Moon Very little touch screen functionality hard-hitting The series has never been for everyone Bokujo Monogatari, this is the name of the series in Japan, in fact landed on our screens for the first time in 1997, on the Super Famicom, already complete with all those features that over the years have determined its success among a perhaps not huge group of fans, but certainly affectionate and combative. However, with the advent of 128 bits, and in particular on GameCube, the most famous farmer simulator on Earth (also because it is probably the only one...) has tried to dare by venturing into the unexplored lands of 3D and a greater role-playing component , moreover with excellent results, on portable consoles we are still faced with exactly the same original formula, undoubtedly enriched with dozens and dozens of elements which however only manage to make the experience richer and more complete, without ever changing the basic feeling . The DS with all its innovations could have been the ideal platform to take a step forward even on handhelds, but unfortunately we are faced with a title that does little to distinguish itself from the last portable HM, Friends of Mineral Town, GBA, Anno of Grace 2003", "date": "2007-05-10", "grade": null}