{"name": "Metal Gear Solid: Portable Ops - Recensione", "ref": "https://multiplayer.it/recensioni/metal-gear-solid-portable-ops-recensione.html", "text": "Long live friendship Metal Gear Solid: Portable Ops, as regards the storyline, is inserted immediately after the end of the third chapter, Snake Eater, thus developing the plot. Set in 1970, the protagonist is therefore still Big Boss / Snake, a legendary soldier sent this time on a mission to South America, more precisely within a Soviet base. Unfortunately, this time things are not going well, and in fact the beginning of the game sees the protagonist captured and detained right inside the same base. Thanks to the help of a young Roy Campbell, a historical figure in the series, Snake will however be able to escape and then discover an international intrigue capable - as per tradition - of putting the fate of the world at risk. Compared to the previous episodes of the saga created by Kojima, Portable Ops introduces several new features, starting with the same approach of the protagonist to the mission; no longer a solitary and (almost) impossible fight one against all, set aside this time in favor of the creation of a small army of ex-enemies fascinated by Snake's ~charisma~. In practice, by adopting a much less linear choice than usual, the Konami team has decided to allow the player to choose at will which one to enter between the different areas of the region occupied by the Soviet base; a sort of division by levels, decidedly atypical for anyone who knows the franchise well, but still interesting especially from the point of view of use on a portable console. Yes, because this type of splitting has actually made it possible to organize for each phase of the game what are in all respects short missions, often not particularly complex or completely satisfying, but which can be completed in a matter of minutes. A lowering therefore of the level of complexity which however is compensated precisely by the faculty of recruiting new elements in one's own army, thanks to a rather amusing methodology; in summary, after having got the better of a soldier in a non-lethal way, or simply leaving him unconscious, it is possible to drag the latter into the mobile base truck of the Snake / Campbell couple, thus automatically making him part of your team . From this moment on, the player will therefore have the possibility, through an initially confusing strategic-management menu, to assign men to spy on certain territories, assist the sick in the medical tent, join the technical team to create new objects or send them directly to mission. By doing so, it will therefore be possible to directly control not only Snake, but also any other ally, each one different in terms of characteristics, skills and familiarity with weapons. Although in reality on balance there are very few aspects that distinguish the various controllable characters, it is fun to experience the reactions of enemies or perhaps infiltrate their ranks thanks to one of their former companions. Snakeeeeeeeeeee Together with the intriguing mechanics, what made Kojima's epic saga famous is undoubtedly the plot: complex, surprising, sometimes excessive but always able to push the player to continue to discover its development. Portable Ops fortunately brings with it a robust and satisfying storyline, at the level of the name it bears, and which, as already mentioned, fits within the main groove, really going to reveal new elements of the life of Big Boss and numerous other co-protagonists and old acquaintances. Unfortunately, however, due to technical or budget limitations, Konami had to give up the splendid, cinematic and exciting 3D non-playable sequences in favor of undoubtedly very high quality animated comic strips, but which even the most condescending will struggle to put on the same level with what was seen in the episodes for living room consoles. A mouthful to swallow willy-nilly then, which in any case becomes more and more acceptable as the game progresses. As far as the control system is concerned, the now often regretted absence of 2 back buttons and above all of the second analog stick compared to the PS2 pad has forced the programmers to make compromises especially as regards the management of the camera, fixed in a similar way as seen in MGS3 Subsistance. The problems arise when it is necessary to change the angle of view, an extremely frequent situation in such a game, all the more so given that the radar (or rather the sound detector) is not exactly completely reliable. That said, however, it should be emphasized that Portable Ops is technically without a doubt one of the most amazing games ever seen on a portable console, with a level of detail and a mass of polygons very close to the PS2 counterpart; the only pointweak, as has become a habit on PSP, are the textures that are not always of high quality. The sound is also very good, which in addition to excellent orchestrated musical pieces can also count in this American version on a dubbing which confirms the excellent results recorded with the previous episodes. Finally, the multiplayer component is very important, which in addition to the local network modes also offers the possibility of challenging other players scattered around the world online. The result is very similar to what we saw in the aforementioned MGS3, albeit limited to only deathmatches, team deathmatches and capture the flag. The interesting thing lies in the possibility of bringing one's army online, and therefore of losing one's men or, on the contrary, gaining those of the opponents after defeating them. This component which, added to the approximately 15 hours necessary to complete the main story, makes Portable Ops a title with a truly remarkable longevity. Comment To say that Portable Ops is in all respects a ~real~ chapter of Metal Gear Solid is not correct; the changes introduced by the Konami team compared to the main series for living room consoles are in fact numerous, starting with the non-linearity and brevity of the missions which, while marrying better with the philosophy of a portable console, take away some involvement and epicness to the final product. At the same time, the high strategic management component shifts the needle of the gameplay balance in a significantly different direction. Taken therefore for what it is, without necessarily having to compare it with its illustrious predecessors, Portable Ops reveals itself as a product of great quality that surprises above all for the level of complexity from every point of view achieved by a game for handhelds and which is placed without big difficulty among the best titles available for the Sony portable. Pros Intriguing strategic-tactical component Technically excellent Snake's charm never fades Cons Not a ~real~ MGS No cinematic sequences Short and not always rewarding missions Difficult control system Despite having accompanied the Sony laptop since its first months of life, it certainly cannot be said that Snake has gone out of his way to support and push PSP sales, preferring on the contrary to tread the path of experimentation by moving away from the game mechanics that they had made famous. Although the two Ac!d have therefore tickled the lovers of turn-based strategy, and although the Graphical Novel has managed to unravel some of the dense mysteries of the series through what in all respects was a digital comic book, the bitter taste has not never left the mouths of all those who expected a real chapter of Metal Gear for PSP. Evidently aware of this desire, Konami has now finally decided to please all Snake fans by making an original episode for PSP (rather) faithful to the mechanics of the main trend.", "date": "2007-05-10", "grade": null}