{"name": "Recensione di Cycling Manager 4", "ref": "https://multiplayer.it/recensioni/recensione-di-cycling-manager-4.html", "text": "In the role of a shoe manager That's because our duties outside the flagship are really bare-bones. The very choice of the team to lead is based only on name and budget, and it is not even possible to choose your own name as general manager. In all decisions then, the CyM4 system will absolutely not help us. First of all, the strengthening of the team, essential to aim for something good. Apart from the usual search for characteristics and scouting talents, what is disconcerting is the inconvenience of the system for purchasing riders (I said purchase, and not buying, because it's not possible to sell riders, but we'll talk about this later). Only a window with an ~estimated value~, always well below the real requests, and our offer, and only a yes or a no answer. No negotiations, no indications, it goes completely blind, and the same goes for the contract offer, with the aggravating circumstance that if the rider refuses, the deal is canceled and you have to start over with the offer to the team. An inconvenient waste of time considering that there are only 17 market days at the start of the game. Furthermore, as already mentioned, it is not possible to sell or fire riders until you exceed the limit of 25 which is the maximum number of riders you can have in your team. Probably this is due to the rules of the transfer market, but it is still not clear why the player has to spend hundreds of thousands of euros (if not millions) to buy riders, while the computer-controlled teams never make us any offers. Similarly, why take away the possibility of firing them? Another fish to fry is the renewal of contracts: this option is also completely missing. You have to wait for the old contract to expire and offer a new one, with the usual handicap of the absence of negotiation. In the role of a shoe manager However, now that the squad is sorted we have to decide the place and duration of the preparatory retreat. A practice that will become common, given that withdrawals cost very little and allow you to have a bonus to characteristics for a long time. Strangely, when validating the reservation, the message ~on certain days you have requested we will be closed~ often appears when, according to the calendar, this should not be the case. Other duties include the choice of objectives to satisfy the sponsor, who if satisfied will provide us with some extra money, the search for new sponsors, again without the slightest negotiation, and the purchase of equipment, very important because depending on the model it provides bonuses on certain terrains. However, it is not very clear how the agreement works, in fact, once paid you don't have to spend anymore, therefore, paradoxically, with a single payment you get a lifetime supply, without taking into account any wear and tear of the spare parts (give me the 'address of these manufacturers I'll open a bike shop right away!). Last, but not least, the training of cyclists. Very intuitive, it consists of a simple bar that indicates how much of the work is dedicated to improving characteristics and how much to physical fitness. The state of form is in fact one of the cornerstones of a cyclist and can drastically affect his performance, for this reason there is also the peak form indicator (two for each season) which allow the player to organize training sessions in order to bring the runner in the best possible condition for the most important occasions. The system is not particularly versatile, in fact it is not possible to customize training programs and you have to choose from those already made according to the type of cyclist, but it does not require abstruse calculations to be used effectively (as unfortunately happens a little too often recently), and this can only be a good thing. On board the flagship Once the paperwork is over, it's time to get on the flagship and see how the cyclists we've selected are really doing. This is where the most important part of the game is focused. As important as preparation for the race is, if you don't seize the good moment you have no hope of winning races, not even with the best athletes. Each of our riders is equipped with three colored bars that represent stamina and energy for sprinting and sprinting. If one of these runs out, the cyclist will no longer be able to perform that type of action and will have to wait until he has recovered some. As long as it's the sprint bar, the problem is limited, but when it happens to one of the other two, the cyclist slows down drastically and risks losing contact with the group. To regain stamina(and also the others, when this is full) supplies are used, but these too must be dosed carefully, because their number is limited by the length and type of the stage. A series of simple buttons then allows you to direct the athletes with a few clicks of the mouse. [C] While loading the stages we will be able to check which are the favorites of the day according to the experts The departure of an escape. It is always advisable to place at least one man in each flight, you never know which one might be the lucky one [/C] The progress of a race is quite varied, breakaways often start at the beginning and are resumed only a few kilometers from the end, other times they last less or new ones start at various times, still others the group does not allow any escape and we reach the finish line together. However, there are some blunders that spoil the pleasure of the game. No one ever tries to win the flying milestones (intergiro and mountain grand prix), leaving the player with the option to earn points and prize money with minimal effort. Artificial intelligence demonstrates several shortcomings: for example, it happened that a wingman went to pull the escape in which his captain's direct opponent was. Artificial intelligence demonstrates several shortcomings: for example, it happened that a wingman went to pull the escape in which his captain's direct opponent was. On board the flagship The riders keep in the slipstream of their opponents only as long as there is someone shooting. In case of escape, for example, they scatter, spending more energy due to the wind, and regroup only when the shot ends: a useless waste of precious energy. Sprints are almost impossible, both because the cyclists don't take advantage of the opponents' slipstreams (the button that should order it hasn't worked even once) and because once they reach the finish line the computer-controlled runners acquire incredible speed and become unreachable, then when the sprint starts their speed even exceeds that of ours by 10km/h with the same characteristics. Time trials are a real feat: you have to check the gear ratios (front and rear) and pedaling frequency at the same time; something that is already difficult for a single cyclist, given that there are no points of reference, and truly impossible when you have to manage more than one. However, all this can be explained by the impressive lack of information provided to the player. In the manual it is indicated to press the ~S~ button to start the sprint, everything else (how to go as fast as the others for example) must be discovered by trial and error, intuition or luck. Another example of lack of information is the map of the stages: it is not indicated anywhere that the yellow part indicates the paved stretches, it is discovered only when you are on the field for the first time and you discover that you have made a mistake all the selection. However, the lack of information is not only limited to what is essential to play at its best, but also to the very completeness and precision of CyM4. Taking a look at the calendar, you notice that in almost all the events there are no descriptions of what you will have to face, and in the most important ones (Giro d'Italia, World Cup races...) there are just three, four skimpy lines. But not only that, if you scroll more deeply, you notice a worrying repetition of the stages. Not similar stages, but exactly the same: mileage, altitude profile, flying goals, everything. This happens above all to minor races, but some of the most important ones also undergo this recycling: the striking case is the Milan-San Remo, identical to the Cholet Pays de Loire which takes place only three days later. To the eye one gets the impression that about half of the stages are managed in this way; exactly the opposite of the accuracy and thoroughness expected of a self-respecting manager. [C] A montage that compares the two stages mentioned above: identical in every detail. The description of the stages of the World Cup. Three simple lines for the Milan-San Remo... they could have tried a little better. more... Just slip into a leak and let others do the work. By the time you get to the finish line they are exhausted and winning the race is no big deal. difficult. [/C] Technically speaking CyM4 certainly cannot be called a technical masterpiece. Apart from the fluctuating artificial intelligence, in certain situations the opponents behave incredibly naive, while in others they are unbeatable even at the easiest level, even the graphics sector certainly does not stand out for its quality. Cyclists are all the same, there is not the slightest difference in the body, in the face, in the colhours of the skin: they can be distinguished only on the basis of the mesh. The same goes for the animations, which aren't even that fluid: witnessing a mass fall from 80 runners and seeing them all perform the exact same movements and finish in the exact same position (even if it were synchronized swimming), it's certainly not a pleasure. Worst of all, all the moving elements (cyclists, moto-cameramen, flagships) pass through each other as if the others didn't exist! The graphic shortcomings unfortunately do not end there. In the violent ups and downs of the paved stages, it happens to see the flagships levitate a meter from the ground when the slope changes. The distant landscapes are squared and the textures are simple fill-ins of a single color, with no attempt to make the transition from one to the other less abrupt. The inhabited areas are rendered in a nice way, but they are terribly small: cities of thousands of inhabitants transformed into microscopic villages, with buildings only on the side of the road, and then nothing. All this in the utmost detail. The system requirements are also exaggerated for a game with these features. Although it is understandable that a manager requires a certain amount of RAM and a processor that knows how to get respected, it is not clear why, with such elementary graphics, it jerks and freezes with the old 32Mb video cards (despite the declared requirements ). The error that occurs every time you multitask and try to rejoin (you can accept it from a game born for console and then converted, but CyM4 is ONLY for PC), contributes to the impression that it has been hastily planned. On the other hand, the soundtrack is discreet, also thanks to the non-frantic nature of the game which allows you to enjoy it without compromising performance. There is also the possibility of personalizing it by copying the mp3s you want to listen to during the games in a special directory: a commendable initiative by the programmers, but a manual selection (such as Winamp, to be clear) would have been much more convenient to avoid scattering duplicate files in around the hard disk. [C] A fall on the pav&eacute;. Everyone is in the same position, with the bike at a 45 degree angle. a little of variety; it wouldn't hurt anyone CyM4: Attack of the Clones! Even set to maximum, detail is just at the edge of the road, otherwise it's clear. better spread a pitiful veil... [/C] Final comment If you take a look at the Pros and Cons you will find an item that can leave you perplexed: ~it lets itself be played~. It may seem strange to some, but this is the feeling you get when you try it. Despite the many flaws and problems, we continue to have the desire to try again, to try to figure out how to get around the obstacle and finally be able to have fun. It is precisely for this reason that CyM4 manages to stay on the waterline, because if one had to take into account only what it does and how it does it, the rating would have been drastically lower. Cyanide has promised a new patch to at least fix the poor AI. Hopefully the result is better than the first one which introduced more bugs than it fixed (although fixing the bug that caused most of the runners to disappear from the screen in some runs was a nice relief). Considering the shortcomings of the managerial phase and the fluctuating artificial intelligence depending on the situation, Cycling Manager is not a recommended game for the single player. Although, as already said, he ~lets himself play~, after a while the continuous problems and the almost impossibility of succeeding in some situations can lead to exasperation, and even with the best of wills one risks ending up closing him in a drawer. Where it manages to give its best is in multiplayer. If all the players have the same problems, everyone is at the same level, and therefore it is as if they don't have them at all. The annoyance of the teams still controlled by the computer remains, but if the players distribute the strongest teams among themselves, leaving only the minor ones to the computer, or if they are enough to exclude it altogether (i.e. 20, the maximum number of teams that can participate in one run), the problem is solved. So, for those who love cycling and management games, the best advice is to play the singleplayer career as a workout to learn the game mechanics well and how to squeeze the racers to the max, then dive into the ladder (the multiplayer mode that puts all teams on the same level of characteristics) and face real opponents. One last but very important thing. Whatever the newspapers, experts and those directly concerned say about it, there is one thing in which CyM4 is a thousand", "date": "2004-08-12", "grade": null}