{"name": "Hot Dogs Hot Gals - Recensione", "ref": "https://multiplayer.it/recensioni/hot-dogs-hot-gals-recensione.html", "text": "the Australian programmers of Fuzzeyes Studios have thought of the ~erotic~ element to find a place in the sun among the many management titles released over the years Pull more... Hot Dogs Hot Gals in fact remains on the typical coordinates of its genre of reference. As has already happened in the various Pizza Syndicate, Restaurant Tycoon and the like, our task will be to manage a fast food chain and become the new McDonald's. The title distributed in our country by Leader allows us to initially configure our playful experience in a very varied way: in addition to the general difficulty, we will be able to choose whether to start our business from scratch, or to inherit an already established place. Also in this last case we have another further ramification given that we can choose to take a place already at the peak of success or a place in the throes of a major crisis. Hot Dogs Hot Gals also gives us the opportunity to deal with our experience in a single city (we will be able to choose between Seattle, New York and Los Angeles) or simultaneously manage the activities in all three US cities, which undoubtedly further complicates the good progress of our business. The cheeseburgers are out... Once all the initial setup choices have been made, HDHG proves to be a rather basic management system, without an excessive number of parameters to take into consideration. It will be sufficient to manage wholesale spending in the best possible way, make the right investments in order to obtain a higher number of products to sell and the place will not present any particular problems whatsoever. personnel management is slightly more sophisticated and it is here that the ~erotic~ element materializes The cheeseburgers are out... Personnel management is slightly more sophisticated and it is here that the ~erotic~ element materializes. In fact, you should know that in our fast food restaurants there won't be the typical grumpy salesmen given the not exactly exciting pay, but we will hire a veritable army of international beauties that we will be able to dress (or undress...) as we please. The choice and management of personnel will be essential to ~satisfy~ (don't think of puns, please!) our customers who, faced with a winking smile and a few curves in plain sight, will probably buy an extra drink and leave the shop with a big smile on his face. To satisfy customers, it will be important to satisfy our girls in turn and therefore pay attention to rest shifts, to put the right person in the right place. There will also be some ~computer~ problems such as viruses that will infest our terminals: on this occasion a mini game will start which initially proves to be pleasant but already from the fourth or fifth time we have to face it, the feeling of boredom will start to take the upper hand. to satisfy customers it will be important to satisfy our girls in turn and therefore watch out for rest shifts Deja Vu Undoubtedly Hot Dogs Hot Gals takes elements from the masterpieces of its genre with full hands: here, for example, the city map looks like that of Sim City, while the game interface and the possibility of monitoring the reactions of customers to the local and the staff do nothing to hide the similarity to The Sims. However, HDHG suffers from a feeling of a certain ~narrowness~ (also in terms of technical realization and the quality of the accompanying songs) of interactivity which in the long run easily causes one to give up on continuing the main campaign. System requirements Minimum Requirements: Processor: Pentium 1 GHz RAM: 256 MB Video Card: 3D 64 MB DirectX 9.0c compatible Disk Space: 1 GB Drive: DVD-ROM DirectX 9.0c compatible sound card Test Configuration: Processor: AMD Athlon64 3500 RAM: 2 GB Video Card: Geforce 6800 Ultra 256MB Comment Hot Dogs Hot Gals is a product which, beyond the ~sexy~ element, has nothing really new in terms of substance compared to other management products that have seen us at the helm of restaurant, pizzeria or fast food chains. The wink he proposes with the 12 sensual girls to dress (or undress) as we please within the shops does not change the substance much but is in any case an attempt to make a product more sparkling which, beyond a certain limitation in the things to do, it does not even present macroscopic defects. Given the budget price, it deserves a complete sufficiency. Pros Sexy supermodels make the title more sizzling Very customizable game experience Budget price Cons Limited in interaction In the long run it doesn't offer any particular incentive to continue Nothing new at the momentwithin its reference genre Pull more... Beyond the well-known saying (and its variants), actually in the video game industry, the use of ~sexy~ elements has never guaranteed who knows what sales explosions and when it happened, the digital curves of a title were supported from an excellent quality product (among the many we could mention Tomb Raider for example...). Despite this incipit, the Australian programmers of Fuzzeyes Studios have thought of the ~erotic~ element to find a place in the sun among the many management titles released over the years.", "date": "2007-05-08", "grade": null}