{"name": "M.A.C.H.", "ref": "https://multiplayer.it/recensioni/mach.html", "text": "Developed by Kaolink for Vivendi Universal Mobile, M.A.C.H. is the mobile re-edition of the homonymous title released for the Sony handheld a few weeks ago and objectively passed quite unnoticed. Although the product did not excel in playful qualities, the good thing was that it combined dogfight action with real competitions, all framed by a more than discreet cosmetics. Let's say right away that this M.A.C.H. for mobile does not hold the comparison with the original, especially as regards the technical part: characterized by two-dimensional graphics with a rather dated look, the Kaolink title not only does not surprise the observer, but rather showcases a sobbing scrolling, which penalizes the sensation of speed and above all the good use of the product. M.A.C.H. it is also rather meager with regard to the design of the menus, the HUD and the bonuses that can be collected during the flight (in fact simple colored geometric figures). In short, the Vivendi Universal product certainly doesn't make the glance its strong point, and the sound doesn't even help it, being almost completely non-existent. To partially save the day for the skin and bring back M.A.C.H. a non-exciting gameplay intervenes on the tracks, but complete and orderly enough to allow the Kaolink work to reach sufficiency. Contrary to the PSP version, on mobile it is only possible to carry out races or races against the clock, without the pure and simple dogfight section. Which, observing how combat has been implemented in the game, is all in all a good thing: the weapons available are few and above all they work badly, due to an approximate pointing system to say the least and the fact that opponents appear and disappear from the screen with a convulsive and unpredictable rhythm. At least the strictly racing part of M.A.C.H. it is decent: during the various competitions it is possible to exploit boosts or bonuses of other kinds to your advantage to get the better of your opponents, and the control system responds promptly to the user's requests. It must be said that the game generally lacks a bit of rhythm and is also rather easy, thinning out the life of the product, already marked by a fairly modest longevity. PRO Good control system Different jets and scenarios AGAINST Technically below standard Unbalanced gameplay", "date": "2007-05-03", "grade": "S.V."}