{"name": "Where The Heart Leads", "ref": "https://multiplayer.it/recensioni/where-the-heart-leads-recensione.html", "text": "We've seen a lot of adventure games strongly focused on storytelling. Especially in the last few years, there has been an explosion of the genre, taken by storm from independent development studios to try to establish themselves on the market. This trend doesn't come so much from a pure and simple economic issue, but rather from the multiplicity of stories to tell, often inspired by the same lives of those who created that game. Sometimes, it's easier (and safer) to make an interesting narrative than to have groundbreaking insights into game design. However, what makes a good story is not only what you want to tell, but also how you want to tell it, especially if the chosen medium is a highly visual medium. Consequently, among the many video game proposals of the last twenty years, only a handful have managed to leave a mark capable of redefining and altering the trend. Today we find ourselves mainly (not totally, mind you) on two paths: on the one hand we have the investigative adventure, with strong noir hues, set in large cities invaded by crime and jazz melodies; on the other hand, however, we find collections of memories of individuals immersed in rural, colorful and relaxing environments, often tending towards the glorification of the artistic individuality of its protagonists, rebels in a land of conservatives. Where The Heart Leads, the first ~solo~ project for Armature Studio (which, in the past, has mainly worked on porting of even quite relevant games, in addition to the co-development of the exclusive Microsoft ReCore), is stationed in the latter group , the most ~exploited~, but also the one that produced the most appreciated results. Let's see together, therefore, if the development team has managed to contribute to the evolution of the genre or if, on the contrary, it has only exploited its characteristics in this review of Where The Heart Leads. A story that lasts a lifetime Where The Heart Leads: the story of a family at the turn of the new millennium Usually, projects of this type are not extremely long and complex. Most of the time they tell portions of life full of emotion, mostly common, useful to push the player to identify with the events narrated. Armature Studio's ambitions are evidently much broader, given that the narrative they have chosen to tell spans a lifetime. Of course, this does not mean that you will find yourself witnessing every moment of an individual's existence, but in any case some pivotal points that, if you want to explore in depth, will take you more than a few hours of gameplay. Without going too far, the game follows the story of Whit Anderson, a family man who, while trying to save his dog during a strange storm, falls into a chasm created in the ground. From here, he will have to try to return to his family, but, along the way, he will once again come face to face with the past and the life he has lived. The narration therefore pushes us to build the story of this man and his family, of which, at the beginning of the game, we know practically nothing. Each choice leads to more or less relevant consequences that will affect not only the life of that single family unit, but also of the town in the Midwest of the United States in which the events are set, Carthage. Where The Heart Leads: the main street of Carthage, equally protagonist of the narrative The two fundamental characteristics, the ones on which the entire story is based, are precisely the incessant flow of time and the importance of choices. Everything is held together by the most varied clichs. We find a strict father, a mother with a dream never realized because of the family, a brother who many consider a wreck of society, passionate about art and eager to leave his mark on history, a tycoon who would do anything to to protect his city (and its interests), children who follow in the creative footsteps of their parents and even a bizarre and bewildered individual who will find himself playing an important role in the events. In short, there is a bit of everything we have come to know in the last century of fiction, after the various social crises and the mass evolution of lifestyle in the suburbs and in the countryside (it is no coincidence that the game is set in the decades at the turn of the new millennium). Despite this unconditional exploitation of stereotypical characteristics, Where The Heart Leads still manages to tell an interesting story, which has its charm and manages to excite. The problem lies, as we mentioned earlier, in the way this story is staged. This is, in fact, where the main problem of the game liesor. The importance of a defined style Where The Heart Leads: visually the game starts well, but gets lost more and more towards the end Like most titles of this genre, visually the game presents itself with highly stylized graphics, with the almost total absence of detail in what surrounds the protagonist. We have seen this method used in the past, with results that are sometimes even more satisfying than mere photorealism. In the case of Where The Heart Leads, however, it is hard to find an identifying stylistic line capable of leading to immediate recognition of the product in front of us. It seems more like an unbridled flow of trends and suggestions, lacking any real unity, which helps to tone down the salient points of the narrative. To aggravate the situation there is also the lighting, positioned in such a way as to never enhance the scene. Where The Heart Leads: The lighting system fails to enhance the scene It should also be emphasized that the game is really sparse in terms of animations, which makes the whole experience extremely static, which you don't want to achieve if the goal is to create a title that can easily exceed ten hours of play. provided that the environments are explored well and the various documents, called ~memoirs~, are read. Furthermore, the complete depersonalization of the interlocutors, created as if they were ~hollow~ three-dimensional figures, as well as making each interaction very bland and aseptic (also due to the absence of animations), often leads to getting confused or wasting a lot of time searching of the characters, who manage to blend in with the surrounding landscape. The final result is a visual sector which, rather than helping the narration, undermines it with discordant, sketchy elements, which would like to represent a precise style, never fully achieved. Little cleaning Where The Heart Leads: the game focuses heavily on the dream element The most sore point of all is undoubtedly the game room. If for the previous elements we can talk about tastes, when we talk about the management of the view one cannot fail to be objective. The game features a fixed camera on the character that can move a few degrees in any direction, without ever being able to make a full turn (it freezes on a hypothetical 180 line that cannot be crossed by the view). So far, no problem, except that when the direction of the game comes into action and limits the vision to a certain segment of the scene, it often penetrates various game objects, preventing a correct reading of what is happening. In this case, it is the player who must act, repositioning the game room in such a way as to be able to see what is happening. Which leads us to wonder why propose a directorial intervention if it is then the player himself who has to reposition the game chamber. Where The Heart Leads: this is not one of the worst cases, but the direction of some scenes has several critical points These are trifles which, however, make themselves felt during the game, tearing the player away from the narrative and making him focus attention on something that should convey the events, not vice versa. These elements are the sign of a lack of attention to detail and a lack of cleanliness, which is increasingly noticeable as the story progresses. We have also noticed the same critical issues in optimization. In fact, performance drops are not uncommon, as well as a general heaviness that leads to excessive exploitation of the PlayStation hardware (the Pro version, in our case), absolutely not justified by what is shown on the screen. Where The Heart Leads: In more ~hectic~ situations, frame stability isn't the best Not only does the game room not help, but also the management of the texts to be read sometimes misfires. The game is all about written text. Indeed, there is no dubbing, not even noises or cries to be associated with a particular character. What you get are myriads of comic lines of dialogue that can either be forwarded manually, or through the automatic process system, all accompanied by a soundtrack that often loops on the same theme for several hours. Where The Heart Leads: The game is fully in English We would like to tell you that the game is absolutely not localized in Italian. There are only one or two phrases in our local language, pronounced (so to speak) by characters coming, precisely, from Italy. The rest is all up to your knowledge of English and your ability to deduce, especially when it comes to the slang of the American rural Midwest. If the pspeak or read it, however it may be, it shouldn't be a problem at all; it's all quite intuitive (thanks also to the stereotypes already mentioned). In any case, very often the clouds containing the texts are too small (since they are connected to the characters present on the map) and therefore they will force you to strain your eyes a lot, which could get tiring after an hour of play.How it often happens, a great effort seems to have been put into the first few hours of the game in order to provide an interesting experience, only to then get lost at the end, where a lack of cleanliness and a certain haste in completing the narrative is evident , despite the exasperated longevity of the title. A repetitive gameplay Where The Heart Leads: the effort to diversify the actions that the player is led to carry out has been lacking Another sore point is the extreme repetitiveness of the game. The intention of Where The Heart Leads is certainly not to offer revolutionary gameplay. He simply wants to tell a story. However, when you rely on the videogame medium, you must justify the interaction you have with the title. This does not mean proposing complex gameplay. Even a key is enough, but it must be implemented in such a way as not to bore the player. In this case, we are faced with the continuous recurrence of similar and never diversified events, such as the nagging ~automatic~ construction of objects and sculptures or the visual interaction with our surroundings. It lacks that extra push that leads to not making them mechanical actions, but to making them part of a whole narrative that excites and stimulates the player to continue the adventure. As if this weren't enough, there is also the duration malus, which prolongs these interactions out of proportion, until they become absolutely accessory.", "date": "2021-07-23", "grade": "6.5"}