{"name": "Bubble Bobble Double Shot", "ref": "https://multiplayer.it/recensioni/bubble-bobble-double-shot.html", "text": "the adventure of Bob and Bub For the few who still aren't aware of it, Bubble Bobble is a platform without scrolling with a few very simple rules, as every good arcade requires: you have to eliminate all the enemies present in the shortest possible time. This is what is strictly necessary to make us advance from level to level, until we reach the hundredth and last scheme. The secondary objective, however, is to collect as many points as possible, gaining bonuses in the form of fruit and items that the killed enemies will drop once hit. Bubble Bobble is a fixed scrolling platformer with a few very simple rules, as every good arcade requires the adventure of Bob and Bub The protagonists of Bubble Bobble are cute and colorful little dragons who have the ability to create and shoot resistant bubbles that can trap their opponents: once blocked, by jumping on them, they will be eliminated from the scheme, leaving room for a bonus. To get more points, just pop several bubbles simultaneously, creating a sort of combo. The story that serves as the pretext for the game begins when Bob and Bub decide to visit their cousin Bubu. In their grandfather's room, the two find a mysterious treasure map and decide together to go in search of it, through hills, mountains and winding paths. The Bubble Bobble schemes are therefore divided into different areas represented by this map, and the backgrounds are nothing more than the place that our nice friends are going through to get to the fateful and elusive treasure. the features of the Nintendo DS Double Shot is not a simple stylistic remake of the original but brings new gameplay and game structure. First of all, it takes advantage of one of the main features of the Nintendo DS, the double screen: each scheme is drawn and developed vertically, forcing us to jump even on the upper screen in order to kill all enemies and thus complete the levels. Unfortunately there is no interesting use for the microphone and the touch screen, excluding some mini-games that have the function of making us continue once the available lives have been used up. Double Shot is not a simple stylistic remake of the original but brings new gameplay and game structure the features of the Nintendo DS These little interludes are very simple tests to overcome and don't offer much fun and variety, they only represent nice ~continues~ that allow us to continue. The fact that you have to jump from one screen to another, albeit giving a little freshness to the game, however, make it more difficult and less ~precise~ than it should be. The closing hinge of the Nintendo DS is large enough not to allow us an intuitive assessment of where our little dragon will jump, and more often than not constitutes an impediment rather than entertainment. Double Shot innovations Another innovation of this new chapter of Bubble Bobble is the use of three differently colored dragons: blue, red and green, always selectable by pressing the rear triggers. There are three protagonists for a very specific reason, each of them is in fact capable of annihilating enemies of the same color. The mechanism brings to mind old past glories of Treasure such as Radiant Silvergun, Shiluette Mirage and Ikaruga, where the use of colors brushed the gameplay with freshness, frenzy and novelty in their genres. This solution is therefore neither brilliant nor new, but slightly rejuvenates the stale but evergreen way of playing Bubble Bobble. Some enemies are neutral and can be trapped by any dragon's bubbles, some have one of the three main colors while others are painted differently, such as light blue. In the latter case, to be able to destroy them we have to throw two bubbles at them, one blue and one green, so that by mixing you get that precise gradation. Single player and multiplayer The adventure can be tackled alone or in the company of a friend, via the Wifi connection of the Nintendo DS. This greatly extends Double Shot's longevity and enjoyment, provided we find someone willing to play with us. Just like in the caf it is not possible to save in a certain level and then pick up where we left off: if the console is turned off, the next time it starts from the beginning. From a graphic / sound point of view, an exceptional job has not been done. The adventure can be tackled alone or in the company of a friend, via the Wifi connection of the Nintendo DS Single player and multiplayer The level design itself, if we exclude the very first levels taken from the original Bubble Bobble, is quite monotonous and repetitive, ifnza interesting ideas or strokes of genius worthy of note. The sprites of the characters have decidedly simple animations and moreover they are very small, while the backdrops are quite fluctuating, passing from nice and pleasant patterns and others messed up, uninspired or excessively colored, a factor that also makes it difficult to distinguish the enemies. The music is remixed from the original Bubble Bobble and as usual they are catchy and immediately recognizable, as are the effects. Final comment Bubble Bobble Double Shot is a faded remake of the masterpiece that animated arcades twenty years ago. The new features included are not really fresh and innovative, and Taito hasn't even made an effort to make the most of the potential of a machine like the Nintendo DS. The gameplay is simple and intuitive, however undermined by a careless level design; after all this time, the need is felt for a title like this that breaks with the past and introduces something truly never seen before. Even the technical realization is rather perplexing, graphics and sound definitely deserved something more. Pros Still the classic Bubble Bobble Cooperative multiplayer Three different dragons to use Cons Flat and monotonous level design Artistically leaves something to be desired DS features are poorly exploited Anyone who is well over twenty and has always had the habit of playing tokens in the arcade certainly won't struggle to remember certain milestones of bar fun. Once upon a time there were those lonely and abandoned cabin cruisers, dirty with ashes, cigarettes and with fogged and dark glass. But there were also others always full of people, people watching, kids, adults, queues and waiting to finally be able to participate: they were the great masterpieces of the time, there were those who launched energy balls, those who jumped on some mushroom , who shot wildly at anything that moved, and still others who armed with a crowbar cleaned up the streets of a criminal New York Cyberpunk, in a riot of immediate, satisfying and financially expensive playability from the money-eating arcade. Among the great software houses of the time, among protagonists such as Sega, Konami and Capcom, there was also Taito with a jewel that went down in history for its genius, frenzy and sympathy; let's talk about the wonderful Bubble Bobble and its myth that after twenty years still lives in a very bright light of fame and popularity. After the misstep committed with the medium Bubble Bobble Revolution, Taito has decided to try again, proposing a refreshed remake of his old classic: ~Double Shot~ has just arrived on the Nintendo DS!", "date": "2007-04-30", "grade": null}