{"name": "Resident Evil: Confidential Report File 1", "ref": "https://multiplayer.it/recensioni/resident-evil-confidential-report-file-1.html", "text": "The first in a series of mobile episodes intended to tell the misadventures of some characters between zombies and the like, Confidential Report File 1 has two protagonists related to as many stories: it is the recruit Tyler Hamilton and the investigator Naomi McClain, committed to revealing - for two different perspectives- the mystery of an explosion in a laboratory that led to the appearance of the notorious living dead. Well, it could be said that the charm of Capcom production ends here, seen and considered how Confidential Report File 1 has the only attractions being called Resident Evil and talking about zombies. Unfortunately, the game is a prime example of short-sighted game design, an occurrence that has too often occurred in Capcom mobile titles. To begin with, Confidential Report File 1 makes use of an aberrant control system to say the least: the user, observing the action through an isometric view, is forced to act on keys 4 and 6 to rotate the character by 90 , and to press 2 or 8 to move it forward or back. A system taken verbatim from the first episodes of Resident Evil for PSX (and therefore already obsolete) which on the keypad of a mobile phone is obviously extremely uncomfortable and cumbersome. The sleepy rhythm of the playful action certainly doesn't help, with spaces that are often too large and empty to be traversed with difficulty due to the absurd slowness of the protagonist's movements. The horror feeling and the psychological tension exerted by the console chapters are totally absent here, replaced by an absolutely inappropriate RPG-like gameplay. In Confidential Report File 1 one does nothing but walk, collect objects and read files, occasionally indulging in some gruesome combat: in these phases, the characters on the screen move almost in turn (one step the user, one step the zombies) and the attacks must be carried out as in a tactical RPG, selecting one's target from a grid that indicates the range of the weapon. Too bad that, unlike the aforementioned genre, Confidential Report File 1 totally lacks strategy or even just bite: the clashes are thus resolved in depressing repeated pressures of the action button, until the opponent disappears from the screen. It goes without saying that such gameplay is not suitable either to satisfy the gaming needs of enthusiasts or to fill the dead times of the day, given the extreme slowness of the succession of events on the screen. Confidential Report File 1 is therefore a strongly wrong title, also equipped with graphics that are all in all accurate but incredibly static and drowned by very questionable color palettes. The sound is instead in line with the rest of the Capcom production: boring and irritating, even if we must give him credit for the dynamic music. PRO Fairly neat graphics AGAINST Bad control system Excessively slow and boring gameplay Poor longevity", "date": "2007-04-26", "grade": "S.V."}