{"name": "Penumbra Overture Episodio 1 - Recensione", "ref": "https://multiplayer.it/recensioni/penumbra-overture-episodio-1-recensione.html", "text": "Paranoid The developers have adopted a decidedly particular commercial strategy: the first Penumbra came out a few years ago in a freeware version (therefore freely downloadable by anyone), thus allowing to probe market interest and gather numerous feedbacks from users, who are were the main creatives of the development of the entire title. The plot, although nothing transcendental, sees you play the role of an anonymous Philip, who receives a disturbing letter from his father on the day of his mother's funeral: it is known that postal services have never been efficient, but the disturbing aspect is that his poor father died many years earlier, obviously under mysterious circumstances. There are no more once upon a time worms... Without going too far, our fearful alter ego will embark for Greenland in search of further information on his parent, but end up getting lost during a snowstorm and finding salvation (if we can define it that way) in an unknown abandoned mining complex. One of the first rules they teach us as children is ~never enter the abandoned mines in Greenland~, but the only alternative was death by exposure to exposure: having made our disastrous entrance into the structure, we immediately understand that something is not right and those deep furrows nail traces on the wall give no hope for the best. You will then lead our Philip inside this gigantic complex, discovering it as much more than a simple mine, slowly unraveling a skein as intricate as it is disturbing, not in an attempt to save the world, but simply trying to take his life home. Will you succeed in the enterprise? Of course not. They will be able to feed on my body... If the plot may seem like the classic heated soup, you will have to change your mind: its peculiarity lies in the fact that it will be you, reading not only diaries or notes, but even interpreting signs on the walls, sketches on blackboards and so on, to discover the increasingly terrible truth that the abandoned mine hides: many narrative elements are not essential to continue, as it is not to read the large amount of texts present, but this will help you to have a more complete idea of the general picture, allowing you to get to know the environment in which you move, your predators and some strategies to defeat them or, more likely, evade them: sometimes, the moments of greatest tension will only be a figment of your imagination (we just tell you that the final part is literally heart-pounding). one of the first rules they teach us as children is ~never enter the abandoned mines in Greenland~, but the only alternative was death by exposure... They will be able to feed on my body... It may happen that, for example, in a diary crammed full of ravings of a mad scientist, you will be able to glimpse the code to open a door, or learn about a weak point of one of your enemies or other elements that will make you life easier afterwards. In Penumbra Overture the concept of survival horror is raised to the nth degree, where only with your skills and intuition will you be able to avoid a sad end, not relying on any classic offensive tool, such as firearms: and this is what distinguishes the title of Frictional Games from the various Resident Evil and the like produced for several years now. But they won't have my life! It is natural to wonder how you can face enemies without resorting to firearms: as the good Mac Gyver teaches, you will have to take advantage of all the elements made available by the developers to succeed in the arduous task of surviving. The strength of Penumbra lies precisely in its wide freedom of action; thanks to an accurate physics simulation you will be able to create deadly combinations with a few makeshift objects: a stone, if dropped from a scaffolding, can get rid of some uncomfortable enemies, while a heavy metal box, if moved behind a a door, it will make you lose any pursuer. You will be offered multiple possible solutions, without ever favoring one in particular: you will be able to replay this short episode over and over again (6-7 hours if you really are really clumsy) always experimenting with new strategies, without ever running into some absurd or incomprehensible reaction. A mutant dog stands in your way? You can lure him into a container with a piece of meat and then block the entrance with a barrel; or why not in the middle of pressurized containers and blow it up with a flare? Or why not stun him with a rock? We are notstill faced with a sort of free roaming where everything that comes to your mind is feasible, but without a doubt one of the main limits will be your imagination and your ability to observe the suggestions proposed by the developers: this is why Penumbra goes, at least, replayed a second time. Gordon Docet If the gameplay is the best element of the entire title, unfortunately from a purely aesthetic point of view we note the low budget available to the developers: the graphics, although adequate to render the claustrophobic environment of an abandoned mine, are not able to present you with refinements of sorts, such as recent shaders (but only 1.1 and 2.0) and decidedly subdued special effects: the textures that cover the surfaces are rather dull, but without ever degenerating into shameful evident recycling. The models, being a title that will develop over three different episodes, can be counted on the fingers of one hand, as well as being made with as many numbers of polygons: if you add to this some rather woody animations, you can clearly understand that the guys from Frictional Games couldn't count on majestic (and expensive!) licenses like Unreal Engine 3, but they had to settle for something home-made. Vision will blur. when your health care there will be mental & agrave; leaving However, the engine overall remains rather heavy, and in some situations we found ourselves playing below 15 frames per second, generally during one of the frequent disk swap accesses: however, we refer you to the hardware box for further information. We can honestly tell you that we had to make an effort to notice these graphical flaws, because you will be so involved in the plot and you will be captivated by the environment that your imagination will render the entire game for you: on the other hand, evaluating a game, especially one like Penumbra Overture, exclusively from an aesthetic point of view, it would be not only superficial, but even unfair to the excellent work done by the programmers; we are sure that, thanks to the numerous feedback obtained on the official forum, a complete facelift will also be offered in the second episode. Comment It's time to sum up: is Penumbra Overture worth the 29.90 required for the boxed version and 15 for the digital download version? The answer can only be positive: the Frictional Games title is one of the best of the last period and demonstrates how you don't necessarily have to have a large publisher behind you to churn out an absolutely classy product. Want another great reason to buy this title? If you are stuck in one point or if the game should (but it would be a rare event) present a bug, you can post it on the official forum and the developers themselves, always very kind and cordial, will answer you within a few hours. We believe that the second chapter (and future ones) will be largely influenced by your advice, and the idea of a video game created by a large family, including you too, is something utopianally exciting. And then, let's face it, how many unanswered emails have you sent to the Customer Service of the distribution giants? Too many. Pros Exhilarating gameplay Total immersion Some heart-pounding moments You'll become a little Mac Gyver Cons If you're impressionable, avoid it Adequate but outdated graphics Some recycled puzzles Turn around damn it! Another gem of Penumbra Overture is represented by the control system: in addition to moving Philip as happens in a normal FPS (using the WASD combination, but freely configurable), to perform any action you will have to mimic it with the movement of the mouse. To open a drawer, for example, you'll have to click to grab the handle and move the mouse back; to hit something, you'll have to move it violently from one side to the other: a system that became famous with the Wii, but thought up by Frictional years earlier, which manages to make you experience unprecedented adrenaline-pumping moments (try turning a valve while a 15 meters tries to break down your barred door). System requirements Minimum Requirements: Processor: Pentium 4 1.5 GHz or AMD 2000+ RAM: 512 MB Video Card: AMD 8500 or Nvidia GeForce3 Ti Disk Space: 1.0 GB Recommended Requirements: Processor: Pentium 4 3 GHz or AMD 3000+ RAM: 1024 MB Card Video: AMD 1X00 series or Nvidia 6X00 series Disk Space: 1.0 GB Test Configuration Processor: Intel Core Duo E6700 @ 2.7 Ghz RAM: 2 GB Video Card: NVIDIA 8800 GTX Operating System: Windows Vista Ultimate The game runs very smooth even at very high resolutions (1650x1050): unfortunately having limited the frames per second to 60 does not guarantee a good safety marginbrittle in some situations, especially when the game reads new data from swap; in these cases the fluidity collapses drastically below the 15 FPS threshold, although it is a matter of a few seconds that hardly undermine the playability. Note that, at least under Vista, the GPU driver is rarely turned off for some strange reason, forcing you to close the program and reactivate it, restarting the computer. The Shadow is within you Penumbra Overture represents a real checkmate to all the gigantic publishers and their millionaire investments: it is not only a beautiful game that is both engaging and disturbing at the same time, but the demonstration that a development team of only 9 elements can churn out a better product than many other recent titles which, while boasting prestigious brands and cutting-edge technologies, have proved to be absolutely poor. The secret of Frictional Games? Innovation combined with modesty.", "date": "2007-04-26", "grade": null}