{"name": "Bomberman Land Touch! - Recensione", "ref": "https://multiplayer.it/recensioni/bomberman-land-touch-recensione.html", "text": "The nib of the sword hurts more Taking back a historic brand and transporting it to a console whose innovations go beyond its pillars is never an easy task, with developers who remain in the limbo of indecision until the last second and then find a product in their hands that is not neither meat nor fish. Hudson in the development of Bomberman Land Touch decided that neither of the two factions (game turned to the use of the stylus or more similar to the origins) would have dominated the other, focusing on including within the game a solid single player mode that was the daughter of the touch screen and supporting it with the classic mode of clashes within the mazes. The result is probably one of the most complete and long-lasting bomberman games ever. The campaign mode (or story, if you prefer) as previously announced represents the innovative bomber bank, the one that takes full advantage of the use of the stylus without leaving room for the other buttons; the pretext behind the construction of this modality is a trip to the largest pirate-themed amusement park in the world of bombs: a vast island divided into five zones (spades, clubs, hearts, diamonds and final castle) in which Bianco Allegro (this the name of the bomberman dressed in white) and his friends will be able to run around in search of increasingly difficult challenges. The island is none other than a large container of mini-games -always linked to the ~bombs~ theme- which will allow the player to win cards, tokens and special items useful for unlocking further otherwise inaccessible areas. Proceeding in order, the challenges that will be encountered along the game, along the lines of games such as wario ware and project rub, will test the player with short mini-games often and willingly based on skill, timing and reactivity: you will be able to run 100 flat meters rubbing the tip of the stylus repeatedly from right to left to pick up speed, you will control a large bomb factory where the player's task will be to direct the bombs of a certain color inside the relative -coloured- machine, you will take part to musical and balancing challenges, up to a similar memory and bowling always with a ~bomb~ theme. The mini-games will be available at particular ~houses~ and thanks to the challenges proposed by their adventure companions, who will communicate to the player their exact location within the park via an internal mail system in the game, in such a way as to reach them as quickly as possible. shortest possible time for the challenge. The nib of the sword hurts more Despite being a fairly large amusement park, the game itself is absolutely linear, leaving the player no chance to manage the progress of the adventure: due to the fact that many gates will require a certain number of cards to be opened and that many attractions will only open after a few hours of play, the player will absolutely have to complete all the tests and challenges proposed if he does not want to find himself ~stuck~ in the middle of the story. In addition to the cards, an important element for the purposes of advancement will be played by the collectible items: these particular objects will be part of the bomberman's equipment and will allow him - thanks to their special powers - to perform particular actions, avoid some traps or simply reach points otherwise unattainable; the elements of equipment are divided into head, chest and weapon, the combination of which will remain at the absolute discretion of the player, based on his mere needs (in some dark sections it will be of absolute importance to wear a miner's helmet and perhaps also have the bombs equipped lights to better see your surroundings). The objects, while modifying the bomberman's appearance, will not modify the gaming experience by limiting themselves to the task of simple ~status~, working -for example- in the same way as an armor that does not allow poisoning in an RPG. Finally, the tokens will be the viaticum to unlock extra modes with respect to the story mode, and they can be conquered both by looking for some particular treasure chests and by beating the records of each minigame faced. Furthermore, by playing and completing the mini-game within the story mode, it will also automatically unlock in the ~attractions~ mode, where you can replay both solo and in multiplayer mode for up to 4 players. History bombs Parallel to the story mode, there is also the option called ~hyper-battle~ which is none other than the classic bomberman: enhanced to meet the capabilities of the DS and built as a real game in its own right, with its own modes and custom options. iper-battaglia, as mentioned above, is in fact the original bomberman, the one in which the player's only purpose in a kind of labyrinth with destructible walls will be to survive at least one second more than his opponents. In this mode it will be essential to collect special power-ups capable of enhancing the range of the bombs, kicking them, speeding up the character and above all being able to place several bombs simultaneously in order to besiege the opponents. Also playable alone (against a number of opponents controlled by the CPU that can go from 2 to 8), thanks to the double screen of the DS it is in the multiplayer version that this bomberman mode demonstrates all its playful value: local multiplayer up to 8 players with a cartridge (4 positioned at the start on the upper screen and four on the lower one, in free-for-all and team mode) and above all an excellent online multiplayer that will allow up to 4 players to challenge each other to the sound of bombs. The proposed levels are also part of the history of this brand, all however doubled in size to make the presence of the double screen bear fruit. Double screen, double mode and double fun. This seems to be the message that the game wants to get across, a message that is certainly valid for the most part. Hudson seems to have found a formula that is valid enough for bomb adventures that go beyond the classic labyrinths, even if there is still a lot of work to do on the mini-game side: many of these are still decidedly immature, simple and not very suitable for what the nintendo ds can do (and has already done and demonstrated); on the other hand, the longevity of the product remains excellent which, despite being linear, almost never gets to tire or frustrate the player. On the other hand, the part relating to hyper-battles is excellent, here the programmers have been able to put in just enough to make the classic bomberman memorable: a mode for up to 8 players and online support. You really can't ask for more. Pros: Presence of two solid game modes Definitely long-lived Excellent multiplayer and online modes Cons: Minigames not very incisive and not always fun The story mode is too linear Too bad you can't play 8 online When we talk about Bomberman we can say with absolute certainty that the saga in question has been an integral part of the history of video games for more than twenty years. Lately, it must be said, it seems that Hudson's bombers have lost some of that killer application polish among party games, the bombs have rusted and the attention of the developers has shifted from the classic mazes towards something more unnatural, more action and decidedly less appreciated. Sometimes the experiment can fail miserably as in the game released for the cube now more than five years ago (Bomberman Generation) which merged typical mechanics of the series with action-platform elements, but above all in the very recent Bomberman Act Zero for xbox 360 which, as the name suggests, it has zeroed in one fell swoop all the good things demonstrated by the bombers in these years of activity. However, Bomberman has always been a strange series, so every few games decidedly subdued it also happened that the real pearl of gameplay came out. Will Hudson have succeeded with Bomberman Land Touch in creating the real bomber killer application for DS? The arduous sentence on the double screen.", "date": "2007-04-19", "grade": null}