{"name": "Tekken 5 Dark Resurrection - Recensione PlayStation Network", "ref": "https://multiplayer.it/recensioni/tekken-5-dark-resurrection-recensione-playstation-network.html", "text": "Namco's barrels A lot of water has passed under the bridge since that very first and immature Tekken, one of the most important turning points for a genre - that of fighting games - which struggled to find the right path to follow in the transition from 2d to the polygon. Dark Resurrection is not a new chapter, but a revision of the fifth episode, first released in arcades and then converted a few months ago on PSP with brilliant results. Compared to this last edition, on Ps3 Namco production has both lost and gained something; as for the first category, most of the additional modes and mini-games such as bowling and Tekken Force have been excluded. Certainly not due to the lack of will of the programmers, but rather to keep the size of the file to be downloaded within the psychological threshold of one Gigabyte. On the other hand, obviously together with the arcade mode, the ghost mode has also been included, i.e. a mode which, through the use of different artificial intelligence algorithms, attempts to simulate - in a fairly credible way - the typical situation of a real game room where you are challenged by a variety of people with different qualities, skills and styles. All the characters and their moves are instead present, together with the exclusive possibility of unlocking and using the final boss, Jinpachi, which however constitutes anything but an electrifying addition. By winning the matches, credits are then provided, to be spent on the purchase of clothes and accessories to customize the protagonists according to one's preferences, or to unlock a whole series of extras of various kinds. Sorry for the absence of an online game mode, but perhaps it would have been too much to ask for a title that can be purchased for only 9.99 euros. Is worth Yes, because the extremely competitive and aggressive price is such as to be able to willingly accept all the shortcomings of Tekken 5: Dark Resurrection, on the contrary fully appreciating what it has to offer. And there is really a lot of irons in the fire, given that the Namco production remains by far one of the best 3D fighting games available on the square; from this point of view Ps3, also counting Virtua Fighter 5 available in stores, is really off to a great start. The technical component is excellent, above all thanks to the resolution up to 1080p via HDMI which really makes the difference; obviously the origin of the product is much less powerful hardware than Ps3, and some low quality textures prove it. If it is therefore clear that the Sony console will be able to do much better in the future, it is equally certain that Dark Resurrection is anything but an aesthetically unsatisfactory product. Average sound, which has never been one of the spearheads of the series. Comment Tekken 5: Dark Resurrection is sold for 9.99 euros. This alone should be enough to overcome any hesitation for those faced with the ~download or not to download~ dilemma. But the Namco production value goes far beyond the proposed amount, offering owners of the new Sony console one of the best 3D fighting games ever on the market, strengthened by a more than decent graphic component thanks above all to the high resolution. A great start for the Ps3 online store no doubt... Pros Well-tested mechanics Large number of characters Excellent price Cons Slightly reduced longevity Underwhelming sound With the entry of Ps3 on the market, a real war has been unleashed to ~who has the most beautiful online store~ with the competitors Wii and Xbox 360. And so while the Nintendo console has chosen to bet everything on retrogaming, and faced with that Microsoft which can now count on a very robust catalog resulting from the advantage on the market, Sony had to start immediately by playing some rather heavy cards. Together with Gran Turismo HD, in truth little more than a tech demo for the capabilities of the new monolith, the spearhead of the Playstation 3 store is therefore undoubtedly Tekken 5: Dark Resurrection.", "date": "2007-04-20", "grade": null}