{"name": "M.A.C.H.: Modified Air Combat Heroes - Recensione", "ref": "https://multiplayer.it/recensioni/mach-modified-air-combat-heroes-recensione.html", "text": "Modified Air Combat Heroes Posing as a hybrid between Wipeout and Burnout, M.A.C.H. it is none other than the first ~aerial~ racing game for PSP, a console often criticized for the abundance of PS2 porting of its play library and which this time can count on an original title at least in the premises. M.A.C.H. it even presents a story that justifies the unfolding of events on screen, actually unintentionally resulting in the ridiculous. The year is 2049, the military authorities around the world have definitively adopted aircraft entirely managed by computers, leaving thousands of pilots on the street who thus find themselves on their hands: to pass the time and scrape together some money, they unite in a league that exploits the ~old~ planes for training purposes, all strictly for sport. It goes without saying that the strength of M.A.C.H. it certainly does not lie in the credibility and solidity of the setting, but must instead be identified in a decidedly good graphic realization, capable of properly exploiting the PSP hardware. The scenarios are extremely different from each other (ranging from canyons to oil structures passing through forests and snow-capped mountains) and are very detailed, while the various aircraft have a complex and refined polygonal modeling, as well as a futuristic look at the right point. The cosmetic richness of the Kuju work is fortunately also accompanied by a rock-solid frame rate, which is also capable of giving the game a convincing sensation of speed. The only comment that can be made to the visual sector of M.A.C.H. it concerns the menus - truly spartan - while moving on to the audio one, the not very incisive music and the insufficiently ~powerful~ effects must be beaten. On the playful front, however, the Sierra product initially appears quite rich, offering the user three different single player modes (Arcade, Campaign and Challenge), two types of game (Race and Dogfight), support for ad-hoc multiplayer up to 8 participants and eleven different jets to unlock as you progress, moreover customizable from an aesthetic and performance point of view. The downside, however, is represented by the only five scenarios made available, diluted in the course of the playful experience in the company of banal variations and the inevitable - and totally insipid - specular versions: in short, also considering the faults of an unforgettable track design , it is clear that M.A.C.H. tends to become inevitably repetitive after a very short time. Speed of sound As we have mentioned, there are mainly two activities that the user is faced with in M.A.C.H., namely the competitions and the dogfight sessions. The former take place within tracks on which to whiz using the effective game control system, precise and complete enough. Commanding your jet is a simple and immediate operation: there are acceleration, turbo (indicated by a special indicator that fills up when flying at low altitude), brake and roll, the latter essential to avoid the missiles launched by the opponents. And yes, because in M.A.C.H. not only speed matters, but also the ability to properly exploit the weapons collected along the way. As in any Wipeout or before that in Super Mario Kart, scattered here and there are icons that allow you to use a particular tool or skill to your advantage: you always stay on the classics of the genre, such as missiles, mines, invisibility , boost etc., but their presence still helps to make the races more intense, despite the CPU's bad habit of firing on the user just before the finish line. The dogfight scenarios, on the other hand, are resolved in all-against-all battles within fairly large arenas, with the sole purpose of totaling the greatest number of kills possible in the time limit: an operation that is anything but difficult, thanks to an AI not exactly aggressive enemies and the too high effectiveness of the missiles available during the action, capable of reaching their goal always and in any case. The challenges proposed by the Challenge mode complete the picture, which in any case do not revolutionize the M.A.C.H. of enemy planes, completing a lap within a time limit, and so on. As previously mentioned, M.A.C.H. it mainly lacks an evident repetitiveness, daughter of the small number of tracks and a completely conventional play structure (you win races, you unlock aircraft, you get money, you spend it to improve your vehicle and start the round again): this does not means that iThe Sierra product is a bad title, but it's just that it's unlikely to be able to keep the player glued to the screen for very long. Fun and basically well done, M.A.C.H. it is unfortunately a game that exhausts all its potential in a very, very short time. Comment M.A.C.H. is an honest racing game, original in some respects and dramatically conventional in others, which however has the only major flaw of putting too little meat on the fire: fun, although not transcendental, the Sierra product is excessively sparse in terms of scenarios and playful offerings, ending up becoming repetitive well before its natural conclusion. In short, appreciable as arcade in itself is for itself, M.A.C.H. inexorably loses the comparison with similar products with much greater substance. Pros Good graphics Precise and responsive control system Appreciable balance between races and dogfights Cons Only five tracks Play structure a little too limited Sound rather bland Racing games are a rather versatile genre, especially as regards their protagonists: since the dawn of the video game, in fact, substantially every means of locomotion - conventional or not - has been exploited for training purposes. But among cars, motorcycles, bikes, skateboards, spaceships and so on, the good old jets have always found little space, almost always being relegated to mere dogfighting. Sierra takes care of it with this M.A.C.H. to highlight the potential of a hypothetical world championship of combat aircraft...", "date": "2007-04-19", "grade": null}