{"name": "Rayman Kart", "ref": "https://multiplayer.it/recensioni/rayman-kart.html", "text": "Now, however, it is the turn of kart racing, thus following a trend opened by that Super Mario Kart for Super Nintendo which then saw the birth of a whole series of children and stepchildren on practically every existing console. For the occasion, Gameloft has chosen not to deviate particularly from the footsteps traced by the illustrious progenitor, but at the same time creating a product that undoubtedly represents the best of the genre available on mobile phones. And so here we are in front of 6 selectable characters, obviously starting from the protagonist Rayman up to the recent Rabbids, ready to compete on 16 divided tracks scattered within 8 different worlds. Obviously the paths are crammed not only with traps, puddles, ravines and turbo panels, but also with bonus boxes through which you can obtain objects to use to your advantage or against your opponents. A formula therefore devoid of hints of originality, but not for this less enjoyable, far from it. The quality of Gameloft programmers, proven by dozens of excellent titles, is also recognized in the good depth offered by the game, which finds its focal point in the possibility of unlocking as many as 6 different karts for each driver, for a total of 36 obviously differentiated between of them for a number of characteristics. For each world there are also 4 races, two of which are traditional against opponents, a time attack against time, and a lum collection competition. Therefore, despite the aforementioned positive aspects, we still don't feel able to promote Rayman Kart with full marks, basically due to a control system that struggles to give great satisfaction. Even considering the limits of the mobile phone interface, it is in fact a bit difficult to get fully involved, since practically the only thing really necessary to do is steer (keys 4 and 6) and use objects (key 5). If the automatic accelerator is a completely acceptable choice, the general uselessness of the powerslide during the curves (buttons 1 and 3) is less. Finally, the graphic component is pleasant but not flawless; in the face of well-made pilots and settings, some elements on the edge of the track that are a little too rough clash, together with the scrolling effect of the not perfectly fluid path. The sound, however, is spot on. Lastly, it is sad to note the total absence of multiplayer modes, which would have been at least desirable in a game of this kind; with bluetooth now standard in most terminals, it's time that programmers started to explore this aspect concretely as well. PRO Lots of tracks and karts Technically sound Pretty funny AGAINST Simplistic control system Too true to the genre Graphically not perfect", "date": "2007-04-13", "grade": "S.V."}