{"name": "Kirby's Adventure - Recensione", "ref": "https://multiplayer.it/recensioni/kirbys-adventure-recensione.html", "text": "What was it yesterday Returning from the atypical puzzle experience of Lolo, the types of Hal, evidently discounting a weakness towards characters with a cuteness rate at guard levels, gave birth to Kirby. Almost a new mascot for the NES - in years when Mario knew his highest peaks on the Super Famicom - Kirby is a chubby, tender and rubbery pink blob, but also a discreet offensive and killing device: he is equipped with a worthy transformation of a blob and, above all, from the ability to impose a suction on the enemies which, in addition to condemning them to a certain end, causes them to assume their abilities. By sucking enemies Kirby can relaunch them as if they were projectiles, while by swallowing them (a practice from which Yoshi's Island draws at least inspiration) he can then spit fire, transform into anvil, shoot arrows and lasers, use a sword, and so on, depending on the type of ingested victim. Kirby can jump and fly, slide attack, and by swallowing certain enemy types, roll like an offensive boulder. The levels are offered grouped in a game world equipped with doors that lead to other locations (Mario 64, anyone?), according to a progressive unlocking principle that is not necessarily linear which is the trademark of the Nintendo platform and which is an excellent means of multiplying the opportunities of offensive transformation of the chubby pastel pink blob. What is it today At just 500 Wii Points in the Wii catalog, Kirby establishes itself as one of the platformers with the best value for money and entertainment. In comparison with many subsequent platformers or with the best exponents of the genre, it is clear that Kirby presents itself as a ~simpler~ title, decidedly accessible, dedicated to a younger and lighter target in the level of commitment required and in the aesthetic presentation. This doesn't mean, however, that the game is inconsistent in terms of challenge or design. Quite the opposite: even if the possibility of flying minimizes the impact of the environments on the protagonist and if the game mechanics are not too complex, Kirby focuses everything on multiplication and gag. Aesthetically stylish, with environments with a narrow palette and sometimes almost monochromatic by choice and tiny but fluidly and irresistibly animated characters, Kirby is proof of how much an obsolete console like the NES could be able to express without any additional chip in hands capable of squeezing it adequately. What is it today Kirby's numerous transformations are the real reason to go on in the levels, but also the many mini-games (such as the amusement park-style puppet machine or the bonus kiosks in which to stuff yourself with favorite skills), the often imaginative end-of-level bosses and the decidedly interactive environments (blocks to break, aquatic sections, etc) are opportunities to keep the pace of the game up despite the relative ease. The possibility of returning as completionists on their own tracks once the game is over offers, then, a considerable dose of extra hours of play and exploration. An energetic platformer, ambitious without forgetting the immediacy, definitely fun, dedicated to all younger players, looking for pure entertainment and lovers of the genre. Kirby's Adventure is really a gem that has been forgotten for too long and that all platform game lovers should rediscover. The game also suffered an undeserved oblivion due to its publication on the NES in a year, 1993, in which Nintendo's eight-bit system was in sharp decline. Made obsolete by the advance of Sega's Megadrive, NES had also been gradually abandoned by Nintendo in favor of full support for its new heavy vehicle, the Super Famicom. Kirby came out quietly but, squeezing the NES like a lemon and emerging from an inspired and imaginative design, it remains an ambitious and fun platformer that is capable of entertaining for many hours while always keeping the pace high, if not the commitment.", "date": "2007-04-17", "grade": null}