{"name": "Dragon Ball Z Budokai Tenkaichi 2 - recensione", "ref": "https://multiplayer.it/recensioni/dragon-ball-z-budokai-tenkaichi-2-recensione.html", "text": "Game mode The latest incarnation of the games based on Dragon Ball for the ~major~ consoles, Budokai Tenkaichi 2 presents itself as an exceptional product in terms of completeness and longevity. The main game mode, in fact, allows us to relive the adventures of Goku and his companions from the arrival of the first Saiyan on Earth up to the last battles seen in Dragon Ball GT, passing through the events narrated in the numerous films parallel to the series. Everything is organized into ~sagas~, each made up of various stages in which you don't necessarily have to defeat your opponent, rather indulge in what really happens in history. Thus, they give life to battles without quarter within scenarios of generous dimensions (although far from being enormous), sometimes putting themselves in command not of a single character but of a group, whose members take turns as they are defeated. Proceeding in the story, the characters used ~grow~, improving in offensive and defensive capacity and, consequently, leveling up. Just like in the first Budokai Tenkaichi, there is a game mode (~Z Evolution~) in which the so-called ~Z Objects~ are bought, sold and assigned, a long series of upgrades that can make even the least gifted character of the lot unbeatable . These power-ups can also be used in story mode, thus increasing the chances of winning. Alongside the enormous story mode we have the ~Supreme Z Battle~ mode, a sort of survival mode in which you face increasingly challenging fights to unlock as many Z objects as possible. Then there is the ever-present ~Torneo del Drago, that is the original Tenkaichi Tournament with all the rules of the case: you are defeated when you finish KO but also when you touch the ground outside the ring. And finally the ~Duel~, which allows us to face a friend. The picture is completed by the dutiful ~Supreme Training~ tutorial, the aforementioned ~Z Evolution~ and the ~Dragon Library~, an inexhaustible source of information about the Dragon Ball universe and its characters. Control system As mentioned at the beginning, the release of Dragon Ball Z Budokai Tenkaichi 2 for Wii is an important confirmation of the commercial success of the Nintendo console. The series has so far been exclusive to PlayStation2, so the announcement of this conversion has aroused enormous curiosity among DBZ fans, who first wondered how the developers would use the Wii-mote and the Nunchuck. Well, like all video games not born on Wii (to date most, actually), Tenkaichi 2 offers a ~hybrid~ control system, which uses the motion sensor only in certain situations. In this case, the Nunchuck is responsible for the movement of the character, complete with a shot, while the Wii-mote is assigned numerous other functions, from attack to blocking. The coordinated use of the two devices becomes necessary when resorting to special moves: by simultaneously pressing the Z button on the Nunchuck and the B button on the Wii-mote, the control system prepares to detect the movements we perform to translate them into spectacular shots of energy. A quick example: to throw Goku's Genkidama sphere, after having charged up the spiritual energy we will have to press Z and B, then first shake the Nunchuck and then pull up the Wii-mote for the shot to be carried out. The result is a more ~light-hearted~ approach compared to the PS2 version, in some ways more cumbersome (the block obtainable by pressing Down on the directional cross, where you attack with A, is an insult to our psychomotor skills) and in others decidedly more crude and, if you want, funny. Certainly the learning curve of the game, already consistent on the Sony console, on Wii becomes even steeper and it will take quite a few games to master the movements of your character. It is perhaps for this reason that NamcoBandai has included the possibility of using the Classic Controller or the GameCube joypad instead of the Wii-mote and the Nunchuck, offering a gaming experience very similar to that of the PS2 and thus renouncing the innovative. Technical realization As for the technical realization, DBZ Budokai Tenkaichi 2 brings with it, also in this case, a wealth of well-drawn characters, who show wounds and bruises depending on the blows taken and move within vast but fluctuating scenarios : the beautiful plains rich in vegetation and the urban cross-sections stand in the way of desolate alien landscapes, poor in elements and badly coloured. The animations are not top notch, but they are functional to the action and their quality is compensated by the spectacle offered byspecial moves, really devastating (although not like those seen in the old Dragon Ball Z Budokai 3, which from a graphic point of view is still a cut ahead). Unfortunately, the technical quality of the game does not imply an adequate exploitation of the Wii's capabilities: the European edition does not support 480p viewing (it remains stuck at 576i on HD-Ready televisions) nor 16:9. Moreover, the comparison with the PS2 version is won by very little: the polygonal models are slightly more defined, while the backdrops have an antialiasing that is so reminiscent of the GameCube conversions. The sound sector has remained unchanged, retaining all its strengths: the speech in English is fortunately replaceable with that in Japanese, the sound effects are convincing and the music manages to excite enough to face the fights in the best way. All screen texts are translated into Italian. Comment While not even remotely exploiting the technical capabilities of the Wii, Dragon Ball Z Budokai Tenkaichi 2 is a product to be taken into due consideration for a few reasons. First of all, it represents a debut for NamcoBandai, and its inevitable sales success (as with all Dragon Ball games, after all) will lead to the arrival of other products from the Japanese company, hopefully designed specifically for the Wii. Secondly, now it is no longer necessary to own a PlayStation2 to access such a full-bodied and important tie-in, which really gives fans of the series everything they have ever wanted, with more than a hundred characters and dozens of special moves. Bottom line, if you like Dragon Ball Z and own a Wii, there's no valid reason why you shouldn't buy DBZ Budokai Tenkaichi 2. Hoping that in the future, along with the contents, there will also be an exploitation of the console's technical possibilities. Pros: Extremely full-bodied Light-hearted and engaging approach DBZ fans will love it Cons: Doesn't take advantage of the Wii hardware at all Use of Wii-mote and Nunchuck limited to special moves Doesn't support 480p or 16:9 After a launch phase supported by commercial success but characterized by fluctuating average quality in terms of games, Wii prepares the ground for a second wave of titles. In this sense, NamcoBandai's commitment can only please the owners of the Nintendo console, who will be able not only to play with all the multi-platform tie-ins, but also to hope for some productions designed specifically for the peculiar movement. Dragon Ball Z Budokai Tenkaichi 2, therefore, is only a first step.", "date": "2007-04-11", "grade": null}