{"name": "Sam &amp; Max Episode 5: Reality 2.0 - Recensione", "ref": "https://multiplayer.it/recensioni/sam-amp-max-episode-5-reality-20-recensione.html", "text": "Between Mario and World of WarCraft The experience is structured in a slightly different way compared to the past chapters: if in fact, until now, the narration served as a shoulder to a complex of puzzles linked by a common thread - the recording of a television broadcast or the ~race~ to the White House, to name two  in Reality 2.0 the plot is thinner, but more variety has been given to the situations proposed, experimenting with some new solutions and, above all, offering a massive dose of quotations. A first block of puzzles will see the player addicted to interacting with some rather stubborn computers able to change the appearance of Sam and Max, so as to allow him to earn some coins, equal to those that traditionally accompany the platformers of the Super Mario series, which they can be spent in the shop of a Wood this time in the form of a half-elf, to buy the right equipment to face a series of fights all to laugh about. The second phase, therefore, draws liberally from the clichs and culture of MMORPGs - and of those who play them - joking about epic adventures and fantastic worlds, without forgetting to emphasize the search for ever more powerful objects and identification with the character you play, all in full role-playing style. To the above, we add the constant possibility of passing from reality to its virtual counterpart, given that each of them has unique and necessary peculiarities to reach the longed-for final, which, without ruining the surprise for anyone, will see yet another turning point in the composition of the gameplay, abandoning its 3D guise to embrace a very well written and thought out textual form. Everything perfect then? Not exactly, especially due to a poorly calibrated difficulty, which alternates frustrating moments - few to tell the truth - with others that are absolutely too easy and in some cases trivial, jeopardizing the satisfaction felt in solving the proposed problems and the already not too much exhilarating longevity. Finally, different moods could cause the decision to definitively abandon the arcade driving session, which had aroused criticism for its limited thickness but, all in all, it gave a few minutes of carefree fun. The two neighborhoods Stylistically, Reality 2.0 enjoys a truly valuable workmanship. Almost all of the episode takes place in the neighborhood where the two protagonists live, which however takes on, once they enter virtual reality, a truly apt alternative connotation, with cyber punk elements and the introduction of some previously unreachable areas. Streets and shops are therefore represented in their futuristic guise  not futuristic, mind you  with many of the elements that it was impossible not to love, revised and corrected: Bosco's smoothie machine, for example, becomes a respawning point for a jelly-like enemy, while the fire hydrant at the corner of the sidewalk is now a working save point. For connoisseurs the soundtrack which, thanks to a series of tunes that seem taken from the productions for 16-bit consoles, will please the nostalgics and adapts perfectly to the context. The dubbing is magnificent to say the least, which, as usual, could put those who are less familiar with the English language in crisis, due to a particularly rich lexicon of rhetorical figures and puns - in any case, subtitles can help a lot . Coming soon to your consoles Now it's official, Telltale Games is working on a conversion of Season 1 of Sam & Max, dedicated to none other than the Xbox 360 Live Marketplace and the Wii Virtual Console. It is not yet known with what formula the games will be released or how many points they will cost, certainly there is the great affinity that this product and its episodic nature can offer to digital delivering services. All that remains is to wait for some new details and a possible announcement regarding the availability of the same also at the Playstation Store. System requirements Minimum Requirements: Processor: Pentium 3 800 MHz RAM: 256 MB Video Card: 3D 32 MB Disk Space: 240 MB Recommended Requirements: Processor: Pentium 4 1.5 GHz RAM: 512 MB Video Card: 3D 32 MB Disk Space: 240 MB Test Configuration: Processor: Intel Pentium 4 3.4 GHz HT RAM: 1 GB Video Card: NVIDIA 7900 Comment Penultimate appointment for this excellent series of graphic adventures. The originality demonstrated up to now is further renewed and, in Reality 2.0, also involves the gameplay, which benefits from some modifications and a more varied structure, even if partially to the detriment of the plot. In any case, you will find them many and very wellnsate, so as to entertain for the usual 3 hours, during which you can also appreciate the design of the settings and the excellent sound. Recommended unreservedly, looking forward to the grand finale and the incredible, hopefully, revelations it has in store. Pros We talk about the Internet and video games Good variety of puzzles and situations Beautiful design Cons Plot a bit fragile Difficulty poorly calibrated Another danger was skilfully escaped by the guys from Telltale Games. The risk of repeating itself, now in the fifth adventure in as many months, was increasingly high and the political-humorous exploit, adopted for the previous episode, seemed to represent the classic last shot, before an inexorably waning phase. But no, a new little jewel has come out of the cylinder, able to offer fresh ideas and a few laughs, this time dealing with a theme certainly dear to all those who are getting bored reading the review: the internet and video games. The story starts, as expected, in a rather specious way; the usual call reaches the office where Sam & Max carry out their daily work as freelance policemen, warning them of an imminent danger that threatens everything connected to the Net. A visit to the beautiful Sybil, now devoted to the profession of beta tester, will shed light on a special pair of glasses, capable of transporting the wearer into a sort of virtual world parallel to the real one.", "date": "2007-04-11", "grade": null}