{"name": "Tamagotchi Connexion Corner Shop 2 -Recensione", "ref": "https://multiplayer.it/recensioni/tamagotchi-connexion-corner-shop-2-recensione.html", "text": "100 Tamagotchi... Tamagotchi Connexion Corner Shop 2 is virtually identical to the prequel. The funny and nice shop simulator brings with it all its strengths and weaknesses, as well as the whole technical sector and some photocopied mini-games! Even if the temptation to postpone reading the review of the first chapter is very strong, it is better to clarify something. For those who don't know what we are talking about, TCCS2 is a set of mini tests based on some commercial activities and the forced use of the touch screen. We and one of our Tamagotchi associates are, in fact, the managers of twelve commercial activities dedicated to the little creatures invented by some unhealthy mind -?-. A carefree look, a difficulty set on low levels and a series of elementary and repetitive actions make it a very suitable product for the little cousin or for the daughter of the neighbor. On closer inspection, unlike the first chapter, the games have still been a little simplified and have lost some of that madness and Japaneseness that reigned pleasantly in the past. The crazy job of the dentist has been replaced by the less appealing profession of the doctor, the repetitive game of cooking Takoyachi has evolved into the more fun task of preparing sushi. The pastry shop with its funny cakes, the very difficult musical game and the florist with its bunches of flowers reappear the same  practically a quarter of the game is photocopied-. However, the new entries are more or less reminiscent of the tests already seen. In fact, these are managed with exactly the same mechanics based on tabs and multiple choices useful for realizing the wishes of the customers. And so between ups and downs, between a very boring game of bowling - where we will have to put the pins in place, not play ... - and a nice garage where to take care of the various vehicles, we quickly arrive at the conclusion of all the little that the title offers. ...and a poor gambler... To unlock the mini-games you have to, as in the past, repeat them ad nauseam until a certain character appears. If before there was the father to give the money to grow the business, now there is directly the princess Tanako. The aim is always to grow the shop to the fourth floor plus royal seal. ~Working~ they then earn Gotchi - the local currency - which allow us to buy various accessories, furniture, foods and pampering for our tamagotchi in the appropriate ~care~ section which follows, also in this case, what has already been seen in the past . The additions of the points card given to each character, to be filled with stamps, and of the list of customers to be ~unlocked~, as well as not adding anything new, clearly wink only and exclusively at the little ones. Time therefore stands still: as for the first chapter, the useless and ultra-repetitive dialogues remain  which I think children like so much -, the funny little tunes, the discreet but very colorful and well cared for technical realization, the full and bright colours, the approximate evaluation made note with the three faces that laugh or are sad... In short, it remains the perfect toy to give to the little ones and to take a look at even if you are a little more grown up, but given that it is substantially the same as the first and that it lacks that madness and those delightful references to Japan this time the viewing can only be much shorter. Comment TCCS2 is too shamelessly a more of the same compared to the first chapter. Not only does the structure or mechanics of the games not change one iota, but three identical ones recur. Technically substantially indistinguishable, it seeks neither to eliminate the defects nor to develop the merits of the prequel. All this leads to a substantial indifference to what is being done given that everything has already been repeated in the past over and over again. Having said that, given that time has stopped, the advice remains the same: gift for a child - who certainly loved the first one - and a quick look for the older ones. The second point, however, remains valid only if you have not had the opportunity to play TCCS1, otherwise, the advice is to leave it alone. Pros Very suitable for the little ones Immediate and nice mini-games Overall captivating look Cons Too much like the prequel In the long run boring Repetitive and too simplified Sometimes time runs, sometimes it passes slowly, other times it seems to crystallize and stop. Usually, in the videogame field, time gallops: new hardware retires obsolete machines, new genres replace the old ones, sequels try to surpass the original titles... But in this case, time seems to have stopped. [C] The activities shops form a sort of ~neighborhood~ Create Hamburger Interceptndo the ingredients on the fly... ... or create cute garlands of flowers? [/C]", "date": "2007-04-10", "grade": null}