{"name": "Castlevania: Symphony of the Night - Recensione", "ref": "https://multiplayer.it/recensioni/castlevania-symphony-of-the-night-recensione.html", "text": "Bloodlines In principle, the macro-story that makes up the Castlevania saga (more than twenty games in total, for the moment) is centered on the eternal challenge between the Belmont clan, a centuries-old family of vampire hunters, and Dracula . The challenge is nothing more than the usual continuous struggle between good and evil, where evil is here always represented by the Lord of the Vampires of Transylvania, repeatedly evoked, sought and resurrected by obscure characters always in search of a higher power. On the basis of this macro-story, various secondary digressions and spin-offs are grafted, with different characters but almost always somehow connected with the Belmonts, and in any case, always, with Dracula. The story of Symphony of the Night starts a few years after the conclusion of Rondo of Blood, the famous chapter of the series released on PC Engine, which starred Richter Belmont, whose final battle against the vampire is the prologue to the game (note that if you don't unlock the whole game, the demo version allows you to try only this small introduction). It is 1796, Richter has apparently disappeared and the protagonist of the story is Alucard, son of Dracula and a human woman, already present in chapters preceding this one, and devoted to the good of humans and the clash with his evil father. Our hero, aware of his powers of dark origin, had imposed a magical sleep that should have been eternal, but the spell is broken when Castlevania, Dracula's castle, re-emerges in the Transylvanian mists, prompting Alucard to still fight. Ours, as a good son of the Lord of Darkness, is an extremely powerful character, and in the first screens he shows that he can settle enemies with great tranquility, but after the first few minutes of the game we will meet Death himself, Dracula's right arm, who it will strip him of all powers and armor, forcing us to start from scratch, advancing from level to level until we build a character worthy of fighting against the master of Castlevania. Inside the castle we will find other characters: Maria, Richter Belmont's sister-in-law will provide us with useful information on what is happening, Shaft, a dark individual obsessed with the desire to bring Dracula back to life, and Richter himself, who will also become a playable character once once you complete the game the first time. Symphony of the Night features several endings, which can be reached in various ways: to be able to see some of them, you will have to complete the exploration of the entire castle several times, since 100% is only the beginning... Hunting for vampires For those few who don't know Castlevania, it is essentially an action-adventure, based on a platform setting. It is a question of accompanying the protagonist, in this case Alucard, towards his goal: to eliminate once and for all Count Dracula, the historical villain of the series. We will therefore have to explore with our hero a huge castle (that of Dracula, to be precise), littered with platforms and monsters of various kinds, to be knocked down with different types of attack available. The Symphony of the Night chapter, in particular, introduced new features, which then became standard: in addition to the classic action, the game structure is deepened by various elements borrowed from the world of role-playing games. The main character is therefore no longer immutable, but evolves, progressing from level to level, accumulating experience points each time the enemies are eliminated. This involves increasing the various characteristics such as attack, defense, magical energy, etc. modifiable values also thanks to the numerous weapons, armor and accessories that can be found around the castle (or purchased in the appropriate shop) and equipped. This new introduction, while leading to a deepening of the dynamics, also has a negative side: the very first hours in fact represent a tough and demanding challenge, but if you have the patience to ~level up~ a little, making your character progress, the difficulty level is consequently lowered significantly, almost excessively, almost canceling the challenge, which will remain at that point only in the boss fights. Where the traditional weapon of Castlevania was the whip, in this chapter the weapons are of various kinds and can be equipped in pairs, one for each hand, and the different effects and characteristics of these give a strategic touch to the management of the player. There is no subdivision into levels, but there is the possibility to explore the castle freely, although different areas require specific objects or particular skills to be reached, with the collection of three rare artifacts allows Alucard to transform into a wolf, bat and fog (in line with some legendsde on vampires). In addition to the classic secondary weapon slot, Symphony of the Night also contains a repertoire of special attacks that can be activated by performing particular movements with the pad and key combinations, which trigger various types of magic. Castlevania today Commenting from a technical point of view on a game more than ten years ago may make little sense, and even seem unfair, but it is still a title that, unlike Galaga and Dig Dug, to name a couple, can actually advance qualitative claims. Castlevania has been adapted by Digital Eclipse for Xbox Live Arcade leaving it almost identical to the original, without any changes or additions, except for a small work of adaptation of the graphics, for which particular filters have been used (which can be deactivated in the options screen) to increase their definition and decrease the otherwise inevitable spixellation that would have affected 2D sprites and scenarios. The image can be ~stretched~ as desired to best fit the screen size, increasing or decreasing the frame that surrounds the game scene. In general, the impression is that something better could have been done: the ideal would have been, for example, to make the game optimized to be visible in the best possible way on larger and high-definition screens, or even better to support 16/ 9 without having to stretch the image horizontally. The sound accompaniment, characterized by the usual beautiful orchestral music, has not undergone any particular alterations despite the compression to which the whole game has been subjected to fit into the 90 MB of space available, and retains its charm unchanged. The terrible spoken dialogues of the American version (subtitles in Italian) have also remained the same, which in any case have now become a cult for the series. Certainly, one cannot fail to notice how the game appears a bit technically dated, on the other hand already at the time of its release it did not exactly represent the most advanced tip in video game production, but it is also true that the entire Castlevania series has rules to follow. Certain sprites, for example, must be drawn in a certain way, and animated with those particular movements that have characterized them for years, they are stylistic figures that must be preserved, and of which one must be aware before entering Dracula's castle. Goals 360 The unlockable achievements have been implemented in this title quite cleverly. Not having a linear structure, in levels, Symphony of the Night therefore needs other criteria to assign awards to the players, and the system adopted by Konami seems to repay well those who are willing to commit themselves particularly. The achievements are as a rule (for Live Arcade) 12, for a total of 200 points. Some are quite easy to unlock, such as those that can be reached by killing some bosses or collecting particular artifacts scattered around the castle, while others are dedicated to more committed users, and require completing the game even with Richter or reaching 200.6% of the open areas of the game world. Therefore, it takes a long time to carry off all the loot. Comment What can be the value of this game ten years after its original release? Castlevania: Symphony of the Night certainly doesn't count on the iconic power of the 80s arcade classics, nor on the nostalgic evocation of the ~good old days~. It looks exactly what it was ten years ago, a stunning 2D action/adventure, and not only stands tall amidst the current Live Arcade offering, it also makes comparisons awkward with the new 'greater' Castlevanias. those inevitably built in 3D to meet public demand and the technological rush. Those who played it just a few years ago won't find much interest in this re-release, while new audiences will find the game technically dated. However, it is a masterpiece of a couple of generations ago available for only 8 euros, which can still represent a pleasant surprise for those who do not know it. Symphony of the Night hasn't aged badly, in fact, it hasn't aged at all. Pros Virtually eternal gameplay Long and challenging with good implementation of objectives Absolutely tempting price Cons Minimal adaptation work Many will have over-played it just a few years ago Difficulty curve poorly calibrated Castlevania: Symphony of the Night was probably the title on which the most hype was built, and on which the greatest anticipation was concentrated, among those that appeared in the Liv offerand Arcade. There are many reasons: beyond the very value of the game in question, it is the first adaptation of a ~modern~ game within the classic line of the Microsoft digital delivery service, belonging to the 32-bit generation, relatively close in chronological terms. Furthermore, since it was a game originally residing on CD-Rom, questions arose immediately about the actual possibility of including it in the Live Arcade program, given the limitation imposed so far by Microsoft on the maximum size of downloadable files, equal to 50 MB. Castlevania has brought an innovation in this sense, going beyond the limits permitted so far (the file amounts to 90 MB) and thus creating an interesting precedent, which will probably expand the capabilities of the Live Arcade with the possibility of introducing ~heavier~ games, from part of the software houses. But these are not the only innovations brought by Koji Higarashi's game to the Xbox 360 Marketplace: Alucard's adventure goes beyond the boundaries imposed so far by Live Arcade even conceptually. After a long period in which the games present in the Xbox 360 downloadable catalog were clearly aimed at a very immediate, simple and elementary type of entertainment (puzzle games, shooters, arcade classics, some games tending towards casual ), Castlevania presents itself as a long and rich experience, complex and demanding. It's just a different sensation, the one that strikes the player grappling with this title, compared to the experience of other Live Arcade games: we are effectively faced with an action/adventure that was studied and developed to be a leading title in the market, of consoles that date back to a few years ago, and the difference with games developed under a budget regime and aimed at ~immediate entertainment~ is evident (without necessarily involving judgments on the intrinsic quality of these products, we are talking about concepts different) and gives an edge to this game.", "date": "2007-04-10", "grade": null}