{"name": "Angry Birds Reloaded", "ref": "https://multiplayer.it/recensioni/angry-birds-reloaded-recensione.html", "text": "The Angry Birds Reloaded review takes us back in time, to the now distant 2009, when the unknown Finnish team Rovio launched the original Angry Birds on mobile devices. A puzzle game different from the usual, based on physics, characterized by mechanics capable of combining immediacy and depth in a literally explosive mix. And then of course there were them, the Angry Birds protagonists of the adventure, engaged in a battle without quarter the evil little green pigs aiming to get hold of their eggs. Characters so nice and well done that they quickly became part of the collective imagination, while the game literally grinded billions of downloads and contributed to the birth of a real economic empire. The reloaded version Angry Birds Reloaded, a pachinko-style level. Between mobile games, console releases and merchandising, Angry Birds has produced extraordinary collections over the years for Rovio, but it is clear that any cult phenomenon is destined to normalize at some point. Precisely for this reason the team has tried on several occasions to imagine alternatives, more or less valid concepts that could become a new, great success, but without too much luck. So here we are in a return to the past, with a reinterpretation of the original chapter available in time exclusive on Apple Arcade, therefore without microtransactions and with a whole series of innovations that substantially diversify this ~remaster~ from the first Angry Birds between unpublished characters, new levels and new power-ups. Gameplay Angry Birds Reloaded puts us back in control of classic characters from the series, and more. What really hasn't changed is the gameplay, which refers to the original mechanics while introducing some variations on the theme, both as regards the birds at our disposal and their relative powers, both as regards the scenarios, and on more than one occasion they try to bring into play the physical reactions of the materials, rebounds, indirect hits and so on. Just like twelve years ago, our goal in each stage is to eliminate all the green pigs by launching our angry little birds with a slingshot and taking advantage of their peculiar skills in order to successfully complete the mission, perhaps saving a few launches to score a higher score, which this time will be stored in a global leaderboard. We will also be able to count on new upgrades, i.e. special shots that can be purchased with the coins earned during the campaign. Structure and technique While on the one hand the experience tries to reinvent a formula that has nevertheless remained fundamentally the same, on the structural front the developers have tried to push a lot, giving us a campaign made up for the moment of seven different scenarios, each divided into forty-five stages: to complete them all you will necessarily need a lot of time. This abundance is supported by an excellent technical sector, which does not give up the original Angry Birds style by trying to reinvent it, but rather relaunches it in a convinced way. The interlude sequences of the game demonstrate this eloquently, as usual very nice, but also the in-game graphics are no different. A single note of demerit: on the iPhone 12 Pro there are small slowdowns during some launches which are clearly not justifiable and must be resolved.", "date": "2021-07-20", "grade": "8.0"}