{"name": "Alien Hominid HD Live Arcade - Recensione", "ref": "https://multiplayer.it/recensioni/alien-hominid-hd-live-arcade-recensione.html", "text": "Dedicated to all nostalgics The game mechanics at the base of Alien Hominid HD is extremely simple: in a two-dimensional environment you have to eliminate the numerous enemies that are sent against us, trying to avoid their bullets and facing, at the end of each stage, a big and bad boss. Anyone who has tried one of the Metal Slug or Contra episodes knows exactly what to expect, as Alien Hominid HD is extremely similar to these games: our character doesn't have his own energy, so he can be eliminated in the first shot if he doesn't have one.~ barrier~, which is acquired by collecting the new weapons and which in fact represents a second chance (it resists a single shot). The obtainable weapons are numerous, and each of them boasts specific characteristics; all, however, have counted the shots. Anyone who has tried one of the Metal Slug or Contra episodes knows exactly what to expect Grenades are added to the main weapon, which are useful when you need to quickly eliminate a resistant opponent. But that's not all: our alien can instantly dig a hole and hide inside it until an FBI agent runs over it, after which it can grab it to kill it immediately. Or he can leap on an enemy's head and take a bite out of it, while causing dismay to other opponents on the screen. In some levels the normal structure is distorted in favor of ~road~ settings: you have to jump from car to car to proceed and take possession of one of them when needed, for example when the action itself becomes an evasive practice to defend yourself from attacks of a boss. The bosses, by the way, sometimes show similar attack strategies (high blow, low blow, etc.), but they are quite successful and at ease with the spirit of the game. Better alone than in bad company... Unfortunately we die very often. Some bosses are really huge! Here comes high definition! Compared to the Playstation2, Xbox or GameCube version, Alien Hominid HD on 360 has obviously been improved. Although the game is the same, the sprites of the game are made in impeccable high definition 2D, with well done animations for the characters and very varied (especially if you take into account the types of death that FBI agents can meet ). The explosions, in particular, make a really good impression. The general look is very reminiscent of the ironic and irreverent cartoons that are fashionable in recent years, and represents an excellent show even for eyes accustomed to millions of polygons and photorealistic textures. The sound sector defends itself very well: the music is well done and can be listened to with pleasure, in particular thanks to a more ~homemade~ feeling compared to other productions, due to the choice of instruments used. The sound effects fit perfectly. The normal game mode, which can also be used by two players at the same time, is accompanied by an extra represented by various mini-games. These are thought harps with essential graphics, which nonetheless represent a valid pastime. At point blank range, our heroes draw their knife! Characters and backgrounds look like they're taken from a cartoon... One of the road stages, really difficult to deal with. Comment Alien Hominid HD is a pure arcade, characterized by a very particular technical realization and certainly up to the task. To appreciate this title, you have to be a fan of two-dimensional action games, with all that this type of video game, now almost on the verge of extinction, entails. In Alien Hominid HD, in this case, you die continuously because sometimes it becomes really impossible to avoid enemy fire, and the use of ~continue~ becomes a constant practice, which takes away a lot from an otherwise fantastic experience. Apart from this, those looking for an immediate and fun title will find the crowning of a dream in Alien Hominid HD: engaging alone and fantastic in two, the game will give you moments that you thought were lost together with the previous generation of video games. Pros Great HD graphics Immediate and fun Attractive price Cons Too difficult Offline multiplayer only Only if you haven't played the previous versions Goals 360 Like any Live Arcade game, Alien Hominid HD allows you to collect a maximum of 200 points to add to your Gamertag, distributed over 12 objectives. These can be unlocked either with simple game progression (completing levels and killing bosses), or by performing specific actions, such as destroying at least 25 buildings in a game session, killing 1000 enemies or eating at least 50 KGB agents once.lta transformed into Snow Yeti. The first objectives are relatively easy and are unlocked simply by completing the game, the others will require a certain amount of effort and a lot of dedication. Minigames and Multiplayer Despite the potential of Xbox Live, Alien Hominid HD does not allow you to play online multiplayer with a friend of ours, rather it provides us with a vast array of mini games to play together as a cheerful pastime for some rainy spring evening. Through the 16 stages it is possible to unlock 8 minigames and a ~PDA~ mode. The latter consists of a series of platform levels with a simple and stylized style to be done on the screen of a palmtop that our cute alien holds in his hand. Alien Hominid HD does not allow you to play online multiplayer with a friend of ours Minigames and Multiplayer The levels in this mode are very nice, the goal is simply to kill all enemies, unlock the escape route and move on to the next; some are quite simple, others more complex, in fact to collect all the bonuses present it will be necessary to sweat a little and learn the moves that the character can perform well. If online cooperative multiplayer has been banned from Alien Hominid HD, fortunately the developers Behemoth of San Diego still allow us to have a companion alongside, albeit offline and after creating a profile on our Xbox360 console. Explosions aren't bad... Meet the Snow Yeti... A huge Boss... What would you do if someone hit your spaceship causing it to crash, and then take it away? Our lemon yellow alien hominid has clear ideas about it: he will go around various levels killing FBI agents in all possible and imaginable ways, until the stolen goods are returned to him.", "date": "2007-04-05", "grade": null}