{"name": "Castlevania: Portrait of Ruin - Recensione", "ref": "https://multiplayer.it/recensioni/castlevania-portrait-of-ruin-recensione.html", "text": "Goodbye nib On the occasion of the DS debut with Dawn of Sorrow, the programmers led by Koji Igarashi had tried to exploit the peculiar characteristics of the new console both by inserting the map that was always available on the upper screen, and by adopting the use of the stylus for some actions, starting from from the design of delegated symbols to the creation of spells. Although innovative, this choice failed to fully convince, basically due to the imperfect integration with the gameplay and the impractical need to hold the stylus in such circumstances. Evidently aware of these problems, the team preferred to abandon the aforementioned feature altogether, concentrating on the contrary on different innovations to be introduced with this Portrait of Ruin. The setting is in 1944, during the Second World War, a period of such gloom and human darkness that it represents the ideal moment for the reappearance of Dracula's castle. This time there are even two protagonists, and this is the most important novelty of the game; more specifically, they are Jonathan Morris, a distant relative of the Belmont family, and his young friend Charlotte Aulin (no, she is not the creator of the drug of the same name... ). The first quite faithfully embodies the stereotypes of the series, representing a good fighter equipped, among other things, with the Vampire Killer whip, legacy of the vampire slayer father. The second one, on the other hand, is the classic girl skilled in magic but rather physically fragile and therefore not very suitable for hand-to-hand combat. This introduction affects the gameplay of Portrait of Ruin in a decidedly substantial way; in addition to being able to call on the second character for support in the fights, and in addition to the inevitable ability to vary the control between one and the other, the presence of two protagonists also proves to be fundamental for the resolution of a whole series of riddles. An example? Think of a minecart, with the lever to activate it too far away to push it and get on it in time. Here then you can call the other partner, order him to stay on the trolley, activate the aforementioned lever and the game is done. Or jump on your shoulders to reach inaccessible areas, or push objects, or create spectacular combined attacks and so on. Too bad that in the end these situations of cooperation are rather small in number within the entire adventure; on the other hand it must be recognized that the weight that this feature has in the game economy is decidedly significant, and probably the programmers did not want to exaggerate, risking straying too far from a well-tested formula. But given the desirable excellent response that it will have, it may be that with the next chapter Igarashi-San wants to dare something more in this direction. Castle central stop New and old mix in Portrait of Ruin; and so if there is no lack of RPG aspects, with growing statistics, objects and weapons to equip, etc., on the other hand Dracula's castle is no longer the only setting in which the adventure is destined to take place. Yes, because a handful of paintings are in fact scattered within the same manor, which in reality are nothing more than portals with which to access different areas such as gothic cities and haunted forests, decidedly vast, each with its enemies and final bosses. A very apt choice that gives variety without taking anything away from the spirit and classic charm of the series; pity only for a level design that is not always very inspired and indeed a little repetitive, linear if not downright listless. Definitely not the same can be said of the graphic component, really of a high level; abandoning the realistic trait in favor of a slightly more cartoonish one, also as regards the use of colors, Portrait of Ruin is really a beautiful sight in every aspect, starting from the animations of the characters and bosses passing through the intelligent use of the 3d, employed on the occasion of some backdrops and with a handful of enemies to obtain some particular effect. More generally, it is the style that fully convinces, and I'm sorry to see it slightly diminished by truly trivial and superficial dialogues; from this point of view it is reasonable to expect an evolution from the series. The sound, on the other hand, is very good, especially as regards the quality and quantity of the accompanying songs. Finally, great emphasis and enormous hopes were entrusted to the online multiplayer component; the final result, although being able to guarantee the connection both locally and via the internet, ultimately turned out to be below expectations. In summary, everything revolves around the boss rush mode, which is nothing but a speciesand time trial in which it is necessary to go from one end of a short level to the other trying to get rid of all the monsters present as soon as possible. The ability to sell and buy items online from other users is also not very intriguing: in Castlevania there have never been items that are particularly rare or in any case so useful as to justify the need to go and look for them specifically, and consequently this function brings with it at least an interest marginal. Comment With Portrait of Ruin, the Castlevania series takes one step back and two forwards: abandoning the evidently impractical use of the stylus, it has in fact chosen to bet its cards on the presence of a couple of characters, as opposed to the classic solitary hero , able to interact with each other and solve puzzles during the adventure. A very interesting idea which, although developed in some respects in a little depth, lays the foundations for a next episode with great evolutionary potential. For now, even with a not always very inspired level design, all too trivial dialogues and a completely negligible online component, what remains is an undoubtedly successful chapter that all lovers of Konami production should buy. Pros Both characters work Excellent graphic style Tried and rocking gameplay Cons Negligible online component Inconsistent level design Trivial if not irritating dialogue Among the few certainties of life, we can now safely include the episodes of the Castlevania series on Nintendo laptops; since the world of home consoles has fully embraced 3D turning its back on the two dimensions, the Konami franchise has first found a permanent home in the GBA, only to continue the tradition on the DS. After making his dual-screen debut with Dawn of Sorrow, it's now time for an encore with Portrait of Ruin.", "date": "2007-03-30", "grade": null}