{"name": "Ultimate Rivals: The Court", "ref": "https://multiplayer.it/recensioni/ultimate-rivals-the-court-recensione.html", "text": "With the review of Ultimate Rivals: The Court, the ambitious project by Bit Fry Game Studios takes on a very specific form, involving us in a distinctly arcade-style sports experience that not surprisingly mimics a great classic like NBA Jam. The idea is simple: to stage futuristic arenas in which real athletes belonging to various disciplines challenge each other, giving life to frenetic three-on-three matches characterized by rapid head flips, exaggerated jumps, fiery shots and special moves that recall the real abilities of the characters that make up the roster. Currently available exclusively on Apple Arcade, Ultimate Rivals: The Court will also arrive on PC via Steam in the coming weeks and will eventually appear on consoles, where the reception given to it by the public should be the one hoped for . Gameplay Ultimate Rivals: The Court, the devastating outcome of a fiery shot. A short tutorial introduces us to the mechanics of Ultimate Rivals: The Court, which immediately turn out to be quite simple. As in real basketball, you alternate between attack and defense trying to get possession of the ball and aiming for a basket, whether it's dizzying shots from outside the box, close shots or furious dunks. Our team members have of very different values as regards the various skills, and we will have to take them into account in the gameplay, trying to make the most of them to score and avoiding venturing into actions that the character on duty will hardly allow us to conclude successfully. Ultimate Rivals: The Court, a long shot in a modern arena. You can play using a rather classic touch control scheme, with a virtual analog stick and four buttons on the right side of the screen that change function depending on the phase of the game, attack or defense, or connect a Bluetooth controller and rely on physical commands inevitably more precise and reliable, also due to a general slipperiness of the interactions. The difference is noticeable a lot due to the extreme chaos that is created during the action, and that between bright colors and special effects it is often difficult to read, which makes touch inputs even more complicated to carry out. As mentioned, with the controller the situation improves a lot but cuts the legs to a use in pure portability, once again placing the use of the iPad as preferable to the iPhone within the Apple Arcade platform. Structure Ultimate Rivals: The Court uses a scoring system that is also exaggerated. If the gameplay of Ultimate Rivals: The Court can certainly give satisfaction due to the obvious references to NBA Jam (specials included!), net of a visual confusion that must be dealt with and which requires a bit of running-in , different is the matter relating to the numbers of experience, which frankly did not seem to live up to expectations. field and with the inevitable achievements, in terms of available modes and arenas, there is little to get excited about. The lack of a career or a tournament proper, replaced by a sequence of six matches with a rare character up for grabs, weighs in particular. Ultimate Rivals: The Court, calm before fast action. That's all: in addition to quick matches and online multiplayer (which, however, we were never able to use during our tests: matchmaking obviously needs a fix) there is very little that the Bit Fry Game Studios title can offer; even considering the only four selectable scenarios, which actually come down to three if we consider that one is the structure assigned to training and does not boast the visual richness of the other locations. including WWE superstars) to enrich this aspect of the experience at the expense of all others. A right or wrong choice? The users will decide, who also in this case will not have to worry about any microtransactions or similar mechanisms: as per tradition for games on Apple Arcade, there are none. Technical realization If from a structural point of view enough has not been done, the technical realization of Ultimate Rivals: The Court, on the contrary, seems literally full of visually spectacular elements, cartoonish and well-drawn characters, devastating special moves and many other elements which however create a lot confusion on the screen, in particularif it is the reduced one of an iPhone. The arenas are few, as already mentioned, but they offer interesting ideas and are literally transformed when one of the athletes starts the special, catching fire or showing the devastation of the scoreboard after a particularly violent dunk . The soundtrack is less incisive, which indeed reveals itself from the very beginning to be rather generic and devoid of bite.", "date": "2021-07-18", "grade": "7.0"}