{"name": "La recensione di Rayman 3: Hoodlum Havoc", "ref": "https://multiplayer.it/recensioni/la-recensione-di-rayman-3-hoodlum-havoc.html", "text": "Globox Globox always you In the Crocevia dei Sogni people lived quietly and in peace, until a red lum suddenly transformed into a strange ball of fur with wings named Andr. The evil being took it into his head to want to conquer the world and in a short time created an army of Hoodlums. Who will ever be able to restore serenity? I'll give you a hand: he has a very big nose yes it's him, it's Rayman. This is, broadly speaking, the plot of Rayman 3 Hoodlum Havoc. Perhaps not very original, but quite engaging. We are immediately catapulted into the game by the introductory movie and the feeling of dj vu is immediate. We return to that world that we had abandoned some time ago, but everything is raised to the nth degree. The screen is full of colorful objects in motion and the sensation that it is real is really strong, then there is Globox, always him, our dumb friend who will once again combine some good ones. It is certainly nice to find the fantastic universe that framed the previous adventures, but there could also be the risk that those who have played the previous chapters of the series may get tired. To avoid this, the developers have seen fit to focus a lot on the humorous component of the different characters, fully succeeding also thanks to a well-kept Italian dubbing which helps to make the game an interactive cartoon. The feeling with the game has remained unchanged and the gameplay is still very captivating. In itself it is perhaps a little too linear and not innovative, but the whole thing is so rich from the point of view of exploration and confrontation with enemies that it turns out to be very fun and engaging. The scheme is the traditional one of any good platform game, you pass the levels, using the various items, to finally get to the boss fight. Unfortunately, the puzzles we encounter along the way are truly trivial, so that, in the end, the Ubi Soft title turns out to be a little too easy and not very long-lived. Rayman I choose you! Our hero responds very well to the commands and every action is natural and easily performed, thanks also to a good framing of the virtual camera which, for any eventuality, can be rotated using the right analog stick. With the left stick we move Rayman and with the A button we make him perform most of the actions (above all, jump and activate the helicopter). With the X button we shoot and load the fists of energy and with the B button we display the ~life bar~. Analog triggers are entrusted with two important tasks: the left one activates camera rotation and allows zooming, while the right one deals with the fundamental lock-on on enemies. Yes you read right, now Rayman can fight against an enemy without ever turning his back on him. This underlines how the developers have chosen to also focus on the fights. There will be many and all immediate, fairly frenetic and certainly fun. Rayman, in his new incarnation, has been enhanced, or rather the actions he can perform have been increased. By taking special power ups, he will be able to acquire five super powers. The Whirling Punch allows him to fire whirlpools that can spin everything from enemies to background elements. The Crumble Punch makes our shots very destructive, the Grabber Punch provides Rayman with metal jaws, ideal for jumping from one lum to another like Tarzan. The Torpedo Punch transforms one of our fists into a torpedo which, as soon as it is fired, must be remotely guided to the target and, finally, the Elitroptero which gives us the possibility of flying further. We cannot forget that even longevity is increased by numerous bonuses and by an innovative, at least for the Rayman saga, score counting system: every time we finish the game, we will be given a code, which corresponds to our total points, and which we will be able to enter on the man-ray site to understand how good we have been and where we are in the world rankings. However, there is a flaw to note that will somewhat affect the overall judgment: the difficulty is too low. Of course this will facilitate the task at the beginning, but later boredom will take over. You will play it for sure, you will have fun, but you will hardly put it back on your Xbox. The Technique, the technique Kudos to the developers of Ubisoft for how they managed to create a world, populate it and bring it to life. As mentioned before there are always many moving objects in any pattern. All accompanied by anti-aliasing and dynamic shadows. The ~nostro Man Ray is rich in animations and very fluid in every movement. The enemies have also been carefully created and boast decent if not very advanced AI. The virtual camera, often a flaw in platform games, works quite well and in any case can be rotated at will. A slightly low poligon count (also the result of the multi-format production of the title), unfortunately, weakens the final result which otherwise would have been phenomenal. It must be said that in general the virtual models are well recreated and also the water and the light effects are no different. All this without ever encountering a slowdown in updating the image. The soundtrack stands on a medium level while the sound effects and above all the dubbing are very accurate, helping to increase the immersion in Rayman's enchanted universe. Comment There is little to say about it, Rayman3 Hoodlum Havoc is THE platform game for now on Xbox. Fun and rewarding, well cared for and very ironic. Unfortunately some defects such as low difficulty, excessive linearity and a technical realization that does not fully exploit the potential of the Microsoft console, deny it the definition of a masterpiece. However there are no doubts, if you love platform games and want to spend a few hours of healthy and carefree fun, there are no alternatives that can hold you back, you must have it. Pros: Fun and very engaging It's Rayman raised to the nth degree Good dubbing in Italian Cons: A little too linear Technically well done, but not phenomenal Difficulty a bit low Not extremely long-lived When I think of Rayman, two games immediately come to mind: Rayman 2 and Rayman Advance, respectively released for the Dreamcast and Gameboy Advance. What do they have in common? Well obviously nothing from a technical point of view, but two aspects make them similar, fun and quality. Rayman2 immediately established itself as one of the best platform games for the Sega console, placing itself on a level equal to, if not superior to, the much acclaimed Sonic Adventure. For many players Rayman2 was deeper and in any case it was preferred by those who preferred a slower and more exploratory approach compared to the frenetic title of the blue hedgehog. Rayman Advance, on the other hand, was one of the first titles for Gba and perhaps the first to show the true potential of the Nintendo portable. Surely until the release of Super Mario Advance 2 the Ubisoft game was the best exponent of its genre. All this to make you understand that the name Rayman has long been synonymous with quality and many hours of fun. Now the man-ray is back in this new guise for the next generation consoles, even more convincing, profound and exciting.", "date": "2004-07-23", "grade": null}