{"name": "Silent Hunter 4 - Recensione", "ref": "https://multiplayer.it/recensioni/silent-hunter-4-recensione.html", "text": "Welcome to the Silent Service In this new chapter the theater of battles has moved from the Atlantic to the Pacific Ocean and, more specifically, to the seas bordering the Philippines: as commander of an American submarine you will have to face, since 1941, the entire immense Japanese fleet, actively contributing to its defeat. The strength of Silent Hunter 4 is represented by the new dynamic campaign, now enriched with new missions no longer reduced to just patrolling a specific sector for a certain period of time, but it will also be the player's task to take pictures of an enemy port, for the insertion of allied troops in a territory or to sink a specific ship, obviously without forgetting the special operations. The ~dynamic~ attribute indicates that your every action will lead to a consequence, positive or negative: failing an assigned mission you will not go into game over, but as happened in reality, this will negatively affect the success of future objectives; not sinking Japanese landing ships will (probably) lead to the conquest of an allied port, thus forcing you to have to choose a much more distant docking point, exposing you to the risk of running out of fuel prematurely (and crossing the ocean with electric motors is not just the best). Your behavior will be evaluated through the assignment of the classic Notoriety Points, obtainable by sinking enemy ships, completing objectives and rescuing allied crews left at the mercy of the waves: these points will then be invested to improve not only the technologies at your disposal (radar, sonar, baits and so on), but also your crew, enlisting more expert men or men with certain skills, all obviously taking care of historical fidelity: you will not be able to mount nuclear warheads, so to speak, and any upgrades will only be available when they are actually appeared on the historical scene. A small note of applause: the new dynamic campaign is decidedly more crowded than that of the previous chapter; the possibility of crossing convoys, of colliding with planes and of witnessing epic battles has considerably increased, to the delight of all of us submariners, thus reducing dead times to a few real minutes. Wasn't the important thing to be beautiful inside? Running the risk of being branded as superficial by fanatics of the genre (for whom only so many 2D writings would be enough), we mere mortals cannot fail to notice the excellent graphic rendering of this new chapter; especially Ubisoft artists have spent a long time making water as realistic as possible: in addition to having a transparency coefficient (you will be able to glimpse the keel of ships, for example), new algorithms have been implemented to create rippling and rippling waves effects; if you think it is a mere aesthetic aspect, you will have to think again, since the sea conditions will heavily influence the trajectory of your torpedoes, both negatively and positively: the positive aspect is that, with rough seas, the target will hardly be able to spot the wake of your ~coffee~, while the negative is that you will have to take into account a deviation from the original trajectory, depending on the direction of the wind (and that's what rippling on the waves is for). Don't start to worry: if you already have a big headache, it probably means that you will prefer to face the Japanese in a more arcade mode, where all these factors can be ignored. Tora this, damned Japanese! And if you have a powerful enough computer, don't hesitate to activate the three-dimensional rendering of the damage done to the ships (after the impact of torpedoes or cannon shots) and the mapping on the ships, which will give the boats a much more realistic look. From a particle point of view, the rendering of explosions and columns of smoke is decidedly satisfactory, although sometimes annoying glitches occur, especially in the thinnest decorative elements, such as wires or profiles of small boats, while we strongly advise you to keep the filter disabled it makes the game image like an ancient film, as it will make it impossible for you to correctly identify a ship even at a distance of only 500 meters (complicating your life considerably if you intend to face SH4 in realistic mode). The engine used by Ubisoft proves to be absolutely valid and does not present any type of excessively gross bug: even on not too powerful machines the framerate will be constant and its high configurability will allow you to ~shape~ it according to your personal needs, obviously at the expense din the final graphic quality. The importance of the Manual In spite of the new graphics and the rich dynamic campaign, the gameplay remains unchanged, which faithfully reproduces the mechanics of the previous chapter: if you play the game with a low level of realism, you won't have to worry about anything else but line up correctly with the target, fire and run away; needless to say, in these cases, Silent Hunter 4 is reduced almost to an action title, and you will miss much of the tension and thrill of the hunt. If played at a higher level of realism (starting from 40%), the new Ubisoft title brings out its best part: you will have to get to know not only your submarine in depth, with its characteristics and its times (you don't want to order a fast dive late?), but also enemy ships: a cruiser, for example, will have a much higher tack angle than a massive aircraft carrier and will therefore be able to perform evasive maneuvers even in the last moments. you will first play the role of the predatory feline, but you will quickly find yourself in the role of the little rat as soon as your presence is revealed The importance of the Manual Basically, Silent Hunter 4 can also become a complex simulator, elevating to the nth degree the elements to be taken into consideration even just to launch a torpedo, starting from the atmospheric conditions (such as the wind and the direction in which it blows), the speed and the direction of the target and the type of ship to attack (a Yamato is more resistant than a submarine). Isn't that enough for you? You can also choose how deep the torpedo travels, its speed and also its detonation method, whether by impact or magnetic contact: the former ensures a high probability of detonation, but if these occur on the side of the keel, they will be less powerful; on the contrary, magnetic detonations occur under the keel of the ship, doing such damage that, if you're lucky, a single torpedo will sink a warship, but you will have to run the risk of premature explosions, even too close to your submarine . All these elements, combined with the tension of the perennial incognito ~will they have caught me?~ transform the missions of Silent Hunter 4 into something rarely experienced in a video game: total immersion. The prophetic icing Basically, two categories of video games can be identified: those that involve you, which will remain installed on our hard drives for a long time, and those that simply amuse you. The prophetic icing As mentioned, Silent Hunter 4 involves, and a lot, first of all because it requires exaggerated attention to even the smallest details: you will have to carry out many small micro-management operations on your submarine, assign shifts to the crew so that they don't get tired and keep many elements are always under control, first of all the petrol and the oxygen reserve during the dive: being able to correctly construct the trajectory of a single torpedo is already something rich in pathos, but seeing it hit a successful target against a ship is absolutely exhilarating: an exaltation destined to disappear immediately, as soon as the cruisers start to ~ping~ you with their sonar: you will hear their propellers overhead, the depth charges and their dull bang, while your submarine will try desperate maneuvers evasive. It is, on closer inspection, the classic game of cat and mouse: you will first have to play the role of the predatory feline, having to sneak up on the target, find the right combination of elements to then hit it, but you will quickly find yourself in the shoes of the little rat as soon as your presence is revealed: and then you will have to hide using all the possible tricks and which are not written anywhere, but which you will be able to know only with experience. Involvement therefore: the best bonus to which all means of entertainment (videogames and films in primis) aspire. We must eat more phosphorus The Ubisoft guys have done an excellent job, not only for the aspects described so far, but also for the most important element in a simulated title: Artificial Intelligence. Although the algorithms of this were already well developed in the previous chapter, with Wolves of the Pacific the developers have made our enemies even more cunning: during your night attacks they will not hesitate to light up the sky with their flares, while the ports, both loved in SH3 because of their rich basin of immobile targets, they have become extremely risky, both for the anti-submarine vests and for the continuous patrols of enemy cruisers. The latter use somelikely maneuvers to hunt your submarine, and you will rarely find yourself facing an equal duel: much more often there will be at least three or four naval units chasing you at the same time and, even more frequently, you will also have to face the planes ( including the fearsome Zeros): this means that it will no longer be enough for you to enter a port, sink the sinkable and then flee in silent navigation; the farther you go from the rest of the allied fleet, the greater the number of enemy units (finding a Yamato in front of you will guarantee you immediate defeat) and the lower your chances of survival. It will therefore be up to you to decide how much to risk and, above all, how to do it. Conclusions In short, the perfect game? Maybe not, but without a doubt the best submarine simulator on the market and, at the same time, an extremely enjoyable title even for those who don't intend to commit themselves excessively: the defects are absolutely marginal and can be easily resolved with patches (please refer to the box for further information) and we can therefore assure you that, if you loved the third chapter, this Wolves of the Pacific is an absolutely obligatory purchase.Pros Excellent graphics Engaging guaranteed High malleability Cons Remains a submarine game Risk of long downtime Patch me the submarine In Day One, here's a nice surprise from the Romanian developers of Ubisoft: the release of the first patch that will update the software to version 1.1; this will not only improve some elements of the campaign, but will add new voices, better visual effects (especially for the waves), a new submarine and many other improvements, also to the main campaign. Do you want the complete list? Dive into our download section! System requirements Minimum Requirements: Processor: Pentium 4 2.0 GHz or AMD equivalent RAM: 1024 MB Video Card: Pixel Shader 2.0 compatible with 128 MB Disk Space: 6.0 GB Recommended Requirements: Processor: Pentium 4 3.0 GHz or AMD equivalent RAM: 2 GB Video Card: Pixel Shader 2.0 compatible with 256 MB Disk Space: 6.0 GB Test Configuration: Processor: Intel Core Duo E6700, 2.7 GHz RAM: 2 GB Video Card: NVIDIA 8800 GTX Introduction You can breathe a sigh of relief: Silent Hunter 4, in its final version, leaves the game mechanics of its predecessor unchanged, deviating only to make some welcome improvements. For those who missed this modern phoenix (reborn from the ashes of the terrifying Silent Hunter 2), the third chapter had also allowed those without a degree in mechanical engineering to play with a simulator, offering the user a considerable possibility of customization of the level of difficulty and realism, activating or deactivating a whole series of parameters. The Ubisoft studios in Romania have obviously adopted the philosophy of preserving as much as possible the old way, which had led to considerable commercial and critical success: if fans are already turning up their noses, we can reassure you that you will also find some pleasant novelty, not transforming this Wolves of the Pacific into a simple graphic restyling, but into a real game in its own right.", "date": "2007-03-26", "grade": null}