{"name": "The Sims PS2", "ref": "https://multiplayer.it/recensioni/the-sims-ps2.html", "text": "Sims or life before your eyes. Game Modes Let's briefly recall the purpose of the game: The Sims is a home life simulator. You have to take the place of your avatar and satisfy all his food, economic and psychological needs, convincing in community with all the other people who live in your PS2, deciding whether to respect the laws, looking for work and a sentimental partner. In short, everything you are called to do in your everyday life: simple, right? The first thing that is required is the construction of the character that you will guide for the rest of the game. An editor has been set up to choose physical connotations, skin color and basic clothing. Even the fundamental aspects of your character can be set from a book of available points, which you will have to distribute according to your aptitudes. The character affects during the game due to, as we will see, the ~free will~ option. We note a certain disappointment with regard to this editor: the interface, although quite immediate to assimilate, is not very rich in options, and it will not be easy for you to reconstruct a person who really looks like you. The PES editor is done much better so to speak! Once the editing session is over, you can start your ~adventure~. Saving your game in life mode then automatically unlocks the neighborhood mode while finally progressing through the objectives will unlock the multiplayer mode. Let's try to clarify these three possibilities: In life mode, take the place of a character and retrace the stages of his existence starting from the family home where you live with his mother. You'll have to learn how to do the housework and get the money to ... well run away! Find your own apartment and start being independent. From there your destiny will be defined, which can be that of an artist or a career worker, or even a thief if you prefer :-) The fundamental aspect of this modality is that, although no time limitations are imposed, your choices must still be functional to the achievement of objectives set by the game at the beginning of each level. To understand better, it is enough to know that until you have obtained the necessary money from your mother, you will not be able to move very far from home, so you are bound to the goal precisely. The neighborhood mode starts from a different point of view, as it forces you to think from the perspective of the community. Instead of guiding an avatar through a pre-built world, you decide how the world around you is made: how many and which houses there are, the neighborhood and the opportunities. You will then have to direct the behavior of all the people involved, and everything becomes much more chaotic, complicated, but also interesting. Finally, the two-player mode: you will have to challenge a friend in achieving particular objectives, based on the time available. It is a very interesting novelty, even if strange and sincerely not inclined to the philosophy of the game, which in our opinion has its strong point in the freedom of action, and therefore is addressed to the single user. The technical point The PS2 version has undergone a significant restyling from a technical point of view. The game environments have gone from isometric to real 3D, giving the player new freedom of rotation and zoom of the point of view, without losing definition. The objects are very varied and often animated, not inert (i.e. the television that broadcasts film images!) and above all they are truly numerous. The game menu allows a long series of operations: control of the speed of time (very welcome), switch between one character and another, setting the sequence of actions, which you can cancel if you change your mind, zoom and transparency of the walls. The basic needs of the player are identified by six energy bars to always keep under control. Through the menu you can also deactivate free will, which allows the characters not to accept some actions you set, and often create quite a few difficulties for you. The wealth of details makes it impossible for different players to play in the same way, there are truly infinite customization possibilities. The technical point Differences from the PC version The impression is that Sims PS2 constitutes the first chapter of a new saga in the series, because it introduces really important innovations in the gameplay. First of all, there are now the objectives to be pursued: the classic version had essentially no mission. From a graphic point of view, as mentioned, pure 3D is adopted, abandoning the old isometric framing. Finally, the a mode was introducedtwo players, an authentic revolution, which we still don't know if it will be successfully received by users. Conclusion The question is legitimate: does your avatar look like you? The natural inclinations will lead each player, however much he wants to indulge himself in doing bizarre things, to make decisions that reflect his personality, and therefore to translate his own life or what he would have liked it to be on the screen. It's a lot of fun to rediscover your own flaws and vices unintentionally exposed on the screen, and perhaps they will help you reflect more clearly on your own existence, or at least this is our bet. Sims is a product made with care and research for innovation, and in almost all its aspects it denotes the happy inspiration of the programmers. Longevity is undoubtedly its strong point, being virtually endless, but we naturally hope for a next version that supports online, and perhaps allows you to confront opponents on the PC. A classic for your playroom. The technical point Pros -New game modes -Great availability of gadgets -The first fully 3D chapter -Good control system with the joypad Cons -The character editor can be improved -High difficulty level for the beginner Sims or life before your eyes. Welcome to the world of The Sims. It's hard to think that someone doesn't know, at least by reputation, this title that has been a best-seller on PCs for years. Its long-awaited incarnation on consoles has always been postponed because it was not believed that it did not marry its market philosophy. Sims is in fact a game typically oriented towards updates and customization, and its latest incarnation has inevitably joined the online world. This PS2 version does not support online, contrary to what was assumed by the rumors on the net that preceded it. What we will try to verify is if it manages to rebuild the style of play and give away the same amount of options and gadgets as the original. Then choose your avatar (aka virtual alter-ego) and enter the Sims' house with us.", "date": "2004-07-23", "grade": null}