{"name": "Kirby & the Amazing Mirror", "ref": "https://multiplayer.it/recensioni/kirby-the-amazing-mirror.html", "text": "Kirby Fusion As already mentioned, the story of The Amazing Mirror is a mere pretext to throw the player into the action. Well, it's actually more of a pretext, given that it introduces the brand new play mechanics that characterize this new Kirby adventure. As has been said, in fact, the pink wad has been ~multiplied~ and together with his twins he will have to venture into the Land of Dreams to recover the fragments of the Mirror. And this means that while the player takes control of the original Kirby, the others will go about their business and it will even be possible to meet them again around the world. While we play, in fact, the other Kirbys are grappling with our own opponents and like us they will transform, they will be injured or they will be forced to start over from the beginning; the most bizarre thing is that the three Kirby-twins can be controlled by Artificial Intelligence during our solitary sessions, or manipulated by three other human players in possession of as many cartridges and consoles. This unprecedented and bizarre system of cooperation (or more precisely, of information exchange) leads us directly to the second, very particular novelty: the cell phone. In short, in 2004 even ten-year-olds get their mobile phones for their First Communion, why shouldn't Kirby have one?! And so, by pressing the back buttons, Kirby will be able to call his friends for help: he will be able to call them back to be brought back to the starting area or to have a hand in the most thorny situations, always keeping an eye on the phone battery. which if it downloads would render it totally useless. Curiously, if the other Kirbys will be led by human players, then the latter will even have to answer phone calls. In all of this, the most interesting element of The Amazing Mirror is the structure of the adventure, which seems to wink at those of the various more recent Metroids (Fusion and Zero Mission for Game Boy Advance, therefore): the Land of Dreams , in fact, is made up of several areas connected to each other, and the main ones are accessible, once unlocked, directly from the starting area, through magical mirror doors. The labyrinthine and a little too dispersive structure of the Land of Dreams implies an unprecedented use of Kirby's transformative abilities: while in the past the absorption of enemies to use their powers was a practice that left the time he found, after all, in The Amazing Mirror is required for the progression of the adventure. Put simply, certain obstacles can only be overcome by resorting to some particular powers, perhaps in the possession of enemies who are on the other side of the world. This new element incredibly increases the playful thickness and depth of The Amazing Mirror, but at the same time turns into its worst flaw, which forces the player to keep in mind the location of the dozens and dozens of enemies and their respective powers scattered around the world, in order to be able to recover them and therefore overcome obstacles, trying to reach the objective unscathed. Also due to the uncomfortable and confusing game map, this mechanic becomes heavy in the long run, turning more into an annoying routine than a series of fun Metroidian puzzles. On the other hand, the powers that Kirby can acquire in The Amazing Mirror are those seen and seen in the previous episodes (from the sword to the throwing axe, from the fiery breath to the cold one and so on), to which are added a couple new ones, and as in the past we tend to focus on using the best one, switching to others only when strictly necessary for the progression of the adventure, which fortunately still has the childish simplicity that has always characterized video games dedicated to the pink cloud. We Kirbys are so... Once again, this title dedicated to Kirby also excels in the technical field: the sprites are large, colorful and divinely animated, and the backdrops leave you amazed by the imagination and care with which they were made, even if those who played Nightmare in Dreamland he won't struggle to find a hair higher than the prequel settings. Kirby's technical quality, however, to amaze does not make use of particular special effects, except for Mode-7 in very sporadic cases, reconfirming once again that sobriety and simplicity are the winning weapons of a certain kind of products. Even in the sound field, we find the jingles and classic musical themes of the series, by no means monotonous and always pleasant, even if in some cases of rather low quality and in any case never noteworthy or particularly pressing. Simply, an audio department in megive. This new episode of Kirby is so original and innovative that, unfortunately, it turns out to be a hair disappointing. Mind you, the new Kirby is the game that all fans of the pink wad have wanted for a long time, difficult at the right point (certainly much more than the prequels which, sometimes, bordered on an almost offensive simplicity) and complex enough not to be completed in a few hours, with all the secrets it hides and the vastness of the playing area to explore, combined with the originality of the design that characterizes it. Probably, Nintendo will need to better reconcile the vaguely ~adventure~ structure used with the classic gameplay of Kirby, in the hope that it advances safely on this excellent path. The possibility of facing the adventure with three friends (or of challenging them to the inevitable, hilarious mini-games) is probably the most interesting aspect of the game, a pity that as usual it needs as many cartridges and consoles to be appreciated as it deserves. An excellent start, however, for a new path in Kirby's gaming life. Pros: A really welcome injection of originality Excellent balance between complexity and difficulty, finally Technically excellent Cons: Too dispersive To be truly appreciated, it needs three playmates In the long run monotonous The funny pink cloud created by Nintendo hasn't been seen much in the latest videogame generation: a fleeting appearance in Smash Bros. Melee DX at the launch of the GameCube, the bizarre but mediocre racing-game Kirby Air Ride also for the Nintendo home console, the 'artistically splendid but too simple and childish Kirby: Nightmare in Dreamland for Game Boy Advance. Yet, even Nintendo must miss the lively pink quick-change ball, because in the last year two games have been dedicated to it: in addition to the aforementioned Nightmare in Dreamland, Nintendo also gave birth to this Kirby & the Amazing Mirror. With a plot that is all a pretext (Kirby finds himself quadrupled due to the destruction of a magic mirror and together with his ~copies~ he will have to find its fragments), this new episode of Kirby is apparently very, too similar to its predecessor and to all prequels so far played and replayed. Apparently, though, because Nintendo knows better than the devil...", "date": "2004-07-19", "grade": null}