{"name": "La recensione di Thief: Deadly Shadows", "ref": "https://multiplayer.it/recensioni/la-recensione-di-thief-deadly-shadows.html", "text": "History of an evolution The Thief brand has always been linked to that of a great software house of the past: Looking Glass. Authors of some of the greatest PC masterpieces throughout the 90s of the last century, Looking Glass was closed a few years ago giving life to a real brain drain giving life, among other things, to Ion itself Storm Austin and Irrational Games. Starting from ~Ultima Underworld~, passing through the too ambitious Terranova and not forgetting the ~System Shock~ series, their origins were clear and evident in the two previous chapters of Thief, demonstrating themselves clearly to the most attentive enthusiasts as a real brand factory. The first Thief came out two months after the advent of Metal Gear Solid and offered the world its own vision of a ~true~ Stealth Game. First of all, only the first person was foreseen, the enemies were not simple puppets with intelligence close to zero and the huge areas of the game were explorable in an almost completely non-linear way. With the software house changed, will the new Thief be worthy of this passing of the baton? What was expected a few years ago as a simple atypical shooter - a sort of digression on the genre - and which was almost jokingly announced as a ~Simulation of Thieves~, today is remembered as the forerunner of a genre that lives in the shadows ( literally) of the acclaimed Tom Clancy's Splinter Cell. Although the two titles are on balance difficult to compare and above all prove to be complementary to each other, it is inevitable for the player (and for the reviewer) to seek affinities, points of contact and possible evolutions. Almost paradoxical to say, but where the title of the American novelist loses hands down is on the purely narrative front. The plot of Deadly Shadows is immediately suggestive and exciting, the game universe - a sort of even more gothic Steampunk - is well exploited and the figure of the anti-hero itself represents more than a pleasant diversion. The evolution of the plot is described both through the classic connecting FMV films and through game sequences designed to involve us even more in the events mentioned. The storytelling of the title makes use of many other refinements: the dialogues - to be eavesdropped behind a door or covered by the shadows of a column, the documents, the books and the glimpses of the apparently useless and specious diaries that we can read as we enter the game, manage to give us the idea of a deep and living world to discover and fear at the same time. But the Ion Storm designers didn't stop at the simple conception of a compelling story: the world of Deadly Shadows is tangible and not a simple background brought up to give a narrative context. Garret has a refuge in which to hide, he can leave his home and decide to undertake a certain mission or simply wander, dodging enemy guards and eyes, in the alleys of the city to rob passers-by, break into apartment doors and sell all the stolen goods to fences located in the most infamous neighborhoods of the city. With a view to making the game more varied, the concept of reputation was introduced. Depending on our actions throughout the game, we may or may not antagonize one of the two predominant factions in the city: the religious fanatical Hammerites or the technophobic Pagans. All this will not affect the main plot but will affect the exploration phase of the various districts of the city, depending on our relationship with the dominating faction we will be more or less facilitated in the exploration (and pickpocketing) of certain areas of the city. Happy return for all fans of the thrill: playing Deadly Shadows also means jumping out of your seat because of that cursed undead creature that suddenly gets behind us... Resource issue The hardware resources necessary to play decently are obviously high, but by lowering the level of detail a little and settling for a few shots every now and then, the title (which considering the rather reflective style of the game does not represent such a big handicap) is also playable with systems equipped with 1.5 Ghz processors, 256 Mb of RAM and a graphics card that natively supports Directx 9 and Pixel and Vertex Shaders (therefore from Radeon 8500/GeForce 3 Ti up). With a latest generation system, the title behaves very well even if not perfectly, however it makes us forget the poor speed performance of the more controversial ~Deus Ex: Invisible War~. Excluding all owners of Windows 9x operating systems from the games, ~Thief: Deadly Shadows~ is certified only for Windows 2000/Xp. Lights and Shadows Deadly Shadows boasts of profitszzo of a graphics engine developed starting from the already solid foundations of the Unreal Engine 3.x series and the Havok physics engine. According to the developers, the revision work - even compared to what was already seen in the second Deus Ex - was immense and we don't find it hard to believe it. The effects of light and shadow generation are the most sophisticated we've seen in recent months. If the skilful use of the light / dark games of the two Splinter Cells already has to bend in front of Deadly Shadows, some passages do not even make us regret the recent Far Cry benchmark. Deadly Shadows can boast of some of the most successful settings of the entire series... but also of the less successful ones. Lights and Shadows Sometimes we will regret having to sneak away in the deepest darkness or illuminated, at most, by the dim light of some street lamp, because the scenarios in which we will move will most of the time be suggestive to say the least. The architecture of the levels is quite fluctuating: Deadly Shadows can boast some of the most successful settings of the entire series... but also some less successful ones. The intensive use of HiRes textures complete with bump-mapping and the always fascinating scenographic applications of shadows is commendable. Always in this perspective it is almost impossible not to notice the drastic reduction in the size of the game levels. If in the first two Thiefs one could literally get lost in some scenarios, now even the less expert eyes will notice the subdivision of each level into at least two submaps (with consequent breaking of the game rhythm to load the new area) totally detached from each other 'other. While we are in one part of the map, time will literally stop in the other so that, for example, if we left the area while a basin was falling, once we return we will find the basin still in mid-air, a heavy blow to the suspension of disbelief. This technical limitation (due to the need to develop the game on consoles as well?) must have tied the hands of the level designers who, although they have always done an excellent job, have given life to scenarios where all too often the viable paths turn out to be obligatory and limited to the horizontal extension only with rather evident bottle necks near the obligatory passage points between one section and another. The noise of the night An area where the Thief saga has always stood out is certainly the sound one. The third chapter of the series does not betray its origins and offers us an audio system of certain excellence, once having a quality multi-channel sound card and a good set of speakers helps to improve the gaming experience by giving the sense of hearing new dignity in a world still too oriented towards graphic artifices. The high quality samplings, combined with the use of all the most recent technologies in the field of ambient sound mixing (see EAX HD  4.0) represent the state of the art and - it is precisely the case to say - many times pay attention to the sounds will prove to be fundamental for the purposes of the game mechanics: you can literally close your eyes, hold your breath and understand which direction a guard is coming from, also perceiving the distance. All the dialogues recited excellently, as usual the passers-by, the guards and all the NPCs we will meet will talk to each other, they will mutter due to the cold, they will start humming ... in short, they will seem even more alive. A life in the shadows If our audio system is exploited to the maximum levels (despite the substantial absence of a soundtrack), it is a pity instead for the scarce use of the physics engine: the interaction with the environment is rather poor, and even if from time to time we will be able to push some barrel down a flight of stairs, throw an object behind a guard to distract him or put out a candle (finally even with your hands, without necessarily having to waste a water arrow) placed on a table, we will hardly be able to move furniture and various furniture. The animations should be reviewed, especially when talking about ragdolls: once an enemy has been shot down, it will be a good thing to hide his body so as not to alarm any passers-by, thus loading the body on his shoulders and throwing it in a place that is not very isolated and not very visible. It is a pity that once released to the ground the bodies assume positions that are at times paradoxical to say the least. The absence of the very useful ~rope arrows~ replaced by unattractive climbing gloves is almost inexplicable, if only because we couldn't use them everywhere and, more generally, it makes some passages decidedly more one-way. The maps are very picturesque, especially the idea of having to independently obtain the maps of themansions to burgle - sometimes by buying them, other times by robbing them. Some might argue that once you have the maps, there is no longer any distinction between explored and unexplored areas, and that it is not even possible to write your own annotations on them. On the other hand, all this makes the exploration phase more difficult and likely. The AI management routines of the enemies, although not yet perfect, are among the most accurate that we have ever tested in this genre of games and beyond. The visual cone of the guards is perfectly reproduced, at the highest difficulty levels they will even be able to see our shadow, their hearing is very fine (a pity that they often don't notice the obvious creaking of the opening of the doors) and move an object too many or tripping over the body of a guard previously laid down by ourselves means alarming all the people in the vicinity. Unlike what happens in Splinter Cell, our enemies do not appear to be cheating, and do not head in a suspiciously omniscient way in our direction, but will first begin to identify the source of the alarm and then begin to literally blindly search the surrounding area. There were numerous touches of class, for example we happened to escape by climbing to get over a bookcase, the guard not having our same acrobatic skills limited himself to looking at us from below and warning us with a ~Sooner or later you'll have to get down from up there, and I'll be here waiting for you.~ In the same way, extinguishing the torches even from a distance but in the presence of an observer is equivalent to saying ~look, I'm here~, just as the unexpected absence of a man on guard can only make his patrol mate suspicious, who will become alarmed and will start looking for any intruders. The game situations are always varied and more than once we will be able to be surprised by the unexpected effect of our action. To spoil an otherwise idyllic picture, we regret to note that there are still all those typical idiosyncrasies of the genre which in one way or another make us remember we are in a video game: therefore it will happen that a guard does not notice us even if he is in front of us until he can smell our stinky breath, or he doesn't notice that arrow passed a few millimeters from his head. Sin. Crime and Punishment Although at least at the higher difficulty levels it is very difficult - if not impossible - the player can always decide to abandon the purely stealth style of play and embark on a real action of slow but inexorable killing of all hostile characters. This should not be seen as a distortion of the genre but as an additional game opportunity which, among other things, does not always make things easier. Garret is in fact still a thief with no armor and an arsenal purely oriented towards burglary: being faced with a well-dressed Hammerrita equipped with a hammer as big as it is lethal, with a simple dagger in hand, does not prove to be a sensible and intelligent thing: a few hits and we're dead. From ours there will be the usual tools of the trade: from the blinding bomb (which strangely blinds only the enemies and not us), to the lethal gas, up to our bow that can be used for sniping actions from a distance. The blackjack is inevitable with which we will be able to knock down enemies with a single sharp and decisive blow from the shoulders. The general balance of the weapons appears well studied, however, above all the more expert players and veterans could notice a relative uselessness of most of the various gadgets at our disposal which, when used, will be exploited more for the specific desire to try them than for a real need. On the other hand, this aspect also denotes further attention to the freedom of action given to the player in dealing with game situations. Finally, silent gait has been implemented correctly: now walking slowly will also cause less noise. Crime and Punishment Finally, silent gait has been implemented correctly: now walking slowly will also cause less noise. The picking method is also new: every time we have to tamper with a lock the game frame will change and we will have to gesture with the mouse in search of the right ~click~, after a little practice the system will prove to be all too simple, but the whole effect it is at least spectacular and plausible at the same time. Feared by many, the new possibility of playing in the third person is precisely a ~possibility~ and does not distort the game at all, indeed sometimes even the most purist among virtual thieves will not disdain this new mode. Often using the external view you", "date": "2004-07-14", "grade": null}