{"name": "Champions of Norrath: Realms of EverQuest", "ref": "https://multiplayer.it/recensioni/champions-of-norrath-realms-of-everquest-2.html", "text": "Leave the ax on the smooth plank Unlike the ~half-brother~ Dark Alliance 2, essentially a data disk that adds little or nothing to the prequel, Champions of Norrath presents a fair number of original elements capable of differentiating it from similar productions, obviously without distorting or revolutionizing a game mechanic which is, however, based on solid principles. The Snowblind Studios title opens with a brief introduction designed to insert the user in the very banal storyline that forms the background to the action, and then lead him to the classic character selection screen. There are five classes from which to choose your digital alter ego (warrior, ranger, cleric, wizard and dark elf), customizable in the basic aspects of gender, skin color and hair style and pigment. It is important to underline how the differences between the various classes are remarkably marked: we pass from the extreme brute force/poor magical skills of the warrior to the antipodes of the magician, passing through three ~medium~ classes which in any case offer a significantly different approach to the game. A very important variety, both from a multiplayer perspective (online and not), and above all considering the relative brevity of the main adventure, compensated in this case also by an above average replay value. As mentioned, the actual game scheme does not present any revolutionary innovations, making the approach to Champions of Norrath decidedly immediate for anyone with a minimum of familiarity with the genre. The substance is the same: it is a question of going through various scenarios and dungeons by breaking down the numerous hordes of enemies using short and long-range weapons and magic, recovering money and objects from corpses and chests, and completing the quests that hand by hand are entrusted to the user. In short, those who have never loved action-rpg will not change their mind thanks to the Snowblind Studios title, but, conversely, fans of the genre will not fail to find bread for their teeth in Champions of Norrath. Compared to Baldur's Gate: Dark Alliance, you can find better management of the inventory and the leveling-up process, made clearer and more immediate by a skill selection system vaguely similar to that seen in Final Fantasy X. For the rest , we are witnessing a general series of filings, rather than real innovations of the game scheme. Party of four We now come to the most tantalizing aspect of Champions of Norrath, namely the implementation of multiplayer game modes. The most obvious and simple is the use of the multitap to allow up to a maximum of four users to tackle the adventure: the system is flexible, allowing one or more players to take part in the action at any time, loading their own character from the memory card or creating a new one on the fly. However, sharing the same screen brings a series of limitations (such as the presence of an inevitably greater number of indicators) combined with a general climate of confusion; these elements which obviously disappear in the online mode of Champions of Norrath, which does not even lose in terms of interactivity between users thanks to the support of the headset. Exciting from a purely playful point of view, the online structure of the Snowblind Studios title disappoints as regards the technical management of online games. Particularly annoying are the total absence of game-specific lobbies and search parameters, not to mention the almost total lack of information relating to the game in which you intend to take part. Even the saving system of one's online progress turns out to be conceptually abstruse, forcing the user to have to dedicate two distinct spaces relating to their adventures alone or in company. In short, much better could have been done from a strictly logistical point of view: of course, with a little patience anyone can be able to bring their character online, but it is indisputable how the lack of an adequate technical structure weighs on the judgment overview of the work done by Snowblind Studios. A field instead of Champions of Norrath in which it is really difficult to mount criticisms is the strictly audiovisual one. Graphically we find ourselves with extensive and detailed scenarios (although not stylistically exciting), covered with excellent definition textures and embellished with top quality light effects, without obviously forgetting the always impressive rippling routines of the water mirrors. Also noteworthy are the polygonal models of the characters on the screen, almost debased by the bird's eye view which does not always allow us to analyze their impressive creation. Also on fsound noise nothing to say: the musical accompaniment, although not excessively varied, performs its duty in an exemplary manner, as well as all the various effects, which effectively convey the violence that the user unloads on his monstrous victims. Comment Champions of Norrath is certainly the best exponent of the action-rpg genre currently available on consoles, although the victim of a repetitiveness inherent in the game scheme based on the Snowblind Studios title and amplified by the growing presence of similar products on the market. Characterized by excellent graphics, capable of reaching peaks of absolute excellence several times, and by a sound sector absolutely up to par, Champions of Norrath disappoints a bit in what should have been its greatest strength, namely the implementation of the online game: not so much for the playful experience itself, unquestionably satisfying and fun, but rather for the lack of accessibility and convenience relating to the management of online games. That said, Snowblind Studios' product still remains a must for leveling-up enthusiasts, while all the others would do better to carefully weigh the particular characteristics of the genre before a possible purchase. Pros: Excellent technical realization Solid game structure Apt multiplayer mode Cons: Inevitably repetitive gameplay Problems in managing online matches Storyline and uninspired scenarios After having tickled the palate of critics and the public with the excellent Baldur's Gate: Dark Alliance, the young and talented Snowblind Studios team then abandoned the publisher Interplay to pass under the protective wing of Sony Online Entertainment, with the task of creating a new action rpg. And a few months after the release of the lackluster Dark Alliance sequel by Black Isle, here comes Champions of Norrath, the ideal continuation of the first Snowblind Studios title but above all the bearer of a tasty feature anticipated by the name of the manufacturer of the product : the online game.", "date": "2004-07-04", "grade": null}