{"name": "Firefighter FD 18", "ref": "https://multiplayer.it/recensioni/firefighter-fd-18.html", "text": "Never ever say casualties! FFD18 is an action game with a rather simple concept, but which at the same time manages to be very original thanks to a realization that comes out of the usual canons imposed by this type of game, in which the use of weapons prevails almost exclusively fire and cutting. The alter ego that we will play is a fireman named Dean McGregor, who will find himself armed only with an ax and a water pump to achieve his only goal: to save all the civilians trapped in the fire. All we have to do then is to use these two weapons to put out fires and to free the passage of any obstacles that prevent us from reaching the victims of the fire, but above all we will have to avoid a lot of dangers. However, FFD18 is not limited to action alone, our exploits are surrounded by a cinematic plot that will answer questions such as: what lies behind McGregor's past? Who is the cause of all these fires? From an ~ideas~ point of view, therefore, FFD18 presents itself in the eyes of the gamer as an interesting and promising title, and fortunately many of the expectations will not be disappointed, although it is not a game without flaws. Help me! I'm suffocating! The control system is rather simple and immediate, and closely resembles the one used for First Person Shooters (even if this is in the third person): the left stick is used to move the character in various directions, while the right one is used to look around; with the R1 key, instead, a jet of water is fired with the hydrant (or the hatchet and other objects are used) and while shooting, we can direct the spray with the right stick and move with the left one. The other function keys will allow us to perform other moves such as crouching, making small dodges, changing the type of water jet and calling a friend of ours to help us momentarily in the most difficult situations (help is limited though). If all this turns out to be excessively complicated, we will have the opportunity to choose two other types of slightly simplified controls for beginners, and also a tutorial at the beginning of the game will explain the main controls. As I have already mentioned before, the game mainly consists of rescuing civilians trapped in flames, so you will have to follow the indication on the radar and reach them as quickly as possible, before their energy reaches zero. Using the hydrant and the axe, you will have to put out the flames and destroy obstacles (such as crates or barrels) to create a safe path that allows you to reach your goal without suffering excessive damage. Obviously, however, things are not as easy as they seem, in fact you will have to be very careful to avoid the many dangers that constantly threaten every single movement: electric wires that get in the way, collapsing ceilings, collapsing floors, explosions and above all the bosses of end of level! You got it right, even a game like this has the notorious ~end-of-level monsters~, flames possessed by evil whose only purpose is to hinder you. As far as playability is concerned, FFD18 is at excellent levels: the character is controlled in a very simple and intuitive way, furthermore the game structure makes your gaming experience extremely fun and real. What needs to be pointed out is that the tone of the game is rather calm: McGregor's movements are slow, just as it is slow to put out the flames. If any of you are looking for frenetic action, you better look elsewhere because FFD18 almost faithfully simulates the action of a firefighter fighting a fire, so you will have to stop often to keep the flames at bay. This has a lot of impact on longevity, in fact the initial fun fades away after a few hours of play to lead to boredom due to the monotony and slowness of the game action; if we then add the fact that it takes only 7 hours to complete and that the replay value is almost nil due to the scarce presence of additional elements, we can well say that this is a real defect that negatively affects the overall value of this title. Fire, fire, fire! The technical realization is quite commendable, especially as regards the graphics and sound effects. The textures are well done and detailed, even if by definition we are far from the best achievements on Ps2; the various graphic effects, including flames and explosions, are realistic and are accompanied by sound effects that perfectly recreate the real ones, such as the sound of water, the cries of civilians, radio communications, the noise of walls that break, the cracklingof fire. The music most of the time has a slight orchestral epic tone, which tends to highlight our heroic deeds, and then transforms into more disturbing melodies in situations of greater danger such as boss fights. No merit as regards the cinematographic part of the game which, both as a story and as a dubbing, does not stand out for its originality, spectacularity and technique. <i>Comment</i> FFD18 is a very particular gameno shooting, no sword strikes, no kung fu strikesnothing at all, so it has to be seen and judged from a different angle. For what its concept is, this title has a lot to offer to those who love the world of firefighters, while it may not satisfy all the rest of gamers. Furthermore, considering the low longevity, it remains the classic game to be rented on the weekend, which can be finished in a couple of days and which you will hardly want to pick up again. Pros: High level of realism Suspenseful atmosphere Good gameplay Cons: Short life Monotonous A few months ago Konami announced the release of a rather singular title, a game dedicated to one of the most dangerous professions out there, but at the same time very fascinating the firefighter. I must say that the news immediately left me perplexed as I could not quite get a concrete idea that would allow me to understand how such a game would be developed. Effectively, the valid games that have seen firefighters as protagonists can be counted on the fingers of one hand, and FFD18, from this point of view, brings a breath of fresh air into the gaming world. Let's see in order what this new Konami title has to offer us.", "date": "2004-06-21", "grade": null}