{"name": "Joint Operations: Typhoon Rising", "ref": "https://multiplayer.it/recensioni/joint-operations-typhoon-rising-2.html", "text": "The typhoon has arrived. In such a game, the plot is a rather useless tinsel, so we limit ourselves to describing the background that is the backdrop to our actions. Indonesia is in turmoil and the rebels have wreaked havoc in the region, so a joint force of international troops (uhm... sounds like something these days) is being deployed to restore order and peace to the country. Naturally, as we have learned well by now, this does not happen and the peace process goes through a long series of wars. Here, then, are the two opposing sides: Allied Forces and Rebels. Naturally, each of them will proclaim themselves as the savior while the opponents will be the devil to be eradicated. In short, everything is in order. The UN forces have the task of rooting out and fighting the terrorists, who reap countless victims among civilians, the rebels, on the other hand, proclaim the independence of their region which for far too long has passed through foreign and too greedy hands. The full-bodied manual describes this situation well, presenting the propaganda leaflets of both factions, and we alone will decide who we like more. Other than that, the ~plot~ ends there. Stop. Allied forces come from seven different countries: U.S.A. (and when ever?), U.K., Germany, France, Russia, Australia and, of course, Indonesia. And not Italy? I must confess that this fact irritates me a bit, on the other hand it is a game, which Italians have less than Germans and French? Anyway, coming back to us, we will therefore find S.E.A.L.., Delta Force, S.A.S., Spetsnaz and other assorted troops. The rebels, on the other hand, are dirty and poor and cannot afford too many uniforms so, recycling here and saving money there, they have raised an army of separatists and ex-military men. In short, the usual two opposing ideological classics. But apart from this, once we have chosen how we want to dress, we can decide the class to which we belong, which do not differ much from the standard canons of the genre. We will find the medic, the private, the sniper, the engineer and so on. Everyone will be able to carry more or less heavy weapons, combined with a minimum assortment of equipment. The range of weapons available to players is very wide and includes all sorts of sniper rifles, hand grenades, grenades, mines, assault rifles, pistols, mortars and rocket launchers, not to mention electronic gadgetry such as the target pointer. Obviously we are talking about real weapons, ranging from the classic AK74 to the more sophisticated M4 with grenade launcher. As far as vehicles are concerned, there are an enormous number of them, no less than twenty-one, between allied vehicles and rebels' gimmicks. We can travel comfortably contained by the seat of a Chinook, or rocked on the edge of a bamboo pagoda. There are means of sea, land and air and you can be sure that you will find the means capable of taking your troops wherever they want to go. [C] From this screen we can choose how to dress... wow, she creates fashion better than Barbie! On board a helicopter the show is; stupendous. With a little of good will; it is It is also possible to make a dinghy walk on the sand. [/C] Joint operations. We come to the most interesting part of the article: the gameplay. The type of game is now known, it doesn't take a degree in suppository engineering to understand that Joint Ops (for friends) wants to present itself as an evolution of Battlefield: Vietnam, on the contrary ... it wants to be everything its competitor has not been. Here too we find classes, vehicles and jungles, here too the maps are very large, but this time the amount of players that can be hosted by the servers is enormous, we are talking about more than 100 players (even 150, but it is still unknown if these servers will be paid or not)! But let's start from the beginning, let's see what this game is made of. Graphically we are not dealing with a masterpiece, but we know well that netgamers do not want graphics but substance, the netgamer par excellence is the one who lowers the detail of UT2k4 to zero to have fluidity, a netgamer who lingers to look at the beauty of the environment is a dead netgamer. Thus, the 3D engine of Joint Ops is a solid engine, which can handle the open spaces and the large number of models, soldiers and vehicles, the dynamic lighting and a good amount of textures and polygons, but it cannot compete with that - to name one - of Far Cry. The beaches are there, the vegetation as well, but forget the glitter and reflections of the water. We are at war, not in an art gallery! The game modes are quite standard and, perhaps, there is a lack of some innovation in this regard. In addition to the useless Team Deathmatch and Team King Of The Hill, which can be considered as a surrogated to train a bit, we find the Co-op and Advance And Secure modes. In Co-op each team will have objectives to complete, neither more nor less than what happened playing Assault with UT. Advance And Secure, on the other hand, offers what is the heart of the whole game: the fight for conquest. In A&S mode, each team will have to conquer the enemy's bases, taking care to defend their own, advancing towards the enemy stronghold. To conquer a base it is necessary to control its area for a certain period of time, which will be the lesser the greater the number of soldiers of the same team present. This means that a team of four will control a base faster than a lone player and this is a great way to encourage team play, which is too often lacking on servers. Final comment Joint Operations is another small masterpiece in the field of netgaming, the bloodiest, most hardcore one, where there is no room for compromises but only for courage, commitment and lots and lots of goodwill. Let's face it, this is not a game for everyone, it takes a lot of patience to learn how to survive on the battlefield and not look like a classic Quaker in a world populated by green berets. Apart from this, the sense of involvement and that of the team reach very high peaks, in this Novalogic production, and once you get used to the initial difficulty, the game becomes like a drug, because it no longer wants to leave our bloodstreams. to flow away and leave us alone. This doesn't mean that the game is perfect, because the graphics engine sometimes shows some uncertainty and because the game modes could have been more, but in the end it's about details, the usual hair in the egg. What matters is that you have fun with this product. The quantity of means of transport, the possibility of being able to hover on a Black Hawk, with the sun on the horizon, and being able to infiltrate behind enemy lines, to raid and strike from above, to coordinate the attack with the pilot skills, to land on the ground and get out quickly before some rockets explode the cockpit, to go back to the base when it's already dark and be able to rest before the new action, are the things that are at the heart of the whole game . Once you enter this order of ideas, you never get out. Joint Operations is this: the netgamer's passion that finds its current and most successful incarnation. PROS: Very tactical Great variety of media Fun multiplayer CONS: Difficult Those who don't play online won't appreciate it The news Joint Ops introduces some interesting innovations while also offering a very precise and balanced gameplay balancing. The biggest news are two: the commander screen and the day cycle. The commander screen is a convenient interface through which to give orders and assign objectives to your team. Something very similar was present in Tribes2, but nobody remembers it. The possibility of having a leader who coordinates the action, or even many leaders for small groups, increases the strategic potential available in the field. Playing alone doesn't pay, to win you need to coordinate with the team, obey orders and complete the assigned objectives. Rambo doesn't exist, Rambo is dead meat, here in Indonesia. The second novelty, very pleasant I must say, is that day becomes night and night becomes day. Imagine fighting on a tropical island, with a beautiful sunset warming your butt and showing you what is hidden behind the thick foliage. Imagine, now, that slowly the sunset gets darker until the night takes over, leaving you immersed in a dark and hostile jungle, where you can't see an inch from your nose. The passage of time is not just an aesthetic tinsel, however welcome, but a real tactical state variable. The soldier who finds himself passing from evening to night must necessarily adapt his approach to the battlefield. It's not in the name of realism that this thing was done, but it's certainly a very pleasant novelty. As far as gameplay balance is concerned, the game is very tactical (more than BF: Vietnam to understand) and the role of vehicles has been reduced to simple means of movement, losing the offensive potential typical of other titles. It is understood that if you end up under the wheels of a wagon you will remain dry, eliminating a vehicle is easier and a foot soldier armed with a rocket launcher is enough to reduce it to a pile of smoking metal, while it is absolutely not possible to drive and shoot together. So, forget the raids aboard vehicles where you can drive and machine gun at the same timeare with a nice M60. Oh this does not mean that the vehicles are not equipped with weapons, but simply that those who will take care of the guide will not be able to pull the trigger and vice versa. Furthermore, the scoring will also take into account the skill of the driver of the vehicle, in fact the pilot of a vehicle earns points if his passengers kill enemies, but loses them if they die while they are still on board. Joint Ops enhances the concept of teamwork in every second of the game! We have said that to conquer a control point (or base) it is necessary to dominate it for a certain time and that this time is inversely proportional to the number of players of the same team present. For this reason, then, we will be able to say goodbye to those boring midges that, by themselves, launched themselves to occupy isolated positions, buzzing between one base and another. To conquer, you need an army, not just one man. Obviously, the tactical depth is affected and, once again, the gameplay travels in the direction of team play. We can well say that the border between the game and the real battlefield has thinned a lot. Novaworld raises its voice. The servers of Novaworld, the Novalogic network dedicated to netgaming, are enriched with a new title for the delight of online war enthusiasts: Joint Operations. Here we are talking about big numbers, servers with more than 100 players, very long games and endless matches. After the Delta Force series, Novalogic undermines the leadership of the Battlefield brand with a title that closely resembles its characteristics, themes and gameplay. If in Battlefield: Vietnam the fight has moved to the Korean jungle and in the middle of the 60s, with Joint Ops we won't go too far, because we will find ourselves fighting in the Indonesian archipelago, but we will be far away in time, however, as we will fight in the days ours, with all the paraphernalia that goes with it. Let us see, therefore, that the first differences emerge. Although the type of game is almost the same, on the one hand Electronic Arts offers a scenario set in the past and on the other Novalogic offers modern weapons and modern vehicles. Apart from this, however, the scenario is almost identical: tropical forests, jungle, rivers and the sea, in short, the classic Southeast Asian setting. But we are not here to make a comparison between the two titles, what interests us is to see how this new Joint Operations: Typhoon Rising is.", "date": "2004-06-21", "grade": null}