{"name": "Galleon", "ref": "https://multiplayer.it/recensioni/galleon_a.html", "text": "If I ever lose my faith in you Set in a fictional world and in the age of great sea battles, Galleon tells the story of a brave and charming captain named Rhama Sabrier. Called by an old sea dog who came to discover who knows what mystery and attracted by the smell of adventure, our brave hero will bring his sailing ship and his crew in front of the prosperous lands of an archipelago as wonderful as it is cryptic. From here begins a rather obvious story but capable of capturing the player thanks to the protagonists themselves, who will be able to give emotions by virtue of a marked characterization. There will logically also be a gentle damsel who, always logically, will trigger the spark of love at first sight with Rhama. A story 'presumably' of love but also full of intrigue will therefore be the background to the thousand vicissitudes of the spotless captain, amusing and encouraging the player to delve into the discovery of a world that in many cases exudes magic. All seasoned with inevitable sarcasm and that subtle English irony that never hurts. Here is the captain As mentioned, exploration in Galleon will play an almost fundamental role. The game environments will offer, in addition to terrestrial backgrounds to be dissected even at embarrassing heights, also immense marine locations in which to immerse yourself. In this sense, the underwater section draws heavily on the king of the sea abyss, none other than that Ecco the Dolphin who so amazed at the time of the Dreamcast. Rhama, once immersed in the marine cavities, will be able to juggle the waters with the same ease as the famous dolphin, changing speed according to the circumstances. The result, needless to say, is excellent. Aye aye captain! The first jokes with Galleon bring to mind that first, unparalleled episode of the successful Tomb Raider series; Toby Gard's hand is felt in every detail proposed in the game. We soon realize that Gard & partners wanted to go far beyond the reminiscence of an old glory. This fruit of years and years of development is a rather canonical adventure, focused on the exploration of vast environments and the 'step by step' resolution of puzzles of all kinds mostly connected to the investigations proposed in the various quests. In this regard the coders have studied an ingenious system from elementary principles. All the clues of the investigation will be displayed on the screen, which will begin to flash progressively in parallel with Rhama's approach to one of these. A sort of small fire-fire-fire, to be clear, drawing on the games that were once played between snack companions. The first surprises will occur in conjunction with the first movements imposed on the character, with a considerably over the top and avant-garde control system precisely for some found of sure interest. Basically the eye of the needle lies in the possibility of moving the camera and character with the same analog stick, rotating the first with horizontal movements of the lever and the second using the vertical axis. The player will therefore not move the character, but will rotate the camera and then direct it towards the pre-set point. This feature releases the player from any burden of resetting the chamber, which in this way will always be behind Rhama. It will also give absolute freedom to the right analog stick, which will act as an intuitive real-time menu. Our period alter ego will be able to make use of a certainly large set of moves that will never leave any type of situation 'uncovered'. We will have to measure the pressure on the stick to accelerate and decelerate the pace, a fundamental question in order not to risk falling from narrow spaces. If by proceeding at a slow pace we will never run into unwelcome tumbles, by running we will gradually pick up speed influencing our jumping ability. Most of the obstacles will see the protagonist react autonomously and automatically, and this will lead the player to focus on the really challenging things. The extreme ease in performing any type of action is astounding; the same climbs and runs on the walls will be anything but difficult to accomplish. Basically the eye of the needle lies in the possibility of moving the camera and character with the same analog stick Whoever finds a friend finds a friend During the game you will have the opportunity to bring along some travel companions, getting help both for solving specially designed puzzles and by exploiting their specific peculiarities in your favor. The first to help us will be Faith, the beautiful and fragile redhead with whom the feeling with the protagonist will be felt right from the start. Its marked healing qualities will come in handy in more than one circumstanceanza, obviously when he will be together with us. The first 'two' puzzle will see the buxom girl grappling with four levers and pressed by Rhama, who will show her which one to pull in order to move certain trolleys on which our captain will then have to jump. The idea is ineluctably the daughter of the wonderful ICO concept, but it is equally true that it is a pleasant addition to an already rich game of its own. Strengthened by a level design with attention to the smallest details and full of secrets everywhere, relevant accents are also placed in Galleon for what concerns the combat system. In the course of our (mis)adventures we will therefore have the opportunity to beat our hands, and how if we will. With fists or armed with a sword - in sporadic cases even with a pistol - we will be able to face the enemies following very specific procedures. Confounding Factor has made extensive efforts in studying the fights of its creature, smoothing out the edges and looking for the necessary compromises. Basically thanks to combos displayed even during the clashes we will be able to face numerous hordes of enemies. Holding the sword we will fight in the name of the classic foil of the time, while unarmed we will adopt a sort of attitude not too distant from martial arts. For the pistol it is a different matter, precisely due to the characteristic of the firearms of the time that could carry only one shot in the barrel. It will also be possible to grab enemies and then throw them down a ravine, or by triggering a sort of bowling effect. Confounding Factor has made extensive efforts to study its creature's fights The most fluctuating part of the game is certainly the technical realization, certainly subdued in some respects. Galleon undoubtedly enjoys an original style, and the character design is just the tip of the iceberg. Even the animations - as splendid as the facial expressions - help to validate a title full of charm. Unfortunately the settings do not have the same detail as the main characters, denoting serious shortcomings both in terms of polygons and in the quality / variety of textures. Also absent is any form of shadow, save for a few exceptions in which the now old-fashioned stamp appears under the character. The light effects are few but welcome. A few sporadic glitches of frame rate and clipping close this not too edifying review of evaluations. Sound instead which makes use of an above average dubbing and a musical sector without infamy and without praise. Total absence of localization in Italian. Comment During the trial we took out the scales and, giving the right weight to each pro and con of the case, we observed how it hung inexorably towards a more than positive judgment. Sure, a few more polygons would have been useful, just as the gameplay would have benefited from the total absence of bugs. But on balance you find a pearl in your hands, a game pampered by whoever produced it and to love. A bet won, that's what Galleon is. This Confounding Factor title is yet another proof that the right ideas, if implemented properly, always have the winning game over any type of adversity. Because of ideas, new or adopted, Galleon is full of them. This does nothing but elevate it, in the company of Beyond Good & Evil, to the top of the best adventure productions on Xbox. A game with a vibrant atmosphere and that pioneering spirit, now in disuse, which distinguished the older console generations. For lovers of the genre it is an almost obligatory purchase; while a test pad in hand is advisable for all those who do not disdain a good adventure, but who also want to see the green-marked machine fully exploited. Pros: Great level design. Many new and assimilated solutions in a rich and deep gameplay. A fascinating world to explore with very inspiring characters. Some graphic gems... Cons: ... unfortunately in a somewhat poor context. No trace of Italian translation. The heart. The heart understood not as the primary muscle of the human body, but as that anachronistic expressive and figurative form effigy of moral strength. Having heart, that kind of heart, is the foundation of all success. Easy to say. Now, this short message, so similar to one of those thoughts found in chocolates, is not meant to be a life lesson, but more simply to introduce a game built on the basis of sound principles with which we inaugurated this article. That long-awaited Galleon - we are talking about 5 years old - and which is now preparing to thicken the shelves of every store, would not have had the opportunity to see the light if it hadn't been for the tenacity and willpower of its creators . Led by Toby Gard, creator of Tomb Raider and father of the famous Lara Croft, the Confounding Factor have really been through a lot in recent years. How do you say? The important thing is the final result. Theory only partially valid; because in the long waiting period Galleon has seen the hype around it diminish, gripped in recent times by a technical gap that is too onerous for the palates of graphics-addicted players. Luckily, the time has finally come to play. No more movies and screenshots, no more story not too dissimilar to a noir novel by Confounding Factor. The curtain opens. Play.", "date": "2004-06-18", "grade": null}