{"name": "Scrabble", "ref": "https://multiplayer.it/recensioni/scrabble_a.html", "text": "speaking Who has never played Scrabble? Of course, that board game in which one to four people can challenge each other to compose the greatest number of words on a grid using randomly drawn tiles. Already converted several times into video game form with little success, Scrabble was finally chosen by EA as a title for mobile phones, with a move that proved to be at least spot on. Everything is like in the original board game, including scores, bonus boxes and the ability to change letters if necessary: the only small note that can be made in Scrabble lies in the limitation of word control, limited to seven characters : any composition that exceeds this quantity is therefore not checked by the game. However, the EA production deserves applause especially for the excellent compatibility of the title with mobile support: playing Scrabble on mobile phones is simple and fast, thanks to an extremely functional control system and a clear and complete interface. the board occupies most of the screen, while on the lower side you can see your set of tiles and on the upper side the scores of the two players take position. And precisely with regard to the type of user Scrabble is striking for its completeness: in fact, it is possible to play both alone and against the CPU, or by challenging a friend in the Pass and Play mode, in which - quite simply - you take turns on the same device. A series of apparently obvious elements, but which have rarely been implemented so well and which in Scrabble stand out particularly given the peculiar play structure. The game works so well on mobile phones that it really seems to have been born on the same support: composing and crossing words proves to be an excellent pastime that finds its rightful place on a mobile phone display. Furthermore, the apt auto-save function preserves the pick and play character of the product, seen and considered as when you exit the application the game in progress is recorded and can be resumed at any time. Small details that put together contribute to making Scrabble a surprisingly pleasant and engaging experience, a rare fact for a vidual conversion of a board-game. The roundup closes with a clean cosmetics characterized by a sober and elegant color palette, while the sound is limited to some minor effects. PRO * Fun and addictive * Excellent board-game conversion * Clean and functional interface AGAINST * Almost no sound * Missing a 4 player option", "date": "2007-01-28", "grade": "S.V."}