{"name": "Smash Court Tennis Pro Tournament 2", "ref": "https://multiplayer.it/recensioni/smash-court-tennis-pro-tournament-2.html", "text": "Precision, what passion The last born in the Namco house presents itself to the tennis-hungry PS2 user with a strong roster of highly respected players. In fact, it is possible to take to the field with digital reproductions of some of the best athletes in the world at the moment: the list includes Lleyton Hewitt, Marat Safin, Tim Henman, Andy Roddick, Juan Carlos Ferrero, Tommy Haas, James Blake and Richard Gasquet as for the little men, and Daniela Hantuchova, Jennifer Capriati, Serena Williams, Lindsay Davenport, Justine Henin-Hardenne, Amelie Mauresmo, Anna Kournikova and Kim Clijsters representing the female universe. All apparently very nice, just a pity that the first approach to the actual game is not the best: the entry of the tennis players on the field immediately catches the eye the uninspiring quality of the polygonal models, as well as the often poor (and at sometimes absolutely nothing) resemblance of the latter with the flesh and blood counterparts. In reality, the Namco product cosmetics in general hardly manage to impress: the animations of the athletes are discreet but sometimes too disconnected from each other, the various playing fields are not surprising for the level of detail and even the more accessory aspects, such as the realization of the audience in the stands or the quality of the replays, appear very little compared to what is seen in similar titles. Passing over these non-fundamental elements, let's move on to the actual game: as mentioned, Smash Court Tennis Pro Tournament 2 adopts a rather simulative approach, which requires much more practice than more arcade products such as Virtua Tennis or Top Spin. In this sense, the complete Tutorial mode proves to be a real panacea to get into the particular perspective of the game as soon as possible. Indeed, in the Namco title a lot of emphasis is placed on the timing and precision of the shots: therefore it is not enough to run towards the ball and press a button to ensure the rebound, but it is necessary to quantify the position of one's own player well and above all the moment in which to deliver the own attack. Whether it's at serve or in the middle of a rally, hitting the ball at exactly the right time results in a more powerful, accurate lunge that's less susceptible to going out of bounds. And yes, because in Smash Court Tennis Pro Tournament 2 outs are not at all uncommon. And if on the one hand this is undoubtedly a realistic aspect, on the other it does not fail to generate frustration, also given the excessive sensitivity of the control system; it is not always easy to give a precise direction to one's strokes, especially as regards the lines, the management of which leaves many perplexities. Simulation foul But the doubts about the Smash Court Tennis Pro Tournament 2 game system don't end there: the implementation of the running shot appears cumbersome, often making it impracticable; the two cameras available prove to be not very functional and not always able to provide the user with precise indications on the depth and height of the shots; finally, the AI of the opponents lacks balance, with tennis players controlled by the CPU capable of being fooled by non-irresistible lunges and then making miraculous recoveries on apparently elusive balls. However, it must be said that so far only the most negative aspects of the gameplay of the Namco title have been listed, all in all also appreciable: the shots made available to the player are varied and mostly easy to assimilate, and the general trend of the various matches is more reminiscent of close to actual tennis, although this has partly come at the expense of overall enjoyment. As for the game modes, Smash Court Tennis Pro Tournament 2 features the classic Arcade and Exhibition sections, plus the Challenge features (i.e. the ability to try your hand at various training mini-games in order to beat the relevant records) and Pro Tour. The latter is none other than the Career mode of the Namco title, which however has some -questionable- peculiarities. First of all, your player is defined by a series of statistics that you can increase by spending the experience points received as a result of successfully completed tournaments and training sessions: interesting at first, this element soon tends to become monotonous and boring, considering that you are forced to view the upgrade screen at the end of each match. The approach to the various tournaments is also perplexing: in essence, the game completely simulates the progress of a set (thus deciding the score arbitrarily), then proposing from time to time a so-called ~turning point~: the user buys here the control of the action for a game, which is forced to win by satisfying certain objectives(for example, performing a certain percentage of perfect shots or not leaving the opponent even a point) to ensure that the next scoring simulation turns in your favor. Although it allows you to speed up the progress of the tournaments, this system soon turns out to be not only conceptually ridiculous, but also rather frustrating and not very exciting. Fortunately, one option also allows you to play tournaments in the classic way. Comment Smash Court Tennis Pro Tournament 2 isn't a bad game, but rather it proves quite naive about some gameplay choices. The more simulative approach to the discipline is fine, but only if it also manages to entertain and satisfy the player, which in the Namco title does not happen in the right amount. Frustrating for some playful choices and almost ridiculous for others (above all the notorious Pro Tour Mode), Smash Court Tennis Pro Tournament 2 does not fully convince even with regard to the technical sector, characterized by a barely discreet cosmetics and a hateful sound accompaniment for as regards the music and not always spot on in terms of effects. Virtua Tennis and Top Spin can therefore sleep peacefully, while the same cannot be said of PS2 users, still waiting for a good tennis title exclusively for their console Pros: More simulative approach Considerable list of selectable tennis players Tutorial mode well done Cons: Often frustrating Subdued technical section Pro Tour mode lame Video games dedicated to tennis have roughly always been the result of interpretations of the aforementioned sporting discipline, rather than actual digital transpositions. In fact, there are two schools of thought relating to this genre: the first and most followed believes that an arcade setting is able to provide more panache to the action at the expense of realism (see the excellent Virtua Tennis and Top Spin), while the secondly, he finds a simulative approach more appropriate, less immediate but closer to real tennis. Rather surprisingly, considering the previous ones, this Smash Court Tennis Pro Tournament 2 fits right into the latter category.", "date": "2004-06-17", "grade": null}