{"name": "Orcs & Elves", "ref": "https://multiplayer.it/recensioni/orcs-elves.html", "text": "Dungeon crawlers Orcs and Elves takes its cue from the gameplay of absolute classics such as Ultima Underworld or Eye of the Beholder, which on PCs in the early nineties marked the climax of the dungeon crawler genre, i.e. titles focused on the exploration of labyrinths populated by monsters of all kinds, puzzles and various treasures. A playful typology that has gradually disappeared, and which Orcs and Elves intends to revive on the most unexpected platform. In reality, the Id product mainly amazes precisely because it features a control system and an excellent technical realization, in general going against the trend with many other exponents of the mobile sector who are lacking in graphic complexity or ease of use. As we said at the beginning, Orcs and Elves is framed from a first person view, with the weapon held by the protagonist (in the best RPG tradition there are swords, axes, sticks, etc.) and the functional HUD in full view. The cosmetics are qualitatively reminiscent of the titles mentioned at the beginning, with the obvious limitations dictated by the different devices: in general, however, Orcs and Elves can boast fairly well-made sprites (albeit with very limited animations) and above all smooth scrolling like the oil that makes progress in the adventure extremely fluid. The player moves inside the dungeon with a ~block~ system: in essence, moving forward or backward one moves by one unit (or block, in fact), while by pressing one of the side buttons one can move the gaze by ninety degrees, without forgetting the possibility of making a classic strafe. A solution that is only apparently cumbersome, but which in the end proves to be decidedly spot on and functional. Also because, contrary to Ultima Underworld and company, Orcs and Elves intelligently proposes a turn-based combat system, in which therefore dexterity in movement has no value. Everything is very simple and intuitive: once you come face to face with an enemy, you press a key to launch a blow and thus start the duel, with the opponent who in the immediately following moment can produce himself in an attack . Faithfully to the canons of tradition, the Id product tolerates both white weapons and magic as offensive tools, which are progressively unlocked during the adventure. But the substance of Orcs and Elves certainly does not stop there: the title is literally full of gold pieces, chests and objects of all kinds to collect, as well as some puzzles based on runes that intervene to break the conventional rhythm of the game . Again, there are numerous non-player characters to talk to, who can demonstrate friendly intentions (for example by offering to trade with the user) or not, helping to keep the attention alive. The only weak point of Orcs and Elves lies in its longevity, which due to obvious technical limitations could not be extended to the levels of the old PC dungeon crawlers. Either way, the handful of hours needed to complete the adventure is definitely quality time... PRO * Deep and immersive * Excellent technical realization * Functional control system and HUD AGAINST * Much more complex than many other mobile games * Not everyone may like it", "date": "2007-01-28", "grade": "S.V."}