{"name": "Toca Race Driver 2", "ref": "https://multiplayer.it/recensioni/toca-race-driver-7.html", "text": "Ryan where 6? The story is less relevant than in the previous game but offers some memorable moments and a series of characters that seem to be taken directly from a forgettable film with an automotive background: that ~Days of Thunder~ in which we find a young Tom Cruise aspiring driver in the Nascar championship. All in all, some sketches turn out to be fun and break the monotony between one competition and another. Tell me what car you want and I'll tell you who you are... The main novelty is that of racing in the various championships with different vehicles: in practice for each event (lasting an average of three races) you race with a type of vehicle that is totally different from the previous one, forcing a continuous change of driving style. As the game progresses, the most diverse competitions will be faced: from Formula Ford races (cars similar to formula 1 but without spoilers) through Off-road vehicles, Pickups, Nascar, vintage and Rally cars (Colin McRae style), of trucks and so on, obviously not forgetting the V8 cars that race in the Toca races. In all we have about forty vehicles that satisfy every palate but we sincerely hoped for something more; in fact, many races are single-brand and the models differ only in the liveries or body colors (which are quite varied in any case). an annoying off-piste Physics is not an opinion... The engine that manages the damage of each car is simply phenomenal: each car is damaged in a realistic way, not only on an aesthetic level but also physically, focusing on five fundamental parameters: steering, gears, suspension, wheels and engine. Based on the severity of the damage, the indicators will vary in color accompanied by a decline in performance that will often make the difference between a first position and defeat. When you reach red the car will become an undriveable wreck that will 90% lead you to restart the race. An example is given by doing a head-on against a wall: the car deforms by crushing the nose and losing wheels, windows, body parts and everything we find on the outside. Each vehicle present has its mass and its own peculiarities and the difference between a truck and a Nascar car is clearly felt. However, it must be said that the idea of racing every few races with different cars may be interesting, but it turns out to be quite frustrating at times because it forces you to replay the same competitions many times before mastering the used racing car decently. The controls respond well to our commands, even when using the keyboard. Obviously a flyer (perhaps professional) is strongly recommended also because the problems of the first Toca related to these peripherals have been solved. For the toughest players it is also possible to use the clutch! But who gave you the license? The artificial intelligence behaves decently, with the best drivers who practically never make mistakes and the medium-low ones, who sometimes promote slightly risky overtaking attempts but who still commit sporadic mistakes and accidents, offering that extra challenge in races that in some cases could be monotonous (such as those at Nascar). Unfortunately, there is a sore point that undermines playability: given the lack of slipstream effect, you often come to take advantage of the enemy train in situations such as curves or some chicanes, which you can shamelessly cut, managing to overtake even six opponents in one go and , which is far more serious, without receiving any kind of penalty. Truly an unforgivable oversight, even if the idea is created that this is intentional because in almost all the tracks we can take advantage of these ~shortcuts~ (just look at tracks such as Laguna Seca or Nurburgring). In total we have a set of 48 tracks that also include rally and off-road tracks. The audience (reflected) on the hood In past press releases, Codemasters boasted of having created graphics never seen on a PC and in fact one cannot blame them: the thing that immediately catches the eye is the creation of the cars. These are faithful counterparts of the real ones and all enjoy an exceptional visual rendering with reflections in real time, lighting effects and excellent realization of the particulars of each one (such as the automatic spoiler of the Ford GT 90 which rises by itself) . However, two things collide with these marvels: the bad realization of the driver, who looks like a mannequin placed there at random (he barely moves his arms or even his head!) and of the wheels when turning, which also move at shots making the view of the car unnatural in the external views (four, of which one misses a more distant rear). As far as the tracks are concerned, we find ourselves in an at least curious situation: if anyand leave you speechless due to the abundance of details (such as the sun reflected on the asphalt) and the absence of clipping, while others seem to have been taken from the first Toca in the first Playstation version; parallelepipeds that would like to be buildings, low-resolution outline textures, poor details (such as the audience in cardboard silhouettes). The same goes for the rain effect: it's nice to run on a wet track but the falling drops are done just as well as the water raised by the wheels. Mention instead for the introduction of animated clouds (actually bitmaps that move), which approach as in reality when you run on a long straight road. Obviously all this good things require an adequate system: on a Pentium 4 2.4 Ghz with GeForce 4 T4200 128 and 512 Mega of Ram the game behaved more than well, with Anti-aliasing 3x and Anisotropic 2x shooting only sporadically in replay. Unfortunately the latter cannot be saved and offer only one ~television~ view combined with the four already present. WROOM! SCREECH!CRASH!! The sound is another flagship for this production: every type of vehicle (racing car, truck, off-road vehicle, etc.) is equipped with a faithful virtual counterpart of the audio produced. Accidents and minor effects (such as skidding, braking, ambient audio) do their job well thanks also to the implementation of Creative's EAX 4.0 (and here if you have a SoundBlaster Audigy you're set) which with a 5.1 system completely immerse you in 'action. Nothing to report for the music, present only in the game menus. I want to run with you For multiplayer Codemasters relies on the proven Gamespy. Despite the low number of servers available (for now) the games take place without particular hitches, provided you have an ADSL connection. The fact of being able to compete with the most disparate vehicles increases the desire to experience every type of race. These are widely configurable in every parameter and the challenges (especially with multiple opponents) are the maximum expression of a carefully simulated race. An accident that is too serious involves elimination and correct driving is essential, even if it is possible to launch into car carnage (provided you have activated the damages otherwise you will race with incorporeal ghost cars). The split-screen is also well done to play immediately in two split-screen: you can also put your opponents and the fluidity remains all without having to compromise. [C] seems taken from Colin McRae notice the shadows and the sun on the asphalt [/C] Final comment Toca Race Driver 2 is a good driving game that brings a breath of fresh air to our screens but also a series of new shortcomings that don't allow it to fully reach the top. The desire to offer many things all together has led Codemasters to underestimate some secondary but not expendable aspects. The fluctuating graphics and ~dirty~ maneuvers damage a respectable package and the short duration of the championships in the career mode does not allow you to fully enjoy each vehicle. The multiplayer mode is fun, which in addition to increasing the discrete longevity is able to offer driving skill challenges but also bumper-car races to the death Pros: Innovative simulation Great variety of races good number of cars and tracks Cons: Fluctuating model graphics driving at times frustrating some poorly cared for aspects Return of the story... Toca 2 is just the latest progenitor of a saga that began years ago on PCs and consoles, which last year returned in a big way with an innovative formula for driving games: a story mode that put us in the shoes of a driver cool kid intent on climbing the world of racing. Taking advantage of the mistakes made with the first version and the experience accumulated over the years, the programmers offer us a totally renewed game and once again able to offer something more than the mass. After installation we find ourselves in a rather meager initial menu that allows us to decide between career mode or the simulator. As for the first, it is about facing a series of events connected to each other by pre-rendered videos in which we will be the protagonists. In fact we will no longer impersonate Ryan (the cool pilot of the first Toca), but we will experience the plot in first person, with the characters who will address us directly. The simulator, on the other hand, provides for playing in Free Race, championship, Time Trial, and Multiplayer (Lan, TCP/IP or even with split-screen in two). Among the options offered we note the possibility of making various settings on the desired car but incredibly these are not available in career mode. A deliberate choice but piutunhappy for those who hoped to be able to increase the chances of winning with a careful evaluation of the parameters.", "date": "2004-05-29", "grade": null}