{"name": "SSX Blur - Recensione", "ref": "https://multiplayer.it/recensioni/ssx-blur-recensione.html", "text": "Blurred snow SSX Blur, this is the name of the episode in question, is a fortunately all-new chapter of the popular EA Big series. For the few who do not know SSX, suffice it to know that it is basically a highly spectacular approach to the world of snowboarding, with a series of competitions spiced up with jumps and tricks far beyond human limits, evolutions of all kinds on slopes full of trampolines, ramps, handrails and so on. The game structure has not been changed for this debut on Wii, but in return the programmers have thought of creating a control system from scratch, not a simple adaptation of the pre-existing one but rather designed and created around the combination wiimote + nunchuk. So here in SSX Blur we find ourselves pressing very few keys, rather than performing a whole series of movements with the controller in hand; for example, tilting the nunchuk to the right or left by rotating the wrist will affect the direction of your snowboarder, thus delegating the analog stick only to assuming the crouched position to obtain greater speed. Instead, giving a sharp blow to the nunchuk upwards will obtain a jump, essential for maximizing the duration of the flights when passing on the ramps. And it is precisely during the flights that it is necessary to give the best of one's acrobatic skills, trying to make the most spectacular evolutions possible to earn points and increase the uberrick bar. Also in this case the use of the keys has been almost completely abandoned, with the wiimote delegated to the task: tilting it in any direction will lead the athlete to rotate towards it, thus allowing you to create spectacular combinations in a rather simple and effective way and to which you can add grabs by pressing Z on the nunchuck. The A or B keys are used instead to interrupt the trick in progress, a fundamental step both to be able to land standing up and to be able to hook other evolutions. However, the sore points come when we talk about ubertricks, which as the name suggests are even more extreme tricks that can only be achieved with the appropriate completely full bar. In order to activate them, the programmers have decided to adopt a solution also in this case based on the capabilities of the Wii controller; in summary, during the flight a ~figure~ will appear, which can be a simple zeta or a more complex curvilinear, to be reproduced exactly with the wiimote pointed at the TV and with the simultaneous pressing of the A button. An original idea but one that clashes with an excessive demand for precision by the game; the result is a frustrating series of attempts destined to fail, with some lucky parentheses dictated more by chance than by the actual ability of the user. A pity this is anything but venial given the importance of the ubertricks within the economy of SSX, and which partially compromises the goodness of a control system that is undoubtedly not immediate or perfect, but which in its other aspects proves to be appreciable and intriguing at the very least. Although, it must be said, on this occasion as in other titles released for the Wii, the adoption of the Wiimote rather than the classic pad has led to a general increase in the difficulty and complexity of the control system, in stark antithesis with the philosophy of game that Nintendo has always put in the foreground next to its console. Looking for the ski lift The mountains available in SSX Blur are 3 in all, literally filled with competitions of a different nature, so as to provide overall a great longevity to the EA production. Factor, the latter, also increased by the good multiplayer and the huge amount of material to unlock, such as characters, clothes, tricks, boards and skis (that's right, there are also skis this time) and so on. Too bad only for the frequent and not too short loading screens that break up the continuity of the action, but it's not very difficult to get used to it. The technical aspect can count on support for 480p and 16:9, which results in rather clean and detailed graphics, which can be placed side by side for lovers of comparisons with the best productions for Ps2; excellent animations and good textures are undoubtedly the strong points of the package, pity only for the occasional drops in frame rate. The artistic style, which has always been extremely important in the franchise in question, has this time taken a step back towards the Tricky chapter, thus moving away slightly from the realistic vein of the third chapter. In SSX Blur there is certainly no shortage of colors, with pastel shades and lights galore, and the character design is slightly deformed and cartoonish enough to ideally bring the game closer to the console it is running on. The sound, as has become the tradition of the brand, is based on an excellent selection of indie-rock genre songs accompanied by a talkative (English) DJ ready to have his say often and willingly even on the player's performance. The effects are also very good, especially as regards the passage of the board on the snow. Comment SSX Blur is a very interesting game, which fails the promotion with flying colors only due to a brave but slightly too complex and poorly balanced control system. If the initial bewilderment in the face of the high level of gestures required can be easily and happily overcome with a little practice, the exaggerated difficulty in creating the uberricks takes away much of the spectacularity that has always characterized the series. That said, more patient gamers and longtime SSX fans can no doubt go without fail; Blur, despite its flaws, is an important first step in the right direction in the use of the Wiimote, as well as a valid new episode of the EA Big series which, with the necessary corrections, could certainly find its ideal location in the Nintent console . Pros Usual great SSX Intriguing control system Good graphics Cons Sometimes frustrating Ubertricks too hard to make Wiimote aside, nothing new After having tasted the novelty of the Wiimote, the new Nintendo console is now facing the classic litmus test that many have seen as a key point to verify its real chances of long-term success. We are obviously referring to the adaptability of the controller to classic game patterns, and consequently to the ability of third-party developers to know how to exploit the advantages without forcing, trying to recreate experiences that, as far as possible, do not make us regret the traditional pad. The debut of the SSX series on Wii in this sense constitutes an ideal title to verify all these situations: it represents a new version of an already well-known brand, and was produced by one of the largest video game developers in the world, Electronic Arts. So what will be the result?", "date": "2007-03-23", "grade": null}