{"name": "The Suffering", "ref": "https://multiplayer.it/recensioni/the-suffering-3.html", "text": "The great escape Right from the start, the product developed by Surreal Software does its utmost to set new standards for the disorder, but without ever really going as far as Konami managed to do with the famous Silent Hill saga. TS's is an exquisitely Western approach, based entirely on the visceral power of images. Dirty and flickering titles, scourged by demonic subliminal frames, act as a link to the main mode and some extras, obviously in keeping with the general spirit. The canonical ~making of~ is accompanied by a much more unusual movie, the overview of the real locations that inspired the game environments: dilapidated prisons. And it is in a filthy prison that the adventure begins, in the opening cut-scene we get to know the hero (so to speak) of the moment, Torque, escorted to his uncomfortable niche. The plot is not the most serene, in fact the guy in question bears very heavy accusations, the killing of his own family. This pleasant element quickly clarifies the nature of the script written by Surreal, deliberately bad and immoral, in order to impersonate the player in a not necessarily positive alter ego without too many pleasantries. In fact, the protagonist hides a dormant and uncontrollable nature, which will explode during the game giving him inhuman powers, in the best tradition of US comics (see Hulk). Our handsome convict will soon realize that the bars and his not very reassuring cellmates will be the least of his problems, especially when the penitentiary will be populated by repugnant creatures, and very little will be worth the resistance of the guards. From here on the adventure will be an ordeal of violence and blood with a side dish of exposed entrails and aberrant visions. The beginning is disorienting, apocalyptic but not harmful, just to get the player used to the controls, which are not exactly very practical. We won't be engaged in battle immediately, but we will move between disemboweled corpses and rivers of tomatoes, glimpsing figures in the shadows and desperate cries, but without ever having the slightest idea of what's going on. One thing is certain, all hell has broken loose in the prison and only one thought makes its way into Torque's mind, escape. [C] Hey... How's it going? Comfort first! [/C] Can you survive the absolute horror? As mentioned, the commands do not stand out in practicality due to a bizarre choice on the part of the programmers: at any time it is possible to switch from a third-person view to a first-person view. If this represents a custom in the genre, it is not the fact that the two shots have equal priorities, but very different playful approaches and needs. If in the external view the title looks a lot like an adventure, with the subjective it turns into an FPS, leaving the player rather inadequate to manage the situation. In fact, it is impossible to perform all the required actions without using both shots. Hand-to-hand combat / firearms impose the subjective to correctly aim at the opponents, where the actions of ingenuity and exploration make the external one essential. All this would also be positive if the controls proved to be of an equally ambivalent nature, but in fact they are linked to a console FPS approach, with the left analog stick delegated to the direction and the right to the movements. The result is an excessive cumbersomeness in the third person view, as already said absolutely prohibitive in conjunction with collective clashes, which are not at all rare. To increase the dose contributes the questionable technical realization of the subjective, completely devoid of the typical ~stride effect~ of the character, which makes the unpleasant sensation of moving on rails and also the animation of the weapons is well below the average levels. The natural consequence of this gameplay choice is that the player will continuously switch between the two modes, getting lost between them without reaping all the benefits. Fortunately, the confusion is partly mitigated by the curiosity to discover the surprises hidden by the programmers, which are certainly not few and at least visually pleasing. We have already mentioned the high rate of violence that characterizes the work, which explodes without too many scruples in moments of unusual sadism. Blood really flows everywhere and doesn't even spare the protagonist, often smeared up to his feet. The presence of disturbing elements is high (if not only for the setting), well highlighted by the flashbacks that grip Torque about his exterminated family, and the monstrous subliminal images. TS is a title that knows how to play well on the player's nerves even if certain situations present such marked excesses as tointo the grotesque: between cruel executions, Nazi experiments and other wicked atrocities, the game presents itself as a slightly senseless sample of horrors, but adequately morbid and macabre to offer ideas to fans of the genre. Xbox vs PS2 The Suffering is available for both Xbox and PS2, but as in other titles designed for multiplatform, it is the Microsoft console that emerges victorious from the comparison: much better framerate, albeit subject to declines, and a more marked general definition. The differences aren't as stark as in other titles we've tested, but they're noticeable nonetheless. The walls... They come out of the fucking walls! The character design is taken care of by a true authority, that Stan Winston who gave life to the unforgettable Predator, not a little mentioned in the sinister noises emitted by the creatures. In terms of originality, we were puzzled by the visual depiction of ~simple infantry~, who seem to be related to Soul Edge's Namchian Voldo. On the other hand, their attack patterns are unpredictable due to their arachno-anthropomorphic nature, and seeing them climb walls and ceilings and then pounce on the player makes the situations very funny. Torque has many ways to defend itself, largely increasingly powerful and threatening firearms, in the tradition of the best FPS, but as anticipated at the beginning of the review, it is possible to make use of an extremely lethal additional power. After filling a special energy bar, our hero will turn into a gigantic and monstrous creature, equipped with blades instead of arms, and with the worst intentions! In this mode, the apotheosis of chaos is reached, with limbs flying like peanuts and endless waves of plasma. Admittedly, it's fun to whip up anything in the vicinity in the frenzy of omnipotence, but this status only works for a limited time. The choice is not exclusively functional to the scenic effect, as in the advanced game there will be no lack of challenging clashes in full favor of the opponents, needless to underline how a careful use of this feature is equivalent to the proverbial smart bomb of a shooter. The problems unfortunately reside elsewhere, not limited to the control of the protagonist, but to a general monotony of the gameplay, too anchored to a development that seems to take greater account of the blazing rather than reasoned action. The uninspired level design does the rest, past the charm of moving inside a menacing penitentiary, the game turns dangerously in on itself, crushed by somewhat repetitive environments, interspersed with endless corridors and open-air sections which, however, do not rebalance the situation. Interaction with NPCs is completely absent, limited to the support of some survivors to find the escape route and little else. The player is left with nothing but to shoot like a madman, juggling the controls and solving one-off puzzles that are never too challenging. To underline the excellent localization of the game in Italian, which greatly helps the growth of the atmosphere on the bones and skin of those who venture into The Suffering. Comment The Suffering is the first attempt to merge a survival horror and a fps, but it remains inextricably linked to dynamics that almost always put the blasting action before the mental one. Lovers of the genre will certainly find reasons of interest, especially for the numerous heart-pounding finds and a violence that is sometimes hilarious in its excesses. Except not expecting a new icon in the genre, the game has its moments by virtue of the rather successful atmosphere, but suffers from a somewhat flat level design and a general monotony of the settings. The hybrid nature conferred by the two shots does not achieve the desired effects, even if it represents a commendable effort on the part of the programmers. All in all, an enjoyable title, but our expectations have been partially betrayed. Even before it hit stores, The Suffering had already earned a reputation as the most violent and bloodthirsty title of this generation. Today the final in our possession certainly does not disappoint expectations in this sense. Mutilations and red blood cells are the real protagonists of the Acclaim title, contributing to a new, exaggerated praise of digital ultraviolence. Welcome to Hell. Welcome to The Suffering.", "date": "2004-05-19", "grade": null}