{"name": "Mafia: City of Lost Heaven", "ref": "https://multiplayer.it/recensioni/mafia-city-of-lost-heaven.html", "text": "What do I tell you to do? Hey did you say something? Are you talking to me? Smamma if you don't want trouble!~. Distinguished gentlemen, always perfectly dressed, who speak like longshoremen, who use their hands rather than their tongues, and who are respected and feared by everyone, including the police. Who are we talking about? Men of honor and Italian-American mafia gangs, which, unfortunately, have made Italy famous throughout the world (the old Italy-pizza-mandolin-mafia association is still valid). The Take Two game, developed by Illusion Software, brings us into contact with these very subjects in 1930s America, in an invented city called Lost Heaven. Our character, named Tommy Angelo, after having helped don Salieri's ~good guys~, will see his life as a simple and quiet taxi driver change and he will find himself involved in a war between rival gangs. Along the approximately 20 missions we will have to earn the esteem of the boss, first as drivers and then as real men of action. Mafia, for about 60% of the game, will in fact see us engaged on board many different cars, all well recreated and characterized by a good dynamic model, which differs slightly from car to car. In addition to hurtling at the limit of 60 Mph (yes it's not a joke, remember that we are in the 30s) we will play the rest of the title on foot, fully armed and the game will turn into a third-person action with the camera behind Tommy, but adjustable at will. The objectives will be the most varied: collect the ~pizzo~, do the dirty work, burning the cars, compete in the racetracks, make the party to the rival gangsters always pursuing the interests of the ~family~. What stands out most is the incredible atmosphere which, although full of hackneyed clichs, manages to capture the player, thanks also to a very Hollywood cut, and to transport him into that world, full of terror but also of respect. The comparison with GTA holds, but only up to a certain point, given that in Mafia we will move freely in a city, not exactly pulsating with life, but still quite active, following the orders of our boss, without however being able to distract ourselves from our main objective, by completing sub quests or alternative missions. Therefore the cinematic part of Mafia prevails and the linearity that does not allow for exceptions to the script. Pure and simple violence is not enough, therefore, to associate two products that are quite different from each other, not only in terms of setting, but also in terms of setting choices. Therefore the cinematic part of Mafia prevails and the linearity that does not allow for exceptions to the script. What do I tell you to do? The missions in the car are well done and will allow us to unlock new vehicles, faithful reconstructions of the real counterparts of the 1930s, which we can then use in the Free Ride mode for the city of Liberty City and in the Race mode. In addition to this, we will be able to read all the information necessary to know our vehicle in the autopedia, a sort of encyclopedia on the vehicles available in the game. Driving through the city, we will also always have to be careful not to attract too much attention, not to commit infractions, not to cause accidents: the police, even if corrupt, do not forgive and after a few fines we will be arrested with consequent failure of the mission. You are just talk and badge Up to this point, one can only be satisfied with Mafia: a good setting, a somewhat stereotyped but interesting story, certainly engaging gameplay. However, the technical part of the Illusion Software title cannot escape our analysis. In the preamble the hope of a good conversion transpired, given the hardware structures of the Xbox and Personal Computer, but unfortunately this operation did not succeed as expected and the final product, even if better than the one for the Sony hardware, is however not all 'height of the original PC title. The whole technical sector is subdued: aliasing is definitely present, the polygonal models are particularly woody, the visual horizon is not very wide and pop-up phenomena are unfortunately very frequent. Furthermore, the A.I. some non-player characters leave something to be desired, and it's not difficult to see a citizen who, after being run over, gets back up like nothing happened, or to see opposing gangsters waiting motionless instead of emptying the magazines of their pistols on us. The firefights are also frustrating due to an imperfect setting of the collisions, so you risk being hit even if hidden behind a wall and it is certainly not the best way to leave the pens. On Personal Computer, you were in a densely populated city full of ddetails, in a nutshell alive, of which there is almost no trace left in the Xbox version. Not everything is so below average, the driving model, for example, is well managed and functional, able to give a good idea of what driving those cars must have been like (far from airbags and intelligent suspensions!) . The game engine, although therefore insufficient, from an aesthetic point of view, is fluid and stable in every situation and the loads, although present and a little annoying, are decidedly fast. Finally, going back to talking about cinematic impact, the true workhorse of this title, we cannot overlook the dubbing, totally in Italian, very good and capable of giving more than one emotion and, perhaps, even a few laughs. Comment The Illusion Software title is capable of giving several hours, about a dozen, of fun, but only if you are able to go beyond the mere technical aspect of this product. The involvement is remarkable, as is the setting, the problem is the bitterness that leaves in the mouth the thought of what could have been a conversion worthy of the original. The vote, at the end of our exam, can only be modest, but we still invite you to try the game which is presented not only as an alternative to the GTA Double Pack, albeit with the differences we have listed, but also as an original adventure. Too bad, it could have been a flawless conversion. Pros: Great atmosphere Good driving model Excellent voice acting Cons: Subdued technical realization Not overly long-lived Not up to par with the PC original In 2002 Take Two released Mafia on PC, a controversial, atmospheric game that, in the vein of Rockstar Games' Grand Theft Auto, brought a breath of fresh ideas to the world of personal computers. GTA was undoubtedly the game's inspiration, but not the real yardstick for Mafia, as the Rockstar title was still a solid Sony console exclusive. After two years and various accolades won in the PC world, the Illusion Softworks game arrives at Microsoft, after having made its rather problematic debut on the console planet in the PlayStation 2 version. Transforming a title from PC to Xbox, given the similarity of the hardware architecture, is undoubtedly a simpler undertaking and it only remained to find out if the outcome would have been better. Are we finally facing a conversion that does justice to the origins of this excellent title or another bitter disappointment of our expectations? Read our review to the end and you will know the answer.", "date": "2004-05-05", "grade": null}