{"name": "Flipnic", "ref": "https://multiplayer.it/recensioni/flipnic.html", "text": "[***data incomplete: game card or image number missing***] My cousin made a hundred billion points with a token Flipnic presents itself as an alternative vision to the conventional video game transpositions of pinball machines. In fact, if the vast majority of the aforementioned titles did nothing but convey on the screen a game mechanic as faithful as possible to real cabinets, in Flipnic this does not happen. Indeed, the SCEI developers have taken advantage of the potential of the means at their disposal to create a series of situations that are often very far from the common definition of pinball. In Flipnic, in fact, the player must launch the proverbial silver balls within scenarios that could hardly find a place in reality: we therefore have very intricate ramps, buffers with the strangest features, bonuses and hallucinated mini-games, gold coins to collect, and a plethora of garish lights and indicators. The four main tables available in Flipnic (if the multi-level scenarios of which the game is composed can be defined as such) are distinguished by an unusual characterization: the first follows a naturist-tropical theme, the second sports a metallic look, the the third is based almost exclusively on plays of light and transparency, and the fourth is more like an Arkanoid clone than a pinball table. In short, the SCEI product certainly does not lack originality, also considering the extension and complexity of the game settings: each scenario, in fact, boasts various branches towards which it is possible to send the ball to reach totally different areas including bonuses whose activation allows you to unlock new items in other sections of the ~table~. ~Leave it, I'll show you how to do it~ On the originality of Flipnic, therefore, nothing to complain about. However, the knots come to a head once other aspects of the SCEI title have been examined. Despite trying hard not to look like one, Flipnic is still a pinball machine. And therefore, to all those who do not find the path of a silver ball on a game table particularly fascinating (that is, the vast majority of modern gamers), Flipnic manages to offer very little. Sure, there are the mini-games, the bonus sections, the suggestive camera changes. But the substance remains the same, that is to use levers to launch the ball and prevent it from falling. In short, also considering the lack of significant prizes reserved for the completion of each single part of the scenarios, playing Flipnic proves to be an impromptu and unattractive fight against the record. This unfortunate situation could have been avoided with the inclusion of a series of interesting secondary modes, which unfortunately does not happen in Flipnic: the sections dedicated to the battles with the bosses at the end of the level (?) turn out to be very approximate, while the four games themes dedicated to challenges for two users show a very low level of fun. Also worth mentioning is the absolute inadequacy of the sound accompaniment, especially as regards the music, shrill, obsessively repetitive and far from being catchy; the tracks prove to be so annoying as to induce the user to delete them after a couple of game sessions. That said, let's be clear: for all pinball lovers, the SCEI title can be an excellent and refreshing entertainment, thanks to the already mentioned structural advantages. But at the same time, Flipnic fails to meet the needs of today's users and market, revealing itself as a hopelessly niche product. [***data incomplete: game card or image number missing***] Comment Although the attempt to renew a decidedly static genre such as that of pinball video games is absolutely commendable, Flipnic is not fully convincing about its real playful potential. In the face of an interesting graphic design, very original in the settings and contents of the various tables, the SCEI title manifests a whole series of intrinsic limits to the category to which it belongs. Despite the extension and complexity of the game scenarios, the presence of various mini-games, battles with bosses at the end of the level and a two-player mode (the latter two very unexciting elements), Flipnic turns out to be a rather boring title and devoid of bite, characterized by a game mechanics too simplistic and monotonous to be able to capture the attention of non-lovers of pinball. Strange fate that of pinball titles. Although the virtual incarnations of the aforementioned gaming machines can in fact boast obvious privileges from the point of view of the showrarity and accessibility, nevertheless very few times they have been able to impose themselves as completely convincing and exciting products. Spurred by the desire to invalidate the above assumption, some nostalgic SCEI programmers have well thought of re-proposing the playful structure of the pinball machine in a more modern guise and, possibly, appreciable by the general public. The result is the Flipnic that is the subject of this review.", "date": "2004-05-03", "grade": null}