{"name": "Alias", "ref": "https://multiplayer.it/recensioni/alias.html", "text": "Syd, you've been discovered! The actual action part is decidedly more successful and fighting with Sydney is simple from the first fight without the need for any tutorials. There are two basic types of attack, the fast one and the special one: each of these offers the possibility of making different combinations of shots, based on the objects used or depending on the proximity of walls and the composition of the surrounding environments. Alias offers a fair degree of interactivity with the environments of the levels, in the game there are many non-player characters and numerous objects that Syd can interface with. The philosophy that regulates the use of a certain weapon is based on the concept of deterioration of the available resources, and the various objects that can be used as weapons deteriorate until, now unusable, they are abandoned by the protagonist. In the best tradition of Alias, during the missions, the most fascinating agent of the CIA will have different types of disguises and clothing, interchangeable through the appropriate menu, including the ubiquitous black spy suit, which, with all due respect to Sam Fisher and associates, gives much more to Sydney Bristow. Choosing to abandon particularly skimpy clothes, such as that of a waitress in the first level of the game, for a more technical one, brings advantages to Syd such as being able to withstand the coldest temperatures of a cold room, and being more free in attacks. Small detail for all readers, during the change of clothes, the image disappears, no strip in game by Syd, unfortunately ... Shots from a blockbuster The management of the camera, strictly in third person, whose control is entrusted to the right stick, offers an interesting feature. In certain situations, we will see two boxes appear on the screen, a main one where we will see the normal play area and where Syd can move, and a secondary, smaller one, in which information from our contacts at the CIA will appear to help us pass certain steps , or other important events that happen during the mission. The result is to offer a very cinematic feeling, in which certain hot spots, which appear in the smallest box on the screen, help to increase the suspense or can even change the strategy to complete a level. In Alias we will find a good number of technological gadgets that can be exploited during missions, from the classic mini digital machine or the always useful kit for picking locks, to devices for hooking up to computers and downloading data in a few seconds, or DNA samplers connected in real time to the database of the CIA. Their use is simple, thanks to the digital cross on the Xbox pad, you can scroll through the various devices and use those suitable for the purpose, which will be suitably illuminated in the menu. In some situations, such as picking locks or overcoming security protocols in connection on the computer, we will take an active part, having to reproduce certain keystrokes via the Xbox pad to be able to effectively conclude the action of the device used. Longevity is certainly not the strong point of Alias, in fact some passages are easily overcome, and there will hardly be the stimuli to re-tackle a level with a different strategy. This aspect must not necessarily be seen as a defect, those who have been following the adventures of Syd and company for some time, know perfectly well that during a mission there are almost always unexpected events or twists that force agent Bristow to abandon his cover to eliminate the various enemies in a more ~concrete~ way and making all the missions linked to a stealth action would have made the coherence with the television counterpart lose. of lighting and the lack of dynamic shadows. Two fundamental aspects to make the most of the atmosphere in a title, where the ability not to be seen by the enemy takes an active part in the game mechanics. Technically speaking The Alias engine offers a large number of character animations, made using motion capture. The frame rate is stable and there is a good alternation between outdoor and indoor environments. The models of the main characters are well cared for, and almost all, represent their television counterparts in an excellent way. Some environments offer a very interesting graphic detail, with numerous details and particulars, but unfortunately this level is not maintained throughout the game, giving life to a title that graphically appears discontinuous and fluctuating.the audio department, Alias, as already mentioned, makes the most of the official license of the serial and this not only for what concerns the original voice actors of the various characters, but also for the use of the music composed by Micheal Giacchino for the television series and faithfully reproduced here. As regards the use of positional or surround sound, the Acclaim production unfortunately does not shine as for the music and dubbing and we will rarely be able to rely on our hearing to find out where a threat comes from. Comment The history of games based on licenses taken from television serials is full of huge disappointments for fans and good titles such as the first title of Buffy The Vampire Slayer and the transpositions of CSI. Alias is halfway between these extremes and true fans of Agent Bristow will have no difficulty getting into the spirit of the game and will probably be satisfied by the way it manages to recreate the atmosphere of the serial. Unfortunately, however, the Acclaim title does not contain the elements necessary to thrill players who do not know Syd and her narrative background, providing them with a stealth action game that is only truly engaging at times and with a longevity that stands below ten hours effective. These aspects, together with a technical department certainly not up to the possibilities of Xbox, represent the main negative points of the Acclaim title, which offers excellent potential, unfortunately largely unexploited. Pros: Sydney Bristow Excellent dubbing Official license well exploited Cons: Technically not the bestToo easy and shortUnexploited potential Alias is based on the homonymous television series, particularly famous and awarded overseas, whose protagonist is Sydney Bristow (played by the attractive Jennifer Garner), operative agent of the CIA. One of the CIA men, Agent Jacobs has disappeared under suspicious circumstances, at his last contact he had provided important information on Anna Espinosa ex-member of a rival agency (the K Directory) who has long since turned to crime. The trails lead to one of the Monte Carlo casinos, Jacobs' last known location. Here begins our adventure The story of the game is written by the same creator of the TV series, J.Abrams, the setting is defined by the events of the end of the second TV season, fortunately these are also the last episodes to be broadcast in Italy, therefore there are no references or spoilers on what happens during the third series, currently airing in the United States. The main enemy is still Sloane who, with the help of his second, Sark, wants to complete the search for Rambaldi's artifacts and thus discover their secret. As happens in the TV series also in the video game Alias, agent Bristow will face a series of linked missions, nine to be precise, all in different locations such as Monte Carlo, Hong Kong, Rio de Janeiro and many others. One of the aspects most appreciated by fans will undoubtedly be the use of the original voice actors of all the main characters of the television series, in this way those who are already inside the Alias universe will immediately find themselves at ease. Alias is a mix between a stealth game and a third person action adventure, based on limited puzzles and lots of combat. The Acclaim title offers the player the possibility of choosing how to complete the various missions and neutralize the various enemies in direct combat, by triggering alarms, or by trying to overwhelm them through reasoned strategies by observing the specific canons of a good stealth game. By pressing a button on the Xbox pad, you can enter Syd's stealth mode, the character will walk more slowly, slightly bent in posture, and obviously the noises will be limited to the maximum. In this way it will be possible to enter clubs without being noticed, get behind enemies in silence or avoid being discovered by cameras. Obviously when you are in this mode our attacks and some actions will be modified and, for example, it will be possible to get behind enemies and with a sharp blow knock them out through a neck grip. The game also gives the possibility of using a thermal view and a particular version of night view: the problem is that Syd, in certain situations, but without motivation, cannot use this type of resource, available for almost the entire game as if were innate abilities of our agent, undermining the coherence of the entire game structure. However, stealth mode offers other inconsistencies. The actions that can be performed are numerous and range from flattening against a wall, to moving on pipes or ledgessuspended, until crouching behind objects. Unfortunately, the rendering in the game is certainly not treated in the best way and, for example, making noise does not necessarily attract the attention of the guards, or hiding in places that are illuminated in the game does not necessarily lead to being discovered, even if the guards they pass us a few meters away.", "date": "2004-04-13", "grade": null}