{"name": "Bad Boys 2", "ref": "https://multiplayer.it/recensioni/bad-boys-3.html", "text": "Tactical Narcotics Team The game immediately lets you glimpse the arcade setting on which it bases its strength. Without too many words, we immediately move on to the actual game, catapulted into the middle of the action. Mike Lowrey and Marcus Burnett, protagonists of the game (and of the film), agents of the Tactical Narcotics Team (TNT, an acronym, a program) find themselves in the middle of a shootout that will lead the two to throw down a lot of lead to save the skin. The game setting provides a 3D view and the use of both protagonists of the original film. The copious presence of add-ons and bonus packs scattered around the map give the game action a decidedly smooth imprint. The clashes with the opponents, with beretta and shotgun shots, are certainly not lacking, but the lack of degrees of freedom in terms of exploring the map is immediately felt. In fact, the path to follow, except for some minimal detours, is obligatory and you will very often find yourself navigating between rooms with a single entrance and a single exit, with the maximum possibility of running into some room richer in details and objects and for so to speak explorable. This choice certainly does not leave much room for the player's inventiveness and for the study of refined strategies for carrying out the mission. On the other hand, the enemies do not represent a particularly complex challenge, and they certainly do not demonstrate having particular skills related to a refined artificial intelligence, very often their actions will be limited to lightning-fast ~hit and hide~, when the game plan it won't see them engage in clumsy face-to-face matches where they won't be able to have the slightest hope of victory except by counting on a strong numerical advantage. The balance between the forces of the ~good guys~ and those of the ~bad guys~, to be clear, is in fact not the most calibrated. The firepower of the protagonists is not even remotely comparable to that of the enemies, decidedly more unfortunate in battle, less accurate and without any shadow of a doubt, not at all resistant to gunfire. The situation is obviously reversed for Mike and Marcus who will have increasingly powerful weapons, health bonuses and more from their side. In fact, the greatest threat comes precisely from the difference in number between the two unfortunate policemen and the myriad of thugs to be shot. When the going gets explosive Each mission, in addition to increasingly complex objectives (which most of the time involve the annihilation of enemy forces) provides the player with a series of identikits of criminals to collect. Each identikit collected, combined with the results in terms of hits and criminals eliminated, give the possibility to increase the power of the characters and to unlock tricks and weapons in order to make life a little easier for the two reckless policemen. Those who have seen the film will also remember that one of the main characteristics of Mike and Marcus, in addition to that of always getting into a lot of trouble, is that of never concluding a mission without having caused enormous damage, at the expense of the very high fee police department insurance; hilarious, in this regard, the captain, as well as the superior of the two, who due to the vice of the two subordinates is forced to moments of forced calm based on yoga and mantra recitation. For this reason, at the end of each mission, the damage to the objects destroyed during the mission will also be counted, affecting the final evaluation. In practice, the two will be able to kill all kinds of luxury goods starting from precious vases and ornaments to ending with computers in an office or video games in a games room. Technicalities From the point of view of the realization, it certainly cannot be denied that this product suffers from some shortcomings that cannot be well defined except with the haste of producing a title that is easy to place on the market without excessive pretensions. The control is sometimes too confusing, especially in moments in which it is possible to switch from the standard set-up to the ~lurking~ one, usually near a door or a shelter large enough to cover the entire figure of the character. In narrow places (such as the bathroom of a restaurant or a corridor) then you risk losing your life under the blows of an enemy due to a difficult interpretation of the situation, almost always caused by a poor fluidity of the camera in finding the point of view best for action. Graphically the game has nothing to be envied, it remains within the norm of gamesthis genre that do not have the pretension to amaze, but simply the need to adequately represent the scene. However, the characters look a lot like the real-life actors. The chosen textures are not very varied and the models of the objects do not always seem to be the result of a particularly sought-after creation, but remain in the acceptable average of the competition. A positive note comes, not even on purpose, from the sound system that offers a soundtrack with the typical tonality of Will Smith's films. In conclusion, Bad Boys 2 can be considered an acceptable product from many points of view, not at all outside the usual canons of the action arcade genre, certainly not having the claim to be innovative, but if anything fun and fast. And fun and fast are certainly two adjectives that fit perfectly on this title. Recommended for lovers of killing, without too many worries. Pros: Numerous weapons available Action, action and more action Very fast and immediate Cons: Sometimes a bit obvious The graphics are hard to impress Game control is not always fluid Tie-in is a genre that has long been making its fortune in the thriving field of video games. The solid springboard provided by a strong starting point such as that of a publicly acclaimed film and the wide circulation provided by the big screen usually lead certain films to produce a whole series of derivative products that thrive in their shade. Could not miss the Bad boys 2 appeal, a film in itself rather pumped up and sure of the success of the first chapter of the series. Both for market needs, and for the wider financial availability and for a richer budget, this well-known action film, which sees an increasingly fierce and schizophrenic Will Smith in the leading role, is ideal for a transposition ~without trauma  from film to video game. Action and bullets in rivers, beautiful women, cars, chases filled with shootings and explosions that only Hollywood can give make up the main course of the banquet.", "date": "2004-04-05", "grade": null}