{"name": "I-Ninja", "ref": "https://multiplayer.it/recensioni/i-ninja_a.html", "text": "With his head on his shoulders... Already in the game we are constantly faced with a hilarious parody of Japanese warriors, but here we risk bordering on the ridiculous. In fact, there is a cheat that can be activated by pressing a combination of keys that will give our Ninja a huge head. Be warned, it's at your own risk - activating it may mean you spend more time laughing than jumping between platforms, but it's worth it. A young warrior, with a fearless face, surely he will help us... There is no Shinobi or Ninja Gaiden who cares, the caricature of this legendary figure has succeeded in full, starting already from the introductory film: the evil O-Dor is planning to conquer the world, you will understand what is new, and our Master, or Sensei if you prefer, he seems to be the only person able to counter him, until a small mishap happens to him. Yes, because precisely because of our clumsy movements, failing to control the ninja arts perfectly, we have literally sliced the man who taught us this noble art. One less annoying old man (but who continues to haunt us in the form of a spirit), but also one more risk for the entire world population. Nothing, our Ninja will take care of putting things right, facing O-Dor instead of Sensei, but not before having gained experience fighting the creatures he sent to kill us, learning to control our aggression and maybe, but it is not essential to hold our tongue against the Master. Of course we will have to work hard to demonstrate to everyone that we can claim the title of Ninja-able-to-save-all-humanity but all this also hides many positive aspects: glory, fame, beautiful women, a place reserved for machine and so on and so forth... Thus begins the climb up to the black belt, to learn all the most lethal and destructive attack techniques, and finally obtain respect from all. Nothing more... difficult! Ninja, mister lieutenant! I don't think even Namco points to I-Ninja as a killer-app, but behind this apparently obvious story, many pleasant surprises are hidden. Graphically, the work done by the programmers is very good: you can't say there is a huge display of polygons or high definition textures, but this helps to make it even closer to a cartoon and very pleasant to see. Our Ninja looks like he's straight out of a super-deformed parody of Shinobi, with a huge head and skimpy body, but comes with an astonishing array of moves. He looks like a little Prince of Persia, for his ability to walk on walls, climb, slide, glide by swinging his katana and much more. Even on the sound side, nothing to reproach, on the contrary: pleasant music and sound effects are combined with an excellent dubbing in Italian, full of crazy phrases, disrespectful speeches towards the Sensei and many other nice goodies to discover. The game itself might seem like a canonical platform, with some combat sections scattered throughout the levels, but as you play, you'll be amazed at the wide variety of situations that will arise: fighting games aboard improbable mechs, high-speed racing on winding tracks, shooters from turrets equipped with cannons and, for those nostalgic for Marble Madness, more than one section in which it will be a question of piloting a sphere to the end of the level. Obviously, as in any self-respecting game of skill, everything requires an excellent dose of dexterity and timing with the pad. The levels are not very many but, having to face them several times and with different objectives, they make this game quite long-lived, despite the average difficulty, except in rare cases, it turns out to be not so high. Even the bosses are not particularly challenging, but collecting all the achievements and unlocking the extras of this game will make you sweat a lot more than the usual seven shirts. Comment If you love the purest platformer, a genre now somewhat set aside, you will have a lot of fun with I-Ninja, and you will have to show all your skills to complete it. Add to this, however, an interesting variety of levels, which will break the monotony of the jump-and-run, with sections that seem like witty quotes from many other successful games. Fun, witty, well done in every aspect without having to feel the obligation to show off technical characteristics to scream, I-Ninja is a very pleasant title, to try absolutely. After that, shouting ~Shuriken Ninja!~ complete with a plastic pose, you will probably comeurgently admitted to the nearest psychiatric hospital... Pros: Very funny, nothing is spared from parody Lots of moves, actions, weapons, upgrades Great game variety Cons: Not very long, but highly replayable Little variety of enemies For once we are faced with a title that does not show the classic clich about ninjas, made up of men dedicated to stealth and silent assaults. Namco instead invites us to meet a messy, irreverent and, above all, very clumsy warrior...", "date": "2004-04-02", "grade": null}