{"name": "Star Trek: Legends", "ref": "https://multiplayer.it/recensioni/star-trek-legends-la-recensione-del-gacha-premium-sulla-celebre-serie.html", "text": "There is both something wrong and something very interesting in the very concept of premium gacha, especially on a license of this caliber, so the Star Trek: Legends review can bring out several food for thought. The structure of the gacha RPG, needless to deny it, is by definition opaque: it is a type of game that relies on the compulsive drive to collect, when not exactly on the perverse charm of gambling that makes it dangerously prone to gambling addiction. It is a refined mechanism that has proven to work all too well, so much so that the mobile market is now flooded with games of this type, often linked to brands and licenses of the highest caliber, as in this case. The basic idea is to build a dream team of your favorite characters, to be obtained with a good dose of randomness that dominates the ~summoning~ system of the fighters, divided into different tiers of rarity and in which the low success rates in finding the most coveted prizes push, by design itself, towards micro-transactions. Star Trek: Legends takes us on the USS Artemis on a journey inside the Nexus, to discover many historical characters from the series But what would happen if the paywall were completely removed from this mechanism, i.e. if the in-app purchases component were completely excluded? Star Trek: Legends answers this question, which offers a turn-based RPG with gacha elements that is rather classic in structure, but removing the fundamental gear of buying with real money, being distributed through Apple Arcade. In essence, the whole progression system is simply based on what can be obtained by playing, thus representing an honest interpretation of the usual concept, without prejudice to the grinding and constant advancement of statistics and the amount of characters available as fundamental elements. The result is strange, because if on the one hand the game finally gets rid of the deceptive traps that push towards purchases, on the other it is as if the forcing of a structure entirely set on a progression for its own sake and extremely linear, even if in this case the Star Trek license is able to introduce narrative elements of a certain interest. Discovering the Nexus In Star Trek: Legends we explore alien planets in turn-based combat The initial premise is very simple and serves to give an excuse to the rain of Star Trek characters that we see once the game starts, coming from disparate series and eras. This excuse is provided by the Nexus, a sort of hole in space/time that merges together different dimensions and timelines, thus allowing a first generation Captain Kirk to coexist with a Picard or other characters from the different series (classic series, The Next Generation, Deep Space Nine, Voyager, Enterprise, Discovery and Picard), in short, allowing for a mix of temporal paradoxes that would otherwise not be justifiable even in a reference system with rather bland logical limits such as Star Trek. Leading the U.S.S. Artemis, a new Federation ship specially designed to withstand the terrible stresses of the Nexus, we find ourselves exploring various areas of this sort of space fault, discovering new worlds and facing battles. Star Trek: Legends offers over 40 characters to conquer, taken from different TV series The true trekkie will probably object to the excessive simplification to which the universe in question is subjected, because Star Trek: Legends is made up exclusively of turn-based battles structured in progressive waves, as happens classically in gacha RPGs, interrupted by some narrative sequence with satisfactorily written dialogues translated into Italian. The sense of discovery is limited to the vision of some beautiful alien panorama but we are far from the basic idea of the classic Star Trek, which aims more at the romanticism of space adventure, the encounter with the new and the wonder of discovery rather than to simply constant combat with everything that comes your way. Battles in Star Trek: Legends take place in the classic turn-based RPG dynamic Beyond this fundamental inconsistency, however, the reference series provides a solid foundation for a more interesting storytelling than is often found in games of this genre. The fragmented character of the action does not allow for the construction of great sci-fi epics, but the writing is nonetheless of a good standard and the dialogues are often interesting and even hilarious, thanks to a certain self-irony that filters through the characters from series that emerged in very differsnts. In short, the unfolding of events does not present major twists or an enveloping narrative, but we also willingly go on to see the exchanges between the historical members of the crew, validly supporting the game mechanism. The compromise adopted to stage everything is also good, with a somewhat cartoonish graphic style that convincingly incorporates the typical characteristics of the characters and settings of Star Trek.", "date": "2021-04-28", "grade": "7.0"}