{"name": "Splinter Cell: Pandora Tomorrow", "ref": "https://multiplayer.it/recensioni/splinter-cell-pandora-tomorrow-2.html", "text": "Two Sam Fishers are better than one... As previously mentioned, Pandora Tomorrow, almost in a specular way compared to the first Splinter Cell, aims very much at multiplayer, so much so that in all respects the Ubisoft title is the first true online stealth game. The choice behind the multi-player section is both thoughtful and courageous, limiting teams to a maximum of two players per faction was not a decision immediately shared by everyone, playing Pandora Tomorrow, instead it stands out as an extremely apt solution . Too many players would have destroyed the stealth component of the game, making the online section degenerate towards gaming experiences similar to Rainbow Six or Ghost Recon. By limiting the number of spies to two, the ideal number for close and effective cooperation, the number of mercenaries also had to be cut, otherwise teams made up of a greater number of elements could simply have positioned themselves in front of the objectives, and frustrated any possible attack by spies. The choice to set the movement of the mercenaries towards a first person view is also particularly successful. In this way, the field of vision is less effective than that of the typical spy, noticing suspicious movements is more difficult, but at the same time the first person shooter type view is ideal for the sole purpose of mercenaries, which is to shoot to kill. One of the differences that immediately catches the eye in the online mode, compared to the single player mode, is the inclusion of a sort of virtual ~hud~ (a graphical interface n.d. BK), which can be deactivated at will, on the screen, which shows the position of the objectives and some information on them. This option, available only for spies, together with the selection of different arsenals for the two factions, make the Pandora Tomorrow multiplayer experience optimally balanced, regardless of which faction you decide to support. Two Sam Fishers are better than one... The balance between the skills of spies and mercenaries can therefore be said to be successful and in both roles the player is at ease and choosing which team to play leads to totally different gaming experiences. If a spy can hide in the shadows, then the mercenary must have a way of finding it, and the programmers have implemented two different types of visors from those of the new Sam Fishers, the one to search for movement and the one to discover electromagnetic sources in operation, such as visors or spy devices. On the other hand, a mercenary cannot move freely around the level with these views always active, because they penalize his movements, making it very difficult to see obstacles or effectively evaluate the playing area. To overcome this problem, at the disposal of the mercenaries, there are torches and laser sights attached to the rifle, or there is a touch of class made in Ubisoft: the possibility of slightly adapting the view after entering an area that is poorly illuminated, just like in reality. The control method is slightly different in the online game, for example the triggers allow you to use items quickly, without having to spend too much time sifting through the inventory. Even the objects and weapons found in the levels are slightly different from those in the single player section, there are in fact some nice additions, such as devices to trigger fake alarms, photocells to detect unauthorized movement, flares and gas grenades of different guy. There are three game modes and even if at first glance they do not seem to present substantial differences, when playing things change, prompting the use of different strategies depending on the type of game selected. Each of these can be customized in different ways, from the game menu, favoring or not the action of spies and mercenaries. The maps of the multiplayer section are numerous and different from those present in the other modality, they are all made ad hoc for a clash between several players, presenting an adequate number of objectives, in more or less decentralized positions, in this way any type of fixed ambush by mercenaries. Already now there are some additional maps, downloadable in the form of download content via Xbox Live, given the precedents of the entire Tom Clancy series on Xbox, it is easy to predict new content in the coming months. Technical aspects The graphics engine of Pandora Tomorrow is based on the old code, but the greater time available, combined with the experience gained cWith the first Splinter Cell, it brought significant upgrades such as a more stable frame rate in outdoor environments, despite the increase in polygonal complexity, better textures, further improved lighting management, the addition of very choreographic details such as the reproduction of courses water or vegetation. The management of graphic filters for the various types of viewers has also been optimized and this change is decisive for the game mechanics, bringing a valid balance between pros and cons in the use of the various types of view. The rendering of particle effects has also been further improved, making gas and smoke fumes and other atmospheric elements even more effective. Sam Fisher's model is as always very well characterized and his animations have increased in number and quality, unfortunately there are no significant improvements in those of the other characters in the scene. While there is no generational change between the two chapters, Pandora Tomorrow undoubtedly does much more justice to the technical possibilities of the Microsoft console. Good news also from the sound department, especially if you play connected to a Dolby Surround system. Positional audio is, in fact, extremely useful in both multiplayer and single player modes. The dubbing of the game is completely in Italian and, as in the prequel, Ubisoft has chosen important names for the individual voices, for example Luca Ward for our Sam Fisher and Morgan of Blue Vertigo for the bad guy, giving even more depth to the quality total of this product. Technical aspects Comment Pandora Tomorrow is a title strongly oriented towards multiplayer and, provided you have an Xbox Live account, this mode alone is worth buying the game. Unfortunately, the close relationship with the first Splinter Cell does not lead to a sensation of real novelty like the one experienced in autumn 2002 and those who are not interested in the online section will not find a game with revolutionary additions or profound modifications, but rather a revised and corrected version, albeit in many parts, of the prequel. Ultimately Splinter Cell: Pandora Tomorrow is one of the best titles of recent months, as well as of the Xbox lineup, able to offer a valid single player section, combined with one of the most characteristic, innovative, and most successful online modes on the market. Pros: Multiplayer support Top Sound Department Virtually infinite online Cons: Shorter than the prequel Not perfect AI Too similar to the first episode in single player The first Splinter Cell brought a real revolution among stealth games, Pandora Tomorrow does the same, but this time for what concerns the multiplayer section, integrated into Microsoft's Xbox Live service. Third Echelon, the special section created by the NSA, to counter threats to the national security of the United States, and of course its best agent, Sam Fisher, must face a new threat. The American embassy in Jakarta was attacked and occupied by a group of guerrillas under the orders of Suhadi Sadono. Our task is to recover documents classified as top secret, directly from the embassy, before they fall into the hands of the guerrillas, obviously this will only be the beginning of a new and dangerous mission. Despite the awards, the excellent ratings and acclaim received, both from critics and from the public, Splinter Cell had some flaws. After its debut on Xbox, some of these had been isolated and corrected in subsequent versions, in Pandora Tomorrow there is no writing of the code from scratch, but rather a profound revisitation of some of the controversial details of the first episode. Artificial intelligence, collisions, difficulty balancing, stealth component, all aspects that have been further improved for this new adventure by Sam Fisher. The result is excellent, the team of programmers has improved and further refined the single player component, which is more enjoyable than ever. The settings are more varied with an excellent alternation between interiors and exteriors, moreover the level design is more accurate, especially as regards the fundamental components in a stealth game, or the paths that can or must be taken to complete a mission, without necessarily having to come to a firefight. The differences found in Pandora Tomorrow and its predecessor are found especially in the details, the details surrounding the actual mechanicsgameplay, but which give a sense of compactness to the final product, for example the better quality of the CG sequences, the creation of a story and a more engaging and uniform background to the setting. One of the sore points of Splinter Cell was the strict management of the alarms which, if triggered during a mission, led to a continuous interruption of the same, causing frustration and generating some really difficult stages to overcome. This situation has been partially eliminated in subsequent conversions, such as the one for Playstation 2, and Pandora Tomorrow continues in this direction, certain almost frustrating passages of the first Splinter Cell are now a distant memory, while focusing the action even more on stealth skills by Sam Fisher, limiting simple firefights as much as possible. The final result rewards these choices, Pandora Tomorrow in the single player mode surpasses its predecessor, the game experience is better, Sam's new abilities, such as the SWAT move or the further jump when you are between two walls or the key for whistling, they are useful and effective. While still presenting some weaknesses due to too predictable reactions in certain situations, the artificial intelligence of the guards has also undergone significant optimizations and is much more attentive to the noises that are caused, voluntarily or not. Aggressiveness and accuracy in shooting has also improved, making the frontal firefight solution less and less favorable. The only negative aspect attributable to the single player section can be found in the actual duration of the game, unfortunately lower than the first Splinter Cell, a couple of levels less and the difficulty slightly adjusted downwards, are not the best for veterans of the Third Echelon. This situation does not necessarily remain unchanged, thanks to downloadable content, Ubisoft could soon remedy.", "date": "2004-03-30", "grade": null}