{"name": "Metal Gear Solid: The Twin Snakes", "ref": "https://multiplayer.it/recensioni/metal-gear-solid-the-twin-snakes_a.html", "text": "The importance of being Solid There are beautiful games, others that are less beautiful, and still others that are revolutionary. Metal Gear Solid for the 32 bit Sony can certainly be placed in the latter and far from crowded group; the influence that Kojima's birth had on the entire video game industry was simply devastating, with the adoption of stylistic and technical ideas and solutions taken up countless times in productions even of diametrically opposite genres. So seeing a masterpiece of this caliber resumed, and updated to the year 2004, is undoubtedly a welcome choice for practically any gamer worthy of the name. As for the graphic aspect, Silicon Knights has done a really excellent job from all points of view; each environment has been redesigned and enriched, the details have increased exponentially, and the particle effects implemented in an excellent way with snow, rain, and even abundant blood splatters. The transition from 32 to 128 bits is as ~traumatic~ as one might expect. The polygonal models, in particular, have undergone a drastic injection of polygons: in fact, a close analysis allows you to fully enjoy well-recreated and realistic faces, enhanced by credible expressions and attitudes, and weapons, accessories and clothes extraordinarily rich in details . From this point of view, the animations would have deserved greater attention, on some occasions too wooden and unrelated to each other. The textures, on the other hand, appear to be of rather fluctuating quality, capable of passing according to the cases, from perfect to just sufficient, especially taking into account the potential of Gamecube. Regarding the much-discussed drop in frame rate, it is undoubtedly a real fact, but so rare and not very incisive that it can be easily digested. Broadly speaking, The Twin Snakes' appearance is roughly on the levels of Metal Gear Solid 2; little to complain about then. Where instead the fatigue of Silicon Knights excels in an indisputable way is in the interlude scenes; although the original script has not been affected in the least (fortunately), the US programmers have revolutionized the sequences, redesigning and enriching the choreography as well as the direction, entrusted to the talented Ryuhei Kitamura. The result is simply fabulous: somersaults, incredible jumps, bullets dodged at the last moment, all seasoned with large doses of bullet-time, are just some of the aspects that make up the cut-scenes, also technically, and not only artistically, truly impeccable. From a sound point of view, The Twin Snakes maintains the very high quality standards to which the series has accustomed us; in particular, even the European editions have fortunately abandoned the intentions of localizing the voices, leaving the splendid work of the American voice actors intact. The latter, among other things, were called on this occasion to carry out their work again, in order to further perfect an already substantial aspect. Impeccable music and effects, whose quality is further amplified by the full digital support of Dolby Pro Logic II. Since 1998 with fury As previously mentioned, Silicon Knights has focused its attention fundamentally on the graphic aspect, leaving the plot, locations, script and characters absolutely intact. As far as gameplay is concerned, no changes have been made to the basic structure in this case either; nonetheless, practically all the innovations - in terms of the protagonist's skills - introduced by Konami with Metal Gear Solid 2 have been included, including the first person view. The latter, in particular, proves to be an option with a much heavier impact than one might imagine: if in fact it is true that it allows you to enjoy 100% of the level of detail and care in the settings, otherwise impossible through the visual from a bird's eye view, on the other hand it is equally true that the possibility of shooting by looking through the eyes of Snake allows you to face the fights with an approach not foreseen by the original concept. And especially in boss fights, the situation can change dramatically. More generally, this analysis highlights one of the not entirely convincing aspects of this The Twin Snakes: entering the lockers, dragging or throwing the guards from the cliffs, hanging from ledges, are all skills not foreseen when Metal Gear Solid it was devised. This is basically expressed in the alteration of the balance of an originally perfect title from this point of view, and in the same way the accessories of the aforementioned possibilitiesabilities offered to the player virtually allow them to be completely ignored. The assessment of their specific weight is therefore a complex matter: are they to be considered pleasant novelties that expand and enrich the gaming experience, or rather mirrors for the larks, artificial and poorly amalgamated additions? Turning instead to another topic of discussion, namely the increase in the artificial intelligence of the enemies, without a shadow of a doubt it can be said that this corresponds to the truth. Of course, observing the guards erasing all memory of the presence of an intruder just moments after his sighting can embarrass, but these are obligatory choices to keep the game within the fun channels that it is required to offer. In principle, however, compared to the episode on Psone, the military show greater attention, are more sensitive to the presence of Snake, attack much more effectively and move in groups, combing every corner. All factors that could displace even the connoisseurs of the series, further hindered  only initially, mind you  by the different configuration of the keys compared to the Dual Shock. Lastly, the decision not to affect the original structure in any way necessarily minimized the longevity, which is not particularly conspicuous in itself, for anyone who has already completed the adventure on the 32-bit Sony; which, taking into account the millions of pieces sold all over the world since its debut to date, certainly represents a very large share of users. Comment Evaluating Metal Gear Solid: The Twin Snakes is far from easy work. If on the one hand there are all the points in favor relating to a solid and satisfying gameplay, a story of great depth and a technical component of absolute importance, it would be foolish not to point out less successful aspects of the Silicon Knights effort, both subjective and objective. Anyone who has already played and concluded the original on Psone, perhaps several times, will struggle to face The Twin Snakes with the enthusiasm and interest of the ~first time~; in fact, for most of these players it will be an exercise of curiosity purely linked to the technical aspect, in the continuous comparison between what appears before the eyes and what is left in the memory of the original experience. A certainly disenchanted approach therefore, also devoid of the element of surprise of the script that has so much weight in the economy of the game. But even for the very few, one assumes, still virgin users of the world of Metal Gear Solid, the perspective is that of taking an absolutely fundamental step in the history of video games but, let's not forget it, still largely dated 1998. With all that this leads. Pros: Excellent graphics and simply fabulous interlude sequences Plot still topical today and extremely enjoyable Gameplay of crystalline class and of seminal importance Cons: Inevitable negative residues of a game from 6 years ago New abilities not perfectly blended with the original concept Extreme brevity and little incentive for replayability Although in recent times the Nintendo cube has had to witness a sad sequence of abandonments and cancellations regarding third-party multiplatform projects, nevertheless the users loyal to the big N have been able to enjoy some returns as unexpected as they are welcome. We are obviously talking about the Final Fantasy series, which has landed again on the shores of the Kyoto house with the atypical Chrystal Chronicles, and one of Konami's spearheads, or the Metal Gear saga. With a rather unusual form of intercontinental collaboration, the latter project was carried out by the skilled Silicon Knights team, already authors of Eternal Darkness, under the supervision of the now deified Hideo Kojima. To the happiness of some and the disappointment of others, however, Metal Gear Solid: The Twin Snakes - this is the name of the game - does not represent a new chapter in the adventures of Solid Snake, but on the contrary slips into the currently popular genre of remakes , going in fact to reconstruct, adapting it to the capabilities of the Gamecube, the splendid chapter that appeared on Psone in 1998.", "date": "2004-03-26", "grade": null}