{"name": "Kill.Switch", "ref": "https://multiplayer.it/recensioni/killswitch.html", "text": "Don't call it ~Metal Gear~ One of the most popular comparisons made while waiting for Kill Switch was the one with Metal Gear Solid and its sequel. Since it is impossible not to take note of the rumors in progress, let's start right here, clarifying that this is a completely out of place comparison. The premises of Kill Switch, in fact, are self-evidently distinguished from the narrative aspirations and from the tactical espionage system of Kojima's creatures. Especially of Metal Gear Solid 2, in which the attention on the level of the plot (however overrated) is practically predominant compared to the actual gameplay. KillSwitch, on the other hand, is not born to tell, and presents simple interludes between the action of one level and another. They take on the role of a mercenary equipped with a neural interface system with its control base which, however, also causes unpleasant negative effects in the form of the usual sentimental memories not completely erased from who knows what mnemonic sac of the system. Meanwhile we gradually understand who we are, who is the woman in our memories, who are the real villains, et cetera. The plot is exposed as an interlude and in bits and pieces, with an effect of suspense and indeterminacy so successful that you will skip said interludes after a couple of seconds, ready to face another level of pure action. This brings us to the second feature that distinguishes KillSwitch from Metal Gear Solid and at the same time is useful to describe it: the control system and the orientation of the gameplay. As anticipated, the fulcrum of the gameplay is made up of the run-recover-and-shoot system that Namco has happily implanted on the Dual Shock, and the axis of the gameplay is decidedly oriented towards action rather than puzzles or reasoning. We will find very few switches to activate and very few moments in which we will have to move to operate this or that lever that opens other parts of the level, while we will be much more busy collecting ammunition and choosing the most appropriate weapon between the rifle, the machine guns and grenade launchers to take out those smartass enemies or, again, looking for a good cover point from which to zoom in to take out an insolent sniper. Tactical Offense System and Blind Fire = shoot, cover, shoot. Both the control and the AI excel in Kill Switch, while the game's main flaws lie in the overall brevity of the experience and the repetitiveness of the action. Let's get to the check. The two analogs respectively control the movements of the character in the environment and the positioning of the viewfinder, which remains stationary on the axis in which we place it, allowing us to move while maintaining a firing direction. The pad keys are divided between the use of grenades, the physical attack with the butt of the gun (which pleasantly ~humanizes~ our character when we have no bullets) and the action keys to activate switches and use weapons that the environment offers (like machine gun emplacements). The R1 key fires, while the L1 key has the key function of taking cover behind the elements of the environment such as walls, wreckage, columns, vehicles and so on. By keeping the button pressed we will be able to use the Blind Fire in the direction we are pointing with the analog, while moving the character's body a little beyond the shelter we will be able to use a remarkable shooting precision, however exposing ourselves to enemy fire. Tactical Offense System and Blind Fire = shoot, cover, shoot. As complex as it may seem, and as much as the control system requires a little running-in practice, the result is that in a couple of tens of minutes one is already able to control the character more than well, and to throw in the arena of tactical massacre against the computer. The other point in favor of Kill Switch is the remarkable artificial intelligence of the CPU. Enemies don't follow any set patterns at all, instead responding tactically to your attack style and actions, now attempting to sneak you from the side and now seeking cover. The ability to engage in mind games with the CPU is irresistible and allows you to create traps by luring enemies to a completely different point from your chosen position, an activity that in KillSwitch is as simple as it is fun. But also, in the long run, repetitive. The main flaw of the Namco title is perhaps the sense of constant iteration of the same things: shoot, hide, shoot, hide again, shoot again. Which is in a sense the main aim of the game, although it is impossible to ignore that some variety in the form of typesof enemies, attack patterns and environments would have greatly benefited the title. Penalizing, then, the overall brevity. Only six hours of play are very few for a form of gameplay that would have deserved an apparatus of high scores, unlocking and much greater amount of levels. The verdict Overall Kill.Switch works great: it plays with the same frenzy of an old-school FPS but incorporates the fundamental element of strategy in control over the environment and the position of enemies. Extremely fun and with that form of gameplay that keeps you going for the pure pleasure of passing a more difficult level, Kill.Switch is a more than decent game, a pleasant surprise that has little to do with the out of place combinations with the usual garish metal which, paradoxically, has perhaps more real gameplay on its side. Too bad that gameplay of this type needs more options, more variety and duration, more devices to prolong the exquisitely ~control~ pleasure so as not to sink into dust after six hours of play. Perhaps Kill Switch is the ultimate rental shooter: it doesn't deserve to be the gaming counterpart of Full Metal Jacket on your shelf but it is certainly more than enjoyable for as long as it lasts. Pros: Good warlike atmosphere Excellent audio accompaniment Exciting control system Good learning curve Cons: Repetitive Occasional camera problems Lack of options and rewards The experience is very short There has been a lot of talk about Kill Switch, and the wait has ended with one of the most enjoyable shooters out there. Namco's latest effort is in fact one of those fun and demanding titles (not without flaws that hinder their prolonged stay in the collection) which do not claim to rise to the status of masterpieces or obligatory titles and which however are capable of pleasantly surprising, conquering the player without taking a longer step than the leg. In KillSwitch you shoot, hide behind objects and kill enemies in a pleasant warlike setting with political fiction tinges, narrated linearly as a border between one level and another. That's all. The gameplay is admittedly one-sided: the goal is to survive the hail of bullets that the enemies will shoot at us while we infiltrate this or that base, proceeding without too many puzzles and taking care only of taking them out in the best way without getting killed instantly by exposing ourselves on fire. The fulcrum of the game are the hyped and not disappointing Tactical Offense System (with which we manage the way our character takes advantage of the environment to shelter from enemy shots and return fire) and the Blind Fire (which consists of a tactic of ~blind fire~ which greatly enriches the control system with nuances). Kill Switch relies entirely on the pleasure of mastering the controller and coordinating hand and eye to penetrate an environment full of enemies and take them all out by managing the balance between the frontal assault, in most cases suicidal, and the tactical guerilla warfare of the take time and shelter to aim well at the bad guys. All in a pleasantly characterized aesthetic setting, with very well animated and above all clear backdrops and characters, and with the only regret of some slowdown here and there. The sound sector, on the other hand, deserves particular praise, both as regards the variety and realism of the effects and for the compositional and ~interactive~ quality of the background music, which well accompanies the different rhythms of the game phases alternating between suspense, frenzy and anguish. Mediocre, like a low-grade cartoon, the Italian dubbing.", "date": "2004-03-25", "grade": null}