{"name": "Shrek 2", "ref": "https://multiplayer.it/recensioni/shrek-5.html", "text": "Compared to the first episode on consoles, several things have changed: first of all the development team and publisher. We have the valid Luxoflux, authors of the excellent True Crime, and Activision instead of Digital Illusion with Tdk Mediactive. The game structure has changed (which we will discuss later) and, it seems, the care and ambition of the title has changed. The genre always remains the most abused platform. Exploration, some research, puzzles obviously very simple and suitable for even a young audience. However, the mechanics will seem decidedly open with variable and multiple objectives, a bit like in the Zelda titles, with some submissions to complete and long collecting objectives. The novelty, however, is to be found in an idea which, if certainly not very original, is certainly not usual or redundant in too many titles. The game puts us in command of a group of four characters each with a unique set of skills. The possibility of switching to control of one or the other at any time allows you to complete a series of steps in which cooperation is essential. The main protagonist will obviously be the green monster and tender Shrek to which will then be added: his horrendous but sweet companion Fiona, the hairy and overweight donkey Donkey, the gingerbread man, Puss in boots, the bad wolf and the mirror magical. These will be joined during the adventure by other characters for a total of ten each with its beautiful and indispensable characteristic or ability. The idea itself is intriguing and if well exploited could lead to very pleasant situations. In the images you can clearly see Shrek intent on lifting Donkey to launch him on a kind of lever that will make the ogre reach otherwise unreachable heights. The abilities of the protagonists are obviously studied on the basis of their characterization. The huge green ogre will be able to lift and throw objects of considerable weight and size, the nice and stubborn donkey will be able to unleash powerful kicks, the plump Fiona to exploit a bullet time effect (???), the Gingerbread Man will be able to offer tempting treats to greedy enemies, Puss in Boots will be able to throw lethal apples, the Big Bad Wolf will be able to scare enemies and so on. The game will also be very interesting in multiplayer mode. As you may have easily guessed, with four characters on the screen there may also be four players at the same time. Just take a pad and press start to immediately jump into the action with the others. If this possibility implemented properly could turn out to be a pleasant surprise. As a pleasant surprise might be the ~Hero~ mode. If normality is represented by moving and acting in four, the special mode could not be anything other than having to accomplish goals alone. Of course, each goal will be different for each character. For example, Fiona will have to try to blow up some birds with the sole force of her powerful voice! Technically the title seems to get by just fine, the characters are made with taste, the polygonal models are varied and modeled with care. There should be about twelve hours of actual gameplay full of dialogues from the movie, quotes and funny stuff Let's hope so! Big, green, ugly. Hulk? No, Dreamworks is involved. Shrek? That's better, but you'll admit it was easy. The times of Snow White are over, the era of animated films for children only is over, the epic of old-fashioned cartoons is also over ... Welcome Nemo, Shrek and Lilo, hello films enjoyable by people of all ages, here you are textures and polygons. The aforementioned Dreamworks and Disney together with Pixar have been able to renew a genre that now seemed stingy with novelties by offering excellent quality products. In the videogame field, the same things certainly cannot be said. How many times has a tie-in turned out to be a great video game as well as a great way to make money? Should we go back to Goldeneye on N64? What is certain is that no one will remember the mediocre Shrek Extra Large. But perhaps it would be better to consider the sequel a little more, or rather the new Tie In based on Shrek 2.", "date": "2004-03-17", "grade": null}