{"name": "Legacy of Kain: Defiance", "ref": "https://multiplayer.it/recensioni/legacy-of-kain-defiance.html", "text": "Death can wait Defiance is in many ways the game of missed opportunities. The first of all is the differentiation between the two vampires, Raziel and Kain that you will play alternately. In fact, both possess the exact same abilities, including the ability to glide in flight and to climb. The same applies to fights where the same combos will be available for each, even if for the purposes of the game they prove to be marginal and not at all spectacular. From this point of view Defiance seems to take its cue from Capcom's Devil May Cry, forcing you to face continuous combat sequences that quickly become boring and repetitive, especially considering that the two children of the night are immortal; while Kain will restart from the last checkpoint, Raziel will simply return to the world of ghosts, but the substance does not change. Another point against Defiance consists in the lack of weapons other than the ravenous Soul Reaver, which in Raziel's hands has its ghostly form, but which in any case does not allow to wield other instruments as happened in the past, completely eliminating the question of bloody ~finish~. As if to make up for this lack, the developers have implemented a telekinetic ability with which Kain can throw enemies away or, on some rare occasions, impale them on some sharp point. Conversely, Raziel uses the same skill to fire orbs of power with which to knock down opponents, but the difference is barely perceptible in terms of gameplay. In any case, since they are vampires, so much power has a price which is called bloodlust for Kain, while for Raziel it consists in the need to devour the souls of one's opponents. However, both can satiate themselves in the same way when an enemy is now without strength, grabbing him just before he dies, while all the others stand by and wait for you to finish. Alternatively, the victim can feed your weapon, which, having accumulated a certain amount of energy, will release it by activating a different special ability depending on the power with which it has been imbued. These are speeches known to those who have already had the opportunity to try the previous chapters, and the continuity of Defiance is certainly to be appreciated, but every good gimmick ends up disappointing as soon as one realizes the superficiality with which it was made. The same goes for the puzzles, one of the most fascinating aspects of Soul Reaver and which now do not go beyond the use of a lever or the search for an object with an esoteric name, sacrificing the key element of the series, namely the possibility of Raziel to pass from the real world to the world of ghosts, whose diversities constituted an important element for the construction of complicated puzzles. Now everything is reduced to a column that lowers and little more, in search of a frenetic and fast structure, however undermined by the bad idea of framing the action from a fixed camera. Not only will you often find yourself running against a wall or without a clear perspective of which road you are taking, but in the platform sequences in particular, the continuous changes of shots will repeatedly be the source of premature departures. You are Raziel, I recognize you! Fortunately, the graphic aspect has not changed, in the sense that the cleanliness and quality of the main models has not failed even in this so subdued Defiance. In addition to being very fast and fluidly animated, Kain and Raziel are identical in shape to how we have known them in the past, while the enemies are less detailed and convincing. In particular, the vampire hunters do not give a great sense of solidity and are animated in a rather crude way. Overall, however, the result is not negative, considering that the architectures are finished with care and the environments enjoy a captivating general appearance, although much is due to two-dimensional scene elements. Compared to the console versions, the PC version differs only in the higher resolution, and with a medium-level configuration you will not have any problems of any kind as long as you have a joypad, otherwise you will spend bad quarters of an hour in the company of the keyboard. After so many doubts, at least one fixed point remains, and it consists of the excellent Italian dubbing, produced by the same cast of interpreters that we have come to appreciate in the first Soul Reaver. Thanks to the splendid voices, all the suffering and drama that lies in the script of this series can emerge, covering the dull soundtracks partly recycled from previous episodes. Final comment We all expected a lot from Legacy of Kain: Defiance, but unfortunately the good ideas have not been developed to the end and what had already been done good is now only a shadow in the gameplay. If you loved Raziel's series you might want to finish it to finally get to the crux of the story, otherwise the risk of falling victim to its repetitiveness is high. Too bad because without the flaws of the camera and the lack of challenge it offers it could have been a great game. As it is, it remains a more than enough action title, supported by a rich narrative and wonderful characters. Pros: Unforgettable characters Finally the saga reaches a turning point Immediate and pleasant to watch Cons: So many good ideas wasted It quickly becomes repetitive The fixed camera is a nightmare Destiny in your hands It is not easy to establish what are the ingredients that make a game truly unforgettable. If we look back to 1999 we cannot forget a title like Legacy of Kain: Soul Reaver, whose success is hardly traceable in a clear and distinctive way. On the one hand there was a cast of attractive characters with strong personalities, on the other there was an innovative and immediate, almost magnetic game system. For these reasons it is really a pity that the evolution of the series has led to a clear fall in style, which can be summed up in Legacy of Kain: Defiance. As always, the premises, at least on paper, are the best; first of all, the most welcome surprise for fans of the saga consists in the possibility of finally being able to impersonate Kain and Raziel in the same title, accompanying them to the appointment with their own destiny. This means that you will alternately retrace the same levels with the two vampires, along distinct timelines towards the crucial node, which will finally clarify the many mysteries that Legacy of Kain has been carrying around since its first publication. Naturally all the secondary characters will play their part, including Ariel and Vorador. Although Defiance is dedicated to those who are already familiar with the lands of Nosgoth and its dark characters, new players will be able to count on some supplements that can clarify key passages relating to past events. In any case, despite the numerous animated sequences, it is easy to lose the thread of the narrative, finding yourself advancing in the hope of understanding something rather than animated by recent discoveries. Unfortunately, everything is all too linear and the above-average longevity is the result of expedients that force you to retrace each level in search of a door that you could not open before, without the aid of any map. You will soon realize that there is no longer any trace of those complex constructions full of tunnels to explore that had made the fortune of the first chapter. The end result is a huge inconsistency between the cosmic events you are supposed to be a part of and the ease with which you move from one chapter to another.", "date": "2004-02-27", "grade": null}