{"name": "Prince of Persia: i Due Troni", "ref": "https://multiplayer.it/recensioni/prince-of-persia-i-due-troni.html", "text": "The plot faithfully follows that of the previous episodes: once the Prince returns home he finds an evil vizier who has usurped his throne and seized power by removing anyone who tried to hinder him. Obviously who will it be up to, if not us, in the guise of the increasingly unfortunate ruler, to ensure that the shady figure soon repents of his wrongdoings? However, misfortunes, as we know, never come alone. The Sands of Time, in fact, have awakened the ambitions of the dark half of the Prince: The Dark Prince, that is, a much darker and more lethal being in battle, armed with a sword so flexible that it can be used as a whip, instead of the two more classic scimitars with which the other half, the 'normal' one, of our alter ego is equipped. Needless to say, the presence of two different characters opens up new and more interesting gameplay scenarios. Therefore, some areas of the game can only be overcome thanks to the skills of one character rather than another. However, the possibility of using one or the other identity of the prince will not be the only important novelty of this chapter of the now well-known saga. For the first time in the series there is a new game mode: it is a real race, in which you will have to dart through the dusty streets of the city driving a chariot trying to avoid buildings, obstacles of all kinds and eliminating the enemies that from time to time will present themselves in our path. Another interesting feature of the game is that it also has a 'stealth' aspect, in practice on many occasions it will be necessary to surprise the opponent, rather than relying on brute force alone, through direct clashes and therefore be able to get him out of the way without losing too much energy. The idea of creating such a title, although particularly appreciable, has not completely hit the mark as, at times, there is the impact of having little control over the prince's actions and consequently over the game. However, it must be said that this is one of the very few defects of POP which only minimally affects the final quality of the title in question. In some cases, one almost gets the impression of not being able to start moving in a particular direction without the game taking advantage of it to take over the action automatically. It's definitely a good thing to simplify the commands, especially given the poor ergonomics of the latest generation mobile phone keyboards, but in this case Gameloft perhaps went a bit over the top as it very often seems to be mere spectators rather than the protagonists of the scene. As we said, however, this is the only real drawback of the product which from a graphic point of view is truly spectacular. The feeling is that of playing on a portable console rather than a mobile phone. The backdrops, inside the buildings and in the streets of the city that we will gradually explore, are nothing short of wonderful. The sprites that animate both the prince's personalities are in turn very accurate and suggest an obsessive attention to detail on the part of whoever made them. Even the audio is of excellent quality, with melodies with a Middle Eastern flavor that contribute to making the setting even more 'realistic'. The only flaw, their duration and the fact that once finished they are no longer repeated and leave space only for some simple sound effects that recur from time to time. The cutscenes are also pleasant (once again made in an excellent way by Gameloft designers), between one level and another, where some 'nice' odalisques will keep us informed of the evil vizier's plans. PRO State of the art animations and backgrounds Innovative game mode AGAINST Accompanying motifs narrow in duration", "date": "2007-01-28", "grade": "S.V."}