{"name": "Cyberika", "ref": "https://multiplayer.it/recensioni/cyberika-la-recensione-dellaction-rpg-cyberpunk-mobile.html", "text": "If with all this talk of Cyberpunk 2077 you felt like a themed but purely mobile experience, Cyberika's review could provide you with a starting point to explore, even if this game will hardly satisfy the desire for a futuristic RPG. In fact, this too presents itself as a project that starts from very interesting premises, brings into play a good game world and then tends to get lost in a cumbersome structure, between repetitive missions and the constant more or less veiled references to micro-transactions , given the usual need to deal with free-to-play distribution. It's a shame because Cyberika has something really fascinating and at least for a few hours it can easily capture you inside it, with a very classic cyberpunk, standard RPG elements and a spirit that reminds a bit of the old Shadowrun for SNES, also thanks to the particular isometric shot from above that really brings you back to the good old days of 90s video games, a period that is also perfectly associated with the sci-fi vision of this title. Cyberika features the typical aesthetic of the cyberpunk genre The story is based on a plot that could be defined as typical for this genre: in a future world dominated by corporations and technology, the protagonist is a man looking for answers that are difficult to obtain in a city that is largely corrupt and deviated by the race for installations. The story takes up precisely the typical canon, with the narrative voice of the protagonist explaining how following a head operation he found himself miraculously alive but with strange visions and migraines, and is willing to find out more about the mysterious company that has first saved with a delicate cybernetic operation and then abandoned, leaving it in such conditions. He soon discovers that he has an artificial intelligence installed in his brain, which essentially becomes his inseparable adventure companion (a bit like the Johnny Silverhand of that other cyberpunk game) and acts as an engine and guide to the subsequent quests towards discovery of dark secrets that lie behind the glittering lights of the city Bradbury Complex (a name that is a clear tribute to the famous writer Ray Bradbury). Although it does not shine for originality, the story is well told through dialogues with a certain construct and also translated into Italian in an optimal way, therefore on the narrative front the impressions are positive. Action RPG almost MMO The quests see us explore various sectors of the city in search of NPCs to interrogate, objects to recover and a lot of enemies to eliminate, following one's vocation as a professional killer. The structure presents mixed elements between classic RPG and shooter, with the possibility of modifying the appearance of the protagonist and a deep management of the inventory, of the equipment and also of the possible cybernetic modifications to be applied to the body. The fact is that it fails to develop neither of the two areas well, given that there are no different approach possibilities to the missions - as would be appropriate for a role-playing game - nor particular skills required in the fights, considering that the auto-aim of the firearms eliminates all shooter gameplay. In any case, there are still different weapons and attacks and varied interaction with characters and elements of the scenario. There is also the possibility of interfacing with computers and terminals also to access the good old ~cyberspace~, as well as the ability to carry out hacks and all the typical techno-criminal activities that we expect in such a context complete with associated mini-games. Bradbury Complex is the city where much of Cyberika's story takes place A rather strange element of Cyberika is that it presents MMO characteristics even though it is not exactly such a title: walking through the streets of the city, at least as regards the larger and probably ~instantiated~ sections, it is possible to see other players around, but it is not possible to interact in any way. There are raid-like missions to be carried out in cooperative multiplayer but they represent a sort of mode detached from the main story and in any case this sharing of the game world seems superfluous as far as the standard game mode is concerned. Not that it's necessarily a bad thing, but we don't exactly understand the usefulness of such a choice, also because it results in a somewhat erratic behavior of the characters around the protagonist, in the ~shared~ areas. Cyberika has a lot of driving sections, which in short are quite boring The construction of the world is done with a certain use of means, which is evident from the first minutes: there are manydifferent settings to explore that make the experience quite varied, even if the recycling of assets is evident in the long run. In general, the impression is that of being faced with a sort of RPG that aims at the open world, even if it is mainly closed areas connected to each other by interlude phases. Precisely the latter represent a rather critical element of Cyberika: with a bizarre idea, the game forces you to take part in a driving mini-game for every single movement between the various settings. Although this may seem interesting at first, it soon becomes clear that this is nothing more than a forced pause to break the pace of the game and entice you to skip it by paying a certain amount of credits. This somewhat sneaky use of micro-transactions is often found: from the scarcity of recoverable resources in the game to the peaks of difficulty, in addition to these constant phases that forcibly break the rhythm, Cyberika tends to push towards in-app purchases and it is a rather annoying thing because it pervades its entire structure. As a game that might be worth paying the standard access price for, the fact that the distribution model adopted ends up partially ruining the experience is a double shame.", "date": "2021-04-24", "grade": "7.0"}