{"name": "Mafia", "ref": "https://multiplayer.it/recensioni/mafia-3.html", "text": "My Italian friends The story that forms the background to the events, although rather stereotyped and banal in some respects, is undoubtedly one of the strong points of the Take-two production. The events revolve around Tommy Angelo, a taxi driver with a rather miserable life who finds himself, during a day like many others, having to help a couple of mafia who have come out battered from a chase with relative shooting. A starting point for a new life: from that moment in fact, the good Tommy is offered to work for the Salieri family, among the most powerful and influential in the city. Starting as a simple driver, and gaining respect and credibility day after day, the story unfolds over the next 8 years, with 22 missions representing the focal points of his ~career~ during that period. As already mentioned, the plot represents the real and main stimulus to continue in the game, a true backbone capable of elevating Mafia from the crowd by giving it a robust personality. Among intrigues, struggles between families, double agents, bosses, cold-blooded killings and so on, the narrative manages to attract the player's attention, making him feel an integral part of the fascinating, albeit sick, atmosphere of that period, thanks also to the 'help of interlude scenes of excellent workmanship from every point of view .. The missions can take place behind the wheel, aboard one of the many vehicles available, or on foot, on the street or inside various premises and buildings. The city of Lost Heaven, fairly large and very well characterized, is the scene of objectives that in most cases follow the clichs of the genre: reach specific points on the map to get money, or settle accounts with the mafiosi of a rival family, or even sneak into a den of enemies, or chase and ram a car. Nothing extremely new then; to this must be added a marked linearity, very distant from what was seen in the aforementioned GTA. In fact, in Mafia, there are no sub-missions or secondary objectives or objects to collect: everything takes place on well-established tracks, within which the player has very little possibility of improvisation. Nonetheless, once you enter the rhythms of the game, the experience is certainly pleasant, especially for lovers of this particular genre of games. Unfortunately, however, all that is good in Mafia has to deal with a truly deplorable technical achievement. Conversion is not my passion Among the most successful aspects of the original on PC, there was undoubtedly a respectable graphic component, able to fully support the narrative by placing the player inside a lively, credible city, teeming with activity, beautifully recreated and full of details. Compared to this version, Mafia on Ps2 is on the contrary disheartening, especially in the driving sections. Virtually every technical flaw is present in all its ~glory~: texture resolution is ridiculous, PSone-level, frame rate is wildly unstable, animations woody, polygonal models extremely crude and simplistic, and the vast majority of graphical effects of the original have disappeared. As if that weren't enough, the visual horizon has been devastatingly reduced, with a marked pop-up that barely manifests itself within the perennial blanket of fog that pervades the streets; the feverish city activity has also completely disappeared, in favor of a couple of cars and a handful of ordinary people on the street. But if most of these flaws can be overshadowed in an attempt to focus on the game itself, this cannot be said for the grueling uploads that happen with a truly unsustainable frequency. Not only between one mission and another, but also when, on board a car, you enter one of the 3 large areas into which the city is divided; and we are not talking about a few seconds, but more than half a minute of waiting. Taking into account that, during a mission, it may be required to cross the length and breadth of the metropolis only to then return to Salieri's bar - which serves as an operational base -, what you get is a daunting test of endurance for even the nerves of the more patient player. A real pity, even in the face of the excellent physics of the cars implemented by the programmers: the cars give the feeling of heaviness, they embark, roll over following impacts and react correctly to the user's commands. Practically the opposite speech for the walking sections: in fact, on these occasions the graphic quality is certainly better, especially in the interiors, ben detailed and appreciable. But in this case it is the control system that leaks, badly adapted to the Ps2 pad and excessively cumbersome on numerous occasions; all is certainly not facilitated by the camera, often unable to follow the action correctly with relative frustration of the user. The weak point of the entire game is also the artificial intelligence, extremely questionable for the behavior of gangsters and ordinary citizens and further ruined by bugs of various kinds. How else could you describe a passerby standing in the middle of the street, or a couple of mobsters looking at each other while the player is filling them with lead? In this sense, the excessive precision with the firearms of one's opponents is forced, practically snipers capable of hitting the nice Tommy Angelo, perhaps hidden behind a wall, even from tens of meters. We conclude at least on a positive note, or rather the sound: the good Italian dubbing and the appreciable effects are accompanied by excellent orchestrated pieces, perfectly themed and capable of conducting every moment of the game as best as possible. Comment Mafia represents one of the worst conversions from PC that we have seen in recent years: not only has the transition to Ps2 disfigured the excellent graphics of the original, but it has even been able to affect playability, sunk by bugs but especially from unbearable uploads to say the least. By managing, with an enormous effort of will, to overlook these serious defects, it is still possible to see a good, intriguing, stimulating and splendidly characterized title both for the setting and for the characters. But in any case it would be a matter of accepting a miserable and listless adaptation job like few others, an element in our view that is unacceptable in the year 2004. Pros: Excellent setting and intriguing narration Well-crafted sound Potentially very good game plan Cons: but marred by an unacceptable technical realization Control system badly adapted to the Ps2 pad Various types of bugs and flawed AI Acclaimed by critics and the public almost 2 years ago, at the time of its debut on PC, Mafia was undoubtedly one of the most valid productions that have followed the path taken by Grand Theft Auto. Although it largely followed the game mechanics and general structure, Mafia proved to be able to stand on its own legs - without therefore being constantly flanked by the Rockstar Games blockbuster - above all thanks to a completely different, captivating and beautifully recreated setting. In fact, the events narrated in the Illusion Softworks effort took place entirely in America in the 1930s, the America of prohibition and of the mafia families who controlled the cities with the approval of corrupt policemen. After several months, Take-two has decided to convert Mafia also on consoles, specifically Xbox and Ps2; the version for the Sony monolith was the first to debut on the market, and it is therefore this one that we have tested in the following lines.", "date": "2004-02-24", "grade": null}