{"name": "Baldurs Gate Dark Alliance II", "ref": "https://multiplayer.it/recensioni/baldurs-gate-dark-alliance-ii.html", "text": "Characters and skills Dorn  Human Barbarian The features are very similar to those of William Wallace (see Braveheart) and the skills do not differ much either: a true hand-to-hand ace and master of arms. Vhaldra  Elven Nun A decidedly singular elf, characterized by a dark gray complexion and the ability to lead hands. Ysuran - Elf necromancer Much more classic in his elf guise than Vhaldra, this character is able to use black magic in all its forms: from the summoning of the undead, to more classic spells such as fireballs. Borador  Dwarf thief This hero, miniature in height but not in size, in addition to being an innately skilled crossbowman, is also capable of picking locks and robbing enemies. Allessia  Human cleric This attractive damsel with irrepressible forms is a rather balanced mix between the combat and magical arts. Unlike Ysuran though, she practices white magic. Gates of tomorrow Just like in a puzzle, Baldur's Gate Dark Alliance II places an adjacent piece to the prequel, reconnecting to it to offer new ideas to a plot that is in itself rather trivial and not very thorough. Black Isle Studios justifies the presence of five new adventurers with the rather mysterious disappearance of the three who previously crossed the walls of Baldur. Five heroes in fact, each with a good reason to take the long path that leads to the Tower of Onyx, the true bulwark of every project of the Dark Alliance. Within the city walls you will meet some characters with whom to interact, even if most of the NPCs present will not present any form of interaction. Furthermore, and this is the first real novelty, certain characters will only interact with specific party members, offering them very lucrative sub-quests, both in terms of money and experience points. All this in order to induce players to undertake the adventure several times in order to discover all the missions present in the game, to which we must also add the incentive given by two secret characters, unlockable by finishing the game at different levels of difficulty . Structured exactly like the previous chapter, Baldur's Gate Dark Alliance II offers players a substantial challenge to the last blow, complete with multiplayer to reinvigorate its essence strongly prone to hack & slash. Unfortunately, the hopes of seeing the number of playable characters expanded to four differ from the final result, which is the same as the prequel with the only possibility of playing in two. Moreover, precisely because of the variegated differentiation of the various heroes, creating a complete and well-assorted party is a difficult undertaking with the limitations opted by Black Isle Studios; who also sinned of superficiality in balancing the various characters. Thus, entry into Dorn's party will become almost indispensable, undoubtedly too powerful when compared to the others, to be able to continue in the game. Very stimulating, however, is the presence of the necromancer Ysuran, adept of the dark path of black magic as well as the character with the darkest past. As is now customary, the growth of the character will take place thanks to the various level ups, which will give players skill points to be distributed at will. Strange, not to say absurd, the choice to equip each bow with infinite ammunition, with the result of removing that pinch of strategy linked to parsimony present in the predecessor. On the other hand, the possibility of embellishing one's equipment with precious stones has been implemented, which will give weapons and armor additional status as well as greater power. The real renewal, made to this second episode of Baldur's Gate in the console version, lies above all in the control system. Black Isle Studios has expanded the intuitive control system of the first chapter by adding a practical interface that can be activated with the left trigger and containing four moves specially chosen by the player that will go to the front buttons. The rapid selection of energy and mana potions, which will be used in real time thanks to the black and white keys, is also always convenient. The camera is substantially unchanged, which offers the possibility of rotating 360 degrees on the axis and, in single player, even of an almost imperceptible zoom. Unfortunately, the lack of transparency made to the background makes the well-established camera management in vain at times. In fact, it will frequently happen to run into areas with poor visibility in which very little can be done to find an at least acceptable solution. Well characterized and made up of a good number of polygonsi are the models of the main and secondary characters, as well as enemies. To the scarce variety of the latter, which however differ little or nothing from the prequel, we must add an A.I. rather incomplete, consisting of monochord attack patterns and some rather showy jams. As with the enemies, even the game environments, even if carefully created, are unable to shake off that marked feeling of deja vu, even proposing some locations that are completely similar to the predecessor. As far as the audio sector is concerned, however, we find excellent reasons and a good dubbing in Italian, despite the fact that some characters make us smile a little due to the vocal choices adopted by the actors. Final comment Ultimately, this Baldur's Gate Dark Alliance II turns out to be a spin off in all respects, with few innovations on the horizon and that constant feeling of deja vu. Some choices made by the developers are somewhat questionable and the lack of a four-player multiplayer is felt a lot. To conclude, we strongly recommend the purchase to all those who have not played the first chapter of this series, while for others it will be advisable to carry out a test ride. Pros: Five characters from the start. Great control system. Multiplayer is always fun... Cons: ...although still restricted to two players. Badly calibrated AI. Palpable feeling of deja vu. To go back to the dawn of the now legendary epic of Baldur's Gate you have to take a long journey back in time; more precisely back in 1999, the year in which the Bioware crew began to take the first indelible steps in the world of videogame entertainment. Since then this successful saga has met with enormous successes with two chapters on PC and one, Dark Alliance to be exact, proposed in 2001 on Ps2 and later for Xbox by the Americans of Black Isle Studios. Having touched the sky with a finger, this division of Interplay, dedicated specifically to RPGs, has passed through every chamber of the underworld, until the dramatic and premature conclusion represented by a lowering shutter. An image made even sadder by the semi-contemporary release of their latest work: Baldur's Gate Dark Alliance II. In the world of entertainment it is customary to play down every situation with a rhetorical and at the same time heartening ~the show must go on~. Not even we can exempt ourselves from this unwritten rule and so here is our review of this latest work from Black Isle Studios.", "date": "2004-02-17", "grade": null}