{"name": "La Tigre e il Dragone", "ref": "https://multiplayer.it/recensioni/la-tigre-e-il-dragone_a.html", "text": "A Sword a Legend The game follows the plot of the film, alternately putting you in the shoes of one of the three main characters. From time to time after continuous series of fights we will go through the different sections of the game, each made up of five chapters corresponding to the single main scenes of the film. The fights are the fulcrum of the title and are quite fun, even if decidedly repetitive and without that acrobatic style that amazed the audience in cinemas. The developers of Genki have tried to give a spectacular imprint to the martial clashes but have not succeeded, their only significant attempt is the introduction of a special move that allows you to block the opponent and, by typing the right combination of keys, to hit him to death with an acrobatic evolution. For the rest, the control system appears to be quite conventional, even if the idea of attributing the jump function to the right trigger is not very convincing, allowing you to hit, through the four main buttons, both with weapons and with your bare hands. unfortunates that we will meet on our way. We will also be able to take short shots by pressing the black button which, if taken near a wall, will allow us to run on the surface of the same. After each fight we will gain experience which will increase our attack and defense capabilities as well as allowing us to perform new combos; this small and just mentioned rpg imprint had to be deepened more to allow greater personalization and growth of the character himself. In our journey we will be guided by some indications that will show us the right way forward (better than any modern navigation system), and we are referring to lanterns which, depending on their color, will indicate whether or not we will be able to access the next area. By facing enemies and completing the required mini-quests, we will be forced to retrace our steps often, making the game experience decidedly frustrating and, if you add to this the fact that we will be forced to complete the same levels, with some small variations , with the three characters, you will understand that the gaming experience is quite boring. It will certainly be exciting to tackle the stage of the ~walk-flutter~ among the bamboo plants, an iconic scene of the film, even if unfortunately in the game it is reduced to a mere jump from one side of the screen to the other (like a platformer? Well.. in short we don't want to offend a genre) but having to do it with both Jen and Li Mu Bai is decidedly excessive. There will be clashes with charismatic characters from the film such as Black Cloud and Jade Fox. Philosophy and sharp swords As mentioned above, the combat system is discreet and makes the clashes interesting enough, certainly a greater differentiation between enemies and the possibility of performing more evolutions would not have hurt. Unfortunately the jumps and acrobatic fights are particularly clumsy and in addition to the animations bordering on decency, even the scenarios do not offer any setting worthy of note, on the contrary. The dull textures and polygonal models are very similar to each other, except for the protagonists, who unfortunately remind us of the origin of the title, that is a mere porting of the PlayStation 2 version. The camera, which is essential in every scrolling fighting game self-respecting, fails to get us into the heart of the action and often, too often, does not offer us the best possible view. Noteworthy however are the music, taken almost entirely from the film, very mystical and decidedly suggestive. The Italian translation of the subtitles is also sufficiently accurate. Tiger, Hidden Dragon does not support Xbox Live in any way, and this is certainly a flaw since being able to download some extra missions, once the game is finished, would have added longevity to an unfortunately insufficient title. Regarding the end of the game, however, it must be said that different endings are possible and also new extra contents that will vary according to the evaluations we obtained at the end of each level. Comment Honestly it is strange that Ubisoft has taken the responsibility of publishing a title like Tiger and Dragon, given that we are used to a very different quality of the games put on the market by the French house. We can try to justify the best European publisher by saying that he has tried to follow in the footsteps of a title like Enter theMatrix which, albeit modest, only due to the fact that it is set in the universe of Neo and his companions, has been very successful. In our opinion, however, the differences with what happened with Matrix are significant and above all one has a great impact on the outcome of the operation (we will be happy to be proved wrong by the sales figures) and that is the calculation of the exit times. The Genki title came out far too late; to justify such a long wait, the game should have been a true masterpiece and unfortunately it is not, failing even to earn enough, and furthermore the delay will not allow the driving force of the film's success to be fully exploited. In conclusion we are in the presence of a mediocre fighting game which, although inspired by a masterpiece film, is only recommended for avid fans of the celluloid version. Pros: Lots of fights Beautiful music Recreate the beautiful atmosphere of the film ... Cons: ... without being able to involve technically is a mere porting of the ps2 version where are the fantastic stunts of the film? Four years ago one of the films that most struck the attention of the media and the public was Tiger, Hidden Dragon, a Chinese blockbuster which, combining epic acrobatic fights with a solid fairy-tale plot, was very successful all over the world, winning even four Oscars . Quite a lot for an oriental film. The plot set in 19th-century China revolved around a sword called Green Destiny and the rather charismatic protagonists, above all the Zen warrior Li Mu Bai, endowed with extraordinary abilities, fought each other in a way never seen before: making leaps incredible and almost angelic movements using the most disparate techniques based on martial arts. Developed by Genki and published by Ubi Soft, the playable version of the film arrives after a long time, we will decide at the end of the article if the wait has been fruitful or not. We will guide the young aristocrat Jen, the master Li Mu Bai and her warrior friend Yu Shu Lien in the development of the story.", "date": "2004-02-03", "grade": null}