{"name": "Judgment", "ref": "https://multiplayer.it/recensioni/judgment-recensione-ps5.html", "text": "A young lawyer who decides to become a private investigator after a traumatic event, a ruthless serial killer who gougs out his victims' eyes, a memorable cast of characters and the fascinating backdrop of a city that Yakuza fans know very well: of this and more we will talk about in the review of Judgment for PS5. Almost two years after its launch on PlayStation 4, the excellent spin-off developed by Ryu Ga Gotoku Studio also arrives on next-gen platforms with an improved edition from a technical point of view, which not only boasts a higher resolution and a very stable 60 fps, but also loads almost instantaneously. History Judgment, the protagonist shows the lawyer pin. The protagonist of Judgment is Takayuki Yagami, a talented lawyer who decides to abandon the profession when a boy who had been cleared of murder charges commits a heinous crime, irreparably undermining his reputation. Raised on the streets of Kamurocho, the fictitious district of Tokyo inspired by Kabukicho, Takayuki uses his physical abilities and his knowledge of the criminal underworld to reinvent himself as a private investigator together with his lifelong friend Masaharu Kaito, a gruff but shrewd ex-Yakuza. Usually engaged in assignments that have to do with extortion, swindling and marital infidelity, Takayuki finds himself once again at center stage when an old acquaintance of his, Kyohei Hamura, captain of the Matsugane Family of the Tojo Clan, is accused of having killed a man the eyes. However, the investigations reveal that that crime was not the only one nor the last in a long series, and that the killer is still at large. But who is it and what are its motivations? Judgment, one of the game's many cutscenes. Narrated in an extraordinary way as usual, thanks to the intensity of the original interpretation and an excellent direction, the story of Judgment was written by the historical producer of the Yakuza series, Toshihiro Nagoshi, and can also be enjoyed by Italian players without limitations: the game boasts both Japanese and English dubbing and Italian subtitles. The thirteen chapters that make up the long campaign of the game alternate insights and twists, the usual abundance of secondary quests ever so brilliant and a duration that can even touch one hundred hours if you decide to try your hand at everything that the experience has to offer. offer, but which drops to just under thirty hours if you want to go straight on. Structure Judgment, a look at Kamurocho in the evening. In short, we are talking about a truly full-bodied product, which while on the one hand cannot offer a free upgrade for those who owned the PS4 version nor a save transfer system, is offered at a price of only 39.99 euros. A frankly very accessible sum, if we consider the quality and the many contents included in the package. The structure of Judgment in fact takes up that of the classic episodes of Yakuza, but with an extra gear: the Kamurocho that we will be able to visit during the adventure is the most refined and interactive ever, and furthermore there is no longer a dividing line between phase exploration and combat, which happens seamlessly as we roam the streets of Tokyo's expansive district. Novelty Judgment includes a multiple choice conversation system. Added to this are the innovations introduced to characterize Takayuki Yagami's peculiar detective story, which take the form of tailings, photographic evidence, crime scene analysis, frenetic chases based on quick time events, sections driving a drone, burglary of locks, interrogations in which to guess the right question and exhibit overwhelming evidence. ~Objection!~, exactly. Let's be clear: the specific weight of these features is absolutely not such as to make one cry for a miracle, they are simply puzzles added as part of the linearity of the missions, but in any case it is a variation on the theme that increases the diversification of the mechanics and helps to make a system that underneath remains rather banal less repetitive. Extra activities Judgment, one of several SEGA Clubs that we will find on the map. In this regard, obviously, the many extra activities typical of the Yakuza series could not be missing: the coin-ops of the SEGA Clubs (in this case Space Harrier, Fantasy Zone, Puyo Puyo, Motor Raid, Fighting Vipers, Virtua Fighter 5: Final Showdown and the shooter Kamuro of the Dead), the OutRun mini-cabin that replaces the pinball machine in the protagonist's office, the rooms in which to play cards, Mahjong and Shogi, the battling center and darts. There is no shortage of news on this front either: it isYou can use the drone and modify it to face frantic speed races, participate in Play of the Goose-style mini-games in virtual reality and finally establish love affairs with several girls, taking them out on a date, buying them gifts and so on, in that which stands as a real dating sim. Gameplay Judgment, the action combat system includes some new maneuvers. The gameplay takes up the traditional Yakuza formula, with our character moving freely within the map, reaching the points indicated from time to time to carry on the main story or interacting with the NPCs linked to the side quests, or even dedicating to the many extra activities we mentioned earlier. However, the streets of Kamurocho are teeming with bullies, thugs, criminals and mafiosi ready to challenge us: in Judgment this transition takes place in a transparent way, without creating a special space around the contenders. Speaking of the combat system, the first thing that comes mind is the sense of liberation that comes from being able to move again in an action context, and that you can also experience if your first approach with the SEGA series was the excellent Yakuza: Like a Dragon. The turn-based battles of the game starring Ichiban Kasuga undoubtedly had a certain degree of solidity, but they were also linked to dated dynamics and artificially lengthened the times of the experience, however requiring boring grinding sessions in some moments of the campaign. Judgment allows you to face any enemies without boundaries or loads. The action style, on the other hand, lends itself to much more immediate resolutions as well as retaining the typical emotional charge of the franchise, which from a narrative point of view is one of the best at building motivation and imbuing the most important duels with meaning, then leaving us free to vent that rage by bombarding opponents with devastating combos and ruthless finishers instead of standing aloof and calculating how many points we have left to perform moves, which party member needs medicine or which target to hit first. The possibility of using a more multifaceted and convincing version of the classic combat system of the franchise, however, represents a bonus that should not be underestimated. Compared to Kazuma Kiryu, the new protagonist is involved in more challenging and interesting clashes on average, which must be resolved by alternating the style of the Crane and that of the Tiger, ideal respectively for brawls and one-on-one comparisons. Takayuki's repertoire also includes spectacular rebound attacks on walls and the aforementioned finishers typical of the series, many of which, however, are not unpublished. Judgment introduces the tailing mechanic into some missions. The inventory is once again essential to be able to recover health before being defeated, so it is good practice to fill it with nutritious foods or energy drinks to be purchased at a convenience store in view of battles that promise to be complicated. After the clashes, health can be recovered by eating something at one of the many restaurants in Kamurocho, unless the character has suffered mortal wounds, a novelty of Judgment: to cure them it will be necessary to use kits or contact an illegal doctor who operates in the sewers. Added to this well-tested system are the investigative innovations we mentioned above, including tailings, analysis of evidence, photographs and drone footage. Mechanics that neither revolutionize the experience nor are they legitimized by an independent collocation, but propose situations that add that pinch of variety necessary to mask the simplicity of the traditional formula. Technical realization Judgment takes us to visit the best version of Kamurocho. So let's come to the central aspect of Judgment for PS5, that is the technical realization. Well, the improvements are clear and clearly visible: where the original version of the game struggled to maintain 30 fps even on PS4 Pro, while remaining tied to a 1080p resolution, this remaster offers a very solid 60 fps in the face of a resolution most likely brought to 1440p, as well as instantaneous uploads. The doubled frame rate has a very positive effect on the fights, returning a better perception of the animations and therefore of the timing necessary to successfully dodge or parry the blows, especially during the most demanding boss fights. However, even the exploratory phase benefits from the greater fluidity and greater definition of the PlayStation 5 edition, which therefore carries out its task in maniasra effective. For the rest, the considerations we expressed in the review of Judgment for PS4 are valid: the game boasts excellent polygonal models, extraordinary cutscenes and a setting that on the one hand has always been the same for years, on the other it is presented in an ever so multifaceted and interactive, with the possibility of visiting the inside of various buildings and, in general, enjoying the great atmosphere that this virtual trip to Tokyo can offer, especially during the evening sequences. We have mentioned that Judgment includes both voice acting in Japanese and English, both with their own lip synchronization, confirming the care that Ryu Ga Gotoku Studio has always put into its projects. Well, we still deem the original interpretation unattainable, but the western actors have given a good performance and the soundtrack is confirmed to be very valid, rich and capable of emphasizing the topical moments of the campaign in the best possible way.", "date": "2021-04-22", "grade": "8.4"}