{"name": "Super Farm", "ref": "https://multiplayer.it/recensioni/super-farm.html", "text": "Once you have chosen your animal nature among the initial four (pig, goat, rooster and rabbit), you will enter the first of over twenty battlefields available in the story mode, the only one linked to the single player together with the challenge. In arenas with a moderate rate of interaction we will have to battle opponents in six different types of game, which will range, just to name a few, from having to collect the greatest number of objects in the pre-established time, to having to break rivals' teeth. All this by making use, just like in the unforgettable Power Stone for the Dreamcast, of a large number of items with multiple functions. Obviously also the used items will be in line with the hilarious vein of the game; proposing, in addition to the anvil and the hoe typical of a certain philosophy derived from the Looney Tunes cartoons, also items of a unique bizarreness, such as beans and manure. Of the latter, it is better if the effects, however obvious, you discover for yourself. The stages will also feature rather unusual elements of interaction, such as the ~gunship~ cow which, in a few fractions of a second, will be able to hurl the unfortunate person who will use it from one pole of the screen to the other. Also in this case it is advisable that you learn the unusual methods of use yourself. Of Super Farm, apart from the marked desire to make people smile with today's means, little else remains. The intrinsic flatness of this anomalous beat'em up will soon make the voice of monotony heard, since, although the developers have tried with multiple solutions to vary the gameplay as much as possible, basically the things to do always remain the two or three. Reading the Asobo Studio game in this key, the multiplayer mode is of little use, also a victim of a premature death of emphasis. Here too there are various modalities, which will range from cooperatives to versus but which, as anticipated, will fall into a sort of catalepsy in a few sessions. The technical requirements of such a game can easily be summarized in two factors: graphic style and framerate. If from the first we find everything necessary, with the exact polygonal re-proposition of the cartoon syle made of pastel colors and funny polygonal models both for design and for animations; from the second we have more than one disappointment, despite the fact that in single player the title Asobo Studio manages to get by in some way. In fact, the largest and most frequent frame drops occur when the screen is divided into splits with, moreover, a conspicuous decline in detail. On the other hand, the audio sector respects the needs, sober to the right point in its light-hearted and unpretentious music, and its sound effects at times irresistible even if in a minimal numerical presence. Final comment Ultimately Super Farm succeeds in its aims but only for a short period of time. The first few bars of the game are fun, supported by hilarious FMVs and simple and cheeky gameplay. Unfortunately, the passing of the minutes makes this title monotonous, to which little resistance manages to oppose a multiplayer mode that is too aligned with the main game. Ultimately, the title Asobo Studio is mostly recommended for young users, or in any case with limited gaming experience. Ideal for a rental instead for veterans. Pros: Extremely entertaining FMVs. Pleasant sound. Cons: Monotonous and flat. Dancer frame rate. Main mode too short. The woman: the greatest mystery that our beloved World knows. Even bigger than Ancient Egypt or the X-Files that made us think so much during the long years of stay on the small and big screen. Many tried, have tried and are still trying incessantly to solve this immensely important enigma, some with algerbraic equations, some with fine intellectualism. However, the only common certainty in the lucubrations of all the boys can be summed up in a single, pragmatic sentence: ~Go and understand these women~. Yet the man, so ineluctably different, cannot exist without the woman, recognizing in her the only true complementary form. Commonplaces, of course, which have however led to inspire any male being with the slightest creative vein. Among these also the little-known developers of Asobo Studio, who for the occasion of their first production, Super Farm, were inspired by the main object of desire of the majority of the world's population: Pamela Andersson. However, the need for a script transformed the forms of the buxom Pam into those of a bizarre little birdor, complete with a red bathing suit in perfect Baywatch style. In fact, the demented story that surrounds the game begins with the arrival of this sex bomb in a farm inhabited by four, needless to say, very horny subjects. Impossibly stereotyped and rather demented, the four farm animals will compete for the heart of the ~hot female~ massacring each other by all sorts of means. From here come fun FMV cut scenes that will act as an interlude at each level, showing events that are nothing short of grotesque and, at the same time, hilarious.", "date": "2004-01-26", "grade": null}