{"name": "Metal Arms: Glitch In The System", "ref": "https://multiplayer.it/recensioni/metal-arms-glitch-in-the-system.html", "text": "Robot forewarned is forearmed The protagonist of the game is Glitch, a small robot enlisted by the resistance to fight the evil General Corrosive and his army, guilty of having reduced the originally peaceful planet of androids to a theater of war. Based on this certainly not very original plot, the user's adventure begins, distributed within about 40 levels of pure destruction. Indeed, the disintegration of enemies and their structures is the leitmotif of Metal Arms: Glitch in the System, which as a ~classic~ shoot'em up invites the player to tear apart anything that stands in his way without too many sorry. The arsenal made available to Glitch serves precisely this purpose, being able to include a considerable number of primary and secondary weapons, which can also be used simultaneously to give rise to devastating combos. The right arm of the robotic protagonist can in fact house the main fire tools such as machine guns, rocket launchers, rifles and so on, while the left arm most often performs the task of throwing grenades and the like, but also leaving room for special devices capable of to improve the performance of primary weapons. The control system makes the selection and use of the various objects easier, relegating the input to fire to the back buttons and the appearance of two distinct drop-down menus from which to select the desired offensive tool to as many buttons. A few minutes of play, therefore, are enough to find yourself perfectly able to face the henchmen of General Corrosive, also equipped with an AI up to par (and indeed often guilty of potentially frustrating game phases) and a satisfying dynamic damage system: hitting an enemy robot in the arm, for example, means seeing the joint detach or sway out of control, and so for all the different breaking points of the opposing robots. However, what makes Metal Arms: Glitch in the System a decidedly interesting product is the considerable variety of game situations presented to the user; although the Swinging Ape title does not differ much from the typical canons of action games, the efforts made by the developers to make the playful experience as stimulating as possible are evident. To begin with, the level design of Metal Arms: Glitch in the System has been carefully studied in order to offer the right mix between a pressing blasting action and a series of puzzles often and willingly based on the interaction between the user and the convincing physical model that regulates game scenarios. To this we must then add the very welcome presence of a fair number of vehicles of different nature that can be freely used by Glitch within the scenarios, as well as some sections entirely dedicated to driving them. The icing on the cake crowning an absolutely apt game structure is represented by a particular object, available during the adventure, which allows you to take control of the opposing robots, paving the way for pleasant nuances oscillating between stealth and sadistic pleasure to exploit an enemy to do the dirty work. Comparing systems On a purely technical level, Metal Arms: Glitch in the System blatantly manifests its nature as a multiplatform title, and does so in the most obvious way possible; that is, electing the Xbox version as the best, closely followed by the Gamecube version and relegating Playstation2 to last position. As for the first two classified (separated by very few points), the Swinging Ape title shows a more than discreet cosmetics, characterized by a good quality of the light effects and animations and by a polygon count that may not be stellar but certainly at the height. On the other hand, the definition of the textures is rather disappointing, as are some non-transcendental drops in frame rates that could certainly have been avoided. Defects, the latter unfortunately considerably more marked in the Playstation2 version of the game, which is also orphaned of a considerable number of polygons and for this reason the victim of more angular and less impressive scenarios. The instability of the frame rate, in this case, is then combined with a lower precision of the control system, which significantly penalizes the Sony user in terms of accuracy during firefights, also partially nullifying the dynamic damage model mentioned earlier. The quality level of the sound, on the other hand, is identical in all three versions and settles on completely satisfactory values: in fact, both thethat the dubbing in Italian, while the music (however good) is exploited too little during the game. Comment Metal Arms: Glitch in the System may not be the sleeper hit of the year (as much of the American press has had the opportunity to define it), but it is still a pleasant title, well made and bearer of a solid and captivating game structure . And this is no small thing. Identifiable as a cross between Halo and Ratchet & Clank with a good dose of irony, Metal Arms: Glitch in the System has the only defect of not being able to count on the level of attention to detail of large productions, remaining ~only~ a product very funny. (NB: As for the Playstation2 version, its palpable technical inferiority is worth the deduction of half a point from the overall vote.) Pros: Intelligent level design Varied and fun gameplay Remarkable longevity Cons: Unstable frame rate Difficulty level sometimes unbalanced Music not very present For some time now we have heard less and less talk of sleeper hits, or rather of those products which, unrelated to the phenomena of hype, manage to curry favor with critics (and sometimes even with the public) at the time of their release on the market. Well, the Metal Arms: Glitch in the System subject of this review seems to possess the aforementioned characteristics...", "date": "2004-01-19", "grade": null}