{"name": "Max Payne 2: The fall of Max Payne", "ref": "https://multiplayer.it/recensioni/max-payne-2-the-fall-of-max-payne-2.html", "text": "Late Goodbye For those unfamiliar with the game, let's immediately give a due explanation: MP is a third-person 3D action that owes its success mainly to the frenetic action, the well thought-out story and the introduction of bullet time, i.e. the possibility for the player to slow down the action in Matrix style and hit opponent enemies more easily and spectacularly, especially in the most agitated game phases. This system has met with considerable success, and Remedy could not fail to implement it in this second chapter as well, perfecting and expanding it in some of its aspects, precisely in the possibility of reloading the weapon in a fast and spectacular way, and in a new mode, in which the screen will take on a sepia tint and while Max will move normally, the enemies will act more and more slowly in relation to the eliminated number of them. During the course of the adventure we will also be able to control Mona, who will have movements very similar to those of Max, but will differ from them for the equipment at her disposal, which abandons some destructive weapons in favor of a greater variety and usefulness of the same. Obviously there will be painkillers, which can be found in cabinets or released by killed enemies, and will be used to decrease the degree of fear of our main protagonists, corresponding in practice to the energy bar seen in many other games. The available moves will range from jumping high or horizontally to avoid bullets, to crouching to cover behind an obstacle, shooting one or two hands and using the repeatedly mentioned bullet time. All these actions require full use of the Ps2 and Xbox controllers, which behave excellently, except for the due (small) initial practice. The left analog stick has the ability to control Max and Mona, while with the right one we'll guide the view (and therefore the viewfinder) of the two characters, which will prove to be fundamental especially in the many stunts we'll do during bullet time. The back buttons will instead be used to shoot (and activate the same bullet time in the case of the PS2 controller) and the front buttons to perform the rest of the actions. Noir mon amour The atmospheres that pervade MP2 go hand in hand with the plot, and therefore have dark and noir hues, as well as contributing heavily in making this sequel a title that will keep the player attached to the pad until its completion. Particular mention should be made of the amusement house where Mona Sax is hidden, which denotes a very high attention to detail, both from a structural and ~cognitive~ point of view. The missions have the primary purpose of eliminating opponents to enter a particular building or reassemble a new piece in Max's troubled mind; however, there will be levels in which the psychological factor will be the predominant component, or others in which we will have to defend some characters, such as the already known (to the owners of the first chapter) Vladimir Lem. Finally, our actions will influence precise moments of the adventure, when some characters will offer to lend us a hand or will reveal secret locations if helped, but in general the story revolves around the story between Mona and Max and the tormented mind of the latter, which will manifest itself, like the first chapter, in some levels that represent Max's nightmares. mature and supported by a well thought out story that does not fail to touch on strong and adult themes, which combined with the discreet component of blood and the harsh language that will present itself on more than one occasion during the course of the adventure, have contributed to making have the 18+ sticker in the game. Technically the strength of Max Payne 2 lies in the physics engine, that famous Havoc that we will also see in Half Life 2, which allows a much more realistic behavior of the surrounding environment than many other titles of the genre. Each object with which Max (and Mona) will interact will move in relation to what is happening, will fall, will move and will not remain motionless; the same thing for the bodies of the enemies, which will jump in the air or on the ground depending on where they will suffer the blows or explosions, remaining among other things visible for most of the time. In any case, the title is striking not for its brute power or for the number of polygons, but for the details that cover the stages, for the careful reconstruction of the structures and for thetextures used, at least on Xbox. Yes, because the gap between the two versions is quite marked and denotes how the porting to Ps2 was hasty and not attentive to the diversity of the machine in structural terms (the game being a PC port), and to the lower computing power of the console sony. If on Xbox we can count on excellent plays of light, vivid and excellently made textures, an always high frame rate and a generally top-level realization, the situation on Ps2 is different, starting from the lower resolution, passing through the lack of 'shadow for the main protagonist up to decidedly more dull textures. If these aspects do not affect the gameplay and make the two versions virtually identical, the same thing cannot be said for some slowdowns that occur in the most crowded game situations, for the lack of the Quicksave function (the most serious lack in our way of see) and for the length of the uploads, very high on Ps2 and minimal on the Microsoft console. The sound sector can boast an excellent dubbing in Italian, which reaches very high peaks for the main protagonists, and a soundtrack of the same bill, enriched by well-made sound effects (the distortion of the same during the bullet time should be noted). The possibility of exploiting Dolby Pro Logic II on Ps2 and Dolby Digital on Xbox conclude our positive opinion on the technical sector of the game. Comment Max Payne 2 is a very valid and inevitable game for all lovers of the genre, which has the only small (big) defect of having a below average duration, even if absolutely satisfying both from a playful and narrative point of view. A title therefore recommended for both the Ps2 and Xbox versions, towards which owners of both consoles should go, thanks to a superior technical component and the lack of some defects which on the Sony console partially undermine the gaming experience , and by virtue of which half a point must be deducted from the final vote. Pros: First-rate atmosphere and plot Solid and fun gameplay Excellent audio and video sector Cons: Duration from 6 to 8 hours, few incentives to replay it Porting on Ps2 hasty Max Payne can be defined as the atypical hero par excellence, in stark contrast to the spotless policeman and ready to help others. Max is a person tormented by her past, who found herself watching loved ones around her die as if they were flies. After personally avenging the deaths of his wife and son, and coming clean with the help of Alfred Woden, Max thought he had archived his past, which coincided with the abandonment of the DEA drug squad, and a return to his first love, or the NPD (New York Police Department). But the feelings of guilt were too strong, and the reappearance of Mona Sax during a routine investigation will bring back in Max's mind all those wounds that our hero had struggled to heal. The story behind this sequel has even more pronounced noir hues than the previous chapter, which intertwine perfectly with the love story between Mona and Max. Finally, Playstation 2 and Xbox owners will also be able to play these two characters, for a short but intense story.", "date": "2004-01-19", "grade": null}