{"name": "Counter Strike", "ref": "https://multiplayer.it/recensioni/counter-strike-2.html", "text": "Terrorists and Anti-Terrorists. The game structure of Counter Strike is among the simplest conceivable for a multiplayer fps, at the beginning of each game you choose whether to be part of a team of terrorists or one of anti-terrorists who will have to compete in two types of clashes: in one the terrorists must plant a bomb in some strategic points of the stage, defending it from the attempts of the anti-terrorists to defuse it; in the other, the anti-terrorists must free the hostages captured and kept hidden by the terrorists. Each team can also win by simply eliminating all opponents. Unlike the PC version, the Xbox version also allows you to play in offline mode, which however consists of nothing more than to try your hand at the same stages of the Live version with opponents and your teammates controlled by the CPU, choosing from four standard difficulty levels plus one customizable. In the end, this mode is nothing more than a huge tutorial which, however, does not teach anything that cannot be assimilated by playing directly online with human opponents and, if it must be the reason that pushes those who do not have Xbox Live to buy Counter Strike , frankly, it is very little and it is advisable to stay away from it. Of course, once you get on the net, Counter Strike flexes its muscles and the fights that manage to come to life are memorable at times. You choose a Host among those available, in battles of up to sixteen players, divided into twenty maps (two already available for download via Xbox Live) and you decide whether to join the team of terrorists or anti-terrorists. When a fight begins, you can buy weapons, ammunition and equipment, with the knowledge that each death will deprive us of any acquired items and that each kill will give us money to equip ourselves again. Participants in the game can vote for the map in which to fight next and everything can be heard via the microphone, provided you get used to hearing even the closest English spoken, given the massive presence of American players, real star performers of this game. From PC to Xbox. The controls have been optimally adapted to the Xbox pad with the inclusion of a couple of tricks such as the use of the left analog trigger which allows you to turn 180 and an aiming system which, although not as precise as the keyboard/ PC mouse, is well made. Even access to the shop where you can buy the paraphernalia with which to face the clashes is soon mastered and in the blink of an eye you find yourself projected into an endless barrage of explosions, amidst laughter and curses in every language. The reasons for the success achieved by the game since its inception are immediately evident: there is no Kevlar bodice that holds, in Counter Strike a single well-aimed shot to the head is fatal and, after death, you don't get back into the game, but one remains relegated to the role of mere spectators; the arsenal of each team is well balanced, the choice of weapons must bring a precise personal and team tactic where communication is important; the maps, many it must be said, are probably among the best ever made, but we soon realize that the most assiduous players always frequent the same ones and that they are not willing to leave them. Despite the feeling of precariousness given by the game system, the frenzy of the clashes and despite the excellent balance of the different components, the feeling remains that more could be given to Xbox users. The conversion of the game, as it is, is a bit sparse and the lack of a single player mode, worthy of the name, weighs enough, where one thinks that CS was born as a free mod, but which here aspires to the role of game complete and stand alone, intended for a user very different from the one to which it was initially addressed. Kaboom! Here we are at the real sore points of the package offered by Microsoft and Valve, unfortunately. Frankly, the graphic aspect of Counter Strike is embarrassing for Xbox, especially after the standards set by the latest internal and third party productions. The frame rate, while not at 60 fps, travels quickly above 30 fps, but it is not enough to recover an overall aspect undermined by poorly animated and poorly animated polygonal models, below average textures and graphic effects, such as fog and atmospheric conditions, made in barely passable way. The improvements compared to the PC version consist in the rendering of some textures and some effects, but they are definitely too little given the time available to the developers. To theat the end the sound sector is the one that most convinces, with absolutely level samplings, dedicated to every little devilry given in the hands of the fighters. Comment Counterstrike has redefined the boundaries of fps in multiplayer on Personal Computer and after a few years arrives on Xbox Live substantially unchanged. The online action is one of the best for this genre of games, the offline action, inserted specifically for Xbox, is a mere pretext to add content for those players who do not have access to broadband available, but it certainly does not change the nature of a game born for the network. For those who have already consumed the other exponents of the genre present on the Microsoft console, first of all Rainbow Six 3, it can represent a valid purchase, but only on condition that you are able to overcome the obstacle of a spartan package and a graphic aspect that is decidedly dated compared to the standards set on the platform. Surely it was reasonable to expect more than a port evidently published to swell the ranks of Live Enabled titles. On balance, Counter Strike can still be recommended to true fans of the genre, but only to those with an Xbox Live account. Pros: Frantic and adrenaline Some of the best maps available for the genre Excellent balance of weapons available Cons: Lack of a real single player mode Anachronistic graphic aspect About five years ago, two computer science students got their hands on Half Life, legendary fps for Personal Computers, creating Counterstrike, freely downloadable and usable by any user, and giving life to a game that still boasts thousands of fans on the net. Microsoft has made agreements with Valve to bring a stand-alone version of this title to Xbox, obviously for a fee, to be published in the winter that saw the definitive flowering of Xbox Live and its line up. Xbox users can now try their hand at endless fights to the last shot, but the offer proposed by this port fails to fully convince and is not up to what has recently been produced on the Microsoft console.", "date": "2004-01-13", "grade": null}