{"name": "Sim City: Rush Hour", "ref": "https://multiplayer.it/recensioni/sim-city-rush-hour.html", "text": "Where we're going, we don't need roads... Those who have some experience with the game in question will have noticed that very often we come up against the difficulty of managing city traffic. In fact, if we limit ourselves to building the city without following urban planning criteria, we risk entering a dangerous vortex that combines the resulting road congestion with an incorrect development of the city which will find it difficult to grow in a healthy way. On the other hand, each of us can see every day, leaving the house, what can happen to a city overwhelmed by traffic: widespread nervousness, delays at work and a consequent loss of earnings for many activities. If the question then becomes chronic, there is a risk of the collapse of the structures. It is also true that developments in urban planning have made it possible over the years to take advantage of certain tools, ranging from alternative means to different types of infrastructure, which have greatly contributed to the streamlining of traffic in large cities. In Sim City, as good virtual mayors you are also asked to take into account these needs of the city, but until now the effective tools in the hands of the players were limited to a few types of roads and some form of public transport, mostly limited to metro and line trams. With Rush Hour this aspect of the game has been boosted in an impressive way. In fact, the usual structures are joined by new alternative solutions that are very useful for tidying up the city. In addition to the common roads, it is possible to have two-way avenues and one-way streets. A traffic analysis tool will then keep us constantly updated on the average distances of a certain stretch of road so that we can thus accurately study the traffic planning. By using the elevated car parks you will then reduce urban traffic by guaranteeing greater order in the streets. New means of fast transport such as the magnetic monorail will then simplify communications between cities, greatly improving the quality of life of commuters, with a consequent increase in your rating as mayor. Finally, high-traffic routes have also been upgraded, such as the motorway, which has been joined by the viaduct, which is more invaded and has a greater environmental impact, but is less problematic for city connections. And what about the ferries and marinas? There is practically no field of transport that has not been taken into consideration. Doctor Vu's Dark Plans Some may remember that, some time ago, Maxis tried to create a game to merge with Sim City 2000 with the seductive title Sim Copter. Well, that project went through only to crash with a crash, but the idea behind it wasn't so bad. It was basically a helicopter flight simulation that allowed you to play right on the maps of the cities built in Sim City 2000. After all, everyone would like to be able to spend a few hours in the streets of cities built so painstakingly. Will Wright, patron and founder of Maxis, embittered by a fiasco which until now remained isolated over the years, never gave up and waited for the right moment to propose the idea stealthily and with less fanfare than had already happened . And so we learn that Rush Hour has a new game mode, which upsets the usual plans of Sim City a little. This mode, called ~Behind the wheel~ allows the player to interact with the map using numerous vehicles. Through various expedients it will therefore be possible to put on the commands of helicopters, convoys of firefighters, police cars or simple citizens, motorboats and so on, facing different missions or wandering around on the loose. You will immediately notice the unique ~markers~ placed on the map. By clicking on one of them you will enter the special mode that will allow you to choose the available missions. Unlike Sim Copter, however, you will not enter a virtual reproduction of the city, but will always remain in the usual isometric view, piloting vehicles identical to those that normally travel the streets and skies of the city. Each type of vehicle also has particular special commands which activate the particular aptitudes of the vehicle. For example, the police helicopter has a powerful searchlight with which it will be possible to blind criminals, while the tank, available at the military base, has a deadly cannon! There are two different types of missions to choose from, both of which have hefty rewards, but you will always have to choose between money and reputation. The seaticent and phantom Doctor Vu, rich and arrogant enemy of public peace, will offer you large sums of money to do dirty jobs, such as panicking the kids in a park or preventing the police from reaching the bank robbers by hindering them with the helicopter of TV, all this at the expense of your reputation. Final comments In conclusion, as a good expansion pack, Rush Hour certainly cannot greatly exceed the offers of the original title, while presenting some good ideas to take back even cities that we already considered concluded and fully efficient. Without forgetting the revised and updated soundtrack worthy if nothing else to be mentioned, the game seems even leaner and faster than the original title. Finally, the addition of some new disasters could not be missing, and the introduction of the UFO invasion (devastating) and the metal Allosaurus, made up of wrecked cars, conclude the work. The idea of the ~Behind the wheel~ mode makes the most expert connoisseurs of the Sim saga smile, demonstrating the fact that when Wright misses a hit, even after many years, he never misses the opportunity to recover, and always with style. Pros: The idea of ~Behind the wheel~ is good Numerous new means of transport and infrastructure The new disasters are original and crazy Cons: At times the driving of ~Behind the wheel~ is not very precise Traffic management remains complex It does not decrease the difficulty of the game As usual, Maxis could not fail to attach an expansion pack to the train of the latest Sim City that partially changed its characteristics and strengthened its weakest aspects. Although the wait lasted almost a year, finally now every devotee of the most beloved management saga of all time will be able to get their hands on this title. A fundamental characteristic for any self-respecting expansion is to add just enough to the original title to give new spice to the events, make the necessary adjustments in case of unsolved problems, and add something that knows how to whet the player's insatiable appetite more demanding. For Sim City 4 Maxis had chosen to combine the extravagance already seen in The Sims with a more serious and complete approach that made the title both a plaything and a busy game; Rush Hour throws straw on both fires.", "date": "2004-01-08", "grade": null}