{"name": "Beyond Good & Evil", "ref": "https://multiplayer.it/recensioni/beyond-good-evil-3.html", "text": "beyond Good and Evil Good news for all lovers of the Italian language. After the excellent dubbing of Splinter Cell, Ubisoft has decided to completely localize Beyond Good & Evil, including speech. Although the average quality of the work carried out always stands at medium-high levels, we have however noticed how much the English track is better, above all by virtue of the characterization of the various voices. Luckily, every time we launch the game, we will be able to choose the language in which to play. A really good choice. Once upon a time in Hylis For some time now, on what was once a peaceful and placid planet, a mysterious alien people called Domz have been indiscriminately attacking the helpless population, defended only by the heroic Alpha special teams. The player will be called upon to take on the role of Jade, a young reporter with a past as mysterious as it is troubled. Jade's best weapons to save her planet are her trusty camera and her inseparable adoptive uncle Pej'y. Together with them and other unexpected adventure companions, Jade's task will be as simple as it is unexpected: to discover the truth. Yes, because never like this time, the gray line that separates good from evil is so thin and deceptive. Let's face it, while appreciating the effort in having wanted to devise a plot that went - at least at the beginning - far beyond the usual clich ~A single hero in command ...~ the premises that underlie the plot of Beyond Good & Evil (from now on BG&E) could risk leaving many players perplexed, and this represents much more than a mere detail, because the plot plays a very important role in the entire game economy. Luckily, apart from some other fall in style, due, in our opinion, to the desire to broaden the target of the production to the largest possible slice of the public, the plot will let us witness a rather exciting evolution of events surrounded by the unleashing of various scene, someone really unexpected. Dark room Over the course of the game the camera will prove to be more than just a great source of income. In addition to being used for the cataloging of the various animal species, our photos will prove to be the main tool in Jade's hand to make the truth public. Unfortunately, apart from an isolated case, the use of photographs is always an end in itself and never useful in solving puzzles. In other words, it will always be the end (infiltrate such a base to photograph such a thing) and practically never the means (photograph that shady character from the right angle and find out what he is hiding). A wasted opportunity that we hope will not remain so even in a possible sequel. One none one hundred thousand The first time we launch BG&E we will have to familiarize ourselves with one of the least developed parts of the entire production: that of the fights. The player is given very little control and it all boils down to selecting the cardinal point in which to attack and frenzied clicking on the left mouse button. Under the banner of the philosophy behind the whole game, our only weapon that can be used during the fights will not be, for example, a devastating instrument of mass extermination perhaps with sawed off, but a, certainly more zen and minimalist, Dai- Jo. However, thanks also to the skilful use of a spot-on direction seasoned with a pinch of pseudo ~bullet time~ sequences, all this explains the use of our trusty camera and finally, once we have accepted our assignment, we launch ourselves with the trusty Hovercraft on the waters of the Hillys archipelago. The control of the vehicle is immediately intuitive and effective, which will prove to be fundamental during the sporadic ~Shooter~ sessions (to shoot down a series of monsters from space) and racing. A few more moments and we arrive at the first level of the real game. On balance it will only prove to be a mere introductory level which, although certainly subdued compared to the rest of the game, turns out to be considerably above the usual annoying Tutorials to which other titles in the last few years have accustomed us too much. type. Question of freedom The game structure of Beyond Good & Evil is a very elegant example of well thought out game design. In fact, if the playing area is theoretically explorable right away, leaving total freedom of choice to the player, on balance the path to follow will always be unique and obligatory. However, everything has been disguised in such a way that the only crossroads available to the player will always be understood as a logical choice and not so much as an impositionof the developers. The presence of several subgames and optional missions that are not required for completing the mission can only reinforce this impression. At our discretion we can also decide to use the hovercraft to participate in real speed races. Of course: F-Zero and company are several heads above, but even this aspect of the game is so well cared for as to be absolutely fun. Class is not water After a rather slow start BG&E manages to give its best. Try the Action sessions, the driving ones, the platform-like ones (where nine times out of ten Jade will decide to jump independently from one ~platform~ to another) and the pseudo-RPG ones we will in fact be able to experience the Stealth / Adventure part. Even if the impression of being faced with a light version of Metal Gear Solid will be strong, on balance the subtle balance between game tension and frustration, puzzle solving and narrated parts shows itself before the gamer's eyes as a fascinating, original and very successful all videogame. In fact, there are not many examples of ~multi-event~ games. At least in the PC environment, the first titles that come to mind are only the old and misunderstood ~Omicron: Nomad Soul~ and the fascinating Outcast. The panorama is so desolate also because in this genre of games any weakness in one of the various component parts of the game is detrimental to the entire title. In BG&E, despite the fights being monotonous and not very tactical at times, despite the stealth part appearing far too permissive and simplified, despite the puzzles being solved with little effort in the eyes of an expert player, despite the hovercraft fights risking becoming tedious and unfunny and a series of other small flaws, the overall design of the game is always fascinating and majestic. Only the rescue system (not free but at fixed points) remains a real sore point. Also due to the level of difficulty evidently calibrated downwards, the game flows away in an always fluid and natural way, so varied and surprising that once you get to the final epilogue you will have to ask yourself: ~But how, just now that I was starting to get used to it?~ The game is rather short, perhaps even more than the reviled Max Payne 2. For many this is a defect, for others it is just one more reason to enjoy it all in one go: the choice is yours. Sound propaganda From the moment of the installation, one thing is clear: the sound side of the production has not been left in the background, on the contrary. For both the variety and quality of the tracks, BG&E's soundtrack is one of the best we've ever heard. We pass with extreme ease and naturalness from reggae to a sort of ethnic rock arriving up to the most classic of the epic main theme made of strings and winds. The graphics engine, developed specifically for this title and designed to be cross-platform, is no exception. Fluid and fast in almost all situations even on non-latest generation systems, it manages to amaze more for the light effects and the poetry of some scenes and shots than for the millions of polygons used. The direction is no different, the framing of some cinematic scenes is really excellent. During the game we will be able to play with the free shot, but sometimes it will become inexplicably fixed, creating many control problems. The characterization of the characters is excellent, from the animations to their facial expressions. At least for our protagonist, however, we will have preferred a slightly wider variety of moves, accustomed all too well by the acrobatics of Lara Croft and associates, sometimes Jade's acrobatic skills will seem too limited to us, but after all she is only a reporter . Final comment Ubisoft now represents a point of reference for quality productions, from Splinter Cell through Morrowind and up to ~Prince Of Persia: Sands Of time~. Beyond Good & Evil manages not to look bad in the face of the titles just mentioned. Being a multiplatform title does not make itself felt that much, albeit with the usual exceptions of the case. And this not so much from an audiovisual point of view as in terms of gameplay and game interface. Let us cite the saving system as an example: longevity is already narrow, discovering that an attempt has been made to remedy this problem with the usual saves at fixed points, even in the PC port, has not proved to be a winning move. For the rest, BG&E lets himself be played like only a few before him, after the first initial hesitations due more to the stupid need to want all thecosts cataloging the game in a pre-established genre, one is literally absorbed by the gaming experience which, more than once, enjoys bringing us back to mind, perhaps even just because of very small details, some great titles of the past: MDK, Jedi Knight, Super Mario 64, Anachronox, Zelda and many, many other masterpieces. Ancel was therefore certainly promoted, certainly not with full marks, however the commitment was very considerable, and this work is a worthy demonstration of it. If you are looking for a cinematic title that is not too demanding but still exciting and fun, Beyond Good & Evil is a must buy. Pockets permitting of course. Pros: An excellent example of a varied and complete game Atmospheric and sometimes truly inspired graphics Very well-finished music Cons: Short, very short Almost anachronistic save system, at least on PC For some it may be too simple In the cold world of the industry where, if we exclude the atypical market of the Rising Sun, it becomes increasingly difficult to match the name of a single person to an entire videogame production, the Michel Ancel case almost represents an anomaly. In fact, by virtue of only one truly successful series - that of Rayman - the fame of the transalpine Game Designer could appear almost excessive. Thus, it is not without a note of skepticism that we are preparing to get our hands on the awaited Beyond Good & Evil. We announce right now that after a few hours of play, skepticism gives way to very different sensations, albeit always discordant. But let's continue in order...", "date": "2004-01-07", "grade": null}