{"name": "Grand Theft Auto Double Pack", "ref": "https://multiplayer.it/recensioni/grand-theft-auto-double-pack.html", "text": "All mine the city... Although not without significant audiovisual differences (Vice City nostalgically recalls the sounds and colors of the 80s) and screenplay, the two titles share the same playful quid, engaging the player in a dynamic structure with missions of increasing difficulty. These are perfectly amalgamated in the impressive city reproduction, teeming with cars of all kinds and a bizarre and varied human fauna. Taking advantage of a third-person view, the player is free to satisfy his desire for interaction in the way he likes best, limited only by sectors that open up parallel to the progression in the game and totally released from the intrinsic linearity of the genre. The effect is initially unsettling, as it only takes a few minutes to verify the effectiveness of a complex mechanism of artificial intelligence algorithms, whose apparent cyclicity is continuously altered by the action, both of the player and external. The feeling of being catapulted into an independent digital micro-universe is as clear as it is exhilarating, and it is precisely the denial of self-centeredness that triggers the spark of the gameplay, so much so that it is possible to diverge dramatically from the set objectives to find yourself in the shoes of improvised taxi drivers, or drivers of ambulances! The game system requires two distinct approaches, being both an adventure and a driving simulator. True to the title, much of the action takes place aboard cars stolen from their rightful owners (even motorcycles in Vice City), and although driving is simple and intuitive, a good deal of practice is needed to master them in the best possible way. various missions, being careful not to smash them into ruin. Action always entails reaction, and in most cases every discovery is experienced on the player's skin, as is the temptation of his darker side. The violent arm of the outlaw At this point we come to the crucial factor of GTA, the same one that has caused a deep laceration among the users. We are talking about a product that suggests and facilitates criminal action on every occasion, while leaving the player himself with the right to decide the ways of expression, and to verify the consequences. Although tempered by a parodic, cartoonish and grotesque aura, the extreme violence that can be played in the game could disturb more than one person. We will not describe in detail the possibilities offered (some truly unspeakable), but we can bring you an explanatory anecdote: beat an unsuspecting old man to steal his money, in most cases you will see him flee terrified, but we cannot exclude the possibility that he will react violently to aggression, pursuing and beating you with vengeful ferocity. On the same level, attacking a member of some criminal or mafia gang could result in a firefight with the gang he belongs to, who has come to help his friend. At the same time you may see the police arrive and witness a bloody conflict between the factions, from which you may sneak out as the best Solid Snake This is GTA, chaos and digital retribution. The destructive action of the protagonist is quantified by a growing series of stars on the game interface, the number of which influences the intervention of the police. One star will mean the arrival of the patrol officer, four the special counter-terrorism departments, or even the army. The mechanics is therefore all too evident in its sadistic contradiction: if we exclude the potential digressions previously described, the player largely expresses himself through violent action, perpetrated through fists, weapons and the theft of cars (significant in this sense the impossibility of communicating outside the cut), but at the same time such actions are promptly punished by the cpu. The secret is therefore to be able to survive in the perverse mechanism without it overwhelming our digital alter-ego, whose departure however does not in any way compromise the splendid continuity of the titles. One practically never dies, or at least not in the most traditional sense of the term, resurrecting from time to time at the nearest hospital (death) or at the police station (arrest), ready to throw ourselves back into the action and skipping the tedious recovery of the save point, but without a penny or item left in the pockets. Hence the necessary adoption of thoughtful action, above all considering the importance of the pecuniary and the annoyance of having to repeat the requested missions every time.Grand Theft Xbox Everything you have read so far is certainly not new, but the fact that we are talking about GTA on the Microsoft console is, with the aesthetic improvements that one would expect from its hardware. We immediately anticipate that, for obvious temporal reasons, Rockstar has not been able to do miracles to the graphic engine, however both products have benefited from various aesthetic improvements compared to the PS2 versions. First of all, positive polygonal refinements can be found, starting with the no longer blocky hands of the protagonists, or the construction of the cars, more plastic by virtue of an efficient environmental mapping and the good management of light effects. Video cleaning is slightly better, as is the reduced draw-in of the buildings. In principle, many details can only be noticed by the most fussy, but we must recognize the programmers' willingness to stay away from mere porting, even if we are not yet at the graphic levels of the average Xbox title. We would have liked to find a more solid framerate than that of the PS2 version, and better management of the camera, which is rather confusing in some cases. The renewed control system, which assigns punches/acceleration to the right trigger of the pad, is unconvincing, certainly good for driving, much less so for brawls. Much better to re-enable the old PS2 controls from the options menu. On the other hand, the possibility of loading a personalized soundtrack from the hard disk is excellent, a function originally implemented in the form of cassette tapes to replace the usual radio stations in the city. We certainly won't miss it considering the sparkling musical accompaniment of both titles, but it is an additional possibility that we always welcome with pleasure. Comment GTA Double Pack is a collection of considerable value, much greater than the elegant box that covers it. Two masterpieces of innovation and fun, graphically enhanced, for the price of one. A truly unmissable opportunity, even if exclusively confined to Xbox users and newcomers to the saga, for all the others there are no valid reasons to justify the purchase again. In any case, it is certainly not a small event, and we at Multiplayer feel like rewarding it adequately, hoping for a promising future for the series on the Microsoft console. Keep away from the more impressionable, as they may not like the high violence present in the two titles. Pros: GTA III and Vice City in one go Appreciable graphical improvements High longevity Cons: Still problems with the camera Framerate subject to drops Definitely not suitable for everyone The Grand Theft Auto series undoubtedly represents the spearhead of Rockstar Games, not only in terms of commercial importance, but also as the representative of a politically incorrect as well as creative play philosophy. The saga quickly established itself on the market due to the enormous decision-making power conferred on the player, the considerable freedom and interaction with the scenario and, last but not least, the distinctive iconoclastic and amoral character. As everyone knows by now, the aim is to guide the strictly criminal actions of a criminal, while trying to make him gain a solid position in the underworld. This aspect is further reinforced in the sequel Vice City (or prequel, considering the time location), where in the second part of the game the protagonist Tommy Vercetti will even be engaged in the total domination of the city. The transition to full 3D with GTA III was among the happiest ever seen in videogame history (at the level, we dare say, of a Mario 64), with the addition of a whole new series of ideas and suggestions offered by the renewed three-dimensional setting . Thanks to these requirements and a solid technical realization, the title has become a true best seller on PS2, effectively creating a sub-genre and inspiring various products, from Driver to Getaway. After the Sony exclusivity period, GTA III and Vice City land in a lush box set on the Microsoft console, representing a wonderful opportunity for all newcomers to the series.", "date": "2004-01-02", "grade": null}