{"name": "Miami Nights: Singles in The City", "ref": "https://multiplayer.it/recensioni/miami-nights-singles-in-the-city.html", "text": "The initial phase is dedicated to the creation of your digital alter ego by choosing its gender, name and appearance, this last factor can be changed later in the game in the beauty salon, at this point the dilemma of which career to pursue, make the choice you find more appropriate and wake up from the dream of a goal already achieved to find yourself, alas, starting at the bottom of the social ladder with all parameters leveled downwards. There is nothing that a good shower and a healthy lunch can't fix and hurry up with your most urgent commitments and leave the house in search of your path to success. The exploration of the city takes place by indicating on a map the neighborhood to reach with submenus to select the locations known to you in that area, the graphics of the environments are rendered in a graceful isometric style populated by cartoon characters. And the characters play a fundamental role, it will be their judgment of you that pushes or sinks the social climb you are attempting, pay close attention to the interlocutor's profile that scrolls at the bottom of the screen before each approach and pay attention to the emoticons from which you'll know if you're brilliant or if your conversation has hit a dead end. Since you will have relationships with a lot of people, use the address book without fear to organize telephone numbers and meetings. This game, like life, is made up of choices, in ninety percent of cases there is the reverse of the medal and you will see indicators go up and others go down with each action, almost always it is a question of self-evident cause-effect chains, if you lie down for two hours to tan your appearance improves but your physical form drops and so on, it will be your job to find a balance, if you ignore the basic needs for your survival for too long, messages will appear to notify you that it is better to go to sleep, to eat, etc. PRO Full of possibilities, like life Hilarious graphics and animations AGAINST Many choices are discounted", "date": "2007-01-28", "grade": "S.V."}