{"name": "Broken Sword: Il Sonno del Drago", "ref": "https://multiplayer.it/recensioni/broken-sword-il-sonno-del-drago.html", "text": "~The point and click adventure is dead. Long live the adventure!~ The third chapter of the Broken Sword saga promises a completely new three-dimensional gaming experience and aims to supplant the controversial tradition of ~point and click~ adventure: there are those who argue that this is breathing its last breaths, having now played all its cards, and those who instead defend it staunchly, simply declaring it in crisis. In a presentation at ECTS in London, Charles Cecil was adamant about this: ~Point and click adventure is dead. Long live adventure!~. A statement that is difficult to dispute, in this period in which the genre is dying, but courageous if you think that it comes from the father of Broken Sword and from a software house that has made a name for itself thanks to unquestionably classic adventures! From the very first impact with Sonno del Drago, in fact, several novelties are noticed: first of all a completely three-dimensional world which, in addition to making exploration more dynamic and engaging, opens up new possibilities for interaction with the environment, affecting very nature of puzzles; then there are obvious contaminations of the platform and stealth genres, which introduce some action sequences aimed at varying and enlivening the pace of the game. Surely the unfamiliar interface will not go unnoticed: it seems that for Revolution Software not only the ~point and click~ adventure is dead but also the mouse. In a nutshell, it will be time to forget it and resign yourself to going back to the good old keyboard. Is it therefore legitimate to speak of real innovation? It depends on what is meant by ~innovation~: it would be more correct to speak of hybridization and aesthetic updating, of the approach of adventure to other genres and above all to the dimension of console games. In a sense, there has been an evolution, but promising a revolution was perhaps a gamble on the part of the developers. All this does not detract from the fact that Broken Sword 3 technically stands at very high levels and that, to the delight of traditionalist enthusiasts or not, it is still one of the best graphic adventures ever for several years now! The return of the Templars These Templar knights have always had the bad habit of grabbing precious archaeological finds and challenging secular forces that would be better left buried: history also repeats itself in Broken Sword 3 but, if it is true that the order was dismantled by King Philip of France in 1307 and the aforementioned knights have now disappeared, who is disturbing the dragon's sleep? We'll find out by traveling from one end of the world to the other, in the company of two well-known faces in the panorama of graphic adventures: the American lawyer George Stobbart and the French journalist Nico Collard. Bringing together the acclaimed protagonists of the series, this time, are two unpleasant crimes: George survives a crash landing in the Congo only to witness the ruthless execution of the inventor who had summoned him, claiming to have discovered an inexhaustible; meanwhile, in Paris, Nico is grappling with a murder charge for being in the wrong place at the wrong time (at least apparently): the victim is a hacker who, in reality, was determined to share a sensational discovery with the press made after deciphering the Voynitch manuscript. Alongside a gallery of new and fascinating characters such as Petra, Nico's terrible antagonist, other old acquaintances from the world of Broken Sword make their return: the henchman Flap, the scholar Bruno and Nico's best friend, Andr Lobinaeu, who also this time he can't help but arouse poor George's jealousy. Among the adventure and action titles of recent years, Il Sonno del Drago is perhaps the product that comes closest to the by now worn out concept of interactive film: cinematic quality shots, music and dialogues surround moments of exploration , reflection, tension and reckless action, punctuated here and there also by a sparkling irony. The pace is always sustained and enlivened by the continuous transitions from one character to another, which contribute to the involvement in the evolution of the plot. While not offering a revolutionary gaming experience, the game manages to preserve an aura of freshness and originality from start to finish. Not just puzzles As an adventure, this also has the advantage of being relatively long compared to other recently released titles. In addition to a nice closing cinematic, after completing the game, otteYou will find a little surprise in the main menu. In addition to the options and saves, a short history lesson on the Knights Templar, an introduction to the mysteries of the Voynitch manuscript and a useful summary of previous episodes can be accessed in the extra gallery of the menu. When starting a new game, the unusual keyboard control system will take a few moments to get used to, and the fact that it's fully customizable in the options menu doesn't make it any less awkward: the character is navigated via the arrow keys, while the action commands are given with four other keys (defaults to WASD) and vary depending on the circumstances  as mentioned, there is no ~point and click~ as the people and objects to interact with are marked with a bright star and our character will automatically turn his head towards them. A system like this seems to have been expressly designed to exploit the characteristics of a joypad and is far from natural via keyboard! Not even the inventory is the most immediate: here too we are forced to scroll through the available objects with the arrow keys and to choose the operations that can be performed using the four action keys. However, it is graphically pleasing and fulfills its duty. A notebook is also available which records the most relevant events and discoveries for solving the game. The dialogues are hilarious and well paced: they are never boring and, if a secondary character digresses unexpectedly, it's just to make us smile again. The topics of conversation are displayed with nice colored icons and it is never difficult or irritating to extract the information we need from other characters. Some of the exchanges between the two protagonists have nothing to envy to the most brilliant of cinematic scripts. Not just puzzles George and Nico can run, jump and move stealthily, but the more sedentary adventurers have nothing to fear: in general, these operations are guided or facilitated and aimed exclusively at making the gaming experience more complete and realistic, without detracting from the challenging stages of exploration and puzzle solving. George will show off an enviable physique, moving an infinite number of crates left and right and performing admirable gymnastic evolutions between apparently insurmountable crevasses and walls! However, there is no danger of ending the adventure prematurely, not even during the ~action events~, or when we find ourselves immersed in an interactive film and we will have to rely on our reflexes to proceed all in one piece. Some will have to be repeated a couple of times, before learning to press the right key at the right time: this risks being frustrating, as the game automatically takes us back to the beginning of the scene, in case of fatal mistakes, but forces us to sip a movie and the related dialogues each time, with no possibility of skipping them. Three dimensions of adventure We now come to the basic ingredient of every graphic adventure: the puzzles are surprisingly varied and always well placed in the context, if we exclude those related to the movement of boulders and boxes, which are fun at first but soon become repetitive. Several puzzles can be solved only through the collaboration of the two protagonists. For the most part they are based on manipulating objects and machinery to access the following areas: before long, you will be afflicted with Indiana Jones syndrome and find yourself obsessively examining and groping everything that appears on the screen, from garbage to shadows on the walls, in hopes it will open the next secret passage or drop another must-have clue! In terms of difficulty, the puzzles are on average simple and intuitive, but some will give even the toughest adventurers a hard time. Three dimensions of adventure Even if not always at excellent levels, the three-dimensional graphics are good and sometimes offer truly spectacular shots, with a surprising level of detail at a resolution of 1024x768x32 (in the options menu you will still have a wide choice in terms of resolution). The models of the two protagonists are remarkable. The rich and lively cartoon-style environments are faithful to the spirit of the series and make exploration enjoyable, as well as fun - especially the light and shadow effects are splendid. The animations are smooth, but the facial ones are not always convincing. The only drawback is the impossibility of exchangesare visual, which turns out to be dramatic especially during frenetic action scenes or when it is necessary to move stealthily to avoid being discovered and, not having the camera always placed in our favor, we have to grope around! The soundtrack, while not offering unforgettable motifs, elegantly season each phase of the game, underlining the salient moments of the adventure and always contributing to making the cinematic atmosphere vivid. The ambient effects are great, especially when enjoyed with a surround system. Voice acting and localization are more than decent, and instances where a line doesn't sound convincing are rare. Too bad only for a sound bug that occurs occasionally, overlapping two lines of dialogue and making them indecipherable - it never concerns essential lines for the continuation of the adventure, but it is strange that it has gone unnoticed. Comment An engaging plot, brilliant dialogues and well-crafted puzzles are the cornerstones of the Broken Sword saga: betraying them would have been an affront to the fans who for six long years have been waiting confidently for a new chapter in the series and Revolution Software has not denied itself on these fronts. On that of innovation, however, he had promised us three dimensions, action and a revolutionary interface: as regards the dreaded transition to 3D graphics, hats off, but many adventurers would gladly do without the platform and stealth components (if not other, they would enjoy it in smaller doses and with an adequate interface); moreover, if innovating means abandoning the now consolidated and functional ~point and click~ interface only to regress to keyboard commands, then we prefer to side with the conservatives. The aforementioned ~innovations~ could favor the development of the genre on consoles, but risk displeasing the most demanding lovers of traditional adventures - so much so that those who have a console would do better to avoid the PC version. However, the courage of Cecil and his team must be absolutely rewarded, also because beyond a few small flaws, Il Sonno del Drago is a splendid interactive film, which will not fail to satisfy fans of graphic adventures and arouse the interest of lovers of the Action genre - Adventure. It goes without saying that for Broken Sword loyalists it is an absolutely essential purchase! Pros: compelling storyline and well-characterized characters various puzzles, well structured and inserted into the game as a whole, excellent technical realization Cons: without a joypad, you will regret the ~point and click~ interface stealth phases and Action Event are likely to be frustrating too many crates move into the world of Broken Sword! A software house that doesn't sleep Born from a rib of the late Virgin Interactive, in the 90s the British Revolution Software managed to establish itself among the major developers of graphic adventures in Europe: after making its debut with ~Lure of the Temptress~, it achieved great commercial success in 1996 with ~Broken Sword: The Shadow of the Templars~, confirming it the following year with the sequel ~Broken Sword: The Smoking Mirror~, blockbusters both on PC and Playstation. More than an adventure lover will remember the Revolution also for the futuristic ~Beneath a Steel Sky~ or the more recent ~In Cold Blood~. 21", "date": "2003-12-29", "grade": null}