{"name": "L'Eredit", "ref": "https://multiplayer.it/recensioni/leredita.html", "text": "The quiz invasion continues even on PC Of course, one cannot expect a dizzying graphic frame or unforgettable light and sound effects, nor that Amadeus is talkative as usual, but undoubtedly the most loyal viewers will find all the spirit and fun of the original program and quiz enthusiasts in general will fully enjoy the variety of questions and games offered, as well as the great flexibility of this product, all in all well packaged. Well packaged even in the strict sense: attached to the CD you will find an easy-to-consult manual, which you will hardly need to open in any case, except to have a smattering of the dynamics of the quiz itself. Another advantage of L'Eredit is the fact that it can be purchased for around thirty euros at any newsstand, as well as in specialized shops, and that it is aimed at a much wider audience than that of computer game lovers. The struggle for the inheritance of Legacy is an elimination quiz in which seven players (human or partly computer-controlled) fight each other with general knowledge shots, stealing the prize pool and excluding each other from subsequent rounds, until only one remains worthy of taking the inheritance at home. In short, it is a slightly more lively quiz than usual, divided into seven different sub-games, each of which ends with an elimination. The struggle for the inheritance of All the competitors participate in ~Fuori il primo~, with an initial prize pool of 50,000 euros each, and find themselves facing a series of questions with three answer options; in ~True or False~ the six remaining competitors must evaluate statements from time to time; in ~The Hot Potato~ the three possible answers are provided but not the question, to which the five players have the right to choose whether to answer or pass it on to someone else, with the hope of making him make a mistake but with the risk of being penalized in case this responds correctly; in ~She or the other~ two possible answers are offered for each question, one of which however is hidden, it will therefore be up to the competitors to decide whether the visible one is the right answer or not and possibly take a chance with the other; ~The shock~ is played in three, this time avoiding the right answer among ten possible options: whoever inadvertently selects the correct one gets the shock and risks elimination; ~The last challenge~ consists of a direct confrontation between the two remaining players, who will compete in a series of questions trying to be the first to give five correct answers; in the Final, the surviving competitor will stake the inheritance accumulated during the previous heats: to collect it, he will have to correctly answer seven multiple choice questions, for five of which he will have the possibility to correct himself after a first wrong answer. By answering at least six out of seven questions correctly, he will be able to keep his title of champion and win a consolation prize of 2,000 euros but, if not, he will give the last competitor eliminated the opportunity to do so. A customized quiz The game can be customized in every aspect through the options menu: it is possible to calibrate the difficulty level of the questions and the time limit for the answers, adjust the pace of the game by speeding up or eliminating the Amadeus explanations and define the number, the name and even the appearance of the players, drawing on a gallery of predefined portraits or possibly inserting real digital photos (a move recommended to anyone who has the faculty, given the disturbing aspect of some of the portraits of the competitors present). As has been said, the difficulty of the questions is flexible and the variety of topics guaranteed, perhaps even more than in the actual television broadcast. In case you are well-versed in science and the difficulty level of the questions never satisfies you, you would still have the possibility to reduce the response time to increase the challenge and show off excellent reflexes, as well as infinite culture! A customized quiz The interface is essential, but unequivocally intuitive and functional. Complementing its already surprising immediacy, thanks to the contribution of Amadeus himself, the game provides comments and clear explanations both in the menus and in the various phases of the race for the inheritance. The speech is of excellent quality, even if the reading of all the questions by Frpresenter would have been the best. Pure music and sound effects are those of the transmission, so no good or bad surprises in this area. The same can be said of the graphics, faithful to the television format in the screens that present the questions and a little sparse and approximate in the transition films between one round and another, which offer glimpses of the studio and that the user will soon have the temptation to jump. If it is true that the eye also wants its part, it is equally true that the graphic aspect is not decisive for the purposes of the quiz itself and that it represents a purely functional element: in short, we understand each other, as far as the technical realization of the product does not yearn to border on peaks of perfection, in essence we must admit that it fulfills its function very well and this is what matters. Comment The vote shown below should be interpreted in relation to the expectations with respect to the broadcast and not so much to the standards of common video games: both the television program and its video game transposition, after all, refer to a format and do not present original content. Basically, suffice it to add that the transposition was successful and for an overall judgment we refer you to what has already been expressed in the first two paragraphs of the review. Involvement is ensured especially when playing in company: the strong point of The Legacy in the PC version is precisely the possibility of challenging up to seven opponents in the flesh, offering a valid technological alternative to the classic (and extremely frustrating) tables by Trivial. It can easily be considered an obligatory purchase for fans of the TV program and recommended for all quiz lovers in general, but also a pleasant diversion for any gamer wishing to add a ~different~ title to their collection. Pros: Good reproduction of the atmosphere of the quiz Excellent level of customization of the game Voice of Amadeus Cons: Animations and cinematics a bit too basic The questions are not all read by the presenter The money you win is not real! The quiz invasion continues even on PC As it is easy to understand, The Legacy in the PC version is the faithful video game transposition of the homonymous television program hosted by Amadeus and, not being the classic video game, deserves special treatment in the review. It must be stated that, although we approached the title without knowing the transmission well and without great expectations regarding the technical resources used in its creation, ultimately we had a positive impression: the developers, in collaboration with Rai, were able excellently reproduce the atmosphere and rhythm of the TV quiz show, offering an immediate interface and a level of challenge suitable for all types of players.", "date": "2003-12-24", "grade": null}