{"name": "Warhammer 40.000: Fire Warrior", "ref": "https://multiplayer.it/recensioni/warhammer-40000-fire-warrior.html", "text": "Watch out for that Tau! Ground troops tend to view the Tau as weaklings. If the very powerful Space Marines are genetically modified men, equipped with almost impenetrable armor and devastating weapons, motivated by the obsessive desire to win over their opponents, the Tau have a relatively recent military tradition and do not boast the same lust for blood. Thus, your armor is less powerful than a Space Marine's, and your weapons are generally less effective. This is why it is very important that you act intelligently, first of all. The first level of the game represents a kind of shock: accustomed to the relative tranquility of the other first person shooters, at least as regards the early stages, you will find yourself running through huge trenches, avoiding the shots of the snipers stationed above you and trying to cover your back to your comrades when the enemy decides to ~break through~. Subsequently, the action gradually becomes more ~reasoned~ and the collection of keys, the rescue of hostages, the activation of switches and the use of timed explosive charges come into play massively. Once you have killed an opponent, you can take possession of his rifle and thus have two weapons available (primary and secondary) plus any grenades. It is very important to keep in mind the fire capacity of each weapon, especially the capacity of the magazines: when the rifle is empty, you need a few seconds to change magazines, and then you will be vulnerable. Your armor is equipped with shields that absorb only a few hits before real damage occurs, so the best combat strategy often consists of ~hit and run~: you hit the enemies and maybe take a few hits, after which you take cover to deal time for the shields to reactivate. The problem is that you will not always have the opportunity to behave this way Game mechanics The control system adopted for Warhammer 40,000: Fire Warrior is simple and effective: the left analog stick moves the character in four directions, the right one moves the viewfinder and consequently orients the walk. The back keys on the left are assigned to jump and crouch, while those on the right to use the primary and (in case) secondary functions of the weapon in use. Weapon that is changed with the Square key and reloaded with the Circle key, while the Triangle and X keys have been assigned respectively to throwing grenades and to the generic action (opening doors, activating switches, placing explosives, etc.). I would define the aiming system as ~semi-automatic~, in the sense that the aiming is not automatic but the target is ~locked~ when it is framed. Don't get the wrong idea, however: the ~lock-on~ is not such as to force you to scroll through the objectives: the enemy is followed by the crosshairs only for a rather narrow range. In my view, it's for the best. The weapons are very numerous and different from each other, and the fact of collecting them from the corpses of enemies who were actually in possession of them seems to me a convincing and realistic choice. The difficulty of the game rises gradually: the levels get bigger and more complex, you have to find a certain number of keys and, last but not least, the enemies get really stronger: at the beginning you'll have to deal with simple soldiers without armor, but later the fearsome Space Marines or even the Space Marines of Chaos will begin to arrive, or real demons who have sold their souls to the Gods of Chaos in exchange for power and immortality. To get the better of the toughest opponents, you must necessarily plan your attacks and take advantage of the environment to dodge blows or take cover before striking. Technically speaking Does the atmosphere of a game fall within the category of its technical characteristics? I think so, and Kuju has done an excellent job in this respect. Already relying on the narrative elements of Warhammer 40,000 guaranteed great potential to this fps, and the animated sequences through which the plot develops are truly exceptional and spectacular, even worthy of a CG animated film. The choice not to include music is certainly part of the developers' strategy, who have fed their world with countless sound effects and well-acted dialogues (in English, but well translated into Italian via subtitles). In short, the game makes itself ~feel~ good, has an atmosphere to sell and manages to create an engaging experience. The graphics meet the same standard: excellent polygonal models, with good animationsna quality and a great level of detail. The settings are also convincing and almost never banal, and flow smoothly thanks to a graphics engine that really loses its shots in rare cases. For purists, there is the possibility of selecting the screen update at 50 or 60 Hz. Comment While not offering compelling multiplayer modes, Warhammer 40,000: Fire Warrior is a great choice if you don't have a PS2 network adapter. The twenty levels are engaging and sometimes provide great emotions, the quantity and variety of weapons is great, the storyline is really interesting. Finally, the technical realization of the product is impeccable A great first person shooter, in short. Pros: Interesting and engaging storyline High quality graphics and sound Lots of weapons and strategic approach Cons: Classic game mechanics Poor multiplayer A dubbing in Italian would have been great Board game enthusiasts should be familiar with the Warhammer 40,000 universe. Sold in Italy mainly in comic shops, this board game mixes elements of role-playing, strategy and modeling. The developers of the Kuju team have decided to base their new first person shooter on the Warhammer 40,000 universe, putting the player in the role of a valiant Fire Warrior of the Tau race and throwing him into the middle of a war caused by the thirst for conquest of the earthlings. Protected by a sophisticated metal armor and with a large number of weapons at your disposal, you will have to experience the weight of great responsibilities on your skin: distinguish yourself on the battlefield, save lives and try to end conflicts. One way or another.", "date": "2003-12-22", "grade": null}