{"name": "ISDA Il ritorno del Re", "ref": "https://multiplayer.it/recensioni/isda-il-ritorno-del-re.html", "text": "On the trail of Mordor What EA offers is nothing more than the continuation of the enterprise that began with the game dedicated to the film The Two Towers. The decision to bring this title to PC as well (the first chapter was exclusively dedicated to consoles) could make most people suspicious, and in fact what comes before us after the initial installation is the clear and glaring revelation of how commercial this was choice. The player does not have time to understand what is happening. The game switches from a filmed introduction with scenes taken directly from the original film to pure action, catapulting yourself into the shoes of Gandalf grappling with the orcs at the walls of Helm's Deep. Everything is very fast, the action more frenetic than ever focuses attention on the fury of battle. The first rudiments of how to move in such a chaotic scenario are provided as the character unleashes his fury on the horrible orcs. In fact, during the battle it will be possible to get to know the main commands, to immediately learn the most common maneuvers and fighting techniques. The gameplay is absolutely arcade-style, and the optimal thing would be to approach such a title, to have a gamepad, the only type of controller capable of providing a genuine gaming experience. In short, the only purpose of the game seems to be to advance along the proposed scenario by engaging in furious scuffles with every evil being that stands in our way. The occasional presence of special objects with which to interact (such as the gigantic ballistae of Helm's Deep or the spears providentially left on the ground by some already fallen warrior) finally give the illusion of being faced with a title that goes beyond the scrolling action game. Indeed, on some occasions the opportunity to choose the path to take is given, and the goal to be reached transcends the simple ~kill and survive~, but in the end the center of the action remains focused on the physical confrontation between the character and a multitude of assorted enemies. I feel the eye on me... The proposed setting, as already mentioned, does not move in the slightest from the scenarios proposed by the second and third chapters of the film saga. The textures and models of the characters are totally reproduced on the appearance of those seen on the film, and in this, it must be admitted, the developers have been able to honor the source of inspiration. The obsessive attention to detail and the spectacular nature of some sets even surpass those proposed in the previous chapter, already remarkable precisely for the fine attention to scenic details. The plot of the game does not dare to deviate in the slightest from that of the film, on the contrary it follows it exactly in every nuance, thus straying from time to time from Tolkien's original writing. By advancing from level to level, the player will get in tune with the action and will learn about the various characters proposed during the adventure. In fact, the structure of the game, while following a certain linearity, offers the player some fundamental choices, capable of significantly changing the experience. First of all, the action is divided into stages that follow the pattern of a tree diagram. The history of the saga, as you certainly know, provides for a fragmented structure in which the events follow one another by jumping from one group of characters to another, creating an undergrowth of spectacular and exciting plots. To bring this peculiarity back into the game, it was decided to propose a fragmented succession of events through which the player can choose how to immerse himself in the story. At the beginning of each mission, when the story makes it possible, you will be asked to select which character you intend to face the next stage with. In fact, the most common situations will see the player face danger together with the company of adventurers involved in the story. If Helm's Deep will be asked to play only Gandalf, this will not be the case for the crossing of the spirit lands, which features the assorted trio composed by the dwarf Gimli, Legolas the elf and Aragorn, the man destined to sit on the throne of Gondor, homeland of men. The same thing applies to the path taken by Sam and Frodo, who accompanied by the sneaky Gollum  Smeagol will have to find shelter from the clutches of the Nazgul in an attempt to bring the ring back to the fiery jaws of Mount Doom. I feel the eye on me... The style chosen by the developers for thecharacter selection menu seems to be a tribute to a classic of the genre such as Golden Ax (one of the progenitors of the scrolling action game, close to the Lord of the Rings also for the purely fantasy setting), proposing again the characteristic circular scrolling menu on which characters flow as if on a rotating catwalk. Each character has its own fighting style, linked in particular to the weapon supplied, as well as personal characteristics that identify its peculiarities on the battlefield. Combos? Arcade more than ever! Analyzing the game actions, one could almost draw up a report on the evolution of the genre starting from the antiquated arcade arcades. Yes, because the style, after all, is just that, or scrolling on levels divided by scenes through which the player must collide with enemies generated by special spawns located on the ground or already set up in well-defined places on the map. The novelty (which is not even that revolutionary) lies in the introduction of some slight typical features of the RPG such as the advancement of the character level and the possibility of learning new techniques by exchanging the points earned in combat. To be exact, these are combos (combinations of keys) through which the characters can generate particular special moves with devastating effects. The interface proposed, rather simple, but functional, will always keep the player alert on the state of health of the character, the possible status of the mission (for example how much danger Frodo is running, exposing himself outdoors, of falling between clutches of the Nazgul) and the progress for the progression dle experience level. A special indicator also keeps you updated on the power of the blows you are throwing. The more hits and simultaneous kills performed, the greater the number of experience points awarded. Each successful sequence of shots will receive a rating in grades, through which it will be possible to keep an eye on your performance. However, all these peculiarities do not take your eyes off what constitutes the true soul of this title, or rather the pure and simple philosophy: advance, kill, destroy and give away bruises as much as I can. The pleasure of spoiling the surprise: the art of spoiling! A final critical look should be placed on an unmissable detail, or rather on the gigantic amount of video material present in this game. On the other hand, with its two installation CDs, it is obvious to think that not everything will be dedicated to textures (even if well-made) and character models. A clarification is therefore necessary, if you intend to decorate the Christmas tree with this title, keep one thing in mind: the amount of spoilers present is impressive! In fact, once the first stages of the game have been overcome, still linked to the second chapter, the demarcation line that separates the latter from the final chapter is quickly overcome, which currently has yet to be released in cinemas and whose screening (although the film to be months) is expected for the first quarter of 2004. The undersigned was forced to enjoy, against his will, unpublished scenes taken from the film in question. Which brings us back to the age-old problem of spoiling, or the subtle art of throwing parts of films or books, not yet available or waiting to be seen, into the hands of the masses. Evaluate this problem carefully, and if you don't want to spoil the surprise (since this game faithfully retraces the events of the film), at least wait for the film to be watched before unwrapping any gift, fan warned, forearmed (by a old hobbit saying). Pros: Fun pastime Cured graphics Good film  game fusion Cons: Controls not always effective Maybe a little too arcade Risk of spoilers! Christmas is approaching and, as usual, the moments so dear to retailers all over the world are also approaching. In a scenario so charged with spirituality and at the same time with crazy commerce, the evergreens emerge and come back to amuse us every year. The trilogies or ~pilogies~ of recent times have opened our eyes again in the field of commercials and the like. Matrix, Harry Potter, Star Wars, just to name a few have certainly proved to be gold mines that are currently difficult to extinguish. Except for the saga dedicated to the tormented Skywalker family that of the Lord of the Anelli is to be considered a pioneer in the field of long-term and very wide-ranging projects. A round of merchandise that spares virtually no salable sector has invested fans from all over the globe. Not being able to be outdone, the video game industry has not taken advantage of the passage of this train that travels at very high speed and has joined the bandwagon. And if some have tried to do things, so to speak, on their own, Electronics Arts has certainly preferred the way of the ~official title~ chained four-way to the official trilogy of the now very famous Peter Jackson.", "date": "2003-11-28", "grade": null}