{"name": "Prince of Persia: The Sands of Time", "ref": "https://multiplayer.it/recensioni/prince-of-persia-the-sands-of-time_a.html", "text": "Parallels edited by Mauro Fanelli We have to go back to the early eighties, to 1982 to be precise, to find what is undoubtedly the true ancestor of Prince of Persia, as well as the progenitor of the action adventure genre. This is Pitfall!, David Crane's classic for the Atari 2600. The two games have a lot in common: both are built around the protagonist, placing him at the center of attention. pitfall! it was the first title to offer an animated human character, with all the limitations of the technology of the time, Prince of Persia the first to offer a protagonist with truly realistic, fluid and coherent animations. And then the action divided into fixed screens, the jumps to be performed with timing... Of course, the differences between the two titles are enormous, but POP's distant roots are evident. 11 The Return of the Prince of Persia As slightly more savvy gamers will remember, there were three Prince of Persias that trod the videogame stage: the first two made between 1989 and 1993 by the good Mechner, according to an inevitably two-dimensional approach, while the third saw the light in 1999, as an attempt (rather unsuccessful, to be honest) to ferry the saga into three dimensions. After four long years, the franchise has passed into the hands of Ubisoft, and with the help of Mechner, the French software house has undertaken the ambitious project of returning the series to its original polish, however exploiting the impressive resources that current platforms make available disposition. With truly amazing results: the developers have managed to keep the spirit of the game unchanged, while updating the gameplay and adapting it to a completely three-dimensional world. The game mechanics now closely resemble Ico, alternating phases of furious combat with phases of exploration of the building, between suspended platforms and Macchiavellian pitfalls that will make the players rack their brains, in the constant and desperate search for a way to salvation. The puzzles, the backbone of the game, are always logical and never frustrating, often accompanied by a quick tracking shot of the camera to show us the correct path to follow, often leaving the player speechless due to the spectacular nature of the passages in which to try their hand. The presence of the attractive Farah to accompany us immediately after the initial stages of the game (an element that recalls Ico even more markedly, although here Farah plays a decidedly more active and independent role than Yorda) provides the player with further support for solving the puzzles, that often require the combined action of the two characters to be overcome, even if the choice not to make the girl directly controllable involves some (rare, fortunately) coordination problems, with the girl who remains irreparably stuck at some point in the level, forcing us to reload the saved position. Also fundamental is the introduction of the sand of time which serves as a subtitle to the game: it is a mysterious magical artifact that provides us, after filling a special bar with refills that are scattered throughout the levels or by killing enemies, the power to rewind and block the flow of time, giving the player the possibility of repeating passages misinterpreted and concluded not in the right direction, or perhaps paralyzing enemies in the hottest situations, providing a very comfortable second (but also third, fourth) chance which allows you to avoid a premature departure. The fights are extremely dynamic and represent a pleasant diversion from exploration, especially after Farah has joined you, given that with her bow she is able to provide excellent support but will force you into continuous defense work (it is in fact rather frail and defenseless to enemy attacks: needless to say that his death will result in an immediate game over), however, especially in the second half of the adventure, they tend to become a bit repetitive and intrusive, engaging you in long sessions against hordes that are too many opponents. The legend continues In addition to the gameplay, the original Prince of Persia conquered the limelight thanks to an absolutely avant-garde technical sector for the time, and obviously this new Ubisoft episode cannot avoid doing the same. Even just a simple glance at the richness of the huge settings, luxuriant and teeming with details like never before, accompanied by textures that amaze for beauty and detail, is enough to realize how the hardware of the monolith has really been squeezed to the bone. The models of the characters, while not abundant in terms of polygons, lasciano with his mouth open for the variety and care of the animations (just to shoot a few numbers, know that the protagonist alone can boast something like 750), while the plethora of special effects, such as the splendid creation of the water, or the evocative plays of light and transparency help to create a truly unparalleled atmosphere. The exceptional graphics engine, evolution of the JADE developed by the team responsible for Beyond Good & Evil, manages to move all this wonder at 30 FPS, sporadically losing a few shots only in the most chaotic and detail-saturated situations, but without ever creating problems for the player . The sound sector is fantastic, characterized by a musical accompaniment that is not too varied but really well done, with tunes that take up the themes of the original Prince of Persia, but modernized in a ~rocker~ key. Particular, although in our opinion apt, the choice to limit the music to the fight scenes or to the interludes, in order to leave the player at the mercy of the sound effects only during the exploration, guaranteeing, thanks to the reverb and echo effects, a extremely suggestive and believable atmosphere. The dubbing (in Italian) is also good, which by virtue of the high number of jokes exchanged by the two protagonists assumes a very important role for the player's involvement. Longevity stands at more than good levels considering the genre, requiring about fifteen hours to complete the title, and although the particular type of game does not lend itself much to being replayed, the inclusion of the original Prince of Persia , as a bonus to be unlocked during the main adventure, represents an added value to the product that is certainly welcome. As well as, of course, a wonderful opportunity to rediscover one of the milestones of the videogame firmament. Comment Prince of Persia: Sands of Time succeeds in the arduous goal of bringing back a series that has marked history, updating it to the canons of the modern video game, but without distorting the spirit that made it immortal. In fact, the transition to the three dimensions has rarely been so efficient, capable only of improving the game mechanics, enriching it with new situations and varying it in substance. A little Ico, a little Blinx (limited to the possibility of manipulating time, fortunately), with clear cinematic influences from titles such as The Matrix and Crouching Tiger, Hidden Dragon as regards the combat system, this new Ubisoft product manages to really satisfy everyone, from the nostalgic fans of the series to the less savvy player, who was unable to appreciate the old chapters. In short, a title that really cannot be missing in the collection of any self-respecting gamer and one of the best PlayStation 2 games ever. Pros: Technically extraordinary Playability unchanged Puzzles always logical and coherent Cons: Fights that tend to be slightly intrusive Some sporadic bugs in the management of Farah It was the second half of the 80s, the gaming market didn't even represent a fingernail of the current one, yet it was the ideal environment for many emerging game designers, free to unleash their creativity in cultivating what was a passion before business. It was the era in which many illustrious names obtained the definitive consecration, in which titles that we today call classics were born, in which the video game was considered a pastime for a few, rather than the important medium it is now. It was precisely this period (it was 1989, to be precise) in which the world learned about Jordan Mechner, an ambitious game designer who, fresh from his debut with Karateka, stunned the gaming community with a title whose impact on the contemporary scene was devastating , a real milestone from which entire generations of games have been able to draw inspiration. What are we talking about? But from Prince of Persia, of course!", "date": "2003-11-20", "grade": null}