{"name": "The Oregon Trail", "ref": "https://multiplayer.it/recensioni/the-oregon-trail-la-recensione-del-remake-di-un-grande-classico.html", "text": "It might seem like a little game, but here we are talking about the remake of what is defined as one of the ~greatest games of all time~, which makes us approach the review of The Oregon Trail with some attention, in this new version developed by Gameloft for Apple Arcade. The original title dates back to 1971 and was an ~edutainment~, or a video game developed for educational purposes, which was distributed in some schools in the USA to identify the children in the situation of the caravans of migrants towards the wonders of the West, in North America of the 1800s. It is to all intents and purposes one of the first videogames distributed on a large scale, which has become part of popular culture in the last fifty years, transcending its dimension as an experimental educational/videogame project. Gameloft has acquired the rights to the title and has proposed several reinterpretations over the years, to be honest with rather modest results so far. The Oregon Trail, in this new version, makes use of a beautiful graphic characterization It took Apple Arcade to make The Oregon Trail find the right dimension, with a convincing reconstruction of the original spirit but lowered into a truly pleasant aesthetic form and a certain redesign work of the mechanics capable of making it interesting, even beyond the curiosities with a historical flavour. The structure is not distorted, therefore it remains a title with limited interaction, as befits the evolution of a text adventure with illustrations, but this remake manages to find a way to reproduce its atmosphere and style in a captivating and particularly usable way on mobile platforms. In addition to the technical and content improvements, we must also note a different sensitivity to the topics covered: the sometimes tremendously cynical spirit of the original still shines through, with its ~death from dysentery~ which has become a real meme, but here we witness a part to a certain self-irony in the representation of the tragedies of the journey and on the other to attention to more serious historical themes, such as the presence of Native Americans and their cause which is now treated in a much more thorough and fair manner. The hard life of the caravan The new The Oregon Trail illustrates well the passing of the seasons and the arrival of winter The aim of the game is to bring a caravan of four characters to Oregon, through five main stages which are in turn divided into various points of interest. In a certain sense, The Oregon Trail is perhaps the first survival videogame with management elements, as well as a sort of ante-litteram roguelike, just to give an idea of how the original title was ahead of the first videogames proper, deriving from a design and experimentation process outside the entertainment production environment. This remake introduces a few more ~action~ features, so to speak, as well as an interface that makes extensive use of graphics as well as text, but the core of the experience remains very close to the original. At the beginning the four members of the caravan are chosen, who differ in some basic characteristics such as the work done, the character, some physical predispositions and specific skills, then we leave for the journey, which is set on the same five main stages even if we have the possibility of choosing some variants in the routes that lead to different intermediate points. Native Americans are treated much more respectfully and seriously in this remake Once the four characters have been selected with their characteristics, the stocks of food, medicines, clothes and spare parts have been purchased and arranged inside the wagon, everything that follows is based on random events and immediate problem solving skills, even if to tell the truth, randomness in solving problems is a persistent element in the game. The basic principle is to ensure that the caravan arrives at its destination by keeping its members alive, by monitoring the vital parameters health, resistance, morale, hygiene and also taking care of the integrity of the wagon and the goods. The journey is dotted with unforeseen events that can cause damage to the characters and the vehicle but also opportunities, which if well exploited can allow you to obtain money and useful objects such as medicines and supplies, therefore the whole game mechanism is based on careful management of characters' abilities to obtain resources from the environment or from trade and on their judicious use to keep vital parameters and the tank in check. The Oregon Trail also features various mini-games, such as hunting In general, it is about making decisions by selecting one of the possible options, evaluatingin a short time the best strategies even if the results are not always predictable and often depend on chance. However, The Oregon Trail also offers some digressions from its standard mechanics, with some extremely simple mini-games but able to vary the action a bit, such as hunting, rafting and an inventory management system that introduces puzzle elements in the style of Resident Evil 4. The graphics of the game recover the classic style through sprites of characters, animals and tanks in pixels, but placed on a scenario that mixes 3D polygonal elements with other two-dimensional ones, creating a very pleasant effect. The passage of time is represented by continuous changes in the light, as well as by the arrival of new seasons and, as far as possible, the various stages are characterized by some changes in the graphic characterization of the settings which make the journey always interesting. Clearly these are simple technical solutions, but nonetheless with a good impact.", "date": "2021-04-19", "grade": "7.8"}