{"name": "Zone of the Enders: The 2nd Runner", "ref": "https://multiplayer.it/recensioni/zone-of-the-enders-the-2nd-runner-2.html", "text": "The ending of the first Z.O.E. it was actually incomplete, it ended in fact with an escape from the real enemy, Anubis, Jehuty's undisputed nemesis and the only one capable of rivaling the main protagonist in terms of efficiency and destructive coefficient. In the wake of the oav and the series dedicated to the game (respectively I Dolo and I Dolores) Konami has fleshed out the story of The 2nd Runner with anime-style cutscenes and with a much better characterization of the plot and characters than in the prequel, concluding with a final that will finally live up to the situation, albeit poignant. Already from the introductory film, accompanied by the beautiful song ~Beyond the Bounds~, this trend reversal is noticeable, which extends by reflection throughout the game. The frail and psychologically tested Leo Stenbuck gives way in this sequel to the more ~rude~ Dingo Egrett, researcher on Callisto who suddenly finds himself in command of the Jehuty (hence the name in the title of the game, The 2nd Runner, where with Runner identifies himself as the pilot of an Orbital Frame) and to collide with his own past. In fact, Bahram and the crazy Nohman will once again threaten the safety of Mars and the entire galaxy, with a plan worthy of a crazy psychopath to conquer the universe. Let's do some local thinking for those unfamiliar with Zone of the Enders: this is an action with a third person view in which you will be in command of an Orbital Frame (a robot, in short) equipped with an advanced artificial intelligence system and of several attack solutions. As you progress through the game levels, the Jehuty will acquire new skills and secondary weapons, which will enrich the main one, namely a powerful ion sword. In response to the criticisms raised towards the previous chapter, Konami has tried to make the game mechanics as varied as possible, and in most cases it has succeeded: the types of enemies to defeat have increased, the levels must always be faced in a different (in fact, they will range from the protection of allied LEVs to the pursuit of a particular objective, passing through white weapon attacks to encirclement solutions) and the strategies to follow to defeat the enemies vary from boss to boss, up to being in some cases completely different. A finally worthy story and some truly epic passages (such as the assault on the fortress of Bahram) complete a decidedly more comforting picture than the first chapter. The control system is revealed, as in the prequel, virtually perfect and intuitive; the only drawback remains the camera, which in some situations cannot keep up with the action, which is frenetic on more than one occasion. Among the new moves available to Jehuty we also find greater interactivity with the environment and the possibility of grabbing objects and enemies on the screen, in order to use them as a weapon or as a defense against enemy attacks. Unfortunately, the duration of the main mode in single player does not yet reach very high levels, but replayability is fortunately ensured by the possibility of unlocking various secret missions, new difficulty levels and a fairly fun Vs mode. From a technical point of view, Z.O.E. 2 once again demonstrates the skill of the Konami developers in exploiting the Ps2 hardware: The 2nd Runner is one of the most spectacular titles to appear this season, thanks to a sublime display of particle effects, explosions and plays of light and a character design which also reaches very high peaks, especially as regards the main Orbital Frames. All this goodness is repaid by some slowdowns in particularly crowded situations, which fortunately are sporadic (and present to a lesser extent than in the US version) and do not affect the playability of the title in a worrying way. The same excellent work has been done with regard to the sound sector, which finds in the Finnish-inspired motifs and in the splendid song Beyond the Bounds a worthy accompaniment for every game situation, reaching peaks of excellence on more than one occasion (only one example, the final showdown). Comment Zone of the Enders: The 2nd Runner is everything the first chapter should have been, that is an enjoyable and replayable 3D action thanks to the greater variety. The care placed by Konami in every single aspect of the game is evident, as is the class with which everything is amalgamated. Sure, the core mechanics are still the same, but The 2nd Runner isn't that title anymore incomplete and with unfinished purposes. It is the synthesis of style, fun and frenzy, supported by a technical sector of excellent workmanship and by a not indifferent scenic system. Only those who remained completely indifferent to the first chapter can not take this sequel into consideration. Pros: Excellent technical sector Various and well-designed missions Excellent characterization of mechs and characters Cons: Some slowdown Longevity still not fully satisfactory The title Zone of the Enders will be known to most perhaps because in its first incarnation it was sold together with a playable demo of Metal Gear Solid 2, which helped to get the game a fair number of sales. Z.O.E. it contained excellent potential and a very intuitive control system, but also quite marked defects, such as a repetitive game mechanic, poor interaction with the seabed and a fairly narrow duration. Konami then tries again with The 2nd Runner, ready to remedy all the criticisms received in its first incarnation.", "date": "2003-11-03", "grade": null}