{"name": "Soul Calibur 2", "ref": "https://multiplayer.it/recensioni/soul-calibur-2_b.html", "text": "This is your story of soul and sword After the beautiful introductory film that introduces the characters one by one, a voice, heard by fans thousands of times, will send a shiver down our spine announcing the name of the game: Soul Calibur 2. The menus are very beautiful graphically and always with explanations in Italian are the following: Arcade, Duel VS, Time Challenge, Team Duel, Survival, Training and Weapon Master. The classic menus that have remained unchanged over time. The selectable characters are already numerous at the start and to these are added another five, unlockable by completing the missions of the Master of Arms mode. We will gladly meet the samurai Mitsurugi, Kilik and his staff, the lethal and very fast Taki, the beautiful Ivy, the powerful Astaroth, the repellent Voldo, the terrifying Nightmare and gradually the others passing from Sophitia to get to Yoshimitsu, the pirate Cervantes and the final boss Inferno To these, as I said, are added some new entries: Sophitia in fact does not appear alone but with her sister Cassandra, Hwang has given way to his student Yung Sung and a very elegant and fast named Raphael and a young girl named Talim very fast and armed with a double weapon. To finish the presentations, thanks to the collaboration with Todd McFarlane, a character named Necrid has been inserted, a green monster who fights by borrowing the techniques of his opponents, somewhat similar to the Edge Master of the first Soul Calibur, with due proportions. Concludes the cast Spawn, an anti-hero created by McFarlane, present in the game with his ax and his wickedness. We also remind you that Spawn is only present in the Xbox version of the game and perhaps he is also the character who, compared to Link (present in the Nintendo version) and Heiachi Mishima (present in the Playstation 2 version) fits better with the characters of the Namco title. Welcome back to the stage of history! The gameplay has remained faithful to the first episode and further improved, the fights have remained very spectacular and always fluid. The movements of the various fencers are harmonious thanks to an excellent work in the motion capture phase. The ability to move in 8 directions is a natural evolution of lateral movements. The vertical and horizontal blows allow you to hit even the fastest opponent and the throws are always very effective. The moves have been renewed and as usual each contender has his own particular fighting style, you just need to know how to find the most suitable for your abilities. The moves have indeed been renewed but not completely, in fact it will happen to activate an animation that takes up an old move of the character hand in hand, creating a pleasant feeling of dejavu. The fights have therefore been further perfected, and it was certainly difficult for the developers to improve a product that at the time imposed a quality standard never seen before. The only noteworthy flaw turns out to be the imperfect balance between the strength of the characters, nothing so irreparable but it makes itself felt a bit during the clashes. One of the most beautiful innovations introduced by the first Soul Calibur was the Weapon Master mode, which in this sequel has been improved and enlarged from all points of view. For those unfamiliar with it, it is a long mission to be tackled in single player that allows you to unlock many accessories, additional stages, new weapons and characters, making the Namco title truly long-lived. After choosing a character we will move on a map, following a story and facing very different duels, under specific conditions. We will have to face multiple opponents one after the other as in Survival Mode, we will fight with the wind that threatens to make us fall from the ring, we will do it with poisoned weapons and in dungeons. The dungeons are the most relevant novelty: we will move as on a chessboard facing the enemies encountered from time to time in the different rooms, up to the fight with the boss on duty. This mode therefore turns out to be the real fulcrum of the single player game, fortunately the variety of situations and the incentive to collect all the bonuses make it very interesting. Improving a masterpiece Improving a masterpiece is never easy, the wait was long and painful. Many were afraid of being disappointed by this sequel and above all, when the multiplayer development of the title was made official, the grumblings turned into lamentations By now thegame is out and you just have to be calm, Namco has hit the target again this time. Technically the three versions are practically identical, in the Xbox one only the loads are slightly shorter. The developers have therefore not squeezed the Microsoft hardware to the bone, but the work that has been done is truly valuable. Certainly it is not comparable to the first Soul Calibur, which had technically created an abyss between itself and the competition, but this sequel defends itself very well and rivals Tecmo's Dead or Alive without firing a shot. The polygonal models are cared for down to the smallest detail, the costumes are highly sought after (sometimes too much) and the animations are always fluid. The game engine travels, except for sporadic cases, always anchored to 60 frames per second. The polygons moved on the screen are really many and the textures are always very good and well defined. The only small flaw we find in some internships that are not really successful and in some equally badly designed clothes. The music is very epic and evocative, really spot on, unfortunately not the dubbing. In fact, it is better to leave the English voices alone and keep the original Japanese ones, if you do not want the game to end up in irony that is absolutely unwanted by the developers. We can therefore safely say that although not upsetting its predecessor, Soul Calibur 2 technically surpasses it in every aspect. Sharp conclusions The wait for this sequel was long but it was worth it. Namco has not changed the cards on the table, after all there was no need, and has raised its flagship title to the nth degree. Finding the old characters who have kept us company for many challenges in the past is really pleasant as is the feeling of dejavu that covers the whole game. Technically it is very well done although, due to the joint development for the three next-generation consoles, it fails to fully squeeze the Xbox. An excellent game therefore, beautiful to look at and very long-lived thanks to the Weapon Master mode and the multiplayer challenges, the true fulcrum of every fighting game. It is a recommended purchase both for saga experts and for those who are entering the world of fighting games for the first time. In 1999 a legend was born, now the legend is back. Pros: Technically superb It's Soul Calibur with all its characters Perfectly recreated fights and very long-lived Cons: Character balance not perfect Some questionable stylistic choices Bad English dubbing It was 1996 when Namco decided to introduce white-weapon combat to the world of video games: Soul Edge was born from this purpose. The success was incredible and the epic music, which was the background of the game, still echoes in the ears of the most ardent fans. In 1999, a legend was born from the ribs of a good project. Namco decided to show the world what Sega's hardware, the defunct Dreamcast, was capable of and created the best fighting game of all time according to many: Soul Calibur. I still remember well the first time I saw him at work, I was in a game center and my eyes passed quickly, and then returned almost in disbelief, to the monitor that broadcast some clashes between Kilik and Mitsurugi. I was paralyzed by that vision. Finally and definitively now a console had equaled, if not surpassed, the arcade cabinets. Obviously, as soon as I managed to get hold of a Dreamcast, the first purchase was the Namco title. It was amazing how a fighting game could be both graphic perfection, truly a cut above all other contemporary titles, and the technical completeness that made the title an elegant succession of clashes, perfectly balanced, capable of reaching very high longevity peaks. Four years have passed and finally, after many requests from fans, Namco has decided to publish the sequel to his masterpiece: Soul Calibur 2", "date": "2003-11-03", "grade": null}