{"name": "Halo:Combat Evolved", "ref": "https://multiplayer.it/recensioni/halocombat-evolved.html", "text": "The story I know how to In the year 2552, due to the overpopulation of the Earth, humanity has now spread through space thanks to a massive colonization work. In this panorama, the planet Reach has particular relevance, which constitutes a sort of immense construction site, dedicated to the construction of star cruisers intended for military and civil use. Everything goes smoothly, until contact with a colony is lost, and the military team sent to investigate is almost completely destroyed by a mysterious alien race that will later be called the Covenant. It is then discovered that this race (actually a confederation of alien races united by a common religious fanaticism) has declared a sort of holy war dedicated to the extermination of the human race as it is considered ~an affront to the gods~ (!!!). After a series of heavy defeats, the land military forces decide to use Reach to give life to an old project: that of the creation of supersoldiers equipped with cybernetic enhancements, called Spartan-II. Although in the first skirmishes the use of these super-soldiers proves to be extremely helpful, their number is too small to change the tide of the conflict. So it is decided to make an extreme attempt: to attack the main cruiser of the Covenant with all the Spartan-IIs and from there manage to head towards their home world. Unfortunately, two days before the action is carried out, the Covenant attack Reach and put the colony on fire. Only one ship manages to escape the massacre (the Pillar of Autumn), with the only surviving Spartan-II (who will it be?). Here begins your epic battle for the survival of mankind We could surprise you with special effects and in fact we used Pixel Shaders In Halo, to ensure the effects of translucency and transparency that dot the game's settings, Pixel Shaders are used massively. These Pixel Shaders (PS from now on) are a novelty introduced by DirectX 8 onwards (along with the Vertex Shaders which however perform another task), and the first cards to have programmable and efficient shading units were the Geforce 3 in 2001 (of which, among other things, the Xbox mounts a modified version). First of all, let's clarify what this ~pixel shading~ consists of: in practice it is the action of the GPU to delegate to a ~microprogram~ (called pixel shader) the possibility of processing effects on pixels in data fragments (that is, of defining actions and effects well pixel-specific). Practically in this way the programmers can delegate to the specific units of the GPU defined by them, the calculation of programmable and dynamic effects (and therefore non-standard and fixed as it was until the direct 7). To assist the PS, there are then the Vertex Shakers (from now on VS): they consist in turn of a unit given to define vertices on a three-dimensional plane (X,Y,Z) of numerical values through mathematical operations. Said like this it seems to mean little, but in practice in this way functions can be programmed that act dynamically in determining values of fog, movement, color and size of textures (because they are all values that can be defined in vertices). The correlation between PS and VS lies in the fact that in the end the latter act as a ~guide~ to the former, in the sense that the VS allow data to be passed to the PS on the basis of which effects can then be applied on the pixels. In this case, Halo uses PS/VS only for a part of the effects, such as translucency and refraction (the armor of the Covenant, light effects, water) but it is in any case a pioneer, given that games that heavily exploit PS and VS haven't seen many of them (Morrowind, for example, used them only for water) and, leaving aside the various technology demos or benchmarks, Half Life 2 should be the first title to make truly massive use of them. PS/VS have undergone several revisions in their short existence: now we have reached the PS/VS 2.0 of the modern Radeon R3x0 and Nvidia NV3x chips, even if Halo exploits any version (1.0, 1.1, 1.4, 2.0) so that owners of non-latest generation video cards can also use it. In this regard, I remind you that it is possible to find around the net, a handy Launcher for Halo that allows you to enable/disable PS/VS in Halo and/or choose its version, as well as providing the possibility of running timedemos and taking screenshots. Pure fun, but not for everyone. The gameplay has been taken care of properly, maintaining the same quality level as the Xbox version. The mouse/keyboard control system promotes greater playability than the Xbox gamepadx, to the detriment of some features that have been omitted, namely the famous lunges in close combat that have been translated into a single melee move. The guys from Bungie have chosen to completely remove the series of combos that can be performed, however undermining one of the most innovative features of Halo. The game system, what made it famous and blockbuster, presents a series of really interesting innovations. The main feature is given by the possibility of being able to use the vehicles: off-road vehicles, tanks, small aircraft and more. Among all, it must be highlighted how driving the tank is the most exciting: it is terribly fun to shoot the cannon and see the enemies fly several tens of meters away thanks to its power. It should be noted how the choice of Halo at the time on Xbox to implement the vehicles, has revolutionized the ideas and the world of shooters; we can give the example of Red Faction, of Planetside, or of the imminent Unreal Tournament 2004, where the vehicles will be the protagonists. Another gem are the enemies: in addition to being well done graphically, they are equipped in some cases with a truly efficient artificial intelligence; for example the Hunters and in particular the Elites in combat will amaze you with truly cinematic evasive or defensive maneuvers (in some cases they even run away behind obstacles to regenerate their shields while waiting to come back to face us). In addition to this, Halo boasts numerous touches of class worthy of the best shooters around, such as the limitation on carrying only two weapons (which make the choice very linked to the type of situation you face), the aforementioned lunge in the body in melee, a wide range of armaments divided between truly original alien or human weapons (remember Half Life?). Among the weapons I mention for efficiency, the ordinary pistol, which incredibly turns out to be a very powerful and precise weapon (it also has a small zoom), the shotgun (devastating!), and among the alien ones, the plasma rifle of the Elites which , although it tends to overheat, it has a good balance between power and rate of fire. The style of play recalls, for those who have played it, Unreal 2, i.e. full of action, extreme close combat and moments of suspense. The protagonist is also the typical fearless hero, this time in the Spartan-II cyborg version, given that he has a body that is one with an armor capable of defending him very well and regenerating his shields. The Singleplayer mode is not very long-lived (12-15 hours) and, despite the different levels of difficulty, the replayability remains, as always in these cases, penalized. This deficiency is made up for by the multiplayer mode, the fulcrum of every PC shooter. The multiplayer game features the usual modes already seen in various titles: Deathmatch, Team Deathmatch, Capture the Flag, King of the Hill. In addition to the typical modes, the following have been added: Racing, a sort of race between vehicles, Oddball, in which you have to keep a human skull under control of the team! In each mode it is possible to use the means available such as Warthogs, jeeps with missile launchers or machine guns, Ghosts, small aircraft capable of bombing or launching into fierce dogfights. What spoils the very high playability and fun of this title? The graphics engine... During each game you will often notice more or less heavy slowdowns (almost always very heavy) even on very recent machines. This will create a lot of frustration both in single, making it really difficult to complete some ~crowded~ missions, and in multiplayer, where you will suffer a series of often worrying slowdowns and lags. It's really a shame to see a title with so many merits lose a lot of charm due to the poorly converted graphics engine, but we will talk about this in more detail in the next paragraph We said fun, but not for everyone. Undoubtedly Halo's graphics aren't on par with more recent titles; a clear example is the low amount of polygons used for our marine allies, and in general for the settings (even if the game cleverly manages to mask it); even the textures certainly don't make a miracle cry, despite the restyling undergone compared to the Xbox version. But while Halo has a graphics engine dating back to 2001, it has some cards to play. First of all, it uses very elaborate graphic effects (primarily Bump Mapping and the use of Pixel/Vertex Shaders (to which a special box is dedicated). Furthermore, the light effects and some models (that of your Master Chief suit as well as those of many Covenant) are truly made toart. The animations are also well done, both for the movements of the aliens (for example the evasive maneuvers of the Elites), and in general for the animations of the objects (just look at the rally performances in which we can perform with the Warthog, the battle jeep that we will use in some missions of the game). But despite all this, as already highlighted, the sore point instead comes in the optimization side: in fact, although the game does not offer stunning graphics, it moves with great uncertainties even on machines capable of running latest generation titles with excellent performance. In the test two Athlon Xp 1800+ and 2100+ were mainly used both equipped with Geforce 4200, but there was also a way to test the game on a Pentium IV 2.8 ghz with Radeon 9800, where it still showed more than a hesitation . We said fun, but not for everyone. First let's start from the configuration on which we tested the longest (certainly not high-end): on an Athlon 2100+ with 512 mb of DDR and Geforce 4200, the game was playable up to 800x600 (as opposed to the usual resolution of 1024x768 to which we had become accustomed with the majority of titles) and at this resolution, the game in the most crowded scenes shows more than a hesitation, which is certainly irritating in certain interiors where you find yourself having to face hordes of aliens. But even talking about the best performing machine, things were certainly not serene: on the Pentium IV 2.8 with Radeon 9800 the game was not perfectly fluid at 1024x768: here too, to obtain optimal performance, some details had to be lowered, also thanks to the fact that Halo for the Radeon 9800 uses the PS/VS 2.0, undoubtedly heavier than the 1.1 used for the Geforce 4. However, it is not forgivable that on an undoubtedly high-end machine, the game is not very fluid at a now standard resolution like 1024x768. Not to mention the fact that AntiAliasing cannot even be activated due to the particular way in which Halo manages the back-buffer. This does not mean that there are titles capable of offering decidedly superior graphics to that of Halo and at the same time higher performance, and the example of Unreal 2 is glaring, with the same configuration it is playable with all the details active at 1024x768 with much less hesitation than Halo. Finally, it is angering to note how a certainly noteworthy title like this has been ruined by a non-optimal conversion, given that the Xbox version, despite running on hardware that is infinitely less powerful than that of modern PCs (the only advantage is the lower resolution due to the use than TV) was much smoother and guaranteed at least the constant 30 fps. Moving on to the sound side, the situation is serene: the music is quite engaging (some are truly epic, and for a few moments will really give you the sensation of being the MasterChief inside his armored suit) and the sound effects, as well as rather scenic (the explosions are quite convincing, as well as the angry death cry of the Elites), they are sometimes ironic (how not to mention the Grunts, who you will notice sometimes, while running away in panic, shouting ~They are everywhere  or other rather funny phrases, including one from the Alien series that we leave you guessing Let's now move on to the arduous and difficult final judgement We said fun, but not for everyone. Comment It is not easy to judge this Halo: Combat Evolved. On the one hand we have a very interesting and long-awaited title, on the other a conversion that leaves a bad taste in the mouth. If it were only for the fun that Halo can offer and the exhilaration caused by the use of certain weapons and vehicles, it certainly deserves a higher rating. But the conversion presents several problems (it is not understandable that a title that ran well on an Xbox, i.e. a Pentium III 733 with 128 kbytes of L2 cache and a Geforce 3 with the only addition of a Vertex Shader unit compared to the Geforce 3 original, runs with difficulty on much more up-to-date machines). And this is why Halo's rating remains that of a title which, however beautiful, suffers the weight of a non-exceptional achievement. However, if you have the hardware necessary to run this game and you are willing to sacrifice details in order to play it, we strongly recommend it, get ready for an entertainment that shooters have not offered for some time ... PROS Fun and long-lived Multiplayer mode Well-structured and engaging storyline Exhilarating and cinematic use of weapons and vehicles CONS Frustrating gameplay due to the r", "date": "2003-10-30", "grade": null}