{"name": "Rainbow Six: Vegas", "ref": "https://multiplayer.it/recensioni/rainbow-six-vegas.html", "text": "Vegas Fodder Rainbow Six: Vegas on mobile broadly follows the storyline of its older brother on Xbox 360, which sees the city of sin invaded by a group of terrorists who are waiting for nothing but to be eliminated by the leatherheads protagonists of the game. Unlike the original version, here the user does not have direct control of the squad leader, but performs all the actions (movement, cover, shot, etc.) by moving a cursor on the screen, in a way not unlike the classic Cannon Fodder by Sensible Software. Most of the adventure is therefore spent in this way, directing the team members within well-structured scenarios, which often and willingly offer alternative solutions to eliminate the terrorist threat. The most trivial example is that of a room with two entrances, each of which is useful in different ways to kill enemies: fortunately, also in this portable version there are two of the most intriguing and useful features of Vegas, namely the micro camera to look beyond the doors and the ability to assign a target to hit to your partner. The various missions always offer some different and intriguing ideas, be it the rescue or escort of hostages, as well as the descent with the peaks along the facade of a skyscraper and so on. Vegas Fodder Unfortunately, most of these digressions have been exploited far too little, often appearing only once during the entire adventure. And this is a pity because, although it remains a fun product, Rainbow Six: Vegas could certainly have benefited from a little more variety. However, it must be said that the canonical playful action is often interspersed with some captivating sniper stages, similar in mechanics to the famous Silent Scope and certainly among the highest points of the entire package. In these situations, we find ourselves moving the aim of the rifle in search of terrorists inside a building, being careful to kill them before they can kill any hostages: cosmetically pleasing and also equipped with a shot detection system (the headshots, as expected, are worth many more points), the sniper levels are one of the greatest strengths of Rainbow Six: Vegas, and it is no coincidence that the main menu offers a mode dedicated exclusively to them. A feature that, however, does not solve a significant limitation of the Gameloft product, i.e. the low longevity: the adventure can easily be completed within an hour and a half, without great incentives to face it again. All in all, a venal sin, especially if we consider the care placed in every aspect of the game, including the technical one: even with the usual variations depending on the mobile phone used, Rainbow Six: Vegas offers clean and detailed cosmetics, while the sound plays worthily his task by even presenting a few digitized sentences. Game tested on Nokia N70. Comment Rainbow Six: Vegas is a game full of tantalizing and substantially well-implemented ideas, which however gives the idea of not making the most of its potential: certain solutions therefore deserved to be more exploited and explored in order to increase the enjoyment of a adventure, however, far too short. Technically flawless (and with some real touch of class) Rainbow Six: Vegas is all in all a more than decent title, which with a little more work could have become a real jewel. Pros Good technical appearance Discreetly varied and engaging Very captivating sniper sections Cons Several underused features Poor longevity Developed by Gameloft, this mobile version of the excellent Ubisoft product released on Xbox 360 comes with the usual load of suspicion dedicated to mobile transpositions of titles such as FPS. In fact, since it is not possible to reproduce a ~reduced~ copy of the same playful type, developers often find themselves forced to take refuge in alternative solutions (almost always conventional two-dimensional action games) which do not always reflect the nature of the original product. However, with Rainbow Six: Vegas, Gameloft did not just do the homework, offering a gameplay full of interesting ideas.", "date": "2007-01-25", "grade": null}