{"name": "Viewtiful Joe", "ref": "https://multiplayer.it/recensioni/viewtiful-joe_a.html", "text": "In the end it's all about the pace. And to learn how to best use our hero's three superpowers, Slow, Mach Speed and Zoom, closely related to the world of cinema: with Slow you slow down the action, with Mach Speed Joe's speed increases exponentially and with Zoom he focuses the focus on the main character, who can thus perform a whole series of devastating moves against enemies. The use of each superpower, underlined by first-rate visual effects, consumes the energy of the VFX bar, which can be increased by collecting the cinematographic films scattered throughout the levels: if the bar reaches zero our hero goes back to being a Joe ordinary in breeches and cap. And there's trouble, at least until the bar, whose level is restored automatically or, more quickly, by collecting special bonuses, reaches the minimum threshold to transform back into Viewtiful Joe. And the show begins again. The use of superpowers is not only essential to face the countless enemies and end-of-level bosses, but also to overcome a whole series of puzzles that are as intelligent as they are perfectly integrated into the game. By modifying the speed of the action through Joe's superpowers, the balance of the cinematic world in which he lives is altered: slow motion, for example, slows down the movement of the propeller which, by turning, supports a platform in the air, consequently lowering it and allowing Joe to reach otherwise inaccessible locations. Or it slows down the motion of the blades of a helicopter dragging it to the ground, or even the explosion of a missile or a bomb concentrating its power. Similarly the use of Mach Speed can be used to accelerate the flow of water by widening the flow of a waterfall, with easily predictable results. Just a few examples: the innumerable, ingenious, inventions introduced in the game are worth discovering for yourself. It is clear that Viewtiful Joe is a hardcore game. Not as fucking hardcore as an Ikaruga, but there we go. And excessive, in all respects. Visually excessive and exuberant, an admirable combination of a unique cartoon style and an exceptional graphics engine, which perfectly marries the needs of 2D gameplay with the spectacularity of three dimensions, without ever stopping from sixty frames per second. And excessively difficult. To ignore the Kids mode, too simple, the real men playing Adults, tough as ever. But every progress is rewarding and you always take a little step further in every game, thanks to the excellent power up system. Bosses spit blood, but the bigger they are, the louder they make when they fall. It all goes to the advantage of longevity, already exceptional in itself for an action game, given that the levels are many, and long, and there is no shortage of extras to unlock by finishing the game. Frustration takes over only in the very last stages, which are truly inhumane: an insurmountable obstacle for many. But not for everyone. Comment We don't know who in Capcom had the courage to carry out a crazy and timeless project like this. But on behalf of all the former players, we thank him very much. Because the end result is the best action game on the GameCube. As well as one of the best action games of all time. Pros: Stylistically and technically impeccable Pure fun Exceptional longevity for an action game Cons: Excessive difficulty in the last stages Titles like Viewtiful Joe were once what kept the video game industry going. Now nobody buys them anymore, and consequently nobody makes them anymore, apart from a handful of diehards led by Treasure. Yet the action game is one of the purest and most genuine forms of videogame entertainment, it is the very essence of the gameplay, the primordial broth in which the player, the real one, must occasionally return to wallow. To feel at peace with himself and reassure himself that yes, today's games are what they are, but in the end all is not lost. The plot, as it should be, is little more than a pretext for action, and literally immerses the player in a B-movie atmosphere. An ordinary Joe, the name is not chosen at random, is at the cinema with his girlfriend Silvia enjoying a film of his favorite hero, Captain Blue, when the inexplicable happens. The villain of the moment, made of pure celluloid, comes out of the screen and kidnaps the girl, bringing her into the film: Joe obviously doesn't hesitate for a moment and dives in turn into the film to save his beloved. Captain Blue intervenes to help him in flesh and blood and a tight-fitting costume from which the belly protrudes prominently (the years go by even for super heroes ...), who transmits his powers to Joe, giving him a pretty red outfit with a fluttering scarf.ordinance doors and the Viewtiful prefix. The game is pure action, a successful mix of classic elements: scrolling beat 'em up, platforming and a pinch of shoot 'em up, with extremely well thought out puzzles to be solved using Joe's peculiar powers. Getting an idea of the game is simple, just think back to many classics of the 16bit era, it is difficult to describe in words the mechanics that regulate the gameplay, and which place the latest Capcom effort a cut above everything else. It is absolutely necessary to take the pad in hand to understand Viewtiful Joe, but a quick game is not enough. It takes time. And practice. At the beginning you continue with groping, the understanding of what happens on the screen is poor, and in principle you take beatings from everyone. Then, suddenly, Enlightenment. You own the gameplay and its secrets, and the whole game moves to a higher level: you feel like Neo in the Matrix when he realizes he is the One. You don't stop the bullets with your hands, but bounce them back elegantly, or avoid them by hovering in mid-air. Previously lethal blows are carelessly dodged and responded in kind, with choreographed sequences of moves that knock out entire ranks of enemies. The more the action on the screen is spectacular, the more points are earned, which can be profitably used between one stage and another to buy new skills and upgrade Viewtiful Joe.", "date": "2003-10-24", "grade": null}