{"name": "Colin McRae Rally 04", "ref": "https://multiplayer.it/recensioni/colin-mcrae-rally-04.html", "text": "Engage fourth From the very first moments of the game, the desire appears evident, even on the part of the programmers, to quickly forget the heavy misstep made with the third episode; although the stylistic continuity of the series has been maintained, see the minimalist and rarefied style of the menus, the contents are  fortunately  several kilometers away from those of Colin McRae 4. First of all, the absurd limitation that prevented you from driving any another car other than that of the multiple world champion; dear McRae is in fact present in all his, ahem, beauty at the wheel of the agile Citroen Xsara, but there are also other cars that starred in the 2003 championship. There are over 20 racing cars available, divided into 3 classes: 4-WD, 2- WD and Group-B, the latter made up of historic cars from the 1980s. There is obviously no shortage of secret cars to be unlocked by winning the various rallies, divided into 8 countries for a total of 48 tracks. From a graphic point of view, the Codemasters effort is appreciated without surprising; in fact, the excellent reproduction of the cars, faithful counterparts of the originals, is matched by environments that are so rich in detail, but not exceptional from the point of view of polygon counting or as regards the definition of the textures. In fact, it is not uncommon to pass by rocks that are too angular, or to be faced with shelling that does not do justice to the console that hosts the game. The graphic effects are also of fluctuating quality: excellent as regards, for example, the raising of dust or snow when one's own racing car passes, and very bad when crossing pools or streams. Nonetheless, Colin McRae 4 undoubtedly remains a pleasant title to observe, also thanks to realistic light effects and the use of a color palette that in some passages is nothing short of spot on. On the other hand, the replays are subdued which, in addition to emphasizing the graphic defects mentioned, denounce a general poverty from the point of view of virtual direction: a few shots, trivial and mounted in a poorly dynamic way, close the picture of an option that should have been treated more carefully, especially given the exciting achievements of WRC2. Set the curve The sore point of Colin McRae 3 was undoubtedly the playability, and in particular the physics of the car which appeared very unrealistic, to put it mildly. For Colin McRae 4, the programmers have well thought of throwing the bad routines of the predecessor in the trash and rewriting everything, in an attempt to gratify the demanding fans of the genre. And, fortunately, this attempt can be declared completely successful, except as regards the collisions with the elements of the setting. Let's start immediately from this defect, not too annoying but which in any case deserved more attention; collisions of one's car against boulders, trees or anything else, in the vast majority of cases, in fact, do not produce the spins or rollovers that one would expect, but are resolved with an unrealistic stop of the car. However, managing to turn a blind eye to this factor, what remains is undoubtedly the best rally simulation currently available on consoles. The cars respond excellently to the player's commands, just as the difference in behavior on the various surfaces is completely credible. For example, moving from asphalt to gravel is reproduced exactly as one would expect it to be, therefore every error is attributable solely and exclusively to the player's inattention and not to deficiencies in the game engine. Honorable mention regarding the difficulty setting: the three levels available, one of which to unlock, are able to adapt to the needs of each player not only for the ability of the opponents, but also for the resistance of their car. If the first level is ideal for those approaching the genre, with wide margins of error and the possibility of exiting the path without too much damage, the second, on the contrary, is dedicated to those who already have experience with titles of this type, requiring a extremely clean and error-free guide. The management of damages is valid, which produce their effects both from an aesthetic point of view with drafts, bumpers, wheels and bonnets that come off, and on the mechanics with drops in power, difficulty in steering or even engine shutdowns. The game structure of the championship, absolutely classic in its succession of stages, presents only a digression during the tests to unlock special upgradescials for your vehicle; in practice, at the end of each country's rally, one is called upon to complete a rather bizarre test which may involve wearing out one's tyres, destroying the shock absorbers with jumps, stopping the car within a small space at the end a straight line and so on. Probably the intent of the programmers was to somehow break the classic succession of races by introducing an element of detachment, but in reality this extra mode appears as a filler that has very little to do with the seriousness and rigor of the Codemasters production. Comment Colin McRae 4 is an extremely balanced title, at times essential but never poor, which succeeds in the arduous task of reconciling Codemasters with rally enthusiasts who had been burned by the previous chapter of the series. The effort of the British software house in fact represents a very evident desire to go back to the origins, proposing a product without pomp but capable of resting on solid foundations such as granite. The excellent reproduction of the behavior of the cars, the excellent playability and the exceptional setting of the difficulty levels are the cornerstones of a title with few weak points, most of which can easily be overshadowed. With Colin McRae 4, Codemasters has therefore succeeded in taking back the palm of best rally game for consoles. Will he be able to keep it even after the dreaded WRC 3 arrives? Posterity will judge. Pros: Excellent reproduction of the behavior of the cars Perfect calibration of the difficulty level Good longevity Cons: Graphics that can be improved as regards the settings System for obtaining out of place power ups Collisions detection not up to par It is certainly a well-known fact that the transition to the new generation consoles has caused more than a few ~settlement~ problems for the developers of the software houses around the world. But if it is true that most of these were then able to get back on their feet brilliantly, this speech unfortunately cannot be done for Codemasters, which in fact failed to confirm its excellent status of the Pson era. If missteps such as those of Prisoner of War could in fact be framed as an unsuccessful attempt to tread genres in which the British house had no great experience, on the contrary the disappointments caused by the latest exponents of the flagship series Toca and Colin McRae have not been digested by enthusiasts, who hoped to find in them the characteristics that had made them milestones of the genre. For the rallying stock, in particular, insult was added to the damage; unable to offer the desired quality level, the Codemasters title was seen stealing the throne by Evolution Studios' excellent WRC2, as amazing as it was unexpected sequel to a truly forgettable first chapter. Surely aware of the vertical collapse that was affecting them, the executives of Codemasters thus decided to give a boost to this negative trend, starting right from the fourth chapter of their most famous brand. Colin McRae 4: turning point or point of no return?", "date": "2003-10-21", "grade": null}