{"name": "Freedom Fighters", "ref": "https://multiplayer.it/recensioni/freedom-fighters.html", "text": "A plumber will save us... Evidently everyone in Defense must have been on a coffee break, because what the plot doesn't explain is how it was so easy for the Soviets to penetrate American territory in such a short time, what we instead guess from the presentation screens is that practically no American reaction it was there and the United States becomes Soviet territory in less than five minutes. The newly established regime tries to restore stability with the usual means: martial law, summary executions, roundups and the entire American journalistic ~intelligentia~ sent to Alaska in ~re-education~ camps. In New York, Russian soldiers occupy the streets and public buildings, television broadcasts only carefully ~filtered~ news and promotes propaganda and regime-related information, American journalists are sent to Alaska in ~re-education camps~. But our brave plumber has a plan and the entire Russian military will have to deal with him. A plumber will save us... Ok, it's not my fault if every time I think of a plumber Mario comes to mind, but damn, they could have found another job for our protagonist. Be that as it may, this is the plot of Freedom Fighters, or rather: the beginning. Published by Electronic Arts for the entire gaming market (console and PC) this title is an action arcade with a little something extra and a few touches of class here and there. The fabric of the game is quite simple: there is a base of resistance from which you receive each time a series of missions that you can choose from at will, equip yourself properly and go. Generally, apart from a few secondary objectives, you will have to locate a key building in each mission and climb up to the pole that supports the Soviet flag to be replaced with the Stars and Stripes. Secondary objectives often consist of rescuing prisoners or blowing up certain military structures with c4. The usefulness of completing the two tasks is twofold, in fact, for example, you will often be asked to blow up the refueling platforms of the Russian helicopters: this will prevent you from finding yourself with delicious Hinds in other subsequent missions (see box to find out what stuff is) to fly on your head. In addition, completing secondary objectives will give you ~charisma~. In each mission you will have to pay attention to the energy bar, but also to the yellow one of the aforementioned charisma; since in Freedom Fighters it will be possible to have a certain number of guerrillas under your direct command, the more charisma you have accumulated and the more you will be able to command. Your men and yourself will be armed mostly with weapons stolen from soldiers killed in combat, and even once you have managed to build your personal arsenal within the guerrilla base, it will consist of Soviet armaments such as AK47 rifles and Dragunovs, Bizon submachine guns, RPG rocket launchers and so on. Up to the classic Molotov cocktail, a bit the emblem of any self-respecting popular uprising. It's arcade, it's tactical... what the hell is that? This is one of the surprise elements of FF. Although it is a third-person arcade you will have the possibility to recruit up to twelve men to take with you, of course you will be able to give them only three commands (follow me, defend the position, explore / attack), but it is undeniable that this element gives a lot of depth to the game, creating, also thanks to the good AI, very interesting tactical situations. In fact, your men enjoy a certain autonomy of movement by returning fire if attacked, looking for cover on their own while on the move, covering each other and using the elements of the scenario, including the numerous fixed machine guns. It is not uncommon to see a handful of yours, sent to scout, exploit every stone to cover their backs as they approach the enemy, locate a machine gun position, wipe out its personnel with shots and turn the scrap metal against the remaining enemy troops. The Russians obviously are no less, they exploit cover very well, they flee if in difficulty, they gather around their officers, who organize their movements and attacks. So the Russian infantrymen manage to represent a fair challenge, also because in addition to being almost as intelligent as you, they outclass you in numbers by a hundred to one ratio, not bad eh? Sometimes, it is true, the AI also misfires and perhaps it catches the eye a lot because it contrasts with moments of great brilliance. It may happen that your si fthey dare to sweep away like idiots because they decide to have a picnic in front of a tank, or at times one of your members attacks elusive emplacements, goes hunting in the middle of a billiard of Russians and is savagely whipped like a pear it happens. On the other hand I have to be honest and say that I didn't expect so much grace from an apparently low-profile arcade game, consequently these flaws are quite negligible, in my opinion. I'm gonna take you, New York! All this happens in invaded New York, the missions are very often at night and allow us to admire the discrete light effects of the graphics engine, which, although not very sophisticated, has two great qualities: lightness and cleanliness. FF is one of those games that will run smoothly and without too much trouble on any ~pseudo-modern~ system with a decent video card. Despite the very low hardware requests it will offer us lights, shadows and atmospheric effects of a certain quality level, ok we are not at excellence, but you will see that they will adapt well to the vaguely cartoonish graphics of the game. In general, the style is pleasant, certainly very ~console~ and you can clearly see how FF was designed primarily for PS2 and company (see also the save system, not free, but bound to certain points, as happens in Resident Evil for example), but also on the PC he makes a good impression, moving even with a certain fluidity of fps (frame per second). I'm gonna take you, New York! The levels render the various environments and streets of the city under siege well, we will go from closed streets with barricades on which violent clashes between guerrillas and invading troops rage, to the cramped offices of the occupied New York administration down to the underground, the main playground of the resistance American. Interiors and exteriors are made discreetly and show a certain number of details, even if not very high, light years away from the level of the new titles arriving on PC, but still sufficient and in accordance with the famous cartoon style that I mentioned before. Another strong point of the engine are the animations, generally well done and decidedly impactful, with soldiers flying left and right crashing on the walls in the event of an explosion or falling realistically on the objects of the scenario, occasionally there they are problems of interpenetration of the polygons, sometimes, especially in narrow situations, our view goes horribly wrong and the camera goes crazy, in these cases, while you recover, send your men ahead to do the dirty work. Sounds of the city. Discreet graphics are accompanied by excellent sound, voices, weapons and sounds of the city in general are of an excellent standard. We're not faced with the usual Hollywood-style pumped audio, but all the weapons, despite not having the ultra-accurate sampling of titles like Raven Shield, resonate in the streets in a somewhat realistic way. Even the voices and screams of enemy soldiers are rendered very well and the EAX implementation is definitely very good and suggestive, especially when you find yourself shouting orders in a deserted avenue, with the buildings reflecting the sound around us and maybe the crackle of the snow falling under our amphibians that accompanies the maneuvers of the team. Handsome. The music deserves a separate mention. Between Russian choirs and contemporary electronic bases, the composer Jesper Kyd has recreated at times a gloomy atmosphere, a bit Fincher-like, to be clear, without spending time in standard military marches and similar crap. On the other hand, from a veteran like him, in fact his soundtracks for titles such as Messiah or Hitman2, we could not expect anything less than a practically perfect job. More on the story and close. Supported by a good technical realization, the plot develops well and in a sufficiently interesting way, even if at times a bit obvious. Let's say that put on video it would become a nice TV movie and not much more, but the almost open ending, if nothing else, gives us hope that the ritual continuation could close some little holes left open in the narrative plot (I won't tell you anything, find out from you). Inin any case, the intermediate sequences are shot very well and in an original way, the facial animations of the characters accompany the dialogues well and make the protagonists definitely alive on our monitor. The dialogues are fast, fluid, believable and well built on the characters who pronounce them and there is also a certain underlying irony, very American b-movie, which never hurts. More on the story and close. Thumbs up for this title, which suffers from some technical insufficiency. It would have been enough to tweak the graphics engine on the problem of some bad clipping effects and fix the functioning of the view in some shots to make it a little gem. Maybe they could also give the AI a little push, even if in general it gets along just fine. In a world of FPS I was missing a nice third person game, as well as a product that had a slightly different setting than the usual Second World Wars, Vietnam and so on. The vote obviously suffers from the above shortcomings, but don't worry: if you were looking for an action title with a pinch of depth, this title is definitely worth buying and will keep you glued to the monitor for a long time trying to liberate New York. Be careful, however, once you're done, you will hardly pick it up again and if you don't have the multiplayer mode completely, you won't have great reasons to replay the entire single campaign. It is not clear why EA has included the multy in the console versions while in the pc one (main support of the network game) this mode is completely absent. Unfortunately, New York only gets free once, but it could be a sin not to try. Pros: Lightweight for your pc Action but with a minimum of tactics Great sound Extremely fun to play Brilliant enough storyline Variety of locations Cons: No multiplayer for the pc version Some graphical glitches AI dozes off from time to time Hardly replayable Maybe a little ' too short Hind this stranger It appears more than once during the Freedom Fighters campaign and every time it's trouble. Until the eighties it was one of the most formidable aircraft available in the Soviet arsenal: the Mi-24 Hind, an assault helicopter, a real flying gunship capable of carrying even eight men for the purpose of inserting special teams in high risk areas. A real monster of over 20 meters in length, capable of traveling over 330 kilometers per hour carrying with it a 12.7 machine gun with 4 barrels, an unknown number of 57 mm rockets and a handful of anti-tank missiles. When you see him walking the streets of N.Y. make sure you have an Rpg rocket launcher with you, otherwise run away! 22", "date": "2003-10-15", "grade": null}