{"name": "Wario Ware: Smooth Moves", "ref": "https://multiplayer.it/recensioni/wario-ware-smooth-moves-3.html", "text": "This is the Wii As happened with the DS episode, also in this case Wario Ware is given a task of great weight, certainly greater than what could initially be given to this crazy collection of mini-games: make the most of a new and innovative system of control, representing at the same time both a sort of ~initiation~ or in any case training in its use, and a way to best express its potential and versatility. After having taught us how to use the stylus, microphone and double screen of the laptop, here comes the Smooth Moves chapter designed and specifically designed around the Wii controller. For those unfamiliar with the series, it is enough to know that Wario Ware is among the most insane and absurdly brilliant that can be found today in the videogame scene. Balancing a broom in your hand, sticking dentures in your grandmother's mouth or a finger in a huge nose, cutting a log with a saw and rescuing a girl who is falling from a building are just a fraction of the things that could happen to you playing Smooth Moves, and all within twenty seconds. Mini (or rather micro) games and frenetic pace, these have always been the main ingredients of Nintendo's production, and which obviously continue to be the basis for this new chapter as well. The structure has remained almost unchanged compared to the previous incarnations: within a general map it is in fact possible to point the wiimote at a series of characters (always the same, historical), to be catapulted into the story and the relative minigames of each of them, for a total of over 200. The latter, fortunately and unlike the disappointing GC chapter, are practically all unpublished and made specifically for the Wii debut. But the real innovation must be sought -obviously- in the use of the controller, with which the designers really indulged themselves; aware that using the remote control in only one way would soon lend itself to an inevitable repetitiveness, they well thought of letting the imagination run free by giving life to about 20 different ways to hold the wiimote, and consequently to exploit it in the present playful contexts. Any examples? Try using it as if it were a handlebar of a bicycle, or the steering wheel of a car, or still place it on your nose like an elephant's trunk, or on the palm of your hand as a tray, or between 2 fingers as if you were playing darts, or still vertically like an umbrella, or keep it next to your side like a samurai sword... and so on. Whenever a new control method is discovered, it is then accompanied by a brief description recited by a priceless calm and monotonous voice, which in its seriousness contrasts with the absurdity of what it describes. The variety of ways to use the controller is undoubtedly the main strength of Smooth Moves; although most of the positions that it is required to assume are not really forced (resting the controller on the nose as required or holding it in the hand normally brings the same effect in practical terms, just to give an example), the effectiveness, fun and the actual specific weight that this ~physical effort~ and this continuous change of positions brings with it pushes the player to strictly follow the indications on the screen. It's-a-me, Wario! However, the greatest strength of Smooth Moves is also the origin of a weakness; in fact, it can happen that by moving the wiimote from one position to another, in the haste and rhythm of the action, the latter loses the correct pointing and the relative detection on the screen. Considering the 4-5 seconds that make up each minigame, it's easy to understand how these mishaps can often become fatal in determining the fate of a game. This is a defect, if we want to call it that, which certainly cannot be strictly attributed to the product itself but which in any case constitutes a small but annoying obstacle especially when perhaps you are trying to beat your own personal record with the minigames that run at breakneck speed one after the other the other. And it is also a pity that the main single mode lasts very little, with 3 hours to unlock all the characters and a little more to have the extras available. Certainly the stimulus will not end at that moment, given that replaying the stages in marathon mode has always been the real focus of the series; the fact is that some more content would certainly not have been out of place. But all in all the flaws of Smooth Moves end there, because playing it is really simply a hoot. Obviously from a technical point of view we are facedat historic lows, but the use of stylized graphics has always been a distinctive element and strong point of the series. Nonetheless, there is no shortage of references to great Nintendo classics, such as Metroid, Zelda, Animal Crossing, Mario bros and so on, most with quotes from the episodes for GC. Obviously there is a multiplayer mode, which allows up to 12 friends to challenge each other in 4 variants, all sharing the need to use a single wiimote and pass it from hand to hand. A solution, this, which helps to unleash hilarity and obviously make things more complicated; obviously forget about being able to use the strap much advertised by Nintendo... being able to take it off and have it worn by your partner in the space of the very few moments that separate one minigame from the other would be really too much. Although satisfactory, the Wario Ware multiplayer for Wii is still developed in a rather superficial way, limiting itself except in rare cases to doing the ~homework~ without surprising. Comment Smooth Moves is undoubtedly among the best episodes of the Wario Ware series, second perhaps only to the sensational Twisted for GBA; although it has certainly had its ups and downs, it is incredible how Nintendo programmers have always managed to find new ideas to re-propose a formula that has essentially remained unchanged over the years. Going beyond the physiological limits of the wiimote, Smooth Moves manages to surprise even the expert player, pushing the irony and insanity that have always distinguished the brand in question to new heights. Having said that, to say that this latest incarnation is flawless is perhaps excessive: in addition to being too short in single (despite the very high replayability) and featuring a slightly disappointing multiplayer, those who have followed the series since its inception could perhaps arise the desire to witness a step forward not only in the control system, but also in the game structure. Will it be for the next chapter? Pros Wiimote used to perfection Delusional and fun as and more than before Exceptional replayability Cons Unlocking everything is a matter of a few hours Multiplayer that can be improved Is it time to renew something? Who would have thought that that bizarre and delirious experiment called Wario Ware Inc.: Mega Microgame$, released in the first months of 2003 on GBA, would have become in a few years a transversal series capable of touching all Nintendo consoles? Yet it was so, with Twisted! always on GBA, Mega Party Game$ on GC, Touched! on DS and now with this Smooth Moves for the newborn Wii. Will such an overexposure have affected or not the charm (ahem) of the anti-hero par excellence? Let's find out together...", "date": "2007-01-25", "grade": null}