{"name": "Evil Dead: A Fistful of Boomstick", "ref": "https://multiplayer.it/recensioni/evil-dead-a-fistful-of-boomstick.html", "text": "The book of laws that govern the dead, or the Necronomicon, is capable of reawakening the souls and bodies of the deceased. This legendary book, apparently written in the 1800s after Christ, has inspired writers and directors in large numbers; among these also Sam Raimi, who for his film trilogy based the plot, albeit small, on this book with unnatural powers. Even A Fistful of Boomstick then exploits the thread that connects all the chapters of celluloid, bringing Ash (Bruce Campbell) in a city infested with the living dead, Dearborn. As has happened recently for some famous tie-ins, this Evil Dead also tells an unpublished story, albeit devoid of originality. Armed to the teeth Ash will therefore have to try his hand again in the eternal battle with hordes of bloodthirsty zombies, also having to travel between different time dimensions in order to unravel an otherwise deadly skein. Having abandoned the survival horror structure of its predecessor, A Fistful of Boomstick is proposed with a more appropriate attitude to action, in some ways comparable to State of Emergency. Our polygonal counterpart, in fact, will find himself wandering around a devastated city, having to, by law of survival, kill every undead that comes within range. Furthermore, between one dismemberment and another, Ash will have to find keys and documents necessary to solve the mysteries that afflict Dearborn. Basically the game is all here, limiting itself to being a ~take the key, open the door, kill the bad guy on duty~ which repeats itself cyclically without bite or variations of any kind. A few game sessions will be enough for boredom to set in, despite the charisma and sarcasm of the protagonist succeeding in keeping a thread of interest afloat, at least for a while. In fact, Ash is truly impeccably characterized: the classic clumsy but courageous hero who perfectly follows the character created by Raimi's mind. Lovers of the splatter genre will surely find bread for their teeth in this title, with many beautiful enemies ready to be chopped up, also because their artificial intelligence is very lacking. The equipment available is very varied, and will go from the canonical firearms to the so-called edged weapons. We cannot fail to mention the mythical chainsaw that Ash has on his right arm, deprived of the hand in the second chapter of the trilogy. The combat system makes use of the now much abused lock-on, which allows the player to hit the selected enemy with a weapon at long or close range depending on the need: Ash will in fact be able to carry two weapons at a time, one with the left arm and the other attached to the right arm. The discovery during the adventure of some mystical compositions will also allow the protagonist to evoke spells with the most varied characteristics in which, having to perform a key combination for each spell, the incorrect execution will open amusing scenes with Ash awkwardly protagonist. Made with the same graphics engine as State of Emergency, this Evil Dead essentially reproduces the same strengths and weaknesses. In fact, if on the one hand we find a fluid title capable of presenting an impressive number of NPGs on the screen, on the other hand they suffer from a low level of detail and somewhat grotesque animations. It definitely improves the realization of Ash, which offers a greater number of polygons than enemies and at least decent animations. Even the textures of the game environments do not help at all to make the look of this title more pleasant, as they suffer from excessive repetitiveness as well as a level of detail that is anything but commendable. The sound sector takes a few steps forward, above all thanks to the dubbing of Bruce Campbell, which gives the protagonist the same appeal as the cinematographic counterpart. On the other hand, the sound effects are average, despite some purely timing inaccuracies. Definitely.. Evil Dead: A Fistful of Boomstick is the classic tie-in that relies more on the license than on the making of the game. Repetitiveness is a big tile that afflicts this title, which doesn't even shine for the graphic design. All lovers of the film saga will still find a faithful title in essence and spirit, driven by a Bruce Campbell who, even in polygonal form, is always in splendid shape. However, the advice is to try it firstany purchase. Pros: Faithful to the movie. The chainsaw has a certain charm. Cons: Repetitive and boring gameplay. Few game levels. Graphically dated. It was the dawn of the eighties, the roaring years someone sang, years in which horror cinema was experiencing its moment of maximum splendour. People were easily impressionable, and any effect, although today it may elicit little more than a smile, succeeded in frightening. In that era, sagas were born which, over the years, became historic. One of these was certainly La Casa, known in the States as the Evil Dead, which thanks to the ~self-taught~ director Sam Raimi found a very specific place among the horror genres, as it was capable of mixing moments of pure terror with other decidedly funny ones. Bruce Campbell's ephemeral sarcasm always succeeded in playing with the spectator, first making him jump on the chair and then later making him laugh. Recently THQ has been very interested in this horror-like epic, however producing with very little results Hail to the King, released in 2001 on Dreamcast, Psx and PC. After two years, THQ has decided to try again, delegating the development of this ~Evil Dead: A Fistful of Boomstick~ to the Scottish VIS, who have recently distinguished themselves for the much discussed State of Emergency.", "date": "2003-09-18", "grade": null}