{"name": "XenoSaga Episode I - Der Wille zur Macht", "ref": "https://multiplayer.it/recensioni/xenosaga-episode-i-der-wille-zur-macht.html", "text": "~God created man in his own image, in the image of God he created him; such he created man and woman~ (Genesis 1:27) The story begins in the present day, in an unspecified future that could be tomorrow, in a year or maybe ten, but in a still present Earth, where an archaeologist makes an exceptional discovery: a gigantic monolith that appears out of nowhere and whose appearance causes, almost as a sign of bad luck, a very heavy rain. Immediately, we find ourselves in the future, in 2300, where man travels far and wide in space and powerful multinationals manage travel via the Unus Mundus Network, a sort of ~telecommunication~ system. The Earth is now a vague memory: called Fifth Jerusalem, it is lost in space, far from the axis on which it revolved around the sun. Man has colonized new planets, but in his expansion in search of a new, real home, he has found himself facing a mortal threat: the Gnosis, so called by himself, extradimensional aliens who do not belong to our perceptual plane but who, at the same time, can interact with it, making themselves in other words invincible. Creatures devoid of feelings, moved by primordial instincts, which hunt man, and to combat which man has built the AGWS, Anti Gnosis Weapon System, combat robots capable of countering the advance of sucking aliens. energies. Shion Uzuki, our protagonist, is an engineer at Vector Industries and is aboard the star cruiser Woglinde at the beginning of our story, working on KOS-MOS, a female-featured combat android built to fight Gnosis via a nanotech arsenal that allows them to reverse their phase space, making them vulnerable. Unaware that outside a special team is recovering a monolith equal to the one that appeared on Earth 300 years earlier, Shion tries to activate KOS-MOS just as the Gnosis attack the Woglinde, attracted by the monolith, the Zohar. And something goes wrong. KOS-MOS, powerful and unstoppable, becomes uncontrollable, acquires a sort of self-awareness driven by logical computational principles, in short, it becomes salvation and destruction. And while Shion begins a journey that will take her together with KOS-MOS to Second Miltia, capital of the Intergalactic Federation, destiny begins to move around her, leading her to meet individuals with extraordinary powers and mysterious objectives. Individuals such as Ziggurat8, a cyborg who rejects his human component, who is commissioned to escort MOMO, a small android who, on the contrary, wants to become truly human; individuals like Jr, a young (young?) and mysterious Commander of the dangerous Kukai Foundation, endowed with incredible telepathic powers that definitely distance him from the definition of a normal human being; individuals like chaos, an enigmatic boy with silvery hair able to stand alone against the Gnosis, which have no power over him. XenoSaga is their story, and it is a story that will take them far, far away, and that will involve not only their bodies and their minds, but also their souls, in an eternal war that, perhaps, is coming to an end. ... Will to Power ~The first effect of happiness is the feeling of power: it wants to express itself, both towards ourselves and towards other men, ideas or imaginary realities. The most usual ways of its expression are: donate, decide, cancel~. The theme of the will to power (in German wille zur macht) emerges here. The will to power, proper to the living, has no goals outside of itself, not even that of self-preservation. In fact, even when we do good to others, we actually do it to show that it is advantageous for them to remain in our power and, in the same way, the martyr's sacrifice depends on his greed for power. The will to power is at the basis of the will to truth itself and of every position of values. But in these forms the will to power is purely reactive, it asserts itself only as a reaction to others and therefore in some way still depends on them. In any case, it is neither goals nor intentions that build the force that gives the impetus to action, but a quantity of accumulated energy which is waiting to be explicated: the only acting force is the will to power. The will does not depend on the existence of an alleged self or a presumed soul, but on life, which is a continuous becoming and a necessary overcoming of itself. This will, however, is not so much the will to live, or rather to self-preserve, but the will to power: conservation can only be a consequenceindirect za of it. For Nietzsche, on the other hand, the will to power takes the form of a yes to life, in every moment and in every aspect, even to the pain it entails and contains: it is never a denial of life nor is it subordinated to transcendent ends yet to come. Only the formative discipline of great pain, not compassion, is the creator of all human excellence. Sure of their power, the strongest do not fear dangers and misfortunes, nor do they need to subordinate themselves to principles of faith; in this sense they are not fanatical, nor dogmatic, as they do not have the aim of imposing themselves as a model on others, because this would be like making one's superiority shareable and therefore it would be like reducing it. In fact, the will to power is essentially a will that continually wants itself as power and, therefore, continually tends to strengthen and increase itself. When it is not purely reactive and the result of resentment, it leads man to continually go ~beyond (in German ber) himself~: the superman (in German bermensch) is precisely the expression of the continuous going beyond that characterizes the will to power , not an ego or an empowered soul, because there is no permanent and stable substratum underneath the actions, which is the cause of the same. In fact, the will to power is essentially creation: with the death of God, man becomes free to create himself by means of the will. Zarathustra is precisely presented by Nietzsche as ~one who sees and wants and creates, himself a future and a bridge towards the future~. ~The fruit of the tree was good to eat, pleasing to the eye, and desirable for the knowledge of good and evil~ (Genesis 3:6) Like its ~predecessor~, XenoSaga emphasizes the unfolding of the story and its narration, rather than the actual gameplay. This means that the double layer DVD of XenoSaga contains over ten hours of non-interactive movies, in front of which, sometimes, the player can even sit down with a good coffee in hand, given their duration. The point is that, while in Xenogears up to three quarters of an hour was spent reading text after text to follow the action, in XenoSaga, on the other hand, each movie is entirely spoken (with subtitles, of course) in excellent English and is skippable at will by simply pausing the cutscene and pressing a button. In any case, the plot concocted by Takahashi and his team, Monolith Software, is definitely worth enjoying for every single second of every cutscene. Beyond, however, the non-interactive movies, XenoSaga also presents a more purely playful part, represented by the classic explorations and typical JRPG memory fights. There are quite a few differences, though. The first, and most important, is the ability to see enemies on the screen and possibly avoid them with a good dose of reflexes, otherwise a simple contact will be enough to unleash combat; alternatively, it is possible to interact with some elements of the environment, destroying them with a sort of gun and, sometimes, also damaging hostile creatures in the area through their explosion. The fights, in XenoSaga, present innovations and perfected re-propositions of old battle systems with pros and cons that we will analyze. In the first place, the scansion of the clashes is typically turn-based in the most classic JRPGs: this means that the speed of the characters and enemies will decide the order in which they will perform actions in battle, an order which, moreover, can be consulted via an intuitive bar at the bottom of the screen. This has a much more important value than that of signaling the order of attack: in fact, it allows you to strategically decide each action, trying to align the defeat of an enemy with the boxes of a sort of slot machine that will increase the experience obtained in battle, the power of the attack or the amount of Boost possessed by a given character. Boost is an interesting feature and, as the adventure progresses, fundamental in XenoSaga's fights: it allows you to anticipate enemy actions and perform real counterattacks by immediately activating the turn of a character who has one or more Boost units. Considering that enemies can also use the Boost, it is logical to understand how important it becomes to master this feature as the adventure progresses. Each character has three types of attacks, corresponding to three buttons: melee, ranged and with a weapon. Each of these consumes some of the character's Action Points, so it is possible to make combinations of attacks for as many points as the mom has availableent of the input. Sometimes, the combinations evolve into extraordinary special attacks, called Tech Attacks, with the most varied and extremely spectacular effects. Furthermore, each character has a set of supernatural attacks, called Ether Attacks, which instead exploit Ether Points and which, therefore, are similar to the spells and related Magic Points of the more classic JRPGs. Both the Techs and the Ether Attacks must be acquired by spending specific experience points, earned by fighting, and in the case of the Techs it is even possible to customize them at will by increasing their power, execution speed and recovery speed. The same experience points can also be used to increase the psycho-physical statistics of the characters and, considering the small number released by the enemies, it is important to distribute them carefully. Another important and intriguing feature of the fights in XenoSaga is represented by the AGWS: during the fight, all the characters except KOS-MOS and Ziggy can summon and control an AGWS, thus increasing their offensive potential and resistance; however, however powerful, the AGWS suffer from some feedback that make their use much more tactical than it might seem: on the AGWS the characters, in fact, cannot use Ether Attacks or healing items and, as if that were not enough, the weapons of the AGWS have limited ammunition. Finally, it should be noted the possibility of extracting support skills from objects by purchasing them, literally, through the umpteenth experience points. Well, if up to now the XenoSaga battle system may seem fun, complex, deep and intriguing, then know that it really is, but also know that it suffers from more or less serious flaws that make it, as well as cumbersome, also quite frustrating . Firstly, the ~slot machine~ that allows you to strategically place your attacks to earn bonuses is far from a good idea: considering the fact that defeated enemies give you the experience points necessary to progress in customizing your characters with the dropper, the need to finish the fights with the slot that guarantees the duplication, quadrupling or tenfold (the last two really rare and totally random) of the aforementioned points becomes almost obsessive; as a result, the most demanding and most rewarding fights tend to take way too long, ending up breaking up the action and interest rather than pressing the player. Focusing above all on this feature, around which the fight is necessarily built to get the better of the opponent, the fights of XenoSaga represent the cross and delight of the game, where, moreover, the failure to enhance one's characters ends up negatively affecting , on the difficulty of the clashes themselves. ~These are the origins of heaven and earth in their creation, when the Lord God made earth and heaven~ (Genesis 2:4) XenoSaga, despite being a rather old game (we're talking about February 2002 for the Japanese release), still shows a jaw-breaking technical realization today. The graphics are clean, aliasing is barely noticeable and flickering is practically absent, yet these are graphic bugs that also afflicted mega-productions such as Final Fantasy X. The detail is very high, the texturing of high quality, even if for the most of the game we find ourselves roaming through environments that are actually a bit aseptic, as in the case of spaceships; other times, however, one is pleasantly surprised by the variety and beauty of locations such as the forest or Proto Merkabah. The character models indeed turn out to be a bit wooden, especially during the fights which, although enriched by a considerable number of special effects such as distortions, lens-flares, particle explosions etc. made ad hoc, their spectacularity, precisely, can hardly hide; the animations however show an impressive fluidity in the cut-scenes, edited moreover with a truly maniacal attention to the direction and screenplay, so much so that at times it seems to see a first-class science fiction film: action sequences such as the first battle between KOS-MOS and the Gnosis or Jr's assault on the U-Tic Battleship are truly unforgettable, on a par with much slower and more reflective scenes, such as the numerous dialogues between Shion and KOS-MOS, masterfully shot. Nothing is left to chance in XenoSaga, and Takahashi knows it well, so he has peppered his masterpiece with philosophical, religious, scientific quotations: only the title, Der Wille Zur Macht, r", "date": "2003-09-16", "grade": null}