{"name": "DOOM 3: VR Edition", "ref": "https://multiplayer.it/recensioni/doom-3-vr-edition-recensione.html", "text": "Try your hand at the review of DOOM 3: VR Edition represents a pleasant journey into the past for those who have lived the launch period of the title developed by id Software, published back in 2004, with all that it represented for the franchise and for the gaming scene in general. We are speaking of an episode that was atypical in many ways, a real technological showcase that brought extraordinary visual solutions to the PC and mixed them with a less frenetic gameplay than in the beginning, oriented towards horror atmospheres, complete with jumpscare and exploratory phases designed to make the sci-fi setting truly the protagonist of the adventure. Well, the DOOM 3 experience is now also available on PlayStation VR with a virtual reality version that also includes the two expansions, namely Resurrection of Evil and The Lost Mission, to create a particularly substantial and interesting package. Or not? History DOOM 3: VR Edition brings the interface to the protagonist's wrist to control health and armor. The story of DOOM 3: VR Edition stands as a reboot compared to the first two episodes of the series and is not even linked to the unprecedented lore created starting from the 2016 chapter. We are therefore talking, to all intents and purposes, of a peculiar and isolated as part of the id Software franchise. We are in the future, inside a station built on the planet Mars to study new technologies essential for rapid colonization, above all teleportation. However, experiments in this sense give unexpected results, literally opening the gates of Hell and plunging the entire settlement into chaos. It will be up to us to stop the advance of the demons, in the role of a brave space marine armed to the teeth but far from the ferocious unstoppability of the DOOM Slayer. Gameplay DOOM 3: VR Edition aims to surprise us with some nasty surprises hidden in the dark. As mentioned at the beginning, DOOM 3 represented a sort of variation on the theme for the series, also and above all in terms of gameplay. In fact, do not expect the frenetic run & gun-style approach of the recent DOOM and DOOM Eternal, but a slower and more reasoned experience, with a limited number of enemies to face simultaneously.Mechanics that have been further sweetened in this version for PlayStation VR, increasing ammunition and medical kits around the levels in order to make the challenge more accessible in the new context of virtual reality and also allowing us to use the flashlight to illuminate dark areas without having to switch it with the rifle, so we can shoot at any time. Checks DOOM 3: VR Edition manages aiming with the DualShock 4 in a somewhat approximate way, better than the AIM Controller. If you have it. We played DOOM 3: VR Edition on PS5, however we immediately encountered a hitch: the game is not compatible with DualSense and requires a DualShock 4 controller, which is used in this case not only for its physical input devices but also and above all for the integrated gyroscope, which allows you to manage the aim albeit in a somewhat clumsy way. The luxury alternative is represented in this case by the AIM Controller, certainly able to guarantee greater precision and a superior sense of involvement in the perspective of the action, while the individual Move controllers are not supported, nor is it possible to aim simply using the analog sticks. DOOM 3: VR Edition will see us press the buttons on the various containers by hand, in this case a medical station. A pity, considering the amount of options available in order to adjust the experience according to one's sensitivity. In fact, you can opt for a fluid movement or for the traditional horizontal ~shots~ with customizable amplitude (15 degrees, by default), activate or not the weapon auto-reload, set the dominant hand and even the height of the character, but certain aspects remain binding. Not suffering from motion sickness, we opted for the normal controls while limiting their sensitivity a little, so as to decrease the rotation speed, eventually obtaining a fair compromise. Of course, in many ways we are still faced with an implementation of basic VR, with our character visually represented only with the hands and no particular gimmick. Technical realization As mentioned, in 2004 DOOM 3 was able to offer an unprecedented and extraordinary visual impact, thanks above all to the advanced lighting system guaranteed by the id Tech 4, expertly used in order to enrich the gameplay with new and interesting situations, especially for the series. Seventeen years later, those same graphics obviously feel the full weight of dThe performance of DOOM 3: VR Edition on PS5 is identical to that of PS4 Pro, while on the standard PlayStation 4 the resolution has been further reduced in order to keep the frame rate stable , obviously a fundamental element for any virtual reality experience. Nothing to say instead about the sound, which has been improved and now offers a good three-dimensional rendering of the sounds.", "date": "2021-04-14", "grade": "7.0"}