{"name": "Beach Volleyball Summer Heat", "ref": "https://multiplayer.it/recensioni/beach-volleyball-summer-heat.html", "text": "Dreaming of the Beach House... A Beach Volley title did not yet appear in the monolith's sports list, and so, in the heat of August, providence wanted Acclaim to fill this void too. The road is the one already traveled by the various Beach Spikers and Dead Or Alive X in other shores, whose main peculiarities have been somehow re-proposed (we are about to deal with the actual goodness of this ~remix~). Summer Heat primarily shares with the competition the decidedly arcade nature of the gameplay: 3 keys are enough (in addition to obviously the directional cross) to cover the entire range of actions of our character. X for reception,  for lift; slightly more complex is the attack and service control, whose different modalities (lob, ~super attack~, jump service, service ~from below~, etc. etc.) correspond to the three keys X,  and Triangle, whose the degree of pressure influences the intensity of the shot, while the left analog stick is obviously responsible for the direction. The gameplay is therefore easy to learn, also thanks to a tutorial divided into two sections (basic and advanced), which introduces us, in addition to the various strokes, to the automated movements of our teammate, in order to cover the largest surface area possible field. However, an equivalent depth does not find space alongside immediacy: the game actions, whatever the difficulty level set, can be traced back to a very limited number of schemes, which differ from each other at most for some animation, especially in the ~bailouts~ and generally in the reception phase. A structural defect, this, which in a certain sense could be considered inherent in the very nature of the title (that of an arcade in fact), which does not want to be excessively complex, but which must rather satisfy everyone, even the casual gamer looking ~only~ for carefree fun, perhaps in multiplayer. This justification, however, falls when you want to face the single game. Boredom, the worst enemy that our reader / player can encounter, in fact risks taking over very soon, thanks to a challenge factor that makes itself felt only starting from the medium difficulty level; Tedium that easily tends to frustration, given the impossibility of getting out of those few game schemes, whose limits come out above all at a distance, especially in the ~Tournament~ mode (which includes 8 competitions scattered around the States, either direct elimination, or group stage), the most demanding of Summer Heat. Alongside it we find an arcade-mode (6 consecutive matches with the possibility of continuing in case of defeat, as per tradition), exhibition, the training already mentioned, 3 mini-games (of which only 1 is available from beginning) and the beach house, inspired by DeadoraliveX-iana. In fact, Summer Heat does not have a story mode that traces continuity between the various game modes, which are precisely linked by this ~dream house~, which is nothing more than the place in which to enjoy the extras unlocked with victory in the various competitions. They range from the stereo, with the possibility of listening to the entire soundtrack of the title, made up of rather dated summer hits (the most famous for the Italian public are undoubtedly Fat Lip by Sum41 and Love at first sight by Kilye Minogue), up to TV videos of the same songs and other Acclaim games. To reward our victories there are also the inevitable multicolored costumes, sunglasses and other stylish accessories for all the characters, which are 21 in total. Technical corner! Graphically Summer Heat is enjoyable, although it is not a title that shows off the muscles of Playstation 2: the characters are modeled fairly, although some animations are not entirely convincing, very unrealistic, which however do not stand out for their variety. Insufficient (given the standards achieved in other titles it is legitimate to expect better) the realization of the faces of the athletes, which do not have any expressiveness, while the sandy surface is appreciable, on which you can see the holes and the marks left by the passage of the players. The colors used are quite vivid, and make you forget the polygonal outline structures, which are certainly not well cared for. Some ~stylistic~ details, such as the ball always followed by a differently colored trail depending on the intensity and type of shot, or the players' decomposed celebrations at the end of the point, testify even more if possible to the arcade component of the title, without however make it shine in a particular way, also because they are certainly not a novelty for those accustomed togame rooms. Any type of cosmetic comparison with Dead Or Alive X B.V. should be avoided. by Tecmo, which technically outperforms Summer Heat; a comparison can instead be made with the now dated Beach Spikers, converted from Naomi 2 hardware, the Sega cabinet, to Game Cube, which although it dates back to 2001, still manages to come out the winner. The sound is rather anonymous as regards the effects in game, while the music, which has already been mentioned above, although they are now old, go quite well with the cool nature that underlies the game. Comment Summer Heat is a title aimed at those who want a few hours of carefree play in this very hot summer, possibly with a friend as their sidekick, dreaming of the beaches of Florida and California and the luxury of a beach house; mind you though: Summer Heat is just a stopgap solution. So don't entrust him with all your hopes for your summer: he is absolutely not able to bear them, nor does he have the claim to it. After all, you know, summer is an empty period for the gamer Pros: Simple and immediate Realism adequate Fun in multiplayer Cons: Shallow Technically not excellent In the long run it becomes frustrating Summer is an empty period for the gamer: the recall games will make their arrival only a few months later, and, as if that weren't enough, after the incredible accumulation of announcements, news and conferences from E3 in May, what remains is a few miserable ~rumor~ to stimulate the fantasies. So those who can go to the beach, while those who can't obviously play at the beach in an armchair: it's time for Beach Volleyball Summer Heat.", "date": "2003-09-04", "grade": null}