{"name": "Madden NFL 07", "ref": "https://multiplayer.it/recensioni/madden-nfl-8.html", "text": "Regular Season We turn on the console and we find ourselves, if we have already had the opportunity to get to know the new Madden on a television, in an atmosphere that is unmistakable and much less sacrificed than the two previous DS editions. Game modes are all there, from Franchise to Friendly, from the option to put together a fantasy team to the option to create your own custom schemes, and if it's missing the Hall of Fame, a real novelty for this year on Wii , Xbox 360 and PS3 which allowed you to create a player and take him throughout his career from rags to riches, to compensate for it we think the reintroduction of the Season, with which we will lead a team for an entire season trying to climb to the Superbowl, without worrying too much about excessive managerial components. Its absence in the living room versions, on closer inspection, is a bit unjustified an atmosphere that is unmistakable and much less sacrificed than the two previous DS editions Regular Season Of note are several mini-games, more than the four present in the Wii version, useful both for practicing the control systems and for having fun in multiplayer, for up to four players, each of whom, however, must be equipped with their own cartridge; obviously the multiplayer is also available in the game on the field... From the point of view of the presentation we are, as we said, rather advanced compared to previous years: finally the players have their own beautiful photograph that arrives in the game to frame an action of which to go particularly proud; the licensed music, even if very reduced, pumps hard even in the small speakers of the DS and in general, as we said, the atmosphere that you breathe is the same as the older brothers. Once we get on the field we also have the opportunity to realize the graphic improvements: the title has acquired details and for the players, now easily distinguishable from each other by their physical features (the face remains anonymous under the helmet, but the which is perfectly understandable), and for the stadiums which are sometimes rather imposing structures, all without losing the fluidity and brilliance of the colours, while in terms of cleanliness we are at the aliasing fair, which however, as always happens on DS, manages to give little annoyance thanks to the small screen size. As for the sound, dear old Madden speaks little during the games, but thankfully almost never out of turn; the sound effects are excellent while the stadium chants are absolutely exceptional in quality, which, despite being repetitive for a moment with the help of headphones, will fully immerse you in the atmosphere of a typical American Sunday! Better above or below? The biggest news this year, however, EA Sports reserves for the game and gameplay, and as you can easily guess they involve stylus, Touch Screen and all those little things that make the DS so special. It was also about time, in fact, because if in the 2005 edition released just in time for the launch of the console we could forgive the almost total absence of dedicated features, it became much less bearable the following year This year the game action moves to the lower screen, deputing the upper one to the stylized representation of the map and the position of the ball and players, useful, but not excessively, to have the action under even better control, and various actions can be performed on the Touch screen. Several, but not all: the only game action to be carried out with the stylus is the kick, to carry out which you will mark two points on the screen as far apart as possible (so do them at opposite corners!) and then join them with a line which should be straight and fast in its execution to get normal results. Other actions that can be performed with the stylus are feints and passes, but these can also be deputies to the canonical keys, and there is a reason. EA must have realized that the implementation is not entirely textbook Better above or below? EA must have realized that the implementation is not entirely textbook: with the feints no problem, but the passes completely change the way of understanding an offensive action since they point to the ball not a receiver in particular, but a area in which it will be launched. Without prejudice to the normal time required to get used to the new control, the fact remains that different schemes, on some occasions the most effective ones, require the overlapping of two or more runners to confuse the ideas of the opposing defense, and now having the ball only in one direction in general and no longer a precise player to point to, it may happen that it is another receiver who tries to catch, thwarting your plans or even failing on the whole line pBecause he's busy engaging the other team's defenders in a furious ~cover~ tackle. It will therefore not be difficult that, once you have tried the new tactile controls, you will return to the more reassuring and traditional front keys, also because then the rest of the game does not do much to entice you to use the stylus: in-game it will be possible to draw a new path for the receivers before the start of an offensive action, perhaps having seen an evident flaw in the opposing defensive line-up, and, this time on defense, assign the man markings. They are both very interesting possibilities especially when you have practiced them well, but then why in the Create A Play mode, when the stylus would make everything immensely intuitive and brilliant, can't you use it? Mysteries of an implementation full of good ideas but not as successful. However we are not in disaster, far from it, and to confirm the good will comes a last feature, that of recalling by voice, with the microphone, a game pattern on the field immediately before an action instead of the one previously decided in the special screen, just like real quarterbacks! In the third edition of Madden for DS the steps forward are significant, and on all fronts. Unfortunately, what should be the extra weapon of games for the Nintendo laptop is partially ticked here, and in the end we are better off with the canonical control system rather than with the one via Touch Screen. This makes, in the portable sphere, this Madden all in all inferior to the PSP version, which is a step up in terms of graphics quality and presentation. The title is still very valid, with the solid and usual simulation engine to dominate, capable with its thousand options of giving hours and hours of fun and also finally does not suffer, always within the limits of possible, from inferiority complexes compared to the versions from living room. The regret remains for an innovative step only half completed, but still highly recommended! Pros Improved technique and presentation The usual Madden! The Touch Screen partly works well ... Cons ... and partly not! Multiplayer only if equipped with multiple cartridges The relationship between the sports genre and portable consoles has always been quite troubled. The main cause of all this is essentially to be found in the considerable technical gap that has almost always separated handhelds from living room consoles: if at home at the time of 16 bits we had a fast, fluid and perfectly controllable FIFA, the honest Game version Boy in comparison looked like a joke, and if on Super Nintendo the digitized sprites of NBA Jam sparked, on a monochrome screen like that of the first GB they were just ridiculous. Things haven't changed that much with the GBA, which finally made the possibilities of a sixteen-bit from home on the street: a pity that at the time of the GBA there were already 128 bits at home... The turning point should therefore be with new portables, one, the PSP, practically almost on par with the PS2 generation, the other, Nintendo DS, which roughly allows you to do the same things as a home console albeit with many fewer details and a few more sacrifices . The time has therefore come, for all pocket sportsmen, to raise their heads and look at their couch potatoes cousins with new pride, without forgetting that the DS also has a couple more weapons! Of course, all this in theory, but in practice?", "date": "2007-01-24", "grade": null}