{"name": "SX Superstar", "ref": "https://multiplayer.it/recensioni/sx-superstar.html", "text": "On the track The season is made up of numerous events, mostly racing and rarely stunt sessions (optional, by the way), with a points system that rewards each of the six competitors depending on their finishing position, of course. The control system is extremely simple: the right stick controls the movement of the bike, including wheelies (both forward and backward), the X key is responsible for acceleration and the Square key is used to brake. It is possible to change the view among three available (from behind, from far behind and in first person), but personally I found them all awkward: the first person view prevents you from realizing how the bike is set up, which is essential to avoid falls, while the two from behind often and willingly cover the track, almost always difficult in itself to identify. The stunts are performed with the usual combination of back buttons, but it is difficult to perform maneuvers of particular caliber without risking compromising the race: the jumps are short, you get to the ground quickly and there is not much time available. Especially since, from the point of view of the race, stunts are completely useless: after a while you will give up performing them, in favor of regular and more productive conduct. From here we come to one of the most serious problems of the game: you fall more often than not. Sometimes it seems that the tracks are made to set traps, and even the opponents do not come out unscathed from all this: in front of and behind you you will see several riders fall together, and you will have to be careful not to end up on their bikes. Progression and development The bike you start with is a 125cc. As you earn money, especially once you have won the first season and moved on to the next, you will be able to afford a vehicle with a larger engine capacity, which will allow you to go faster especially uphill and never let your opponents detach you. It is very strange that no distinction is made between engine sizes in the game: you will be able to compete with motorcycles of different power without any difference, perhaps detaching the other competitors in a frightening way. It goes without saying that this is not a positive thing in terms of playability, and above all the lack of the possibility of modifying the vehicle is felt: if you want to have something more, you necessarily have to change the bike. The game, therefore, will only see you fight to make money, without anything side dish and with the only incentive of the number of tracks available, actually quite numerous. And here we come to another serious flaw, already mentioned above: the tracks are unclear, and it is extremely difficult to follow their trajectory when there is no reference. On some you can turn without problems, on others it's a real torture: there are different paths and no sign of which one is the right one. It is not even possible to test the track before the race! Concluding... SX Superstar is a game that offers nothing in particular to lovers of extreme sports, and nothing in general to those who love racing games. The graphics do what they should without infamy or praise (there is the option to update to 60Hz), and the engine occasionally suffers from slowdowns. The bikes and riders look good, if not particularly detailed. The animations are pretty poor, though. The tracks are really a disaster, or at least almost all of them. Finally, the visuals available do not improve this problem: when you start to lose the right path, you inevitably end up abandoning the race... The usual soundtrack with rock songs naturally fails to cover the many defects of SX Superstar. Maybe the fact of receiving phone calls from maniacs and changing your girlfriend like you do with your car could be nice, but it's certainly not what players expect from such a title. Pros: Good soundtrack Nice career mode Cons: Not great graphics Few modes and little variety Poor development possibilities Stunt motocross champions! SX Superstar is one of many games that allow you to ~virtually~ experience an extreme sport. It is obvious that this is not an experience in the least comparable to the real one, and in this case the game does not even have truly simulative ambitions. Instead, it takes the classic arcade approach of jumping from enormous heights while twisting on the seat of the motorbike. Nothing new under the sun... There are two game options: Arcade and Championship. In the first you can try your hand at ~fast~ races, using a series of circuits scattered around the world,to which new ones will be added by playing in the Championship mode. The latter, needless to say, constitutes the real game: you choose an alter-ego among the many available (even real ones - which doesn't make a difference anyway, given that this sport is unknown in Italy) and you throw yourself headlong into the various competitions, to earn money and fame. Things are handled a bit like in Driver. We will be able to listen to the messages on the answering machine (often from our manager, sometimes from a psychopathic fan, or even from someone who thinks he is calling his BDSM dominatrix...) or view the faxes (which always bring good news, or sponsorship proposals), buy a new bike or take to the track following the dictates of the calendar for the current season. Very nice the fact that we will find on a table the photo of our current girlfriend, which changes (literally) as we acquire success ...", "date": "2003-09-02", "grade": null}