{"name": "Hunt the Night", "ref": "https://multiplayer.it/recensioni/hunt-the-night-recensione.html", "text": "It is increasingly difficult to stand out on a platform that is now widely used like Kickstarter, but the Spanish team of Moonlight Games has managed to manage the campaign wisely, proposing a video game that takes the top view of Secret of Mana and lowers the protagonist Vesper into a rotten and bloodstained world, explicitly mentioning Bloodborne in the incipit of the adventure. They are high-sounding names, but Hunt the Night - despite being a production with an overall small budget - manages to stand out compared to similar projects thanks to a distinctive graphic style and a fast and bloody combat system, capable of fully reflecting the ruthless nature of Medhram, the world in which Vesper and the rest of the Stalkers roam. It is a pity that the version tested for the review had some limitations compared to the launch build (the Prime Hunts mode, with the possibility of re-fighting bosses, does not was available in our test). Initially we experienced some bugs, but the numerous corrective patches released to date have significantly improved the situation, smoothing out practically all the roughness and allowing this excellent (and frenetic) action game to shine as it deserves. We tell you about our experience at Medhram in our Hunt the Night review. The Hard Life of a Stalker Vesper, the female protagonist of Hunt the Night, is very fast in her movements: the exploration and combat system is based on her lightning-fast dash In the Ninth Age of humanity, the arrival of the Night - capable of annihilating, cycle after cycle, human beings - is thwarted by the Stalkers, a sect of warriors who have discovered how to use (paradoxically) the powers of darkness to prolong the duration of the day, the time in which men can live and prosper. It is the blood of the Stalkers that feeds the Seal of the Night, central to the plot of Hunt the Night, the only means by which the darkness can be kept at bay and humanity can continue to live, albeit at a great cost. Vesper moves in a dying world, Medhram, now about to surrender to the Night: it is her job to redeem herself and the misdeeds of her father, a traitor to the Stalkers, and continue to feed the Seal to prolong the existence of the human species. The presence of the cycles is certainly familiar to fans of Dark Souls, and exactly like the works of FromSoftware, Hunt the Night is also told mainly through the descriptions of weapons, armor, objects and special powers, as well as with the Raven Feathers, memories of the Stalkers who are scattered throughout the game world and can be found in the most disparate corners. Overall, the story is told in a stimulating and coherent way, without reinventing the wheel of dark fantasy styles, and keeps a good pace for the entire twelve hours or so it takes to complete the adventure with adequate appreciation of the game world and its branches secondary. Gun cotton fights On average, Hunt the Night's boss battles are excellent in design and flawless in execution Vesper is very quick to shoot, a central mechanic in both exploration and combat. Governed by the Darkness bar - which slowly restores over time - the shot favors a hit and run style in duels against the creatures of the Night, quite varied and characterized by sometimes quite original designs. With a system similar to that seen in the demo of The Last Case of Benedict Fox, shots with a white weapon reload the bullets available to the protagonist, making a ~mixed~ approach to fighting advantageous. There are several types of short-range weapons - including swords, spears and greatswords - and three types of pistols; the latter can be upgraded at the central hub, unlocked after about a couple of hours of play, where upgrades for Vesper's healing items can also be purchased. The currency of the game world is the Noctilium, obtainable by defeating enemies and opening chests found around Medhram. Hunt the Night features RPG elements that are not too detailed but well implemented, such as the presence of the aforementioned firearm upgrades, but also the existence of equippable items capable of enhancing certain skills and clothes with special powers (which, in a touch that shows attention to detail, they change the color of the sprites that make up our Vesper). Contrary to what happens in souls, losing a fight does not mean having to recover the Noctilium at the point of death: Hunt the Night has a medium-high difficulty, but has no penalty in case of game over. Revives at the nearest Raven Altar, Monogo that serves as a checkpoint and also as a save and move point in the vast game map. Touching or not an Altar is the result of a tactical opportunity assessment, given that contact with it involves the resurrection of enemies defeated by Vesper in the area. Too bad for not having been able to try the Prime Hunts mode before the release date of Hunt the Night, because the battles against the bosses are adrenaline-pumping and well-kept in the design of the enemies and their powers. However, the Hunting Assignments, which can be found in the tavern of the central game hub, are not always interesting: by paying a sum, you can access arenas scattered in the various places of Medhram and face enhanced versions of the basic enemies. If in some cases we have found stimulating challenges, in others the team has infused less effort, and more trivial clashes have resulted; however, on average Hunt the Night's fights are fast, unforgiving, just as difficult - in a word, delicious. A dying world Some locations are more obvious than others from an aesthetic point of view, but the artistic direction of Moonlight Games always has something to say Medhram often presents the most classic settings seen in dark fantasy video games: the dark forest, the castle haunted by unspeakable powers, the sanatorium tormented by the ghostly presences of the people once hospitalized there. Moonlight Games, however, has succeeded in the difficult task of making these more traditional locations pleasant and beautiful to look at and walk through on the one hand, while on the other hand inventing more unusual places, always with a great commitment to artistic care and balance management chromatic settings. Essential in the exploration are the powers of Umbra, the spectral side of Vesper's soul, capable of projecting itself beyond obstacles and then ~recalling~ the physical body of the Stalker beyond them. Gaining these skills along the way encourages backtracking to areas already explored. Regarding the structure of the game world, we report an initial dispersion in the very early stages outside the initial castle - a dungeon that is simply perfect as an introduction to exploration and combat mechanics - fortunately resolved by the presence of a character who gives us advice on where to go continue the adventure. There's no shortage of side-quests, quite modest in number, but fortunately Medhram offers many nooks full of secrets that encourage exploration. Good puzzles, with a good variety and able to build interesting interactions with the environment. In Hunt the Night there are glimpses of rare beauty Honorable mention for the interfaces on the screen, non-invasive and totally consistent with the gothic aesthetics of the setting and of the protagonist Vesper; the same consideration applies to the menu. Overall, the glance of Hunt the Night is remarkable, despite the simplicity of a pixel art that is not too refined, but capable of building an excellent balance between all the elements on the screen. There is currently no translation into Italian, and we have enjoyed Hunt the Night with texts in English. The aesthetics of the menu and interfaces are perfectly consistent with the gothic aesthetics of the world of Medhram, where Hunt the Night is set The soundtrack is excellent, in which Hiroki Kikuta also collaborated (composer, among other works to which he contributed, of the soundtrack of Secret of Mana): the sonorities are mainly based on piano and strings, and are suggestive both when they have a more contained , both in the more bombastic and orchestral tracks. It is no coincidence that the developers of Hunt the Night advise players to enjoy the experience with headphones: even the diegetic sound effects - the sound of footsteps, the sound of a gunshot, the wind whipping a snowy hill - are very accurate, and they contribute in a non-marginal way to the construction of an experience that demonstrates great attention to these details. The code, not very clean at the beginning of our test period, has been systematically optimized, removing the bugs initially present to present a much more refined product on the eve of launch, the moment in which we write this review.", "date": "2023-04-12", "grade": "8.0"}