{"name": "PlanetSide", "ref": "https://multiplayer.it/recensioni/planetside_a.html", "text": "It was the time of the FPS.... A long time ago the First Person Shooters were born, i.e. the first person shooters, importing a decidedly innovative new genre into the PC playground. Back then, games like Castle Wolfenstein came out, which lately has returned with a dazzling new edition, Quake or the fantastic Doom; The FPS genre was appreciated by a large part of gamers, and over time this phenomenon expanded dramatically. What happened then? Simple, thanks to the advent of ever more performing machines and cutting-edge video cards, the FPS genre has also evolved a lot, expanding to create titles with a remarkable visual impact. Obviously the titles seen in recent years have not stopped at a mere graphic improvement, but have undergone other significant changes. It would be enough to talk about Unreal Tournament to bring to mind the first FPS dedicated entirely to multiplayer mode, followed by Quake III and many other titles. Like the old FPS dedicated to the single player, it was also an almost announced success for the new born. After years of success the multiplayer mode has evolved again, creating what for many was a dream ... an MMOFPS. What does this strange word mean? Massive Multiplayer Online First Person Shooter, in simple terms it is a new experience of online FPS, where players are no longer transported to a single map or arena, but in a persistent world. For many, the word ~MMO~ is nothing new, given that the first genre to have entered this mode is the RPG, but seeing it inserted in an FPS is difficult to describe, one could speak of an ~experience~, that is something to try absolutely. What I'm about to do is precisely describe what this experience consists of, thanks to PlanetSide, the brand new title from Sony Online Entertainment. The Story I can do.... The Republic of Terran, existing for over a thousand years, was the only governing power with an intergalactic realm. Founded on a highly belligerent policy, the Terran Republic maintained absolute authority until recently, when an expeditionary force was sent into a star tunnel to colonize a newly discovered world called Auraxis. During the colonization of Auraxis, three main bases were established at different points on the planet's surface to speed up the colonization process. In the following years, numerous other outposts were built on the continents of the planet. Furthermore, the remains of an ancient alien race that took the name of Vanu were brought to light. It was not possible to discover what happened to the Vanu, but elements of their technology, especially ~regenerative~ technology, were discovered during the colonization phases. Using a hybrid of Human and Vanu technology, humans were able to retain their genetic code. Whenever someone died, it was possible to bring them back to life thanks to regenerative technology. Toward the end of the colonization period, the star tunnel collapsed, isolating the Republic of Terran colony from the main empire. Tensions grew and resulted in riots. Under the pressure of splitting from the main core of the empire, the Republic of Terran was eventually split into three powers: those who remained loyal to the Republic of Terran were joined by the New Conglomerate and the Vanu Sovereignty. Now the three empires are engaged in a war for control of Auraxis. A war that never seems to end. New Conglomerate Overthrow the threat posed by tyranny! Destroy everything and start over! We call all men capable of arms to fight against those who want to deprive us of fundamental freedoms. No mercy!! We can't forget the time of oppression we lived through by the tyrants of Terran and the fanatics of Vanu! Voluntary enlistment now! The equipment of the New Conglomerate can do maximum damage in a single hit, albeit acting slowly. The confirmation is given by the assault tank of the NC, the Vanguard, which has the largest cannon available, albeit with a lower volume of fire. Further demonstrating the NC's love of raw power is the Jackhammer, a three-barreled automatic rifle that can blast enemy soldiers and vehicles from close range. Auraxis and surroundings.. To be able to try this type of experience, you must first create an account in SOE (Sony Online Entertainment), i.e. the server dedicated to PS and many other titles such as DarkAge Of Camelot (MMORPG). After creating the account you need to activate the monthly payment system, either by credit card or with a special Gamecard. After activating the account I can finally join the inhabitants of Auraxis. After activating the account, you move on to creating the character by choosing the faction, divided between NC (New Conglomerate), VS (Vanu Sovereignty) and TR (Republic of Terran), gender, face and finally the voice. The character who will have to fight on this planet has been created, now you have to choose whether to leave at the Sanctuary or in Instant Action. By choosing to start at the Sanctuary, the main base of the faction, you can easily familiarize yourself with the game controls, use virtual training areas, choose the certifications suitable for the character or simply take a look at the paraphernalia. The reverse instant action will spawn you directly to a ~hot~ location, i.e. a location where there has been heavy fighting recently. Especially recommended for those who have already created their soldier with the right certifications, given that in battle you can do nothing but fight and recover ammunition. After selecting the certifications, which can range from the use of heavy weapons to driving vehicles, you have to arm yourself at one of the many terminals dedicated to paraphernalia. When the soldier is ready it is vital to learn the situation of the world, trying to understand where and how the clashes take place. The world is divided into 10 continents contested by the 3 empires. Each continent has a different climate, flora and landform, creating an infinite number of tactics of warfare. Obviously it's not healthy to set up solo guerrilla attacks, the game itself pushes players to create squads containing up to 10 players. Each team has a commander who manages the tactics and gives the team certain orders depending on the specializations: to give you an example, if your soldier is a Reaver pilot (a sort of fighter equipped with a missile launcher and gattling) it is possible to receive reconnaissance, or escort some land vehicle defending it from air attacks... It is therefore important to find a team, both to earn more experience points and to have greater support in battle. The main objective of the game is the total control of the 10 continents, gradually capturing all the installations present in each continent. The installations can be captured using special devices called REK, using this tool will start a countdown which, if completed successfully, will deliver the base to the hacker's empire. As I just said, to be able to successfully capture installations you need the Haker and Advanced Haking certificate, both to reduce the hacking time and to be able to capture any type of terminal. Each base also has an energy source called NTU (nano-technological units), this energy is consumed at each creation (respawn, i.e. when you die and reappear in the chosen base) or when any terminal that requires energy is used, such as the terminal medication automatic. The NTU level is essential for a base, if this drops to 0 the base becomes neutral, turning off any type of terminal and consequently forbidding any access. When the level drops to 0 it is necessary to carry the NTU energy using a sort of wagon used for energy transport called ANT. Through this small wagon it will be possible to acquire energy from the Portals present in the territory. These portals, in addition to providing energy, are used to connect the various continents with each other and with the main bases (Sanctuary). Each continent has 3 portals connected to other continents, thus creating a dense web of viable roads. But the portals are not the only method of transport, there is also the HART, a shuttle that will carry several soldiers into orbit and then drop them in every corner of the planet. I have often tried this mode of transport because I consider it the most spectacular... seeing a sort of ~drop pod~ thrown into the void at incredible speed is fascinating. Conquering bases, killing enemies and destroying their equipment will give your character battle experience points (BEP). By accumulating these points, the character will rise in rank, each time obtaining certification points and spaces available for grafts. Certification points can be spent at the certification terminals at the Sanctuary or in an allied Biological laboratory (one of the installations present on a continent) to access different types of equipment, such as the medical applicator, which allows you to heal the wounds of your companions or of your soldier. Certainlyfications also give access to different types of land or air vehicles. Spending the certification points you begin to specialize the soldier in a specific discipline. You can opt for the heavy assault and consequently the purchase of certificates to use heavy and resistant armor, specialize in medicine, with the ability to heal or even resurrect comrades who died in battle, or an expert hacker to more quickly violate the access routes and terminals of enemy bases. Or you can create a soldier with your hands in all disciplines, thanks to the fact that the certification points spent are not lost forever, but it is possible to recover the points spent using the Unlearn function (forget) at the certification terminals. The graft spaces serve to house the cybernetic tools known as implants. These devices can provide your character with super gatekeepers such as Surge, which allows you to perform a short burst or the Personal Shield graft, which when activated provides a temporary force field. The maximum of grafts is 3, but it is important to choose well which ones to get implanted, even if they can be changed, since they consume part of the electricity present in the armor. I talked about the soldier, experience points and certificates, but in addition to the career of Soldier it is also possible to start the career of Commander. The commander system is completely different: for each base or installation captured by the team the commander earns Command Experience Points (CEP), by acquiring these points the character increases in command rank, gaining new advantages each time, such as the ability to communicate to the upper levels or the possibility of defining milestones thus highlighting the areas of interest. The possibilities are endless and thanks to this the longevity of the title is greatly benefited even if it is undermined by a poor variety of objectives. In fact, fighting and capturing in the long run can be tiring, and the absence of other types of perhaps more complex objectives in the long run makes the title a bit repetitive. With these words I'm not saying that you will be bored to death, the game system is similar to the various Halo and CounterStrike, but in the long run, the fact of having to fight - capture - fight will lead you to look for a different stimulus, perhaps looking for a skilled commander able to create fun objectives himself to complete. Vanu sovereignty The fate of the human race is ruin. Thousands of years of myopia and poor foresight have hindered its correct evolution. We are falling into oblivion. Those who are able to understand humanity's potential and future will move forward. They will accompany the less gifted through the path of knowledge and will erase the stains of blindness, ignorance and stubbornness of the human species. We are the keepers of evolution, the messengers of progress. Light is our goal. Flexibility and mobility are the keywords for the Vanu. Their equipment lacks in sheer power and rate of fire when compared to that of their enemies, but the armor-piercing ability of their weapons gives them unparalleled flexibility in combat. Similarly, their vehicles do not have a speed equal to that of enemy vehicles, but the possibility of moving through the water allows them to attack from unexpected points and, therefore, to turn the outcome of a battle more easily in their favor. battle against an entrenched enemy versus a traditional attack. Wandering the streets of Auraxis.. The graphic side of the game surprised me a lot, given that in a similar experience I would have expected a ~flat and without details~ engine, on the contrary I found myself faced with a fast and detailed engine. The amount of vegetation, trees and endless grass, mountains that touch the sky, an incredible visual distance, all this recreated to perfection while maintaining an excellent speed and dynamism for a multiplayer game. The setting of each continent varies a lot depending on the climate, sometimes creating very evocative territories. The animations of the character as he runs through the expanses of the continent are wonderful, with weapons on his shoulder and every transported object visible. The fights are fantastic, seeing for the first time 70 or even 100 players in a base shooting wildly at a mass of enemies is aphrodisiac. However, the lag is often felt, especially in these cases, making the clash a real massacre. In addition to the lag, which only occurs in rare cases, the title has a great demand for hardware and especially for", "date": "2003-08-01", "grade": null}