{"name": "Recensione di Warcraft III: The Frozen Throne", "ref": "https://multiplayer.it/recensioni/recensione-di-warcraft-iii-the-frozen-throne-2.html", "text": "The first impact The packaging leaves a bad taste in the mouth. The shelf of Blizzard games, rigorously in boxes that make a damn good impression, now finds itself having, as the last game, a small plastic container usually called a ~DVD box set~ to give it that dignity which, however, next to the aforementioned tinned goods, loses in less than a tenth of a second. Fortunately, Arthas' big grinning face manages to make any package charismatic, so we go to open and examine. The manual takes the reader well into the new features of the game, but it is short, black and white, and completely lacks the plot details that have characterized all Blizzard productions up to Reign of Chaos. A very curious policy change, one that fans of Warcraft history will surely not appreciate. Alongside, as happened for Reign of Chaos, there is only one CD for The Frozen Throne. Not bad, get used to plenty of CDs for Giga and Giga installation. The minimum requirements of this expansion, moreover, have not changed from the original. Tested on a system with a first generation Radeon, at 800x600 resolution with medium details I didn't notice any worrying slowdowns. The game options, however, allow for considerable scalability, so as to fully enjoy the fluidity of the game with a wide range of systems. The game menu is as simple to read and navigate as Reign of Chaos, with a backdrop created in real time with the game engine no longer set in a wasteland but near the Frozen Throne. Now we just have to start examining the actual game in detail, starting with the single player campaign. Defections at Blizzard Shortly before the release of Frozen Throne on June 30, 2003, 3 co-founders of Blizzard North (Erich Schaefer, Max Schaefer and David Brevik) plus Vice President Bill Roper resigned. The reasons for this departure have not been disclosed, and the official press releases only state that relations with the resigning remain excellent, a sign that there have been no quarrels. Evaluating possible hypotheses made by several parties, one of the most likely ones would concern a tension in relations with Vivendi, publisher Blizzard. However, the player is interested in knowing if the lack of these 3 minds, because Bill Roper was only the Blizzard PR chief, could cause problems for future Blizzard North games. Let's take a step back. The Schaefer brothers and Brevik, as co-founders of Blizzard North, were also the masterminds of Condor (before it was acquired by Blizzard as Blizzard North), and thus also the creators of Diablo turn-based. Now, given how Diablo subsequently became thanks to the contribution derived from Blizzard, perhaps they will not be an invaluable loss for the future of the Irvine house. Bill Roper as mentioned is a special case, given that his contribution in the titles is not of primary importance; technically he was the big man the world knew as Blizzard, and at big events when they said ~Bill Roper's here~ everyone knew they were talking about Blizzard. His departure therefore constitutes a great loss of ~faade~ and it will be very difficult to replace him. Paolo 'Rocket' Lancelli Maritime news The opening animation to the campaign is qualitatively average for Blizzard productions. A masterpiece. Particularly retrospective, therefore non-action, it shows for the first time ~rendered~ Illidan, Hero of the Night Elves, awakening a new race from the bottom of the sea... the Naga. And here who, in this expansion, expected to be faced with a new race, will be only partially disappointed. If indeed in Multiplayer there will always be four usable races, in the campaign there will be some missions in which you can manage the units and buildings of the Naga, a marine race able to move even in the open sea and equipped with very powerful assault units. I mentioned the ~sea~, and fans of Warcraft II ships will be able to smile again: the galleons and, in general, naval units are back. While not decisive, but essential in some missions, they give that something extra that makes the game even more complete. Returning to the campaign, the missions will be 6 to 10 for each race, plus a separate chapter for the Orcs which I will talk about later. The type of missions varies and a lot: ranging from the classic build-and-attack missions to mere ~exploration~, passing through new types of objectives or innovative tactics for completing the mission. All seasoned with interesting new potential, such as the construction of shops for the purchase ofmagic items or the possibility (in Multiplayer) to hire Heroes. Tactics and difficulties Even The Frozen Throne, as happened for Reign of Chaos, offers missions with decidedly imaginative and unprecedented primary and optional objectives. If we add to this the obligation to think of new game tactics to complete the missions, The Frozen Throne further expands the potential expressed up to now by the RTS. The best example is achieved with the last mission of the game: the user will be faced with a new objective and will also be forced to use new tactics to reach it (for example, great defenses, unbridled attacks or careful micromanagement of constructions/units lead to counterproductive results or excessive time wasting). However, all this leads the average user, who appreciates RTS but is not an unbridled point-and-click wizard, to rather heavy limits of frustration. There is a very limited possibility to choose an adequate level of difficulty: the easiest choice, ~Normal~, is actually a difficult level for an average player, and to do the missions with an easier level you must first be defeated . There is no other way to face the mission on a more human difficulty. Therefore, on the one hand we are faced with an extraordinary plot, charismatic beyond all limits and full of emotions and twists, with missions that are always different and which therefore offer a great longevity, thanks to the desire they give to try them with different tactics . On the other hand, the difficulty of the missions themselves is bordering on frustrating. If in Reign of Chaos the average completion of a mission was around 30 minutes with very few recourse to saves, now the average time has doubled, and loading saved games is a very frequent operation. Diablocraft A separate paragraph must be devoted to the Orc campaign, although there will be an entire article dedicated to the type of Orcish missions and the unpublished and secret missions of The Frozen Throne. If in Reign of Chaos the Orcs had a story of their own, even if perfectly embedded in the main plot, in The Frozen Throne Blizzard has decided to dedicate to what is certainly the most charismatic race of the series not only a separate chapter, but also a game methodology completely different from the others. Defined by the ~ex~ Bill Roper as an RPG-oriented demonstration campaign, the Orc missions are nothing more than Diablo disguised as Warcraft. The player will take on the role of one or more Heroes simultaneously, and level them up by tackling assigned missions throughout the game. There will be camps to store items, shops and ~mercenaries~, resurrection stones and... tons of enemies to face. A sort of action rpg, like Diablo, with the Warcraft setting. Precisely for this reason, those who have not appreciated Diablo will find these missions boring, with a competition between the number of yawns and the always identical phrases of the Hero who, with each click with the right button to move it, repeats until exasperation. Instead, those who love action rpg will find bread for their teeth, with a different game system than they were used to: independent framing with respect to their characters, mini-map always visible with indicated objectives, possibility of hiring many followers and many other features of an RTS applied to an action game. If we look for the reasons that have induced Blizzard programmers to create a ~countercurrent~ campaign, we find two plausible reasons: the desire to demonstrate the potential of the Warcraft engine, for example by exploiting the multi-map support, where the dungeons are loaded dynamically and the completion of these sub-maps can affect the main maps; the curiosity of having a preview of a sort of action Warcraft, the fulcrum of the imminent beta of World of Warcraft, an action mmorpg which, not surprisingly, will exploit the immediacy of the Diablo style with the charismatic Warcraft settings. Deep into Warcraft Warcraft isn't just a real-time strategy game, it's a real event. Like Diablo and Starcraft, it brings with it a dizzying swarm of fans, and it's always a challenge to be able to keep players updated on Blizzard strategies, with running out of news, breaking news, announcements of delays and much more. Blizzardplayer has been dealing with informa for yearsre users with news and articles. For Warcraft III: Reign of Chaos, in addition to the classic review, you will find articles of all kinds and guides to the campaigns of all races. For The Frozen Throne there will be the same sequel. More gameplay insights, campaign walkthroughs, and more as we wait for the world of Wacraft to transform from RTS to MMORPG with the release of World of Warcraft. Technique The graphics of The Frozen Throne obviously remained the same as in Reign of Chaos. The new units are therefore grotesque and caricatured, embellished with excellent levels of detail; the colors of the settings, increased with the expansion, are bright and the effects of the spells of excellent level. The presentations of each mission, created with the game engine, confirm that Blizzard is also able in the 3D sector to create excellent models and with considerable room for improvement. Moreover, the ending that precedes the closing movie is also made with the game engine but using the units in a ~realistic~ version instead of grotesque, with well-made results (certainly not perfect, Half-Life 2 or DooM III are another thing, but great for an RTS) and with action scenes that recall Japanese cartoons. The audio sector, with reference to the Italian version, is of decent quality. On the one hand the voice actors are good at making the voices of the units exciting, but on the other hand sometimes you notice the use of ~cheap~ vocal filters, the same voice actor giving voice to multiple units or low key acting , such as that of the Lich King. The ambient sounds are of a good standard and accompany the clashes between units properly. Translation glitches are also noticeable, such as incorrect sentences (~the mine is about to end~ instead of ~they are attacking our allies~) or descriptions of the remaining spells in English. Few things, however, that can be fixed in future patches like Reign of Chaos or Diablo II have done in the past. Conclusion The Frozen Throne greatly expands and balances Warcraft III. There are many new units that expertly fill the shortcomings of the original and a ~classic~ campaign with new game modes, wrapped in an engaging storyline and supported by a type of game never seen before. In short, the thickness of The Frozen Throne is enormous, and Blizzard has managed to give its best in a game that risked being suffocated by the still very large following of Diablo on one side and the frenetic wait for World of Warcraft on the other. Starcraft fans, i.e. those who until recently defined their game as the non plus ultra of RTS, today have a more than valid alternative in the combination of Reign of Chaos & The Frozen Throne, with a vast range of construction management and different troops which ensures the game a remarkable longevity. On the other hand it's hard to ignore the difficulty of some missions, which the average player can find bordering on frustrating. Even in the Multiplayer field, the matter becomes complex: where on average the players present can fully enjoy the potential introduced with the expansion, an inexperienced user risks becoming demoralized by suffering continuous and humiliating defeats. Fortunately, the Battle.net gaming system allows even the most inexperienced users to be able to compare themselves with players of the same level. All this is accompanied by the classic detailed and cartoony graphics, good quality audio and the usual, immense and unstoppable following of fans that will make the purchase of The Frozen Throne a must for lovers of the Warcraft series and time-strategy games. real. Pros: Innovations made throughout and attention to detail; Addictive Singleplayer and Addictive Multiplayer; Exciting Orc campaign for action rpg lovers. Cons: Ridiculous packaging and manual compared to the previous ones; Some frustrating missions for an inexperienced player; Boring Orc campaign for those who don't like action rpg. Introduction It's all too easy to predict the releases of Blizzard games. Although the official announcements declare winter releases with at most slight postponements, seeing a new title on the shelves between June and July is now an appointment that has been repeated for years. And so if last summer it was the turn of Warcraft III: Reign of Chaos, classic real-time strategy (RTS), charismatic as always, seasoned with interesting new features and winner of the M.it PC Awards 2002 for best RTS , this year is the time for its expansion, Warcraft III: The Frozen Throne. On the background of the new race and new units, as well as the storyline introducing The Frozen Throne, s", "date": "2003-07-30", "grade": null}