{"name": "Starsky & Hutch", "ref": "https://multiplayer.it/recensioni/starsky-hutch-3.html", "text": "70's It is not difficult to see the sources of inspiration for the Starsky & Hutch structure: the basic path is the one inaugurated by Driver. It was also predictable, given that the title Reflections was inspired by that kind of narrative. The main mode includes three seasons, divided into a certain number of episodes, in which we will be engaged in the classic chases of the show aboard our faithful Ford Torino. It is interesting to note that in the normal setting we will find ourselves controlling the two protagonists at the same time, one at the wheel as usual, and the other armed with a pistol with automatic aiming, so as to limit our intervention only when the opponent's vehicle is framed by the CPU . Criminals won't be the only targets on which to unload our arsenal: Bay City is full of elements with which to interact to obtain a series of advantages, which can vary from slowing down enemies, to boosting bonuses for our car or our paraphernalia, but also to simple increments of the final evaluation. There are also ramps, shortcuts and spectacular events to be activated in certain situations, strictly framed with a cinematic look. At the end of the episode, we will be assigned a ranking, with which it will be possible to unlock special unmissable contents for the true enthusiast, while in Free-Run we will be able to roam freely around the city without too many worries. That's all, really. A simple Arcade. And it is precisely the greatest flaw of Starsky and Hutch. In fact, the missions are all a bit similar, making the gameplay repetitive since the second season. The situation improves significantly in multiplayer and with the help of steering wheel and gun, where the immediacy of the controls and the action give life to exciting cooperative sessions. However, the fun is not destined to last long: the presence of only three seasons and the rather low level of difficulty will make you complete the title quickly enough, and the extra missions certainly cannot be said to be demanding. We close by praising the good job of localization, optimized, free of black bars, and translated into valid Italian, confirming the recent trend of also respecting the European player, mistreated since the inception of the Sony console in our market. Bay City The technical realization of Starsky & Hutch effectively duplicates the atmosphere of a bustling American city of the time, while bringing back the same lightness present in the structure. It begins with an introduction in real time, deliberately blurred, which leaves us somewhat dumbfounded due to the not exceptional quality. The impact with the style of the interface and above all with the narrative breaks between one episode and another which follow, with a technique similar to cell shading, the American comics of that era are decidedly better. It would have been interesting to see this process applied in the graphics engine as well, but it was decided to opt for something more traditional, and the results are modest. Although the settings are fairly detailed, with a high quantity of elements to interact with, their realization is in fact approximate: poorly defined textures, slowdowns, pop-ups, imprecise collisions, unnatural animations are a small but significant extract of the Starsky & Hutch, who fails to be spectacular enough even in special panoramic events. The audio component is average, certainly reaching the goal of involving more with the always ready jokes of the two protagonists and the typical soundtrack of the roaring years. Comment Despite the good intentions of the programmers, Starsky & Hutch remains the classic title dedicated mainly to fans of the show from which it is based. In fact, the latter will be attracted by the possibility of impersonating their favorites on the streets of Bay City in pursuit of America's worst criminals, with the spectacular evolutions and frightening accidents that made the series famous in the 70s. Driver sequels will be disappointed by the Minds Eye production, technically inconsistent and with a poorly cared for structure, capable of emerging from the monotony only in multiplayer and with the help of the appropriate peripheral. So much so that a few years ago we would not have been surprised to see Starsky & Hutch in the arcade, with a specially designed cabinet to make the most of its pure arcade qualities. Pros: Fair in multiplayer Immediate The atmosphere of the show is reproduced well Cons: Technically limitedto Repetitive and unfunny Poor longevity Telefilm is certainly one of the main important cultural phenomena that characterized the 70s and 80s. Series structured into episodes in the name of disengagement such as Hazzard, Chips, Miami Vice, Super Car, set in the most fascinating long distances of America and full of events as exciting as they are improbable, had phenomenal success in America and were exported all over the globe . The renewed interest produced by the continuous Revivals, by the revisionist critics who re-evaluated the Trash and, in videogames, the positive feedback of titles such as Driver and above all GTA, have contributed to keeping the myth alive, with Hazzard which is preparing to appear in cinemas after the debut in the video game. The same fate awaits the Starsky & Hutch reviewed here, another cult series but in Minds Eye's intentions something more than the usual gadget for enthusiasts.", "date": "2003-07-18", "grade": null}