{"name": "Hamtaro: Ham-Ham Heartbreak", "ref": "https://multiplayer.it/recensioni/hamtaro-ham-ham-heartbreak.html", "text": "All this translates into a sort of graphic adventure very similar to the old LucasArts titles (and others), such as Indiana Jones and the Fate of Atlantis, in which thanks to the use of special verbs and various objects it was possible to go progress in the game by solving the situations that arose gradually. However, it is certainly necessary to make the obvious distinctions that derive from a different conception of the genre of the game and from the target to which this title must be fed. You will have a long series of words (86), all in the strange secret language of Hamtaro and company, the Ham - Chat, each corresponding to a specific action with which you can interact with the surrounding environment as well as with the other characters present in the six locations of the game (of which at the beginning it will be possible to visit only two). To complicate things, at the beginning of the game Hamtaro, tripping over a bucket of water, will irreparably ruin the dictionary of Ham  Chat terms, so that all previously learned words (presumably in the prequel, Ham  Hams Unite!) will be deleted, except for some basic ones, and you will have to memorize them again by inserting them in the vocabulary. The new terms are obtained by talking to the other hamster friends, using, to do this, the terms already at one's disposal: the typical ~chain~ structure, according to which previously obtained objects solve puzzles left unsolved. By pressing A near an object or a character with which you can interact, a small menu will appear in which to choose the action to be performed using the right terms in Ham  Chat. By default we will have four words, which will be taught to us at the beginning by the head of the hamster community, and of which the most used will certainly be ~HamHa!~, which corresponds to the greeting and is used to start a normal conversation. Using the other words available, however, our interlocutors could pronounce different sentences, useful for solving the problems that arise as they arise. Very interesting is the fact that, depending on the object with which you interact, the terms displayed in the action menu change, showing only what is actually possible to do in that case, sometimes including even words that have not yet been learn: in which case we will first need to find the hamster who will teach us them in order to continue, which is not said to be so obvious. The main defect of adventures of this type, in fact, lies in the moments in which one proceeds with attempts, often wandering for a long time in search of the object, the character or, in this case, the term that will allow us to unblock the situation and continue. Nonetheless, the need to adapt the game to young audiences who already follow Hamtaro's adventures on television is quite felt, given that the actions available are always quite clear and it practically never happens that one does not know absolutely which word to use for perform a certain action; as if that weren't enough, the objects in the inventory are used automatically when the time comes, making everything focused mainly on communication with the characters and on the right use of the learned words. However, all this does not mean that playing Hamtaro: Ham - Ham Heartbreak can be very pleasant, creating that typical satisfaction that comes from using the right action at the right time which has always been characteristic of similar titles. Then there are also the collateral extras to the actual game, present for example in the form of a ~wardrobe~, with clothes that can be purchased in various colors and put on by the two protagonists (Hamtaro and Bijou), to then take pictures in the special laboratory. Another minigame is the Ham - Jam, which allows you to make the hamsters dance to the rhythm of the tracks available during the adventure. You can change the dance positions and their sequence to create new custom dances, and even swap them with other GBA friends thanks to the Link Cable. All this has almost no use, above all considering that there is no trace of game modes in multiplayer (and, it must be added, it is not even missing, since it would have nothing to do with the genre of which this title is heir), but perhaps to the most ardent fans of the little hamster it may seem like a funny gimmick. On the technical side, nothing to cry out for a miracle: the graphics have few colors and are not very defined, being more at the levels of a Game Boy Color than a GBA. On the other hand, the various souls are of exquisite workmanshiptions and expressions of hamsters, truly worthy of an anime. The music is discreet, accompanies the game appropriately without being too invasive and does not repeat itself excessively, thus resulting quite pleasant to listen to (especially the Ham - Jam tracks). All the elements present in the game contribute to create an enjoyable experience, a title that can be played to the fullest and full of character: an unusual thing for a tie-in. It is also possible to find some unusual goodies, such as a curious imitation of the Master Sword from A Link to the Past which rests in the lower levels of the mines of one of the settings present in the game. Finally, the possibility of playing Ham  Ham Heartbreak in our language is almost taken for granted: first, because the game in question is aimed at very young people, who must be able to understand what is happening on the screen; second, because by now almost all the products of the big N benefit from a localization in Dante's idiom (although in these cases it often has very little Dantesque). The translation defends itself, without infamy and without praise: it can be read quite well and is not so ungrammatical as to make one cry scandal. Comment There isn't much more left to say about this Ham  Ham Heartbreak that hasn't already been said in the body of the review: once you get over the rough graphics, it's a title that rises (although not too much) from the crowd of games for the GBA thanks to the fun it can give. In addition, it makes you want to go on, and this is a skill that, unfortunately, is increasingly scarce lately. Certainly this is not a product on which to rush with your eyes closed: as always, it is advisable first of all to focus on the real masterpieces present on GBA (Metroid Fusion, Zelda: A Link to the Past, Wario Ware, the Mario Advances, to name only the most famous), before considering the purchase of Ham  Ham Heartbreak, which, given its ease, may not be long-lived, despite every moment of the game giving a certain satisfaction. Very suitable, for obvious reasons, for fans of the Hamtaro TV series, highly discouraged instead for the detractors of the ~pacioccosi~ characters. Pros: Contains more than a reference to the classic graphic adventure Fun and stimulating Excellent animations and expressions of the hamsters Right dose of extras to season Cons: Graphic aspect worthy of a Game Boy Color Sometimes you proceed by trial and error, wandering endlessly through a given location looking for clues Rather easy and a bit repetitive As many probably know, ~Hamtaro: little hamsters, big adventures~, is a cartoon with rather ~soft~ tones, aimed at a very young group, which narrates the adventures of the tender Hamtaro hamster, struggling with a community of his own kind . The development of the series of games inspired by the Hamtaro anime was entrusted to Nintendo, which knows a lot about kawaii little creatures, after the success of Pokmon. It was a good choice, which made it possible to obtain titles full of character and quite pleasant to play. After the first Ham - Hams Unite! On Game Boy Color, it's time for a new episode on the latest portable baby from the Kyoto house, while yet another chapter has already been released in Japan. But let's go in order. In Ham  Ham Heartbreak, the simple premise introduces a diabolical hamster, Spat (Birbo in the Italian translation), suitably equipped with a pair of bat wings, a horned headdress and a pitchfork, and which he intends to break with tricks of all sorts of emotional ties present in the quiet community of Hamtaro. It is the task of our protagonist and his friend, Bijou, to try to mend the friendships and loves broken by Spat.", "date": "2003-07-17", "grade": null}