{"name": "Speciale Rpg - Seconda Parte", "ref": "https://multiplayer.it/recensioni/speciale-rpg-seconda-parte.html", "text": "Dragon Empires Technically the game uses a very complex 3d engine that will take advantage of the characteristics of the most modern video cards; the models of the characters will be extremely accurate, every weapon and object, every single piece of armor, will be composed with the polygonal engine, in order to make even the smallest aesthetic modification of your character visible to the player. The landscapes, as far as can be seen up to now, leave you speechless for the beauty and the visual distance that can be reached, think that we are talking about 1 mile and a half; the settings are made up of 9 different types of terrain, each swept by absolutely variable weather events and by the alternation between day and night. Finally, the opponents should be equipped with an advanced artificial intelligence and characterized by behaviors closely related to their race and behavioral nature. So expect creatures adapted to the climatic situation of the territory, nocturnal and diurnal predators, solitary or social monsters, cowards or bold. Dragon Empires is proposed as a decidedly innovative mmorpg, not only from a graphic or technical point of view; the development team has shown exceptional availability in being able to incorporate the suggestions and requests of its audience (many of the game's features come directly from the community that is following it), we just have to wait for mass experimentation to be able to touch what you see on paper. Middle Earth Online As you all know, in the world of role-playing games (and from this point of view, computer games are no exception) the fantasy setting is certainly the most popular. Within the narrative of this genre, a place of honor is reserved for the works of Tolkien, who has been able to build a plausible and very evocative universe through his works. Faced with this phenomenon (especially thanks to the additional ~push~, given by the release of the films inspired by the three novels that make up ~The Lord of the Rings~) the videogame counterparts certainly could not be missing, however among these there was a multiplayer game that took place in a persistent world, i.e. an mmorpg (massive multiplayer online role playing game). After a couple of abandoned attempts by little-known software houses, Turbine Entertainment, which fans know for the appreciated Asheron's Call, has decided to fill this gap, getting to work on developing Middle Earth Online. This mmorpg, which will be produced and distributed by Vivendi (which holds the rights to exploit the three books that make up ~The Lord of the Rings~ and the novel ~The Hobbit~), offers a highly immersive experience within the world created by Tolkien; in this regard, the developers seem to have held these works in great consideration, trying to develop very faithful settings compared to those narrated in the novels. Middle Earth Online Although the development of this game only began a few months ago, the work seems very well advanced. During E3 (the important fair that took place in May in Los Angeles) it was possible to admire a demo of Middle Earth Online, able to show some of the main features. The game is set in a time frame corresponding to the period described in ~The Fellowship of the Ring~. In order to avoid distorting the original plot (and also due to problems of public order, even if it would be more correct to speak of virtual order), it will not be possible to interpret the main characters of Tolken's saga, who will be part of the historical background of the setting , acting as npc (non-player characters) will give birth to several quests. The player will be able to interpret characters belonging to the races of hobbits, humans, dwarves and elves (the introduction of evil races such as orcs is not excluded); the interaction with the environment, according to the developers, will be very detailed, even if directed by a simple and extremely intuitive interface (what do you think, is it a pro-console measure?). In addition to the chosen race, the alignment of the character will be defined above all through the use of objects, in this way a hobbit (notoriously peaceful race) who were to wear cursed armor, would see his alignment change, approaching the spirit of the dark lord Sauron. All this will not only reflect on his conduct, but also on the behavior that the npc will reserve for him; to give some examples, the evil characters will not be able to enter the elven woods and will be treated badly in the laughing and serene Shire, homeland of the Hobbits. In addition topossibility of joining and developing alternative paths to war (for example by opening commercial activities), there will be numerous quests associated with many of the key events of the original saga. To remain faithful to the latter, there will be no possibility to create wizard characters, the only way to take advantage of arcane powers will be the use of magical objects, such as for example the famous Boromir horn, capable of increasing the morale and combat characteristics of their companions. From a technical point of view, the game will be powered by the Turbine Engine 2.0, already used for Asheron's Call 2; thanks to and it, graphically the game is superb, full of details, as well as all those effects supported by recent video cards. During the construction phase, it seems that the developers will take into great consideration the modularity of the game components, each object will be made up of different components; weapons, armor, buildings, etc. everything will be extremely customizable, both in shapes and colors. The Middle Earth Online project was announced a short time ago, despite this a beta version has already been presented to the specialized press, which bodes well for the pace at which development is proceeding; the release of the final version is scheduled for the end of next year. To avoid creating only a momentary phenomenon (as has already happened to other mmorpg), Vivendi Interactive has relied on a team of great experience in this genre of games. Judging by the previous titles developed, and by the continuous attention paid to the community of players, it seems that Turbine Entertainment could be the ideal group to give life to this project which to define as ambitious is at least an understatement. We'll see in the future how well audience expectations for Middle Earth Online will be met. Horizons The year 2003 will undoubtedly be remembered as the spearhead for the development of mmorpgs. It can be difficult to navigate among the dozens and dozens of online RPGs announced and in development for 2003 and beyond, but Horizons will undoubtedly have a prominent place. Just to realize the potential of the game, it is good to highlight that an authoritative US site (ign to be exact) defined Horizons as the best mmorpg presented at the E3 fair. The fact caused some amazement because Horizons basically relegated a sacred monster like Star Wars Galaxies to second place. The development of this game has been one of the most troubled in recent years, in fact the project, carried out by Artifact Entertainment, has been blocked and resumed several times due to lack of funds and difficulties of all kinds. Fortunately, in the last two years, development has come back to life in an energetic and decisive way, the problems have been left behind and Horizons is already in an advanced stage of beta. But what makes Horizons such an attractive product? The reasons are undoubtedly many. Firstly, you can choose from a wide range of different characters, currently four races are complete: humans, demons, dwarves and dragons. Yes, you read that right, we can play a dragon! In addition to these four races, other types of characters are planned, and under construction, such as: elves, dark elves, goblins, orcs, gnomes, giants, etc., etc. You already understand from these lines that the gameplay in Horizons will be decidedly varied, because characters of many different races will be able to interact with each other, some decidedly incompatible with each other. Another fascinating feature is the character development. In Horizons there will not only be fighting characters but we will be able to play a merchant, a healer, a jeweler etc, etc. Of fundamental importance will be the schools, in them the player will be able to learn what he needs to move in the world of Istaria. The schools are not closed to anyone and a character of any class can, for example, enter a school to learn the basic teachings. For example, a warrior can enter the school of healers to learn the basics of this art and vice versa can be a cleric, entering the school of warriors. Furthermore, the schools will not be strictly oriented only to combat disciplines. Even the arts of commerce or the creation of objects will have their schools open to almost everyone (in the game we will be able to build hundreds of thousands of different and personal objects!). This aspect is of fundamental importance and combined with the variety of classes described above, gives an idea of the incredible variety of characters present in the ggame. Perhaps the most captivating aspect of the Artifact mmorpg lies in the possibility of heavily influencing the world of Istaria in various ways. Through our actions we will affect history and through our properties we will influence the structure of the world. In fact, each character will be allowed to own a property by buying a piece of land. By becoming exclusive owners we will be able, for example, to decide to build our house or our shop. In agreement with other players we will be able to build villages, cities, castles and fortresses! Horizons The combat in Horizons promises to be more spectacular than ever. The scenes shown in the trailer highlight a variety of character moves never seen before and this, combined with the fact that we will be able to build our weapons in an ever-changing way and with an almost infinite amount of diversification variables, makes the combat phase satisfying. But that is not all! In almost all of today's mmorpgs, almost no one had ever explored the option of the common enemy for all players! In fact, in general, the combat phase has always been left to the players who challenged each other for various reasons, for example if they belonged to rival guilds, etc., etc. Duels only rarely saw many PCs united against a common enemy and, in these sporadic cases, the common enemy was a single creature (in Everquest, for example, players unite to defeat a dragon or a giant). In Horizons this concept has been expanded further, up to the concept of the common enemy of all PCs. All players of Istaria will be able to see their lives and cities threatened by a common enemy, for example an undead horde from a distant region. In this case the players will have to team up with each other to save the world from this threat!. In conclusion, Horizons promises to be a decidedly innovative game in the mmorpg scene. There is not a single feature that makes it attractive, but a set of many positive and partly innovative aspects guarantee the title considerable longevity. Finally, to all this it must be added that the hardware requirements to play are not sensationally high and therefore do not require excessive spending on upgrades. Finally, a curiosity: the game, unlike other titles, will be distributed in many countries, including in Europe; the management of the European servers has been entrusted to the Italian company Digital Bros. Dragon Empires In recent years, one of the most frequent complaints from players is the lack of originality, think about it, how long has it been since we have seen a new genre appear on the market? Lack of imagination? Creative crisis? It may be, the fact is that one of the few relevant innovations in recent times has been the one that has invested our favorite genre, that of crpg (acronym for Computer Role Playing Game, or role-playing games for computers). We are talking about mmorpg, an acronym that indicates multiplayer crpg that are played on persistent worlds, i.e. systems that are perennially active 24 hours a day, within which players are led to develop their own virtual alter ego by interacting with each other others. For some time now, however, players have begun to ask for more from mmorpgs, they have realized the intrinsic technical limitations of systems such as Ultima Online or Dark Age of Camelot. And it is precisely in response to this growing demand that the game we are about to talk about, Dragon Empires, was born. Developed and distributed by Codemasters, the game saw the light in mid-2001 and is now preparing to begin a delicate testing phase. It all takes place in the land of Fortitude, a world divided into five great kingdoms, each protected by a dragon. For reasons still unknown to us, following a war, dragons were transformed into animals, fish, birds, monkeys, insects and women, leaving men in total control of the territory and its resources. Dragon Empires may appear similar to other games of this genre, except from a technical point of view and from that of the game scheme, it introduces some really interesting features. Let's start with one of the most important aspects, the interaction between players and life on game servers. Unlike other titles, the developers wanted to give an impression decidedly aimed at team play; this does not only concern the fighting, but everything that constitutes the life of a community, such as the economy for example. The world of Dragon Empires, in fact, is made up of about fifty cities, each of these can be governed directly", "date": "2003-07-14", "grade": null}