{"name": "Recensione di Harbinger", "ref": "https://multiplayer.it/recensioni/recensione-di-harbinger.html", "text": "The origins As already mentioned, Harbinger is a game with a futuristic setting, to be precise almost all of the plot takes place on board a spaceship. But forget the classic Star Trek ships or the gigantic Super Star Destroyers of Star Wars, the Harbinger is a vessel of immense dimensions, comparable to those of a planet, a small world adrift in space apparently without a purpose. Ruling its movements and the plots that unfold in its bowels is the Overlord, a dark and mysterious character who knows everything and sees everything. Already from this introduction you can easily understand how oppressive and mysterious the atmosphere can be; in fact, you must know that hundreds of races belonging to the most remote corners of the galaxy live inside this spaceship, peoples torn from their own worlds who have organized themselves into groups to survive in this extremely inhospitable environment. Our character belongs to one of these, a small world (very small judging by the number of non-playing characters with whom we will be able to interact) that lives in a corner forgotten by everything and everyone, a world that tries in every way to survive events greater than him and that will see us engaged in his defense. Among the many alien races present on the Harbinger, those of particular interest are actually only four. First of all there is the human race, omnipresent as in all video games; humans are gathered in a small community led by a certain Solomon Torvus, in reality it is a rather varied group as there are also some aliens. Then there is the race of the Vantir, who represent a sort of police force under the command of the Overlord; numerous and well armed, the members of this group are warriors born and modified through cybernetic devices (or even real robots). Opposing this faction are the Scintilla; it is a very complex alien race with different mental and physical powers. In the past they opposed the Overlord but were soon subdued, since then they have performed an indispensable control function on the portals that connect the various areas of the spaceship. The last race with which we will have to deal is that of the Cimicidae, species of insects (vaguely reminiscent of the aliens of the famous film saga) thirsty for blood and always engaged in strange organ trafficking. You may be wondering what role our character has within this minestrone of races, I'll be honest, initially our darling does not have a specific purpose, he limits himself to earning a living within the community by carrying out various jobs. Based on the choice of the character, little by little you find yourself immersed in this strange world made up of feuds between the dominant races, bloodshed, summary justice, in the constant search for the necessary peace to allow your group to live peacefully. The atmosphere that you breathe is tense, everything contributes to increase this feeling: the textures that cover the walls of the levels, the models for the characters, the music, etc... Initially you feel helpless in the face of the dark plots that develop within Harbinger, one feels extraneous to all this, the unfolding of the quests however forces one to become part of it, to become protagonists by putting one's nose into business that it would be better to ignore. The dialogues are multiple choice, and the answers given by the player do not influence the path to follow, much less the behavior of the non-player characters towards us. Initially it almost seems that they can give life to bifurcations in the plot, but after a while the spell is broken, and we realize how substantially linear the game is. Let's fight! The game, as it was easy to assume, begins with the choice of the character to use among the three available: human, Gladiator and Culibine. The first is a human fighter (endangered breed on the Harbinger), in the past imprisoned by the Overlord due to an attempted theft of weapons. It is characterized by good agility and movement speed which guarantee it a good chance of dodging enemy attacks. Equipped with an armor made up of a breastplate and helmet, the human has good defensive skills, while from an offensive point of view he can rely on a firearm and its bayonet. Furthermore, he has the possibility of using mines of various kinds (proximity, remote control, EMP, etc etc ...), which guarantee him a good advantage in the event of a distance clash with opponents. The Gladiator is a cybernetic organism in the past a member of the Overlord's army and then abandonedato. In the game it represents the classic ~thumper~, it has an excellent defensive capacity due to its robust armor, and a set of weapons similar to those of humans but decidedly more devastating. Instead of one arm, he mounted a rifle capable of emitting projectiles of various kinds (plasma, emp, electric, etc etc), while instead of the other he mounted a sort of machete, a weapon suitable for close combat. It also has the ability to remotely control a series of small cameras with offensive or reconnaissance functions. The problem with their use lies in the fact that while this is happening, our character remains totally at the mercy of the opponents, therefore practically vulnerable to any attack. The last character available is that of the Culibine. He belongs to an alien race endowed with various powers, among which there is the possibility of generating energy projectiles (similar to those fired by the other two characters' rifles), and the emission of a force field (also of various types , plasma, emp, electric, etc etc) that radiates from the character himself. In addition to these two weapons, the Culibine is able to control some particular spheres capable of injuring nearby opponents, or of parrying their blows. All in all, although the defensive capabilities of the latter character is objectively ridiculous compared to the robot or the human, the Culibine has turned out to be the character not only more versatile but also more devastating, above all thanks to her ability to annihilate entire groups of opponents in one fell swoop. This is precisely one of the first aspects in which Harbinger proves to be deficient. Don't get me wrong, I don't mean that the fights are overly trivial or extremely difficult, the game simply puts the player in a position to always use only two techniques, and this can easily give rise to boredom, pure and simple boredom. On the one hand there is the aforementioned Culibine, able both to liquidate the most difficult opponent with a couple of blows, and to regenerate the most serious wounds in a relatively short time; on the other there are the other two characters, forced to always use the usual shoot-and-run technique, moving away from their opponents just enough to massacre them with plasma. Another sore point is that of weapons, if it is true that there are really many of them and they can be customized using various chips and modifiers, it must also be said that in essence the player does nothing but simply select the most powerful one; although there is the possibility of using a good number of offensive agents (plasma, electricity, disruptors, electromagnetic pulses, toxins, corrosive agents, drugs and physical damage), you are limited to using a couple of them at most, if not only the plasma . In practice, the slightest tactical factor is absent. As if that weren't enough, the sources of supply of weapons are limited to one of the three NPCs present at their base, an alien named Ona, who almost always has weapons inferior to those that can be collected in the game levels; as if that weren't enough, his wares are always easily purchasable, given the absolutely disproportionate number of credits that can be accumulated. The size of the inventory varies according to the build of the character, its structure instead is the classic one in squares; I don't know about you, but I'm starting to have my ~pockets~ full of these squares, every time the inventory starts to fill up with interesting objects, you end up playing tetris to be able to fit everything perfectly... The evolution of your character represents another of Harbinger's weak links, once you have collected the experience necessary to level up, you can only increase four attributes; three of these represent the skill in each of the three weapons our alter ego is equipped with, the fourth represents his hit points. Frankly, I can only be disappointed by a choice of this type, Diablo 2 had an extremely higher number of variables, and for those who don't remember, we're talking about a game released three years ago, shortly after Harbinger's development began. Opponents and levels. Given the nature of this game and its belonging to the action genre, the opponents and the structure of the levels acquire far from secondary importance. Fortunately in these respects Harbinger defends himself much better than he does with the characters and the upgrades of the same. The opponents are limited to a few races and some animal organisms that appear only in some levels; each of these has some different types, characterized by aown fighting style and gives a different resistance to our blows. In general we can distinguish between opponents capable of carrying out close attacks or from a distance. If the former are practically useless (with any of the three characters killing them is child's play), the latter give a fair amount of trouble, being endowed with good offensive potential and excellent aim, think that sometimes it almost seems that are able to anticipate the player's movements, forcing him to constantly change direction unexpectedly. The levels are all in all well designed, neither too long nor too short; each is connected to the others through special channels (which vaguely recall the teleporters of the film ~The Fly~) which can be activated only if in possession of the relative code. To complete a quest it is sometimes necessary to go through more than one level, fortunately to return to the base you can use these teleporters to avoid having to retrace our steps. Exploring the game levels it is possible to come across containers of various kinds, once opened these will release objects generated in a totally random way, so much so that often they are not even suitable for your character. It is also possible to find on your way structures that can help or not our path, such as radiation generators (which favor the regeneration of energy), boilers or energy absorption points (decidedly harmful to our health). Technically From a technical point of view it certainly cannot be said that Harbinger is close to perfection. Although the game is anything but expensive in terms of hardware resources, there is a certain repetitiveness in the colors and elements that make up the levels. In all, the texture sets can be counted on the fingers of one hand, and as if that weren't enough, to further increase the feeling of graphic monotony, the opponents' models take care of it. As already mentioned, they are not few, but the excessive similarity between some of them, and the fact that one gets to be attacked at the same time by a couple of different types at most, generates a further feeling of ~already seen~.  The animations have a sufficiently high number of frames, therefore the models are always represented with a good fluidity of movement; as far as the main character is concerned, it should be noted that his appearance changes according to the weapons adopted. The controls are extremely simple as the game uses a point and click interface. The left mouse button is used to move, alternatively it can be used to fire the primary weapon, the right button activates the secondary weapon, while the space restores the character's energy by consuming the medkits (always extremely abundant) . The graphic effects are limited to particle explosions and the light trails of the shots that make their way in the dark, rest your soul in peace you will not even remotely see the latest features of your flaming Radeon or GeForce exploited. Like other aspects of the game, audio also exhibits highs and lows; the sound effects increase the feeling of boredom, round and round it is two or three sounds repeated an infinite number of times, the speech instead is convincing and well done, even if present only on a few occasions. The music is perhaps one of Harbinger's most successful aspects, objectively it doesn't shine for the variety of the pieces, but it helps enormously to maintain that tense and mysterious atmosphere that pervades all the events of the plot. The initial interface with which the game is presented is essential and very functional, there are not many controls to configure, ditto for the options. As already mentioned, Harbinger does not need a ninja computer to run smoothly, I tested everything on an AMD Athlon Xp 2000+, equipped with 512 MB of RAM and a 128 MB Ati Radeon 9500PRO video card, with this configuration obviously the game did not show the slightest indecision at the resolution of 1024x768 pixels (the maximum achievable); all in all I would say that to play decently you need a 1 GHz processor, 128 MB of RAM, a video card with at least 32 MB of RAM (GeForce 2 MX or higher), and just over 500 MB of hard disk space. As far as audio is concerned, the game supports various protocols, such as EAX Creative, DirectSound3D and Dolby Surround, therefore having a quadraphonic or higher speaker system can only increase the level of involvement. Concluding Defining Harbinger a masterpiece of its kind (remember once again that it is an action crpg, therefore do not venture comparisons with Planescape Torment or Baldur's Gate &C) would be an exaggerated and far from truthful statement.", "date": "2003-07-11", "grade": null}