{"name": "Midnight Club 2", "ref": "https://multiplayer.it/recensioni/midnight-club-4.html", "text": "Welcome to the club But the matter certainly does not end here, since by undertaking the career mode (I want to surprise you: the heart of the title) we will enter the good graces of a wealthy boss who will have no qualms about giving us new cars and features, such as the turbo and other amenities, to put it a little salt in competitions. Clearly the price to pay will consist in overcoming increasingly arduous - and strictly abusive - challenges on the streets of three famous digital megalopolises reconstructed with great detail. Decide at your leisure the equivalent of such an enlightening experience: from the bombastic tamarra fiction of Fast & Furious, to the ferocious illegal races on the Roman ring road. The choice remains up to you, know that in any case you will save on the doctor, the workshop and the licence. Power of the gaming media But let's go back to the brilliant career of our likeable alter ego. Since the races will systematically take place under the banner of traffic violations, do not expect delimited or at least dedicated routes! Instead, get ready to run like crazy in the middle of normal city traffic, completely unaware of what is happening around you. If you hadn't understood, we are faced with an absolutely non-linear racing, where the player is fully free to take the path he wants, as long as he fulfills his duty to reach certain checkpoints with the help of a real-time map that will report the location. No fear of losing the right path, the fateful milestones rise menacingly on the horizon in the form of shiny cylinders of light model Independence Day, thus resulting clearly visible. A bizarre gimmick, but functional. Do you really want to hurt me? MC2 sports a rather gratuitous amount of violence, though never serious. In fact, let's not forget that we are talking about a Rockstar title, where provocation, humor and ultra-violence are now distinctive ingredients. On the other hand, it is no coincidence that on more than one occasion the product recalls the much better known Grand Theft Auto III/Vice City, the saga with which the software house has established itself on the general public. In MC2 the focus is mainly placed on driving, but it is also possible to mow passers-by, as well as carry out a considerable work of destruction to the detriment of the cars and surrounding objects, such as lighting poles or fences. pacifists will be more interested in seeing how a targeted interaction with the scenario leads to the discovery of shortcuts and passages to gain precious seconds on the opponents. Over time, knowledge of the various roads will become the real key to success in the various competitions. The title is appreciated for its rapid accessibility, which instantly pulverizes any simulation ambitions in favor of typically arcade fun. The physics of the cars is highly improbable, as is the exaggerated sensitivity of the steering, which not only frustrates, but even makes the use of the brakes harmful. Given the nature of the title, it is not at all surprising for such choices: the extreme elementary nature of the guide favors the most insane actions, such as darting against traffic or throwing yourself on suspended bridges. For their part, the computerized opponents show off a not indifferent combativeness, able to stimulate the player for a long time. In this regard, it is necessary to point out the full compatibility of the title with the Live service, which allows exciting online challenges, as well as a disproportionate extension of longevity. All this clearly for those who can enjoy it. Running through the streets of Babylon Technically MC2 marks time, albeit without fatal falls in style. The graphics engine certainly doesn't make you cry out for a miracle, but it honestly does its job, taking care to convey the frenzy of the action to the player, rather than photorealistic textures or wagonloads of polygons. The effect is mainly conferred by a framerate firmly anchored to 60fps, albeit obtained with various tricks, such as the choice of setting the races in nocturnal contexts (or in the early morning) whose limited visual rendering is functional to the coverage of sporadic clipping phenomena . Remarkable is the speed of scrolling, almost excessive in certain situations, and the care lavished in the creation of the metropolis, decidedly vast and always full of traffic. Despite this, the most fussy will not be able to hold back a certain disappointment: there is no doubt that Xbox has accustomed us to much higher technical standards than this, but it is equally trueor that we are talking about a port of the PS2 version, a factor that considerably undermines the peculiar exploitation of the Microsoft console. On balance, the work obtained by the programmers is not contemptible. The audio only emphasizes the racing with the help of hip-hop and techno sounds, but is almost always subdued compared to the frenzy of the action. The impossibility of loading a personalized soundtrack from the console's HD does not help in this sense, it is a convenient feature and much appreciated by users ... Why not use it? Conclusions MC2 is a good alternative racing, a title capable of representing a pleasant pastime while waiting for more important course products. There are no big slip-ups: technically passable, but nothing more, fun to play and considerably long-lasting thanks to a well-implemented career mode, without excluding the undeniable added value of Live. Personally I can only recommend trying it before buying, it is a kind of product that may not be appreciated by everyone. But for those who consider themselves inclined to Rockstar's nocturnal raids, they will find something to amuse themselves for a long time, perhaps fantasizing about a Vice City at 60fps Pros: Fast Stably anchored at 60fps Live support Cons: Certainly does not squeeze the Xbox hardware Audio subdued Racing atypical, not for everyone. The night is used to write novels, sang the Bluvertigos. More reasonably, it's used for sleeping, but go tell that to the frantic protagonist of Midnight Club 2! We could describe this curious specimen as the typical ~lead foot~, due to the fact that when he gets into the car, he pulls like hell. What better way to assuage the anxieties of this tormented soul than with a series of ferocious and illegal night speed races? Logically, a series of encounters with extravagant characters awaits us, people who believe it is good and right to spend their best years in researching the definitive tuning for their car, beautiful things", "date": "2003-07-11", "grade": null}