{"name": "The Darkside Detective: A Fumble in the Dark", "ref": "https://multiplayer.it/recensioni/the-darkside-detective-a-fumble-in-the-dark-recensione.html", "text": "Four years after its debut, The Darkside Detective returns with a new chapter dedicated to the mysteries of Twin Lakes. As we had already anticipated in Top 5 Indie, the month of April puts us back in the shoes of detective McQueen once again grappling with the Darkside and the paranormal. PS4, PS5, Xbox One and Series X/S, Nintendo Switch and PC on April 15th will once again open the doors to the strange cases of this ramshackle town and we are ready to offer you our judgment on the game in The Darkside Detective PC review: A fumble in the dark. Back to the Darkside The Darkside Detective: A Fumble in the Dark: A mysterious castle. Officer Dooley is missing, but as everyone knows, disappearances in Twin Lakes are never a situation to be taken lightly. Paranormal cases are making a comeback, but before he can get down to business, McQueen has to find his officer. Thus begins The Darkside Detective: A Fumble in the Dark. A little Strangers Things, a little Monkey Island, the sensations that Spooky Doorway's work is able to offer have also remained intact in this second chapter, or perhaps it would be better to say in this second season. Yes, because the point and click adventure setting is clearly predominant, but that light feeling of being in front of a product that winks at serial productions remains in the background. And this is precisely the strong point of the work, the progress of the adventure is not only marked by the sequence of cases to be solved (there are six available), but also by a perfect construction of the events which recalls that of the episodes of a any TV series with horizontal development of the narrative. Clowns, wrestling, television studios: every place you visit is permeated not only by mystery, but also by this subtle and surreal irreverent humor that was typical of Monkey Island and which, without aping it, had been difficult to find in other works. The Darkside Detective: A Fumble in the Dark: McQueen and Dooley. As for the technical details of the playful ecosystem, The Darkside Detective: A Fumble in the Dark is a fairly classic point-and-click adventure, in which the player can navigate from room to room within the environments, interact with some objects and people but cannot move the protagonist freely. Interaction with people will guarantee pre-established dialogues, while interaction with objects is divided between active objects and passive objects. The first are those elements on the screen that will have a sparkle and that will be used to continue the story, they are often objects to be collected and will be useful to the player. Passive objects, on the other hand, are all those fixed elements in the scenarios which, if clicked with the cursor, will lead to an analysis of the same and therefore to a series of useful information for understanding the management of the puzzles. Once an object has been collected, it can be combined in the inventory with other objects or dragged onto an element of the scenario to use it (for example a key with a door, etc.). It is also possible to use certain objects with McQueen if you want to wear that object, in this case just drag it onto the protagonist. Therefore, there is not the classic choice for each object: use / take, examine, talk / eat, but the interaction in the scenarios is very well thought out and designed to make the player understand every single puzzle. Even when you feel stuck there will always be an object able to suggest the next move in an intelligent way. Between artistic aspect and location The Darkside Detective: A Fumble in the Dark: A scene while solving a case. If from the point of view of irony and of the structure of the adventure the title of Spooky Doorway has proved to be original but still respectful of some pillars of the genre, from the point of view of art and of the sound sector, the title shows a decidedly strong and in line with what we saw in the first season. The pixel art of The Darkside Detective: A Fumble in the Dark is not something that goes out of the ordinary, but it is used wisely, in a way that characterizes the environments. Even the smallest elements, which we know are difficult artistic level management in pixel art products (it is in fact a style that guarantees the greatest effects on the macro rather than the micro) have a structure designed specifically to be able to provide the right details. The most striking example are the posters inside the recording studios in the first case to be solved, able to offer you the right information with very few details. Also in terms of sound, the title expresses a decidedly strong and original character. The sounds and music drawsNot many works like Stranger Things (even the Darkside if you want is a pantomime of the Upside Down from the Netflix opera) but also Twin Peaks itself. Therefore, at 360 degrees, the paranormal offered by the game is something extremely valid also on an artistic level. The Darkside Detective: A Fumble in the Dark: McQueen in one of many locations. However, we come to two thorny points to discuss at the end of the analysis: longevity and location. The first point is if we want the real and only drawback of the work. The Darkside Detective: A Fumble in the Dark only has (for now) six new cases to solve. The six cases carry on the adventure in an excellent way and each one has a different duration, but in total in about 6-7 hours if you don't get too tangled in the puzzles, you will be able to bring everything to a conclusion. Too little, not so much for the work itself, but because given the success of the first chapter, something more was expected. The six chapters are very entertaining, well structured and without excessive superfluous times in the narrative, yet two or three hours more would not have hurt, given that especially the more accustomed players to the genre will not find it difficult to solve the puzzles. The Darkside Detective: A Fumble in the Dark: The wrestler scene Finally, the thorny issue of localization in Italian, which is not present here. Although the request for Italian translation to developers in the two-year period 2019-2020 has dropped, bringing Italy to eighth place in the ranking of localization requests (LocalizeDirect data), it is important that some games provide for it. The Darkside Detective: A Fumble in the Dark is a multifaceted narrative title, which won us over thanks to its irony and solid plot structure, which is why we would have liked this adventure to be made 100% enjoyable for everyone at the within the market in which it is sold.", "date": "2021-04-13", "grade": "8.0"}