{"name": "Lost Planet: Extreme Condition - Recensione", "ref": "https://multiplayer.it/recensioni/lost-planet-extreme-condition-recensione.html", "text": "The gameplay is that of an action shooter, in which the protagonist can jump, shoot 360, rotating his torso in all directions, and use a grappling hook to hook onto walls and crates E.D.N. III The most important element is the thermal energy that is released by destroyed objects and dying Akrid, which recharges the hit points until it runs out, finally making us mortal. Lost Planet is certainly not difficult, so much so that on a normal level it is possible to go through all 11 levels in less than 8 hours, which are very few, if we consider that playing on a difficult level adds nothing to the experience, if not a goal and a bit of frustration, given by the animation that sends the player flying to the ground after each assault. It takes several seconds to get back on track, seconds in which you continue to be vulnerable to enemy attacks, often in a chain of damage that leads to death without anything being able to be done to remedy it. A possible cooperative mode like in Gears of War or Rainbow Six Vegas, for example, would have helped, but there is no sign of it. Each stage is divided into a series of checkpoints, even quite distant from each other, but Capcom has adopted a not very happy choice to manage its progression, given that, in fact, it is not necessary to stop and kill any of the enemies that they meet on the street, but just reach the point where you exit the map to activate the next cut scene and save yourself. The most striking example is that of those immense caterpillars, which you will surely have seen in recent months and which inhabit an immense expanse of snow. It is possible to cross the entire plain without even turning to look at them, and without losing an ounce of energy. The incentive of power ups or bonus items to be recovered from the corpses of these giants would have been enough to transform that subtle annoyance that causes them to get in our way, into real devastating anger. It's a shame because too often, when you're in trouble, the instinct to flee to get to the next phase (almost) unharmed prevails. January is an unusual month to release a high-profile product like Lost Planet: Extreme Condition on the market, but between the fascinating setting and the tiredness of the release lists, in the end, it is a nice surprise and with excellent timing . Capcom's adventure with Xbox 360 began cautiously, with the announcement of that Dead Rising which over the months has become an increasingly substantial project, until it has achieved success beyond all expectations all over the world. The same seems to happen with this new work, born from the mind of Kenji Inafune, former manager of Onimusha, with news of millionaire sales within a few days between the USA and Europe. At the end of the eleven levels, which house the adventures of Wayne and the snow pirates, the reason for so much consensus is evident. The regret remains for some game design choices that could have made Lost Planet the direct descendant of some classics of the great Capcom history. Bosses, VS and Commands. Two of the distinctive elements of Lost Planet are, of course, the VS and the end-of-level bosses. The former are mechs that Wayne can take control of and which allow him to deal more easily with the most intricate situations. There are different types, each with peculiar characteristics and powers and they are all made with an eye to proportions, dynamics of movement and interaction with the environment (rich in interactive and perishable elements). The feeling you get to drive them is truly priceless, especially in the presence of the Bosses who mark the end of each stage, truly perfect, and who finally put the player to the test by asking him to read each setting in search of the right tactic or sequence of actions. 'attack with great satisfaction every time you manage to get the upper hand. Even the great creativity that gave birth to the VS, however, is undermined by a choice linked, this time, to the controls. Each mech can mount two different weapons, one on the right and one on the left. The interesting thing is that you can change these weapons, both while wearing the VS, picking them up from the ground, and when you're on foot, approaching, and manually disassembling them and carrying them with you. The problem is that the button to remove the weapons is the same one that must be pressed to get on the mech and it is not uncommon that in the most agitated moments one finds oneself aboard an unarmed VS because by mistake the button was previously pressed while standing on the side, rather than from the sides where you climb. It's a matter of millimeters and in the excitement of a fight, especially at the higher difficulty level or in online matches, it can cause some hiccupsunwanted and inappropriate. 16 Against! To be a console game of Japanese origin, great attention has been paid to online multiplayer, starting with the demo distributed on Market Place with good public success. The maps, eight for now, are really vast and allow you to make full use of the mechs and the grappling hook, which in the single player remains a bit overshadowed especially in the more restricted areas of the game. The four modes are quite canonical, since they range from single and team Deathmatch, to the capture and maintenance of some locations on the map, up to the one called The Fugitive, which is basically a One against All. The limits that undermine the single player campaign are also felt online, especially that of downtime after damage suffered, plus a somewhat anomalous balancing of certain weapons 16 Against! The limits that undermine the single player campaign are also felt on the net, especially that of downtime after damage suffered, plus a somewhat anomalous balancing of certain weapons and with combat scenes in which a soldier manages to resist for too long at the feet of a huge VS who vomits tons of ammunition on him. Therefore, LP does not set any new standard in terms of online gaming, but introduces an unprecedented variety and personality, together with some gimmicks, such as the day/night cycle on some maps (accentuated by the absence of night vision goggles), the underwater areas, completely absent in the single and well-made campaign, and the randomness of some climatic factors such as snowstorms, which suddenly invest the playing field, greatly limiting visibility and increasing the uncertainty of situations exponentially. Note, among other things, that the servers are full of players from all over the world, enough to fill 16-player lobbies in no time with very little waiting. Nextgen glaciers. Lost Planet, to field what is among the best 360 tests after Gears of War, uses an evident evolution of the Dead Rising engine, recognizable thanks to the excellent quality of the textures that cover the characters, Akrid and backdrops. The coders, however, have added a good number of light effects that really make for a splendid atmosphere, especially in the beautiful cut scenes that mark the evolution of the story, thanks also to excellent animations. Akrid, it bears repeating, are very impressive, especially when you are faced with 4 or 5 of their most massive species, all on the screen Nextgen glaciers. The Akrid, it bears repeating, are truly impressive, especially when you find yourself in the presence of 4 or 5 of their most massive species, all on the screen, while the engine limits itself to sobbing every now and then and in the most agitated moments. Capcom has really done an excellent job and is confirmed among the healthiest Japanese companies ready to face this next generation properly and, above all, with the desire not to limit itself to offering only sequels to established brands. Without forgetting the audio sector which, although standard in terms of sound effects, offers some audio tracks of sure impact, as well as a good dubbing in English. Recalling that, at least, the sub-titles are all in Italian. Goals 360 Lost Planet's 1000 points are divided into 35 objectives, some of which are quite substantial as a reward. Finishing the campaign awards 175 points, plus a hundred that can be accumulated by defeating two particular monsters. The rest is given by the discovery of the medals scattered in the levels, by the achievement of some objectives in the network matches and by finishing the game on the most challenging difficulty level. To obtain a consistent score, therefore, it takes some time and perseverance. Comment Lost Planet: Extreme Conditions is a nod to the most savvy players who will sigh as they remember the good old days of Capcom masterpieces such as Bionic Commando. The younger ones, on the other hand, will only be able to diligently pick their jaw off the ground, after the clashes with the first, gigantic bosses, with the camera rotating madly to try to capture every detail of this visual gem. Everyone will probably be left with the feeling of having arrived one step away from the paradise of memorable games with a title that lacks any cooperative mode, and that stumbles over some fundamental game mechanics for an action shooter of this level. The multiplayer, spectacular, but a little too chaotic, is fun, and serves to give substance to a game that at a normal level can be completed in less than 8 hours. Lost Planet, apparently, has everything it takes to become a classic, with the pad in hand, a little of this magic can begreen, but it's still a good title to start 2007 with and the first episode of a saga with great potential. Pros: Fascinating setting Stunning graphics End of level bosses Cons: Too short Some questionable choices No co-op E.D.N. III Wayne is an army soldier guarding the colonists of E.D.N. III, planet covered by eternal snow and inhabited by an alien race, the Akrid, monstrously aggressive. His father dies in the clash with one of the most impressive creatures ever seen in a video game and all of Lost Planet is articulated around the struggle for survival of the protagonist, and some friends, in an attempt to understand what the past and the future are of the planet and the plots of NEVEC, a multinational company that wants to melt the snow to make the climate habitable. The settings of LP are really accurate, the design of the enemies, all of them, is really detailed and boasts some details that recall the wonders of Gears of War. The gameplay is that of an action shooter, in which the protagonist can jump, shoot 360, rotating his torso in all directions, and use a grappling hook to hook onto walls and crates to climb vertical walls or more simply to take cover from on-screen enemies. The use of this item, unfortunately, is very limited in the game economy, especially in the single player, and one gets the feeling that the potential is just scratched, also due to the choice not to allow the player to use it during a jump but only by standing firmly on the ground.", "date": "2007-01-19", "grade": null}