{"name": "Morrowind: Bloodmoon", "ref": "https://multiplayer.it/recensioni/morrowind-bloodmoon.html", "text": "A second anomalous expansion Raise your hand if you've never heard of Morrowind. It has been a year since Bethesda produced the third installment of its glorious series: The Elder Scrolls for PC and Xbox. It goes without denying that Morrowind, for the RPG player community, has been a real pillar, a game to have, play and appreciate for its multitude of qualities. Now exactly one year after the release of Morrowind, Bethesda has decided to offer fans of the original title the second official expansion: ~The Elder Scroll III: Bloodmoon~. In addition to adding a huge new area, Bloodmoon will bring the version of the game to 1.5.1629, which includes all the innovations added in the previous expansion, Tribunal, which therefore will be present in the game even without the latter being installed. A second anomalous expansion To start Bloodmoon, I decided to play using the inevitable translation of Morrowind made by the ITP: Morrowind ITP  Final Version.esp. With this configuration I had no problems whatsoever, indeed the localization module of the ITP adapted perfectly in Bloodmoon, presenting translated everything that is typical of Morrowind: interface, descriptions of objects, dialogues and so on, leaving in English only the dialogues and the names of the objects and places added in this second expansion, in a synergy that made me pleasantly surprised. Alien in a foreign land The expansion takes place exclusively on a gigantic new island called Solstheim, northwest of the island of Morrowind, easily accessible at any time from a port in a popular coastal town of Morrowind. Obviously, being designed as an expansion for players of a certain level, I strongly advise you to access it only with an already strong character, with a lot of energy points and able to hit very hard. Once you arrive, your first sign of civilization will be Fort Frostmoth, an Imperial legion outpost in the frozen and inhospitable land of Solstheim. From here your new adventures will start in three different narrative strands, not to mention the dozens of occasional quests that will come your way. The main quest (main quest) will wind along all the places of Solstheim, taking you along an exciting narrative path to learn about the religion, customs and traditions of the people of the north, as well as meeting your destiny narrated in an ancient prophecy of the moon red. Alien in a foreign land The quests are very well structured, starting in a fairly classic way they will surprise you with twists and continuous reversals of situations. One of the most recurring narrative threads in Bloodmoon is that of werewolves (werevolves), the true leitmotif of the expansion to which we owe the title and the wonderful red moon that will stand out above you on clear nights. Bethesda is giving you the ability to become a werewolf yourself, with all that that will mean for you. Becoming a werewolf in fact depends on the infection of a virus which, caught during the fight with a werewolf, involves the gradual but inexorable transformation into a beast. A new land full of opportunities Speaking of setting, you may like it or not, personally I love Nordic settings like Icewind Dale and I found Bloodmoon amazing for how the island of Solstheim was designed. You go seamlessly from frozen wastelands to deep snowy forests, from inaccessible white and dangerous peaks to banks of pure ice. Walking on a frozen lake you can hear the thin layer of ice beneath you crunch ominously, you will slip if you climb an iceberg, you will be absolutely blinded by the blizzards that will rage around you. The fauna will be decidedly numerous and vicious. It will seem that every square inch of Solstheim is filled with fierce enemies. You can literally say that you will have to sweat every meter of the way and as you progress in the game, the entire island will be littered with the corpses you leave behind. You will have to deal with wolves, bears, spriggans (a kind of anthropomorphic creature of the woods) as well as with mercenaries, bersekers and so on. From the point of view of the variety of opponents, there is certainly nothing to complain about.Everything OK? If it hadn't been understood yet, I greatly appreciated Bloodmoon, but alas it is not free from defects that could even undermine its playability. Let's start with the quests, some triggers in their structure do not fire, preventing you from moving forward. Emblematic is the case of a quest that asks you to free a missionary, after having found and freed her the trigger does not go off that will allow you to conclude the adventure positively. From a graphic point of view, we are faced with a setting designed with absolute mastery and with an enchanting beauty, sometimes ruined by a slowdown of the graphics engine for loading the areas, which sometimes lasts whole seconds. Slowdowns that sometimes become blocks and some system crashes have meant that the official forum of the game is filled with complaints, which have been promptly implemented by Bethesda, which is working on a patch that will fix all these problems. Until the patch is released, our advice is to remember to save very, very often. In conclusion I admit it, I started Bloodmoon with some sufficiency, I didn't expect much from the proposed quests or from the new setting. How wrong I was! Bloodmoon enriches Morrowind with a wonderful new island and a significant number of interesting quests, as well as a stimulating and exciting narrative vein. I had a lot of fun playing it and my more than positive opinion allowed me to overlook the listed defects, which demonstrates how much the positive aspects are decidedly greater than the negative ones. An expansion that cannot be missing on the shelf of every fan of The Elder Scrolls saga; for everyone else, Bloodmoon could be the excuse worth buying the original game. Pros: The setting is superb, the quests are interesting and challenging. So many possibilities will present themselves in front of you, like becoming a werewolf. Morrowind gameplay at its nth degree. The graphics are the same, even if this could become a defect in the long run. Cons: The sound is the same as in Morrowind, in Bloodmoon it was imperative to add at least a couple more musical themes. The usual rush to release the game has played some bad jokes, but it is known that Bethesda takes little time to make the corrective patches. memory management issues are now unacceptable a year after the release of the original. After all this time Morrowind's engine should run smooth as butter, but it stalls every now and then. Silence and Ice I look at the immense frozen land that extends below me, walking is difficult, let alone running. The menacing crunch of the ice suggests that there must have been water down here, I just hope I don't find myself battling a crack in the surface as well! Yes, to fight, since I landed in Solstheim I have done nothing else, this inhospitable land: wolves, bears, spriggans and whatnot have barred my way, not to mention the other horrors I dare not even utter. But despite this, Solstheim is a land you can't help but love; the landscape, the people, here I have found a name, a reputation, a place to call home, I don't think I will be leaving this island any time soon and if I do, it will be with deep regret and sadness. A distant howl, not a normal howl, by now I'm learning to recognize it, they're coming, they're coming to get me, well I'm ready, it's time to finish this story!", "date": "2003-06-26", "grade": null}