{"name": "X-Men 2: Wolverine's Revenge", "ref": "https://multiplayer.it/recensioni/x-men-2-wolverines-revenge_a.html", "text": "Action or stealth? There is no doubt that X-Men 2: Wolverine's Revenge is an action game, but the developers have decided on a much more ~reflective~ approach than one might have expected. A decision that brings something good and something less good, as usual. In fact, the idea of creating a digital counterpart of Wolverine that is as credible and faithful to the comic book character is excellent (a little different from that of the films, therefore the various advertisements, apart from the appeal of the film, can be ~deceptive~), with full respect of all its capabilities. By pressing one of the back buttons of the Dual Shock 2, in this case, the character tries to perceive the environment by exploiting his animal senses: he sees enemies in a different way, sees what was previously invisible and even notices the traces left on the ground. It is precisely by using this mode that enemies can be eliminated with a single shot, naturally by taking them from behind: you approach them in silence (even from a hill) and press the Circle key as soon as possible. At this point a spectacular sequence, different from time to time (also depending on the number of enemies to beat), shows us Wolverine getting rid of one or more opponents quickly and effectively. Tackling battles in a ~traditional~ way, on the other hand, gives us the possibility of using a wider range of attacks (kicks, punches or claw blows) and to use, similarly to the stealth mode, spectacular and of undoubted charm. The fights are handled in a particular way: once an enemy has been approached, a red circle appears below him and our attacks will only be aimed at his address, unless we ~release~ ourselves for an evasive maneuver. During the exchange of blows it is also possible to parry, by moving the analog stick in the opposite direction to the enemy. Indispensable during the boss fight, the traditional approach to fighting is strongly discouraged in some levels, otherwise the game will end (due to the activation of an alarm or something similar). 100% Loyal If the addition of the ~sensory~ mode already demonstrates great respect for what Wolverine's character is, likewise the management of his energy bar takes up some important concepts, such as the mutant healing factor. Logan can proceed through the game with his bare hands or with his claws out. The first possibility offers lower attack power, but includes the ability to heal from wounds: the health bar restores itself, unless you take a long series of damage at close range. Added to this is the so-called ~bar of fury~, which fills up as attacks are suffered or inflicted, and which transforms Wolverine into a real beast for a short period of time, whose attacks leave no escape. Fans of the character will not fail to appreciate the way his characteristics have been reproduced in the game. The possibility of extracting the claws at will, in this sense, gives no small satisfaction... After having implemented so many ideas in a brilliant way, unfortunately, the developers have left out elements which in the end prove to be extremely important for the enjoyment of this title. First, the control system often doesn't respond promptly to commands, and this will create a lot of difficulties with the bosses. Apart from this, some solutions are a bit cumbersome (the fact of having to press a key to detach from a wall, for example) and probably could have been thought of differently. Leaving aside the usual annoyances of the virtual camera (which in this case is not so senile) and the lack of variety (there are few attacks after all), I would say that the biggest flaw of this production lies in its rigidity in following certain schemes. Wolverine proceeds calmly throughout the game, his powers are perfectly rendered but against the bosses he must necessarily implement awkward strategies (Wendigo, for example, must first be ~feed~ and then taken from behind for an improbable launch), which could very well be replaced by classic-type fights but with a few more possibilities. Concluding... X-Men 2: Wolverine's Revenge is a product that will not fail to excite fans of superheroes and the X-Men in particular. Graphically it is very well done (apart from some small ~rough~ details), the sound boasts an impeccable dubbing (in English, in the version I tested) and the feeling compared to the comictto original everything is there. The developers have done a great job of reproducing all the character's abilities on the screen, even if unfortunately they have not found adequate solutions to make everything a little less cumbersome, especially in some points. Pros: Graphics very well done and faithful to the comics Wolverine has been reproduced perfectly Some stages of the game offer great emotions Cons: Sometimes the game becomes ~obscure~ and cumbersome The control system could respond better Music and sound effects average Weapon X As anyone who follows the paper adventures of the X-Men knows very well, Wolverine has always been the most mysterious and fascinating character in the series. Appearing for the first time thirty years ago, so long after his ~classic~ colleagues, Wolverine began fighting against two of the most powerful creatures in the Marvel universe: Hulk and Wendigo. Logan's past (this is his real name) is covered in a dense mystery: endowed with overdeveloped senses, as well as the ability to heal in a very short time from any wound (which probably also slowed down his aging), he was captured by a secret organization and subjected to an operation that aimed to create the perfect weapon. His bones were covered in adamantium, an indestructible metal, and retractable claws were implanted into his arms. This part of Wolverine's life, along with memories of what happened before the experiment, remains obscure to him as well. In the course of the game, however, many things will be clarified and the mutant with claws will be forced to relive his recent history: it seems that a lethal virus has awakened in his body, and the only way to find a cure is to retrace what happened years earlier, in the base where he was subjected to the terrible experiment that made him more powerful than ever.", "date": "2003-06-23", "grade": null}