{"name": "Warioware", "ref": "https://multiplayer.it/recensioni/warioware-inc-mega-microgame.html", "text": "I want to become a game designer It's a lazy afternoon like any other, and Wario is indulging in his favorite activity, which is watching television sprawled out on the couch scratching his belly. At one point, a news report announces the huge sales of the latest GBA game. For Wario it is enlightenment: he hurries to call all his friends and runs to buy a computer, in order to create the greatest videogame blockbuster of all time and consequently become very rich. Incredible but true, the brilliant team of Warioware Inc. has even managed to provide a storyline to a game that belongs to a genre traditionally detached from even the simplest narrative schemes. And yes, because Warioware Inc. essentially is ~simply~ a collection of over 200 minigames. Turning up one's nose at this point could be the (un)conditioned reflex of many readers, an attitude which however can only be understandable: it is difficult not to associate the word ~minigames~ with collections such as Game & Watch Gallery or similar products. Warioware Inc. -fortunately- is much, much more. But let's go in order. The game is made up of eleven levels, each relating to a certain character and each featuring a particular category of mini-games (sports, nature, puzzles and so on). Reaching a certain number of points - corresponding to the number of minigames completed before running out of the four available lives - in a stage allows you to unlock the next level, while an even higher score allows you to make some particular games available (of some of which can also be used by two players through a single console). So what makes Warioware Inc. so special? First of all, the level of frenzy of the individual mini-games, which are introduced by a single word (for example ~dodge~, ~collect~, ~jump~ and so on) and whose duration stands at a handful of seconds: it is therefore necessary to understand what is the purpose of the mini-game and complete it within the limited pre-established time, in an obviously very adrenaline-pumping game scheme. But that's not all, of course... The Dementia Factory What makes Warioware Inc.'s minigames truly unique lies in the sublime heights of demented humor they manage to reach, both for their implicit nature and for the ingenious audiovisual realization prepared for the Nintendo title. It's hard not to burst out laughing at minigames that see the user sticking a finger inside a nostril, or rolling spaghetti on a fork, or even helping a pixelated Wario squash Goombas in full style Super Mario Bros. The situations that the user finds himself facing are as varied as they are all extremely hilarious, to the point that you can find yourself missing the completion of a minigame simply because you are too busy laughing. The graphic sector of the game, in this sense, makes a great contribution, proposing absolutely brilliant and always very funny visual solutions: some minigames are characterized by tastefully minimalist cosmetics, others by incredibly trashy realistic images, still others by frames that mimic or reproduce video games of the past. The sound, of course, adapts to all these various situations, with demented tunes that generally do nothing but increase the level of comedy of the individual minigames. In short, quantity, quality and variety coexist perfectly in this Warioware Inc., which has the great merit of adding a devastating humorous factor to these indisputable qualities. Quite remarkable for a ~simple~ collection of minigames... Comment Warioware Inc. is, quite simply, one of the best ~handheld~ games ever made. The formula is as simple as it is successful: a series of fast, fun and insane mini-games that make up a frenetic and dangerously addictive gameplay. In short, the best that can be asked of a title for a portable console, which by definition must be able to mainly offer products capable of being consumed in any place and in the most varied spare moments of time. Warioware Inc. represents a formidable return of the ~pick and play~ category, a game whose enjoyment is immediate, but which is also able to keep the user busy for a very long time, thanks to the considerable amount of unlockable material and that simple (but very important) desire that instills in the player to break his own records just for the sake of doing it. If to all this we add the massive doses of demented humor that Warioware Inc. manages to offer for every singleonly minigame, then it is not difficult to understand how the Nintendo title is a product to which the adjective ~fun~ really applies in all its nuances. Pros: Fast, frantic, fun gameplay Goofy humor galore Brilliant technical accomplishment Cons: Can be addictive There are those who claim - and not entirely wrongly - that the GBA has so far built up its great fortune by resting on its laurels and offering its users a large number of remakes and various sequels, making very little use of the originality that should be the mainstay of the much heralded Nintendo difference. Some say that this is a reflection of a certain identity crisis of the historic Japanese software house, unable to renew its franchises or propose new ones. There are those who are already prophesying a slow but inexorable outflow of ideas from products branded by the big N. It's a pity that good old Wario took care of sweeping away all these apocalyptic theories, with a title that could easily be defined as the most original, funny and crazy never appeared on the Nintendo handheld.", "date": "2003-06-13", "grade": null}