{"name": "Armored Core 3", "ref": "https://multiplayer.it/recensioni/armored-core-4.html", "text": "Earning a Living in the Future The game is set in a distant future, where the economy and power have fallen under the control of mega corporations in constant struggle with each other. To solve their problems, or to damage their rivals, many of these companies have often asked for the intervention of the Ravens, mercenary pilots of large combat Mechs called Armored Core which, with the evolution of technology, have taken the place of the old traditional weaponry. You are just one of these Mech pilots who, to earn a living and to get the money necessary for the repairs of their Core, will have to go to the forefront facing numerous and dangerous missions (clearly for a large fee). As you progress through the game, you will soon realize that, in order to try your hand at certain tasks with hopes of victory, you will necessarily have to improve your Core and this will cost you a lot of money. The high price of spare parts and upgrades will force you to accept all types of missions, even the easiest and perhaps a bit monotonous ones. To keep costs down a bit, remember that you will be free to choose the mission to perform; this will allow you to give preference to assignments from certain corporations, which, to repay you for your loyalty, will grant you special discounts on their products. Graphics and Sound By inserting the disc into the Ps2, you will be immediately introduced to the futuristic world of Armored Core thanks to a beautiful FMV movie. Unfortunately, however, starting to play, one immediately realizes that even if the graphic design is discreet, the guys from From Software could have done much better. The game environments, especially inside the buildings, appear sparse, linear and not very interactive, causing an overall flat and inadequate visual impact. Things improve a little in outdoor locations which, thanks to a great variety of landscapes (cities, forests, deserts, ruins) and the presence of some atmospheric events (snow, sandstorms), are very pleasant and interesting. On the other hand, we must admit that the creation and characterization of the Cores is close to perfection: detailed and richly detailed textures, combined with very varied, realistic and fluid animations, make the gigantic Mechs appear almost as if they were real. This realistic effect is further facilitated by the excellent special effects: flashes of light, trails of smoke, falling shells and various sparkles due to the ricochet of the bullets or the collision with metal surfaces make Armored Core 3 much more similar to a real simulation than to a a simple action game. Another small flaw concerns the graphics engine which, especially in the most frenetic and crowded situations, proves to be significantly tired, causing slowdowns, loss of textures and also penalizing the already not very good framing system. As far as the sound is concerned, we can assure you that an excellent job has been done; the adrenaline-pumping music (which adapts to every moment of the game), the many sound effects and the support of Dolby Surround Pro Logic II, make the audio sector of Armored Core 3 one of the best around. Armored Core Story The Armore Core series is certainly one of the most loved and known by Mech enthusiasts who own a Sony console. But how many titles does the From Software saga count?! Armored Core Thanks to the excellent graphics, the very precise control system and a solid and accurate technical realization, the first ~Armored Core~ managed to conquer many fans of Japanese Mechs and Robottoni. Armored Core: Project Phantasma Released a year after the first chapter, ~Armored Core: Project Phantasma~ reproposed the same game system, however, due to the very high level of difficulty, it required much more practice and for this reason it was not suitable for beginners . Armored Core: Master of Arena Made the same year as ~Armored Core 2~, the third installment of the series was not a real sequel, but rather an expansion of the previous games. Even though the graphics were starting to look a bit outdated, Armored Core: Master of Arena still turned out better than its predecessor. Armored Core 2 The debut on Ps2 happened in the best way. Even if the game system was the same as always, thanks to the power of the new Sony console, the technical realization was the best. The visual impact in particular was amazing: the many arenas full of details, the tantissimi Cores with attention to the smallest details and the high number of missions made ~Armored Core 2~ the best Mech game out there. Armored Core 2: Another Age As with the first chapter of the series, the expansion of ~Armored Core 2~ was not long in coming. The new title for Ps2, even if it was very similar to its predecessor, offered more Cores to use and a much greater quantity of components and upgrades. Playability The game system proposed in Armored Core 3 is very similar to the one already seen in the previous chapter (Armored Core 2: Another Age). Mind you, this doesn't mean that nothing has changed, but some old flaws have remained. Even if to fully master the control system of your Core you will have to spend a few hours playing or be a veteran of the series, in the first missions you should be able to juggle without major problems. The response of the pad, except in some cases, is excellent: to move you will have to use the left analog stick, while with the R1 and L1 keys you can move the Core sideways while maintaining the same shot. Speaking of shots, one of the flaws also present in the previous chapters emerges: by moving the camera behind the Core downwards or upwards with the L2 and R2 keys, you can change the game view, even if most of the time , due to the imprecise shots, you will be forced to return to the original position, perhaps after having taken an infinite number of shots that you will not even be able to see. When you accept a mission, you will have to pay attention to the required objective, because, in some cases, in addition to eliminating the enemies, you will have to perform different tasks, such as escorting loads or clearing mined areas. The fights could be influenced by many factors (morphology of the terrain, atmospheric conditions, attack distance, dislocation of the adversaries, etc.), but don't worry, because you can count on the help of the radar, which, signaling your position compared to that of enemies, it will give you the possibility to choose the best maneuver to defend or attack. Your Core will be able to perform many actions and different types of attacks (both at close range and from afar), but watch out for ammunition, once you run out of supplies, you won't be able to reload, but only get rid of the weapon to lighten you up and become more agile in your movements. Furthermore, from time to time (paying a certain amount) you can ask for the intervention of some support units, which may be composed of other Armored Cores, helicopters or tanks. These units, equipped with excellent artificial intelligence, on certain occasions will be indispensable for completing the mission, because, as you continue in the game and encounter increasingly fierce and numerous enemies, your Core alone may no longer be sufficient to win. In addition to the classic Story Mode (where you will have to complete fifty missions to complete the game), there is the Versus mode, which, via split screen or the use of the i-link cable, will allow you to play multiplayer up to four players simultaneously (one against one or two against two). The Menu of the Day The ability to customize your Iron Giant has always been included in the Armored Core series. In this new chapter, however, the section dedicated to modifications has been improved and expanded to such an extent as to allow almost infinite combinations. By entering the Garage section, in addition to being able to buy new spare parts and upgrades of all kinds for your three robots (head, arms, legs, body, energy generator, thrusters, radar, circuits and many types of weapons), you will have the possibility of assembling the Core of your dreams from scratch, with the possibility of being able to decide the color of each single piece. Clearly you will not be able to combine the components at random: to create an efficient and balanced Mech you will have to take into account the proportions between the various parts and also the total energy consumption (for example, heavy weapons cannot be used with fragile arms and an energy generator not very powerful, it will not be able to operate expensive or excessively heavy components). In addition to the Garage, from the main menu you will also be able to access other sub-menus; by entering the Missions section, you will be able to check the tasks to be performed, with related details, information and compensation due. Also from the main menu, you can read your e-mail, save, load and also enter the Arena section. In the latter you will have the opportunity toengage in one-on-one combat, choosing the place of the battle and the enemy to face. Conclusions The presence of few innovations and the sometimes superficial technical realization have prevented Armored Core 3 from consecrating itself as a must in its category. However, thanks to the well-calibrated difficulty level, the intuitive control system, the wide customization possibilities and the longevity ensured by the Versus mode, we can assure you that From Software's new title will be able to satisfy both the veterans of the series and the such beginners. Pros: Best Mech-Game currently available for Ps2 Amazing soundtrack High longevity Practically infinite Core customization Possibility to play at 60 hz Cons: Graphically it could have been better Control system sometimes imprecise Not very innovative compared to its predecessor When it comes to Mech-Game on consoles, one of the first names that comes to mind is Armored Core, certainly one of the best known and loved series by fans of the genre since its debut on Playstation. From 1998 (precisely the year of its debut) to today, From Software has worked hard to improve its saga dedicated to Cores, arriving, with this new chapter, at the third episode on Ps2 and at the sixth in total. Released a few months ago in Japan, Armored Core 3 managed to achieve an excellent result, remaining at the top of the sales charts for a long time. Will the new title dedicated to Core be able to repeat the same success in the West too? Read our review and you will find out!", "date": "2003-06-11", "grade": null}