{"name": "Scudetto 4", "ref": "https://multiplayer.it/recensioni/scudetto-4.html", "text": "Winning team Describing the Scudetto to those who have never played it is as simple as it is reductive. Unlike other well-known, well-known, football video games such as the infamous FIFA series from EA Sports, which play all their cards by making us put on the shoes of the players directly on the football field, in Scudetto we will never see even the shadow of a ball (except in the various background images) and we will play the ~simple~ role of the coach. Selecting the team to send onto the pitch, defining the shifts and intensity of training, looking for new signings on the transfer market to strengthen our weakest departments, managing the locker room knowing how to reward (and punish) our players, dealing with balancing budgets and complaints, disgruntled fans and many, many, other tasks will be our daily bread. It will then be up to the player to decide whether to take on the role of coach of a renowned Serie A team and have their favorite champions play side by side or whether to start from the bottom up and take the reins of a promising Serie C2 team and bring it, slowly slowly, towards the Olympus of international football by navigating and discovering young promises on a DataBase that to define as boundless is an understatement. Each player is shaped on the basis of a certain number of attributes represented by a numerical value between 1 and 20. This is where the beating heart of the game lies. Putting together a harmonious formation and shaping tactics and game patterns also based on the characteristics of our players (Fast and with a good cross? We will certainly put him on the wing) represents nothing short of an art and, for many, a real drug. If we then consider that each player has his own character, aspirations and history (it will happen, for example, that two players don't get on well together due to past vicissitudes) it is easy to imagine the depth of play offered by Championship Manager, pardon, Scudetto 4. Oil and pressure... As described in the course of the review, in the face of numerous innovations, a series of problems arise due to the vastness of the product itself. Although these and a series of other small flaws do not affect the overall gaming experience, we still recommend that you constantly point your browsers to the game's official website and constantly update your game version (now at 4.0.5). Promptly and inexorably the development team is correcting the most controversial - and annoying - aspects of the game. ... it doesn't change. Almost. The game interface has remained almost unchanged. After all, what little could be added and perfected has been done and, at least until a radical revolution of the graphic front-end is thought of, one could hardly wish for anything better. Everything is in the right place, even without reading the manual we will hardly have to ask ourselves where it is possible to find that given function, just imagine where we put it and we will find it there. Even for newbies, those less accustomed to the style of the old CMs, the gaming environment appears friendly and hospitable: at least for this kind of game. There are many menu items, as well as the possibilities for interaction, however it is always quite easy to pass from one screen to another thanks to the intensive use of hyperlinks which allow us, for example, to view details about a player directly by clicking on the name mentioned in a news, where it is said that the aforementioned is looking for another Club to play for. As already mentioned, the Db implemented by Scudetto4 is nothing short of immense: 39 leagues and about 250,000 players and insiders guarantee us accuracy and, at the same time, a freedom of play that is truly unattainable by any competitor. So much goodness, however, has a price. And we will have to pay for it with sometimes exasperating slowness. Although it is possible, at least theoretically, to activate an unlimited number of championships and divisions - as in the past in the old and most recent versions of the rest - we will soon discover that, even on a mid-range computer (the same one with which we are able to play Unreal 2 at the resolution of 1280*1024 to be clear), we will have to seriously limit ourselves in the choice of championships. Indicatively with a 1500 Mhz processor and 512Mb of RAM we will have to settle for a couple of championships, otherwise an exasperating and somewhat fragmented gaming experience due to slow loading and exhausting processing shifts to say the least. Therefore, if we don't want to spend more time in front of the waiting screen than during the games, we will have to limit our delusions of grandeur and be satisfied, often, within the simulation of only the Italian national championships. The contracts section has been slightly improved thanks to the introduction of a series of new informative parameters useful in the evaluation phase of the purchase and engagement price such as, for example, the average salary of our players and the figure recommended by our trusty Second Coach. The player and staff search section is directly connected to the contract stipulation function. The search filters have been further expanded and now, instead of the old filter option ~Interested only~, another option has appeared called ~Exclude unrealistic goals~, a pity that often you can't find really interesting players anyway and time is often wasted in contacting uninterested personnel. Also in the field of transfer market we will then notice, from time to time, some strange anomaly whereby - for reasons unknown to us - we will not be able to secure the services of certain players, albeit on truly incomparable conditions. Finally on the pitch In the face of all the new features (including the possibility of changing the game interface thanks to the implementation of a Skin management system very similar to that of programs such as the famous WinAmp) for many the real innovation worthy of the name lies in the unprecedented two-dimensional view of the progress of the matches. It goes without saying that after years of honorable career many were afraid that this new feature could distort the true soul of the Scudetto. Fortunately, all fears turned out to be unjustified. In addition to being totally configurable (in the sense that we can, if we deem it appropriate, also decide to go back to just the old text messages) the new view, albeit very schematic or unwilling to amaze us with special effects, will soon show us all its usefulness . After all, the philosophy expressed by the Designers in all these years of honored careers has always been clear: nothing, in the Scudetto, has been put for pure and simple aesthetic taste. If it doesn't serve the purpose of pure gameplay, it shouldn't be there. So now we could understand, thanks to a simple glance, if a player is struggling to keep his position or if with our scheme we leave too much space for a given opposing player. Finally. But even from the minor changes we can see the level of attention paid by the programmers towards the development of this new chapter. Now we will be able to ask our helper to recommend a typical formation and, finally, we will be able to memorize different ~typical formations~ to use according to our needs or the competitions that await us. These are just some of the many great little options that have been implemented, also thanks to the numerous feedback reported by users of the previous chapters, to help us in everyday life. Final whistle The characters available are finished yet I realize that I have only touched the surface of a topic as deep as it is immense. Since the time of the release under the Domark label (how many still remember it?) Championship Manager managed to kidnap the player in the sadistic logic of ~one more turn and then I go to bed~ perhaps even more markedly than in exciting titles such as Civilization or Master Of Orion. The staunchest football fans were up at four in the morning looking for an interesting young player on a mere few Mb Db to be included in the squad to replace the now elderly free player and now they will do it with almost 60Mb of data, statistics and various characteristics. The same 2D view, both desired and feared by aficionados of the series, succeeds in its intent by making the setting and calibration of our tactics even simpler and more immediate. Final whistle Of course, there are still some flaws: tennis scores sporadically still make an appearance, every now and then it's all too easy to get lost in the transfer market - making us wonder if it's us who don't understand or if it's the program that's wrong, the processing of data requires a lot of computing power, our teams suffer sudden and unexplained drops in performance, injuries to our protgs appear to be too frequent and, sometimes, the players don't seem to follow our tactics. But these and other small defects absolutely do not affect the gaming experience that any true football fan, digital and not, it should let itself escape. For all the others, despite the caliber of the title, I really don't feel like recommending this game: if you don't like football you will hardly love Scudetto 4, you won't be able to understand and appreciate it. The point of reference for the genre of football management is still here and, now, overcoming it seems even more unthinkable. Pros: Best of its kind Perfectly rendered 2D game Functional and no-frills Graphic Appearance Will still keep you up late Cons: Requires a lot of computing power Sometimes a few too many bugs Functional and no-frills Graphic Appearance Only for gamers football fans The meeting is drawing to a close, we look nervously at our wrist to look for the watch... but we can't find it: we tore it up, enraged, while we beat our fist against the wall due to the - absolutely unjustified - cancellation of our first goal. But we don't need the watch, we just need to look up and the graphics inform us with a laconic ~2nd Time 87~, while the fourth man announces only one minute of recovery. Not even the time to swear, not even too softly, when suddenly the field materializes as if by magic before our incredulous eyes. An opponent striker badly loses the ball in our three quarters, Cherubini - our push half - recovers the ball and verticalizes on the wing in favor of Pertugi who, masterfully, completely changes the game and frees our top striker. Ghironi then passes the last defender, goes around the goalkeeper, hesitates for a few moments and... ~Campioni Campioni Campioni~: after a year of sacrifices we are in Serie B! The red dots on our monitor move almost in unison in the direction of the opponent's corner flag, shortly after the referee whistles the end of the match, let's take a quick look at the report cards drawn up by the computer: Ghironi  in addition to a nice 9  yes he deserved the best player of the match award, we are already thinking about the new signing that he will ask us in view of the new season in the cadet series, ~These leeches without attachment to the shirt~! Well yes, the King is back, after a series of more or less justified delays the Collyer brothers are back in the field with their new edition of the managerial simulator par excellence. The fourth incarnation of Championship Manager, also recognized as a Scudetto on our Italian soil, was supposed to represent for fans from all over the world, much more than the usual update to which we had been accustomed for years, but a real turning point. Let's find out together where the fruit of many months of work has brought us.", "date": "2003-06-04", "grade": null}