{"name": "Mega Man Battle Network Legacy Collection", "ref": "https://multiplayer.it/recensioni/mega-man-battle-network-legacy-collection-recensione.html", "text": "Around the beginning of the new millennium, Masahiro Yasuma and Keiji Inafune had a brilliant intuition: to reinterpret the Blue Bomber - practically the Capcom mascot - in the form of RPG. So far nothing strange, except that this RPG starring Mega Man had to be played... cards. At the time, card games such as Yu-Gi-Oh! and the like were very strong, and Inafune wanted to serialize a title aimed above all at the youngest in terms of tones and atmospheres: something similar to Pokmon and perhaps more to Digimon. Mega Man Battle Network (Rockman.EXE at home) hit the target and enjoyed a temporary success, so much so as to justify an anime in about two hundred episodes that went on until 2006 while the video games reached their sixth iteration. In our area Mega Man Battle Network carved out a hard core of enthusiasts, but could not count on the media presence it had in Japan. Despite this, it represents a cornerstone of the Game Boy Advance library and, now that it can be considered vintage to all intents and purposes, Capcom has well thought of condensing it into a nice compilation: in this review of Mega Man Battle Network Legacy Collection we will explain better that what it includes, how it works and if it's really worth recovering these titles after almost twenty years. Volumes 1 and 2 Mega Man Battle Network Legacy Collection, a new compilation screen As happened with the previous compilations, this time too Capcom offers two volumes in digital download: in the first you will find the first three Mega Man Battle Networks for a total of four games, while in the second the other three Mega Man Battle Networks are included for a total of six games. Do the accounts not add up? Well, that's normal, because starting from the third episode, the series begins to split in Pokmon style: each version of the same game differs from its counterpart in the presence or absence of certain content in the gameplay or in the narrative, while remaining fundamentally the same, identical title. This would justify the not exactly cheap price of each volume: 39.99 euros, with a more advantageous offer of 59.99 euros for the bundle that includes the two volumes together. On paper it's a price that makes sense; however, as we have said, the second volume has six titles, but it is true that, in practice, we are talking about three split games. In this sense, we should individually evaluate the weight this aspect has on the purchase. If you intend to play each title in both versions, then the price of the volumes, and especially the bundle, is more than fair. If instead you plan to play only one alternate version of each Mega Man Battle Network, the cost becomes more questionable. Only you can evaluate Capcom's offer according to your needs and intentions. However, it should be noted that Capcom has packed this compilation with really interesting extra content and features, starting with what was previously removed in the original western releases. In Mega Man Battle Network 6, for example, the contents related to the bizarre collaboration with Konami's Boktai were restored, together with a plethora of Chips that at the time it was only possible to unlock in Japan and only through e-Readers and the like. For the occasion, Capcom has also added completely new features which include a robust interface to connect to the network and download additional content, challenge other players to a duel or exchange Chips and other collectibles; a large gallery of illustrations inspired by the entire series; a jukebox mode to listen to over one hundred songs; as well as a setting for casual players, called Buster MAX Mode, which exponentially boosts Mega Man's base attack to make it much easier to pass fights and focus above all on narrative. All in all they are standard additions for this type of compilation, but always welcome. What is Mega Man Battle Network? Mega Man Battle Network Legacy Collection, Lan Hikari is the protagonist of the story As we have already said, Mega Man Battle Network is a Japanese-style RPG, set in an unspecified future in which the network has become the primary means of communication and technology has evolved to such an extent that it is possible to explore it as if it were a real place and precisely with the help of the Navi, avatars that users can control through the so-called PErsonal information Terminal or PET. The game stars the young Lan Hikari, a teenager who often finds himself fighting against crime syndicates who intend to exploit the network for their shady purposes: needless to say, Lan's Navi is called Mega Man and is very special , but you'll only find out why by playing.Strengthened by a picturesque and well-characterized supporting cast, Mega Man Battle Network can also and above all count on a consolidated imagination. In the various titles, many characters who appeared in the traditional Mega Man peep out, albeit with new looks or recontextualized roles. Although it is a series designed mainly for the youngest, the various titles reserve many surprises in terms of narrative and will undoubtedly appeal to even the most savvy adults who will be able to come to terms with a writing that is not exactly very refined and once again in English. since this compilation has not been located either. The gameplay of Mega Man Battle Network Legacy Collection Mega Man Battle Network Legacy Collection, the jukebox allows you to listen to nearly 200 songs The experience is basically divided into three moments of gameplay. As Lan we can explore the city, interact with NPCs and customize Mega Man and his gear. Then comes the time to connect to the network and take control of Mega Man in virtual scenarios, often labyrinthine dungeons to explore far and wide. During these shifts random fights occur: at that point the action moves to a grid made up of 18 squares and divided into two halves of 9 squares each. In one half moves Mega Man, in the other his enemies, viruses. The player's goal is to defeat the viruses, both by freely attacking them with the Mega Buster and by using the Chips previously placed in the so-called folders: practically cards and decks. The Mega Man Battle Network combat system is what we could practically define as a strategic in real time. The player must dodge the blows of the enemies by moving on the nine boxes available which, with the aid of certain Chips, can increase or even decrease, if the enemy appropriates them. It goes without saying that you have to keep your eyes open and react promptly to attacks, especially those that target multiple boxes and which often and willingly represent the arsenal of the bosses. At the same time, you have to wait for the right moment to open the folder and choose the best Chips for the occasion based on a series of rules that multiply from episode to episode. Mega Man Battle Network Legacy Collection, in the virtual world you directly control Mega Man The combat system remains more or less the same in each Mega Man Battle Network, but each new chapter of the series introduces dynamics such as the Elemental Styles in the second episode, the Double Soul in the fourth or the Cybeasts in the sixth and last. While the fights become more complicated with the addition of various parameters that affect the choice of Chips and the potential synergies and combinations, the number of secondary activities also increases both in the real world and on the net: if the first title of the series can appear rather meager, the subsequent ones are much richer in content, optional missions, alternative routes and more or less secret bosses that require a certain effort to be defeated. We are talking about rather long-lived games, which are completed in about 20 hours each. In this sense, the Mega Man Battle Networks have not aged very well. They remain period RPGs, in some ways, which suffer from a certain structural ingenuity especially in the first iterations. It is an ingenuity with a certain purity, however, and by playing or replaying them in order, their progressive maturation is felt: some angularities are filed in the transition from one episode to another, the gameplay is significantly streamlined and becomes more agile and modern iteration after iteration. Mega Man Battle Network Legacy Collection, the fight with Guts Man Unfortunately the Mega Man Battle Networks carry the weight of a certain repetitiveness on their shoulders, which in the past was diluted in the time that passed between one release and another, but which is felt more clearly by playing them closely. Beyond the additional mechanics and the changes made to the combat system from iteration to iteration, the six games appear very similar in structure and narrative: the enemies change, but the scheme remains the same, with the continuous passage from the real world to the virtual, the alternation of dungeons and primary and secondary tasks that all too often require an important coming and going, weighed down by the frequency of random fights and designed to artificially prolong the duration of the adventure. Old school Mega Man Battle Network Legacy Collection, Chips are like cards in a card game Coming to terms with what is clearly a tried and tested structure, the quality of these old school RPGs that still manage to stick with their stories is unquestionablesimple but genuine, the well-characterized characters, the creative and engaging combat system which, above all, effectively recalls the characteristics of Mega Man as a Capcom trademark. Even today, the Mega Man Battle Networks are small triumphs of 2D graphics: very colorful and full of details and particulars, animated with care especially in the fights and in the virtual scenarios that sometimes appear almost psychedelic, thanks also to a soundtrack that has become iconic over the years years. The Collection also offers a setting that softens the pixelated contours, but which in our opinion only ends up dirtying the image and which we therefore recommend only to those who play on large panels where the sprites would actually appear more awkward.", "date": "2023-04-12", "grade": "7.5"}