{"name": "Primal", "ref": "https://multiplayer.it/recensioni/primal-2.html", "text": "Demons, tattoos and gargoyles Primal initially presents all the typical connotations of the video game best seller: a charismatic and sexy enough protagonist, an intriguing storyline, dark and captivating settings, the right amount of blood and violence, and good doses of healthy black humor. And, of course, a technical realization capable of immediately capturing that segment of users for whom the cosmetics of a game represent one of the best reasons for purchasing it. In short, the Studio Cambridge production is the typical title whose visual-promotional opulence requires a playful drive, even if only discreet, to enter the hearts of fans by right. Too bad that in this sense Primal fails more than partially the goal, presenting an all too elementary, linear and in some ways unbalanced gameplay. Which, of course, doesn't necessarily mean that Primal is a bad game, on the contrary: it simply has a very weak game structure compared to the -high- level of the rest of the production. But let's go in order. The story features Jen, a charming punk girl, who one evening is attacked together with her boyfriend by a monstrous creature. Our heroine is hospitalized in serious condition, but her spiritual form is mysteriously separated from her body shell: Jen finds herself thus forced to embark on an adventure in a parallel universe (called Oblivion) on which a grave threat hangs. It will be up to the dark lady protagonist of the game, accompanied by the gargoyle Scree, to save both Oblivion and her boyfriend, using the powers of the tattoo she carries on her back and the demonic blood that flows through her veins... Primordial) Right from the start of the game, Primal's gameplay shows off its impressive simplicity in some ways: the user is called to explore locations of considerable size, but contextually completely empty. In other words, the main activity in Primal consists in going head over heels through a whole series of environments that are almost always devoid of interactable elements, an activity that is only rarely interrupted by some combat or some puzzle (if they can be defined as such), and more often by tasty real-time cut-scenes. The progression in the game is then made extremely simple and linear not only by the intrinsic nature of the play scheme, but also by the developers' choice to assign a context sensitive function to the X key useful for substantially performing any action necessary for advancement. In short, Primal is played 90% by pushing the analog stick forward to run and pressing the X button whenever an obstacle or an interactable object presents itself. Of course, then there are also the clashes with some monstrous opponents, which however given their sporadic frequency and the absolute ease with which it is possible to complete them victoriously (thanks both to a once again simplistic combat system and to an AI of the enemies rather low), they don't add much spice to the ~quiet~ gameplay. Just as the four demonic transformations that can be assumed by Jen (as it is convenient to assimilate progressing in the game) and the possibility of alternating the command of the girl or the brave Scree at any time do not contribute much to the aim: the occasions in which it is necessary are so obvious exploit the (few) skills of one or the other character - Jen is more skilled in fighting, Scree in exploration and climbing - that even an element on paper as interesting as this is reduced to little more than a playful formality . And all of this, we repeat, is a sin. Because Primal shows off a decidedly intriguing design, as well as one of the best graphics ever seen on Sony hardware: if we exclude some slightly subdued animations, the inevitable poor definition of the textures and some sporadic drops in the frame rate, Primal cosmetics are truly exceptional. The quality of the sound sector is also good, with excellent music (unfortunately too little present) and sound effects, while the Italian dubbing unravels between ups and downs, the latter mainly due to the totally inexpressive acting of the ~actor~ who lends the entry to Scree. Comment Primal is, above all, a big missed opportunity. In fact, it is difficult to think otherwise in the face of a title that combines an excellent technical realization and a decidedly spot-on design with a gameplay of such little overall consistency. The game system of the Studio Cambridge production turns out to be rather anonymous, simplistic and linear as regards the adventure element and sporadic and not very exciting on the levelof the actual action. The result is a title that hardly succeeds in making an impact on a playful level, but which, all in all, can be easily played, driven by the aforementioned excellent cosmetics, an interesting storyline and the numerous different situations in which the two protagonists of the game come across, often and willingly enriched by good doses of black humour. Ultimately, therefore, Primal is a title mainly recommended for less demanding players, capable of passing over a certainly simplistic game mechanic and getting involved in the supernatural adventure of Jen and Scree. Pros: Excellent graphics Solid storyline and good characterization of the characters Sound compartment well done Cons: Gameplay too simplistic Extremely linear Shortage of action elements It frequently happens, indeed one could almost always say, that the developers of a modern video game are unable to insert into their product all the features that they had set for themselves in the game design phase, either due to lack of resources or time. Furthermore, the impositions of the distributors often oblige the coders to make even clearly incomplete titles available for the market. The fact is that, both for one or the other reason, even a big shot like Primal has reached store shelves in an apparently unfinished version, lacking in a very important element: a gameplay that is up to par.", "date": "2003-04-28", "grade": null}