{"name": "Shining Soul", "ref": "https://multiplayer.it/recensioni/shining-soul_a.html", "text": "Forest, or rather, Beast Mountain The story of Shining Soul is really just an excuse to introduce the game. In the role of the hero of the moment you find yourself against the Dark Dragon and his five lieutenants, who will be defeated one by one before arriving at the final battle with the bad guy himself. As you can see, nothing particularly exciting. You can choose your class between warrior, dragon warrior, mage and archer; in addition, it is possible to customize the color of the character by giving him one of the four shades present. A sort of miniaturized version of Phantasy Star Online, in fact, and the differences don't stop there. Once you have chosen the type of PC, you will need to give it a name, then you will find yourself in the main city of the game. Here we can stock up on items, buy and sell weapons, and so on. Once ready, you can leave the city to tackle the various game levels, starting with the Beast Mountain, a kind of forest. Each level is made up of a certain number of areas, all however unique and not divided into rooms. The real-time combat system is pretty basic, but still allows enough variation to not be considered overly flat. In fact, we can assign three weapons to the appropriate slot, weapons which will then be interchangeable at will during the fights with the simple repeated pressure of the L key (with the R key, however, three slots are recalled in which it is possible to place commonly used objects : all work like weapon slots). If, for example, we are playing a wizard, we will be able to assign three different types of magic to the attack button; depending on the weaknesses of the enemies you are facing, then, it will be possible to choose the magic that best suits the moment. By keeping the attack button pressed, and provided that the magic or, in the case of a warrior, the selected move is of a sufficient level, it is possible to charge its power in order to release a much more powerful blow; mages also have a bar of SP (the mana points) they will need to cast the ~charged~ versions of their spells. We talked about skill levels: this is one aspect where Shining Soul closely resembles Baldur's Gate: Dark Alliance. In fact, by progressing in level a certain number of points will be added for the statistics and skills of the character in question: by calling up the appropriate screen it will be possible to assign these points to the characteristics that most suit them, making the character gradually stronger in the favorite parts. The same thing can be done with skills, which can be leveled up so that they can be charged longer and therefore become more and more devastating. This system is truly intuitive and immediate, and moreover very pleasant to use: you can customize your hero practically as you want, and in addition the ~charge~ skill system is quite interesting. The bad part, however, lies in the clashes that are simplistic at best, in which it is practically reduced to running away from monsters, charging the move and then hitting, until the area is completely cleared and you can not move on to the next one and then to the end-of-level boss. Furthermore, the various classes are able to equip only one kind of weapon: the usual wizard, for example, can only use spell books; swords, bows and any other weapon, even the poorest, are excluded. Indeed, a little more ~lively~ battles would not have been bad, but it must also be said that a game like the aforementioned Phantasy Star Online, while highly appreciated, has the same basic fights, although perhaps better structured in that case; moreover, the classes are never limited (as in this case) to the use of a single type of weapon. Moving on to the technical aspect, the graphics are one of the nicest aspects of Shining Soul: cartoony in the characters, players and non-players, and very well modeled and pleasant to see in the landscapes, not to mention the beautiful inventory screen (in which, incidentally, you can use objects by dragging them onto the figure of the protagonist). However, there is a certain lack of homogeneity of style between the sprites and the backgrounds, so that the former seem very clean while the latter are slightly blurred. It's not something to be condemned without appeal, but the resulting effect is a bit strange. The music, on the other hand, is really anonymous: nice but nothing more, sometimes it can even be repetitive, but usually it's difficult to impress, so you end up not paying attention. A note to make to the Italian version, which has a really bad and practically forcing translationand to choose English in order to play decently. A picnic among heroes When inserted into a game, the multiplayer sections, except in rare cases, are always fun enough to entice players to play at least a couple of games in the company of friends. Also in the case of Shining Soul, the multiplayer is good, and being the title designed above all to be played in two or more people, just like a ~pocket~ version of PSO, the well-maintained realization of this part was due. The only thing is that, as in other multiplayer games released in this period, a single cartridge is not enough to play in two, three or four: one is forced to find other friends who own the game, and honestly it is unlikely that there are many people willing to shell out 50 euros just to play together. That said, the structure of Shining Soul played in multiplayer does not change at all compared to singleplayer games, except for the fact that in the present case we will have to collaborate with the other members of the team to clean up the dungeon levels and fight against the bosses at the end level; as usual, the warrior will launch himself against the monsters, hitting them with blows, the wizard will stay close to the fighters to heal them if their HP goes down or to help them by casting some attack magic, while the archers shoot arrows from a distance to slow down the enemies . Cooperation is a harbinger of moderate satisfaction, and it is also possible to go around at will, separating from others for whatever reason comes to mind. You can also exchange the objects found, simply by dragging the weapon or item you want to give away into the appropriate ~Drop~ window. Delicious, but obviously inessential, the smileys, shown to the other players in a cloud that appears above the hero's head when the latter enters the inventory or status screen. All in all, it's a pretty useless title if bought for the single-player game, but it becomes more interesting if you manage to find friends, relatives or acquaintances in possession of other Shining Soul cartridges (and a link cable to connect the console). Comment Those who hoped for a transcendent game will probably be disappointed, but on the other hand the almost total silence that characterized the European release of Shining Soul probably means that nobody expected anything of that. However, this is not a game to throw away: it's cute, fun enough to pass the time. Certainly it is not a masterpiece, at the level of A Link to the Past to be clear: moreover, the European release of the megaclassic Nintendo, which should arrive on the shelves in this period, is not exactly healthy for a game like Shining Soul. The addition of Four Swords to the GBA cartridge of the third installment of the Zelda series is able to fully satisfy even those who want a beautiful, non-simplistic multiplayer game that requires you to engage your brain as well as your hands. Furthermore Four Swords outclasses the title reviewed here even in graphics. Furthermore, after completing Zelda, one could remain a little dry-mouthed in front of the extreme simplicity of Shining Soul, but on the other hand who has already squeezed the first game mentioned to the impossible (which is still difficult) and absolutely wants something again on which to focus attention could find in Shining Soul a fairly entertaining pastime, provided it doesn't demand who knows what. All others turn to Zelda without hesitation. Pros: Well done and pleasant combat and character management system Multiplayer mode Well done graphics Cons: Extreme simplicity of the action Rather trivial design of levels and monsters Incapable of giving emotions To play in more people you need to buy as many cartridges Shining Soul was made to wait. Released almost a year ago in the Japanese version, it had then lost track of itself, to arrive almost suddenly on the European market. It is a game that had raised many expectations before its release, and was looming as one of the most interesting titles coming to the GBA, with the possibility of forming teams of four players, choosing one's class and more,  la Phantasy Star Online. But then, why did its exit take place on the sly?", "date": "2003-04-16", "grade": null}