{"name": "IL-2 Sturmovik: Forgotten Battles", "ref": "https://multiplayer.it/recensioni/il-2-sturmovik-forgotten-battles.html", "text": "Setup and first impressions The DVD format case, a standard by now acquired for the packaging of any video game, makes vain the hope of having a paper manual of adequate volume for the technical level of the game. A 64-page booklet represents the only reference of the production localized in our language. In the second CD of the game, translated into English, French and German, the rest of the manuals have been included in PDF format, strictly in English, unlike the previous edition which was also translated into Italian. We will find out why we dwell so much on this aspect later. The installation of the two CDs does not present any drawbacks with Windows 98, while using Windows XP it was necessary to make more than one attempt, due to an unidentified error which can be circumvented without excessive problems. The technical level of the software is excellent: the graphics engine directly supports an infinite number of 3D cards, from the obsolete Voodoo3 to the Matrox, and the complete ranges of ATI and Geforce, thus ensuring an optimization that guarantees the maximum obtainable result available hardware: a boon for owners of particularly high-performance (and expensive) video cards who for once do not suffer the annoying leveling down required to run the software on as many hardware configurations as possible. Considerable attention has also been paid to the audio support which not only allows you to select the number of channels and reproduction quality, but also the type of hardware and the speaker system used, from table speakers to Dolby Surround systems. Added to this is Voice Communication, a communication protocol dedicated to multiplayer, and direct support for Sound Blaster Live!. All this translates into a simply exceptional audiovisual quality in the face of a good hardware/performance ratio, provided you have plenty of RAM memory: 512 MB are particularly recommended (let's even say mandatory) in order not to force the hard disk to constant operations of system memory swapping, which dramatically increase the loading times of the missions and can cause slowdowns during the game phases. Features and news Browsing the game menus makes evident the close link with the first IL-2, of which Forgotten Battles at first glance takes up the gameplay, game interface and even the background music. Things change when you access the control panel for command setup: there are around 160 commands that can be activated via the keyboard and game peripherals: this gives an idea of the high number of parameters that the player is required to manage: from the wealth of mixture to the degree of incidence of the propellers, from the selection of views to that of orders to one's squadron. Obviously the most savvy players can ignore this kind of options, selecting a widely customizable difficulty level; nevertheless, the increased level of realism allowed to hardcore simulation lovers is evident, who will now be able to manage engine ignition systems, compressors, radiator incidence and cooling systems if they wish. Another relevant novelty concerns the dynamic campaigns: it is possible to select the date from which to start one's participation in the conflict (obviously, by selecting for example 1940, the aircraft built in 1943 will not be initially available), the nation to which they belong, the squadron and the aircraft to use in each operation: the campaign is automatically generated and each subsequent mission takes into account the losses suffered or inflicted on the enemy. Therefore, capturing or killing an enemy ace will no longer appear in subsequent battles. The same thing goes for your own squadron: each pilot has his own skill level which increases with the succession of missions and with the experience gained in combat. In the event losses are replaced, new squadron pilots will initially have little or no experience, so overall squadron strength will increase or decrease as operations develop. Each career is made up of several campaigns (from 4 to 8) each of which consists of about 30 missions, for a total of 100-250 missions, a factor that keeps the game longevity very high. These are just some of the new features in IL-2: FB, and not all of them can be illustrated on this occasion. What we are interested in knowing is, above all else, whether the goal of programmers to improvewhat was done in 2001 and to reconstruct a realistic simulation has been achieved. Flight impressions Flying the planes of IL-2:FB is a real experience, from all points of view. Each of the 89 (!) flyable aircraft has different characteristics, and different behaviors with respect to stresses, altitudes, overall weight, and so on. The flight model is very accurate and gives a feeling of great realism, to the point that you often end up creating a mission without targets or enemy artillery for the simple sake of flying freely in the mountains, countryside or archipelagos of Eastern Europe . The 3D models of the planes have been reproduced with care worthy of the best 3D testing programs and do not present any qualitative differences: even the secondary details (landing gears, bomb and artillery attachment sleds, even the shell casings) are were made in an exemplary way. Depth and visual realism are guaranteed by an unprecedented lighting and light sourcing system, which boasts sublime touches when for example pointing towards the sun to disengage an enemy aircraft, rather than during dawn or dusk missions, or at night, when bombers flying low over cities are illuminated by anti-aircraft lights. The only flaw, if we want to call it that, concerns the system for displaying the trees at low altitude, which reveals the trick used by programmers to lighten the workload of the video card and processor: the trees are in fact reproduced by superimposing one on the other the projections of the same seen from above. The result is excellent up to 100/150 meters in height, but at low altitudes it can give a false perspective of the vegetation, and in low-flying it is necessary to pay particular attention to avoid impacting the ground. The ability to select from around twenty different difficulty parameters allows you to adjust the realism to suit your needs. This aspect makes the game suitable both for fans of hardcore simulations and for those approaching this kind of software for the first time, given that it is possible to proceed step by step, eliminating the take-off/landing operations, or to simplify them so as to avoid stalls, turbulence and other factors which generally affect the difficulty of these manoeuvres. The quick mission editor allows you to gradually become familiar with formation flying, cover or attack missions, since you can configure the type and number of enemy aircraft, objectives to be achieved, flak, initial flight altitude, time of day and level of advantage over the enemy. The editor is quite versatile, and although relatively limited in the situations it can generate, it allows you to train in dogfight maneuvers, or air combat sessions, one of the strengths of the creation. Combat Whether it's sinking a cruiser, tearing down a bridge, or providing cover for your base or bombers, the realism of operations and the exhilaration and fun that follow a successful mission are guaranteed. I have used italics because by reading the comments of real WW2 pilots and the historical retrospective in the manual, and by participating in the various missions, one becomes more aware of what it meant to participate in a combat mission, of the type of risks the pilots were subjected to the subtle difference between success and defeat. If IL-2: FB were a driving simulation, it could be said that it is able to perfectly recreate the sensations returned by driving on the track and by the challenge of racing against other opponents. With the difference that in this case the other pilots must be shot down, not simply beaten. Dogfighting is certainly the type of action that places the greatest emphasis on realism: often we find ourselves a few meters from the tail of an enemy aircraft: hitting it on the engines, seeing it fall in flames while the pilot throws himself with a parachute (if it is a bomber fall, the 6 members of the crew will abandon it one at a time) leaves little doubt on the exceptional care placed in this construction. Example of combat actions Bombing Combat Dog fights Multiplayer Before moving on to the final considerations, let's deal with one of the greatest strengths (another?!) of the game: the multiplayer sessions. The game browser provided by Ubisoft allows you to connect via the Internet to Ubi.com servers, or to create multiplayer sessions to which other players canthey can log in. Despite the fact that the game has been released for a very short time, at any time of day you connect, there are never less than 90 people connected to the network on different servers. It is possible to participate in cooperative or dogfight sessions: in the first case it is even possible to board a bomber and occupy one of the turrets equipped with machine guns. A close-knit and well-coordinated team may even be able to keep up with the fighters, much faster (and smaller, therefore more difficult to hit) than the big bombers in the game: provided you have a sufficient amount of ammunition... On the dogfight there is little to say, except that it is pure adrenaline: when you measure the environment in which you fly and your opponents, you can launch into duels at a height of 2000 meters and chases in the mountains, doing the slalom between the trajectories of the anti-aircraft projectiles, which can be placed by the game servers in the most strategic positions. A real hoot, except when you get shot down on take off...don't expect advantages or chivalry! The multiplayer routines are among the best ever in the genre: think, for example, of the possibility of importing one's own skins or those of the other drivers into the session, so as to always be able to uniquely identify oneself within the gaming community. Ping and connection latency depend on the servers, but apart from a couple of occasions in which an inopportune loading made me find myself at the bottom of the sea, I haven't encountered any particular problems: it is however obvious that if in single player sessions you can go down relatively compromise with your hardware configuration, in online multiplayer sessions you need to have a good connection and a PC capable of managing graphics with more than 20-30 planes simultaneously, to fully enjoy the potential granted by the game. Conclusions Rarely have I been faced with such a complete and well-finished product, able to achieve the goals set by the programmers, who have succeeded in the difficult task of improving the already excellent IL-2 Sturmovik. Graphics and sound are 9.5/10, peripheral support (including direct support for the Thrustmaster Hotas, the best flight peripheral available on the market) and feedback effects are excellent, longevity practically infinite thanks to the 130 aircraft (89 of which ) faithfully rebuilt and a campaign generator and a complete mission editor (in addition to the quick one), initially difficult to use, but able to guarantee maximum game customization. The incredible care dedicated to objects of secondary importance is striking, such as vehicles on the ground, or boats - merchantmen, cruisers, submarines - which boast a detail never seen before. Everything perfect then? Almost: there is a lack of adequate manuals, which the training sessions and the PDF files provided on the CD do not sufficiently address. A lack that may not interest the more expert players, but which can prevent novices and those approaching this simulation for the first time - not from using it - but from enjoying it 100% by exploiting its high technical level, unless have the patience to carefully observe the pre-recorded training sessions and take accurate notes. If the requirement was to limit production costs, or is due to the logistical limitations of the DVD format, it would still have been possible to insert accurate and complete manuals in Word or PDF format, leaving buyers the opportunity to print them or not. Apart from that, IL-2 Sturmovik: Forgotten Battles is really a great product, which further improves the high degree of realism and playability of the first version, while providing a really adequate multiplayer support that will make dogfight addicts happy. In the overall picture, remaining in the field of simulations, if IL-2: FB was a driving simulation, it would probably be considered the best ever made. But that's another story... Conclusions Pros: Graphics and sound, good quality/performance ratio Multiplayer support Customization of difficulty/game options Curated in all aspects Cons: Insufficient manuals Theater of operations limited to Eastern Europe Minimal localization in Italian In 1941, as part of Operation Barbarossa wanted by Hitler to conquer vital space for the Reich, the German armed forces penetrated the Soviet Union, breaking the non-aggression pact signed only two years earlier by Hitler himself and Stalin. Thus began one of the bloodiest invasion campaigns of the second", "date": "2003-04-06", "grade": null}