{"name": "Mario vs Donkey Kong 2 - Recensione", "ref": "https://multiplayer.it/recensioni/mario-vs-donkey-kong-2-recensione.html", "text": "Imagine a cuddly puppet... However, the Kyoto house, certain of his good work, shows that it believes in this umpteenth spin-off of the Mariesca saga by realizing a second episode which once again proves to be a summation of refinement and ideas. The style is the same, but, as we are now used to, the structure is reshaped from the ground up both to be adapted to the characteristics of the Touch Generation and to amaze again with an infinite number of small and large innovations. In ~the march of the Minimarios~ the first thing that changes is the protagonist: we are no longer at the controls, via cross and keys, of a hyper-athletic plumber with a belly (?), but we address more or less indirectly, via nib, the cute spring toys. Hence, yet another reinterpretation of Mario can be turned, made to stop and forced to jump, but moves exactly like a wind-up toy. In this respect, the work was truly masterful, so much so that it really seems to be faced with real toys without control. Unaware of the risk and very fragile - you will see them several times torn to pieces, set on fire and pressed... - they get closer and closer to the various dangers, at least until a soft rub does not make them reverse the march, get on a platform or stop in a seemingly safe point. In fact, the small levels contain a very numerous series of the most varied dangers. It starts from the DK puppets that kidnap our pupils and we get to the classic fireballs, we can glimpse the classic enemies of the Marian episodes, but we also shiver at the sight of a puddle of water. With the nib, in addition to directing the tender toys more or less precisely, one must also set up and operate some ~tools~. These can be classic elevators, already seen moving walkways, but also brand new taps to control the liquid level or intriguing magnetic half-pipes - it's up to you to find out what I'm talking about ;-). Or, again, particular blocks to make disappear and reappear, to set on fire or explode. The goal, as in the past, is to reach the exit door and to collect, along the way, various coins and the letters that form the word Minimario. If the former lead only to an increase in score, the latter allow access to a mini-game in which to hit the ~shy guy~ who come out of some pipes. To tell the truth, this minigame is the least successful part of the whole title. Pink blocks can be moved to various locations The springs and the exit door: two important elements Fire-breathing plants have been following us for twenty years now... How I'll kill you badass DK Completed all nine levels present in a world you must defeat the ape. To do this you have to literally shoot Mini Marios from a cannon that can either rotate or move in a straight line across the bottom of the screen. The player has the task of moving the weapon through a kind of rudder and pressing the ~shoot~ button. DK is located in the upper screen and can be hit directly or indirectly causing various objects to fall on him. The brilliant thing is that since the projectiles are the same Mini Marios that we have saved in the game, the fewer of them destroyed, the higher the score will be. The energy spent on inventing new situations in what could have been a simple and otherwise monotonous game is striking. ... how peacefully he strolls ... And now the beauty of the game! If getting at least one of the Mini Marios to the exit is a sufficient and relatively easy task to complete the level and be able to access the next one, a very different matter is that linked to the score. As in the past, we go back to fighting against ourselves more than with the game. Here things get complicated, and not a little. The nice spring puppets are present in the level in variable numbers and often a golden one appears. It goes without saying that everyone must reach the exit door safely, but this is not enough. To get the highest score you must first of all collect as many coins as possible, but also have the helpless arrive ~in line~ one after the other without letting too much time pass between one salvation and another. As if that weren't enough, the golden puppet must be the last in line and none of those present must ever have been stopped... All this leads, together with a careful and a little crazy design, to find yourself most often with all these self-propelled toys that simultaneously go towards their death. Only careful planning and the most pronounced of trial and error experiences can lead to the highest score - that's getting tough! To say that the experience is much less frustrating than the previous onessore. An increase in the complexity of the rules was contrasted with a decrease in difficulty. This allows for greater enjoyment: getting to the bottom is relatively easy, getting all the gold is a difficult challenge, but not as impossible as it seemed in the past. This choice was also dictated by the semi-indirect nature of the stylus control system, decidedly and obviously less reactive and precise than the cross one. Although very pleasant and fun, the touch control system does not allow the millimetric movements of the past one, and this has led to a wise review of the difficulty curve. However, all this does not prevent cursing amiably and exploiting the ~start over~ option a lot of times! However, we are faced with a very challenging game The yellow columns are movable and can be activated with a switch Those rubberized sausages allow you to climb with the classic jump between the walls The water is lethal!!! ... towards a ball of fire that... will incinerate him! Even if the technical sector definitely takes a back seat in front of a cornerstone of the gameplay like this title, undoubtedly we are faced with a very well-finished game. The backdrops were made with softer and much less bright colors than the game platforms in the foreground - this obviously so as not to distract from the action -, but they are still very well-kept and full of effects and parallax planes. The fluidity is impeccable and the animations of the various puppets, as already reported, are really spot on and actually give the idea of the old spring mechanisms. A huge applause to the music, really beautiful, well done and with an excellent exploitation of the stereo and ~3D~ effect of the DS. Epic reinterpretations of some classic Nintendo motifs such as the music of the castle of Mario 64 or that of the first level of Donkey Kong Country on Snes! Among all the positive sides, and they are really many, only one thing is out of place in the game: longevity. With only seven worlds and nine levels each, the experience doesn't last too long. The huge amount of material contained in the first episode is somewhat missing, which was perhaps too hypertrophic ... This lack is compensated, but only in part, by the possibility and the desire to collect all the gold stars linked to the score and above all, the splendid level editor. This could truly be considered a game within a game. Even the most refractory to creation are captured by the immediacy and the possibility of creating a series of crazy passages to be experimented promptly. Via wi-fi Connection, then, you can transfer these levels to your friends in order to challenge each other in tests to the last score! For the second time we are faced with a small masterpiece of inventiveness and game design. A game perhaps not for all palates and which perhaps will make those who grew up with FPS turn up their noses, but which really everyone should try at least once to understand a little more about the essence of a video game. Demanding the right, this time not frustrating, it has the defect of being perhaps slightly too linear and of not changing the structure as the predecessor had done with the ~more~ worlds or with the division of the level in two. But it is a venial sin and counterbalanced by greater accessibility and immediacy which in this case do not hurt. However, what is not completely appeased is the hunger for levels. It is undoubtedly a bit short and a few more puzzles, let's say a couple of worlds, would have made it perfect. The most striking thing, however, is the incredible union that is generated between the hardware of the DS and this title, it truly seems that the machine has been conceived around the game and not vice versa, and this is something that only Nintendo of the highest levels it manages to achieve. Do yourself a favor: find and play both titles in the Mario Vs Donkey Kong saga! Pros Extremely neat and captivating Lots of different ideas Captivating technical realization Cons Too bad it's so short... ...the level editor is not enough A bit too monotonous It seems almost unbelievable that, in times of console wars and hair-breaking forums, a small pearl of ludo-enjoyment like Mario Vs Donkey Kong has almost fallen by the wayside. Certainly Nintendo itself does not seem to push much on this series, giving the product a secondary image and a little game, but it is surprising that no threads of topic have been opened in which to discuss the subtleties of the design of certain levels or the high difficulty of some passages .", "date": "2007-03-22", "grade": null}