{"name": "Rainbow Six: Raven Shield - Multiplayer Focus", "ref": "https://multiplayer.it/recensioni/rainbow-six-raven-shield-multiplayer-focus.html", "text": "Grenades, what a passion! Grenades give great flexibility during a mission, thanks to their destructive or tactical action, they serve to manage different types of strategies. Grenades are divided into: Fragmentation, the destructive version, detonate after a short time destroying everything and everyone in the vicinity. Also useful for breaking down doors or creating a barrage. Blinding, useful for distracting, confusing and blinding anyone nearby. If you are hit by this ~flash~ of light, you will hear a very loud whistle and you will be blinded for a few seconds. Smoke, they emit a vast blanket of thick grayish smoke, useful for concealing the movements of the various squads. Thermal detectors are able to see through it. Tear Gas, they release a cloud of toxic gas that causes coughing and blurry vision, useful for confusion but also for hearing an enemy approaching. Let's take the field: what game are we playing? In order to enjoy Raven Shield in multiplayer mode, you will first need to create an account on Ubi.com. A special section has been created on this site where the various rankings and other useful information such as player profiles and their nationality are displayed and updated. After ~Login~, therefore, you will enter the multiplayer screen which will be divided into three areas: the list of available servers, the main buttons and the information area. The game features 6 multiplayer modes, divided according to the type of game. The type of competitive game includes: ~Hostage~: typical mode where a team will protect the hostages, the opposing team will have the task of rescuing them and taking them to a recovery location. ~Survival~: Do you have the old DeathMatch in mind? Very similar mode where each player, being placed on a map together with others, will have to try to survive using any means ... remember the campers? (For the less experienced: all those who always lurk in the same place on the map and wait with arms ... ~open~ for the enemy, N.d.Matt) are called with this ~nice~ appellative. ~Team Survival~: Same as Survival mode, except you play in teams, very similar to Team Deathmatches. ~Bomb~: curious mode where one team will have the task of activating and detonating a bomb located around the map, the other will have to defend it at all costs and, if activated, try to disarm it. ~Pilot~: interesting mode where a team will have to escort a pilot to a recovery area, the curious thing is that the pilot is played by a player of the same team chosen at random, the other team will have to kill the pilot before the recovery . In addition to the competitive missions there are also the classic cooperative missions: ~Hunt Terrorists~, a mode similar to the single player LoneWolf, where you will enter a map to clean it of all the terrorists present, in this case helped by human allies. ~Hostage Rescue~: Similar to Terrorist Hunting with the only difference being that you also have to rescue hostages and escort them to a recovery area. Weapons! The most important choice to make is the type of weapon to be used on a mission, a surgical choice. The game features a huge range of weapons, ranging in power, reliability and other characteristics. Primary weapons, ranging from assault rifles to machine guns and secondary weapons, such as pistols and automatic pistols. The choice depends on your preferences, each weapon has specific characteristics depending on the distance, damage, accuracy, stability and shooting. Logically, you won't be able to have powerful and extremely stable weapons, to give you an example: do you need a good shooting distance? The M82A1 sniper rifle will suit you, despite having zero stability and shooting. Or the power of an Ak-47, power without control. Personally I opted for an average gun, with good stability and power, the legendary FAMA5 G-2. Each weapon has its own firing frequency (FS), if the frequency is set to five, the weapon is fully automatic, if set to three (available on some models) the weapon will fire in small bursts of 3 rounds, if set to one, the weapon will fire a single shot at a time. Live from the field.. When you have chosen the server to play on, a window will open describing the type of game in progress. You will have to choose which team to play on, between green and red, and then wait for the end of the round and finally be able to take action. While waiting you will have to equipOnce you are there, you will have four pieces of equipment at your disposal: primary weapon, secondary weapon, item 1 and item 2. The weapons are fully customizable through the use of various accessories: the mini-scope, a simple zoom tool that increases view up to 3.5X. The sound suppressor, if you choose this accessory you will automatically use subsonic ammunition, this ammunition has less range and power than standard bullets. The high-capacity magazine, which greatly increases the number of rounds held in a magazine, resulting in less frequent reloads. However, the weight gain from the extra ammo slows down the reticle's cooldown. The thermal detector, usable only by sniper rifles, allows you to see the thermal signature through walls and other obstacles up to 3 meters. After choosing your weapon (please read the box opposite) you will have to choose from the numerous objects: defuse kits, electronic kits, padlock picking kits, gas masks, primary and secondary chargers. In addition to these, there are very useful accessories such as the heartbeat sensor, which will show the electrical signals emitted by heartbeats as pulsating white circles, breach charges, remote explosives, Clamore mines and all types of grenades (see box ~grenade, what a passion~). Finally, after equipping yourself, you will be able to join the chosen team and fulfill the various objectives of the mission. Each mission requires a lot of teamwork, going alone will bring nothing but certain death, each member of the team will be able to take any type of initiative, however often requiring cover or a barrage. All this makes each round really fun and rewarding, contributing to the success of a congenial plan is simply superb. Games are divided into Matches and Rounds, the match is the actual game, if one team wins the match, they have won the game. Rounds are sessions, to give you an example, it will take 10 Rounds to complete a Match, the team that wins the most rounds has won the match. If you die in a round, the ~death camera~ will activate, so you can observe the movements of your teammates while waiting for the session to end. The last words There are no doubts: the guys from Ubisoft Montreal have done an excellent job at this juncture, the multiplayer mode is almost perfect from every point of view. Certainly spans above the previous chapters and able to fight for absolute supremacy in this kind of titles. The new modes and all the innovations introduced will allow all fans of the series and not, to have fun and face each other by adopting always different strategies. Not to mention that, thanks to the Italian patch dedicated to NOCS, you will be able to stand out among all the other players in the world. Rashand multiplayer The Multiplayer mode, which was once seen as a simple accessory to the actual game, has taken on ever greater importance over time, sometimes even becoming the most loved style of play ever... Its strength lies, above all, in the possibility that is given to be able to face, get to know and challenge other thousands of players scattered around the globe: over time the multiplayer world has grown dramatically, ~clans~ have been born (groups of players united in real associations) and, as a logical consequence, various types of tournaments organized both individually and between clans are increasingly frequent (just mention the now famous Clanbase). Finally, thanks to the great diffusion of new broadband connections also in the beautiful country, now also in Italy many players will have the opportunity to face this new splendid world. What better occasion to experience the thrill, for example, together with Raven Shield?", "date": "2003-03-28", "grade": null}