{"name": "Phantasy Star Online: Episode I & II", "ref": "https://multiplayer.it/recensioni/phantasy-star-online-episode-i-ii.html", "text": "The price of freedom But let's move on to the actual game, which from the initial menu already clearly shows its division between offline and online modes. We won't unnecessarily dwell on the manifest superiority of the second over the first (already amply demonstrated by the various reviews of the original on the Dreamcast), although as far as the offline mode is concerned, this GameCube version has an apt feature, namely the possibility of facing it with other three users via double split screen. A simple but still fairly effective idea, although far from being a completely valid alternative to online gaming. This is mainly due to the necessarily limited size of the four screens (with consequent cutting of many important elements of the menus), but also because, in the multiplayer mode, the feeling of belonging to a community which is one of the greatest strengths of the game is missing. . And yes, because if it is indisputably true that PSO as a game in and of itself may or may not like it, however as a global online experience the Sonic Team title fears very few rivals. The possibility of getting to know the various users present in the lobbies, of conversing with one's fellow adventurers during battles and of giving one's most faithful allies one's guild card (a real ~virtual business card~) are just some of the elements that they elevate PSO from the rank of a simple video game to the broader concept of experience. Experience that to be experienced in its entirety, however, requires additional costs to the simple cost of the Mini-DVD. Obligatory is the purchase of the 56k modem or the Broadband Adapter (we reiterate that PSO offline version in itself has very few reasons to exist, if not as a simple system to gain experience while waiting to play online), closely followed as a priority by that of a keyboard, essential to be able to interact worthily with the other connected users. Added up to the monthly subscription costs, it is evident that the main defect of PSO is basically only one. It costs a lot. Elevation without evolution But what certainly presses GameCube users is to learn about the improvements made to the version for the Nintendo console. Let's start immediately by saying that those who have already explored the original on the Dreamcast would probably find few reasons for interest in this Episode I & II, and not enough to justify the expenses necessary to go online. The main additions of this GameCube version consist of a totally new episode (the 2), complete with new stages, weapons, objects, skins and quests and the aforementioned multiplayer mode, which can also be tackled in Challenge and Battle modes. Technically, however, the Sonic Team title has remained largely unchanged compared to its first, original release on the Dreamcast: the only improvements concern the inclusion of some graphic effects and the slightly greater definition of the textures, while very solvable problems remain such as polygonal interpenetrations and clipping. In short, although PSO Episode I & II is still visually enjoyable despite the two years of age, however a minimum of more effort on the part of Naka's men in this sense certainly would not have hurt. Even with regard to the control system, better could have been done: in this regard, the most striking example lies in the failure to exploit the C-Stick for adjusting the virtual camera, which, as in the previous ones, is not exactly flawless. Comment Phantasy Star Online Episode I & II is simply the GameCube version (slightly revised and not corrected) of the Sonic Team masterpiece born and developed on the Dreamcast. This leads to an inevitable, clear division of interest that the aforementioned product can arouse among Nintendo users: consequently, those who have not been able to experience the PSO experience on the Sega console should seriously consider buying it , while all those who have already descended on the planet Ragol will hardly be able to find great stimuli on GameCube, beyond the desire to belong to the community that has developed around the game (an element that, for many players, is of primary importance). Of course, there is no shortage of innovations compared to the original title, but they still constitute too little an element to justify the rather high expense necessary to connect to the world of PSO via Cube. Ultimately, however, PSO Episode I & II is a very important addition to the GameCube soft library, now enriched with the best rpg online available on consoles in europe. Pros: Exceptional as an online experience New levels, weapons, objects and characters compared to the original Apt multiplayer mode Virtually infinite Cons: Technical realization slightly higher than the original High price of the game + modem + keyboard + subscription package Episodic fantasies Over two years ago, a revolution began on the Dreamcast. The door was opened towards the future, towards freedom. Accompanied by similar high-sounding claims, Phantasy Star Online landed on the white Sega box, effectively representing a great step forward for online gaming on consoles, above all thanks to the large community of users it was able to gather around it. The consensus received by the Sonic Team title was fortunately so large as to avoid its death together with the Dreamcast and favor its conversion for other formats, including the GameCube. For all those who still do not know the work of Sonic Team, here is a brief description: it is an obviously online oriented action-rpg in which the player takes on the role of an adventurer in charge of revealing the secret of Ragol, a planet from which they are mysteriously all human colonizers disappeared. As is appropriate in this kind of title, great emphasis is placed on the creation of one's own character: first of all it is necessary to choose the class to which one's digital alter-ego belongs from a substantial list, delimited by the classic extremes of the strong warrior but unable to cast spells up to the weak sorcerer but endowed with great magical powers (it should be emphasized that in this GameCube version there are three new profiles that can be selected in the respective classes). In addition to this, the freedom of physical customization of your character is also remarkable: it is possible to indicate the height and tonnage at will, as well as choose the cut and color of the hair, the shape of the face and the dress through a series of models .", "date": "2003-03-26", "grade": null}