{"name": "Ape Escape 2", "ref": "https://multiplayer.it/recensioni/ape-escape-2_a.html", "text": "Run away, run away, the monkeys are back Ape Escape 2 is fundamentally similar to the two prequels, even if, wanting to be precise, in Ape Escape 2001, a title also released for PlayStation 2 more than 1 year ago, the goal was a little different: in fact, it was necessary to aspire the shorts to the primates and then throw them in a huge washing machine. With Ape Escape 2 Sony goes back to its origins and, although proposing a similar structure to the first episode, it does not fail to introduce some interesting innovations. The protagonist of the game this time is little Hikaru who, after having inadvertently ~shot~ the super-intelligence helmets outside the laboratory, finds himself having to deal with an army of primates ready to conquer the world. At the head of the revolt we find the white monkey Specter, this time intent on stealing the Lethargy Laser from the Professor, essential for easily putting humans to sleep and thus having control over the whole world. A fantastic and colorful world Unchanged from previous titles is the comic style that pervades the entire game. Already at the time of the first chapter, the settings and characters were very colorful and in full manga style, unfortunately, however, the graphics engine was not the best and it was difficult to guarantee a sufficient number of polygons on the screen. Ape Escape 2 obviously amplifies this concept and solves all the technical problems of the first episode. The graphics are very colorful (albeit not at the level of that kaleidoscope of colors that is Rayman 3), the lighting effects are well done and the textures, although sometimes not too well-finished, still contribute to giving the whole a sort of rendering very convincing pastel. The levels are decidedly vast, even if, to tell the truth, the polygonal complexity is not very high considering the latest productions on PS2, but if nothing else in this way the graphics engine manages to manage everything effortlessly. The biggest flaw of Ape Escape2, however, is the management of the camera, a problem common to the 32-bit version as well and which forces the player to constantly rearrange the shot, which often struggles to follow the character from the right angle. In some (albeit rare) cases the camera even tends to position itself completely wrong, thus preventing the player from seeing what is around him, which is certainly not pleasing when surrounded by enemies or there is little space to jump. As for the sound component, we are light years away (positively) from what was done with the previous title. This time Sony Europe got busy, choosing dubbers worthy of the name for the Italian version: professors with a Bolognese accent or protagonists with a slightly effeminate voice are therefore a sad reminder of the past. The dubbing is excellent this time, maybe sometimes the synchronism between voice and mouth isn't perfect, but it's not a big flaw considering the work as a whole. The background music is noteworthy, some of which is decidedly spot on and catchy. In search of the lost monkey Started the game you will find yourself in Natsumi's laboratory. As was the case in previous titles, in this room you will be able to access all the game options, consult data on the monkeys, train with the gadgets that the Professor will make available to you and play the mini-games. After a look around you can finally rush to capture the little monkeys. Each monkey has different characteristics, which change according to the color of the shorts worn. For example, those in red shorts are the most aggressive, while those in blue shorts run like torpedoes. Each monkey possesses three main characteristics such as alertness, aggression and speed. To these was added the satiety component, useful in case the monkeys for one reason or another were inaccessible or too restless to be approached. Just use the Bananarang (one of the gadgets available in the game) or a car disguised as a fish to attract them to you by taking advantage of their hunger and capture them so easily. In general, all monkeys will follow more complex behavioral rules than in the past, which makes the game slightly more difficult. Unlike Ape Escape, in fact, a single sword blow will not be enough to stun the primates, but it will be necessary to chase them and beat them for a long time before they fall to the ground, unless you are so skilled as to catch them with the net without fail. The control system is taken verbatim from the prequel, so ifwith the left stick you will control Hikaru, with the right one you will direct the blows of the net or sword by moving it in the chosen direction, while in the case of the slingshot it will be enough to pull the lever back and release it as you would with a real slingshot. With the hula-hop, on the other hand, it will be enough to rotate the lever in a circle to make it swirl. The four front keys correspond to the different gadgets to be used (available from a list of 11 gadgets), while for the jump you will have to use the side keys. Once the level is completed (just take a pre-established number of monkeys among all those found), you will return to Natsumi's room where you can use the tokens you have taken during the adventure. The novelty is that now the tokens are no longer used to increase lives, but to obtain prizes from a special machine. The prizes range from photos of the enemies to the artwork of the title, from mini-tales starring monkeys (all with quite disturbing endings actually) to new radio-controlled cars to be used in the game, and so on. The mini-games are still present, but this time it will not be necessary to collect the Specter Coins, but they will be given to you in the form of a prize from the machine as soon as you complete a given level. Monkey-speaking Completing the various levels will certainly not be difficult but not that easy either. The stages are divided into various sections, and if some represent mini-worlds to explore, others are quite linear. Every few levels you will have to deal with the five super monkeys that Specter will send with the aim of stopping you: at the beginning these will make you suffer a bit, but once you find their weak point it will be a walk to defeat them. Reaching the minimum number of monkeys to capture will certainly not be a problem, instead it will be more difficult to capture them all at each level, however it will be enough to arm yourself with a lot of patience to successfully complete this objective too. The twenty-one levels guarantee at least 7-8 hours of play by catching the minimum of monkeys necessary, twenty hours instead if you decide to complete the game by collecting all 300 monkeys; in addition, the mini games will give you several hours of extra fun. And once you finish the game you will also have a nice surprise. Comment Ape Escape 2 is a welcome return to the PS2 library. In general, it is not that there is a great upheaval compared to the first episode and the game structure remains basically always the same, however there is also some novelty such as to diversify the title just enough from the other episodes. The only real flaw of the game is represented by the poor management of the camera, especially considering that the 2 prequels also had the same problem: why the programmers didn't try to solve the problem definitively really appears a mystery. If we really want to be honest, the title isn't even too difficult, unless you want to collect all the monkeys scattered around the game. That said, the choice is yours. Pros: + Immediate and intuitive control system + Simple but well done graphic department + Extra fun with mini games + You will sweat a lot before catching all the monkeys Cons: - Virtual camera not always up to the situation - Difficulty all nothing but excessive -Substantially similar to the previous episodes A few years ago Sony launched a rather particular platformer on the market. This peculiarity was not due to who knows what innovative element or what else, it was simply highlighted by the bizarre control system used. In fact, for the first time the DualShock, a controller made by Sony itself, was used to its fullest extent. If the left analog stick was used to control the character as still happens today in most titles, the right one was used to use weapons and gadgets in a somewhat innovative and intuitive way. Precisely for this courageous choice, the game was unusable via the traditional joypad, so much so that it was launched bundled with the dedicated controller. That game, gentlemen, was Ape Escape.", "date": "2003-03-25", "grade": null}