{"name": "Prisoner of War", "ref": "https://multiplayer.it/recensioni/prisoner-of-war-6.html", "text": "You will sleep in that shack.... After the short introduction you will nevertheless plunge into the harsh reality of the prison camp. The first thing you'll notice is that prison life is planned out to the last detail. We start with the wake-up call at dawn for the roll call, passing through breakfast up to a couple of ~open air hours~ before lunch. Then comes dinner time, the evening roll call and finally the lights go out, from this moment anyone caught wandering around the tents of the camp must expect serious punishments. Everything in the game is marked by time, so you will soon learn that the most important thing is to pay attention to the clock. At a pre-established time, the changing of the guard takes place and the transfer of prisoners from one area to another, it is therefore essential to dedicate the very first days to learning the mechanism that drives these movements. Involving other prisoners is just as important. You can count on someone to distract the guards, while others can sell you useful items and important information. Finally you will find yourself creating a real organization that will help you carry out the escape plan. The problem is that while initially this mechanism will fascinate you in the long run it will prove to be a rigid and far from realistic brake. Any action, from the simple and quick raid on the warehouse to get some alcohol or a few cigarettes (or ~coins~ as the prisoners like to call them), up to the actual escape attempt, must be carried out in the most complete respect of the times , the waste available is very little. The hard life of the prisoner. It is very easy not to get back on schedule and risk not showing up on time for roll call, putting the ruthless guards on alert. In this unfortunate event, you will have to go through all the phases of your plan and review the times and the moves to be made. It will be easy to exclaim Well, I've been caught! No problem, I'll try the circuit again!. It is this tendency to forget (which means that your capture will only be followed by a period of a couple of days in solitary confinement) that robs Prisoner Of War of any sense of atmosphere, at the expense of such a detailed and carefully curated setting. You will never feel in real danger, at worst you will have to repeat the same story many times, refining your technique. And if there's really no way to get out of a particularly complicated situation, the easiest way will be to throw yourself on some life-buoy trick! Finally, we must report a few too many problems with the third person shot. For a game that above all requires you to be perfectly aware of what's happening around the corner, Prisoner Of War doesn't offer any particular help, as we will be constantly forced to slide the camera with the mouse (maybe after a bit of training we could even get used to); it also happened that we no longer found our character during an inspection operation with the camera, just as the Germans already smelled the prisoner on the run. In addition, the very sensitive commands will sometimes make controlling the game a little difficult, as you will be forced to avoid any position errors (in the order of centimeters) in order not to reveal your position to the guards. However despite these flaws the game has the ability to tickle the player's imagination. Let's talk about interface. We dedicate a few lines to the often fundamental aspect in this type of securities. Very often one wonders if in games like this there is some problem in controlling one's actions, as very often one ends up using dozens of keys for dozens of different actions. In Pow everything is controlled through the arrow keys, the shift, the ~c~ key (crouch, to squat), the slash, the mouse and its two keys. We will notice in the upper left corner of the screen two numbered buttons, indicators of the two mouse keys. As we approach the various objects, doors or fences to climb over, icons depicting the permitted actions will appear in their place. In this simple way you will immediately understand what degree of interactivity your character will have in the various environments and it will be easy to distrcare in the already too complex world of the prison camp. Still on the subject of the game interface, don't forget to always keep an eye on the clock that will continuously mark the life times of the field. Exceeding even a few minutes on the times established by the Nazi officials could cost you to go ahead with the action you have long planned.Credits. Despite some obvious defects, PoW still remains a breath of fresh air in the videogame landscape, which is too often saturated by titles that are based on already well-established formats. PoW can be considered a good attempt to move away from genres that are already too familiar. After all, Prisoner Of War is an original title, full of ideas to be able to elicit a few smiles and give moments of fun to those of you who want to try their hand at the arduous task of bringing Captain Stone home, to his beloved Betty (he will certainly have a beloved Betty somewhere!). Some problems with the management of the view, the somewhat complex controls and the many hours you will have to spend to learn the exact and nerve-wracking moves to be made to achieve the desired freedom ruin a little what you could have enjoyed at the time of installation if only there had been more effort in development. Sin. Fun for a few (short) moments, but not for hours. Credits. Pros Original (for once!) Intuitive and practical interface Cons Awkward visual Very, too repetitive The impossibility of getting killed in a game where you have to try to escape from a concentration camp is absolutely unreal Get the ass out of there! How many of you, watching some old war movie, have thought about how American soldiers could have escaped the clutches of the hated Nazis in this or that way. I would have gone through the window, I would have hid in the dirty laundry, I would have given up for dead and once in the pit I would have escaped on the sly and things like that. This kind of experience is reproduced by Prisoner of War, the latest born in the Codemaster house taken from the sneak-'em-up genre, a title that will soon lead us to levels of frustration and tension that are difficult to reach. As is often the case in classic ~wartime~ cinema, Lewis Stone is a proud American war hero who lives with the nagging problem of being one of many pilots who crashed their planes behind enemy lines. And as is natural in these cases, the poor pilot is soon taken prisoner. Obviously it won't be a few meters of barbed wire or a surveillance beacon operated by some incompetent ~kraut~ to curb the intrepid hero's thirst for freedom. It is clear, the plan is this: to be able to escape as soon as possible. Over the game's five chapters, each offering a certain number of objectives, Stone will find himself being transferred from prison to prison, starting with the classic low-security camp, via Stalag Luft to the infamous Colditz camp. You will soon learn to put yourself in the shoes of the friendly Captain, since you will see him land with his parachute in perfect 50s film star outfit, complete with a cowlick tamed by liters of pomade (basically Elvis' cousin) . Once in front of the Nazi officers, you will then understand how confident this bold young man feels in his abilities. Anyone in front of a wicked jailer would have responded carefully to the strict orders imposed, not our Stone, a rock in name and in fact (I love these subtle double meanings in the names of the characters).", "date": "2003-03-19", "grade": null}