{"name": "Summoner 2", "ref": "https://multiplayer.it/recensioni/summoner-4.html", "text": "With grace and valour! Let's immediately skip the few options available in the menu (Extras, Options, Credits) and jump straight into the real adventure. After witnessing a discreetly made full motion, we are catapulted directly into the battlefield. As the enemies arrive, we will be introduced to the control system and the operation of the front and side buttons. Initially we will only have the protagonist, Maia, queen of Halassar as well as reincarnation of the goddess Laharah, the one who will lead her people to salvation. Later we will also be joined by other characters, including a ruthless assassin, a martial arts expert, a powerful magician and a lethal automaton. Each character can be customized in various parameters: as with any good RPG, it is possible to assign them swords or armor that you have found or purchased from the merchants inside the imperial palace, manage their behavior in battle among 5 available, assign skill points and distribute objects recovered. These options can be managed through a convenient menu that can be called up by pressing the start button, where there is also a guide on the objectives achieved and to be completed and a practical help that explains in detail all the functions present in the game. During the exploration phases you will have a second menu available, much more practical than the previous one, in which you can select an object to use, choose which spell to cast, decide which summon to transform into, use the healing potions and so on. The game map is very vast, and offers the player the possibility of choosing which area to go to. Each level requires a certain number of missions to be completed, in addition there are some submissions, not mandatory at the end of the game, but which allow you to acquire new skills and experience points and which in any case contribute to making the title more varied and long-lived. Combat system Once on the battlefield, the combat system shows all its strengths and weaknesses. First of all, compared to the previous episode, the fights are no longer turn-based but in real time, with a consequent greater freedom of action. While you control the main character, the computer will take care of your 2 helpers, who can still be used by the player at any time by pressing the side buttons. Despite the good number of weapons available, the combo that your character will perform, whatever it is, will always and only be one, a defect that in the long run can make the fights repetitive, given that they will be faced with the sole purpose of increasing the characteristics of the group; moreover, a certain amount of tactics is not required, with the battles therefore being reduced to a continuous frontal attack. The control system does not help as it is sometimes clumsy and inaccurate, as a result it often happens that we are surrounded by multiple enemies who strike us without leaving us the opportunity to react, making us lose precious life points. More problematic is the use of spells, which due to the imprecision in the control system require a relatively long time to be sure that they will be successful. The invocation of the Summons then takes an even longer time, due to the long animation that precedes them, and it is therefore necessary to transform in time if you do not want to be attacked in the middle of an invocation. The duration of the transformation depends both on the energy bar, after which you will return to the normal state, and on a stopwatch that will mark the time of the transformation. In this case the duration of the Summon will vary according to your level of experience and that of the chosen Summon. As mentioned above, your two companions help you in the fights, or at least they try. Through the menu it is possible to manage their behavior according to whether they have to act as support, attack a specific objective, heal the party or help the protagonist. This at least on paper, because on many occasions their presence is quite useless, given that often and willingly they do not comply with the directives assigned to them: sometimes they remain motionless to take blows from the enemies, sometimes instead they do not even take part in the fight, forcing you to return on your steps to recover them. In general, the management of the two supporting actors is done in a rough way, representing a serious element of difficulty especially in the early stages of the game, a factor that will lead the player to sometimes prefer the solo action (always selectable from the menu), in the case for run out of energy and don't want to waste precious healing potions on company unworthy of being cared for. Global Realization The first Summoner made a lot of talk about itself before its release for the use of Anti Aliasing, a system that made it possible to reduce the famous ~ladders~ that afflicted the first games released for Ps2, despite this, however, the graphics sector turned out to be little cured both at the polygonal level and as effects and textures in general. The second episode is certainly superior to the previous one, however taking into account the higher quality of the currently available soft library, Summoner 2 fails to rise and emerge from the competition. The polygonal models can boast good textures, but too much the overall result is penalized by a low number of polygons; the animations then do not seem to make use of that motion capture which is now the practice in modern productions. Instead, the light effects are saved, very good especially at the time of summoning the Summons, and in general of the spells and environmental phenomena. The stages are very large, even if they are not always reproduced with the care they would require, however they are free of pop-ups, fog, frame drops and anything else that makes productions of this kind. The sound is average, while the digital speech concerns only the main characters and the cut-scenes, leaving only the dialogue window to all the other NPCs. Comment Judging Summoner 2 is certainly not an easy task: in fact, if on the one hand we have to mention the vastness of the levels, the simple but effective character management system, the good rpg component, the excellent plot and the goodness of the concept, on the other we must underline the poor AI of your ~helpers~, the lack of variety in the encounters, the mediocre technical realization and a sometimes clumsy control system. Two sides of the same coin that can make the player's judgment lean depending on how heavy he considers the defects mentioned above. In general, Summoner 2 is a good title, but it is, so to speak, ~incomplete~. The defects reported in the review do not affect the title in an excessively heavy way, however it is reasonable to think about how the game would have been if these defects had been eliminated. In general, there is not enough care with which Volition has packaged the product, and it is a pity because with a little more effort we would have found ourselves faced with an unmissable title. PROS: + Well articulated plot + Game development in a not too linear way + Good management of rpg elements + Simple but complete character management CONS: -Poor technical execution -Clumsy control system -Poor AI of your teammates -A bit repetitive encounters The adventure-rpg is one of the oldest genres that the short history of video games remembers, the examples are in fact countless, however knowing how to mix a good adventure with a role-playing game component is something that very few can do successfully. The highest peak in the genre was reached with the Zelda series, capable of always offering something new and innovative in each episode. Leaving aside this title, the rest of the soft library navigates between ups and downs, as in the case of the first Summoner, a Volition title which, despite having many original ideas, had not managed to win over the hearts of the players, perhaps also due to the poor management of the camera and a poor technical realization, despite the massive use of Anti Aliasing, a technique that was discussed a lot in the first months of life of the PS2. With Summoner 2 Volition has tried to remedy the defects of the prequel, introducing new game elements and correcting everything that had not fully convinced the players.", "date": "2003-03-04", "grade": null}