{"name": "L.A. Rush - Recensione", "ref": "https://multiplayer.it/recensioni/la-rush-recensione_a.html", "text": "Take me home, country road The pretext on which LA Rush is based is the story of a street racer robbed every last penny by a member of a rival gang, it will be up to the player to recover and increase his bank account through city races, chases with the police and hip hop music. The game, overturning the canons of the series, is structured as a real open-world like GTA: players will be given total freedom on how to recover the stolen money, choosing when and which evidence to support, in what order and if maybe just frolic around the city of angels in search of strong emotions. Los Angeles, while representing an excellent starting point for the construction of a map suitable for the creation of an open world, is represented in an approximate way, far from reality and in infinitely smaller dimensions than the real counterpart: crossing the city (starting from a end of the map and arriving at the opposite one) has been a feat for a very short time and the majesty of the representation offered by Rockstar games, for example, is not even remotely recognizable due to the total absence of pedestrians, the monotony imposed on the buildings that run along the sides of the road and the poor AI demonstrated by the other cars that normally travel the streets, all this contributes to a more artificial version of the city of Los Angeles, greatly affecting the gaming experience. As previously mentioned, within the map it will be possible to reach particular points of the city where to accept missions, compete on city circuits, try their hand at destroying advertising signs and above all proceed with the recovery of new vehicles; by accessing the map screen it will be possible to use the practical GPS to always have an eye on the useful route to reach a particular place. In order to participate in each race it will be necessary to pay a small registration fee, which will be amortized in case of final victory (the first three classified in the race will be awarded a cash prize), for each total number of races won there will also be possibility of stealing a car from your archenemy and thus increasing your fleet. The cars can be ~earned~ by taking advantage of a particular mission that will force the player to flee from three menacing black SUVs by bringing the car to safety in his own residential villa. The demolition races, on the other hand, exploit the most spectacular vein of the game, bringing it closer to products such as burnout, in fact in this test the players will have to fully exploit the ramps and nitro charges scattered around the city to make grandiose jumps capable of crumbling some special billboards. The long hand of the law The various phases of theft, destruction, driving to the limit and city race will obviously not run smoothly, in all moments of the game it will in fact be possible to be chased by one or more police cars, depending on the seriousness of one's crimes. An indicator with five stars will give the degree of danger of the driving style and will serve as a warning and self-regulation in the most delicate moments of the races: in fact, if the player lets himself be caught by the police cars, he will be stopped for a short period of time and fined a figure proportional to the crimes committed. If the control system linked to the police worked perfectly, the game would undoubtedly have a point in favor, in reality, however, it is all too easy to escape the paladins of the law, making them disfigure in ways worthy of the best chapter of ~Police Academy~ , complete with spectacular crashes, pirouettes and much more. However, the police are not the only example of poorly calibrated AI, the whole game suffers from excessive ease: in races, even driving blindfolded, you will arrive mathematically first at the finish line, stops due to a police fine do not actually give the player a temporal/monetary disadvantage who can thus afford absolutely reckless driving. In this regard, the presence of visible collisions on the bodywork of your car should be noted, but unfortunately the damages do not decrease the performance of the car and are practically absent (apart from the windows) on the cars present on the map. In addition to the Story mode, LA Rush offers little more: the stunt mode is absolutely distorted compared to its previous versions, decidedly less ~technical~ in favor of something more arcade, random and very little fun; multiplayer allows you to face one of the modes proposed by the single player and replicate it in an ad hoc version. The long hand of the law The strength of LA Rush couldbbe represented by the entire graphic sector: the engine behind the game is solid and does not lose its shots even in the most intricate situations with bursts of accidents and the visible damage on the cars is undoubtedly a welcome presence (especially for a game with collisions at order of the game); however, strong doubts remain (of taste) about the personalization of the car by West Coast Custom, a workshop made famous by the Mtv program ~Pimp my Ride~, which has the ability to transform already not very attractive cars into something perhaps too far from the concept of automobile and too close to that of a spaceship. If on the other hand the soundtrack of the game can reserve pleasant tracks, the same cannot be said of the bad dubbing that accompanies the players in the adventure. Comment PSP would have all the potential to host a good chapter in the ~Rush~ series, unfortunately it's not this one. The difficulty calibrated downwards, the monotony of the game structure and the loss of those who have always been the cornerstones of the series make this LA Rush a driving game that is unfortunately not very fun, easy and absolutely not worthy of its predecessors. Perhaps the turn the series is taking is not the correct one, but there is no shortage of time to adjust the shot. Pros: Quite long-lived Car damage display Cons: Definitely too simple Distorted compared to previous games At times monotonous and frustrating Being the sequel to a game appreciated by a good portion of gamers who are disciples of arcade-style racing, and at the same time making the big leap from home console to portable, is never easy. Then when the ~Rush~ series is involved (a brand born and loved on the digital asphalt of San Francisco and recently brought to Los Angeles) then the discussion becomes more complex due to unique and specific elements that have always been linked to these games and to which hardcore fans are most attached. This LA Rush for PSP, unfortunately it must be said at the beginning of the piece, has nothing to do with the games from which it derives, losing its identity and anonymously mixing with the ranks of racing games currently on the market. And if this first draft of an evaluation were not enough for you, the following paragraphs should better explain the concept.", "date": "2007-01-10", "grade": null}