{"name": "Platoon", "ref": "https://multiplayer.it/recensioni/platoon.html", "text": "The RTS tree is always green. The idea behind Platoon is basically very simple. As we have said, it is an RTS (a real time strategy game) and the setting chosen by the MonteCristo developers fits perfectly. In the game we will take on the role of Martin Lionsdale, a promising young man in the American army, who enlisted among the first as a volunteer for the Vietnamese campaign and was catapulted at the age of 26 into the middle of hell. The adventure that will see many of his heroes fall begins in the first days of the war, the year 1965. The hopes of the protagonist in a landslide victory of his country in enemy territory soon fade away, and the proud security turns into the realization of what it's really happening. Vietnam is an insidious country, the heat and humidity jam weapons, while at night you fight against rain and exotic animals, not to mention the ~enemy~, insidious and apparently invisible. At the start of each mission we will follow the story through the pages of Lionsdale's journal, which will keep us updated on the mission and its state of mind. Once the mission has been loaded, we will immediately find ourselves in the thick of the action. Platoon is a true military strategy game, faithful in the setting and in the reproduction of everything that characterized the conflict in Vietnam, for this it will take little to understand that it is not the usual RTS in which the units deployed in the field count for less than a shoelace, but of pawns essential for a happy conclusion of the mission. Every single component of the platoon has a precise function and losing someone on the street could represent a serious problem for the safety of the team. ~S~ for Strategy. The game setting is completely original; although the idea of RTS is already mature in the videogame panorama, in Platoon we encounter the fusion between the concept of strategy in real time, the ~stage~ fights (Baldur's Gate style) and the typical action of military-based titles such as Hidden & Dangerous or Rainbow Six. Realism is expressed at its maximum power and the result is truly remarkable. First of all, only the really visible details will be shown on the screen, shown based on the visual range of our men, so we should always arrange our forces in the field so as to cover the greater range and not be surprised by the fire of unseen enemies. The detailed composition of the map further contributes to giving a strong dose of realism to the entire game action. By moving the cursor on the screen, it is in fact possible to highlight the characteristics of the ground and of the objects that surround us, thus collecting useful information for setting up tactics. Depending on the type of vegetation or rock formations present on the field, in fact, we will be able to receive bonuses on the defense of the character and on the possibility of being hit or not. Furthermore, using the space bar we can always pause; this choice could very often be vital, as during the break we will be able to give precise orders to our characters and calmly analyze the situation. Having said that, it is easy to understand that it was not MonteCristo's intention to create a title in which haste and rash action were the masters. Each choice must be weighed as if it were gold. The weapons at our disposal are numerous, and all faithful reproductions of those used in the conflict, complete with original characteristics. We will be dealing with M14, M16, M12 (sniper) rifles, M79 grenade launchers, mortars, and LAW units. Being on the front line does not forgive anyone and for this you will soon have to learn to defend yourself with all the weapons that will be provided to you. For this reason, in particularly articulated missions you will certainly not disdain the support of heavy vehicles such as the M113 APC, on which, once you have loaded your units, you will get to know the very useful machine gun supplied with it. My heroee.... um... Although it is very important to preserve all the members of the platoon from enemy fire, the graduates will have a fundamental role to say the least. They are the real protagonists of the story, the ~heroes~ with special skills who, with their expertise in the use of weapons and the like, will be able to save their fellow soldiers in most cases. On our side we will have a sniper, a doctor, an explosives expert, a very dangerous commander unit, a gunner and a very powerful expert in heavy weapons. In addition, some of our heroes will have the opportunity to repay when necessarybitter napalm air strikes or artillery cover fires to solve the most desperate cases. Losing a single hero on the battlefield is equivalent to losing the game in Platoon, so watch what you combine! Each character has among its characteristics two bars that indicate the state of health and resistance of the soldier. Health indicates the number of wounds the character can still suffer before death, while stamina indicates how much longer the soldier can withstand the run loaded as he is with weapons to the teeth. Dropping the level of this indicator too much is equivalent to exposing the soldier to the dangers of the forest; you will not be able to move or recall an ~exhausted~ character and you will have to wait some time before having it back to its starting conditions. The historical reconstruction of the fighting style finally concludes with the use of the war strategies used by the two factions during the conflict. This must be said above all to warn you about the dangers of the jungle in which small groups of VietCong will set up treacherous ambushes for you. Let's sum up. We certainly cannot say, however, that Platoon is free from the typical little defects that always leave a bad taste in the mouth of the demanding gamer. First, it is not possible to save during a mission. While it is possible to stop the action continuously, through the use of pause, you may find it particularly annoying having to throw away long game actions for a stupid mistake. After all, however, the game requires the player to give his all to accomplish the mission and this kind of ~hardcore~ approach only increases the degree of involvement; it is without a shadow of a doubt a prudent choice made by the developers to highlight the danger of too hasty choices. However, if we consider that it is really difficult to complete the missions (due to the high level of difficulty) it can become irritating and push most people to abandon the game ahead of time. (For the record, recently, the developers, almost by popular acclaim, decided to release an Easy Patch that allows you to save during missions, N.d.Matt) Among the things to note undoubtedly stands out the graphics engine, excellent realization that allows a remarkable involvement. A positive note should also be made on the setting of the viewing angle which, although adjustable from the keyboard, is automatically managed by the computer which will try to offer the best overview every time. Zooming in you will notice the high level of quality that distinguishes Platoon from the point of view of the technical realization. Moving objects cast dynamic shadows, while as regards the creation of individual characters, it is worth remembering that more than 400 motion-capture animations have been created! For those who want something more from the title, the multiplayer mode is obviously also available, which will allow you to compare your war tactics with your friends. Pay attention to how you move as there is no pause mode in multiplayer, so the action will be more frenetic and faster (to the advantage of those who don't like particularly exhausting games). Too bad for the player interface, perhaps a little too thin and poor, decidedly out of the norm for games of its kind which indeed, very often, abound in superfluous details. We count the wounded In conclusion, we just have to note, however, how Platoon proves to be a good quality and finely crafted RTS. For those who love the genre and the historical period of the Vietnam war it is definitely a must, the same goes for lovers of military strategy and tactics and for those who loved games like H&D and would like to try something different but just as fun. For everyone else: a must see! Pros Excellent historical reconstruction, the plot is remarkable High importance to the strategy on the field Good management of the battle through the pause Cons You can't save in the mission Definitely meager interface (although effective) Some missions are really complicated to complete There was a boy, who like me... In Vietanam, as we know, the war has been over for almost thirty years. Despite this, the green jungles of the Asian country, theater of the bloodiest war ever fought by the USA after the Second World War, still evoke in the minds of many images of epic battles and above all of countless innocent victims, the result of a war that perhaps could have been avoided . Obviously such an event could not strike every stratum of the society of the time in the heart. The cinema does nothe could not be marked by this event and shortly thereafter he was literally flooded with headlines on the subject. In 1986, eleven years after the end of the conflict Oliver Stone proposed a film with very strong tones in which he denounced the insane violence that characterized the entire conflict. Today Microids offers us this RTS set in the Vietnamese jungle, to make us live a unique experience in the role of young American soldiers thrown to Vietnamese rifles.", "date": "2003-02-26", "grade": null}