{"name": "Chi Vuol Esser Milionario?", "ref": "https://multiplayer.it/recensioni/chi-vuol-esser-milionario.html", "text": "The game menu From the menu you can select some options relating to the video and volume settings. After that you will move on to the screen for choosing the number of players. There are three game modes with multiple participants: fastest finger, team play and against each other. Selecting only one player instead, the game will start immediately. Gerry Scotti's voice will accompany us throughout the game and is nice and playful as if we were really facing the TV host. Too bad that some sentences from the previous version occasionally ~jump out~ and Scotti says ~billion~ instead of ~million~, but his sympathy is so much that we can even forgive him for this, right? How the game works As for the game mechanics, it's about answering a question, choosing the right answer from the four available. A correct answer is equivalent to a sum of money up for grabs. In this way we move on to the next level, trying to reach the two intermediate goals, the one of 500 and the one of 16,000 euros. These achievements give us the certainty of winning the corresponding amount of money even if we are wrong in answering the following questions. Of course, the questions get harder and harder as we get closer to the million mark. Aid There are three hints that can be used at any point in the game: The ~50:50~, choosing which the computer will eliminate two wrong answers; ~call home~, choosing which Scotti will call one of the contestant's friends and ask him to suggest an answer, which in any case may not be the right one; and finally the last help, ~ask the audience~. In this case, a poll will be made among the audience of Who Wants to Be a Millionaire. The result is given in percentages. In theory, the higher percentage should tell us the right answer, but that's not always true. Conclusions It is a perfect videogame transposition of Gerry Scotti's TV quiz. Fun is guaranteed, both for individuals and for the whole family, as is the sensation of actually being in the Canale 5 studios, dreaming of touching the coveted one-million check. Too bad the latter is only virtual! Pros Easy and immediate. It perfectly recreates the atmosphere of the long-lived TV quiz show Against Little The second edition... what's new? The game based on the famous TV quiz presented by Gerry Scotti is back, and, like the show, has changed its name due to the change from lira to euro. But is this the only difference with the first version? Certainly not. The graphics have been improved, there are a lot more questions, the loading times are faster. In the package, in addition to the CD, you will also find a manual of about fifteen pages, where the game is explained in detail, the installation of which, moreover, is very simple. Just insert the CD, and if the autoplay function is activated, the installation screen will start and in a few seconds you will have access to the game menu.", "date": "2003-02-17", "grade": null}