{"name": "Spyro: Enter the Dragonfly", "ref": "https://multiplayer.it/recensioni/spyro-enter-the-dragonfly-2.html", "text": "The game Provided you manage not to run away for the loading times that border on delirium (5-6 minutes at the level... I thought I was facing the neo geo cd), you will find yourself in the first stage already struggling with a control system that it responds slightly later than the commands given, making even the simplest actions such as jumping and gliding a difficult task. But still it remains a minor problem compared to what will follow. Spyro, we say it right away, is a classic 3d platform that does not present any innovation whatsoever compared to the chapters on psx, indeed certain missions or side quests are absolutely identical to those of Spyro 2. The main objective is to collect dragon flies ( read stars, shine, remote controls, batteries etc etc), and to do this there will be the usual scarcely original skill tests to pass. Too bad that the slowdowns make even the resolution of the apparently easier puzzle really difficult. Imagine having to play a Mario 64 that slows down with every jump on a platform and adjust accordingly. The management of the virtual camera and collision detection are not decidedly outdone, just to maintain a certain standard. The first seems to be managed by a drunk while the second can easily be defined as one of the worst on ps2: our ferry / dragon easily crosses walls and opponents. Opponents, it should be specified immediately, who give us much less problems than on Playstation. In fact, the levels are incredibly simple to complete, given that the objectives are positioned in the Mario Sunshine way or, given the ease, in case you are unable to take them it would be better if you dedicated yourself to text adventures. Also considering that the number of locations is significantly reduced compared to the past, you can imagine how difficult it is to complete Spyro in a short time: approximately five hours. Technique If you thought that the playful aspect of the Universal title represented the worst component, get ready to think again. Evidently the programmers were mistakenly convinced that it was enough to present an excellent well-detailed polygonal model of the protagonist to make the graphics decent. There is otherwise no other logical explanation for a frame rate that at the slightest action becomes unsustainable for any player. This obviously does not mean that the technical aspect is sumptuous and the game slows down because the hardware is under load. On the contrary... the locations and polygonal models of the enemies are poorly detailed and have jaggies and bland textures like first generation titles. Without infamy and without praise the sound, with good music and discreet speech. Comment The first chapter of Spyro for Ps2 is a complete disappointment, and overall one of the worst titles available for the Sony console. The variety and fun that characterized even the least successful of the ps2 episodes appear to have totally disappeared, giving way to a platform that is not only technically mediocre with slowdowns that directly undermine playability, but also with a considerably simplified structure and levels that can be completed in the blink of an eye. There are even fairly annoying bugs, evidently escaped a far from complete beta testing, explicit testimony of how little care Universal has placed in this title. Pros Fair music Sometimes almost playable Cons Technically mediocre Presence of annoying bugs Short and easy Spyro is now a famous character in the world of video games, after the first episodes on Playstation developed by Insomniac, here is the debut on the new generation console entrusted to the hands of Universal. The handover, let's say it right away, wasn't exactly painless.", "date": "2003-02-13", "grade": null}