{"name": "Rocky", "ref": "https://multiplayer.it/recensioni/rocky-3.html", "text": "Direct, hooks or uppercuts? The game is essentially an arcade, even if reasoned, where you often have to weigh the choice of moves and create an attack strategy rather than throwing punches at random, even if the gameplay still recalls Knockout Kings by Electronic Arts with the accent placed on the attack phase, rather than on the defensive one. So, although there is the possibility of blocking or avoiding an opponent's punch, these game mechanics could have been studied better by the programmers, because they are not as effective as the attacks, from a gameplay point of view. The punches that we can throw can be of different types: jabs, directs, hooks or uppercuts. Obviously these attacks can be combined and become even more lethal. In Rocky it is also possible to train to become stronger, determined, agile, fast and resistant. It is possible to do this thanks to some mini games, for example by skipping the rope or by hitting the classic sack. These mini games can be avoided with the automatic training option, but this does not allow you to get the best results. I therefore recommend that you give it your all and above all develop strength and speed. Exhibition and Tournament The other three game modes, Training, Exhibition and Elimination Tournament, add longevity to a product that without these would be almost devoid of it, given the ease with which the story mode is finished. In fact, I believe that this could have been increased, but it is the only criticism of an otherwise very good game. In particular, the Tournament allows you to play up to 16 and in multiplayer and you can use all the boxers unlocked during the Movie Mode, which you will still have to finish in order to access this interesting multiplayer mode. There are about 20 boxers in the game (including Rocky's four famous nemeses: Apollo, Clubber, Ivan and Tommy) and each of them has two special moves available that characterize him. These super punches are truly devastating and can knock out any opponent in one blow. Furthermore, the boxers to be faced fight with good artificial intelligence, managing the time available to them and tackling tiredness and critical situations with criteria. Graphics and sound Graphically speaking Rocky is done very well. We are not at the levels of Halo or DOA3, but every now and then we notice some truly discreet details, including the bruises and wounds that become more serious during the fight (rendered, I must say, in an excellent way), the crowd of spectators who attend the clashes, which is completely in 3d, and the environments reproduced realistically. The audio is no different. The soundtrack is of course the original one and the effects are of quality. The dubbing is sometimes not convincing. Some voices sound natural, some not so much so, overall, it's okay, but it doesn't shine in quality. The only sore point is that songs such as Eye of the Tiger and Burning Heart, unforgettable by fans of the film series and audio icons of a legend, have not been included in the soundtrack. COMMENT Rocky is an excellent boxing game, arcade but not too much, simple but not too much. The game closely follows the film series and throws you into the action of the famous films. The introductory animations for encounters are particularly exciting, and the encounters themselves are even more so. All in all, Rocky is a great game, especially for fans of the Italian stallion, but I'm sure it won't displease anyone who wants to punch boxing gloves while having fun and thinking about the moves at the same time. Pros: Immediate and fun Recreate the atmosphere of the movies Good technical realization Cons: The game could be longer Ubisoft and Rage software bring back the story of the Italian stallion, the heavyweight champion Rocky Balboa, on Xbox. Who among us does not remember the famous film series with the Italian-American boxer played by Sylvester Stallone and his rise to success from squalid gyms to the most important world arenas? The game has several modes, Film, Exhibition, Elimination Tournament and Training, the most important of which is certainly the first, through which we can relive the stages of Rocky's career, from the first film to the last, fighting against different boxers to find ourselves then, at the end of each of the five sections, a ~hard nut~ of those already faced by the champion on the big screen: Apollo Creed (first and second film), Clubber Lang, Ivan Drago, and Tommy Gunn. Although iunknown boxers that you will have to face, from the point of view of detail, are not up to the four fearsome opponents that I have now listed, when you find yourself in front of them, the sensation of being right there, reliving Rocky's films, is very strong. In fact, one of the fundamental problems of licensed games is that they generally fail to do justice to the cinematic subject from which they draw the background. In Rocky, however, Rage did a great job and we can't help but be fascinated by this boxing game.", "date": "2003-02-10", "grade": null}