{"name": "The Invincible Iron Man", "ref": "https://multiplayer.it/recensioni/the-invincible-iron-man.html", "text": "From character to videogame Iron Man was born in 1963 at the hands of Stan Lee and Don Heck. This is the first superhero without powers... as he acquires superhuman abilities only thanks to an armor, initially created to keep him alive after a fragment of a mine was stuck near his heart. The character has undergone numerous metamorphoses over the years and has faced all kinds of problems (from heart failure to alcoholism, from paraplegia to financial failure). One of the most interesting sagas of the comic, however, remains ~The war of the armor~, which sees Iron Man realizing that the technology used for his armor has been stolen and used by numerous criminals. It is probably this series of stories that inspired the developers of The Invincible Iron Man for GameBoy Advance. In fact, in the introduction of the game, we see Tony Stark who wakes up due to an alarm and discovers that one of his armors has been stolen. Wearing a ~spare suit~, he sets off in pursuit of the thieves... The armor, the powers, the game The character controlled by the player is, of course, Iron Man. Thanks to the keys of the GBA, we can jump (even in double mode, using the thrusters of the armor), fire with the repulsor beams (by holding down the key, you can load a discharge more powerful than normal) and perform a forward dash that can also be offensive. The combination of the double jump and the shot (feasible in the air) allows Iron Man to reach otherwise inaccessible places, where various kinds of bonuses can be found (lives, momentary invulnerability, charge for repulsors or vital energy). Iron Man's fundamental attack is represented by the repulsor rays, in this case quick to use even if not very powerful (to knock out the toughest enemies, it will take six shots). It is very strange that the developers have not included any type of physical attack (a punch, a kick, etc.) in addition to the sprint, which in the end is reduced to a shoulder but is not very comfortable to perform and exposes us to numerous risks (physical contact with enemies). Repulsor beams can also be fired in bursts, provided that the appropriate energy bar is full. It is possible to consume it faster than normal by performing the ~charge~ attack, while to fill it up it is necessary to wait some time or collect the appropriate energy bonuses. Finally, by collecting some particular spheres, Iron Man can launch special attacks. With a single sphere, he is capable of firing a very powerful pectoral beam; on two, it releases a burst of energy that annihilates any enemies on screen. Final judgement The Invincible Iron Man is a classic platformer, which boasts a good level of technical realization and immediate playability, which also appeals to those who have never known the superhero in steel armor. The main sprite is well drawn and animated, the enemies are quite varied but the levels are graphically a bit monotonous. The level of challenge is not very high, and completing the levels of the game will not be an impossible task. Especially since the final bosses are limited to two: Blizzard and Crimson Dynamo. Replayability is encouraged by the presence of an image gallery, which is completed only when you complete the levels 100%. Marvel superhero fans will perhaps be disappointed by the overall ~poverty~ of this product, which sees the presence of only two super-villains and a plot that is perhaps too simplistic. It's still a good thing that the first Iron Man game isn't a mediocre product... Pros: Technically sound Fairly fun Cons: A bit short Simple enough to complete Monotonous environments Tony Stark, Iron Man Although in my youth I approached Marvel comics thanks to the classic Spider-Man (with the best stories, those of the trio Stan Lee - Gil Kane - John Romita), I have always considered Iron Man as my favorite superhero. He has never been very popular in Italy, although Rai has recently broadcast an animated series dedicated to him. Not to mention the comic, which at the moment does not appear on newsstands in our country due to Marvel's painful management of the character, which has inevitably decreed a drop in sales. Who knows, maybe a future film will fix things (as is about to happen with Daredevil) and give credit to the invincible warrior in red-gold armor.", "date": "2003-02-03", "grade": null}