{"name": "Steambot Chronicles - Recensione", "ref": "https://multiplayer.it/recensioni/steambot-chronicles-recensione.html", "text": "The sandbox Steambot Chronicles makes absolute freedom of action one of its main cornerstones. Right from the start, the game will put you in front of choices that will influence the course of the entire adventure. Although seemingly futile, the questions you will be asked during the tutorial phases will affect many important aspects of the main character and future events. And here we need to open a small parenthesis: Steambot Chronicles is a very interesting game, as we will see together later, mainly due to its particular gameplay called ~sandbox~, which allows the gamer to do what he wants without any limitation whatsoever. This means that every time a certain action is taken, the events of the story undergo changes in one direction rather than another. In this way, every time the Irem title is replayed, it can change in certain aspects if you make other choices in key moments compared to the first time you played it. Brilliant. So, returning to the initial speech, in the tutorial phases if you answer the four questions that will be asked in one way rather than the other, you will be able to determine aspects such as, for example, the final scene or the moment of the day in which, performing on the street , you will earn more money. These situations will recur later on, and it is very interesting to note how in SC it is possible to address one's interlocutor as one sees fit, obtaining different effects in people in relation to the decision taken. You can freely decide whether or not to accept to help a person who invokes your help, subsequently determining whether or not he esteems you, or annoy Connie with intrusive questions about her past and so on. In most cases both the story and the attitude of others towards you will be affected. Mini-games galore The gameplay of Steambot Chronicles is typical of a well-made action-RPG, albeit with some very interesting variations. The freedom of action we were talking about above is also found in the exploratory phase, in which situations it is possible to fully explore the areas and the possibility of dedicating yourself to one of the many mini-games present in the Irem title, without worrying about proceeding immediately in history. And below games SC is full. Among the many we point out the authentic rhythm-games, in which you will have to try your hand through a special interface in the sound of various instruments (and if you are good you can even join a band), the traditional game of chance, but with billiards, that of the taxi driver, the archaeologist on behalf of the museum or the ~arena~ mech pilot, i.e. the one who controls a trotmobile in gladatorial-style fights. In these sub-games you can obviously collect money or rare items. And with them or with the money received as a reward you can really do anything: change the Pg's clothes (in the world of SC there are several items of clothing), something immediately visible on them once worn, fuel for the Mech, pieces spare parts (our robot is customizable and repairable! But we will talk about this in detail later), food and even books full of advice or stories to read. More of everything. There are also several dungeons to explore as in traditional RPGs, therefore, as you can see, there are so many things to do in this title, for a global longevity that stands at excellent levels. Battle System The BS is another of the positive elements of the game. The fights, in real time, are in fact among the funniest and most varied seen in an action RPG. They almost always take place on board the mechs, with which it is possible to perform every type of movement imaginable. The control of the vehicle is directed by the user, initially a little complicated, it takes a bit of practice, but once you have learned the basic movement system everything becomes extremely simple. With the help of the two analog sticks of the Ps2 pad and the four back buttons, the gamer moves the vehicle making it perform an enormous series of moves such as rotating, walking, jumping, activating retro rockets with which to move quickly (so to speak) or attack with weapons using the two arms separately. We also point out the possibility of being able to grab enemies if in a close position, or an object to be thrown at opponents. It is also interesting to note how the physics that manages the movements of the PCs is very realistic even in a fictitious and fantasy context, so much so that the trotmobiles appear slow, especially in long-range attacks, giving that sense of heaviness in the actions thatit makes them believable. A very interesting aspect of SC, always with regard to Mechs, is that linked to the possibility of practically ~totally~ customizing the machine. Using a special editor, inside one of the workshops around the world, it is possible to customize the vehicle to your liking, replacing, repairing and developing all those mechanical components that allow the trotmobile to perform at certain levels: arms, arms, legs, etc. . The variety of spare parts available is considerable, therefore one must be careful in choosing the parts to purchase and assemble, taking into account one's real needs as well as the pure aesthetic aspect, and important factors such as the final weight of the vehicle, given that these will affect a lot on the speed, damage resistance and fuel consumption of the vehicle. Conclusions Steamboat Chronicles, we said it in the introductory hat, is probably one of the most pleasant surprises of the videogame season still in progress. One of those unexpected titles which, while not making you cry out for a miracle, leave the gamer pleasantly surprised who is lucky enough to ~discover~ it among the avalanche of poorly advertised secondary titles. The pleasant even if not complex plot, the overall smooth gameplay, the freedom of action and the many things to do make this title an interesting Japanese-style action-RPG, to be taken into consideration if you love the genre, perhaps between sessions and the other of the more complex Final Fantasy XII. Pros: Fun and quite varied. Apt graphics. Good depth. Cons: Lack of localization in Italian. Some slowdown too much. Anime style And if you still want to give an original touch to the Mech, you can change the color of the bodywork or draw your own personal symbol to be placed on a kind of decorative circular plate to be applied above it. Speaking of aesthetics, it must be said that the graphics of SC are not bad at all. Even if it does not reach the quality levels seen in other titles of the genre, much less in those jewels branded Squaresoft, the Irem product reaches a decent quality level, thanks also to the anime style that characterizes its engine. The characters enjoy a good character design embellished with a cell-shading that goes well with the subjects represented, while the backdrops and settings in general appear all in all pleasant, full of life. The discourse related to the animations is different: they are a little wooden, and not only in the secondary PCs. Furthermore, there is some slowdown to be recorded in the more chaotic phases of the game, especially in the fights. On the other hand, the audio sector presents music suitable for the context, even if not excellent, a well-made English dubbing (the voices and their ~acting~ are beautiful). Finally, there is the 60Hz selector. Probably to many of our readers, at least the younger ones, the name Irem will mean practically nothing, but to the more ~senior~ among them, reading it, one of the legendary titles in the history of videogames will immediately come to mind: R- Type. The production company mentioned above is in fact the one who conceived that absolute masterpiece of a couple of videogame generations ago, when 2D was the host. After ups and downs, especially on the Asian market, the Japanese softo is trying to make a comeback with this anomalous RPG, Steambot Chronicles, which seems to have all it takes to reveal itself as one of the pleasant surprises of this season. The game has a setting that in some ways can recall the Wild Arms series. We are towards the end of the 1800s in a sort of ~alternative~ world to ours in which cowboys, pirates and Mechs live in the same universe. A boy named Vanilla works as a cabin boy on board a ship whose captain, a woman, takes a liking to him after initially discovering him as a clandestine on board, as well as giving him, in fact, a ~job~, teaches him to drive a trotmobile, a strange bipedal steam robot that in this reality is used to do heavy work, as a means of transport or ~gladiator~ in arenas. One day, due to a mysterious event, our Vanilla wakes up shipwrecked on Seagull Beach right next to one of these vehicles, with almost no memory of what happened to him. Rescued by a beautiful girl named Connie, leader of the Globe Trotters musical group, the young man will soon be involved in an interesting and varied adventure, which is up to you, playing, living.", "date": "2007-03-22", "grade": null}