{"name": "Worms Blast", "ref": "https://multiplayer.it/recensioni/worms-blast_c.html", "text": "Come fish with us, we miss the worm! You don't expect a puzzle game to have an articulated plot, right? In fact, neither the booklet nor the game present us with any goal to achieve, other than to move along a map to take home a chest full of pennies once we arrive on treasure island, facing the most varied challenges. All that remains is to select one of the fun characters, get on the boat and sail the length and breadth of the ocean, making your way through the colored spheres that fill each level to reach the goal. In each stage, to get rid of the colored balls the mechanism is very simple: a cannon is mounted on our tub capable of firing projectiles of different colors, to be matched with that of the spheres in order to make a clean sweep on the screen. To aim and hit the objects above us it will be necessary to move our boat, adjust the angle of the viewfinder and the firepower: initially it will take a lot of practice to hit with precision, and a good eye to predict the trajectory of each missile will be a fundamental requirement to continue in the game, given that we will not have to limit ourselves to emptying the screen ... In fact, most of the stages do not have the only objective, unlike many other puzzle games, to clear the screen from the balls colored: after having cleared the way with cannon fire, it will often be necessary to hit a target, recover an object or eliminate a particular colored block. By completing a level, the map will allow us to direct the ship to different points, allowing everyone to build their own path up to the coveted chest. Rambo is a weakling As far as the technical implementation is concerned, the main problem of this game is the physical limits of the GBA itself, above all due to the small size of the screen: the graphics are in fact simple, clean and colorful as a puzzle game requires, and with well-designed backdrops. Unfortunately, however, on such a small viewer it is not easy to correctly interpret some colors that are too similar and sometimes you find yourself shooting at the wrong target. Speaking instead of the sound, there isn't much to say: it does its duty through some very ~Caribbean~ tunes and a few sound effects, but nothing more. Other game modes available, in addition to the adventure along the map, include the possibility of trying your hand at skill tests, as well as challenging the computer in the most classic of VS: a pity that unlike you, you don't miss even one shot... But the real drawback of this puzzle lies precisely in the character control and aiming system: having to control the position of the boat, the viewfinder and the firepower at the same time, finding the correct trajectory of the projectile is certainly not easy, especially for some levels in where shooting accuracy is essential. If we add to this that, unlike the Gamecube version, the reduced screen of the GBA certainly does not help to correctly evaluate distances, you understand that completing each level in the few seconds available is certainly not an easy undertaking, not even for those with the well trained reflexes. Too bad, because in this way the immediacy and ease of use that has always characterized pure entertainment games such as puzzles are missing, and frustration grows to very high levels in a short time. On the other hand, a positive note comes from the multiplayer mode, in which the challenge between two friends is made even more fun by the possibility of hitting not only one's own balls, but also those of the opponent to further complicate his life: a real coward without a doubt, but fun is guaranteed. Comment In short, WB is a nice puzzle game, with likeable characters and with a fair amount of extras to unlock between hidden characters and devastating weapons, but which risks in a short time to lead the average player to frustration: thanks to this a control too cumbersome, and a maximum time to complete the levels too limited, which leaves no room for many errors. The idea of varying from the classic scheme of ~clean the whole screen~ with some secondary objectives certainly gives more depth to the game, but the risk of putting the cartridge in a corner, making it very difficult to advance in the game, is very high... Pros: Possibility to decide your own path to complete it Many levels Different challenges from the usual ~sweep the whole screen~ Cons: Control system too cumbersome Little time available to complete the levels The small screen of the GBA complicates things a lot I vermi of Team-17 for many years now appear on practically every home system, with the episodes of the strategic series but also with some spin-offs that do not always live up to the fame that has always characterized them. And Worms Blast belongs to the second category, which tries to insert the warmongering annelids in a puzzle game apparently very similar to illustrious predecessors such as Puzzle Bobble and the like. I said only apparently but...", "date": "2003-01-15", "grade": null}