{"name": "Wreckless: The Yakuza Missions", "ref": "https://multiplayer.it/recensioni/wreckless-the-yakuza-missions_a.html", "text": "Follow that car! Before starting, you have to choose the storyline you want to try your hand at. The characters and cars change, but the substance is the same: you will face different missions in sequence, in which the main objective is the destruction of an enemy vehicle or, less often, the recovery and delivery of particular objects. Secondary tasks, on the other hand, always include the destruction of a certain number of elements of the stage or the completion of the same within a certain number of minutes. The programmers have seen fit to emphasize the replayability of this title, making new vehicles available as the levels are completed, but guaranteeing access to as many bonus levels only if the victories are accompanied by adequate final evaluations. If the second idea is to be appreciated without reservations, the first unfortunately falls into the usual problem of abundance: you can choose many vehicles, it's true, but you'll probably end up always using the usual two or three. Each mission opens with a short briefing and, sometimes, with an interlude sequence characterized by just enough quality. After choosing your car, you can launch yourself into the crowded streets of Hong Kong and foil the plans of some criminals from time to time. It doesn't matter if, to do it, you have to destroy entire neighborhoods or run over dozens of people.. Race against time The various levels are distinguished by the tasks to be completed, of course, but they have in common a time limit that you will necessarily have to respect, on pain of defeat. Completing everything well in advance will earn you bonuses, but forget about succeeding on the first attempt ... The control system is extremely simple: the left analog stick is used to steer, X to accelerate, the Square and Triangle keys respectively to brake or pull the handbrake. Finally, the back buttons will allow you to fire missiles (limited and non-reloadable during missions) or to use the boost (represented in a very particular way). The gearbox is automatic (it could not be otherwise). Once you become familiar with the sensitivity of the ~steering wheel~, you will be able to control your vehicle perfectly, and perform maneuvers that require maximum precision. Given the large amount of interactable objects (read ~that it is possible to sweep away~) in the levels, the developers have seen fit to make the light poles intangible, so as not to break the rhythm of the matches abruptly (stopping and losing ground for having touched a lamppost, in fact, would not have been nice at all). The result is decidedly good: when it comes to chasing Yakuza, just pay attention to civilian vehicles (or wipe them out with a missile, perhaps) to avoid slowing down. The fact that in Hong Kong the direction of travel is the opposite of the Italian one, doesn't make things very simple at first.. Total destruction... well represented The graphics of Wreckless: The Yakuza Missions are only of decent quality, but they are handled by a really well programmed engine, which maintains fluidity and speed despite the crowding that, in many cases, you will see appearing on the screen. The settings aren't extremely rich in detail, but drawing them more precisely wouldn't have helped, in fact. On the other hand, a note of merit goes to the vehicles: well made and with attention to detail, even if they don't hold a candle to those of ~technical~ titles. There is also a small gem, represented by the DeLorean from ~Back to the Future~. The sound sector is decidedly poorer: the effects are normal, while the music performs its task without infamy or praise. The version of the game that I reviewed, available for the European market, did not contain the slightest localization: instruction booklet in English, language not selectable in the game and dialogues of the cutscenes lacking even the slightest subtitle. Comment We are not dealing with a milestone of action games, nor with a title of exceptional quality. Despite this, Wreckless often manages to do what other titles, perhaps more famous, are not capable of doing: entertain. Playing the latest Activision product will make you spend a few carefree hours, full of devastation and frenzy. The game defends itself well from a technical point of view and boasts a good longevity, thanks to the numerous missions and the presence of unlockable extra levels. A valid second choice therefore, penalized by an inevitable lack of longevity. Pros: Well tuned graphics engine Good variety of missions Good incentives for replay value Cons: Sometimes frustrating Fin trsimplistic opposite Repetitive The search for new ideas for video games often leads to revisiting old concepts. In the case of Wreckless: The Yakuza Missions, the developers of the Bunkasha team have created a revised and corrected version of the very old Chase HQ: chase a car and hit it until it stops. To work today, such a simple structure necessarily needed some brushing up. Hence the presence of dozens of different vehicles to choose from, of weapons in addition to the usual ~turbo boost~, of all too interactive settings. In short, Wreckless: The Yakuza Missions presents itself as the ~casino~ game par excellence.", "date": "2003-01-07", "grade": null}