{"name": "Recensione di FIFA 2003 - Terza parte", "ref": "https://multiplayer.it/recensioni/recensione-di-fifa-2003-terza-parte.html", "text": "Sound The Bulgarelli-Caputi couple will only be missing as a matter of habit. The bad acting has never given the two commentators the sympathy of FIFA fans. This year they have been replaced by Bruno Longhi and Giovanni Galli. The first, good but a little set on television, surprises with an excellent interpretation of the various phases of the match, while Giovanni Galli manages to be even worse than Bulgarelli. If the latter at least could make you smile for the nice Bolognese cadence that distinguished him, Galli's excessively marked Tuscan, combined with a bad acting, only makes you nervous. In any case, the software that manages the interventions is well done and responds promptly to game actions. It rarely happens to hear obvious errors (such as a deflection by a defender judged a ~goalkeeper's save~ by Bruno Longhi) and there are rare moments of emptiness. Impossible, remaining in the field of sound, not to mention the fans. A splendid side dish that dynamically outlines the game's actions, and which explodes with joy in the event of a goal by the home team or falls silent in the event of an opponent's goal, or which remains indifferent to a foul intervention by the home team and overwhelms whistle an opposing player for such a foul. Spectacular, also combined with the personalized chants that accompany the Club Championship teams. Conclusions Finally a big step forward. The cumbersomeness remains, but has become a secondary aspect. Now fiddling with the ball is child's play, shooting combines the skill and luck of precision with the tactics of effects and the game modes are sufficient for excellent longevity. I started playing FIFA 2003 nourished only by prejudiced ideas about a game that I always expected to have the same flaws. And at the beginning it's impossible not to notice them: incomplete squads, unintuitive menus, limited squad management. Also some annoying pre-rendered animations remain in the game. So the first few games didn't move me from this negative judgment, but learning to play FIFA 2003 also means discovering many hidden innovations that make the game more enjoyable. For the first time I feel like saying that a FIFA chapter is ~new~: those who have played the previous chapters will have to learn FIFA 2003 from scratch, because the approach is completely different. For the first time I feel like saying that a chapter of FIFA has made considerable progress: FIFA 2003 still carries with it many defects but this year it has shown that it knows how to grow by leaps and bounds. Finally, for the first time I feel like saying that a FIFA chapter is definitely worth trying: of course, consoles will continue to contain the best football games. But this time PCs won't be ashamed of their flagship title: FIFA 2003. PRO Stunning graphics; Greatly improved playability; Immersive sound. CONS Shabby presentation and menu; Cumbersome gameplay decreased but still persistent; gaps of various kinds. Graphics The graphics of FIFA 2003, needless to say, are spectacular. This year then the colors have clearly changed and are more ~dark~ and realistic: in short, less cartoony, even if in matches like Inter - Juventus I challenge anyone to distinguish the black and gray uniform of the referee between the players on the screen ( fortunately in many cases the referee uses the yellow uniform). As always, the graphics of the stadium are of secondary importance, given that for 90% of a match only a green field is framed. However, it is immediate to notice an audience that improves from year to year, banners of the team of the heart everywhere and a magnificent loyalty of the structures. On the other hand, the management of the cameras is not complete: a camera that can move not only laterally but also vertically is missing. For example, if you want to use a camera that can give a greater view of the playing field, such as the ~field end~, when the ball goes into the ~lower~ area, the shot does not widen but remains fixed, so that it is impossible to see which players have unmarked nearby or if an opponent is approaching us. Other cameras are too close together or are impossible to use, such as the television one, which in the visions near the goals offer an almost incomprehensible diagonal view, or that of the opponents' lateral fouls, in which one cannot act on one's own players because they are made invisible from an image that only frames the player taking the throw-in. The animation of the players is well made, even if the frenzy of the game brings the eyes more on the position of the ballthat on the real movement of the players, and certain animations are not noticed at all. However, one cannot forget that now the contrasts are better managed, with the players who dodge each other with their arms or who make perhaps excessive flights but to be enjoyed when mowed down by opponents. Framed closely (after a goal or during breaks in the game), the faces are reproduced almost perfectly, even if it happens that the polygons tend to overlap, deforming expressions and gestures.", "date": "2003-01-04", "grade": null}