{"name": "Blinx: The TimeSweeper", "ref": "https://multiplayer.it/recensioni/blinx-the-timesweeper.html", "text": "There is a big crisis The plot is simple: Blinx is an employee of the time factory, where the passage of seconds is regulated throughout the universe. Sometimes the mechanism gets jammed and from these jolts of becoming crystals are born which, if not eliminated, transform into fearsome monsters. Our felines (the factory employees of the time are all cats...) have the task of collecting them before this happens, using small shoulder vacuum cleaners. However, the Tom-Tom Gang intervenes, made up of three terrible aviator pigs, who steal the crystals from the planet B1Q64 and kidnap its princess, causing an uncontrolled proliferation of creatures and the danger of the world's time collapse. Blinx, having fallen in love with the beauty of the moment, launches himself into an attempt to resolve the crisis. To do this, he has his faithful aspirator that allows him to suck up objects scattered throughout the seabed, and then throw them back at the enemies, so as to kill them and obtain the much coveted gems. Therein lies the heart of Blinx and the innovative core around which an entire game has been built. The crystals have, in fact, different shapes. Each corresponds to a temporal power that can be activated like a button on the remote control of a virtual video recorder (Rewind, Forward, Pause, Record and Slow Motion), which allows Blinx to manipulate the passage of time at will. The most spectacular is undoubtedly the Record, which allows you to record a short game sequence and repeat it immediately after with a duplicate of Blinx on the screen. All this is possible thanks to the Xbox Hard Disk, which for the first time is not used as a mere data medium. All the powers of a super cat Thanks to his powers, Blinx has to go through ten worlds, divided into three stages plus an end-of-level boss and with a ten-minute time limit for each of them. By collecting gold objects, he will be able to buy new models of vacuum cleaners and increasingly trendy clothes. The animations of the feline are well done, as well as its maneuverability is very good. Jumping from one platform to another in the various sequences, even the most challenging ones, feels very natural and rewarding. What is not convincing is the balance of the different elements that make up the gameplay. If, in fact, the first three worlds are a fair and fun alternation between puzzles to be solved with the temporal powers and brutal clashes with enemies, from the fourth world onwards the game radically veers in the direction of an action game where fighting takes center stage overbearingly. Where the programmers could have indulged in inventing ever more satisfying and complex ways to use their idea, perhaps due to lack of time, they have seen fit to make the continuation of the game more difficult, filling the patterns with opponents and always less objects to suck in to eliminate them. With little time available, the only way to pass a stage is to go through it as fast as possible, leaving out all the surprises and goodies with which the worlds are dotted. Not to mention that a rather questionable pointing system has been chosen. Blinx automatically orients itself in the direction of the closest enemy or interactive object, without giving you the option to switch targets. It will happen to enter a room aiming at a blob and see Blinx who turns around at the last moment, with camera movement, to hit a bomb hidden near the entrance, projecting you towards an inevitable suicide. Sometimes you want to hit a contraption to release bombs on an enemy below. However, if the monster is placed in the line of sight between you and the target, but closer than the target, there will be no more way to hit the object, because Blinx will aim directly at the monster. Add to all this the ten-minute limit and you have the idea of a game that will require you to repeat some sections dozens of times, until you discover the exact sequence of actions that will get you through them unscathed. All the subtleties, bonuses and true charm of Blinx will remain the exclusive preserve of the best and most determined players, willing to replay the same stages until they have discovered its secrets and collected the money to buy all the available upgrades. But what a beautiful hair Blinx is a very colorful and pleasant to watch game. Good chromatic choices and textures, almost always, very defined, give life to an immediately attractive world. The only note that can be moved to the graphic layout is the lack of interactivity of the backdrops. Almost completely devoid of animated or choreographic elements, they can be admired, but not rthey give the player the same feeling of an interactive cartoon, which instead belongs to Blinx and his opponents. However, it is really a very small note, Artoon has made good use of the technical capabilities of the Xbox. In addition to the already mentioned effects related to temporal powers and the use of HD, the lighting of the game should be mentioned. Each torch, fire, explosion, each gem or energy source (each with its own lens flare effect) progressively projects different lights and shadows onto Blinx, the seabed and enemies, creating some truly evocative glimpses. This comes at the expense of the frame rate set at the canonical 30fps, which presents some uncertainty in the most crowded situations, but which does not affect playability. The camera is easily and naturally adjustable with the right analogue stick and does not give rise to any particular problems, which are not to be confused with those related to the pointing system and the lack of a button that quickly returns the shot to the cat's back. The only remark to be made is the lack of a subjective view that allows for a thorough examination of the locations and the lack of the possibility of widening and narrowing the field of vision, moving the shot further or closer. The sound system is also of a good standard and is perhaps the one that most betrays the history of the programming team. Music and effects are directly reminiscent of the best Sega productions of past years and here and there you have the feeling of seeing Nights and Sonic appearing from around the first corner. COMMENT Blinx: The TimeSweeper is a product that, in our opinion, can leave you confused. Behind the veneer of a commercial game, intended for the huge public, lies a technical and, at times, very demanding title. We are certain that it will appeal to those who exalt themselves in off-limits situations, which require careful and rapid evaluations, but we also doubt that some will be frightened by some rather frustrating passages. The basic concept, absolutely innovative, is unfortunately suffocated by some questionable choices in terms of gameplay and game settings. The infinite possibilities that the crystal system of the time could have offered are barely mentioned and what remains is a game halfway between a platform and an action game, certainly fun, but not memorable. It's a shame, because, on balance, Blinx is a captivating character and the Artoon guys have been able to exploit, like no one before, some of the hardware features of the Xbox, which can make the difference in the crowded panorama of consoles of the new millennium. Blinx will be back for sure, and if Artoon fixes his shot, he'll be able to give anyone a hard time. Including plumbers and hedgehogs. Pros: One of the few platformers with a fresh idea in recent years. That alone deserves at least the Blinx test. Comic graphics and very well done. Too bad for the backdrops not always up to par. Appropriate and well-crafted music and sound effects. Longevity is great. Those who love challenges and also collect the last bonus will find bread for their teeth. Cons: After the first few levels, the Blinx concept is somewhat shelved and the feeling of an opportunity not being exploited to the full remains. The fights are demanding and the system available to deal with them is not optimal. Some might find certain game situations a little frustrating and abandon the venture. Have you ever seen a pink cat with a blue jacket, chrome boots and a vacuum cleaner in hand? If not, you've never looked at Blinx: The TimeSweeper before, and you've probably had your head in the sand for the past six months. Announced with great fanfare shortly before the last E3, Blinx is the first title of the newborn Artoon under the aegis of Microsoft. Among the founding fathers of this softco there is also the co-producer of Nights for Saturn, one of the most imaginative and visionary titles ever, and expectations for the adventures of this cute feline had skyrocketed. Blinx had presented itself well, at the Los Angeles fair it was one of the few games that tried to say something new among a thousand other action platformers. It only remained to be seen how he could say it. The result, on balance, will not fail to amuse some, but not even to discuss as many.", "date": "2003-01-03", "grade": null}