{"name": "Sonic The Hedgehog - Recensione", "ref": "https://multiplayer.it/recensioni/sonic-the-hedgehog-recensione-2.html", "text": "The blow comes trying to orient the camera which, in its own way, offers a more than remarkable challenge. Lots of meat, little fire When we are offered some freedom, the game allows us to fight against Doctor Eggman's robots, which can be eliminated rather easily by Sonic who has a guided and rather effective rotating attack. The exploratory component, allowed in certain situations to Sonic himself but whose actual protagonist is Knuckles, is limited by rather sparse and approximate maps. Sequential piers (even the forest is full of), extremely simple structures and rock ledges offer little exploration and require little skill to reach so as to sigh the breakers in which sonic splashes along logs, rails and whatnot offering at least an excellent sensation of speed, even if the chronic lack of interactivity and a camera absolutely unable to follow the protagonist are the masters. Knuckles, forced to roam the maps eliminating enemies in balloons, is the character most impressed by the impossible views that are able to automatically point to the only portion of the screen where absolutely nothing is happening. The blow comes trying to orient the camera which, in its own way, offers a more than considerable challenge, given how difficult it is to handle. Co-op enhances the exploration component of the title by adding obstacles that can be opened or removed by working together. Nothing transcendental given that most of the time it is simply a matter of finding two switches and activating them simultaneously, but, if nothing else, the exploration of the maps in this case acquires greater meaning. By dint of running, Sonic also arrives in the much-discussed next gen, a cauldron of high-definition wonders and fierce doubts about the need to renew or rediscover the playability of all those genres that do not fall under the headings FPS, RPG or simulator. What most worries the seasoned gamer is to observe that while some genres survive by recycling themselves, there are others, first of all the platform, which instead trudge conspicuously in the three dimensions, with the only exception being the immortal Mario. Yet with Sonic Adventure, beyond the imperfections, a remarkable potential had emerged that leaves fans of the supersonic hedgehog more than one regret. The holidays bring us this new chapter, advertised for a long time, which attempts to bring Sonic back into the circuit of bigwigs by expanding its structure and detaching itself from the flow of remakes and spin-offs that have characterized the last period of the historic SEGA brand. The first point of detachment is the opening movie, an intro in extremely high quality computer graphics that introduces us powerfully into the new adventures of the most loved hedgehog in the world! Lots of meat, little fire - part 2 As anticipated, the Sonic Team has tried to do things big. In fact, by completing Crisis City and defeating Silver, two more episodes dedicated to the most famous characters of the saga are unlocked. Silver, who came directly from the future to save the universe, faces the challenge using psionic or telekinetic powers, if you prefer. These abilities allow him to fly like Knuckles and to throw objects like Knuckles (what a strange coincidence) even if, in favor of Silver, the ability to teleport and the ability to paralyze enemies and project objects on the map in every direction stand out , the bullets of the opponents and the opponents themselves. This power is also used to create bridges and passages in particularly devastated areas or to reach areas otherwise too distant. an adrenaline-pumped Sonic who can shoot even from a distance Lots of meat, little fire - part 2 The third path follows in the footsteps of the now famous Shadow who returns as the mysterious centaur. The enigmatic bully, which in terms of gameplay translates into an adrenaline-pumping Sonic capable of shooting even from a distance, makes his way using vehicles of all sorts, very similar to how he did in Shadow Of The Hedgehog. Also in this case the controlled grinding of tracks of all kinds is very popular and the combat, if possible, offers even less challenge. The parts aboard vehicles, on the other hand, gain something like graphic impact but the shooter component, the vehicles can in fact fire at will, is chaotic and almost completely lacks tactics. In essence, it is a question of moving forward by hitting the series of rings by shooting everything that moves, or of running along short stretches in an elderly arcade racing style. Luckily there is rock The starting town is a set of cubes, of texturIt is of low quality and is an example of poor design. Luckily the game itself is quite different and when Sonic is launched in pursuit of Eggman the surrounding world fades and magically becomes more pleasant. Even in the classic sessions, in short, those reminiscent of Sonic Adventure, situations occur in which the screen is populated by a fair number of objects. What's more, some enemy models aren't bad, especially in the case of robots and bosses, but everything is immersed in a meager world and absolutely far from the possibilities offered by the latest generation machines, and when the race stops the overall effect is extremely disappointing. Fortunately Sonic maintains a respectable soundtrack centered on the everlasting rock guitar played at high speed and extremely suitable for a title that focuses entirely on the sensation of speed. Comment The attempt to bring Sonic back to the Olympus of the colossal has failed. The system is certainly massive and offers three theoretically different story modes, vehicles and powers that can significantly vary gameplay. But the different abilities ultimately resemble each other, the vehicles race with the fastest character in the history of the video game and the design of the maps does not improve things. Where Sonic sinks, unfortunately, is in the bugs and simplicity of the game that becomes difficult only because of the problematic camera or collisions. Fortunately, a few flashes and a few pirouettes give the feeling that a bit of Sonic is still alive, but this may be enough for a die-hard fan of the series or for those who crave a bit of a healthy sensation of speed, whatever the cost. Pros: three stories and cooperative audio and cinematic quality Cons: various bugs and awkward camera surface design limited playability Goals 360 Many achievements don't just increase our gamepoints but unlock secret endings and special modes. A positive note concerns the city missions which, if nothing else, give away a good amount of points once completed. Obviously the bulk of the points is obtained by completing the three parts of the single player campaign and the secret ending itself. Lots of meat, little fire It starts from a small town that recalls, from afar, the Delfinia of Super Mario Sunshine, the place from which all Sonic's adventures start and where a series of quests and characters introduce us to the plot and obtaining the objects necessary to face certain challenges. Unfortunately the dull design of the town, the characters and the disarming simplicity of the side quests are not a great business card. In any case, once you reach the first portal, the actual game begins and you finally start running. Some parts are reminiscent of the aforementioned Sonic Adventure and the action is quite lively although almost totally guided. Ramps, catapults, animals and explosions are not lacking, but everything has more the flavor of a quick time event, or a gameplay based on simply pressing the right button at the right time, and deviates rather radically from the concept of freedom of the platform and especially the original Sonic.", "date": "2007-01-03", "grade": null}