{"name": "Castleween", "ref": "https://multiplayer.it/recensioni/castleween.html", "text": "Trick or treat? That is, ~Trick or Treat~? Well, Castleween certainly isn't too sweet, or even a joke, even if it sometimes feels like it. It is in fact a very linear platform, conceptually reminiscent of the very first Crash Bandicoot and its zillion clones (especially the most successful, Donald Duck: Operation Duck): the adventure is divided into a series of levels (interspersed with sporadic bosses), which they will have to be crossed simply by following a sort of pre-established path, from which it is impossible to deviate, seasoned with enemies, fixed or mobile platforms, chasms to jump, traps to avoid and so on .. therefore nothing new for the genre. Along the way it is possible to collect magic crystals which guarantee the possibility of changing the character in use (Greg or Alicia) and of launching the relative magical power by recovering the appropriate icon: Greg, for example, can become immune to fire, while Alicia can freeze water. The usefulness of these spells is questionable given that the presence of outbreaks or rivers, however frequent, however takes a back seat: in short, the fantastic powers of the two children add absolutely nothing to the already flat gameplay. In any case, the two brave children do not only have their jumping skills at their disposal, given that to put their enemies to flight (skeletons, imps and little monsters of all sorts) Greg can twirl his pitchfork while Alicia can use her hat to throwing point... except that, since there is no lock-on system, the shots are strictly empty and you also have to get too close to the enemy, risking being hit. Fortunately, some prodigious fairies scattered throughout the levels will be able to absorb the blows in our place, at least until, once this protection is also exhausted, we decide to suspend due to frustration. Alicia in Wonderland At first glance, Castleween doesn't look bad at all: the three-dimensional engine brings to our attention some well-modeled and fairly texturized polygonal structures, however not of excellent quality. The problem is felt when all this starts to move: for starters the camera that follows the action constantly hiccups, causing insane psychotic attacks in the player who tries to keep an eye on his alter-ego; then, it is impossible to justify how this amount of polygons (certainly not above average) manages to trigger the graphics engine so frighteningly. The general style of the design is a macabre tending to deformed, with unfortunately mediocre results, which are combined with a questionable taste as regards the chromatic choices and the settings in general (monotonous, not very varied and decidedly subdued); on the other hand, each moving polygonal entity is animated in a more than discreet way, but we are far from even the fluctuating quality of the last (mediocre) Spyro the Dragon. The sound aspect is the one that disappoints the most: the music is anonymous and monotonous, and even invites you to turn off the audio to make room for the much more welcome notes of the last CD inserted in our stereo. Even the dubbing is questionable: the spoken sequences are well made, recited (and subtitled) in excellent Italian... a pity that they are very few, given that for most of the time we will be ~hearing~ the incomprehensible verses of a hateful imp who guides the two unfortunate protagonists of the game, guilty only of having celebrated Halloween with a little too much emphasis and now condemned to live this terrible adventure. Comment Castleween is a last resort for gift-hunters. Mind you, Castleween is not a very bad game, it is a light-hearted platformer for a smaller than average user, but it is equally mortified by certainly not modest graphical bugs, by a lackluster variety and concept, and by a general style that is a bit too atypical, whether intended or not. Pros: Children might like it ... perhaps Certainly the setting is original Cons: Very insufficient technical realization Poor care for the design Sometimes the camera makes it unplayable For some time now, even in Italy, the eve of All Saints has been celebrated, a Celtic tradition handed down since the era preceding the Roman colonization: the Celtic New Year, in fact, coincided with November 1st, so on October 31st we gave ourselves to revelry, exactly as we do, men of 2000, on the night of December 31st. The traditional Celtic festival, however, had a much deeper meaning than the consumerist one assumed today: the ancients, in fact, prayed to all the deities duringand the party to ensure a great new year, and according to them that night the mystical barrier that divides the world of the living from the dead fell, leaving the ghosts free to roam our plane of existence. It is bizarre that the name of this pagan holiday still originates from the Christian tradition: in fact, November 1st is All Saints Day, which in English was once equivalent to All Hallows' Day (Hallow is the archaic form of Holy / Holiness, i.e. ~holiness~), and the previous evening was called All Hallows Eve which over the centuries became today's Halloween. The title of the new Wanadoo game is clearly nothing more than a play on words, and is obviously chronologically set on Halloween night: Greg and Alicia, two children respectively dressed as a little devil and a witch, run around with their friends at search for sweets, and mysteriously manage to penetrate the world of the dead. There, however, a terrible demon steals the souls of the small group, turning each member into stone... Every member except our two heroes who, promptly, helped by some inhabitants of this bizarre afterlife, decide to save their friends, stop the evil their enemy's plans and prevent him from conquering the world of the dead.", "date": "2002-12-23", "grade": null}