{"name": "Il Regno del Fuoco", "ref": "https://multiplayer.it/recensioni/il-regno-del-fuoco.html", "text": "Presentation After inserting the game DVD into the console and after a small load, we will be catapulted into the main menu of Reign of Fire. We will have the possibility to start a new campaign, resume and continue the one previously started, enter the options menu and finally the section called ~extra material~ where we will be able to observe sequences taken from the cinematographic work and the video of the soundtrack. In this last section, in addition to the material initially present, we will have the possibility to unlock much more bonus material through the game's scoring system. Gameplay Reign of Fire is a game belonging to the action category which translates into pure action accompanied by a good dose of adrenaline, the title in question allows us to play the role of a marine in the service of Denton Van Zan and to use a wide range of military means to deal with the dragon menace. The first mission of the game is useful to practice with the control method and with the various functions of the joypad, where with the A key you perform the acceleration, with X the braking, with the left analog stick you move the crosshair (which will serve also to direct our vehicle), with the right stick you will fire the machine gun and with the left one you will use the secondary weapon. The B key is used to use the self-targeting thermal missiles which will be enabled only after having ~taken~ them during the game in the form of an icon. The playability of the title is immediately revealed, so much so that it takes just a few minutes to learn the perfect functioning of the piloted vehicle, as regards the practical difficulty of the title, I must admit that it is quite high and in some cases it will be necessary to repeat the mission more times to learn the right strategy to deal with it. There is also a practical system for awarding medals based on the percentage of success of the mission, the amount of enemies killed and the total duration of the mission. There are four medals up for grabs: bronze, silver, gold and finally platinum, each correctly completed mission will be replayable to give the user the opportunity to improve his score. Unfortunately I remember that it is not possible to save during the mission but only at the end of the latter. However, the programmers of the game have inserted a pleasant surprise by giving the player the possibility of undertaking a campaign using a dragon instead of the marines, which obviously will have to destroy the human outposts and exterminate the marine division. This campaign will only be available after completing a certain number of ~human~ missions and also in this case there are three types of medals depending on the performance encountered during the mission. However, some aspects of the game that are perhaps a little superficial deserve mention, such as for example the aiming and firing system which in my opinion is quite imprecise and as a consequence you are never sure that the shot has hit the target. Another questionable aspect is when our vehicle (jeep, armored truck, tank, etc.) is set on fire, to put out the fire you have to hit a water pipe or alternatively dive into the banks of a small lake. The problem is that if by chance you are no longer able to get out of the lake even if you are right on the shore, the mission will end showing the sinking of the vehicle. Gameplay Graphics and sound From a graphic point of view, the game is of a good level with defined textures and excellent fluidity of the graphics engine, worthy of mention is the lighting system and the fire effects which are very realistic and defined. As for the models of dragons and vehicles and human personnel, the title ensures a fair amount of detail and excellent animations. During the numerous battles the frame rate remains high without any slowdown even in situations with many armored vehicles and dragons on the screen. As for the sound aspect, the game remains on a sufficient level, I also remember that the speech is entirely in Italian as well as the commentary during the sequences that elapse between one mission and another which gradually reveal little plot elements. Conclusions The game ~The Kingdom of Fire~ proved to be a good title overall, immediate and fascinating in terms of the setting and the proposed themes, recommended unreservedly to those who have seen and appreciated the film of the same name. For all the others it is a good action title with pure action seasoned with a discreet graphic aspect and dto a complete Italian localization. The negative aspects, which are not even serious enough to preclude the game, reside in the fairly high difficulty and some aspects mentioned above (pointing and fire system). I also remember that the title offers four medals depending on the performance in the game and an alternative campaign, consequently longevity is assured. Introduction The Kingdom of Fire is a game drawn and inspired by the homonymous film released in this period in Italian cinemas. In present-day London, a boy named Quinn while visiting his mother, a construction engineer, witnesses the awakening of a huge dragon in a state of slumber for centuries in the heart of the city. After twenty years, more precisely in 2024, the earth is reduced to a pile of rubble, men are forced to live in small outposts and fight for their survival. All this is caused by the awakening of the dragon and its progeny who are now rampant across the globe with the aim of extinguishing the human race. Now an adult Quinn spends his life in the Northumberland camp located in England until the arrival of a division of marines under the command of the daredevil Denton Van Zan forces him to take action to openly face the army of dragons. The title in question will allow us to take on the role of a marine in the service of Denton Van Zan and to fight with all our might for the survival of the human species.", "date": "2002-12-15", "grade": null}