{"name": "Il Re Scorpione - La Spada di Osiride", "ref": "https://multiplayer.it/recensioni/il-re-scorpione-la-spada-di-osiride.html", "text": "Super Scorpion World The Scorpion King is a trivial collage of dozens and dozens of key elements borrowed from various platforming masterpieces, from Super Mario to Castlevania: control Mathayus in a series of multi-directional scrolling levels, shoot down enemies, defeat the boss, proceed at the next internship. A defect? Well, you wouldn't think so, since everything flows pleasantly and smoothly. Mathayus also has a decidedly useful set of skills and moves: he can jump, duck, roll, climb... in short, as per the cliche, he is definitely trained for the mission he has to face. But let's not forget Mathayus is also an expert warrior, and against enemies it is possible to draw two different weapons: a sword, slow but lethal, and a pair of curved knives, fast but less powerful. Both weapons allow the activation of an extremely destructive special shot, but which, due to the time it takes to activate, also requires a pinch of tactics in its use. That's all? No, because within the six levels (subdivided into further stages) that make up the game are scattered the parts of a powerful magic glove, which further enhances the fighting skills of the athletic Mathayus. In short, as trivial as it is varied and intriguing. Light and magic Surprisingly, with The Scorpion King we are faced with a technically well-made product, and not in front of the usual tie-in scheduled in less than five minutes, full of bugs and graphic imperfections. To begin with, the sprites are big, detailed and very well animated, especially Mathayus and the main characters, not to mention some spectacular bosses, with really interesting design. Furthermore, the chromatic choice made by the Way Forward Tech graphics. it's really spot on and graceful, and each pattern proves well thought out and a pleasure to explore. Of course, there are some more or less serious defects (the collision detection is horrendous), but all in all there is no crying scandal. Furthermore, in certain situations, there are excellent special effects of rotation and light effects, as well as decidedly inspired and realistic artwork. The sound does its duty: quite clear vocals, music taken from the film between mediocre and good, and decent sound effects. In short, technically average for a product without particular pretensions. Comment Usually, the video game editor appeals to a series of irrefutable axioms that regulate the coded universe of video games, and one of these goes something like this: ~cinema tie-ins are always horrifying~. However, there is a series of contingent circumstances, dominated by the irrational ethereal law of ~chance~, which destroy that axiom: this is the case of The Scorpion King. Impossible not to expect a disappointment, pleasant to discover you're wrong: the Universal title is a fun and smooth action platformer, which allows you to pleasantly spend some time among the Egyptian sands displayed on the Gameboy Advance display. Mind you, you have its flaws, but one could speak more of imperfections in the code than of errors desired or lazily not noticed. If you love the genre and are looking for a not too demanding title that engages you in your free time, The Scorpion King is definitely a game to try; if instead you are looking for absolutely flawless masterpieces, you just have to turn to Super Mario World and the many vintage products on which The Scorpion King lays its foundations. Pros: Excellent graphic appearance rather funny acceptable longevity Cons: lacking originality collision detection bad anachronistic password system The Scorpion King is first of all a cinematic spin-off of the series The Mummy, a bilogy, mix of action and horror, of moderate success (which among other things made the leading actor, Brendan Fraiser, famous). The so-called Scorpion King, played on the big screen by wrestling star The Rock, is a valiant leader named Mathayus who, having lost a great battle at Giza, leaves for a shame-ridden exile. Now on the threshold of death, however, the warrior makes a pact with the god of the dead, Anubis, and in exchange for his soul he obtains enormous powers. But Anubis is no fool... The Scorpion King, however, is set before the pact with Anubis: on this occasion Mathayus will have to save his beloved Cassandra from the clutches of the sorcerer Menthu and the mysterious Isis, intent on exploiting the girl's powers to reach the Scorpion Stone. Will they succeed? Well, what are you doing, then?", "date": "2002-12-06", "grade": null}