{"name": "Formula One 2002", "ref": "https://multiplayer.it/recensioni/formula-one-2002_a.html", "text": "Hot topic Although a year after the introduction of Playstation in Europe, Psygnosis (or rather, Bizzarre Creations on behalf of the developers of Wipeout and Destruction Derby) has introduced that best seller called Formula 1, destined to generate a sequel a year (as a any franchise labeled EA Sports) due to the excellent response recorded by the public and (slightly less) by the sector press, a product that is convincing from a purely technical point of view, as well as winning from a playability point of view, is not still among us poor gamers. Studio Liverpool (coincidentally, formerly Psygnosis), the software house responsible for Formula one, Sony's 4-wheel videogame brand (whose progenitor, the 2001 edition, can currently be purchased at a budget price), must have thought so presents with this second installment, which, on paper, should represent such a step forward. Should... The offer A decent quality full motion video (which will be greatly appreciated by Widescreen fanatics, seeing is believing), introduces us to this Formula One 2002, overflowing with options and game modes. Compared to its predecessor, it seems that Studio Liverpool has presented its videogame offer thinking above all of arcade game fans rather than exasperated simulation maniacs, as can be seen from the main screen, which is set to Arcade mode by default (divided into 3 subcategories: free race , head to head and, the most important of the lot, championship). The effort made to deliver to the end user a game as close as possible to the differences in skill between veterans and newbies is highlighted by the possibility of choosing the level of difficulty (3 implemented therein) and enabling (or not) a whole series of aids (absence of damage, no wear on brakes and tyres, assisted braking, among others) and rules (no fluttering flag, no infringements, no various limitations). However, for those who do not agree to choose only the single-seater and compete on the track, without practice and qualifying laps, there is a method, with the explanatory name ~simulation~, designed for those who cannot live without modifying their vehicle, who do not agree to start first without having made the dust burn to the opponents in the qualifying laps. Certainly, Studio Liverpool has created a product that suits both fans of arcade video games (or in any case, without too many pretensions), and those looking for something more elaborate than a simple routine ~choose the car, race on the circuit x , then on that y, until you win them all. The offer Unfortunately the playability, in itself more than fair (once you have learned the conformation of each track, everything becomes quite fun), is undermined by the behavior of the opposing drivers, which could be defined as halfway between ~destructionderby's~ and would-be suicide, given the tendency to throw yourself at your poor single-seater which, although in ~arcade~ mode it comes out with a small loss of speed and a half spin, in simulation mode it can cost you very dearly, even eliminating it within seconds from the start of the race, quite frustrating if a similar fate occurs after a series of laps (decided by the user in the options) well done. A greater filing to the artificial intelligences that dart fast in the videogame package set up by the former Psygnosis would have greatly benefited the (albeit) discreet gameplay. Cosmetics and audio The year of time that elapses between this Formula One 2002 and the prequel has certainly benefited Studio Liverpool, it being understood that that masterpiece known as Gran Turismo is always the highest pinnacle, under which every racing game (any console it represents ) must prostrate after obligatory (apparently) pilgrimage; the inclusion of the 50/60 hz selector is the first positive note recorded during the test, the sixty frames per second (or 50, for those who do not have a television compatible with the sixty hz mode) managed by the graphics engine, combined with an adequate scrolling speed, please the viewer, until occasional slowdowns (especially when cornering, with the external view and some close cars) magically appear on the horizon; the single-seaters are excellently made, although the bump mapping that adorns them is not in real time (Environmental, for purists), like (coincidentally) the masterpiece of Polyphony Digital. The backdrops are characterized by a small dose of flickering and draw in and (in some cases) by the poverty of the same, without counting the scourge Aliasing (now engrossed in the role of historical defect of Playstation 2). Cosmetics and audio By selecting the mode called ~spectator~, however, flaws in the graphic engine come to the surface, recognizable, during the actual game, only by a critical eye: if it is true that the mechanics enjoy a good realization, made up of an adequate number of polygons, it is also true that the hands look eerily like the paws of penguins (seeing is believing) while the arms, when extended downwards, recall the branches of secular trees; again, the definition of the textures of the buildings, trees and banners is among the lowest ever seen in the still short life of the 128 bit Sony branded while the frame rate, from sixty fps with moments in which it settles around the middle, reverses the situation , presenting an updated fluidity every thirtieth of a second, with (rare) peaks of the coveted 60 frames. There are 3 usable views: in first person with the nose of your racing car and the hands clearly visible (fairly made, however much better than Gp4, imho), in first person, but even closer (visible the front of the single-seater and the very useful rear-view mirrors), as well as the classic external view, although it would have been necessary to insert a second external one with a point of view further from the edge of the screen (Virtua Racing docet). Cosmetics and audio In a nutshell, a contrasting cosmetic: between engine huffs, cars that break down, some well-implemented reflexes and a decidedly marked sensation of speed (without forgetting the 50/60 hz selector, increasingly implemented, finally), it is not a little sad to see a patina of Aliasing cover the tracks, the polygonal complexity of the cars that changes with unusual speed and slowdowns that are not found when, for example, with the view pointed behind us, a good dozen opponents are chasing our alter ego made of textures and polygons (obviously leaving out the aforementioned mode for new spectators which greatly degrades the visual evaluation of Formula One 2002). The creation of the sound side of Formula One, 2002 edition, seems to have been affected by a greater commitment, starting with the pertinent chronicle of our deeds, by the legendary Andrea De Adamich, as well as Claudia Peroni, continuing with the excellent and realistic sound effects (the rowdy public, the cars going broom broom, the communications of the mechanics from the garage, eager to disassemble your vehicle), diminishing however on the musical side, where techno music of a more than discreet workmanship does not fit well with a Formula 1 race . Comment Formula One 2002 is not the masterpiece of the genre that was eagerly awaited to fill a void that has been created for too many years. Graphically convincing but with some flaws too easily avoidable with a few extra months of programming, certainly, with a well-implemented audio section (apart from little theme music) and an eye for the gamer who wants a Formula 1 racing game not too difficult and closer to the good old arcades, Formula One 2002 is a purchase to be considered only if you absolutely want to emulate the (fantastic) feats of Schummy and Barrichello. It still remains the best exponent of the genre for Playstation 2, albeit of only fair quality. Pros: Designed for those who love arcades and for those who want a simulation Graphic-sound realization in some ways very good ...... Cons: ... but for others not without criticism, some easily avoidable Fair playability We recall, in closing the review, that Also this year, the package contains a second DVD, with exclusive interviews and films, referring to the past season, while the DVD hosting the game contains some extras to be unlocked by continuing to play. Hot topic There are videogame types overflowing with masterpieces, others with few prominent exponents, but very few are those where almost all of the videogame production wanders in general mediocrity; to want to make sense of this intro, one could (with ill-concealed ease) open a disquisition, stating that fighting game fanatics can amuse themselves with masterpieces such as Tekken 4, Capcom Vs Snk 2 and Virtua Fighter 4, lovers of role-playing games ( with turn-based or real-time fights) get excited with the famous Final Fantasy and Zelda sagas while racing enthusiasts lose their heads with the various Gran Turismo (and related Concept ~expansion~), Burnout, Colin Mc Rae Rally and company Pretty. The fans of Schumacher, Fisichella, Barrichello and the entire F1 circus, however, are dry from a realown killer application in the (sub) sector of ~formulaunistic~ racing games for years and years.", "date": "2002-12-02", "grade": null}