{"name": "Mechwarrior 4 Mercenaries", "ref": "https://multiplayer.it/recensioni/mechwarrior-4-mercenaries.html", "text": "Eva-01 Liftoff Unit! Um... okay, maybe I got a little carried away. Alas it's not about the robots of the rising sun that we're talking about today, so otaku to all nanna. We are not dealing with giant evil-looking humanoids piloted by mentally ill kids or megalomaniac scientists with absurd projects on the fate of the world. Mercenaries, on the other hand, throws us into the spartan cockpit of bipedal military machines commonly referred to as 'mechs': they don't necessarily have a pretty appearance or bright colors, they don't save the earth and they don't have a grimacing face like the Daitarn III. They are simply large metal poultry hunks whose sturdy piston legs mount a rotating torso with cockpit and various offensive weapons. The purpose ? Well easy to imagine: making war, above all making a difference in war by merging the versatility of a vehicle capable of walking with the firepower of tanks (no, Gundam has nothing to do with it! Eddaje...). Just to give some space-time coordinates, let's say briefly that we are in the hypothetical future (but okay?) that awaits mankind, a future of exploration of the cosmos, of expansion, of growing development, but also of conflicts on a much larger scale of those that man has known until now. It goes without saying that with the advent of new technologies - we are around 3060 or so - new, lethal weapons have become available to draw on for the activity in which men seem to excel since the dawn of time: fighting. And in the midst of a bloody war between the Federal Commonwealth and the Lyran Alliance here are the opportunities to employ the lethal Mechs. Therefore, your newly formed team of skilled pilots has the perfect opportunity to occupy the place made available by the federation of mercenaries, provided that they find sponsorship from one of the four large existing companies. By signing up for one of these you can start your business. The various episodes of Mechwarrior have shown the different aspects of the introduction of mechs in the common arsenal of the most disparate powers, and I'm not going to recall the history of the previous chapters, also because Mercenaries is a stand-alone product that stands out from the ~series regular~. You will find yourself operating in one of the four most famous and dangerous 'corporations' of mercenaries of the Inner Sphere (you choose which one) and you will command a team of your own in dangerous missions for the hard credits offered by the various employers. For the series ~it's a dirty job, but someone has to do it~, your aim will therefore not be to win your clan or your faction in an ideological or political war, as in the main vein of Mechwarrior, but the vile money that you will earn with gritted teeth. Nice that! Commander, will you buy it for me? ~Excuse me, can you show me the one over there? How much does it cost ? Eight million C-bills ? Mmmm, too expensive don't you happen to have a used one? A semi-annual mech? Nothing ? Sin. Until we meet again~. A fundamental part of your position as leader of the mercenary team that you will choose lies in knowing how to manage the latter with skill and prudence. Each mission has its precise specifications and it is vital for success to carefully select the elements, both human and mechanical, to be involved in the action. In the ~Free Market~ section of your mission interface you can scroll through what the market offers at a given time: contract pilots looking for engagement, armaments available from smugglers, Mechs for sale to the highest bidder. Replenishing the ranks of your team, equipping your robots with more sophisticated weapons or expanding the stable with new models will prove to be a difficult undertaking, which will always make you collide with the fiercest enemy: your wallet. There are many mechs available, some old acquaintances that we remember from the first Mechwarrior - such as the Mad Cat - and a large number of new models; the entire range can be divided into four categories: light mechs, suitable for exploration, fast and lightly armed; medium-sized mech, the right compromise between firepower and versatility; heavy, big and unwieldy mechs but with a plethora of armaments; assault mechs, the non plus ultra of robotic technology, big, bad and very powerful, Mazinger's face! Even among the armaments there is a vast choice (no, no space halberd, flaming sword, solar energy or rocket fists... that's it!): laser weapons of various sizes and types, useful because they don't run out, they just overheat; guided and non-guided missiles of various ranges and calibres; machine guns and pulse cannons plus other goodies like LAM beams, missile probes and decoys, and moreNow. In the Mechlab you will be able to build your own variants of the basic versions by combining the equipment as you like (and even choosing the most suitable livery) to face each type of mission. Each weapon has its weight and its pros and cons, just as each mech has a maximum loadable weight ceiling and a certain number of slots. Here too the management aspect matters a lot as you can see. The collateral aspects close the balance...um...the picture, but no less incidents on your finances, relating to the management costs of the team, i.e. the toll for the transport of the mechs from one system to another, the costs of repair and so on. You will see that it will soon be time to apply for a mortgage from the Interstellar Bank... Death From Above! Fans of the Mechwarrior series know what I'm talking about: piloting a mech won't be as theatrical as an episode of Getter Robot, but I assure you that it's not a simple shooter: there are strategies, formations, attack and defense maneuvers , and as a good foreman it will be up to you to orchestrate the progress of the missions also thinking about bringing home the fur. Surroundings, pursuits, espionage and reconnaissance, cover: for each task its own mech, the most suitable one; the most suitable weapon for each target. You will fight clean, attacking frontally like two knights in single combat, or play dirty, hiding by exploiting the terrain and employing the infamous ~Death from Above~, with which you literally jump over an enemy mech using the thrust of the Jump Jets to lift you into the air as high as Enough ? The choice is up to you. The single player campaign is divided into a series of missions divided according to the solar systems you intend to choose as a place of engagement, and will lead you through a plot that will slowly unfold (nothing exceptional, mind you) before you. Each mission has its specific objectives, which can also vary in the middle of the action, and completing them will result in the agreed fee. It is also possible to organize sessions in the virtual arena, taking part in the sport of the future: Robot Wars... um no... it has nothing to do with it, sorry. I was saying, the sport of the future (send Lucchetta away, I said it has nothing to do with it !): duels between mechs in large arenas, new gladiators of the future ready to fight for the joy of rich bettors, complete with a Dan Peterson-esque speaker who will comment on the excited phases of the duels to the death. This mode is particularly appealing to those who love action and prefer it to the organizational aspect  and they won't be disappointed. This option is present in two forms: in the Instant Action version you will be able to quickly access the virtual arena for a single match that will not affect your career; in the main Campaign instead, going on with the missions you will get to explore Solaris VII, the system where you can decide to compete in the large arenas: Colosseum, Jungle and Factory, following a series of linked encounters through which you will gradually earn more powerful mechs. The only flaw is that this option becomes available later in the game, but there is always Multiplayer if you can't wait... The multiplayer mode is - contrary to what I skeptically thought at the beginning - very fun. Connections via LAN or TCP/IP are supported, both to a specific IP and to the Zone Match service, which allows you to see how many and which servers are currently available and what types of games are in progress. Once you enter a game you will be faced with a team duel, a free-for-all, a capture the flag and so on; all modes dear to shooter enthusiasts, but don't be misled: here you will have to rely a lot on harmony and teamwork, as in the single player, only that the presence of more human players will make things very interesting. The smoothness of the game is also good I must say, and the latency is felt very little in most servers. Team play You will soon learn, from the first mission, that it is vital for your survival to be able to count on an adequately prepared team. As I mentioned earlier, the market offers you several bold young people (and bold young people) willing to make some money shooting plasma, but the capabilities of each vary significantly, as indicated by the respective graphs. To each pilot therefore, based on his skills, you will have to assign the most appropriate missions and the most suitable mechs, all this taking into account that the better the pilot, the more salty the compensation you will have to disburseare to engage him - a bit like fantasy football :) It is also true that during the missions the pilots' skill will increase based on their experience, making them more valid companions and therefore ensuring greater longevity. Once the roster of new elements has been gorged and each one assigned to his own mech, we will compose the spear - or the team - primary and (money permitting) the secondary one, to be called at a later time during the mission for further support - such as ~arrives the cavalry! You know... Each lance is made up of up to six elements, but if you think it's easy to always have this amount of personnel, you're wrong: there are many unknowns that weigh on the missions - a damaged mech, a dead pilot, lack of funds  and often you will find yourself acting in tight spots by relying on only a few elements that you will have to choose carefully. In my opinion, this is the superiority of Mercenaries compared to the main trend of the series, in which the management aspect was present to a much less relevant extent - the greater complexity in planning the clashes, the skill with which one has to face the missions from time to time time, going so far as to refuse the most dangerous or unprofitable ones. Practicing yourself with these not exactly warlike aspects can give greater benefits than perfectly mastering the controls of your mech - which in any case should not be overshadowed. mechlab From heavy and expensive war machines we move on to our little domestic machine, a little less heavy, but perhaps equally expensive these days. To get on board and pilot your mech without too many problems we suggest a Pentium III/800-900 MHz class processor (PIII/700 MHz required, tested with PIV/1.8 GHz) with a 16 Mb 3D video card  a GeForce 2 or equivalent should do - and 256MB of RAM (requested 128MB, tested with 512MB). The required disk space is 1 giga round. To play online, the usual 56k analog mouse is recommended; the game supports 8 players per game in narrowband and 16 in broadband. Performance on the test system, equipped with Win XP and GeForce3, was excellent, with every detail option set to maximum and without any slowdown. The numerous configuration options make the game largely manageable on any machine compatible with the specified minimum requirements. Are you ready to fight ? Adrenaline, exhilarating, galvanizing, fun, brutal, reflective. These are just a few of the adjectives that come to mind, that have come to mind since the first minutes of the game. Driving a multi-ton beast around the jungle or in an urban scenario full of bullets, missiles and laser beams is, I think, one of the most exciting simulation experiences you can have, and Mercenaries makes it extremely realistic and immersive, with its stunning graphics and its wide range of tactical and management possibilities. The enhanced administration and management section - taken from the previous Mechwarrior 2 Mercenaries - makes it possible to customize the game to the maximum, directing one's career in the way that best suits one's inclinations. This is not a trivial shooter with the mask of a simulation: the problems related to the economy of the team, the selection of pilots, mechs and weapons that we need and - above all - that we can afford, the choice of mission with fewer risks and more profits create an insidious world full of variables in which the war part is inserted, even more compelling in this complex framework. The general performance of the game is also of a high level, the background music exciting and spot on enough - perhaps a little bit - and the graphic rendering of the mechs is as always of a high level. The only flaw I found in the realization is the superficiality of certain settings and certain details, such as the trees, but in the heat of the action we tend to pay little attention to it. but so be it. In summary, therefore, we have an all-round game, a clever mix of action, strategy and TNT that will not fail to excite you; a game to try, try again and maybe try again, which could only disappoint lovers of unvarnished action, and perhaps not even those, thanks to the many game modes, especially multiplayer. Don't miss the opportunity to get on board your personalized mech, perhaps during the Christmas holidays, I assure you that you will not regret it.", "date": "2002-11-30", "grade": null}