{"name": "Colin McRae Rally 3.0", "ref": "https://multiplayer.it/recensioni/colin-mcrae-rally-30_a.html", "text": "After the disappointing introductory film, the meager initial menu leaves you with few choices: Options, Extras (through which you access films of other Codemasters products), Championship (in which you can initially only drive the Focus WRC) and Courses, in which you they can tackle the stages individually (some tracks and cars need to be unlocked). To the delight of all fans of the series, the characteristic driving model has remained almost unchanged, once again restoring all the thrills of off-road racing (without too many complications for the player), the result of a perfect mix of simulation and arcade in able to fascinate lovers of this particular sport but also to captivate anyone who manages to hold the pad in hand without giving up for more than five minutes. Newbies could in fact get discouraged by the initial difficulty of controlling the vehicle, which follows all too suddenly the commands given via the pad, but the time (a little actually) spent to assimilate the behavior of the cars is amply repaid by a real sense of satisfaction for every hairpin faced in drifting with the wheels sliding on the gravel and struggling to find grip to be able to exit the curve. In a game like this, where it is essential to correct every movement of the car almost to the millimeter, the control system must be perfect, and in Colin Macrae Rally we get very close. The pad can also be configured to use the two back buttons (L2 to brake, R2 to accelerate), a choice that we particularly appreciated. Another interesting addition concerns the gearbox, which in addition to the usual modes (manual or automatic), includes a semi-automatic system which gives the possibility of intervening on the inserted ratio only when necessary, leaving the rest to the computer. The improvements concerning the physics of the cars are remarkable and further increase the simulation aspect of the game, to which the new view from the cockpit also contributes, complete with brushes in operation in moments of rain or snow. As per practice, the cars probably behave and are covered in dust and mud in a superb manner, just as they are progressively damaged when they collide with some obstacle; thanks to an excellent modeling every single element that makes up the cars is subject to eventual breakage, up to completely detach (I happened to hit a rock on the edge of the track with the result of having broken the bumper and the bonnet, which at first the hill lifted up preventing me from seeing the track). What is most striking is how the damage is reflected in the performance and handling of the cars which can lose power, have difficulty shifting gears, tend to the right or left, etc., forcing a very careful race handling, since you have to face three stages before being able to repair the car (each rally consists of six stages divided into two days plus a special route in which you race against an opponent). Too bad only for the fact that it will no longer be possible (as in the second episode) to decide which parts to repair based on the time available, as everything will happen automatically, leaving the player with the only possibility of reviewing the settings of the mechanical parts (however, you can take a test drive to test the effectiveness of the changes). CMR3.0 is not without flaws, first of all a questionable technical realization that combines perfectly modeled cars with scenarios rather poor in details. If the cars are therefore made up of thousands of polygons (up to fourteen thousand!) and have obsessive attention to detail (clear examples are the movements of the driver and navigator and a good use of environmental mapping), the same cannot be said for the layouts, in which the same few elements repeat themselves continuously. The gap between the backdrops and the car is therefore quite evident, but they must also be justified by the fact that these shortcomings mean that there are no slowdowns and that the updating of the images on the screen is constant. On the other hand, more than two years after the release of the PS2 on the market, the slight flickering of the images and, less importantly, the draw in of very distant seabed elements is unforgivable. The sound sector is really well done and manages to involve everything around the pilot; it is enough to damage the car to hear squeaks and noises coming from the affected part, the rustling of the grass and so on. Finally, the good sampling of thenavigator Nick Grist, always ready to issue commands, with the possibility of choosing the language of these suggestions (obviously Grist will no longer be speaking). In conclusion we can recommend CMR 3.0 as a game which, despite all the graphic defects listed above, is appreciated for the high quality of the part played, the real strength of the series and, no less importantly, for a good longevity. What the game perhaps lacks is a good dose of innovation, but in general we can say that lovers of rally simulations will not be disappointed. Pros  Superb driving experience  Modeling of the cars  Perfect implementation of damages Cons  Bare scene graphics  Lack of innovations We say it immediately to dispel any doubts: with this new episode, the Colin McRae series still remains among the highest peaks of rally simulations. It remains to be seen what the competition will be able to offer in the immediate future, but for the moment we can ~settle~ with the new effort from Codemasters without any problem: the fifty-six tracks, equally distributed among eight countries (Australia, Spain, Sweden, United Kingdom, Greece , Finland, the United States and Japan), are there waiting for you eager to let you roam through mud, gravel and treacherous ice.", "date": "2002-11-28", "grade": null}