{"name": "Ghost Recon Gold Edition", "ref": "https://multiplayer.it/recensioni/ghost-recon-gold-edition.html", "text": "Love and Psyche This Gold Edition is the emblem of this commercial philosophy: good product, good price, satisfied customer, happy player. And many thanks to the American commercial machine. However, there is a big question mark hanging over Ghost Recon Gold Edition: how much do you like what is designed to please? Let's proceed in order: First of all, Ghost is the name of one of the many elite special teams present in the American army. Our Ghosts are known above all for their ability to intervene in conflict zones, as well as for an absolutely avant-garde weaponry, moreover faithfully reproduced within the game. Recruitment and career Once the double installation (Ghost Recon and Desert Siege) is finished, the player finds himself faced with a huge game potential: GR alone is already very articulated, and Desert Siege, although formally a mod, has as many as eight missions, new weapons, new specialists, new uniforms: practically a new game based on the same engine (indeed, on a slightly improved version). Gourmets will certainly prefer to resist the temptation and proceed in order, finish GR and then assault Desert Siege, but nothing will prevent the player from jumping from the woods to the desert. Surely the systematic approach pays more, above all because once the right strategy for a type of combat has been metabolized, it will become increasingly instinctive to equip, move and command soldiers in that precise context. Above all in front of a game like this, it will be precisely the knowledge of the strategies and the territory that will make the difference, above all because, almost always, the enemy will move easily within the scene, leaving the team with the onerous task of discovery, naturally with all the modifiers of the case (atmospheric conditions, light and so on). A little technology From a technical point of view, the game is very well done. Everything is reconstructed in the best possible way: the level of accuracy of the details is truly remarkable, the sound sector is top-notch (perhaps one of the best for this genre, above all for the level of realism it reaches). Desert Siege does not seem to be affected, unless you go really deep, by any form of ~sequel fatigue~: the perception is, as already anticipated, that of being faced with something built with the care of a new product. There are even some improvements, especially technical ones. One of the main flaws of Ghost Recon is artificial intelligence: the response of the enemies is what one would expect from a machine: practically absolute respect for the deliveries, very rigid stereotypes and above all lack of 'human disturbance'. All other things being equal, the enemies will always hear you at the same distance, will respond in a very similar way (although consistent with their specialization) and above all will never miss a shot, or rather will have an error percentage much below the human one. New Missions This feeling is slightly improved in Desert Siege, although it is not possible to tell if it is a simple sensation due to the change of environment or an actual change in the code. We come to the painful notes. First of all, it must be said that Ghost Recon is not a simple game, especially for those who are not familiar with the tactical part. The 'Commando' game pays only for some of the less articulated missions, while the tactical game will allow you to overcome even the most complex theater unscathed. The interface system is functional, but the need to remember a considerable amount of keys is a common evil of all games of this genre, necessarily not always intuitive even after a careful reconfiguration. Team play The multiplayer mode is one of the strengths of Ghost Recon: after all, it is the increasingly large scene that is emerging around this game that speaks for itself. The internal communication engine will certainly satisfy you for a long time, even if, as is obvious, the ~advanced~ will then prefer to give themselves to the voice communication systems, which are very well supported (at least after downloading a few patches). The online playability is fairly high, even if the game still suffers slightly on analog connections; limit, however, very bearable as long as you remain in the amateur field. Ghost recon is lucky not to be basfrenzy, which is why it is very playable even in poor ping conditions. Back to base There is a curious consideration linked to the general feeling that the game provides us: Playing Ghost Recon one has an impression of coldness, like when listening to the music of a technically flawless but lacking in interpretation performer. Ghost Recon gives the same impression: a perfect, cold, monolithic technical execution. The same feeling that a shopping mall, an amusement park like Disneyland, a Hollywood movie could give us. The impression is that nothing is left to chance or improvisation, but that the game is the result of a very careful desk study. Not that this is an absolute bad thing, on the contrary, but perhaps a little less 'business' spirit would have benefited the sympathy of this title, which is still an excellent product. American school Tom Clancy is an institution, especially overseas. A writer who, like few others (Wilbur Smith and Stephen King, just to name a few) has been able to make his name a brand and his style a real entertainment industry. Surely Tom Clancy is the most active in terms of attention to the world of video games, probably because his genre is the one that best matches the tastes of the average generic gamer. This introduction to explain a fundamental concept: Ghost Recon is, like everything that comes from the 'Tom Clancy industries', a purely commercial product. An American product from head to toe: solid, technically excellent and, like everything Tom produces, damned well documented, curated and coherent.", "date": "2002-11-27", "grade": null}