{"name": "The Mummy", "ref": "https://multiplayer.it/recensioni/the-mummy.html", "text": "From America to Egypt, from Egypt to Italy After all, who would resist the idea of tackling a trip to Egypt, amidst exotic locations, punching and kicking mummies, beetles, looking for amulets and anything else Rick O'Connel, his wife Evy and their son Alex might need. After this preamble, it's time to analyze the work done by Ubi Studios, a development team entirely made up of Italians, as well as already responsible for the conversion of Rayman for Game Boy Color and the upcoming Tomb Raider: The Prophecy. Imhotep is back! Anyone who has already seen the 2 ultra-millionaire films will have already met Rick O'Connel, the daring adventurer, halfway between the fearless and the braggart, going through moments in which he remembers the classic heroes, able to beat more and more enemies as if nothing had happened, and others as a perfect Latin lover (er.. Ed), as well as with his wife Evy (who will hardly forget her first kiss with Rick, taken prisoner in the first film), capricious, careless but with a courage to sell and Alex, the classic naughty no parent would want to deal with, although he demonstrates, from an early age, that he faithfully follows in the footsteps of his ~old men~. Imhotep is back! Their historic enemy is Imhotep, the Mummy, who has already come back to life twice in the cinema (and on vhs and dvd, of course) and there he is ready to play tic-tac-toe if our heroes (perhaps with the help of Ardeth Bay, new Sandokan of these years, in any case one of the most charismatic characters in the saga) will not prevent him. A long journey therefore awaits the gamer, anxious to help the O'Connels stop the new resurrection of the Mummy, finding the Book of the Dead prematurely, with which this resurrection is possible; from Cairo to Giza, passing through Hamanunaptra, there will be dozens of locations to visit, immersed in the hostile desert of Egypt, chatting with the non-playing characters in charge there, among trunks full of gold coins to uncover and ancient tombs to desecrate. The gameplay Ubi Studios, for sure, license in hand, must have carefully considered, on the one hand, what kind of video game could arise from such a successful franchise (in itself beautiful and ready for a videogame conversion), on the other hand, it was also necessary to try to integrate gameplay and game mechanics with the plot, however very important in the economy of The Mummy, a video game edition for the portable 32-bit Nintendo. The gameplay The result was a mix of adventure, action that is very reminiscent of The Legend Of Zelda (Nes version, Game Boy Color and otherwise), as well as the lesser known Story Of Thor for Sega Megadrive and Saturn, with an eye to the sparkling Lost Vikings, which appeared on the Amiga and Super Nintendo. The view adopted is from a bird's eye view, the player is required, in any role of Rick, Evy or Alex, to get rid of the many enemies that will hinder our heroes, thanks also to the possibility of chatting with the locals, deciphering languages understandable only to Evy and located on the surface of some hieroglyphs, and filling up with (very important) gold coins, which can be exchanged in some points, in exchange for an immediate return to life for those who have lost it during some battle . The possibility of bringing the members of our merry little family back to life is at least an option to bless, given that certain areas can only be overcome with specific skills attributed to a single member of the party: if Rick is, as previously mentioned, the thug of the group (as well as the dynamite expert), Evy is entrusted with the heavy burden of translating the hieroglyphics on the obelisks, as well as the task of slipping on some pitfalls, lethal for her blond husband and for Alex, the only one of the lot in capable of casting certain types of spells (four, for the sake of accuracy), as well as opening chests containing scorpion-shaped keys, without which, none of the various crypts annexed to the 4 main locations can be visited far and wide (from here the previous reference to the beautiful The Lost Vikings of Interplay and its 3 heterogeneous protagonists). The gameplay Scrolling fighting game moments and very rpg style scenes make up the video game offer of this made in Italy tie, unfortunately devoid of that variety of situations that helps keep interest alive for a long time, despite the gameplay being convincing, above all in the first moments, where (primarily the fans) it really satisfiesnte find out how the game formula really works to perfection, among some scorpions sent back to the sender by Rick, traps and ancient languages to be overcome effortlessly with Evy, as well as spells to learn and particular caskets to rummage carefully with the lively Alex, owner of the bracelet of Osiris (as seen in Mummy Returns). Finally, a 4-digit password system allows you to restart your game with the most important items already in your possession, at the expense of gold coins that will have to be reconquered, chest after chest. Graphics and sound...Egyptian? The technical realization of The Mummy leaves a little perplexed: although the main sprites are pre-rendered and of more than fair quality, as are their animations (except for a handful of the latter), one can only distort the nose looking at enemies, whose quantity is really too small to represent a worthy challenge; it can also happen that, in case you play in unfavorable lighting conditions (but not even in a storm or thick fog, for that matter), the position of some enemies (due to an unsuccessful contrast between some sprites and certain backdrops) is hardly noticeable, to the detriment of the user, who loses part of his energy bar without even realizing what has just happened. Graphics and sound...Egyptian? The sound side is also average if you think of the music, certainly not of striking quality and with decidedly uninspired themes, in the norm instead the digitized screams of the three protagonists while the sound effects are really beautiful and, above all, spot on. Conclusions The Mummy is, in the end, a decent action video game, surrounded by scrolling fighting game and role-playing game elements, which give life to a happy marriage that has led to the creation of an excellent product that we recommend first of all to movie fans, arcade/adventure enthusiasts (all those who are salivating for the pocket conversion of The Legend Of Zelda: A Link To The Past), as well as those who love (and rightly so) Egypt. With a not always brilliant plot, an overall discreet technical realization and a gameplay that however in the long run begins to be repetitive (aficionados of the genre should not give up before having finished it, it is almost utopian to think of solving it a second time), The Mummy is a discreet product that deserves the attention of the categories of fans mentioned above, with the awareness, however, that with more variety and a greater commitment to graphics and sound, now we would speak of a masterpiece and not, ~only ~, of a good game. Pros: Irresistible the idea of 3 switchable characters Longevity above average Cons: Graphics and sound deserved better care Boredom could come a little too soon From America to Egypt, from Egypt to Italy Among the biggest blockbusters recently produced by Hollywood, the saga of the Mummy was certainly among the most appreciated in all the major world audiences, thanks to a skilful mix of adventure, beatings, irony and mystery, all surrounded by that place dream that is Egypt. The blockbuster received, although adverse to a not negligible slice of cinema enthusiasts, primarily fans of the 1930s film on which the producers of The Mummy, twenty-first century edition, have never denied having drawn (to carry out the umpteenth operation remake), must have convinced Ubisoft to grab the rights to yet another Game Boy Advance tie-in.", "date": "2002-11-22", "grade": null}