{"name": "Timesplitters 2", "ref": "https://multiplayer.it/recensioni/timesplitters-4.html", "text": "A long awaited return<br> Time travel? Hmmm..... The story of the game is based on the old time travel scheme, with some obvious references to the movie Stargate for the way they are made: an alien portal will project you in various time zones and also on places outside the your planet. The reason why you will face these journeys is the invasion of the earth by an enemy civilization, which in order to neutralize our race has decided to attack it during different periods of history to distort it and make us fall back into a new Middle Ages. Plot and introduction are therefore already seen, furthermore there is no real common thread between the various levels, which highlights how everything is only an accessory expedient to justify the radical difference of the scenarios, which offer alien outposts, city settings or wastelands, with very different weapons themselves. Despite the obvious banality, everything works quite well, and we must admit that TS2 displaces the competition in terms of ideas, alternating levels based on exploration with others full of shootings. In the challenge mode you will instead have to overcome particular objectives in scenarios inspired by the various levels of the single player mode, such as having to survive the enemy hordes for as long as possible. The results are classified in a summary table and will allow you to unlock new levels to try your hand at. Last but not least the multiplayer mode, certainly the strong point of the game: it recalls in all respects that of the original, but raised to the nth degree with more weapons, greater speed and the same inexhaustible frenzy. To guarantee a long life to the game, an intuitive and complete map editor has also been provided. So what more do you want? A long awaited return<br> The technical side TS2 is a technically alternate product: a good basic frame and effective ideas but with some fallout. The engine of the game is fabulous: the speed of movement is very remarkable and without uncertainties, superior to any other competitor. In playing it in some excited phases, we even suffered an annoying sense of nausea due to the continuous running in the midst of the colorful scenarios!! Speed aside, the scenarios are very colorful and very varied, the game areas are designed with great intelligence, in fact they will never be too vast to be boring and never too intricate to make you lose your head. On several occasions you will find some classy cues such as the huge stained glass windows of the cathedral that shatter under your blows. On the other hand we have a not very high resolution which has a significant impact on the cleanliness of the corners and details, and sometimes it could make it difficult for you to see, for example, a rope hanging from the ceiling in the distance or a half-hidden object. A long awaited return<br> On the animation side, despite the numerous moving elements that we find in the scenarios, everything appears as an accessory and devoid of its own life. I try to explain myself with an example: in the underworld level of Chicago, you will notice an elevated tram, but it doesn't pass on the rails asynchronously, but it seems to be placed there to pass exactly when you are below. In short, there is a bit of a feeling of everything pre-calculated, rather than a real city that lives self-sufficient. Finally, the characters, although very realistic in the poses, do not show a great variety, not even shining in the animations, which are very similar to each other. In conclusion, the graphics vary between fair always and good in some circumstances. As for the sound sector, one can only be satisfied: the accompanying music is the strong point, very beautiful and perfectly fitting, they will never bother you also because they integrate perfectly with the action. The sound effects are also good, especially in the samples of the enemies' voices. The splatter side of TS2 does not indulge in romance: you can kill your enemies with thousands of bullets, raging beyond what is necessary. Some particularly gore enemies, such as zombies, will lose body parts before finally giving way. Particularly cruel and satisfying is the possibility of killing innocent people and the same protagonists of the game, who in theory you should save or meet from time to time (penalty in this case of failure). The realism and gore are tempered by the puppet appearance of the characters, but remain very high and will surely make some parents turn up their noses... The stealth side Following the fashion of the times, TS2 also places emphasis on strategy, or at least it does in some levels, where the alternative to carnage is to improvise snipers: the sniper rifle is excellentrendered and the control of the life of an unsuspecting soldier will give you a feeling of omnipotence. Some doubts about the AI of the enemies remain, in fact sometimes they don't seem to react to the fall of their companions despite your weapons making a lot of noise, in other cases instead they seek shelter from the blows showing a minimum of discernment. The stealth component is therefore very little based on the enemies' ability to propose attack strategies, and much more instead on the use of contingent objectives, which intervene in some cases during the mission and which you can or cannot pursue at your choice, increasing the risk that you run. In this way you will have the feeling of a certain freedom of choice, even if in reality your path is well defined from the beginning. The multiplayer: strong point Where TS2 performs at its best, as well as its predecessor, is in the multi-user game. Fast, frantic, without respite, TS2 will drop us in many different settings by squeezing our reflexes to the bottom and resulting much more effective than some competitors (Halo in the lead) precisely because the environments in which you fight are cramped and do not allow you many hiding places they allow you the luxury of spending too much time wandering around looking for opponents: it's a relentless battle to the end. It should be noted that the multiplayer mode is also available via i.link connection between multiple PS2s while unfortunately there is no modem support, and therefore online play, for which this title seems to fit perfectly. Conclusion TS2 is beautiful, very varied, full of game modes and fun in multiplayer. The single player mode is certainly not at the levels of a Half Life, but it is still an excellent palliative for the real core of the game, the multiplayer mode. In fact, from a multiplayer point of view, there are no rivals on the square, and if you are looking for this type of interaction, it is a forced choice. Pros  A lot of variety of environments and missions  Very cool and captivating interface  Very fast  Excellent system aiming with crosshairs Cons  Graphics with ups and downs  Not very functional the change of weapons from the menu  Does not support online gaming A long awaited return<br> Timesplitters represented the first real surprise for the Sony machine at the dawn of the PS2. One of the very first original titles, not a reissue of classics, and not even preceded by particular advertising or marketing actions. In short, in Hollywood jargon we could say that it was a real and proper ~b-movie~, free from sui generis servility, in short, a free-thinking work. As often happens on these occasions, the creators hit the target: people liked TS for its frenetic speed and the crazy lack of logic in the settings. The commercial success was unexpected and immediately set the business machine in motion, which proudly and gloatingly announced the preparation of the sequel. It took many months to get the final product in our hands, but we can say that the time was well spent, and that the PS2 acquires the best multiplayer FPS in the stable, Unreal permitting.", "date": "2002-11-21", "grade": null}