{"name": "NFL Fever 2003", "ref": "https://multiplayer.it/recensioni/nfl-fever-2006.html", "text": "The long road to victory When the disc is inserted into the Xbox player, after a well-made classic full motion introductory video, one is catapulted into the main menu, which is very familiar to those who are used to MS sports games: the setting of the menu follows the in fact with fidelity that of NBA Inside Drive, comfortable and intuitive. You can decide whether to play a single game, face the playoffs or try your hand at the most satisfying and meaningful game mode: the dynasty (dynasty mode). By selecting the latter option, you have the possibility of leading an NFL team for 25 seasons, in which you will clearly have to try to win the highest number of trophies, following the evolution of your franchise through ups and downs and deciding its fate through choices from perform on and off the field. Once you have chosen the team to control, you can even decide whether to customize the city of origin, monicker (the battle name) and game uniform. This customization phase is particularly accurate and guarantees a further degree of identification: think of the sensation given by the championship victory with the hypothetical Milano Devils team! The player progression system is also very interesting in the dynasty mode: each player, after each race, sees his or her skills improve or worsen based on the performance just performed. For example, a quarterback who completes a high percentage of passes without suffering any sack (tackle behind the line of scrimmage) will significantly improve his ability scores, and will face the following games and seasons with greater determination and incisiveness. The consequence of this feature of NFL Fever 2003 is very intriguing: the football expert will be able to challenge himself by taking the reins of even a not very strong team and bring it to win the superbowl in a few years, buying new players and selling those whose performance is unsatisfactory, always keeping an eye on the salary cap, i.e. the dreaded salary ceiling that imposes a limit on the amount that each franchise can have for player salaries. Dulcis in fundo, you can create players from scratch, defining their game and physical characteristics, from ball control to eye color. The game imposes restrictions on this option, preventing the creation of too skilled players to avoid unbalancing the difficulty of the game, which in itself is not excessive. That dirty last destination The smooth, responsive control system lets you build rewarding runs, whether they're runs or passes, without getting frustrated by tight defenders or wide receivers afflicted with blindness and Parkinson's disease. The choice of schemes, a practice that could be difficult for the less expert of the sport in question, is facilitated by a handy suggestion which from time to time proposes a preferential scheme. Of course, it is also possible to ignore this advice and try a hand-picked game. The amount of schemes available is really high, as is now the case in all American football games on the other hand, and can be further replenished by creating customized schemes. The management of the audibles (pattern changes before scrimmage) is also intuitive: pressing the black button shows three alternative patterns superimposed which can be selected using the same number of keys on the joypad. The aiming method used in set pieces is vaguely arcadey, an arrow moves alternately left and right and you have to stop it when it reaches the desired direction, making the realization of a field goal a matter above all of timing. A limit of NFL Fever 2003, perhaps, is the level of difficulty that is not exaggerated, albeit not trivial. At the max difficulty level things get more complicated, but it's just a matter of practice before you can easily master 95% of the games, team permitting. Is it also beautiful to see and hear? Detailed players, covered with well-made textures, and animated in an almost impeccable way (the transitions between the various animations are also excellent) move realistically on a convincing field. The physics that regulates the impacts between moving bodies is also very accurate, and gives the gameplay an additional dimension of realism. The stadiums are sufficiently detailed and even geographically contextualized. This mrIt means that if the ball ends up particularly high it will be possible to see the green expanses of New England, or the Chicago skyline made up of polygonal buildings too. By contrast, the audience is made up of the usual textures smeared in the stands and the photographers' flashes don't appear too realistic. The framerate is stable and never uncertain. The accompanying music in the menus are pleasant and nothing more, and during the game the audio commentary is only discreet, alternating a pleasant commentary with sound effects that are not always up to par. It is certainly not the sound, however of sufficient quality, the element that can make the difference in this kind of titles. Rather it is an added value that we would have liked to see more taken care of. COMMENT The longevity and ability of NFL Fever 2003 to immerse you in the world of football depends practically on one factor: your passion for the world of American football. If you don't mind wasting hours sifting through tons of statistics, organized, we must say, in an orderly and clear manner, in search of the young talent to make the new Joe Montana, NFL Fever 2003 becomes enormously long-lived. During the competitions you will always be encouraged to take better care of the performance of each individual player in the various roles, in order to be able to find improvements on the technical and athletic level of the same and thus take advantage of them in the creation of your dynasty. You can create new patterns at Oronzo Can or customize existing ones. Every year the draft of new players will be a lottery, and signing the most promising fullback in the NCAA will be a cause for satisfaction. Add to this the support for xboxlive, which represents another valid reason not to miss this title. When the service is also available in Europe, there will be memorable challenges via the internet. If, on the contrary, you are not particularly fond of the stars and stripes oval ball, but are looking for an immediate football game to play, you can equally look at NFL Fever 2003 as the best title of this genre on the PAL market. The only note to move to the MS title is the total absence of localization (it is not even foreseen), a lack to be anticipated when it comes to American sports which here in Europe have a relative following. Pros: Nice graphics and realistic animations Easy to get hold of, challenging to master in every detail Xbox Live support Player progression Longevity, if you like football Cons: Difficulty level is sometimes too lenient Sound effects during the game won't delight your ears too much Longevity, if you don't like football For some years now, the history of many sports video games has taken the direction of sequelling to the bitter end. In fact, tradition now requires that every year a new version of the same game is published, revised and corrected in the light of the criticisms and praises leveled at the editions of previous years. NFL Fever does not escape this rule, a title born on PC and later ported to Microsoft consoles, which now arrives, in PAL format, in its latest incarnation, the one based on the National Football League championship, currently underway: the 2002 season -2003.", "date": "2002-11-20", "grade": null}