{"name": "Caesar", "ref": "https://multiplayer.it/recensioni/caesar.html", "text": "Alea iacta est Transposition of the successful franchise of the same name for PC, Caesar is described by Vivendi as a ~real-time city builder game~, with an objectively very summary definition of the product's characteristics. Along the lines of Sim City, the purpose in Caesar is precisely to build different cities and make them prosper - by encouraging their economic, social and cultural growth - while protecting them from calamities, famines and so on. The user takes on the role of a provincial governor in the service of the emperor who is the symbol of ancient Rome, engaged in an escalation of power to be accomplished city after city. Not too many to tell the truth, considering how Caesar offers only ten missions in the Campaign mode, which you can then replay at will in the inevitable free mode. However, the problem does not lie so much in their quantity (it is known that mobile products aim for immediate and short-term enjoyment), but rather in their exaggerated structural simplicity. Each stage has only one elementary objective to be completed in order to be passed, in most cases coinciding with the achievement of a certain figure in the number of inhabitants of the city. Alea iacta est Not only that, the management of income and expenses is sketchy to say the least, and it is possible to interact with it only in an extremely superficial way. Even the surrounding elements, which should guarantee a good variety to the gameplay, appear to be underdeveloped: calamities and enemy factions are therefore never a serious problem, and at the same time commercial and diplomatic activity with other cities is reduced to a mere keystrokes with no apparent depth. All aspects that inevitably end up diminishing Caesar's evident good qualities: the game offers the beauty of 25 types of buildings to enrich your own cities, the maps are a bit restricted but well studied and the interface is functional even if sometimes too compressed. Playing the Vivendi product can therefore be an enjoyable experience, but certainly not very deep and devoid of that strategic taste which should instead be the foundation of such titles. The technical sector of Caesar is also a bit subdued, not so much for the sound (basically absent as in most mobile games), but rather for the graphics, which are not too elaborate: the scenarios are aesthetically elementary, while the various buildings definitely amaze for complexity and variety. However, there are some appreciable touches, such as the actual presence on the screen of animated sprites depicting citizens, which increase as you continue with the buildings. Game tested on Nokia 6630. Comment As mentioned in the opening phase, Caesar's main problem lies in the excessive simplification of the game structure at times. Certainly it is right to ensure that a product of this kind is enjoyable on a limited support such as that of the mobile phone, but in the case of the Vivendi title the gameplay has been literally stripped of the skin: only ten missions, rather short and not very demanding and with very elementary objectives they can be enough to make a good management simulation. Not that Caesar is a bad title, but it actually offers little material even by mobile industry standards. Pros Functional interface Initially enjoyable Cons Oversimplified Bitchless Technically mediocre By now the field of mobile gaming is open to all kinds of products, including the apparently prohibitive one of management simulations. Exploits of a certain level such as Sim City have in fact demonstrated how it is possible to offer playful experiences of this type even on mobile phones, provided that one compromises with the complexity of the game structure, which must be greatly reduced. Finding an acceptable balance in this sense is certainly not an easy task, and one can fall into an even excessive simplification of the original gameplay, as happened with this Caesar.", "date": "2006-12-28", "grade": null}