{"name": "Red Faction 2", "ref": "https://multiplayer.it/recensioni/red-faction-5.html", "text": "Long live the revolution, always! Red Faction 2 immediately starts off on the right foot, offering the user a more complex and compelling storyline than its predecessor. Leaving the monotonous Martian landscapes in favor of the most varied terrestrial territorial conformation, the Volition title is chronologically set five years after the events narrated in the prequel, and makes the player take on the role of a member of an armed group of subversives, engaged in the enterprise to assassinate one Victor Sopot, a dictator of clearly Stalinist style. However, this is only the incipit of a plot full of twists and turns, effective in guaranteeing a solid substrate for progression in the various levels. Which, in the same way as the storyline, have undergone a decisive qualitative increase in this sequel. In addition to presenting settings that are certainly more varied and better characterized, the various stages, although they do not shine for their originality, offer the player scenarios - internal and external - with a greater quantity of surrounding elements (obviously destructible) and, above all, with a more massive implementation of the Geo-Mod. Although still not exploited to its full potential (after all, not all wall surfaces can be affected by the user's blasting fury), Volition's proprietary algorithm shows much more character in this sequel, having been exploited more to tactical rather than purely choreographic or accessory purposes. In short, although still linked to the spectacular or to the discovery of secret locations, the Geo-Mod in Red Faction 2 also proves to be extremely useful for opening alternative (and more profitable) ways to the player's progress; for example, why continue headlong along a corridor teeming with guards when it is possible to access a parallel room by breaking through a wall and then surprising the opponents from behind? Long live the revolution, always! The red you like At an exquisitely playful level, Red Faction 2 demonstrates much more character than its prequel. Although the control system is not yet the maximum precision (this is also due to the not exceptional affinity of the Dual Shock with the FPS), the Volition title presents significant improvements in this respect. The AI of the enemies, although not excellent, is much more advanced, the arsenal made available to the player is more varied (with the renewed peculiarity of each weapon to have two types of shot) and generally the game action is very more agitated and compelling, thanks also to the already mentioned good level design. Winking at Halo, then, Red Faction 2 allows the player to launch different types of grenades, with the benefits that naturally follow on a tactical as well as purely destructive level. Furthermore, similarly to what was seen in the masterpiece Lies, the bar indicating the health of one's alter-ego is automatically recharged about ten seconds following the last blow suffered. Another peculiarity of Red Faction was the possibility of driving different offensive means, a feature also successfully present in this sequel: the sections on board similar instruments or in command of machine guns and turrets effectively contribute to breaking the ~on foot~ shooter routine. Also noteworthy is the more than satisfactory multiplayer mode of the Volition title, full of modes to choose from and characters to play, and which even with the four-way split screen guarantees good fluidity. However, the aspect in which Red Faction 2 presents the greatest number of improvements compared to the prequel probably concerns the visual sector: the renewed graphics engine of the game ensures a decidedly more constant frame rate, as well as a greater amount of polygons. Excellent light effects and animations of the characters on the screen exponentially better than the (very bad) ones of the first episode are just the most striking aspects of a cosmetic of undoubted quality level. Also on the sound front, the work done by Volition is absolutely appreciable: both the audio effects and the electro-rock musical background are good, the speech in English is discreet, unfortunately not supported by subtitles, which would certainly have helped to a clearer understanding of the plot . The red you like Conclusion Red Faction 2 is generally a good FPS, which has the undoubted merit of having made significant improvements to the fallacious game structure of the prequel. Technically very accurate and, above all, satisfying from a playful point of view, the Volition title is not lacking in defects, however: first of all, a control system that is not always very precise, an implementationof the Geo-Mod still definitely improvable and, in general, of a certain lack of ~style~ in terms of character design. Ultimately, however, Red Faction 2 is a title that lovers of single player-oriented FPS should seriously consider. Pros: Graphically excellent Fun and fairly varied Storyline compelling and full of twists The Geo-Mod and the sections aboard heavy vehicles or in command of turrets Cons: Control system not always precise Character design rather crude It often happens that the sequel to a game turns out to be a simple expansion of the original, a data disk containing new missions and little more. This trend particularly affects a sector, that of FPS, necessarily linked to a game structure that is difficult to radically renew. It is therefore not uncommon that the sequels in this kind of product go very little beyond the simple add-on, keeping the inherent strengths and weaknesses of the original product largely unchanged. Fortunately, this was not the case with Red Faction 2, an obvious sequel to an FPS that came to the fore thanks to the Geo-Mod technique, an algorithm capable of allowing the walls of the playing area to be destroyed following explosions. However, the improvable implementation of the aforementioned technology, but above all a gameplay that did not live up to expectations, did not make Red Faction a good game, leaving the task of raising the quality level of the entire product to the sequel.", "date": "2002-11-18", "grade": null}