{"name": "Urban Yeti!", "ref": "https://multiplayer.it/recensioni/urban-yeti-2.html", "text": "More than jungle! In ~UY~ the player has to guide the ape in his enterprise which seems really original. To do this, he has to go a long way through the exploration of the three different locations in the city that are made available sequentially. Completed the different missions in the first you move on to the second and so on. Only after having raised a large sum of money (after hard work) is it possible to pay the toll to access the next area. To obtain it, the gamer must find some remunerative task that translates into some subgame, the true essence of the title. e.g. sometimes you have to be a waiter in a restaurant imagine a Yeti serving meals! Really hilarious. As previously noted, the heart of the entire game lies precisely in the four subgames that the cartridge contains. These are very reminiscent of the video games of the 80s by presenting a structure that is as simple as it is immediate. Inside the city you drive the protagonist almost as if you were in ~GTA3~ with almost all the surrounding elements. In fact, you can find passers-by, policemen, animals, crazed motorists, etc. In this phase you can choose whether to try to go unnoticed or to unleash the ruckus through chain killings, sudden animal screams and things like that. In the latter case, however, there are all the negative consequences that derive from it such as chases with the police and clashes with people of all kinds. And to think that in theory people should be terrorized by an abominable indomitable monster... During the exploratory phases the player must look for small objectives that an arrow indicates to him in order to obtain a fundamental job. Initially, i.e. in the first game sessions, the gamer could be disoriented by the difficulty of identifying and understanding his goals and, in truth, the brief explanation scenes don't help much. But a few games are enough to get to the heart and be able to easily understand how to proceed in the adventure. The commands are essential and quite immediate. The only actions that the monstrous Yeti can perform are the right punch, the left one and the howl of the jungle. However, during urban exploration you can get some power ups, excellent for diverting the angry crowds, which can be activated by pressing the ~Select~ button. One of these eg. (the radio) produces a comic ballet starring the monkey and all the bystanders with the aim of sending the latter into a tailspin. The entertainment offered by ~UY~ reflects very much that of the old video games and could, therefore, especially attract the players of the old guard who love the ~years-green~ cabinets. While those who have not played for a long time could turn up their noses not only due to its structure but also due to the initial complexity. Technically speaking The technical quality of this production does not reach medium-high levels. First of all, the graphics suffer not only from a not exactly high resolution of the sprites but also from the point of view of fluidity. This is inconstant during all phases of the game. The shot from above is not very comfortable (but it is known that for 2D it is the only admissible choice in this type of production; see the first ~GTA~). Only after a few tens of minutes of play do you get used to it and become more familiar with the whole setting. The positive cosmetic aspects concern the amount of sprites displayed at the same time and the cute animations of the protagonist. Too bad there are no animated cutscenes even during the presentation. On an aesthetic level, we are faced with a title well below the potential of the GBA. As far as the audio sector is concerned, there are a few fairly fluctuating and repetitive accompaniments, and all in all well-maintained effects. Sorry for the scarcity of the ~bitrate~, or the sound definition, which does not do justice to the quality of the sound card present in the small Nintendo laptop. In short, a poorly cared for title from a technical point of view that disfigures when compared to other available products. Concluding The amount of fun that this ~UY~ is able to offer is quite high even if, it must be said, it does not last very long. Four subgames seem like a small number after completing all of this original adventure. And to do this all you need is patience and steady nerves for a handful of hours. A title recommended especially for those who love old school games and for those who don't let themselves be intimidated by difficultiesinitial crops. Too bad that technically it's not much, but in the end you get the hang of it and you manage to spend some fun hours with a cute title. Pros: Fun if you understand it. Nice subgames. Cons: Graphically one step below average. Not recommended for anyone who doesn't like old school gaming. The abominable! Are the stories about the probable existence of a Yeti pure fiction? No, according to the ~Cave Barn Studios~ which let a large gorilla loose around the city in search of ~pleasant company~... Well yes; his purpose is precisely to find his soul/beast mate in the streets of a hostile urban jungle. Will our Yeti be able to find refreshment in the arms of his female?", "date": "2002-11-15", "grade": null}