{"name": "Spacebase Startopia", "ref": "https://multiplayer.it/recensioni/spacebase-startopia-recensione.html", "text": "A space station abandoned for seventeen years, a cynical artificial intelligence always ready for a joke and the fact of being the only carbon-based creatures available in this part of the universe, are the assumptions that give life to Spacebase Startopia, a sci-fi  la Theme Park with lively tones which, as we will see in the course of the review, enjoys a really solid realization. After all, it was developed by the Dungeons team, therefore by people who have already shown that they know their stuff in the management / strategic field. Build One of the visitors to the base Spacebase Startopia offers various game modes, which do not deviate from the canons of the genre. After going through the tutorial, which explains some basic concepts essential for playing, you can dedicate yourself to the single player campaign, made up of a series of linked missions, you can choose the sandbox mode and build freely starting from an empty base or you can can play online. Whatever choice you make, at the beginning of the game we will always find ourselves faced with three completely unguarded main bridges, which must naturally be filled with structures to attract alien visitors. The overall goal is to collect as much energy as possible from the various attractions and production centers in order to contribute to a ramshackle global improvement project. That said, each campaign mission offers several minor objectives to accomplish, be it producing a certain amount of energy, or neutralizing a visiting alien enemy at the base. At the beginning of each mission we will have a certain amount of energy available to spend on building the first available structures. Others will have to be unlocked by investing resources in the research section. The important thing is to maintain the right balance between expenses and income, trying not to create bottle caps, ie not to slow down production. True management The circular structure of the base creates some interesting landscapes There are essentially two resources to accumulate: energy, which can be obtained from the recycling of dirt produced by visitors, or from their daily activities such as going to the disco and playing in the arcade; and fame, which is earned from the consent of visitors and therefore requires constant improvement of the base and always keeping it clean and efficient, maintaining the structures built and hiring specialized personnel to make it work, one of the most substantial cost items of our company . The construction and cleaning jobs are the responsibility of robots, but other activities, such as medical or agricultural ones, require the hiring of specialized alien personnel, whose needs will be listened to and their salaries paid. As mentioned, the bases of Spacebase Startopia are divided into three bridges: the first, the lower one, is the production bridge, where recycling centres, factories, accommodation facilities are built, but also prisons, medical centers and many other structures dedicated to that that we could define the daily life of our aliens. The second bridge is instead the entertainment one, where all the leisure activities can be built, such as discos, bars, game rooms and so on. Finally there is a kind of greenhouse bridge, in which plants are grown which, depending on their biome, give access to resources that can be spent in the production structures or used directly in the base to improve the mood and judgments of visitors. At the beginning of each mission the player has a very limited space to build the various structures, but by accumulating energy it is possible to open the bulkheads of the station on each floor, to enlarge the building area. However, the circular structure of the base creates a natural limit to expansion: there are a maximum of nine opening bulkheads for each deck, ten considering the starting one. We guarantee they provide enough space to build dream bases. After all, expanding our domain too much creates many complications. Solid gameplay One of the three decks the ship is divided into Not everyone welcomes the work we are doing and among the aliens of Spacebase Startopia there is no shortage of saboteurs, from those who simply want to dirty the environment to bring down judgment on our work, to others who tamper with the structures so as not to function, so as to reduce our accumulation of fame and energy. The problems to be faced are actually diversified: parasites that litter the environment, aliens who want to cause riots, bombs that suck up the energy of the structures, criminals around the base and so on and so forth. With the enlargement of the baif, then, management problems also emerge that keep us very busy, such as those related to the production of specific objects, or to the maintenance of the structures, or to the management of their growth (manageable from the search screen, but also entrusted to the address we choose to give to the single activity). The essence is that there is never a shortage of things to do, because there are so many factors to evaluate. All of this is reflected in an unusually frenetic gameplay for a strategic one, in which once one problem is solved another one immediately arises, often forcing you to develop precise action strategies, giving priority to one situation rather than another. To add complexity there are also the three different selectable difficulty levels, which modulate the various factors of which the game is composed (energy accumulation speed, aliens mood, presence of enemies and so on). Overall, the gameplay is very solid and it can be said that we are dealing with one of the best exponents of the genre in recent years. Those who feared for a casual drift of Realmforge, the development studio, have no fear, because Spacebase Startopia is a real management system, not one of those created for monkeys to push you to spend real money in virtual currency. Some problems Farming in space One of the problems we encountered while playing Spacebase Startopia is the going crazy of the artificial intelligence in the moments of greatest confusion, i.e. when you own many buildings and the three floors of the base are full of visitors. Oddities such as completely blocked work robots or characters involved in strange gatherings due to who knows not what happened often happened. In a couple of cases the problems turned out to be so serious that we were forced to reload a previous save. Another quite annoying bug that has happened to us with a certain frequency involves the selection of objects: sometimes it becomes simply impossible to collect them. This happened to us mostly when the object overlapped some structure. In principle, individual objects can be dispensed with, but when garbage bombs, parasites or other threats to the stability of the base are not selectable, it becomes boring. It must be said that in the period of time we had to play it for the review, the developers updated Spacebase Startopia several times and after each patch the problems reduced in frequency and severity. So we think they could be completely phased out soon. Graphic style The <strong>visual style</strong> is quite anonymous From a technical point of view Spacebase Startopia is the classic work without infamy and without praise of Realmforge: it is made with great competence, full of nice details and rich in animations, but lacking a recognizable style that goes beyond a generic serial cartoon look in the odor of Blizzard, while remaining very far in terms of quality from the designs from the Diablo house. It is neither beautiful nor ugly. We would characterize it more as overall bland. For a strategist it's not a drama, but a slightly more convinced art direction certainly wouldn't have hurt him, at least to enhance some moments of the game. However, it must be agreed that many of the visible choices from the technical side are reflected in excellent fluidity even in times of great crowding and in very affordable system requirements. This kind of technical solemnity seems to be a real development philosophy for Realmforge, which has also done something similar with its previous games, especially with Dungeons. The exact same thing is feasible for the soundtrack, made up of very cheerful music, often too much, which helps to immerse yourself in the gameplay, but without ever surprising or really involving. They seem to be thought of as an almost useless accessory, a filler so as not to leave moments of silence.", "date": "2021-03-26", "grade": "8.0"}