{"name": "Yoshi's Island DS", "ref": "https://multiplayer.it/recensioni/yoshis-island-ds.html", "text": "Winning team... Although the announcement of a new chapter has filled fans of the first episode with joy and more generally lovers of quality platformers, the development of the title has been followed with a particularly skeptical eye given Nintendo's choice not to deal with it directly. but to entrust the processing to the Artoon team. This team has a not exactly brilliant curriculum, with titles of the ~caliber~ of Blinx and its sequel on Xbox, the disappointing Yoshi Topsy Turvy and Pinobee for GBA, just to name a few. It is therefore easy to understand the anxiety of those who, after having waited over 10 years for a sequel to the masterpiece on the SNES (trying to forget the bad Yoshi's Story for Nintendo 64), then saw the idea of a product not worthy of its first name. Evidently Artoon however, after having experimented on the skin of the Nintendo dinosaur with the aforementioned Topsy Turvy, preferred to face this new adventure with lead feet, thus creating a title extremely faithful to the original. If in fact New Super Mario Bros represented a step forward, in many ways successful, compared to the classic mechanics, Yoshi's Island DS is instead practically the same game of 1995, starting from the initial screen of the title with the rotating island. Just like at the time, even today the protagonist is -obviously- Yoshi, in charge of giving baby Mario a hand throughout 5 worlds which are in turn divided into 8 levels each. And the graphic component is also intact, colorful and characterized by a hand-drawn style that is still captivating and original today, even if not exactly a full expression of the console's capabilities. The dinosaur's abilities are the usual: in addition to jumping, running and flying for short distances, he can also capture enemies with his tongue and then turn them into eggs, to be shot around the screen as an improper weapon but also as a tool to solve simple puzzles or reach inaccessible areas. The most substantial novelty is therefore to be found in the ~cast~ of infants that the patient dinosaur will have to carry on his shoulders; in addition to the aforementioned Mario, but without his brother Luigi, there will in fact be baby Peach, Donkey Kong, Bowser and Wario. In some special areas (the stork stops) scattered along the levels, Yoshi is therefore provided with the possibility of changing his own young adventure companion, thus gaining specific and personal different abilities for each of the babies. Obviously this is resolved in the most classic of clichs of the genre, that is to say in the need to use the correct child in order to be able to overcome certain passages, reach otherwise inaccessible areas or objects and so on. A nice memory Yoshi's Island for SNES is certainly not remembered as a particularly challenging game to complete; the abundance of lives available, combined with the possibility of recovering the little frug with several seconds of time after being hit before losing one, therefore shifted the challenge factor mainly in the search for red coins and daisies to complete the levels with the maximum score possible. Also from this point of view, the DS episode does not differ from the original, adding some other objects such as character coins. Up to this point, the description of this new Yoshi's Island paints the portrait of a game that could have been made without any difference even on the dear and extinct Super Nintendo; aware of this, the guys from Artoon have therefore decided to take advantage of the double screen with a solution that is unfortunately not entirely convincing. In summary, the two monitors provide an extended view of what is above or below the protagonist; however, a ~shadow~ area is constantly maintained between them, a non-visualized strip that often hides secrets, coins, objects and so on. The need to stop and take a look up and down often, or to transport the dinosaur from one screen to another to have full visibility of the level is a practice that after the initial curiosity soon becomes monotonous, not very fun if not downright irritating, going to represent an unfortunate expedient within an originally almost perfect exploratory component. Apart from this not insignificant misstep, the level design is generally quite good, with large but never dispersive stages and with bosses (often also recycled) of large dimensions and protagonists of very entertaining battles, and which in some occasion they use the double screen in an -finally- intriguing and intelligent way. However, the greater dose of backtracking compared to the first episode represents an aspect of fundamental importance, and the liking or not of thesingle player for this type of solution is consequently a key element to be able to appreciate this Nintendo production. Comment Yoshi's Island DS is a good game without a doubt, which does not distort the formula of the original episode at all but rather follows most of its aspects. The developer Artoon therefore wanted to avoid unnecessary risks, limiting himself to introducing a few innovations such as the interesting but frankly banal presence of 5 babies with different abilities and the questionable exploitation of the double screen. The feeling once the end credits are reached, however, is that Yoshi's Island for DS is a product of this level more for the exceptional quality of the original material from which Artoon drew heavily than for the actual goodness of the work done by the still evidently immature Japanese team. Pros Faithful, very faithful to the original Funny from start to finish Splendid graphic style Cons Few new and not very convincing Technically improveable Slightly too easy Released in 1995 on Super Nintendo when the era of the polygon and Playstation was just in its first timid steps, Yoshi's Island actually represented an incredible swan song for the historic console of the big N, managing not only to stand comparison with the predecessor Super Mario World, but for many even to overcome it by going straight to the top of the ranking of the best 2d platformers of all time. A rare marriage of sublime playability and excellent technique, enhanced by a surprising graphic style, after returning with a delightful GBA conversion Yoshi's Island has finally chosen the DS as the stage for its long-awaited sequel. How will it go?", "date": "2006-12-28", "grade": null}