{"name": "Sega GT 2002", "ref": "https://multiplayer.it/recensioni/sega-gt-2002_b.html", "text": "Women and engines...  of women, alas, not even a shadow in the game, but there is no shortage of engines. The setting of Sega GT 2002 is quite classic and the game modes included closely resemble what has already been seen in other products of the genre. There is obviously the possibility of facing a single race, fighting against the clock and challenging a friend in the inevitable split screen mode, but the real fulcrum of the game is the Sega GT 2002 Mode, or the classic career mode. You start from scratch with barely enough money to buy a small car and then, race by race, you make your way into the world of professional drivers, upgrading and buying new cars to be more and more competitive with the aim of winning the coveted World Champion award. And there is no shortage, a very welcome fact, of interesting and original ideas and ideas. To start with, the implemented damage system to the cars is excellent: the damages are unfortunately not visible on the bodywork of the cars, but each contact in the race increases a special damage bar and, at the end of the race, the money needed for the repairs will deducted from the already small prize money. This expedient encourages the players to adopt the cleanest possible driving style and to avoid contact with the opponent's cars. Various parts of the car (tyres, engine, brakes and suspension) deteriorate with use, forcing the player to always keep an eye on the state of maintenance of the car, under penalty of a sharp drop in performance, and to promptly repair the faults. resulting in a waste of money. It is then possible, to save money, to buy second-hand tuning parts. But watch out for reliability, it's not nice to be ditched by the turbine right in the middle of a race... Women and engines... In competition Sega GT 2002 knows how to be appreciated thanks to a more than adequate driving model. Of course, realism is not one of its strong points, but the physics implemented are a good compromise between simulation rigor and arcade fun, and offer probably representative sensations for each car. The light and agile sports cars follow the dictates of the great Colin Chapman to the letter and are almost unbeatable on mixed roads, literally glued to the ground, while the muscle cars are as powerful and aggressive as they are difficult to tame, with angry tails at every corner and very accentuated oversteer. A tip for everyone: disable traction control and stability control from the options menu. The game is more difficult, but also incredibly more rewarding, and the driving sensations are more realistic. ...are joys and pains! Many joys, especially from a technical point of view. The creation of Sega GT 2002 is nothing short of excellent: the car models are very probably, in terms of detail and attention to detail, the best ever seen in a driving game, the reproduction of the tracks and the special effects implemented are very good, and the frame rate is always constant. The overall visual impact, however, still does not exceed that of the Polyphony masterpiece, which thanks to the particular rendering of PlayStation 2 offers an even more photorealistic rendering for the moment. Absolutely to see the replays, which clearly highlight the goodness and spectacularity of the graphics engine. Even in terms of audio, nothing to complain. The soundtrack is perhaps not always up to par, with sometimes unconvincing songs, but hats off to the effects and excellent implementation of Dolby Digital. ...are joys and pains! Among the (few) pains we instead include textures that are not always up to par in the tracks and a number of the same that are certainly not striking: it is enough to face a few competitions to see all the tracks in the game. On the other hand, the number of cars is adequate, even if the fleet cannot yet rival that proposed by the last episode of the Gran Turismo series. Subdued, but it seems to be a common flaw in all games of the genre, the artificial intelligence of computerized pilots, who do very little apart from following pre-established patterns, happily colliding against the player's car in order not to move from the set trajectory by programmers. Despite this, however, the difficulty turns out to be well calibrated and Sega GT 2002, thanks also to extras such as a game mode entirely dedicated to vintage cars (in which it is possible to directly compare old glories of the past and the latest advances in automotive technology ) and tuning accessories to be unlocked by winning various competitions, is able to keep the player glued to the pad for several hours of play. COMMENT While not reaching the levels of Gran Turismo 3 A-Spec, Sega GT 2002 is a really good driving game, which will not fail tosatisfy all Xbox owners who are passionate about the genre. Certainly the car fleet could have been vaster, more circuits could have been included, perhaps better characterized, and some idiosyncrasies of the kind (poor AI of the opposing drivers and a slightly too simplified driving model, just to mention the most important) could finally be avoided, but overall the game is technically excellent, fun, long-lived and not without original ideas, an increasingly rare fact in titles of this genre. In short, the new Sega birth for the Microsoft console undoubtedly deserves the purchase. PROS: - Fun and long-lived - Good technical realization - There is no shortage of original ideas - Good fleet of cars CONS: - Small number of tracks - Driving model and opponents' AI that can be improved - Characterization also graphics of the tracks not always up to par Attention! The review refers to the basic version of Sega GT 2002. In the future, Sega should market two expansion append disks which, in addition to adding new tracks and new cars, will allow you to play online via the Xbox Live service and download new content from the network. For now, the review obviously does not take into account these two expansion disks that have not yet been marketed. Real. Driving. simulator. Three magic words coined by Polyphony Digital with the very first Gran Turismo, three little words that define one of the most successful video game genres of recent years, with millions and millions of copies sold on the Sony platform. An overwhelming success, born from the idea of combining the collecting spirit a la Pokmon with the world of engines, racing, exasperated tuning, with many tracks to tackle and the added pleasure of being able to keep in your own virtual garage, and be able to bring to the limit on the track, both the small car owned in reality and the most powerful and unattainable of the supercars. A prodigious but very expensive mix to propose for developers and publishers, so much so that only Sega has so far tried to hinder the Sony monopoly first on Dreamcast with Sega GT, now on Xbox with Sega GT 2002. And, we say it even before analyzing this in depth new effort by WOW Entertainment, although we are not yet at the levels of Polyphony products, the road taken seems to be just the right one", "date": "2002-11-12", "grade": null}