{"name": "Speciale su  Blinx", "ref": "https://multiplayer.it/recensioni/speciale-su-blinx.html", "text": "The game This is certainly not just any platformer, since here it is even possible to manage time. That is, it is possible to go back, to go forward, to pause or simply to moviola the game action. Let's see a little better to understand the mechanics of the game. At our disposal we initially have a ~time sweeper~ vacuum cleaner (basic model, but with a little money we could buy more powerful ones in the shop) with which we can suck up waste to then throw against the monsters. We can only take 5 waste with us at a time. Another objective is to collect as many stones as possible: every 4 stones collected if 3 are of the same colour/shape we get a chance to act on the course of time (forward, backward, pause, slow motion, registration and try again) a bit as if the game was a videotape.  REW (reverse): Time rushes backwards for everyone except our Blinx (so for us)  FFW (forward): Time rushes forward  Pause: everything stops except us  REC (recording): a time interval is recorded and executed. During the execution, our double repeats our actions  Moviola: Time slows down for everyone except us  Retry: We resume life, just before our ~death~ The game If we collect 4 identical stones we get 2 ~interventions~. Note: The stones must be collected in interrupted sequence otherwise we would have to start from 0 because we get an ~invalid combination~. Only 3 tempo controls can be set at the same time. In the game diagrams you will find the ~cat medals~, by collecting them we will be able to unlock secrets. Shop Between one mission and another, as already mentioned, there is the opportunity to go to a shop and buy items that can be useful. In the game diagrams, in addition to the crystals of the time, there are also gold crystals that we will need for shopping. So here is a short list of what we can find in the shop: - Time containers: each time container allows us to increase the number of time controls that we can carry with us; - Retry: Allows you to resume the game a few seconds before our defeat caused by a monster or a trap - ~Retry~ container: Increases the number of ~retry~ that we can accumulate - Vacuum cleaner upgrades: having enough money c 'is the opportunity to buy new vacuum cleaners that are more powerful than what we have in stock. Even some aspirators also have particular functions such as for example that of throwing flames etc etc. We can also buy handy bags for our vacuum cleaner that allow us to increase our waste load capacity (so we can carry more with us and have a greater range of fire) - Various ammunition: Heavy ammunition or bombs will certainly be more effective against monsters vs garbage! Graphics and sound One of the strengths of the Artoon title is undoubtedly the technical aspect, Blinx is the technical reference point in platformers on Xbox. The graphic engine features excellent high resolution textures, levels of considerable size, excellent particle effects used to recreate the atmospheric conditions, at the same level the magnificent effects of light or reflections in general, a note of merit to the solutions chosen when using the powers over time control, which can be seen above all on water, the flow of which is influenced by the passage of the big cat of the artoon house. The technical aspect of Blinx, however, has 2 only flaws, the first marginal which is only noticeable in the advanced levels, or some slight drops in the frame rate in extreme situations, when you find the screen full of enemies. The second note however concerns the control on the camera which is certainly the biggest limitation in blinx, in certain situations the view is certainly not impeccable and the control via the analog stick does not represent the state of the art. As far as sound is concerned, Blinx does not reach the top among Xbox titles, but both the effects and the music are well cared for, for those who can use them, Blinx fully supports Dolby Digital 5.1 whose performance is always of an excellent level. Gameplay In Blinx it is essential to start playing well, let me explain: the first levels might seem a little too simple, in fact it is possible to finish them even without resorting to the help of the time control, the problem is that they were developed specifically to allow the player to calmly learn the management of the various crystals, or the use of the vacuum cleaner, thewhose accuracy is crucial in the later levels. After this part of the ~tutorial~ in the first areas the level of difficulty rises, including with the AI of the enemies, and above all, there are starting to be many parts in which time control becomes fundamental. My advice is to learn from the beginning to use all the features of Blinx so as not to find yourself displaced during the game, and get stuck in pieces that could become frustrating. In the title Artoon there are about 35 levels to play, and there are also many secrets to unlock. I think that will be enough to keep us busy for quite some time. If involved in the story there is more detached from the console. Conclusions Blinx is not the perfect title that someone expected, this must be specified immediately, but without any doubt it remains the best choice on Xbox for all platform lovers, it is certainly one of the most innovative titles in the genre, thanks to the great potential of Xbox and a decidedly atypical use of the hard disk. The Artoon title is an excellent purchase, which stands out among the various mass products, with some defects that fail to make it the ~Halo ~of 2002. Movie 1 Movie 2 Movie 3 Movie 5 Movie 6 History When we say ~time is the most precious treasure~, we often underestimate the meaning that this sentence can enclose... In reality, time is a very important element in our life, in fact, if it is not used correctly, it is wasted forever. Time is the fourth dimension. In fact, this is a game often referred to as ~4D~ precisely because we will also have control over this fourth element: time. In ~BLINX - The Time Sweeper~ we play the role of Blinx, a cat who works for the ~Fabbrica del tempo S.p.A.~, or a factory that deals with the creation, maintenance and repair of time, as well as the distribution of the same in the various existing worlds. Each flaw transforms into a time crystal, and then later becomes a monster. You have to recover the crystals before they become monsters. The ~Tom-Tom~ gang has wreaked havoc in the B1Q64 world by stealing the crystals to be resold in the other worlds by kidnapping the related princess. Blinx, despite the warnings of the factory to evacuate that world, tries the adventure encouraged by the vision of the young and beautiful princess. Our task, should (as in this case!) serious accidents occur over the course of time  Defeat, within 10 minutes, all the monsters present in the area, after which the region will become temporarily unstable and therefore disappear  Vacuum the refuse to shoot against the monsters of time  Collect valid combinations of crystals that allow us to obtain time controls Once an area has been cleaned up, it will be advisable to abandon it as soon as possible, before it disappears. Before proceeding to ~clean up~ an area we have the possibility of going to a shop where it is possible to buy various types of objects that will help us in our mission.", "date": "2002-11-08", "grade": null}