{"name": "War & Peace", "ref": "https://multiplayer.it/recensioni/war-peace.html", "text": "Conquer the world by any means on the wave of revolution. The idea of the game is basically very simple: to conquer the world, or rather to subject it politically and militarily to our will. At the starting blocks we will be asked to choose the nation of belonging and the exact historical period from which to start our rise to power. Austria, Prussia, France, England, the Ottoman Empire and Russia will be our homeland and the soil to be defended at any cost, the only reason why our standard-bearers will have to risk their lives will be to honor their name. Great importance is also to be attributed to the choice of the starting historical period. In those days the whole world frequently changed borders following battles won or lost. The various factions fought for a strait, a passage between the mountains, for vast prairies, areas rich in raw materials and military outposts. The lands of the young American continent passed year after year from one master to another and the fragile borders that brought the powers into contact underwent frequent and sudden changes. For this reason, the departure period can put us in front of very different situations, even after a very few years. Once we have chosen our nation and historical period, we will be ready to enter the complex world of War & Peace. Optimized resource management for a great start. Having reached the actual game, we will notice how it is possible to run freely in any direction with simple clicks of the mouse or using the list of cities which will allow us to reach the major centers of our empire and those of the enemies with a single click. Scrolling quickly on the earth we will notice how the setting changes quickly adapting to the areas we are flying over. Pyramids on the horizon of El Cairo will accompany our African campaigns while the profile of the Balkans will keep us company in Eastern European affairs. The major cities (recognizable by sumptuous monuments positioned inside them) will be the focal point of all our operations, be they of an economic, political or military nature. Here we will be able to build the vital buildings, the ones without which we will not even be able to afford to use a cow and a plow to till the fields. With great care we will have to choose at the beginning how to arrange our few pawns to avoid the dangerous stalemate situation, in which, as a natural development of a wrong investment, we will have to find ourselves face to face with the problem of bankruptcy (and I can assure you that this is not such a remote situation; it has happened to me several times!). Once the machine of national production has started, we will soon be ready to demonstrate our power on the field, first producing the basic units of infantry and light cavalry, to then be able to deploy heavy artillery and powerful fully caparisoned knights. Being a reproduction of the Napoleonic period (or so) we will find all the war inventions of the time useful for bringing our enemies to their knees. We will soon learn to manage the different formations available along which our men can arrange themselves to be able to break through the enemy lines, to make quick movements or to resist massive attacks in number and impetus. Our cities, scattered throughout the globe, will need continuous supervision in order to ensure adequate security for all, on the other hand, in War & Peace, pitfalls are hidden everywhere. For example, whoever finds himself having to face the crown of the Kingdom of England will soon learn that the threats are not accompanied only by the fuss of the infantry but also by the white foaming of the ramparts and galleons, lords of the seas. Naval battles will keep you busy for a long time, preventing you from trading and exchanging resources with your allies, as well as obviously making you lose large sums of money and numerous troops. Setting up important potential nodes will therefore be essential to keep your lands safe and your waters calm. On the other hand we all know that in some cases prevention is the best weapon, for this very reason it will be good to check that our borders are always free from enemy pitfalls and threats. The snitch takes the wolf away... We have already underlined the importance that in War & Peace has been given to politics and to the relationship that will be established with the opposing states. Indeed, in a period so full of tensions and constant battles, who more than politicians and diplomatsCould he have held the reins of the chariot in his hand? For this we will have to face friends and enemies even on the negotiating table and oil the cogs of the diplomatic machine over and over again, assuring ourselves through the voice of our ambassadors favors from this and obedience from this. And when the weapons seem to be ineffective and the negotiations do not quickly reach a concrete conclusion, we will finally be able to take advantage of the services of our skilled and very treacherous spies, sneaky characters capable of doing anything to destabilize a naive enemy. Therefore, setting up police stations inside the most important centers will be an effective countermeasure to counter pitfalls of this kind and prevent opponents as witty as we are from using our own weapons to kill us. Remember that very often it was the spies who started unsuspected wars by pitting allied factions against each other until they caused incalculable damage before realizing the petty trap. Only by administering every resource will we be able to achieve victory over other nations. ~I have two pieces of news, boss: do you want the good or the bad first?~ Gameplay: Good news and bad news. The first, the good one, concerns the possibility of building our campaigns ad hoc. As already mentioned, we will be able to choose the scenario in which to plunge in search of adventures and glory. From the historical period, to the nation of belonging up to the game objectives. We will be able to decide the point of arrival, when the game will be won, for example by giving honors and glory to the first who will conquer the opposing capitals or a certain number of enemy cities. But here comes the bad news... Where's the Multiplayer? It's not there... Yet I looked everywhere for it... I thought it was on the kitchen table (ops... those were the scooter keys :-) Nothing, dear friends, no multiplayer mode; it seems that this time at Microids they have pulled a trick on us and want to deny us the pleasure of crushing, humiliating and destroying our friends, fellow students or unknowns known on whatever forum they are A truly remarkable lack for our days in which it is even thought that Multiplayer is the right name for the best video game network in the beautiful country (ehehe ehm). We just have to hope for the impressive longevity that this title should have in order not to inevitably end up in a ruthless drawer without memory, but in the end even if the game could be finished in all the sauces, the multiplayer always offers the pinch of pepper that may be missing in a 21st century strategy game. Having said that, all we have to do is sum up and say that War & Peace is a title that will not fail to amaze all those who dreamed as children of taking on the role of Napoleon to conquer Europe, leading an imposing platoon of heavy cavalry. A title capable of giving joy to lovers of military strategy from a few centuries ago where muskets were the masters and battles took place under the incessant roar of cannons. You will live a unique experience by controlling the entire terrestrial globe with short clicks of the mouse, moving in the environment in three dimensions, zooming in on your armies assaulting a city and personally checking the state of things and the advance of the enemy fleet on the horizon . Except for the lack of Multiplayer War & Peace can be remembered as a good title, fun and exciting ... why not try it then? From Druuna to Napoleon. Many of you will be familiar with Microids. The boys will probably remember with a languid and melancholic eye the very buxom Druuna, probably the only rival of the legendary Lara Croft, born from the pencil of the Venetian designer Paolo Euleteri Serpieri, made into video game heroine by the skill of this software house. Others will remember the Microids name for more recent titles like Post Mortem or the original Warrior King. Now the time has come to introduce the latest addition to the family, War & Peace, a historical real-time strategy game. In many ways original, and interesting at the same time, thanks to this title we will be able to experience the thrill of participating firsthand in the battles that inflamed the minds of statesmen who lived in the 19th century.", "date": "2002-11-07", "grade": null}