{"name": "Hitman 2 - Day Two", "ref": "https://multiplayer.it/recensioni/hitman-2-day-two.html", "text": "Do you see me or don't you see me? But how much do you see me? Hitman 2 has among the new features a sensor that indicates the degree of alertness of the guards around us. The sensor is a small bar to the left of the screen that turns red and begins to shake when someone around us begins to have suspicions about us. It is clear that if we throw ourselves headlong into the home of a mafia boss by taking up an assault rifle, we will certainly alert the guards; but even just passing in front of a guard on the run, rather than trying to ignore it and go through a checkpoint, increases the degree of distrust of the guards towards us and can make us discover them inexorably. Often, to lower the value of this bar, it is enough to get away from the guards and ignore it. Sometimes, however, there is absolutely nothing to do and the only solution is to remove the obstacle. However, you must always be very careful when eliminating a guard, because the others could find the body and consequently go in search of the murderer. And it's no fun having to navigate a level that's teeming with armed guards who are looking for a tall, bald guy with a serial number tattooed on the back of his neck. That's all for today too. See you in the next episode to talk about the setting and the technical aspects of Hitman 2. To err is human If you think that Hitman 2 is an easy game to finish, think again. Often and willingly it is necessary to repeat the same mission several times before being able to reach the goal. And the funniest thing is that every time it turns out that the mission can be accomplished in many different ways and taking advantage of different situations. It's never clear how to get close to our target. Most of the time we have to invent some system and take advantage of the elements of the territory in which we move and the various objects we can collect. Even the objects we find are often difficult to interpret. Sometimes we find them but at the moment we really don't know what to do with them, until, continuing to play, we run into a situation where they become of fundamental importance. Thankfully, in Hitman 2, we have the much coveted saves that were missing in the first episode. Now we will no longer be forced to have to restart the mission from the beginning every time. Depending on the chosen difficulty, the number of saves for each single level changes. At the end of each mission, we are provided with weapons that we accumulate in our ~shed~ where we like to pass the time between one mission and another. The amount of weapons and the number of saves for the next mission are awarded based on how good we were at moving silently and completing the mission without alerting anyone.", "date": "2002-11-01", "grade": null}