{"name": "Mega Man Battle Network 2", "ref": "https://multiplayer.it/recensioni/mega-man-battle-network-2.html", "text": "Between real world and virtual networks The player's alternation between controlling Lan in the physical world and Mega Man in the virtual world is what makes Mega Man Battle Network 2, like its predecessor, extremely enjoyable to play. The game layout is in fact the classic RPG one in the sections in which we will control Lan in the real world, solving simple puzzles and conversing with the non-playable characters that populate the suggestive futuristic world of the game, but it changes slightly when the player takes control of Mega Man and controls him in the computer networks: here, in fact, the game system itself is integrated by the presence of viruses to be defeated, which appear in the most unpredictable moments as in the good tradition of role-playing games and constitute the combat aspect of the title. In fact, on the net and in the real world, we will find chips useful for Mega Man's abilities, which we will be able to manage within the information folders of our PET and which we will have to organize in the best possible way to optimize Mega Man's power at the time of the clashes. The fact of being able to switch at any moment (or almost) between the physical and the virtual world, in which the fights take place, makes it possible to manage the situations of relaxation typical of the dialogues of the first section and those, instead, of tension and commitment of the fights , with the result of making the game very enjoyable even with a non-excessive and continuous commitment, and focused instead on the most topical moments. Between real world and virtual networks Not only is it fun to ~receive emails~ through which to communicate with the characters and dialogue with Mega Man at all times, but the fact of being able to connect Lan's PET to practically any electronic device present in the real world to transfer the mechanical hero very entertaining and offers variety and entertainment not only in important moments for the plot (when, for example, we will have to save Lan's friend from a malfunctioning ventilation program due to a virus); but also in the secondary tasks of the adventure, nice diversions from the main plot during which we will be able to control our Mega Man in the program of a vending machine, a television switchboard or even a GameBoy Advance, in which one of the good programs (anthropomorphized like a little robot) he will tell us that he is proud of making the kids socialize but he will also confess that he is tired of the amount of different software with which he has to communicate! Strong point: the clash system The game structure, therefore, divided between a world of dialogue and plot and one of fights and missions on the net, both communicating, proves to be very enjoyable in full respect of the more disengaged tradition of RPGs. However, it is arriving at the combat system that Mega Man Battle Network reveals its originality, constituting itself as a mixture of turns and real-time action and thus being enjoyable for fans of both styles of play. The moment a fight begins we will find Mega Man facing the dangerous viruses (whose look is borrowed from the Megamanian ~fauna~) in a chessboard made up of boxes, some of which are accessible to our movement at any moment; the movement of Mega Man and the various viruses takes place in real time on this chessboard, while we have two ways of attacking: the normal single shot from Mega Man, practically ineffective at first, or the use of the combat chips which they will appear, at random, in the weapons menu that we have conquered in the game, with all the more probability depending on how we have ordered them by access frequency in the properties of our warehouse and above all they will not be usable before a special loading bar gives us access to the their choice Basically, the combat is in real time, while the choice of weapon use is limited by reloading from the turn bar and, obviously, by the properties of the weapon itself: we will thus have chips that attack diagonally, useful for multiple enemies in contemporary, very slow and difficult to target weapons that will prove useless for attacks on enemies that move a lot, power ups that will restore our energy, weapons that can be combined or not with others, weapons that strike only vertically or only diagonally and so on . Strong point: the clash system The strategic and ~turnistic~ use of the frequency of availability and of the properties of the weapons, combined with the knowledge of the type of attack and defense of the enemies and the action in real time, make the combat system of Mega Man original and engaging, very easier to apply than to describe, inseI make good news in a simple but solid RPG rig. The linking and multiplayer modes, which allow the exchange of chips and battles between players but also ensure compatibility with the first Mega Man Battle Network, are then an offer of sure impact and which takes full advantage of the excellent system of combat to ensure above average longevity. The Pokemon saga, in this, has happily made school. Futuristic and slightly bizarre atmospheres As far as the aesthetic characterization is concerned, Mega Man Battle Network 2 proves to be simple and effective: the game is very colorful and the characters are well animated and drawn, sometimes very characteristic, while the sporadic special effects pleasantly embellish the cartoonish look of the settings, almost a mixture of Japanese pop-culture and cyber culture made lighter by the lightness of the style. Too bad for the slight repetitiveness of the Network setting which, combined with the absence of a map, can disorient the player or get bored after long stops. It is undoubtedly a very little ~adult~ look and perhaps for this very reason, and because it is unpretentious, relaxing and fun. But the aesthetic characterization is undoubtedly also linked to the plot and the dialogues present in the game, with all their load of more or less direct references and jokes relating to cyber culture, the world of technologies and the universe of Capcom characters: money which will serve you to stock up on subchips to recharge, new combat chips or particular items, not surprisingly presents the name Zennies of Capcomian memory, but also many enemies and protagonists are taken at the foot of the Mega Man platform saga or present themselves as pleasant pills of various characters. A guise both narrative and aesthetic fun, in short, truly suitable for everyone. Futuristic and slightly bizarre atmospheres In terms of sound, however, something more could have been expected: the music is pleasant but a little repetitive and the sound effects too few, to the point that they are reported, like a comic, in the dialogues of the characters. However, it is an aspect, in this case, of secondary importance and that does not affect the quality of the product, given that the climax of tension and the explosions of the weapons in the fights are in any case assured and that the general tone of the accompaniment manages to pleasantly to be eclipsed by serving, invisibly, its purpose. To conclude... ...Mega Man Battle Network is a solid RPG, well built and with an excellent, highly original combat system that makes it unique in its genre. Fans of adult plots or more demanding RPGs could be disappointed by the simplification of many puzzles, by the clichs of the genre (sellers of items, characters suggesting situations and so on) and by the ease of solving certain tasks, but in this case the plot is a pure expedient, conceived more to amuse and guide than to engage the player, entertained in view of the beautiful clashes with enemies or introduced to the combat system. The characteristic of collecting chips and accessing their properties in a catalog, clearly borrowed from the Pokemon series, then extends the life of the game, while the multiplayer transforms it into a cartridge that you will always come back to pick up with a friend for quick challenges against last chip. It is therefore an excellent title which, however, presents a single, serious problem: it is all too similar to its predecessor, with respect to which it does not bring any graphic, stylistic or gameplay evolution, limiting itself to improving many details on the already excellent concept. All owners of the first episode, unless they are true fanatics, may want to avoid buying a near-duplicate of the original. So here's a tug of ears to Capcom for its annual saga update mentality, really out of place here: the typical seriality of fighting games or survival horror is not admissible, with these few changes, for an RPG of this type, even if equipped with chip exchange system. That said, it is a purchase that we can safely recommend to all players who want a light, fun and original game or who wish to challenge their friends who have the first chapter. To conclude... Pros: Simple and solid RPG system The dual reality/virtuality game plan is fun Very original fights, between turns and real-time Nice aesthetic characterization and quotes Can link to the prequel for data exchange Chip exchange mode and multiplayer battle Cons : Nearly identical to the original in all respects RPG purists mightbero find it simplistic Linear plot and tasks a bit 'obvious Mega Man Battle Network 2 is an original role-playing game set in a world where technological progress has allowed the development and diffusion of NetNAVIs, virtual navigators that have become real electronic alter egos of the owners and hosted in very sophisticated and compact portable personal computers : PETs, practically indispensable in the futuristic world of Mega Man Battle Network due to the vastness of the functions they perform, including those of telephone, mail server, encyclopedia, personal ID, access to information networks and so on. However, the information channels are threatened by dangerous viruses, and it is easy to understand how much such errors, bugs and malfunctions can mean in a world where practically everything is equipped with microchips and where the network is a real parallel world. This is why NetNAVIs and their owners must be trained to fight viruses: trainings are as common a practice as driving a driver's license in our age, with the difference that they are even carried out in schools, including the one where our young protagonist , with the clearly evocative name of Lan, has just spent the last day before the longed-for summer holidays: a summer that he intends to spend having fun with his friends, but which is incubating a terrible threat for the whole world in the form of a terrible underworld organization by the name of NetMafia. It will be up to the player to step into the shoes of young Lan and Mega Man, immersing himself in the plot and learning to alternate between the real world and the virtual world of the network to defeat the bad guys and become an Official Government Netbattler.", "date": "2002-11-01", "grade": null}