{"name": "Quantum Redshift", "ref": "https://multiplayer.it/recensioni/quantum-redshift_a.html", "text": "Technically speaking: GRAPHICS The graphics are certainly the strong point of this product, the graphics engine created for Quantum is certainly one of the most solid and rich in detail that I have ever seen running on the Microsoft monster. Stratospheric speeds in advanced tournaments (although initially you will run in low profile speed races), large and futuristic levels seasoned with dynamic elements, always very detailed textures, particle effects, light, reflections and anything else all over the top! Nothing seems to be able to intimidate Quantum from the palm of best graphic design for a driving game (albeit futuristic). Already from these premises you may have thought: ~Then WipeOut has been literally swept away!~. However, I would respond to this statement with an ~It's still too early to tell!~. Certainly on a purely ~production~ level, there isn't much to say, in QR EVERYTHING runs faster and more fluidly, immediately impressing the gamer and continuing to amaze him as the game progresses (even if at more advanced levels you will certainly have time to admire the graphical wonders of QR). In my very personal opinion, however, Wipe Out is a step above QR in design (and perhaps only here), preferring the style used to design the various ~spaceships~ and in painting the gloomy atmospheres of the PSX (and PS2) title. This very personal preference of mine is simple to ascertain: if it is true that the type of game is practically the same, it is equally true that the design and the environmental context recreated by their developers are very different. QR is much more colorful and sumptuous, projected into a future all about TV and sponsors, albeit bloody like the much more gloomy and decadent one of Wipe Out (well at least they gave me this feeling). From here it's easy to understand how I mostly prefer the design and the ~charisma~ of the nacelles studied for WipeOut, as well as the generally darker tones (even if, I want to repeat it, you can't make comparisons in the realization!). Technically speaking: Audio Moving on to the sound sector, we can say that the whole game is characterized by ~acid~ music composed by Junkye XL, the same DJ who has skilfully mixed the voice of the legend Elvis, creating the fantastic ~A little less conversation~ (perfect musical accompaniment of the latest advertising campaign of a well-known ~sports~ brand). The genre of the tracks included in QR is certainly of a different nature, much more ~acidic~ and strongly mixed; frankly, not knowing about many musical genres, I wouldn't know exactly how to classify the inserted pieces, but I can certainly pay another bow to the decisions of the developers, who have even hired the most popular DJ to ensure the most suitable soundtrack for their title. Certainly not being a fan of this musical genre, I greatly appreciated the option to change the audible soundtrack during our ~racing~ raids. Even the sound effects are respectable, always full-bodied and convincing, they manage to recreate the damned and dangerous environment of these races properly. From the technical specifications it seems that the surround systems are also exploited (or positional as you prefer), with full benefit for the global immersion and the ~heart-pounding~ impact on the poor player. Playability & Longevity Even in terms of playability, it seems that there are no real flaws, the control is simple and intuitive, we will be able to use the triggers to accelerate and brake, the left stick to curve and the four main keys to activate the special ~abilities~ of which the our shuttle is equipped. At this juncture I would like to dwell for a moment on the command system, so well ~matched~ to the game system: as everyone knows, the xbox pad corresponds to a particular color to each main button, similarly the QR programmers have created 3 ~ power-up~ or power-ups each with its own color, directly attributable to the pad keys (Blue power-ups to reload the non-seeking weapon, Yellow to reload the shields and Red to reload the seeking weapons). The result is amazing, as simple as it is effective... there is nothing left to do but become familiar with the chosen ~medium~! If you know Wipe Out, you already have a very close to reality idea of the game mechanics of QR. For all those who don't know what Wipe Out is, we can summarize everything in a few lines: QR will catapult you into a sport full of weapons, violence, speed and money! Of course money, and I assure you that you will need it very badly if you want to have the slightest chance of completing a race at the most advanced levels. During a race you will have many chances to raearn money, for example by attacking other pilots, collecting the most power-ups, breaking the track record or even destroying your colleagues' shuttles (so as to throw them out of the race). At the end of the race, you will be awarded a certain amount of money, based on your performance, and you will be able to upgrade your racing car in three sectors: armaments, which allow you to increase not only the damage of each blow inflicted, but also the ~slots ~ available to launch a greater number (maximum 3 per type of attack), the armor of your shuttle, of course if this parameter reaches zero you will exit badly from the race, and the amount of turbo available at each lap, this too is really important for ~recover~ quickly from a blow suffered, to make very long jumps useful for reaching hidden areas or for quickly overcoming the most impervious climbs. Then you ask yourself: Maybe it will have some uncertainty in longevity? Maybe there are only a few tracks and it ends immediately?~ of speed... you can be assured that the last ones are truly incredible!Each tournament has a different number of sessions all based on eight tracks and as many variants (therefore there are 16 circuits to face); at the end of each competition (excluding the first ), you will have to face your nemesis, that is the antagonist character to the one you have chosen, in a very hot ~one-on-one~ battle. And here's another novelty, at the beginning you will have eight characters to choose from, each with the use ~home~ circuit, his ambition, his past and also the sworn enemy!The idea therefore of introducing a plot linked to each character, of being able to touch this rivalry in each race is really intriguing and also adds some depth to the whole game. It's a pity that this point was poorly developed, with really dull dialogues devoid of pathos, competitions devoid of malice, of those ~puncturing~ that we can expect from our nemesis. However, this game of ~agonists and antagonists~ helps to extend longevity a lot, since to unlock all the ~nemeses~, you will have to win all the championships with all the characters!!! Calculator in hand, if we wanted to make a quick count of how many races we have to face to unlock everything, you will have to win all the tournaments about ten times, moreover the tournaments have 2 events in the Beginners and Amateurs category, 4 events in the ~Experts~, 5 in the ~ Masters~ and in the ~Redshift~ one, so there are at least 18 victorious races for each character, which translates into about 180 races (counting only the won ones, of course)!!! Concluding At first glance this game might seem nice but dull, like many others, with top-level graphics and poor content; on a more in-depth look, however, the cards on the table change, not only for the graphic detail but also for the music created ad hoc by Dj JunkyXL, with enveloping and damningly powerful positional sound effects (always if you have a suitable audio system), from superfine playability, a simple but effective key configuration, a well-tested game mechanic (here expanded with new ideas), and a longevity guaranteed by the many elements to unlock, such as the main characters' nemeses and their personal ones race shuttles. And yet after so much ~videogame good~, I don't feel like considering QR a real Killer Application, perhaps because I don't find this title as compelling as it could have been; this precisely because the necessary ~charisma~ is missing, that atmosphere is missing, that ~emotional~ involvement, which also lent itself well to the ~discourse-clash~ between the protagonist and his nemesis. The sensation we feel when we play QR for a long time, even if it is satisfied on the one hand by the trip of lights and colours, by the great speed and fluidity of the game, by the stratospheric graphic detail, by the music and sound effects that pump adrenaline rushes on our heads , on the other hand we feel a void, as if something was missing that spurs us on to go on, even after winning all the tournaments for the first time, perhaps to unlock other nemeses or to try to run with other shuttles. In short, the competitions and the whole game system tend to remain too fine in themselves, as if everything behind it were just a nice side dish (without flavour), so as not to leave the main course undefended. In conclusion, I find QR a great game especially from a technical point of view, capable ~alone~ of making the less convinced of the power of di this console and literally cut off the legs of its detractors (unless they are blind or dull-witted, of course) at the first blow of Turbo. Definitely highly recommended to those who have already appreciated the ~ancestors~ (the Wipe Out series above all) of this futuristic incarnation of racing, while I believe greater attention is needed for those who are not ~practical~ in this genre. Concluding PRO Graphics engine of the most solid and fluid ever seen, full of effects and details; Superlative playability, control system perfectly studied for the game mechanics of QR; Deep and powerful sound compartment, provided you have an adequate audio system (dolby digital 5.1); Longevity guaranteed by the large number of unlockable characters; Basic idea already tested and enriched by some new ideas (such as the existence of nemeses); Multiplayer mode up to 4 players, always fluid with acceptable loss of detail; Localization in Italian of all texts, both paper and multimedia; CONS Design of the 3D models (of the characters and to a lesser extent of the shuttles) not very inspired; The music, even if studied ad hoc, I doubt that everyone will like it... luckily there is always the possibility to listen to the songs we want; The story that surrounds the races is far too flat and without bite, it risks impoverishing the race sessions; the futuristic and damned atmosphere of QR is ruined by the really dull interlude dialogues and the lack of ~competition~ during the races; You may even get tired, well before unlocking all the nemeses, if you are not a fan of the genre; An evolved Replay system is missing, with so much graphic goodness we would have liked a ~special study~ as seen for SegaGT2k2. Presentation & Packaging You know how much I care about localized versions, and how much I fight to reiterate the importance of translating ~imported~ products into our beautiful land; the introduction of subtitles in games (especially where the understanding of texts and/or audio messages is required) seems to me at least a duty! However, their cost is limited and makes the product much more attractive and usable. Here we won't have real reasons to scold the developers-distributors, given the almost total localization of the product (only the dubbing is missing, but original voices are better than bad dubbing)! From the full color packaging (box and manual), to all the game texts up to the ~vocal~ interventions, they have been translated excellently (only in the manual I noticed a translation error in the introduction that was really of no importance). From this point of view, ~hats off~ to the guys at Microsoft Games Studios (or whoever took care of the localization for them) for the enormous effort made, and for the good results obtained.", "date": "2002-10-21", "grade": null}