{"name": "Need For Speed Hot Pursuit 2", "ref": "https://multiplayer.it/recensioni/need-for-speed-hot-pursuit-2_a.html", "text": "The game modes After a rather effective introduction (which immediately makes you understand what type of game you are facing for those who don't know it yet), we arrive at the main menu where we find various options. As in the previous chapter, here too, in addition to ~Single Challenge~ and ~Quick Race~, whose characteristics are easily understood, we have the 2 modes par excellence: ~Hot Pursuit~ and ~Championship~. I don't think it is appropriate to describe in detail the first two game options that I have listed but rather the other two. Hot Pursuit is probably the most distinctive mode of the series. It is made up of a series of 33 events, in turn made up of different types of races: there are single races, tournaments obviously made up of several consecutive races, the ~Knockout Races~ where a competitor is eliminated each lap (the last arrived on the finish line) until the only winner remains, and the ~Be the cop~ mode in which you will have to chase your opponents, obviously with the police car. Yes, because precisely this modality is characterized by the presence of the police in the race: in addition to having to try to win, you will also have to be careful not to be arrested. And, rest assured, the policemen will try in every way to stop you: while at the lower difficulty levels there will be only one car chasing you and which will be easily lost (especially using the various shortcuts on the track), as you progress through the events or if you raise the level of difficulty, the cars will increase or the policemen will opt to use a checkpoint, sometimes alongside a spiked strip, or they will require aerial support from the helicopter (which will unload explosive barrels on your path), or even the support of other supplementary units (up to a maximum of 5). To say again that all these ~aids~ to catch you can be used by yourself when you play the role of defenders of the law. Championship is the other main game mode. Also here you will have 33 events to compete (here the police obviously disappears from the race and obviously the ~Be the cop~ option) and as you advance in your championship the difficulty level will be more complex (for considerations on the level of difficulty see more ahead), the most powerful cars available and the longest and most complex tracks. As far as the tracks are concerned, we see that the main settings of the game are 12 and the circuits in total more than 60. In fact, as happens for example in Project Gotham Racing, the programmers have opted to use the background setting several times, opening or closing crossroads to make the route different, or making us run in the opposite direction or making the so-called mirror effect of the circuit (i.e. curves that were previously on the left are now identical but on the right). In addition, in each circuit there are several shortcuts (mostly on the dirt road) which will allow you both to gain time and to misdirect the police cars. The cars, on the other hand, will certainly satisfy everyone, as they are all very fast, well made and well known: bear in mind that the first cars you will have available will be Lotus Elise, Opel Speedster, BMW Z8; but there are also (and will be unlocked later) Porche 911 Carrera, Ferrari 360 and 355, the Mc Laren F1, Jaguar, the Lamborghini Diablo 6.0 VT and Lamborghini Murcilago, the Doge VIper GTS and many more. Lastly, it should be noted that by winning a bronze, silver or gold medal in the ~Hot Pursuit~ and ~Championship~ events, you will earn more or less points, which will allow you to unlock the fastest cars or more complex and twisted paths. Concluding Graphically, the game is pretty good. The asphalt textures look very real and the aliasing on the surroundings and on the cars is almost completely non-existent. The cars can also be damaged aesthetically (and the damage will affect not only the aesthetics but also the performance of the vehicle) and the backgrounds are really very well designed, they almost look like a continuation of the circuit environment: in this respect it should be noted the total absence of clipping effect and a very extended visual depth; however, this is somewhat to the detriment of game speed: in fact, the idea of speed could be made better and sometimes (fortunately few) there is also some noticeable slowdown. As far as the sound is concerned, it should be emphasized that the sound effects are good: in fact, each car corresponds to an engineslightly different, the police radio is voiced very realistically and the echo effect inside the tunnels is very impressive. The soundtrack is made up of songs very relevant to the genre of the title and, if they are not to your liking, there is still the possibility of using your own (obviously saved previously on the Xbox HD). A final word should be spent on the general level of difficulty of the game: while in the ~Single Challenge~ mode you can choose between 3 different levels, in the ~Hot Pursuit~ and ~Championship~ modes the level is fixed: the problem is that at least in half of the events the chosen level seemed elementary to me, to then get a little more complicated in the following ones and finally become ~serious~ in the final competitions. Concluding PROS Lots of cars and lots of tracks to choose from Possibility to use your own soundtracks during the game Very fun against the police mode Great visual depth and no clipping and aliasing CONS Very easy difficulty level at the beginning of the game Gives the effect of speed is little (only over 200 Kmh/h is felt) Some slowdown in situations that are not too complex of action To begin with A fiery autumn is expected for the Xbox: there are really many and all interesting titles that we will see arriving on the shelves of our video game stores in the coming weeks. And in the last week of October, the release of the title in question is expected, of the latest effort (so to speak) by the EA guys: Need For Speed 2 Hot Pursuit.", "date": "2002-10-17", "grade": null}