{"name": "Silent Heroes: Elite Troops of WWII - Recensione", "ref": "https://multiplayer.it/recensioni/silent-heroes-elite-troops-of-wwii-recensione.html", "text": "Heroes are born and I was born! No way, the hero's job is tiring. One day you wake up and they place you in the middle of a field, with a pistol, a rifle and two pieces of ammunition in your rucksack, surrounded by a hundred enemy soldiers and a few dozen armored vehicles. Plus, it's payday for the bad guys and there's been a delay in delivering payroll. You can imagine the wind blowing. Silent Heroes travels on the rails of hit and run, stealth is essential Heroes are born and I was born! Silent Heroes travels on the tracks of the hit and run, stealth is essential and rummaging among the corpses is an imperative, if you want to survive beyond the first five minutes. Although the graphics have remained in hibernation two years ago, the game is appreciated for many other qualities, such as for example the beauty of the explosions or the sadistic pleasure of seeing a tank roll over and remain face up, after having precisely placed a nice grenade between the tracks. a feature of the game is that the enemies will always be overwhelmingly outnumbered and very well armored Heroes are born and I was born! In reality, having the right tactical sense, the game becomes a source of inspiration for fun and spectacular war actions. Do you want to put, sneak into a trench and mow down all the soldiers, in line, with a prolonged burst of MG-34 (it is the machine gun with the tripod that the maranzas hold with one hand)? Or setting fire to the turret of a tank, with a Molotov cocktail, and seeing the soldiers rush out, some already on fire, before the ammunition explodes? But happiness is found in small things, so a wave of a machine gun can give joy in the same way as a grenade or a mine. There are so many ways to die and Silent Heroes shows us quite a few. These are things that give pleasure! [C] With only three soldiers, it's a challenge. possible to make a carnage. Note the overturned cart and the burnt grain. Fire is an essential element in the game. A Molotov cocktail, the fire spreads, the Germans come out and my sniper gets ready for work. Before each mission there is a mission. the inevitable briefing. [/C] The game system makes heavy use of AI, in the sense that the soldiers, left free to act, do things, make decisions and pay the consequences. Obviously everything must be supervised by the player, who must decide whether the soldiers will have to attack whatever happens in their visual range or just return fire or even do nothing. Advisable - very warmly - the ~fire back~ option. It's up to the player to tell the soldier how to move, whether standing or crawling, it's up to the player to place the soldier behind a shelter and it's up to the player to be stunned when that idiot comes crawling and then stands up, once at his destination, unleashing the enemy hell and sending a well thought out plan in smoke. This doesn't always happen but rather rarely, but it does happen and it's a real nuisance. It is therefore advisable to save often, use different slots, fasten the helmet and, please, have the lights on even during the day. Furthermore, an extremely useful option is the possibility to take direct control of the unit, by holding down CTRL, and fire yourself, instead of letting the AI do it. As we said, Silent Heroes travels on the tracks of hit and run. A feature of the game is that the enemies will always be overwhelmingly outnumbered and very well armored. Therefore, a baiting strategy is required that attracts a few enemies at a time. War is an ugly beast To make things less easy is the absence of the so-called active pause, which allows you to stop the game, issue a series of orders and coordinate actions calmly. In our case, however, the break is a break and we will not be able to take advantage of the stopped game to whisper orders in complete safety to our digital allies. But, to reduce the level of frustration during the most agitated and frenetic actions, a device that is a close relative of the active break comes to our aid: the speed of play. every vehicle needs a certain type of crew War is an ugly beast Using a cursor, we will be able to speed up or slow down the speed of the events according to our needs. To coordinate a good attack, we can slow it down to a minimum and issue orders calmly, while we can accelerate time to the maximum if we have to travel long distances, from one part of the map to another. One of the most heralded features from the press releases is the fact of being able to destroy everything present in the scenarios. This is actually true, but it doesn't always happen in the way you hoped. For example, if you find yourself wanting to take down a barbed wire fence, thethrowing a grenade will only dig a scorched hole underneath, but the fence will stay in place. To take it down you will have to cannonade it. Another feature is the possibility of driving more or less armored vehicles and maneuvering fixed positions. Every vehicle needs a certain type of crew, so a truck will need someone at the wheel and everyone else will be simple passengers, while a tank will need someone at the wheel but also a machine gunner and a cannon man. Obviously, in the absence of men, it is possible to reassign the roles, so if we put the driver behind the cannon, the tank will stop moving and start shooting. There are a couple of extra actions to take when it comes to vehicles and vehicles. We will be able to supply them with fuel, when we find the appropriate tanks, and we will be able to repair them using the appropriate kits. This goes in favor of a certain thickness of the game, favoring an approach that is not totally destructive but one of ~intelligence~ and organization of priorities. The hardships of the mess tin A note of demerit goes to whoever edited the manual and all the part related to initial learning. Let's start by saying that there is no tutorial whatsoever and that being immersed in the action right away is damn frustrating. For those accustomed to the classic point and click standard of RTS, the new interface will initially be very cumbersome. To this we add that the information contained in the manual is reduced to the bone and that to understand certain mechanisms and the meaning of certain icons there is nothing to do but rely on experience. A clarifying example: if the soldier is carrying a weapon and has no space in his backpack, when he gets on a vehicle he leaves the weapon on the ground. This is not explained anywhere, neither in the manual nor in the game. You understand that finding yourself in the need to rush out of a burning vehicle and take up a rifle to cover your retreat is particularly embarrassing when you discover that you no longer have the rifle (left who knows where). Having said that, however, once you enter the heart of the game mechanics, the interface will be functional and immediate. Or, more simply, the player will have gotten used to using it. in the end the soldiers will only carry ammunition and grenades, plus some medkits The hardships of the mess tin [C] As you can see, Private Masha is a very special character. a woman, yet in the panel it is; depicted as a man, moreover, she is depicted as a man. been given the voice of a man, to an eerie Amanda Lear effect. With direct control I'm about to throw a grenade under the tanks of that tank (blue dot). There will be soon. only smoked iron. With a little of patience, it is; You can find the right tactic for every situation. When taking cover behind objects, these icons with mysterious meanings appear. It is useless to consult the manual, since it is necessary to consult the manual. there is nothing written about it. [/C] Unfortunately, the game is not free from flaws. The soldiers' backpack is too small and forces them to make choices about what to bring and what to leave. Actually questionable choices, since in the end the soldiers will only carry ammunition and grenades, plus some medkits. What is left on the ground can always be recovered at a later time, or taken from new corpses. the physics is present in an unobtrusive way, but it is there The hardships of the mess tin The reduced backpack is just a nuisance, it doesn't add any extra strategic components. The AI, as we have said, occasionally goes its own way, ruining the player's liver, but a little more attention is enough to avoid disasters. The graphics engine is old, there's nothing to say, the ground textures are grainy and there are no new generation effects, but that's okay. The explosions, the smoke, the tracers, are done well, the physics are present in an unobtrusive way, but they are there. An explosion is capable of hurling bodies and objects in a realistic way, destroying an armored vehicle means it blows to pieces and, if you manage to place a grenade under a tank, you can even make it overturn. What is perplexing are certain completely unjustified slowdowns, when the situation gets very hot. System requirements Minimum Requirements: Windows 98SE/ME/2000/XP; DirectX 9.0b; 1GHz processor; RAM 256Mb; video card ATi Radeon 8xxx; nVidia GeForce 2 with 32Mb RAM; DirectX 9.0b compatible sound card; 8x CD-ROM; 1.5 GB hard disk space. Recommended Requirements: Windows 2000/XP; DirectX 9.0b; 2GHz processor; RAM 512Mb; video card ATi Radeon 8xxx; nVidia FX with 32Mb RAM; DirectX 9.0b compatible sound card; 8x CD-ROM; 1.5GB spaceon hard drives. Test machine: Windows XP SP2; Athlon64 3200+; 2GB RAM; Ati Radeon 9800 Pro 256MB; DirectX 9.0c. Conclusions Like any low-budget production, when the strengths and weaknesses are equal, special attention should be paid to rewarding the greater effort of the developers. In this case the game is not bad at all and the defects found are not so serious as to irreversibly ruin the experience. Playing Silent Heroes is fun, it's rewarding, and it's one of those titles that makes you jump in your seat and go ~YOU!~ when a good plan goes through. What, on the other hand, weighs on the judgement? There is an old graphics engine and there is an inexplicable lack of tutorial, which makes the learning curve very steep and frustrating. There's the lack of multiplayer and there's a naughty AI that occasionally decides to go its own way and always does it at the least appropriate moments. Apart from the initial stumbling block due to the cumbersome interface, the game is fun and will surely fascinate more than one of you who loved that Commandos, progenitor of a genre that still has so much to say. And what do you want, it's also cheap. Pros Fun fights. Possibility to destroy practically everything. Get hold of a tank or a cannon and let off steam. Cons Graphic engine identical to the previous chapter. AI a little too anarchic. Cumbersome interface and high learning curve. Winning team... ...you don't change, and that's exactly what the Dark Fox guys must have thought, after the success of Soldiers: Heroes of WWII, developed by Best Way and published by Codemasters. And of this Soldiers, our Silent Heroes is a more than direct emanation: an unofficial sequel to be precise, since everything suggests this, from the practically unchanged gameplay, to the graphics engine that is neither more nor less the same, to the interface that to define identical is an understatement. Even in the title, Silent Heroes: Elite Troops of WWII, there is a certain assonance with the episode published by Codemasters. What is missing, unfortunately, is Codemasters itself, with its money. Soldiers was a great game, with some flaws with the AI, but basically a good product. It was 2004 and it received flattering votes everywhere. Today, two years later, the baton passes to Paradox Interactive, which is responsible for distributing a product in all respects identical to the previous one, both in terms of graphics, interface and gameplay. Clearly, Paradox is not Codemasters and the lack of a wealthy publisher behind it has slowed down technical evolution, so someone will have done the math in their pocket and said ~do you know what's new? The engine already has it we have and therefore we keep it as it is~. If you hadn't figured it out yet, this game was born under the banner of a tight budget (the large number of logos bears witness to this) and is a re-proposition of what we have already seen with Soldiers, indeed it could be considered a stand expansion to all intents and purposes -alone, that is, it works by itself, without the need to install anything else. If in 2004 this formula produced such good results, let's see what happens two years later.", "date": "2006-12-22", "grade": null}