{"name": "Antz Extreme Racing", "ref": "https://multiplayer.it/recensioni/antz-extreme-racing.html", "text": "The game The controls in the game allow you to pilot our insectoid alter ego quite easily were it not for the fact that some collisions with obstacles could leave you a gap from your otherwise unbridgeable opponents. Maybe I'm in denial with this type of game but some challenges seemed difficult enough to me since the other competitors don't seem to make mistakes, stuff to make the Mafia race mission look like a jog in the park. As you progress through the game, you'll be able to unlock new tracks (which aren't many), new characters and other game modes, such as the ability to have infinite bullets, travel the tracks in the opposite direction, etc. etc. Although these are nice additions, in my opinion they are not a stimulus sufficient to play again once finished. And in fact the appeal of such a product is its main drawback. Being a game intended for children, for the more ~savvy~ player, Z the ant would not be the optimal purchase also because the game is all there, piloting the protagonists and trying to get to the finish line first without any particular touch that points it out , except for the different setting than usual. From a technical point of view, the graphics, although suited to its intent, are perhaps a little too bare from the point of view of detail while the sound is absolutely anonymous: you will barely be able to notice its presence. Concluding... In conclusion, Z la ant is an unpretentious game, made to entertain those who don't have much time to devote to their PC and developed for a very young audience, with the idea that maybe the little ones could be satisfied with less. Therefore it is to be recommended if you have in mind the idea of giving a gift to a child who is passionate about the film. If instead it's for you... think about it for a moment because at the moment in all the shops you will find much more entertaining and deserving titles such as Grand Theft Auto III and Mafia. Although in my humble opinion, any child would have much more fun hurtling through the streets of Liberty City in GTA3 than following Z the ant in his exciting adventures. Z the Ant Extreme Racing This game, strangely released not at the same time as the film, is set in the universe created by the Dreamworks film and is basically a driving game, where you can try your hand at various types of tests with the protagonists of the film. As you may have imagined, all the routes are in ~scale~ with our ants and take place in the classic places of this type of setting: gardens, picnics, etc. At the beginning of the game you will only have Z and Bala as characters, but others will be unlocked as you continue in the game, winning the various races. The latter can be carried out in different ways such as running on ~foot~ (or rather, on legs), in ~car~ (mind you, what for an ant could be a car), through a sort of snowboard or in flight. Scattered along the way you will often find several power ups that will give us various weapons or bonuses such as a temporary speed increase and so on. Furthermore you will also have to deal with the pitfalls of the outside world and given your tiny stature you will have to pay extreme attention to the bigger insects, frogs, fly swatters, drops of water because they could prove fatal.", "date": "2002-10-12", "grade": null}