{"name": "TOCA Race Driver", "ref": "https://multiplayer.it/recensioni/toca-race-driver_b.html", "text": "Protagonist inside and outside the car Ryan McKane, our alter ego, is precisely the protagonist of TOCA Race Driver, but the character you know first in the game is actually Ryan's father: a grand tourer driver who is involved in a very serious accident at the end of a race in Michigan, in which he will lose his life. All this happens under the eyes of little Ryan who, deeply marked by the incident, will be driven by an incredible inner strength to make his way into the world of touring racing. And this is where our adventure begins. Yes, I know it seems strange to talk about adventure in a racing game, but the fundamental aspect of TOCA Race Driver, which makes it decidedly innovative compared to all other driving games, is precisely the narrative. Those who have already dealt with V-Rally 3 will find it much easier to understand the type of setting of the new TOCA. The game starts from Ryan McKane's ~virtual~ office, where we can choose the various modes such as free running, multiplayer mode and career mode. The latter obviously represents the soul of TOCA Race Driver. We will have a personal computer at our disposal to receive emails of job offers and it will be up to us to choose the team and the relative championship in which to compete. Each team has an objective to achieve which will be indicated to you before starting, this can be for example a certain placement at the end of the season or the conquest of a certain number of podiums and so on. Obviously the difficulty will be increasing and, starting with the minor leagues, we will reach the most prestigious ones. The races will frequently be interspersed with a series of films that will guide us through the story. It should be emphasized that the developers' intent to completely immerse the player in the life of the character proves to be a perfectly successful experiment and the storyline will encourage you to progress through the game with a certain ease. Mistakes are paid! Unfortunately, the positive aspects mentioned above do not correspond to the same merits as regards the graphic design of the game. The numerous images and videos released before the release of the game had left everyone hopeful, but it is undeniable that the final visual impact of TOCA Race Driver is quite disappointing. It is very easy to understand that the Codemasters guys didn't find themselves too comfortable in exploiting the potential of the Emotion Engine, and the programming errors are highlighted by a final result that brings to the screen a game with defects that only afflicted the first generation PS2 titles. The main problems above all concern the presence of an annoying bad clipping, pop-ups and some rare but evident slowdowns, defects that are too obvious to be able to go unnoticed. Instead, it must be said that the construction of the cars is of excellent workmanship. The 42 cars present are well modeled and look like perfect fully deformable reproductions. The damage simulation is undoubtedly the most spectacular aspect of TOCA Race Driver. Each point of the car can undergo changes following rear-end collisions or collisions with other cars in the race. Shattered glass, dangling bumpers and the various detached aerodynamic appendages are a spectacle, even if it must be said that the damage does not decisively affect the behavior of the car in the race, but the final appearance is very realistic. The driving model, on the other hand, is not so realistic, which is even more arcadey than that of the old TOCAs, but no less fun for this and which should still satisfy everyone a bit. The Artificial Intelligence of the CPU-controlled drivers is great, definitely above the average compared to current driving games. The opponents, in addition to battling us from the first to the last corner, will try in every way to avoid collisions, but at the same time they will be able to make mistakes ending up in a spin or going happily through the fields. The work of the developers from this point of view is really excellent. On the other hand, 38 international circuits have been recreated very accurately, including Hockenheim, Silverstone, Monza, Vallelunga, Suzuka, and others; 13 world championships, including those of the official series: DTM in Germany, V8 Supercars in Australia and the British Touring Car Championship. Finally a wonderful soundtrack coSongs like Search and Destroy by Iggy and the Stooges and Sweet Home Alabama by Lynyrd Skynyrd, and a well-made dubbing entirely in Italian complete the technical aspect of TOCA Race Driver. Last lap In conclusion, we are dealing with a very inspired product with valuable merits from a gameplay point of view, thanks to a very exciting career mode and an excellently developed AI. Unfortunately, TOCA's major graphic defects do not allow it to compete with the most recent titles from a purely technical point of view. A real pity, because for the rest believe me, TOCA Race Driver is one of the most entertaining and exciting races of recent years. Pros: Above average AI Spectacular damage reproduction Engaging career mode Excellent Italian voice acting Cons: Graphic glitches from another era Who's back! Codemasters finally begins its racing adventure on PlayStation 2 after making us race like crazy on the old gray Sony box. Two titles in particular are certainly remembered by all fans of the automotive world. We are talking about Colin Mcrae Rally and TOCA. The latter is instead the first to land on PS2 with the heavy task of having to confirm itself as one of the best driving games even among 128-bit consoles. However, the Codemasters guys didn't limit themselves to an ~adaptation~ of the old versions, but wanted to completely renew the series, churning out a game that goes beyond simple racing, inserting a real story, narrated through videos that they will help to get to know the protagonist and all the characters that revolve around him.", "date": "2002-10-11", "grade": null}