{"name": "It Takes Two", "ref": "https://multiplayer.it/recensioni/it-takes-two-recensione.html", "text": "And here we are finally at the review of It Takes Two, a new game developed by Hazelight Studios, once again under the careful direction of master Josef Fares. The team is the same as Brother: A tale of two Son and A Way Out, and It Takes Two is not that different from the previous ones conceptually speaking: for the third time, the whole project was designed to be played by the start to finish in company, both rubbing shoulders on the same console and through the wonders of online. Despite this important similarity, we are faced with an experience that in terms of content and tone is totally different from its two illustrious predecessors. Brother was an extraordinary debut game, deservedly a bestseller, built on dramatic notes, while in content today it looks almost like a prototype of what was to come later; A Way Out unleashes the concept in a different way, writing a completely action plot on which the gameplay only partially reflects, which knows how much and when to slow down to make us better enjoy characters and situations with almost more adventure-like sequences. And It Takes Two? Stopped fantasy and crime drama in a drawer perhaps momentarily or perhaps forever, with this third opus Hazelight Studios take flight relying on the freedom granted by the imagination at full speed. This has allowed the group to create what is probably their best title, the experience that finally makes this idea of a game where the cooperative is really central. While in Brothers and A Way Out, for obvious reasons, the designers were forced to look for cooperative expedients in a more or less real context, with It Takes Two they were able to do the opposite: here it is the coop component that dictates all the rules. Pixar in the crosshairs It Takes Two - It takes two for twice as much fun! The expedient that allowed all this, which is a great achievement for Hazelight but also for all of us fans of good electronic games, is a less nuanced and simpler story than the previous ones, but no less touching, in any case always well thought out . However, no brothers in It Takes Two, in the foreground in this case we find a couple about to divorce, and the pain that this causes in their little daughter. The trauma of the moment turns into magic when, on a bittersweet last day of love, she and he are transformed into little dolls of cotton, buttons, wood and plasticine. Two heroes who smell of past drawers, ready to survive on a journey that will take them to the stars, without ever leaving their home garden. A treasure adventure I shrunk the boys, but with the roles reversed, which continuously unrolls gameplay on the faces of the players, with a refined ability to gradually increase in intensity as you progress towards the end credits. It Takes Two is a concentrate of the typical climax of Pixar feature films, that moment towards three-quarters of the way through the film where the protagonists scream clinging to some mobile element (the car in Toy Story, the doors in Monster & co...), the part dynamics before the reflection that leads to the grand finale. The journey is well constructed because the two protagonists' exhausting attempt to get closer to their daughter, a daughter who also represents the key that should bring them back to normality, will never come to an end without rediscovering that harmony that started their domestic hearth . Who will you play with? It Takes Two - One moment you shoot and the next you jump and reason. When the ideas run out, the game ends too: there's no room for boredom And you and the person with whom you decide to play It Takes Two will have to put the chemistry together, since there is no single player of any kind, there is no way to play it alone unless you are dying to show off your special skills on Twitch by holding two Joypads at the same time. In It Takes Two there isn't a single passage that doesn't involve the close collaboration between the two characters, between the two players. There would be a lot to tell, but this is such a beautiful, close and unrepeatable experience that any gameplay spoiler would be a small slight towards you, even more than precise plot revelations. What we are most anxious to tell you about, in addition to what you may have already seen in trailers, video reviews and live broadcasts everywhere, is the incredible variety that is hidden in It Takes Two. Its settings are linked to certain mechanics, such as the nails and the hammer in the basements (one player throws the nails and the other can hang on them), or the matches and the inflammable resin (to neutralize the enemies one will have to spread the resin and the other playerturn it on) in the big tree in the garden, but this division will become less and less stringent, allowing the game to plunge us into ever new and gradually more exciting and fun situations. A concentrate of surprises It Takes Two - The settings are all very suggestive, and extremely different from each other. In other games we are used to seeing an idea holding up an entire level on its shoulders, often very long, It Takes Two instead changes rules and points of view continuously and often in a sudden, unexpected, amazing way. In here you'll find gameplay snippets from a dozen different games, as well as all-new stuff of course. One moment you'll be flying in a plane made out of underpants, running away from armed squirrels like in the Star Wars that George Lucas never dared to write, and the next you'll find yourself grappling with what looks more like a two-dimensional platformer where the laws of gravity are subverted. Skill challenges, puzzles, pitfalls, bosses, platforms, chases, killer bees, overturned physics: every five minutes a new idea, a new way to collaborate. But the best thing is that when you run out of ideas, the game ends. It Takes Two lasts even longer than A Way Out: you can touch ten hours if it engages us in mini-games and exploration, but hours of intense ones, in constant revolution. The experience is not difficult, but this does not mean that it is necessarily simple: let's say that it is perfectly calibrated to offer a worthy challenge without ever being excessively bad, thanks also to the abundant checkpoints. Then there is no real game over, given that even in the worst case we return to the game with minimal expectations, and a few meters from the obstacle that had caught us out. To make us catch our breath, It Takes Two hides several extremely entertaining mini-games (there are around 25!), especially when they are encountered organically along the adventure, but once unlocked they can be replayed freely by selecting them from the main menu. A round of applause then to those who have decided to record victories and defeats in each game, so that if the pair of players or one of them takes it personally, the challenge on the favorite mini-game can continue even after the adventure. They are simple yet very effective pastimes, in the tradition of the best Nintendo: there is one in which he has to get out of the trapdoors and she has to give him hammers on the head, another in which you have to shoot moving targets to send them against the opponent, and yet another that sucks us into a sort of multiplayer Battlezone, in addition to all the others that we let you discover for yourself. Split Screen It Takes Two - You won't have seen everything the game has to offer until you've finished it. It Takes Two uses the same dynamic split screen system seen in A Way Out. In these games the screen is mostly split in two, even when collaborating online, so that everyone sees what the other is doing in real time. Sometimes, for narrative or gameplay needs, this screen division changes fluidly, without any interruption whatsoever. It is a gimmick as we have already seen, used less here than in the past, but which works and now seems to have become a true hallmark of Hazelight games. Played on PlayStation 5, it Takes Two is a really beautiful game to look at, totally devoid of slowdowns, even if it doesn't expose itself with who knows what geometric complexities. Let's say that there is much more style than polygons, and perhaps in this case it is a pity: graphics are not everything, but we struggle to hide the desire to see a game like this one day but with mind-boggling graphics, an orchestrated soundtrack luxury. It Takes Two deserves it more than many other products that stand on their feet with their pharaonic budgets, to which Hazelight and Josef Fares do not have access. The only way to make it happen is to continue supporting similar products, and if the quality achieved on the third attempt is that of It Takes Two it shouldn't be an effort for anyone to do so.", "date": "2021-03-24", "grade": "8.7"}