{"name": "Robotech: Battlecry", "ref": "https://multiplayer.it/recensioni/robotech-battlecry_c.html", "text": "Technically speaking: Graphics As you well know, I love cell shading graphics and never as in this case, choice was more apt. After all, we are talking about a videogame reinterpretation of a cartoon, so what better graphics sector could we expect? But did the graphics really do a good job or did they just introduce this ~effect~ without getting busy? I believe that the images and videos shot specifically for this review speak for themselves (like those available around the net on the other hand); fluid animations, bright colors, graphics very close to an animated cartoon, so much so that often you will feel like you are watching a new unpublished episode of Robotech! The graphics engine seems well done, always fluid, solid and beautiful to see in action, especially for the rendering of smoke and light effects; certainly the camera sometimes does not really help us, on the contrary, but I doubt that there are similar titles free from these problems. The only note that I found really annoying is given by the limits inserted to the various settings, or when we will collide in the phantom (how much hated) ~invisible walls~; those ~damned ludic barriers~ imposed by programmers, to significantly limit our freedom of action. This ~invisible adversity~ is well hidden in the levels set in space or in the sky, while it is all too evident in those on the ~ground~ (in urban centers for example); in fact, it will be enough for you to fly up to notice an annoying ~wall~ placed at the roof level of the surrounding skyscrapers, even sometimes these barriers are positioned in inexplicably inaccessible ~open~ areas. These choices, although ~due~ in areas that are too vast (such as the sky or outer space), become really annoying and irritating in more closed ones, such as for example in urban centers (where, moreover, not all buildings are ~damageable ~, indeed, there are very few elements that can be ~modified~ by our strokes). I would have much preferred the inclusion of a limit zone, beyond which the mission was considered ~abandoned~, as has already happened in many other similar titles (the Armored Core series above all). The ~special~ effects and the textures are done very well, especially the Veritechs are really fantastic (from the animations that lead to the various transformations, to the detail of the textures that cover your mech), while everything else tends to be less cared for . Nothing regrettable, for heaven's sake, only a minor care is noticed in the models ~surrounding~ our Veritech (enemy mechs, buildings, etc.). Technically speaking: Audio The musical sector is entrusted to the solid and ~tested~ soundtrack symbol of this series. Robotech fans will simply feel enraptured by the notes that made them dream so much and it will totally immerse them in the Robotech-ian universe, taking their gaming experience to stratospheric levels. The same goes for the sound effects, ~in tune~ with the action and always up to the situation. Also in this case the ~spoken~, being the English (or American, if you prefer) version, boasts quality voices and tones, well set and expertly selected (it seems that they are the original voices of the cartoon ... see you when a localized version in Italian with the same samples? Splinter Cell help us!). An option to listen to our favorite tracks has not been implemented, but in such a title I think it would be a real sacrilege to change the music tracks that made this series so famous. Unfortunately I am not able to provide you with precise information regarding the exploitation of 5.1-channel surround systems (which, if well implemented, could make you experience one of the most exciting battles that the Robotech skies have ever witnessed). Gameplay: I want to be a Veritech pilot when I grow up! Lately it seems a trend common to many games, that of eliminating the possibility of configuring the keys to our liking; in Robotech you can only use the single arrangement studied by the programmers (shown in the images below). Generally the controls are adequate enough and respond well to the commands given, while my doubts remain about the impossibility of using the right analog stick to ~accelerate~ (or brake) in Guardian mode (the hybrid between the bipedal Mech (Battloid) and the Jet), set instead on the directional cross, which is also responsible for recalling the various transformations (left for the Battloid and right for the Jet), so in the most intense moments you can imagine what ~involuntariness~ could happen (naturally in the least opportune moments !). Also in thisEither way, I confess that I would have preferred the adoption of a more classic control system, already seen in titles with a similar framing (such as Max Payne or even Halo for example), naturally optimized for the occasion. As things stand, I find that the control system chosen by the programmers is not sufficiently suited to the level of difficulty of the game, in fact the configuration of the keys is a bit difficult and discouraging, especially in the (many) missions where very high speed is required maneuvering (sometimes you will feel more like a novice magician than a skilled Veritech pilot and in these cases a third hand would be really useful!). The video camera, as already mentioned, sometimes certainly doesn't help us, but the targeting system (at 360 degrees), combined with the skilful use of the radar, discreetly compensates for the ~framing~ uncertainties. Robotech on the entertainment side is a bit fluctuating, it offers many really beautiful and challenging missions, such as those called dogfighters (the first mission is an example), while others (fortunately, fewer than the first ones) are really frustrating. In certain junctures I felt sensations similar to those encountered with Gun Metal, where we encountered missions bordering on suicide, forced to repeat them many times, on the verge of a fiery rage (to say the least), learning a piece of level at each defeat, as if, lacking any freedom of action, we had to get every move right at the right time, in the most classic of Laser Games (Does Dragon's Lair ring a bell?). At least if you were given the right moves to make in a given stretch of time like in ~Super Don Quixote~, it would certainly make the ~work~ less heavy for us (just kidding, of course). Certainly put in this way, it seems erroneously that in some levels the playability is almost completely zeroed, but I can assure you that Robotech's ~playful~ potential is literally crushed under the weight of the level of difficulty that some missions offer. The way some stages have been set up, there is very little freedom left to us on how to deal with our ~problems~. In some levels the enemies will be so numerous and/or powerful that you can never face them head-on without taking heavy damage (unless you manage to master Veritech so well that you can prepare the right counter-move with good timing), forcing us to quick and very brief skirmishes, to use any architectural barrier to make quick ~faces~ (perhaps dispensing a good dose of bullets) and ~tablet~ escapes worthy of the best Diabolik. I would have much preferred a more appropriate balance of difficulty for a similar title, in order to guarantee greater freedom of action, strategy and frenetic (and stress-free) action, as already seen in many other titles (similar and not ); however this remains possible in many other missions (there are 40 of them, you are spoiled for choice). Luckily, the levels I encountered are not completely insurmountable, the important thing is to arm yourself with a loooong patience and be ready to replay a level even a dozen times before concluding it positively. A side note deserves the effort made by the programmers to better characterize the three configurations of Veritech, all really well defined, each with its own pros and cons; first we find the Battloid (anthropomorphic Mech), which turns out to be the most manageable for ~targeting~ capacity (360), but at the same time it is the least powerful in terms of damage inflicted, at the opposite extreme we find the Jet, the most powerful and fast of the three, but also the least capable of targeting, and finally we find the Guardian, a hybrid form of the two already mentioned (similar speech also for its characteristics, handling, speed and firepower). Last note goes to the sniper mode, usable only in Battloid form, which in my opinion is a bit too limited (not very effective), being impossible even the slightest translation during its use; this makes strategic ambush impossible without risking being hit by enemy fire. I think it would have been enough to equip the Veritech even just with a slow lateral movement, useful for preparing (at the appropriate levels) remote thinning strategies; especially taking into account the fact that our vital energy will never have the chance to be restored (either totally or partially) and that there seem to be no checkpoints in the various missions. Longevity: Is a universe to save enough? You can overcome the ~problems~ elaborated in the previous paragraph if you have sufficient patience and perseverance; in this case you will find yourself in your hands a really ~huge~ game, with 40 missions (almost) all challenging and ~risky~, many extras such as: * secret arenas to use in deathmatch mode; * new Veritechs (some can only be used in deathmatches, while others can also be used in Single Player missions) each with different characteristics; *Alternative ~fairings~ for your Veritech, directly taken from the main characters of the series (each had their own colors and effigies); * 18 medals to be won upon reaching particular objectives (killing 50 enemies, or particular actions to be performed in certain maps and so on), with each of them a hidden bonus is unlocked. Finished once, I think if you are a fan of this genre, you will play it all over again (at least one more time) using all the ~extra material~ unlocked from the previous ~Robotech-ian odyssey~. It will definitely keep you busy for a long time! Is it the end of the War? My overall opinion on this title can only be positive (sorry for the rhyme), considering that Robotech is a good title from all points of view: technically excellent, audio sector taken directly from the animated series, great longevity for a product of this type (designed mostly for the single player with missions), good general playability, presence of simple Multiplayer modes (deathmatch) and many variations on the theme (between opposing mechs, type of missions to be tackled, unlockable extras and much more Still). Unfortunately, however, there are also ~few gaps~, which do not allow him to become a true Blockbuster of the genre, this mainly because the general level of the game is a little too high compared to the control system designed, there are some really nice and pleasant missions such as for example the first four of the third chapter, where we are allowed to play our cards freely, killing our enemies in the way we prefer, while others are so difficult, that they require an advance that is far too slow and linear, thus penalizing the fun and the frenzy that this title should convey from every single polygon. It is no coincidence that the more difficult missions (which are not found in ascending order, but are scattered in the various chapters; therefore you will come across a ~snag~ at the beginning of the first chapter which is much harder to overcome than in an advanced level of the last chapter, for example) are a real frustration especially at the beginning, when you still don't know what the exact procedure is to overcome it (and you still don't master your Veritech properly), in short, like a minefield game, until you find the ~safe~ road, you will be destined to perish, and you will have to repeat the whole level all over again (however never as long as those of Enclave). After having played practically the entire Armored Core series (from PSX to PS2), I can tell you with extreme certainty that the fun (and the satisfaction once completed) given by an optimal calibration of the levels (as in AC), can really the difference in a game like Robotech. Summing up (and it would be time too, you will rightly say), Robotech is a game that I recommend to practically everyone, unless you are a person who only likes ultra-adrenaline shooters or if you have very little patience. Simply ~unmissable~ for all fans of the anime, ~Robotech: Battlecry~ will immerse them completely with everything that the animated series offers, they will live as in a long series of new and unpublished episodes, with the substantial difference that this time the protagonists it's you (ah, and that everyone speaks English, of course)! Is it the end of the War? PRO Perfect cell shading graphics to reproduce the feeling of the animated series; Solid graphics engine, free from slowdowns and clipping, excellent smoke and light effects; Sound compartment taken directly from the cartoon (from the music to the voice actors!); Great longevity guaranteed by 40 missions, 18 medals, 40 different types of mechs (enemies and allies) and lots of unlockable extras; Excellent characterization of Veritech and their different configurations (each with its own pros and cons); Presence of a multiplayer mode; CONS Graphics a little less defined if we move away from Veritech, and the camera system isn't always up to the situation; Some levels are frustrating and you will have to repeat them many times to find the right interpretation; On very rare occasions the opposing AI has moments of incredible insanity (as in the last level of the second chapter); Lack of a replay study, which can be saved and reviewed (even if only in the form of a ~summary~ of the most spectacular actions); Very simple multiplayer mode (deathmatch), playable only by", "date": "2002-10-04", "grade": null}