{"name": "MotorStorm - Recensione", "ref": "https://multiplayer.it/recensioni/motorstorm-recensione.html", "text": "Comment Motorstorm shines with its own light for two main aspects, a technical sector for large sections that is really well done, and a fresh, fun, adrenaline-pumping gameplay that offers something new in the arcade field. Unfortunately such a valid substance collides with the form. A game like the one developed by Evolution Studios lends itself to many offline and online modes that have not been implemented here and which undermine the variety and longevity in the long run. It is true that in the future some of these shortcomings will be filled with some updates, but for now Motorstorm turns out to be an excellent product, but limited in outline and consequently in longevity. Pros: Compelling audiovisual sector Fresh and fun game mechanics Excellent artificial intelligence Cons: Too poor in options and modes in both single player and multiplayer, which undermine variety and longevity Ridin' Rave! For those who are not yet aware of it, the concept that revolves around Motorstorm is that of rave parties based on music, alcohol and clandestine racing; the setting is Monument Valley, dispersed between canyons, rocks and desert, and the game is an arcade in which seven different classes of vehicles will compete on tracks full of mud and other types of asphalt, seasoned with various shortcuts and alternative roads, which they fit into one or the other category. The aim is obviously to finish first, but also to take advantage by throwing the opponents against the rocks and other roughnesses of the course, giving rise to spectacular accidents which also visually modify the composition of the vehicles, until they explode in the most exceptional clashes. Ridin' Rave! The single player mode unfolds through a series of events linked to tickets (tickets), obtainable after obtaining a certain number of points for each race completed in the first three positions. Most of the competitions are reserved for more similar categories (for example Dune Buggy, Atv and Motorcycle, or even Tir, 4x4 and Pickup), the rest instead allow you to choose any means available and compete against other opponents. Bad roads How do all these premises translate once the pad is held in hand? In the best way, playing with Motorstorm was fun, the races are adrenaline-pumping, the courses well structured, the opponents formidable and the artificial intelligence very credible, it gives the impression of ~being there~ and not a simple supporting character: forget, above all in advanced races, to win easily or with a large advantage, the opponents will always give you a hard time and will do everything to throw you off the road, they will also ~fight~ among themselves and you will often see the one in first position crashing alone or with another opponent. Bad roads Another factor to take into consideration is the conformation of the terrain, which, as mentioned, affects the vehicles in a different way and is modified from lap to lap, especially as regards mud and some obstacles such as piles of cars, barrels and more. for example on the second lap with several ruts in the mud that weren't there before, or obstacles positioned in a different way after the tussle of the previous lap. The consequences aren't very marked on the driving model, but they are nonetheless perceptible. The beauty of a sunset The races take place in six different times of the day and this thing mainly affects two aspects. In the one played because it makes it a little more difficult to face the course in different light conditions, and especially in night races the player will have to know in the minimum details the track to have hopes of arriving in first position. The second aspect is purely technical, as it changes the entire lighting system of the track, the projection of the shadows and obviously the arrangement of the sun or the saturation of the colours. The beauty of a sunset The use of technologies and techniques such as HDR, Self Shadow and real-time reflections gives the game a decidedly positive visual impact, together with the normal maps that sprinkle the asphalt, the excellent construction of the vehicles, good physics and visual depth. The sense of speed, especially in the first person view, is absolutely satisfying, satisfying in driving and with several moments to remember. On the other hand, there is some slowdown in the most frantic actions and a filtering of textures in the distance that is not always impeccable. Nothing worth noting as regards the sound sector, with over a dozen rock tracks that go well with the action and help to increase the atmosphere of the game. Multiplayer cross and delight An important introductionThe game, compared to the Japanese counterpart, resides in the much desired online mode. In Motorstorm it is finally possible to compete with other people (up to twelve at the same time) through a simple interface that allows you to access the available game servers and participate in a game or create a new one. In the latter case you can choose one of the eight available tracks, the types of vehicles enabled to compete, the time of day and whether or not to enable the recovery item, which allows the contenders who are in the last positions to have some benefits such as the duration of the turbo higher than those present in the first ones, a method that can prove useful for leveling games in which the opponents have different gaming experience. During our tests of this mode, everything has always worked very well and playing online has proved to be even more fun, especially when the challenges have seen people of similar abilities compete against us. Multiplayer cross and delight Finally, there is no lack of support for voice chat and for some statistics such as victories, defeats and the number of races in which you have participated but, having ascertained the goodness of the basic management, we have to say everything here. That's all because the lack of more game modes, both in multiplayer and in single, represents the real big flaw of Motorstorm. The single player ends too quickly and there are no other options that extend its longevity. The replays are missing, the time trial mode is missing, the possibility of perhaps tackling some tracks in the mirror version is missing. The same can be applied to the online, where a game like Motorstorm lends itself to many variations (almost like in an FPS) and instead, for now, only the one against all is available. What do all these shortcomings translate into? In a strongly undermined longevity and in a potential which, despite being very high, remains in many ways unexpressed. The tracks and the physics of the vehicles There are eight tracks in all and they certainly represent one of the strengths of Evolution Studios' production. Especially the advanced ones are very articulated and enjoyable to be tackled, with several alternative roads and narrow spaces, asphalt composed of mud and passages between bridges, bottlenecks or piles of crowded cars. Since each vehicle class has a different reaction to driving, to the asphalt and to collisions with other vehicles and the scenario, it will be of vital importance to choose the best road to take each time, in order not to incur too many accidents which, although being spectacular at the beginning, they will be increasingly avoided if you want to prevail in the advanced races. To go into detail, riding a motorcycle means having excellent acceleration and top speed, great handling in tackling curves and jumps, but extreme fragility in collisions with other vehicles or on dirt roads made up of mud for example, which will literally slipping the vehicle when cornering. The tracks and the physics of the vehicles Conversely, a truck will need more careful driving and less smudging, but it will be absolutely successful in clashes and in all types of terrain (always if you don't want to pass in too narrow spaces...) present in the game. In addition to the classic accelerator and brake (normal and by hand), there is also the turbo, which can be activated using the X key, which allows you to gain further ground but which must be used in a relatively strategic way, because it can always be harmful in narrow spaces or when jumping, or help to correct a trajectory when cornering. However, it cannot be used indefinitely, because a progressive bar at the bottom left indicates its maximum continuous use before having to be ~rested~ in order not to blow up the vehicle's muffler. After stripping it clean in its Japanese incarnation, we also thoroughly tested the version that will be released at the European launch of the PS3. Motorstorm arrives full of expectations and enriched compared to the Japanese counterpart of the online mode and some refinements from a technical point of view. Will Evolution Studios be able to make its mark in the field of automotive arcades? Find out by continuing to read.", "date": "2007-03-21", "grade": null}