{"name": "Rusted Moss: la recensione del twin-stick shooter metroidvania post apocalittico", "ref": "https://multiplayer.it/recensioni/rusted-moss-recensione.html", "text": "At first glance, there appears to be very little that is original about Rusted Moss. Playing it, we found ourselves in front of a 2D twin stick-shooter with pixel art graphics and set in a post-apocalyptic world. The structure is the classic one of a metroidvania, the weapons are not surprising for their uniqueness and the plot is the usual story of a ~different~ protagonist who had to rebel against the pre-established order due to her mysterious past. After a very short playing time, however, the adventure created by faxdoc, happysquared and sunnydaze and published by PLAYISM has completely changed our way of perceiving and dealing with shootings and platforming thanks to the introduction of a grappling hook. This elastic hook is the basis of combat, exploration and even some of the narrative and will force all fans of the genre to reprogram their brains to take on this adventure. In this Rusted Moss review we will try to answer a fundamental question: can a single mechanic, however revolutionary it may be, justify the purchase of an entire video game? Because if on the one hand the experience is really challenging, on the other hand everything that surrounds it could feel like it has already been seen. A hook for all tastes Rusted Moss' grappling hook will force you to rethink your approach to typical Metroidvania exploration As the game itself points out, what you will be provided with after beating the first boss is not a simple grappling hook, but a sort of hybrid between a hook and a bungie jumping rope. That's because it's springy, retains the initial momentum of your jump, and the more energy you give it by launching off platforms the higher or around an obstacle it will take you. The game recommends the use of the mouse and we feel like sharing this recommendation because you soon realize that aiming the grappling hook attachment point is essential to being able to explore and fight. As soon as you get the grappling hook you will be taken to a level where you will be immortal and you will be able to experience all the ways in which the developers have imagined the functioning of their creation. This skill is the foundation of the entire game because it will serve you not only to cross chasms but also to climb in elevation using its elasticity and even counterattack some boss moves. To master it, it is essential to choose the most comfortable of the three available settings for grappling hook: press to attach/press to detach, press to attach and hold to stay attached and release to throw (holding down shows the range) and press again to release the grappling hook. Combat and exploration The boss battles of Rusted Moss are one of the most exciting moments of the title because they perfectly combine combat and platforming Once you understand how the grappling hook works, the video game takes off by opening the doors of its large metroidvania-style map and starting to give you more weapons and passive abilities. The combat is reminiscent of Metroid Dread and the weapons available, without making too many spoilers, are the ones you can imagine between automatic, sniper or pump rifles. Initially it bothered us that the starting weapon had a limited range, but once you got the hang of the grappling hook, getting in and out of enemies was no longer a problem. Fighting is intrinsically fun but the risk of frustration is quite high because one time out of 20, for a few too many pixels, the grappling hook doesn't stick where it should. Also slightly annoying is the design of some platforms made up of black metal blocks, some of which are slightly lighter than others to mean they're not a solid surface you can grab onto or land on, which will often mislead you. These dissonant elements are especially felt during the beautiful boss fights this game has to offer. The design of these special enemies is not exactly unique, we see references to NieR: Automata and other classics, but the grappling hook combat has forced our brain to completely rethink the strategies that the metroidvanias of the past have taught us. The sword-wielding boss was an incredible challenge that killed us several times, but defeating him gave us a satisfaction comparable to that of a souls-like. Unfortunately, the standard enemies encountered during exploration are not as varied and after about ten hours you get the feeling that you have met them all. Defeating them, however, is crucial because the energy balls they drop fill the meter needed to healyes in combat. Exploration, then, is also encouraged by the passive skills that are scattered around the game map. There are 34 in total and each will give you a combat or mobility bonus by occupying between one and six of the ten slots you have available. A protagonist already seen The narrative sector is where Rusted Moss leaves the most to be desired due to the effect already seen / heard Where the already-seen feeling gets most intense, sadly, is in the narrative department. The protagonist Fern is a girl who is rebelling against what remains of human society after the apocalypse but she is not a human but a Fae, a kind of fairy belonging to a magical species who wants to take control of the earth. Humans have tried to steal the magic of the Fae to infuse it into their own magical female soldiers (such as witches) but to little avail. Fern is a child of two worlds and will have to choose sides. At his side is a dark sprite, whose nature is explained throughout the game, which, in addition to giving advice, animates the grappling hook and acts as a hook to cling to the moss that covers the platforms. The melancholy atmosphere of the game is effective thanks to well-crafted music and an art style that manages to convey the decay of the rusty world in which Fern finds herself. Unfortunately, the unoriginal and cryptic narrative does not help those looking for a propeller for their adventures in history even if, fortunately, the combat and exploration offer challenges and surprises without the need to be motivated by the story. To complete Rusted Moss you will need between 15 and 20 hours, depending on how quickly you get comfortable with the grappling hook and along the way you will engage in epic battles and platforming sections which we really enjoyed.", "date": "2023-04-11", "grade": "7.5"}