{"name": "Project CARS GO", "ref": "https://multiplayer.it/recensioni/project-cars-go-recensione.html", "text": "In taking the path that culminates today with the review of Project CARS GO we have experienced quite contrasting moods, going from an initial enthusiasm mixed with curiosity to then arrive at a burning sense of disappointment, once we discover that the reduction of the famous title Slightly Mad Studios for iOS and Android devices is nothing but a simple drag racer. What is a drag racer? We are talking about a casual declination, if we want to define it that way, of normal driving games: experiences based mainly on a single touch, in which you are not actually allowed to control the car but are only asked to complete a sequence of quick time events that provide the cue needed to cross the finish line first. Project CARS GO, a racing sequence. One of the leading exponents of this sub-genre on mobile is undoubtedly CSR Racing, a title developed by NaturalMotion almost ten years ago, whose success paved the way for the arrival of more or less valid clones. Among them we like to remember the excellent Fast & Furious 6: The Game, produced by Kabam but unfortunately no longer available for download. Leaving aside the discussion relating to the dignity and value of these productions, which over time have also introduced various of novelties capable of adding depth to the starting formula, the problem with Project CARS GO is obviously that everyone expected something different: a reduced version of the excellent racer available on PC and console, which could help relaunch the entire genre on smartphones and tablets. Gameplay Project CARS GO, the drag races are present but they are really short and superfluous. Analyzing the gameplay of Project CARS GO immediately brings us back to the discourse on the value of drag racers, because unfortunately the title created by Gamevil gives back right from the start the feeling of having been conceived badly, based on wrong ideas and assumptions, trying in practice to offer an alternative experience to that of the already limited Forza Street and instead putting counter-intuitive, unnatural dynamics on the table. Completed a short tutorial that leads to the contents of the package, represented on the map in a rather confusing way, the races that characterize the game's campaign in fact ask you to adjust the acceleration to optimize the start by touching the screen as if it were the gas pedal , then to lift your finger instead of continuing to press for the car to start moving. Counterintuitive, as we said. Project CARS GO, a checkpoint where you have to tap and hold the screen. Along the route, which in normal events is not the straight line of drag races (also present but to a lesser extent), there are checkpoints that require our intervention: the light blue ones are used to change gear and are activated more or less correctly with a single touch when the car passes under the signal, while the red ones imply the start of braking in which we will have to keep our finger on the display and then raise it in correspondence with the green checkpoints. That's all. There is no management of the timing of the gearbox in relation to the grip of the tires and the starting point of the engine as in the aforementioned CSR Racing, there are no drifts of Forza Street, there is not even the nitro and the race itself is visually represented as if we were dealing with a traditional racer, without changes of shot for the use and consumption of spectacularity, but remaining anchored to a flatness that extends to the graphics. Structure Project CARS GO, a night race. The basic system of Project CARS GO is undoubtedly simple and with the help of a minimum of variety in the courses (which initially makes you pray a little: the courses tend to repeat themselves a bit) things mesh enough to offer pleasant entertainment. However, even in terms of the structure, the project appears messy and confusing, it is not clear how the events are organized and beyond the traditional categories of cars, we limit ourselves to answering affirmatively to the question that recurs in the menus: do you want to race? The setting freemium is far too convoluted, there are no less than six different types of currency (credits, diamonds and three different tickets) and we also need to take fuel into account, as as usual it is consumed with each race we play and requires a bit of waiting before to recover. By watching a commercial trailer it should be possible to fill the tank, but at the moment this option does not work. Technical realization Drag racers take the collecting aspect of the garage, the purchase of new cars and their aesthetic customization very seriously, but even on this front the titleof Gamevil is lacking: in addition to changing the paint, very little can be done and the polygonal models of the vehicles, although detailed, are made toy-like and uninteresting by the excessive reflections on the bodywork. Once on the road, fortunately, the situation improves, but a lot depends on the setting: the daytime ones are a little too flat and desolate, the evening ones raise the level but without ever bothering the best exponents of the genre, although as mentioned they have now several years on their backs. For a recent comparison, Forza Street offers much better visual impact and direction, albeit with marked aliasing.", "date": "2021-03-24", "grade": "6.0"}