{"name": "Aggressive Inline", "ref": "https://multiplayer.it/recensioni/aggressive-inline.html", "text": "Impossible evolutions This means that in practice you will have a lot of freedom of action, but a ~strategic~ component is added to the game as you will meet some characters who will ask you to carry out small challenges. In addition, bonuses to collect and secret levels to discover are scattered throughout the game environment. This sums up the soul of AI, but in more detail you can select a game mode between training, career, freestyle, time trial and multiplayer. In the case of the two-player game, the screen will be divided as per tradition or you can choose to take turns taking the levels. The game includes a dozen skaters, including two girls, 8 tracks and, last but not least, a very interesting editor mode, which allows you to save your own routes and propose them to your friends. Impossible evolutions Graphics, Animation and Sideskirts Having said that of the numerous features, what you all want to know is how the game behaves on the road. The AI graphics are decidedly convincing, thanks to a 3D engine inherited from Dave Mirra BMX, but much improved, especially for the extension of the explorable environments. The characters are well done, if formulaic, and rich in animation. Invariably you will have to try out the character of the American college girl, in a miniskirt and white briefs, not because a sex addict necessarily hides inside you, but... okay, yes, for this very reason (they put it on purpose and I must admit with particular care )! It's hard to say how much motion capture was used, because some falls are really ~painful~ and therefore inadvisable to reproduce in the studio. The game speed is amazing, and novice you will get carried away, leaving large trails of blood on the asphalt. Finally, it must be said that mastering the combos is not easy at all, so you will need a lot of practice. An inconvenient legacy Tony Hawk. Surely if you are reading this review you know Activision's masterpiece and have played it at least once. If not, it's time to do it in any case, because TH has set the terms of comparison in this genre of games, or rather in some way he created the genre, to each emule so far has made meager figures. AI confirms the good impressions aroused in Los Angeles and is the first student who challenges the master, with bravado and good arrows in his bow. From a graphic point of view, perhaps Acclaim's work is even superior, even if it is only a matter of time. The problem therefore does not lie in the quality of the AI product, but in its lack of originality: almost everything has already been done by Tony, there are no new ideas and probably could not have been. This means that if you already own the Activision game you shouldn't expect heart pounding, and you'd be better off trying a rental. The situation is different if you try your hand at this genre for the first time: how to say, decide who to give your sympathy to: skateboards or rollerblades, because the two games are equivalent in terms of longevity and playability in my opinion. Final verdict A competent product, which reveals both passion for the subject and great technical ability in managing the graphics engines and the manual dexterity of the controllers. What leaves me somewhat perplexed is that much (or all?) is stereotyped, both the characters and the game landscapes and the situations, inspired by previous classics on the Dreamcast or PSX. Perhaps it is difficult to introduce original ideas into a genre that is becoming abused, or perhaps a little genius is needed, which is lacking in AI. It's up to you to blame him or not.Pro - high resolution graphics - very varied environments - very fast - route editor - the best skate game waiting for Tony Hawk 4Contro- already seen - the blood gushing in the falls is dubious - Tony Hawk 4 is coming. .. Impossible evolutions Can you balance? Have you ever tried rollerblading? Well done, maybe you've come to the right place! Ever chased a bus? Somersaulted on the eaves of your building? You don't even jump on the roofs of speeding cars? But how? There is no room for rookies here, before you try your hand take a nice refresher course!! Aggressive Inline is the latest evolution of skating in digital form, and as the title states it is really aggressive, fast, bad and without rules! Wandering through very well-reproduced city environments complete with traffic, your job is to perform artistic figures that border on the impossible (if you're newbies) and far beyond (if you're tough). Your character has an energy meter that recharges according to the success of the figures and grinds. Being able to fill it completely will literally put mente the ~fire~ to your skates and will allow you to perform new very complex combos, for a total of over one hundred possible according to what was declared by the Z-Axis guys. Depleting the energy bar instead leads to the end of the game.", "date": "2002-09-20", "grade": null}