{"name": "Monster 4X4 World Circuit - Recensione", "ref": "https://multiplayer.it/recensioni/monster-4x4-world-circuit-recensione.html", "text": "A new control system A few ~clicks~ are enough to find yourself immediately catapulted into the heart of the action; we select our favorite vehicle, choose ~World Circuit~ and start competing in challenges scattered all over the world. There aren't many laces: the menu doesn't let you foresee so many game modes and the possibilities of setting up our racing car are quite limited. Let's start by describing the sensations that the device supplied provides: the steering wheel is well built and it is easy to place the Wiimote inside it, it fits perfectly without making too much effort even to extract it after the game is over. the steering wheel is well built and it is easy to place the Wiimote inside it, it fits perfectly without making too much effort A new control system In fact, it is the first ~independent~ steering wheel in the history of videogames, i.e. not attached to a support: obviously, it cannot be fixed to a table or placed on the legs like traditional steering wheels, but is simply held in mid-air. It's very light so we won't feel tired to use it, and the vibration of the remote control gives pleasant emotions in the race. Certainly the feedback is not powerful and not being integrated directly into the steering wheel it loses some strength, but it can still be felt enough. The 4X4s react well to curves, skids and so on, and after the initial bewilderment due to the new control we will be able to completely tame our beast with giant wheels. Mario Kart 4X4 Moster 4X4 is essentially a son of Mario Kart: you run, recover items on the pitch and use them in your favor, other times against your opponents. All sorts of variants are present, from the turbo-mushroom to the explosive-shell barrels, passing through the barrels that give starlet-style invincibility. To activate the turbo, a forward movement of the steering wheel will be necessary: by tilting the hands, our vehicle will have an undaunted shot due to the activation of the Nitro. This action can only be performed after gaining initial familiarity with the controls, otherwise we will lose contact with the vehicle: we hold the steering wheel in mid-air so it has no fixed reference points and we risk fiddling with it here and there with excessive fuss. Moster 4X4 was an old Xbox title, now brought back in this ~adaptation~ on Nintendo Wii. The graphic downgrade compared to the Microsoft console is immediately evident, the polygon count has dropped significantly and the general quality of the textures has collapsed. Some nice effects still remain, but it's very little, such as the fireworks that start at the end of the race. The graphics sector The general design of the game is really very simplistic, the menu Spartan and not very generous, the options few and weak. There is also the possibility of customizing the car, a pity the wiimote was not used more in this case, and we thus find ourselves with the usual 4 options: change the rims, change the color of the fairing, put some stickers and little else. The competitions take place around the world: from Moscow snow to the American mountains, Sydney and Barcelona. The graphics sector is very little and Moster 4X4 proves to be a technically poor title even for a GameCube. There's not much to say actually, the product doesn't show serious defects but it looks just like a game from a few generations ago: not that we expected who knows what, but obviously the Nintendo Wii hardware is certainly capable of much more. Worth noting is the presence of some good mini games to play in multiplayer as well: they make good use of the controller even if they suffer from the same problems as the main game, or rather a poor longevity and a very meager technical sector. Car balancing At the end of each race, a certain score is earned which will be useful for upgrading the characteristics of our vehicle: shield, nitro, top speed. Increasing the characteristics does not affect our racing car so much and the maximum speed will be the factor to be taken into greater consideration to win as many races as possible. The balance of the cars hasn't been studied very well, their main characteristics don't seem to really differentiate their behavior on the track. The balance of the cars hasn't been studied very well, their main characteristics don't seem to really differentiate their behavior on the track Car balancing The audio sector is truly anonymous and hastily composed: the music is mostly bad, as are the sound effects, sometimes even annoying. Monster 4X4 is an enjoyable and fun title for the first quarter of an hour,after which it does not ~increase~, nothing is learned and its gameplay remains anchored to those two or three moves, losing its initial appeal. It's not even pleasant to go on to admire the splendid game locations, simply because they are not ~beautifully~ done. The Ubisoft title therefore suggests an excellent use of the steering wheel and a hope for a future title that perhaps has a greater budget and resources. Final comment Moster 4X4 is essentially a title created to demonstrate how the Wiimote can also be used as a steering wheel: it works very well and the response to commands is precise and natural. Despite this, the title fails in its main task, that of entertaining for more than half an hour. The gameplay is very limited and is based only on the acceleration of the nitro and the top speed, and without a good track design the gameplay is very flat. To complicate things there is also an absolutely anonymous audio sector and a general poverty of options and game modes. The control system, however, portends something good for the future of this genre. Pros Good control with the steering wheel Fun at first Cons Very simple gameplay Nondescript audio Technically mediocre Moster 4X4 World Circuit had been presented by UbiSoft at the last E3 in Los Angeles in a low voice, as a second-choice title capable of reinforcing the massive support that the French house was about to have on the launch of Nintendo Wii. Then a shadow mysteriously fell over the project, nothing more was heard of it until it resurfaced a few days before Day one: Monster 4X4 had not been abandoned but rather arrived on time for the appointment with the Italian shelves together with the new Nintendo machine. Moreover, it is also equipped with an excellent steering wheel, just as happened with the GT Pro Series, also by Ubisoft: the game package is relatively small but inside the box there is a good peripheral where you can fit the Wii remote horizontally and use it just to control the our 4X4 monsters.", "date": "2006-12-21", "grade": null}