{"name": "Sega GT 2002", "ref": "https://multiplayer.it/recensioni/sega-gt-2002_c.html", "text": "Prembolo Packaging and Presentation I think this will be the last time I write a paragraph of this ~kind~ for an import license (it will arrive in Italy around mid-October); after all, we can't ~definitely~ hope for a localization (to be taken with a grain of salt given the Silent Hill2 joke) of an American or Japanese title, even if only of the manual or (even more important) of the software itself. However it must be said that Sega knows how to pack its ~toys~ well and Sega GT 2002 is no exception. I'm just saying that just looking at the cover (ok, it's not beautiful, but only the title printed on it had an effect!) I was already ~drooling~! At the end of the movie instead... I was just ~slightly~ dehydrated! An avalanche of cars and supercars, from the packaging (manual and cover) to the opening film, we will always be surrounded by cars for all budgets (virtual of course) and for all tastes: from sports models (with ultra-soothed engines ), to more elegant and sober models such as sedans, from cars produced in the sixties, to the latest concept cars with a sometimes a little bizarre design. It really seems, at least in the presentation of the product, that nothing is missing (ahem really together with the engines there are usually many ~bonazze~, do you know the video of ~Bella vera~ by 883? I really think so!)! Technically speaking: WOW what a hull! The product we are dealing with is certainly worthy of praise, for the care placed in the details, in the perfect digital reproduction of over 120 cars that actually exist (125 to be precise), in the game modes inserted and above all in the future ~Append Disks~ ; but let's go in order. On a purely aesthetic level, the graphic engine is able to touch photorealism (if we exclude the spectators on the side of the track, simple flat surfaces, albeit well animated), especially in the reproductions of the cars. The most direct comparison to better understand the graphic quality of SGT is certainly Project Gotham. Well, surely remember that the real strength of PG are the three-dimensional models of the cars, reproduced very well, while sometimes it was the surrounding environment that was not up to the task. In my opinion, in Sega GT these points (cars and environments) are generally more defined and in particular the cars in SGT have the great advantage of reflecting their surroundings in real time (while in Project Gotham this is pre-calculated). Certainly not a real revolution, at least not after seeing the tracks created by the Italian MILESTONE team for ~Racing Evoluzione~ (they look like photos!), but still very suggestive, full of details and well studied (some are really demanding, like the tour de force rally-stico in one of the last ~racing~ events). Technically speaking: WOW what a hull! Naturally everything runs beautifully, including reflections, light effects and particles on the verge of realism (like the streaks left by the tires, with smoke and attached dust!), all without slowdowns, bad clipping or annoying errors of interpenetration of the polygons; in short, a really solid and precise 3D engine. I personally find the replays great; I experienced a similar sensation of amazement mixed with ~hypnosis~, only when I saw the first Gran Turismo running on the PSX (also for Sega Rally though, a few years ago anyway), or rather before there was nothing or almost nothing. In particular I love the shots very close to the ~nose~ of the cars, because there it is possible to better appreciate the great effect of realism given by the reflections in real time (at night I find them amazing!). Then there are the lens flare effects, the hot air that slightly distorts the view, the fog, the darkening of the clouds at sunset, the starry sky! Mmm, everything seems to be roses and engines!. Unfortunately this is not the case, there are also some ~nails~ scattered on the track that prevent SegaGT from literally taking flight. The main problem of the 3D engine is the sensation of speed it transmits: in my opinion it is a little low. Yet after producing the simply great ~Ferrari 355 Challenge~ on Dreamcast, which still boasts the best telemetry ever (even more precise than that implemented in the F1 simulator par excellence, Jeoff Crammond's GP3), they could exploit the experience acquired to make SGT perfect from this point of view. Perhaps in this case the speed (albeit slightly) has been lowered to allow the graphics engine to reach such high levels of precision and fluidity. Another flaw (minor to tell the truth) is the realization of the spectators, whose vision I thought I went back to the times of ~Sega Rally~, and the total static nature of the trees, although quite convincing intheir realization, they look more like inanimate posts than live plants; I don't expect their fronds to bend in the wind that we generate as we pass (even if we were driving a tornado!), but is it possible that there is never a breath of wind on the SGT tracks? The same goes for the clouds, as beautiful as they are terribly unrelated to the existence of currents capable of moving them (and perhaps modeling them, now perhaps I am demanding too much!). Luckily, nothing irreparable, over time we will hardly notice these ~limitations~ and we will enjoy everything else... just keep an eye on it (after all you have to keep your eyes on the road, don't aim at the view!) Technically speaking: WWWRRROOOOOOOMMMMM!!! The audio sector is of no less importance, at Sega they know it well and that is why here too we find the same care seen in the previous ~sectors~. The music available to us are many and range a bit in all genres, the chosen songs will be played during the race in random order, reverse or in ~loop~ (continuous cycle). The most important thing, at least for me, is that we will be able to use our favorite compilations! It was finally time! So if you shouldn't find those proposed by Sega to your taste, you can always decide to listen to the latest album by Fabio Concato or the latest damnation by Iron Maiden, the choice is yours!. As far as I can understand ~engine rumbles~, the sound effects all seem ~full-bodied~ and convincing, always in step with the engine revs, you really have the feeling of driving hundreds of horsepower beasts. What I am unable to ~discern~ about, is the correct correspondence between a given engine rumble and its actual engine; to give an example, I can't tell you if the ~noise~ produced by the SGT digital Peugeot 206 is the faithful reproduction of the rumble of the real car. At least on the Sega.com site they assure us that the reproduction is total, so I can't help but trust (also because at most I could check the new model Cinquecento or my father's Ulysses, which unfortunately are not present in SGT's fleet ). Race towards the myth: the fundamental stages Here the topics covered multiply, because there are many important topics to talk about and I will try to divide them into three sub-paragraphs: A. Game modes (longevity); B. Test drive (driving system, game mechanics); C. The little mechanic (Analysis of pros and cons; ~C~ for ~Comments~). Game modes There are many modes available, located in the main menu: 1) Sega GT 2002; 2) Quick Battle; 3) ChronicleMode; 4) Time Attack; 5) Replay Studio. 1) In this mode you will be able to embark on a long and dazzling career as a driver, you will start with a very limited budget, just enough to buy a cheap car or so. Any ~first~ car you have decided to buy will not last very long, you will need to optimize what you have to the maximum and maybe in the future also change cars with a more performing one. Right here comes the fun part, because to raise the money you will have to participate in the various car competitions available, trying to place yourself at the end of the race, at least among the first three places. Every time you manage to earn some money, you will be eager to buy additional parts for your flaming car. To enhance it, you can choose between various new or used components and some optimization services (such as reducing the weight of the car, available in three progressive levels of ~lightening~). It is interesting to note how the introduction of used parts is a small but not insignificant novelty; in fact, on the one hand you will be tempted to save some money, but on the other you will be held back by the idea of finding yourself with a flat exhaust after the first ~flat~! You got it right! If you are ~unlucky~ (like me who bought two beautiful ~paper mache~ mufflers one after the other) you could happen to ~puncture~ your ~new used muffler~ and you will find yourself, not only spreading smoke throughout the track, but you will also lose in power and performance. Do you feel like risking the final sprint? In addition, in the second-hand ~shop~, you will also find material not available in the ~Parts Shop~, such as ghost cars and Replays of particular races, various objects to embellish your virtual garage ... in short, ~Goodies~ as the more English speakers. There are really many competitions and they are divided into two main types, the official competitions, which are in turn divided into groups accessible only after acquiring the necessary license, and the event races (or event races) where entry is regulated by the ~detention~ of particular cars (some however are completely free). Finally, in some races you will also have the opportunity to win macch~special~ lines that you can improve or resell for profit. Race towards the myth: the fundamental stages 2) Quick Battle is actually the classic ~Quick Race~ formula, meaning you will have the possibility to start playing right away, without having to worry about purchases, optimizations and so on; you can compete alone or in the company of a friend, with a decent fleet of cars available and five tracks to challenge yourselves on.3) The Chronicle Mode is certainly the most innovative game formula among those available. You will be asked to tackle six stages with cars ranging from the 60s to the present day, choosing your racing car from a list of ~vintage cars~ that have made motor history a bit, such as the '65 Giulia Sprint GTA or the best performing '70 Corvette Sting Ray. You will have to face 6 stagems each of which refers to a particular period, even here you will have the possibility to modify your car at the end of each race, but as a bargaining chip you will use simple points, which will be given to you respectively in number of 5 if you place yourself in first place, 3 in second and 2 in third. Race towards the myth: the fundamental stages 4) Time Attack, a mode already ~overlooked~ in many similar productions, here certainly in the full version, thanks also to options such as saving the replays of your ~guiding efforts~ and the possibility of colliding with the ghost cars purchased in the parts shop used in the Sega GT Mode.5)For the more fanciful and savvy, we find a nice ~direction~ study of the saved replays, in this way you can have fun creating the most beautiful and spectacular sequences, choosing when and which shot to use in a certain moment, for how long and so on, a bit like what happened on Driver, in which he could modify all the shots, following the temporal sequence of the entire replay. A nice way to increase the points in favor of this Sega GT. B. Test drive (driving system, game mechanics) A point not to be underestimated when developing a game of this magnitude is certainly the guide system. As in many car games, also in SGT we will have the possibility to choose between some parameters that will affect the driving system. In addition to the obvious configuration of the keys (4 possibilities, not even one ~customizable~, luckily the ones available should suit almost everyone), the OPTION menu finds a place for the TCS (Traction Control System), which will limit the loss of tire grip for example, when you accelerate too hard (well, goodbye scuffing, sigh!), and the SCS which will avoid (as far as possible) causing you to spin out every time you use the handbrake like a baseball bat! Once activated (together or individually) these options will modify the smoothness of driving, a bit like the Grip or Drift mode, thus preferring a softer and cleaner driving (TCS and SCS activated) to a more rally-like one, full of drifts in counter steering. In general, the control system is decidedly good, it doesn't take much to get in tune with it, then it's up to dedication and practice, to make the most of every corner of the track and every component of our car properly. B. Test drive (driving system, game mechanics) Naturally each car will be characterized by many different factors (from the more specific ones such as HP, weight, torque, to the more classic ones such as speed, acceleration, grip, etc...), which will make them different from each other (who more who less); these ~characteristic~ differences will have a decisive impact on the driving style to be adopted, and for each car you will have to learn to discover every secret if you really want to feel like you are the master of your vehicle. All this is seasoned with graphic effects that help to increase the sense of realism, such as the air distortion effects (when you run at a certain speed, you will begin to see blurring effects given by the ~virtual~ oxygen particles, really realistic ), or when your vehicle will follow the curves, ~leaning~ with the suspension. Ultimately I found the driving system well done, not a ~perfect~ simulation, but rather a ~perfect~ combination of realism and immediacy (at least in the use of the controls), with the right possibility of simplifying it, activating the TCS and the SCS. The only criticism that purists could raise is the ~bounce~ effect already seen in the GT series, when we hit obstacles, whether they are walls, cars or whatever. In short, it never hurts to lean on the side of an opposing car when cornering, right? C. The Little Mechanic: Problems and Comments Let's start with the problems that afflict this", "date": "2002-09-16", "grade": null}