{"name": "Bruce Lee: Quest of the Dragon", "ref": "https://multiplayer.it/recensioni/bruce-lee-quest-of-the-dragon_a.html", "text": "The adventure begins! In Bruce Lee: Quest of The Dragon you will obviously assume control of Bruce Lee, legendary martial arts master, engaged in the fight against the evil ones whenever his intervention is needed. The game features two main modes: Adventure and Arena! The Adventure mode is none other than the Story Mode, in which you will have to relive the entire plot of The Quest of Dragon through 12 areas structured in 30 levels; between fights, movies and action you will have to complete your mission to enjoy the grand finale! In Arena mode, on the other hand, you will have to engage in one-on-one fights that can be set in twelve different arenas and will see you opposed to as many as 14 different bosses present among other things in Adventure mode. Finally, there is also a Training mode where you can practice the more difficult moves and master Bruce Lee's control. The ~true~ story of Bruce Lee The core of the game is certainly the Adventure mode. The plot of this mode is well articulated and tells of how Bruce Lee found himself having to fight again for the good of himself and of humanity. The story begins with the kidnapping of Bruce Lee's father and the Golden Relic which holds the ancient secrets of martial arts. As Bruce Lee, you will immediately have to go on the trail of the evil Black Lotus criminal organization led by the ruthless Dragon Lady. She is none other than the daughter of Chai Wan, a well-known criminal who fell under the blows of Bruce Lee. Chai Wan's death touched Bruce Lee's soul so much that he vowed never to fight again unless it was worth it. During your adventure you will have to explore 30 levels set in three different cities: Hong Kong, London and San Francisco. On your way you will find many enemies, each of which will boast a different fighting technique. in the very first levels everything will seem very simple to you as the enemies will have a rather low AI, but as the action heats up you will also have to deal with much stronger and more fearsome bosses where it will not be enough to simply hit, but it will require a targeted strategy to knock them down. As you explore the various stages between fights you can collect Dragon Coins which you can use at the end of each level to power up Bruce Lee. In Arena mode instead you will have to fight against the 14 bosses also present in Adventure mode. Bosses are the characters with the highest AI and fight using different forms of martial arts such as Tae Kwon Do, Kick Boxing, Shaolin Dragon, Shaolin Tiger, Shaolin Crane and Kenpo. You will have to use all your Jeet Kune Do skills to defeat all the bosses and declare yourself the undisputed champion! If you want to be properly prepared for the two methods mentioned above, you can always practice using the training mode. In this mode there is in fact a list of the moves that you can perform in the fights and how they are performed. The fascinating world of martial arts! The world of martial arts, although it appears very violent, nevertheless with Bruce Lee is reborn under an exquisitely fascinating new guise. Bruce Lee is the best advertisement for martial arts, as in his fights the remarkable combination of technique and speed can be highlighted, something that has not escaped even the developers who have made this concept their own to give that suggestive emphasis that enveloped the Bruce Lee film productions. In this game, the guys from Universal Interactive have tried to revive that emotion previously felt by those who have attended the screening of films of the caliber for example of ~The Scream of Chen~ and so on for the first time. Unfortunately, however, Bruce Lee: The Quest of Dragon has too many flaws to be considered a great game for Xbox. The presence of the best martial arts lover of all time does not make up for the lack in the game of those elements that make it attractive to general users. The gameplay is quite poor, despite the variety of moves that can be performed, you will always fall back into performing the same shots as well as the artificial intelligence of some enemies is really ineffective and many times you will find yourself hitting real sacks of potatoes that are standing there waiting to be exterminated! Although a 3D graphics was chosen that left more freedom of action to the player, however this does not seem to adequately solve all the problems related to an overly repetitive gameplay which in some cases leads to absolute boredom.Will you be able to answer the Dragon's question? Bruce Lee: Quest of The Dragon is all in all a decent action game structured in the footsteps of scrolling fighting games. Since the latter is a genre that has already given birth to many masterpieces, remembering among the last Final Fight for Advance, the namesake of the highly decorated Arcade version, for Bruce Lee: Quest of The Dragon it is really difficult to place itself in a prestigious position compared to other games on the most popular genre. The lack of the basic emotional component that involves the player associated with a weak gameplay and a repetitiveness hidden under the multiple executable moves make this game somewhat mediocre. Bruce Lee: quest of The Dragon however remains a must for all those who adore martial arts and admire the greatest Jeet Kune Do master ever. Pros: Take on the role of the legendary Bruce Lee Lots of punches against more than 30 different enemies Arena mode will allow you to immediately confront the strongest bosses Cons: Some enemies are too easy to beat Good Bruce Lee alone can't do it bridging the gap with other successful titles in the genre Overall, to be good, it does not exceed the sufficiency Materials Images Preview Image Gallery Tricks Trailer 1 Trailer 2 Let's discuss it in the Forum But who is Bruce Lee? Regardless of whether or not you love martial arts, I believe that there is no one in the world who does not know the legendary Bruce Lee. Ever since I was little, Bruce Lee's name was always mentioned in reference to the incredible moves that only he could perform and that made his appearances in films famous. After being the protagonist of countless films that made him famous all over the world, now the brave fighter with almond eyes is ready to try his hand at a new and exciting adventure directly on Xbox.", "date": "2002-09-10", "grade": null}