{"name": "B-Boy", "ref": "https://multiplayer.it/recensioni/b-boy.html", "text": "B-Boy Style B-boy is the name of those kids who have embraced the Hip Hop culture and who love performing in the streets to the rhythm of music by performing acrobatic movements. This Freestyle Games title simulates the world of b-boys, reproducing it in a very faithful way, with real breakdance challenges in urban scenarios. Aesthetically, the work carried out is impeccable, the dance floors are very characteristic and similar to reality with sheets and cardboards that act as a dance floor, and splendid murals and graffiti have also been recreated to embellish the settings. Obviously the greatest care has been taken for the real protagonists of the game, the b-boys, who wear typical hip-hop clothing complete with designer clothes, chains and radios. Excellent is the result achieved as regards the graphic aspect, which is satisfying and realistic: both the models and the environments boast a good level of detail and cleanliness, and in addition the well-made light effects and blurring further contribute to the visual pleasure . Also noteworthy are the animations, which thanks to the skilful use of motion capture perfectly recreate any type of breakdance evolution: in fact, the naturalness and realisticity of the movements with which our hiphop kids perform in the middle of a crowd of spectators eager to enjoy the show. A musical game bases its charisma on its soundtrack, and in order not to leave us disappointed, this title from Freestyle Games offers us a wide range of hip-hop and funky tracks, among which we will find the Black Eyed Peas, Cypress Hill, Kool and the Gang and even James Brown. In addition to the soundtrack there is not much else to take into consideration, since the only thing that will accompany our performances will be the comments of the crowd, from which we will be able to understand if our performance is having success or not. The beauty of B-boy therefore lies in the fact that it allows us to immerse ourselves in the particular and fascinating world of hip-hop (which is also very fashionable lately), and is therefore suitable for lovers of this type of music. For those who are not attracted to this world, the presence of strongly characteristic elements of hiphop might be unwelcome... but in reality, B-boy has, as we will see later, not indifferent playability problems that make it unattractive even for those who belong to the first category. What does the life of the B-Boy have in store for us? B-boy comes with different game modes, which are based almost exclusively on quick challenges against the CPU (or with friends), and more precisely on who earns the most points or the most medals (which we'll talk about later). In addition to the simple single challenges there is the fundamental mode of the game, i.e. the Career: first of all we will create the appearance of our character, changing body size, hair, beard, etc ... after which we will be able to decide on what to do through a menu that includes the change of look of our character, a workout, the ability to manage the acquired breakdance moves, and use the computer. The computer is the fundamental element of our career, through which we will have access to vital information such as the places of the challenges, our level of respect, the jukebox with the songs, and an email box with the useful advice of the our coach. During our career we will have the opportunity to fight against different opponents to learn new moves and to increase the respect that other b-boys have for us. Let the Dance begin! The game is basically based on single one-on-one challenges, or crew challenges with multiple participants, during which the main objective is to win medals by performing breakdance evolutions. There are five types of medals: creativity, which is won by making moves that are always different, rhythm, for the ability to keep up with the rhythm of the music, harmony, for the ability to connect moves, energy, which is obtained by performing steps that excite the audience , and finally fundamentals, which is won simply by carrying out the basic moves. At the beginning of each challenge it is decided who will start dancing first, who will start by performing their moves for a few seconds, after which the turn passes to the opponent, who will respond with his performance. The performance consists in carrying out the breakdance steps by pressing key combinations, and in keeping the rhythm through the use of a particular ring that is found around the feet of one's b-boy. The ring that rotates around the character has symbols that scroll, when these symbols reach a white line you will have to press R1 to keep the rhythm and lengthen the duration of the moves. Breakdance moves are aActivated by the X, O, triangle and square keys, in combination with the directional cross (let's say that it is very reminiscent of the execution of Tony Hawk's tricks) and are divided into four categories: footwork (footwork), power (executions -applause), freeze (balance moves) and top rock (basic steps). Each category has various moves that will be learned as we progress with the career, and together with them there are other special opening, closing and teasing of the opponent; to win the most medals, and therefore the challenge, we will have to skillfully combine the evolutions with the use of the ~rhythm circle~. B-boy is fun for the first five minutes, but soon after you realize the serious flaws that undermine the gaming experience. First of all, there is the question of having to wait for one's turn, which if at the beginning can be a positive thing because it allows us to admire the performance of the opponents, after a few games it starts to become unnerving, especially when you get to waiting almost a minute. This flaw is most noticeable if you play multiplayer, it's no fun having to watch your friend play without lifting a finger. The second problem arises from the rhythm ring, which despite being a good idea in keeping with the typical structure of music games, immediately shows its negative side: in some moments our character covers it without allowing us to see the symbols flow, making it more difficult to keep pace. We should also add that the scrolling speed of the symbols depends on the songs and the sequence of the songs is random, consequently the level of difficulty also becomes random moreover, always having to keep an eye on it is difficult, given that in some moments, to follow the symbols, we will not be able to fully enjoy our performance. B-Boy succeeds in bringing a breath of fresh air to the category of music games, but unfortunately fails to offer itself as a valid alternative to the classics of the genre. The failure is essentially due to its turn-based game structure, which does not allow you to compete simultaneously with your opponents, and reduces boredom in the waiting phases that break the frenzy of the game. The other (small) flaws are to be attributed to the implementation of the rhythm ring, which could have been developed in a better way without any effort. Ultimately B-boy is a music game that is unlikely to entertain those who are not crazy about the world of hiphop, but which might be interesting for those who do. Pros Captivating soundtrack High quality animations Realization of realistic hiphop style... Cons ...but not for everyone Boring game structure Rhythm ring to review Thanks to the ability to entertain without too many frills, music games have now become an integral part of the videogame world and have always found great success among players of all ages. The stereotype (as well as the best known) of this category of video games is certainly Bust A Groove , which has a rather simple structure in which you have to quickly press the keys on the joypad or those on the mat according to the sequence that is shown on the screen. There are other variants of music games that more or less exploit the structure of BaG, but Freestyle Games has decided to offer PS2 users a completely different game, entitled B-Boy, which although based on music, differs a lot from the usual musical titles. The substantial difference lies in its slightly more complex structure: in B-boy you will not have to follow the instructions on the screen, but we will have more control over our character who will have to dance to the rhythm of the music using ~stylish~ breakdance evolutions.", "date": "2006-12-20", "grade": null}