{"name": "Buffy: The Vampire Slayer", "ref": "https://multiplayer.it/recensioni/buffy-the-vampire-slayer.html", "text": "Graphics From a purely technical point of view, I believe that we are dealing with a well-crafted work, even if its graphics engine does not reach, in my opinion, the ~manic~ levels of Enclave, thus resulting less ~defined, precise and detailed~; this does not mean that the game is graphically dull, far from it! But let's go in order. Compared to the Enclave engine, I noticed that the ambient textures are generally less defined (more out of focus), while always remaining on good levels; while it is not possible to admire the same extraordinary reflection effects (bump mapping and the like) that so amazed us in Enclave. Where I turned up my nose a little is the creation of liquid surfaces, where it seems to have gone back: instead of improving this effect, it has been impoverished. Of course we can't expect the realism seen in Morrowind, but equally, we can't be satisfied with a ~semi-transparent blue ribbon~ placed on the ground! The only addition to my description are the pre-calculated circles of water (ie they don't follow the most basic laws of refraction/reflection in liquids at all) that form when Buffy touches this ~element~. Don't worry, there is no rose without thorns, and in our case after so many thorns, we finally get to the bud. Yes, because the most striking part is certainly the creation of the three-dimensional models of the characters (vampires and not) that characterize this game; especially the protagonists of the TV series, which are really well transposed and very similar to their real counterparts (the actors of the TV series to understand). So similar that you will easily recognize all the main characters even if you have only seen a few episodes of the TV series that has so depopulated (is it true? Well in the USA for sure!) among young people. Sorry for the little offscreen, but I would like to point out how some characters seem to have even been ~improved~ in the ~digital~ passage, in terms of ~equipment and bodywork~ (an example? The protagonist herself! I leave all understanding to you... ) The graphic sector of Buffy, however, can also count on important factors such as: the constant frame rate, very fluid and realistic animations, lots of light effects and appreciable management of the shadows in real time (unfortunately applied only to the protagonist in relation to the main sources of light). However, the visual result is ~effective~, immersing the player without suffocating him, impeccably transmitting all the feeling of the TV series. Audio Surely one could not ask for more from the audio staff. Well-researched and featured sound effects; from the ~screams~ of Buffy's Kung Fu to the dubbing of the various characters, everything has been designed to immerse the player in a kind of very long interactive episode of the TV series. The developers are not happy with this, just to make sure that all the irreverent flavor and ironic characteristic of the TV series reaches the public of American gamers, they have seen fit to insert many ad hoc jokes and phrases that are ~recited~ by the characters, before, during and after each fistfight. For example, I happened to kill a female vampire who greeted me with the phrase ~Killed by a chearleader! What a smack!~ (well sort of, since it's all in American!). Surely in the long run the repetition of these phrases can get boring, but not being pronounced in our dear language, the problem is felt very little. Even the ~musical~ counterpart is noteworthy, always being in step with the game action and with the ~issues~ dealt with. It too contributes in an important way to recreating dark (but not too much) atmospheres by totally immersing the player in the intrigued adventures of our beautiful Gellar. Playability This sector also turns out to be one of the prominent elements of this title. The protagonist reacts promptly to our ~solicitations~, a sign of an effective and rapid control system. The combo system is really excellent, in the very first moments of the game it reminded me of ~Spiderman: The Movie~ by Triarch, in which the order of pressing the punch, kick and jump buttons, combined with particular timing, determine the execution of different combos. In our case, however, it only takes a few minutes to realize the greater depth and customization offered by Buffy; not only is it possible to perform different combos, but it is also possible to impart greater strength to a certain blow by holding down a key (punch or kick) when we finish a certain combo (but under penalty of consuming the Slayer bar for special attacks). Visually the effect (realized with the now ubiquitous and indispensable ~slow motion~, seasoned with luminose that accompany the ~athletic~ gesture) is really convincing; manages to give our shots a tangible feeling of strength and power. The only real negative note of this control system, I think, lies in the parry, sometimes too ineffective, which certainly doesn't come to our rescue in the most ~spicy~ situations, often leaving us at the mercy of repeated enemy attacks. This leads to a much more dynamic approach to the game. Considering then that every vampire must not only be ~mallet~ to weaken it, but must also be pierced with a stake (or another tool adapted for the occasion, such as coats and baseball bats), effectively leaving few ~dead~ spaces between strokes; in the long run I assure you that it tires a little even mentally. Not infrequently we will in fact collide with two or three vampires, being able to hammer at least one of them well, but when we are about to pierce him, the other ~friend big tooth~ behind us makes us drop the stake from our hands , throwing a series of ~saracche~ at us worthy of the best Bud Spencer film. At that point finding the time to dodge their attacks, land at least one of the bloodsuckers, recover the stake and then pierce him begins to get really difficult. The matter does not vary much even if we consider the possibility of carrying more than one pole with us, given that once Buffy has dropped it from her hand, she will not automatically extract another one, but we will have to act manually on the directional cross to recall another one from the our inventory. Luckily, our friends (Xander, Gilles and company) will come to our aid who, in addition to tips and advice, will provide us with permanent enhancements to our abilities (after collecting particular crystals) and weapons of various kinds (such as the crossbow or the bottles of holy water). Ah, I almost forgot, the controls are only available in 3 non-editable configurations (again??? But these programmers never learn!), of which I report the photos below. Longevity Here the discussion becomes a little difficult, because this parameter varies a lot depending on whether: 1. you are a fan of the series, ergo you cannot do without this videogame transposition (unless you wanted a completely different type of game, like a dating simulator or a strip poker game based on characters from the TV Series!!!Crazy bleargh!); 2. you are not a fan of the series; in the latter case, how much you will play this title will necessarily depend on these factors: A) the game system, i.e. the set given by the control system (key configuration, reaction speed to the commands given) and by the game mechanics (explore the level, slay vampires, collect powerups etc etc) must literally excite you; B) you've always loved this kind of games (Tomb Raider, Soul Reaver and fighting games in general); C) you can't resist stories filled with vampires and dark settings; you have played all kinds of vampire games (from Vampire: The Masqurade to the latest Blood Omen 2) armed with painstaking patience. If you fall into at least one of the three ~categories~ (A, B or C) then you will play ~Buffy: The Vampire Slayer~ in one breath, enjoying every nuance, every skit, (and perhaps) every single sarcastic joke uttered by the beautiful huntress. Well I don't think there's anything special to say to fans of the series if you don't...run and buy it, it's the game of your life!!! Perhaps the only thing fans could claim was the possibility to choose how to dress Buffy (yes maybe two nice ~stiletto~ heels (or should I say stilettos ehehhehe) with which to skewer the newly landed vampires!!!) at each start level, but on closer inspection, the programmers have partially matched this idea, changing the clothes of our protagonist at each new level. Currently, I'm not aware of the existence of additional modes, perhaps unlockable once the game is finished, but certainly without particular extras, I doubt you will play this title again, if not because you want to finish it on a ~hard~ level (which in our case should correspond to a real ~Nightmare~, considering that already at Normal level some parts are really difficult!) Longevity Small side notes on game mechanics We can briefly summarize Buffy as an excellent action platformer, a successful cross between a Tomb Raider (3rd person view, exploratory component, ~hot girl~ (ahem) as the protagonist, platforms on which to climb, jump and so on) and an excellent fighting game scrolling (combos, holds and special shots, use of environmental elements where to throw vampires to pierce them, such as taoverturned flights, sharp palisades, etc.), all seasoned here and there with some simple puzzle (such as: o capers, I lack the key to open the blue door! Who knows what key it will take? And where am I going to find it now?). Going into detail, some important things (both positive and negative) should be mentioned: * our heroine must pay attention to the two top bars, the lower one is the classic indicator of our health, while the other is the power named ~Slayer~; the latter is consumed every time we perform ~enhanced~ shots and can be replenished by collecting the silver globes released by the vampires once they are killed; this makes the game more tactical, discouraging the ~random keystroke school~ philosophy (hokuto No ken docet); * in addition to the ~evolved combo~ system, we will have the possibility of combining some objects with each other, in order to obtain enhanced artifacts. For example, we will be able to combine an Elixir (which restores our health level) with a bottle of holy water, to obtain a Holy Elixir which is able to replenish both bars at the same time, or combine holy water with crossbow bolts to create of the much more devastating ~Crossbow Bolts~; *save system is tragically similar to Enclave; here too when you die, you will be forced to repeat even fairly long parts of the level, without being able to save your progress. saving happens automatically when you reach a checkpoint or at the completion of a level; *difficulty level not always well balanced and generally a little above average; * no multiplayer mode (they could have inserted a nice deathmatch with the possibility of using all the characters defeated during the single player mode, or a kind of Royal Rumble Time Attack to always face with a character of our choice). Comments Mammamia after all this writing, I still have the impression of not having said almost nothing about this elusive Buffy: The Vampire Slayer, a bit like the comedian ~councillor for miscellaneous and possible activities~: ~... what do I mean by this? ...I don't know! But...~Seriously, I think this title is able to charm, first and conquer, a large number of players, thanks to a solid graphics engine (albeit with few frills) , well-finished and well-reproduced 3D models, an audio sector that is always up to the task, great playability guaranteed by an excellent combat system, and a feeleng directly transposed from the TV series. In short, simply unmissable for all fans of the TV series .. and beyond. I strongly recommend that you at least try to take a look at it (the title will be available from mid-September in Italy) even to those who have never followed the adventures of the beautiful green-eyed vampire slayer (Sarah Michelle Gellar no?) Pros: Solid and fluid 3D engine , which overall manages to give a more than good graphic impact; Excellent system of combos and special hits, slow motion effects spiced up with trails of light to give greater emphasis to the special hits; Well cared for and excellently crafted reproduction of the physical models, all very faithful to their real-life counterparts. Very nice sound compartment, fantastic dubbing (too bad it's the original language version ;P) full of jokes and goodies for fans of the series; Atmospheric music, always in step with the rhythms of the game, pressing and adrenaline-pumping in moments of greater intensity; Acceptable loading times (about 10-15sec.) Cons: The 3d engine is not up to the graphic detail seen in Enclave; effects of lights and shadows not always calculated with precision; painful notes for some sporadic textures, too grainy and flat; There is a lack of a real ~Objectives~ panel (here reduced to the bone) that reminds us during the continuation of our adventures, the salient points of the mission in which we find ourselves; Little interaction with the seabed, given that it is not possible to launch or use blunt elements such as crates, cylinders and anything else we find scattered around; Blocking system too ineffective; Very little freedom of path (above all because our heroine uses her climbing skills only when she wants it (indeed when the programmers want it). Materials: Exclusive Screenshots for the Review Screenshots Preview Trailer Official site Presentation and Packaging This time I can't stick to my usual workhorse: localization. For the less attentive, I remember that the version that came to me is the American version", "date": "2002-09-01", "grade": null}