{"name": "Peter Pan - Ritorno All'Isola Che Non C'", "ref": "https://multiplayer.it/recensioni/peter-pan-ritorno-allisola-che-non-ce.html", "text": "The game, as in the Disney canons, turns out to be the most classic of platformers. Beyond the canonical commands: jump, ~shoot, duck, we will have the opportunity to fly within the 7 stages, even if for limited periods marked by the exhaustion of the magical stardust represented by a special flight indicator. each level we will find different objects to collect among which: Fairy dust: allows you to increase the flight bar Flutes: there are three in the whole game and they will allow you to unlock as many bonus games. a ~shooter~ based on a ship's cannons. Coils: there are four of them scattered throughout the game that will allow you to access four cutscenes taken directly from the upcoming film of the same name. Heart: increase your life energy represented by a bar top left.Feathers: collect 35 and you will get an extra life.Although the stages guarantee a certain variety, the real problem (or at least for some of us it will be) is the excessive ease of the game. The enemies are all ~passive~, meaning they can only hurt you if you go after them. Surely this setting penalizes the more mature target who could have considered buying the product, which becomes a ~children's game~ par excellence. Graphics & Audio Could a Disney title not stand out for accuracy and graphic precision? Also this Peter Pan has really well done graphics with very detailed and well designed backdrops. For example, in the first Stage, set in London, it won't be difficult to distinguish a residential building typical of the Victorian age, or gendarmes and police dogs that closely resemble those visible in Her Majesty's land. Even the on-screen characters, including our hero, have been done in a commendable way through the use of excellent textures and excellent character design work. Among the pearls are the interlude films present at the end of each stage, essential for understanding the development of the storyline. The various stages unfold on several levels. In fact, it will be possible not only to walk along the street, but also on balconies, roofs and other various ledges. The audio sector, on the other hand, offers less emotion. Each level will have its own soundtrack which, in the long run, ends up becoming boring and irritating. Particularly welcome is the complete localization of the game in Italian, with manual and subtitles in our beloved language. Summing up Peter Pan - Return to Neverland proves to be a decent platformer characterized by a good graphic design, negatively compensated by an excessive ease and linearity. Unfortunately the game is for the exclusive prerogative of a very young audience, for nostalgic adults the advice is to dust off the original 1953 film. PROS: Successful license Complete localization in Italian Good technical realization CONS: Excessive linearity and ease Music annoying in the long run Forbidden to over 10 years Surely Sir James Barrie, author of the novel about Peter Pan, would never have imagined that in a future, not so distant, his work would become the inspiration not only for a first film in 1953, but also in 2002 for a film sequel and even a video game. Well yes, thanks to the collaboration between Ubi Soft and Disney Interactive and the shrewd work of the Crawfish team we will finally be able to impersonate the brat Peter Pan and interact with the beautiful Wendy or duel tenaciously with the evil Captain Hook aboard his Jolly Roger. The plot picks up on the final events of the original film. Peter Pan travels to London to visit his former adventure companion Wendy, who has now become the mother of two beautiful girls: Jane and Danny. Unfortunately times have changed, London is grappling with the mournful events associated with the Second World War and the girls grow up in a world that does not allow them to dream and believe in fairies and similar legends. So Peter decides to take them with him, on a flight, to Neverland to rediscover that magic which is, in his opinion, the true leitmotif of life. But once again the evil Captain Hook kidnaps the Lost Children and the angelic Tinker Bell and closely threatens Jane and Danny. Against this background you will begin your mission, new Peter Pan!", "date": "2002-08-27", "grade": null}