{"name": "Alchemy Stars", "ref": "https://multiplayer.it/recensioni/alchemy-stars-recensione.html", "text": "It's now difficult to find new things to say about gacha RPGs for mobile platforms, but this Alchemy Stars review could highlight a title that, although not exactly original, is still very accurate, perhaps among the best of the genre released in recent months. The problem is that this type of game has reached saturation for some time now and for anyone who is not a great gacha fan it is unlikely that they still have something to say, regardless of the intrinsic qualities that are easily detectable in this Tourdog Studios title published, needless to say, by Tencent. There is a remarkable study behind Alchemy Stars, and a care in every aspect that clearly emerges after a few minutes of testing, after a well-crafted anime introduction, really very pleasant 2D screens that show one of the best character designs seen recently in this type of games and a combat system that tries to field something original and different from the mass. Alchemy Stars tells its story through pleasant dialogues and semi-animated 2D screens It's a pity that in any case everything tends to become the same as the dozens and dozens of other similar games, once the usual mechanisms underlying the gacha RPG are triggered: the combat, albeit original, succumbs to the need to resort to grind to advance, which inevitably triggers the use of auto-play which in turn frustrates any attempt to make the clashes engaging. The gacha relies on the usual drop rate which provides very low chance percentages for high level characters, although at least it introduces an automatic increase system after a certain amount of failures, but the feeling of being inside a huge trap for micro- transactions is hard to shrug off. As often happens for games that belong to strongly codified genres, it is necessary to enter into a particular perspective to evaluate Alchemy Stars in a more balanced way: paradoxically, one has to be less impartial in order to be able to better perceive its positive aspects, but this already represents a first important screening, because all those who cannot bear (even rightly so) the deteriorating tendencies of this genre will hardly be able to take it into consideration. Between turn-based JRPG and chess The most characterizing element of Alchemy Stars is certainly the combat system, which mixes strategic movement on a chessboard with the classic turn-based combat of JRPGs. Everything is essentially based on the association of colors: the chessboard is made up of squares of different colors, which correspond to the various magical elements that dominate the individual characters of the party. The power of the attacks depends on the amount of boxes of the corresponding color you can cover in a single turn, therefore you have to try to ~draw~ trajectories capable of touching as many boxes as possible of the same color, which must correspond to the dominant element of the character we are using: the more boxes you touch, the more the attack power multiplier increases. This is the basic mechanics, to which however various variables must be added given by the specific skills of each character and by the combinations between them, which can allow for example to reach the boxes of the right color or change the layout of the board in order to maximize the power of the attacks, in a system that presents a considerable depth. To tell the truth, the whole thing is a bit bizarre and in any case it is quickly mortified by the use of auto-play, the temptation of which is difficult to avoid when the grinding, but for those who want to continue playing actively this system can provide interesting challenges. The usual party management is then associated with field combat, which also in this case requires the expenditure of materials to carry out the evolutions and level changes in the usual progressive mechanics. Alchemy Stars features a unique combat system based on a board and color association As for the gacha aspect, the characters that can be summoned range from 3 to 6 stars, obviously with inversely proportional drop rates that drop to extremely small numbers for the most coveted fighters. There is a system that increases these percentages as the time between one relief drop and another increases, which at least tries to make everything more balanced. As free-to-play, the amount of resources that can be collected simply playing it is satisfying, even if to get powerful characters and especially face the endgame it is probably necessaryresort to micro-transactions or some form of subscription. It should be noted that Alchemy Stars also provides for the need to upgrade the colossus that forms the basis of the group, on which the constant supply of resources and energy to continue playing also depends. There doesn't seem to be an overcrowding of various banners and the story in general and the quests are well built and narrated, through the usual semi-static image dialogues with excellent graphics and a not bad level of writing, although it is exclusively in English. There is a good job done on the construction of the game world and the story, staging a great conflict with rather trite fundamental characteristics but also with original elements, strengthened by an excellent character design and beautiful sets, even if tending a bit ' to recycling in the long run.", "date": "2021-06-30", "grade": "7.3"}