{"name": "V-Rally 3", "ref": "https://multiplayer.it/recensioni/v-rally-3_a.html", "text": "Virtual Rally, part three In the year 2000, the foreseeable sequel (given the excellent sales) once again appeared on the windows of Sony Playstation, guaranteeing a huge flow of the public into the shops, thanks to the advanced graphics (but not yet state of the art of the gray console Sony), the 92 (!!) circuits available, the greatly improved playability thanks to the more accessible control of the various vehicles at our disposal, the multiplayer mode in split screen for 4 human opponents and an advanced track editor. Obviously the great success of V-Rally 2 opened the doors of the Infogrames rally game also on Pc and Dreamcast, benefiting, compared to the slavish conversion of the first episode of the saga, of a technical realization optimized for Pc and the unfortunate 128 bit Sega. Two years later and with the crown of best rally racing game firmly in the hands of Codemasters' Colin Mc Rae Rally bilogy (soon trilogy), V-Rally 3 looks to reclaim its usurped throne in no time. do not say, in the past. With graphics worthy of the second generation of video games for Playstation 2, the usual myriad of viable tracks and an unprecedented career mode, will the third episode of the V-Rally saga be able to unseat Colin Mc Rae from the top? Prodigies and not In the past months, it was our duty to point out how the graphics of V-Rally 3 were absolutely beautiful, not that once the game was finished in our hands we were faced with who knows what technical flaws, but something didn't go the right way. The full motion video that shows game phases instead of the usual ultra spectacular computer graphics sequences is a good appetizer of what awaits us. The number of polygons on the screen is decidedly remarkable: the cars have been made with great abundance, they almost always respond realistically to all the stresses to which they are subjected, they get dirty, damaged and deformed (although not excessively), just like everyone else we waited. Sometimes, however, they seem to be detached from the ground, not at the levels of the futuristic means of the Wipeout saga, however, the feeling sometimes remains (as in the first episode). Prodigies and not Great care has also been placed in the backdrops, some of which are evocative and worthy of being saved as wallpaper for your PC's desktop. Valleys, mountains, deserts and forests have benefited from a high number of polygons and textures that do their duty until they are admired, perhaps during a replay, the same, identical textures, with a definition and blur, such as to remind us, for a moment, of the Nintendo 64; the management of the weather situations is also excellent, which gives us sunsets of rare beauty, together with the always insidious snow, passing through fog and rain. Finally, it should be noted that the 50 frames that the graphics engine sends to the video suffer from sporadic slowdowns when using the external views (for a more marked sensation of speed, we recommend, as usual for racing games from Ridge Racer onwards, the use of the internal view). The sound effects are convincing, as usual the Italian voice of the navigator proves to be almost ridiculous. V Rally mode Beyond the canonical championships, made up of several locations to cross by achieving better times than the opponents on duty (obviously, being a rally game, not present on the screen), the multiplayer mode (up to 4 human opponents, although not simultaneously), one of the main reasons why V-Rally 3 was so eagerly awaited (in addition to the graphic creation, almost at the levels of what has been declared in recent months), was the mode designed for the single player, which obviously will fight fiercely with the one planned for Toca Race Driver by Codemasters, the 2 modes having more than one element in common. Generally, the mode for one player implemented in every rally game worthy of the name involved setting up one's vehicle before each race, competing, repairing one's 4-wheeler at the end of each stage, competing in the next until winning the championship in progress, to then repeat ad libitum, or rather, until the end of each championship included in the current videogame package. V Rally mode Now it is crucial to say the least, for your videogame alter ego, to take into account the relationships with the sponsors, to pass all the tests to which you will be subjected to show your skill, otherwise no car of your own, no goal teamslowly, in the limelight and obviously no salary and fame. Although the possible presence of the death of the pilot during a race does not exist (several times hinted at but never confirmed), the gameplay is nothing short of enveloping, the player feels on his shoulders the will to get hired, as much as that of repaying those who have trusted in him, winning all available championships. The game mechanics, an excellent arcade-simulation hybrid, does not frustrate the player as in the first chapter of the saga but does not delude him that he can play as if nothing had happened like in Sega Rally 2: hitting a large rock, falling for so many meters, these are all elements that will waste time and money for repairs. An excellent playability therefore, supported by the secondary modes mentioned at the beginning of the paragraph, a slight disappointment for those who expected a single player mode heralding novelties for the sector, perhaps arriving with the aforementioned new episode of the Toca saga by Codemasters. Conclusions V-Rally 3 comes with excellent graphics but not yet at the levels that Playstation 2 has shown it is able to obtain with Gran Turismo 3 and the spin off Concept, criticisms leveled in the light of occasionally poorly defined textures and the uncertainties of the frame rate when you use one of the internal views. The game is quite difficult, perhaps too much for non-accustomed to the rally genre but the game mode designed specifically for the single player is worthy of being tried for a long time by all fans of driving video games. Answering the question at the end of the first paragraph.V-Rally 3 is certainly the best rally game available for Playstation 2, but Colin Mc Rae Rally 3 will almost certainly become the new paradigm of the genre, as soon as it is available. For now, let's enjoy this excellent creation by Eden Studios and Infogrames. Pros: Excellent graphics Single player mode worthy of praise Cons: a bit difficult graphics engine (slightly) perfectable Virtual Rally, part three The European gamers who have embraced the Playstation cause and who have so much envied their fellow-rival owners of Saturn and (almost certainly) of Sega Rally, thank Eden Games, developer and Infogrames, software house, for having created the V brand -Rally. Back in 1997, rally games on 32-bit gray were practically non-existent, as well as of dubious quality. The (partly misunderstood) masterpiece of Infogrames was a real bolt from the blue: graphics, for the years that were running, of more than satisfactory quality, an enormous number of stages (about forty, if memory does not begin to misfire), all decidedly well thought out and a challenge that defining extreme is perhaps an understatement: a good portion of V-Rally buyers spent a good part of their time cursing the high level of difficulty, obtained with undoubtedly difficult control of the vehicle which made it even a simple straight stretch was perilous, perhaps in full rain or after a collision with one of the opposing cars, which hardly went off the road. Despite this, the merits of V-Rally are undeniable, the number of copies sold was enormous, so as to justify the conversions for Nintendo 64 (successful), PC (poorly optimized) and Game Boy Color (remarkable, taking into account the potential of the Nintendo Portable Eight-Bit).", "date": "2002-08-22", "grade": null}