{"name": "Hotel Giant", "ref": "https://multiplayer.it/recensioni/hotel-giant_a.html", "text": "Little decorators grow up. The game, completely translated into Italian (an extra point in calculating the vote in our global judgment), can be approached with a series of introductory chapters that will act as a tutorial, thus introducing us to the interface and game mechanics of this apparently complex title. The playing area is completely three-dimensional and this will disorient the player from the very beginning. Moving the view, widening the field of vision and extricating oneself from the various corridors of our hotel will certainly not be a trivial matter. Luckily after a few minutes and many curses we will be ready to build our first double. Also in this case the interface designed by the programmers does not seem to be the most congenial, but fortunately you get used to it quickly enough. In addition to deciding the size of the room, we will be able (we will have to) then decide which accessories to put in it. The choice is great, not exactly vast (after all, we are used to the impressive catalog that ~The Sims~ offers us today), but it allows us to customize our rooms with accuracy. Carpets, bedside tables, plants, wardrobes, televisions, telephones, Hi-Fi systems, desks, chandeliers and everything you imagine there could be in a more or less luxurious hotel suite in the Hotel Giant inventory exists. Part of the accessories will then be further customizable, such as television systems that can be equipped, among other things, with connection to cable channels. All obviously by setting a certain price for use by the customer. Little decorators grow up. But our Hotel will certainly not consist only of double or single rooms. Depending on the size of our hotel, we can in fact decide to build additional services. Among these we remember the Games Room (complete with Billiards, pinball machine and latest generation Cabin), the indoor swimming pool, the wellness center (no, we assure you that no football player showed up on our monitors during the many hours of game), the gym, the bar and the restaurant. Each of these sub-locations will - obviously - have a specific set of objects and we assure you that the design of each of the sections of your Hotel can take you quite a long time. The personalization of your exercise certainly does not stop there. Among the various options it will be possible to choose the livery of our staff and the level of professionalism of the latter: better paid staff will correspond, in most cases, to a more satisfied customer. However, the most avid simulators cannot fail to miss some shortcomings. For example, it is not possible to design the exterior of our establishment, or we will not be able to decide the shape of the external perimeter of the hotel, just as there are no underground floors or the design of the parking lots. In general, the management of all those service locations that cannot be lacking in hotels of a certain rank is not envisaged; we are talking about the laundries, the boiler room, the warehouse and all those components that the customer's eye rarely sees. They are certainly not important details but they already suggest how the more purely ~simulation~ component has been left in the background. pretty woman. Once our hotel has been built or once we have taken over the reins of an existing one (this will depend on the type of scenario chosen) we will finally (?) begin to make our gray matter work and exploit (?) our great managerial skills which they have always distinguished us in every sector of the world economy (double ?). Unfortunately this is the section that has disappointed us the most, or rather, that could most disappoint players looking for an accurate management simulation. Yes, because the economic acumen necessary to carry on the shack is decidedly scarce and used mostly in the initial planning phases. Each object and furniture that we buy for the hotel will in fact have its own purchase cost and maintenance cost. In fact, a simple color television will cost much less (both for initial and maintenance costs) than one with a satellite decoder combined, however it will be less ~attraction~. In the same way, equipping the public bathrooms in our wellness section with Box Toilets or low-grade taps and fittings will make more than one customer turn up their noses. If you then thought of saving with a ~subdued~ lighting system, know that customers will point it out to you by demanding more sunny lighting. In short, most of your time as a hotel manager lor you will have to go by probing the impressions of your guests and remedying the complaints that they will express, perhaps also keeping an eye on the state of your wallet. Luckily the Enlight designers have decided to include some particular features such as the possibility of advertising on all the major media or how to create particular ~package~ offers that will allow us to attract new customers thanks to truly ~indispensable~ offers. But these are only small consolations. In fact, much of the time spent in the executive offices of our hotel will be spent in front of the cameras of the internal circuit. If before you had the doubt that this title was vaguely inspired by ~The Sims~ now you will have almost certainty. Watching our customers go about their day-to-day operations could be really fun. At least for those who have spent a few months watching shows like Big Brother. The variety and quality of the animations that we will be able to admire as the game evolves is truly top-notch. During the 24 virtual hours (which are not so virtual because it will also be possible to advance time at real speed) it will be possible to witness an impressive number of situations. From the waiter who brings the dishes to the family at table number 15, to the couple who challenge each other in a game of billiards, to the old woman who relaxes under the expert hands of one of the rude masseurs. Fixing the faucet on the 314. The weakest sector of the entire production is certainly the technical one. The graphics, although precise, clean and well animated, do not reach one of the main objectives that a title of this kind should set itself: that is functionality. Too often, in fact, we find ourselves wildly changing view to better follow that employee or to position that bed more accurately  but without success. The graphical interface itself requires the use of the keyboard a little too often and even for ~trivial~ operations such as that of rotating a wardrobe or a door we will often have to repeat the operation because we will not be able to do what we had set ourselves . The game then on our test system (Athlon 1600Xp + 256Mb of RAM + Windows XP) proved to be far from being fully stable, bringing us in a devilishly methodical way to the Desktop. Luckily, a corrective patch has just come out which should solve numerous problems especially as regards the Windows 95/98 family but even if the latter is installed the stability will still not be perfect. On the contrary. As if the bugs weren't enough, there are a series of technical choices that appear really questionable to our eyes. For example, the game resolution cannot be set but is fixed on an - for many - antiquated 800x600, moreover every 3-4 minutes (the tempo of a song) the game inexplicably (?) freezes for a few but very annoying seconds. After meticulous and accurate research by our Research & Development center we found the origin of the problem in the fact that the magnificent (?) accompanying music is recorded directly on CD. Unfortunately, the problem is that for each single scenario a single audio track is reproduced ad libutum so, at the end of this, the system stops for a handful of interminable seconds to reposition itself to the beginning of the track. Sadness and despair: the only way to remedy this problem was to disable the music. Luckily we won't miss them, both in terms of artistic quality (do you know the background music you hear in those squalid suburban piano-bars?) and technique (it took us a few minutes to convince ourselves that those weren't simple MIDI files) the audio sector appears extremely subdued. The sound effects themselves aren't anything to write home about - quite the contrary - and they certainly won't make us judge this aspect of the game. Let's pack our bags. To be honest, I was waiting with some trepidation for this title, let's understand each other, nothing particularly striking, however this title could have had all the credentials to represent an enjoyable and exciting title for any fan of management simulations. On balance, however, Hotel Giant seems more like a strange mix between the best-selling Maxis title in history and a rose water management system. For heaven's sake, time passes quite quickly during the design of the premises of our Hotel and also passes quickly enough following the daily operations of the inhabitantsvisitors of our small hotel microcosm. Too bad that all this fun risks ending after a short time by virtue of a really monotonous and shallow management counterpart. The objectives to be achieved then, even if the proposed scenarios try to mask this limitation, are always very similar to each other and, in the end, always propose the same objectives to be achieved with the usual techniques to be exploited. This, combined with the fact that the feeling you will have with the animated pixels that will populate your cathode ray tube will never even touch what is achieved with the multi-quoted ~The Sims~, means that the game risks getting old too prematurely. If we then add many small but still boring technical flaws, I can only regret it even more. In short, we are facing a good summer diversion for those who want to get away from the more famous titles or for those who want to play a not too complex management game. Everyone else better think twice before spending any money. At least if you haven't always dreamed of being able to build the hotel of your dreams: Hotel Giant, with all its limitations, allows it. Giant, Hotel Giant. Well yes, Enlight Software - led by Trevor Chan - tries to introduce something new into the panorama of management simulations by giving us the opportunity to wear the double-breasted suit of a very efficient hotel manager. Maybe he is not as famous as Sid Meier or as appreciated as Jeff Minter, however Trevor Chan, the almond-eyed designer and founder of Enlight Software, is quite well known among fans of management simulations and not. Seven Kingdoms, for example, was an appreciated and innovative RTS, the Capitalism series (now in its second chapter) made thousands of budding Rockefellers rejoice while Virtual U is a highly appreciated school life simulator, so much appreciated that it is used massively by some University campuses to simulate the real situations that arise when managing normal university life. It is therefore not without a minimum expectation that we tried his latest videogame work. The designers of Hotel Giant have basically tried to divide the game into two macro-sections the first is the one that most reminds us of the titles of Maxis (with ~The Sims~ which is mentioned more than once not quite involuntarily) the second instead is , unfortunately, only a mere attempt to bring even the most ~professional~ management enthusiasts who have cut their teeth on titles such as the various ~Tycoons~ or Capitalism itself. But let's not jump ahead and start analyzing this title.", "date": "2002-08-14", "grade": null}