{"name": "Mike Tyson Heavyweight Boxing", "ref": "https://multiplayer.it/recensioni/mike-tyson-heavyweight-boxing_b.html", "text": "At the top of the screen appears a row of icons representing upgrades to the custom boxer that can be unlocked by defeating an opponent in the current match. As the timer counts up, the update icons disappear. Knocking down your opponent as fast as possible will unlock many upgrades and so on as you meet other boxersand beat them of course!! In the third mode, that of the belt, you start from the bronze belt to get to the title of world champion. Obviously, as you progress in the game and earn the different belts, you will be able to face more skilled opponents, both in Belt mode and in Friendly mode. You can also use defeated boxers in all game modes. Finally there is the classic challenge with a friend using all the available unlocked and customized boxers. The beginning of each match is preceded by a long prelude showing the arrival to the ring from the corridors of the arenas, which among other things are 20, including Carnival City, Caesars Palace, Wembley Arena and even a stadium in Rome! Here this excessive length will mean that you will behave every time as for the presentation, that is, you will skip it at the same time. Finally arrived in the ring, the graphic impact is not the best with squat and poorly defined polygonal models. The similarities with the original athletes are there, but a higher quality of the textures would have been appreciated, given that the Emotion Engine has to run nothing but the boxers and some fans who always do the same things. Furthermore, the lack of animation that is felt when boxing is highly questionable; ok that punches have to be fast, but a few more animations between the punch leaving and arriving would have been perfect. Furthermore, the presence of jagged lines, even if not too evident to inexperienced eyes, is noticeable and by now it would be desirable that programmers could succeed in modeling polygons without aliasing. The shots are many and varied, as well as the combos that can be achieved and the special moves which, including irregular and characteristic shots of each character, reach up to 600; it is also possible to load the shots by holding down the button but this obviously slows down one's actions quite a bit. The P&IN (Polymorphic & Interpolative Node-mapping) engine for facial damage ensures a truly realistic boxing experience with changes immediately visible on the poor faces of the victims of the moment! Three views are selectable, one from the side, one from behind and one from above which give the idea of combat very well. The commentary is entrusted to Ian Darke and Bobby Czyz, two famous American speakers, and the music is all rapping, as the tradition linked to this sport rightly wants. Having no other yardsticks in the genre in question in my gaming experience, if not the hilarious and very ironic Ready To Rumble for Dreamcast, I must say that I had mixed emotions in playing this Mike Tyson Heavyweight Boxing; on the one hand I quite enjoyed throwing punches here and there, but on the other the approximation of the graphic detail and animations as well as the repetitiveness of the game distracted me a little from the positive aspects of this title. What to say? It is a medium-value game which, however, could give several hours of fun/outburst especially if played in two. Pros: Fun Lots of moves Quite long lasting Cons: Repetitive Rough graphics Slow animations. In the not exactly crowded sector of boxing sports games, Codemasters faces with a title that has the famous and much discussed Iron Mike as its reference character. The game comes with an introduction that mixes real images with CG ones, taken from the game engine, and shows us the boxer's arrival in the ring before a match. Accompanied by a rap base that blends well with the spirit of the game, it's one of those things that you see the first time and will be quickly skipped over (ah, how many times have I seen the presentation of GT3 and GT2.there are were more at that level!). There are four game modes on offer: Friendly Mode, Speed Boxing, Belt Mode and Two Players. In the first you have to fight for the bag by facing a boxer of your choice, both lostnalized that already provided in the game database. The second mode, on the other hand, is more demanding, in which you have to face an opponent in a single shot as quickly as possible and therefore trying to break down your records from time to time.", "date": "2002-07-31", "grade": null}