{"name": "Frequency", "ref": "https://multiplayer.it/recensioni/frequency.html", "text": "High frequency music Sound game or mysticism? The purpose of Frequency is to reconstruct famous melodies thanks to its own reaction timing. The songs are dissected by instruments and vocals and each track of each instrument is scattered along a ~track~, which scrolls quickly on the screen. All the tracks are placed on a different wall of a 3D tunnel, and the player can rotate the tunnel as desired to position himself on the desired track. At that point it is necessary to locate the notes and press the right button to activate them when they are within range of the ~viewfinder~. The activation of a correct sequence of notes will activate the sequence itself which is automatically repeated for a certain time, allowing the player to devote himself to another track. If you're quick and precise, the result is truly impressive: you'll hear the song grow in intensity as the seconds go by, and lead your rhythm by the hand until it completely interpenetrates! If, on the other hand, you are clumsy, the sequences will stop and the song will be a jumble of uncatchy chords.... During playback, once all the tracks of a song have been captured, you can customize it by using the left analog stick to introduce scratch and synthesizer. The game is over when you run out of an energy bar that recharges over time and depletes in generous doses every time you lose a deal along the way. The strong point of Frequency should be the frenetic bond that is created with the player, who is the absolute master of the essence of the game, and at the same time a slave to it: without his controls, the game cannot live its own life, but if you don't intervene within the time inexorably marked by the timer, game over will come. In short, it is a race against time, fast and more penetrating than what has been seen previously with the various dance games available on the market. The graphics, essential but very colorful, push in the same direction: all the concentration is placed on the notes that flow on the screen, without accessory explosions, but all in harmony with the song that you are building step by step. A kind of audio-visual intoxication that perhaps recalls certain passages from Walt Disney's Fantasia, with the difference that you are the creator of the show! Game modes In addition to the basic game mode, two interesting alternatives are available: Remix and multiplayer. Remix mode allows you to create an original version of all available songs using real-time samples as you go through the tunnel. The control system is the same, but in addition you will have the possibility to insert new effects and loops. Once you complete a song, you can play it back on the Jukebox or use it in-game. The multiplayer mode, on the other hand, is based on the division of the screen up to four contemporary players who fight to create the same song and score the highest score. Each trace captured is stolen from other competitors, and there are special power-ups to eliminate the opponent. Illustrious guests A game based on music must have good cover topics, and Sony has spared no resources to grab the contribution of different groups on the crest of the wave. Paul Oakenfold, Roni Size, Fear Factory, Lo Fidelity All Stars and No doubt just to name the ones that come to mind. At the beginning of the game, there will be a few pieces available, and basically the quietest ones, while progressing through the levels you will access increasingly wild songs. Passed levels unlock the song which can later be replayed in training or competition with a friend. Final verdict: MTV Award? Frequency is original and full of bite, a damn fast title that will engage you thoroughly, but until when? My impression is that the interest in this game is diametrically opposed if there are a neophyte or a fan of musical titles trying to play it. The former will find a source of stress in the immediate difficulty and I think it will be difficult to continue towards the next levels, also because the proposed groups are not all known to the general public. The indispensable of rhythm games, on the other hand, could vent his frenzy with hallucinogenic sessions, and insert this game in his personal library of classics. It is therefore up to you to examine your conscience and decide which category you belong to. Pros  Famous licensed songs  Ability to edit songs  It's original in a world of clones Cons  A little frustrating for the difficulty  Multiplayer in 4 confused High frequency music Frequency is a breath of fresh air on the PS2 summer release scene. Sony has always been very careful to renew genres forr being able to keep alive the niche market for its console (just remember Fantavision, Space Channel or Parappa) and today it seems to have hit the mark, proposing something truly original where it seemed that everything had already been experimented: rhythm games. Original songs by well-known bands, experienced rock and hip pop scenes and great speed should appeal to house party and garage enthusiasts like honey. What Sony offers is a chance to become a ~Virtual DJ~. What is a VDJ? Let's say that we are dealing with a new generation DJ, who instead of juggling the mixing of original bases, is able to enter the music and modify it in real time by performing a sort of cut and paste of the instruments and notes, dictating the rhythms at his liking. The idea is stupendously cool and potentially revolutionary, and we hope that somehow it can be developed in the musical circuits thanks to ad hoc tools of the record companies: something like this I have seen with infrared mixers that follow the movements of the hands to add or subtract special effects, but this is a step further. So let's try to understand how the VDJ is done.", "date": "2002-07-30", "grade": null}