{"name": "David Beckham Soccer", "ref": "https://multiplayer.it/recensioni/david-beckham-soccer.html", "text": "Gameplay After an exhilarating and well done presentation, we are faced with the main menu of the game, all in Italian, where we can choose between the various game modes or set the settings in the options menu; an interesting mode that immediately catches the eye is the ~play with Beckham~ mode where you can train in passing, shooting, defense and more and earn certificates of merit based on the scores obtained. Furthermore, the ~team and player editor~ mode is very accurate: here you can create new players and keep the teams always updated and complete. In the ~options~ menu, the story of Beckham, the game credits and the characteristics of the Adidas predator shoes peep out. It goes without saying that the programmers' efforts have been lavished on the product casing rather than on the content: clearly visible advertising and various sponsors represent the most accurate part of the game! The gameplay is pure arcade, with endless racing possibilities and unlimited player stamina. On the playability front, the most annoying shortcomings are noted: player control is imprecise, ball control as well; many times it can happen that the ball ends up in areas where there is no one and with each wrong pass the counterattack with relative goal is guaranteed. The game speed is acceptable (perhaps thanks to the Xbox hardware) but the physics of the ball and the rebounds are completely absent: it seems that the ball is attracted by a sort of ~magnetism~ that the players exert towards the ball. The game in midfield is minimal and there is a lack of intelligent and deep plays like in ISS. Team play Tactically, the game is fairly well cared for, even if setting up decent actions is entrusted to fate. In the end, you can get tired of always pressing the short pass button because the other buttons don't allow you to go through successfully; the game situations are often the same, and the best goals usually come from corners. The goalkeepers deserve a special mention: they seem helpless with every shot and often make mistakes, many times they give too much space to the attacker and have very little reactivity. The technical characteristics of the players as well as their speed have not been customized in any way: the players all look the same and have all the same peculiarities and animations, they all seem, how to say, ~standardised~. As in other football games, this DBS can also be played in multiplayer up to 4 players on the same Xbox, but like the single game, you will soon get bored even if played with other friends. Graphics Surely one of the strong points of the game are the animations. The players move in a fluid way, thanks to a motion-capture work based on photorealistic models. The stadiums are graphically impressive, gigantic and full of colours; even the audience in the stands is very detailed. Let's move on to the sore point: the players are square, little ~different~ from each other, they seem squat and poorly designed. The three-dimensional models are acceptable and the textures covering the polygons are present in quantity. The replays disappoint a lot, not only because they start before the commentator says ~GOAL~, but because they are not very fluid and do not gratify the completed action at all. The effect of the ball in set pieces is quite believable, even if it sometimes takes impossible trajectories. The field is well designed and there is a wealth of detail in the construction of the benches and referees. Sound A positive element of the game is the sound. The choirs of the ultras are accurate and clearly audible during the game, the songs with which they celebrate do justice to the beauty of the stadiums. The commentary is all in Italian, impeccably done and well thought out; the commentator fits well during the game actions, sometimes even in a witty way, but the sentences are very detached from each other that make the comment seem ~robotized~. The music during loading is to be praised and during the menus it is never boring. With great licenses come great responsibilities... The presence of such an important license tends to divert programmers from their main goal: to create a deep and playable game. This DBS does absolutely no justice to the figure of the great champion. The game is full of modes, teams, stadiums, but fails to overcome the sufficiency in every sector. Everything was wonderfully packaged, a nice ~little package~: but we certainly won't find a nice surprise inside! David Beckham Soccer does not have a solid structure, it loses comparison with other soccer games present today for theMicrosoft home console, and that's not good. Recommended for all fans of the great Beckham who already own all the titles on the market, or for anyone who falls asleep in a Ronaldo shirt singing the anthem of their favorite team. Pros: Lots of game modes Excellent chants Very detailed team editor Cons: Repetitive game actions Technically poorly customized players Incapable goalkeepers Materials: Screenshots Preview Be Like Him... I've always been a huge admirer of the legendary Manchester United right winger David Beckham, both for the great charisma that oozes from every pore and for his magnificent and lethal crosses from the right wing. The champion, in agreement with Rage software, has signed a contract that allows the use of his image in a video game; the other players, although reproduced with excellent attention to detail, do not have their original names but ~crippled~ as happened in the first I.S.S.. The Rage title fits into the category of football games that have not yet said much on our console; there is a lack on the Microsoft console of a soccer game that can be compared to I.S.S. Pro or Konami's Winning Eleven or EA's much acclaimed Fifa. sports. The game in question has a respectable identity card: you will find over 200 clubs and international teams from all over the world, chosen directly by David Beckham with the possibility of updating the data by taking them directly from the real exchanges of the world football market .", "date": "2002-07-25", "grade": null}