{"name": "Cel Damage", "ref": "https://multiplayer.it/recensioni/cel-damage_a.html", "text": "An exceptional cast: First of all, a paragraph should be spent to present the characters of this title, all deeply characterized and built with strong differences and a strong and well-defined personality. Our heroes are: Violet: Asian demon girl, driving a pseudo tank, deadly in the long run and a bit psychotic; Sinder: a real devil cast out of hell for lack of professionalism with his 4WD vehicle will bring destruction for the sole purpose of his own personal entertainment; Dominiuque: a high-class cartoon that despite the sweet and pleasant exterior contains a heart of stone and strong nerves, takes on the tournament on an equally classy car painted in a soft pink; Fowl Mouth: a gangster, a duck, a criminal mastermind...straight from the 1930s movies here is a character driving vintage cars with his inseparable machine gun, obviously always in black and white; Flemming: a nerd driving a fantastic hovercraft, bizarre, ingenious and completely antisocial who can boast weapons out of the ordinary; BT Bruno: a bricklayer with an Elvis obsession, driving a kind of bulldozer and with a marked aptitude for violence. Armory... After having quickly analyzed the merry gang of our playmates, let's just as quickly review the weapons that will be kindly made available to us by our sponsors. It ranges from freeze rays to axes and cannons, all means to disintegrate your enemies and achieve victory and subsequent popularity. Here is a list of the craziest weapons you can find in a car race (well, maybe some of Wachy Racer's were worse, it's true): Axe; Baseball bat; Boxing gloves; Chainsaw; Machine gun; Hammer; grenades; Homing missiles; Freeze Ray; chopper; Alone or in company Now you know who will keep you company in the evenings of these midsummer days; let's move on to see what impact it therefore has to take the field on board our cartoony racing cars. Surely initially there is a positive impact with a lively and colorful setting, the enemies that dart around us in a series that seems quite wide of modes; unfortunately from the adrenaline and the initial surprise you wake up abruptly and disillusioned after a few games as although the programmers have done their best to differentiate the types of settings and introduce details that make them interactive the repetitiveness of the game does not take long to make its appear and take possession of the player. All is partially resolved by the company of 3 friends eager to prove themselves the best or simply to make a bit of a mess and shred, cut, etc. entering a level of pure and simple videogame challenge... Concluding: The game, excellent from a technical point of view (graphics and sound) and interesting under various aspects (characterization of the various characters above all), however, lacks in terms of longevity by providing entertainment for short periods of time and in not too frequent flashes; the situation changes quite radically if you are in the company of a handful of friends who want to have fun; interesting overall, but not a must buy. Pros: Well-characterized characters Clean and accurate graphics Funny in principle Cons: Lack of a solid single player structure Almost no depth It gets boring soon Start your engines... There are completely crazy cartoons in command of absurd means with even more absurd weapons in extravagant settings that chase each other in search of personal glory and final success over the opponents. Broadly speaking this is the description of this extravagant game which will see you take part in competitions in which the sole purpose is to defeat and annihilate your opponents also and above all with the use of an arsenal that ranges from freezing rays to giant hatchets, without forgetting various firearms and possible and the scenario that always finds an opportunity to contribute to the destruction and havoc against our unfortunate adversaries. Set in four completely different ~worlds~ which vary from desert environments to Transylvanian mountains, finally arriving at the desolate immensity of space passing through intricate and luxuriant jungles, the game promises hours and hours of pure adrenaline filled with black humor and sarcasmin buckets, especially if in the company of three friends. Given the good premises, let's now see if the promises are kept and the expectations are not disappointed by analyzing more deeply the various details of the title in question.", "date": "2002-07-17", "grade": null}