{"name": "The Operative: No One Lives Forever", "ref": "https://multiplayer.it/recensioni/the-operative-no-one-lives-forever.html", "text": "Who wants to live forever? In The Operative: No One Lives Forever you will assume the role of Cate Archer. The beautiful Cate works as an ~Operative~ agent, engaged in the fight against a group of wild madmen who want to take over the world. The H.A.R.M. , contains all the most notorious criminal masterminds in the country and poses a very dangerous threat to world peace! The arduous task of unraveling this mystery will therefore be up to you, which will take you to different places on Earth where the answers you seek are hidden. The story of the game is well articulated and you can visit many different locations including exotic and sunny places. Furthermore, in some levels you will also be able to make use of some motorized vehicles such as the snowmobile or a powerful Triumph with which to knock out the enemies. In short, a shooter based on frenetic action and on the gamer's ability to reflex. Help the beautiful Cate! The PS2 version was largely carried over from the PC version. In addition, 4 new game levels have been included which give a touch of novelty to the game as well as a reason of interest for those who have had the opportunity to try the PC version for purchase. The story is divided into 15 further missions set in 60 levels. You will therefore have time to familiarize yourself with the beautiful Cate and above all become familiar with the different weapons that you will have to use during your adventure. First of all, you will be able to make use of incredibly powerful weapons such as the assault machine gun or the grenade launcher. But the real gem of the game are the gadgets worthy of the best 007. Among the many gadgets available, the robot poodle dog and the explosive lipstick are worthy of mention, even if the grenade launcher case and the lethal acid perfume are very useful. Gadgets and weapons are the right combination to quickly get rid of the enemies that will get in your way and reach the completion of the mission. Only with the right timing will you be able to get rid of the H.A.R.M. and you will restore peace and tranquility to the Earth. Around the world! No One Lives Forever is a game that features very varied environments. The designers indulged themselves in preparing different types of scenarios that form the background for the various missions. The graphics of the backgrounds are fairly accurate, although they appear dated and certainly not up to the level of the most recent productions. Being purely a first-person shooter, the game must have an excellent graphics engine that offers the user a good vision of the game and in this the developers have worked hard to ensure maximum fluidity of movement. In No One Lives Forever you don't always have to go through all the levels guns in hand and try to shoot down all the enemies with bullets. Being a game based on espionage, in some missions you will rather have to try not to be seen by the cameras or distract the guards by throwing coins in order to avoid the clash and continue without a fight to complete the mission. Different puzzles will come your way, but none will be so difficult to keep your mind busy for too long as there will always be more than one solution. Defeat the H.A.R.M. The Operative: No One Lives Forever is, like most shooters, a game that's hard to get out of once you've got the pad in your hands. The strongest impulse is to perpetually continue playing with the aim of discovering new weapons to use to kill your enemies in ever new ways. However this game is not only for ruthless ~killers~, but in addition to the skill in choosing the most appropriate weapons each time, it is also necessary to have an excellent global vision of the locations and a good knowledge of the rules of espionage. In fact, not always firing will be the winning weapon, but also hiding and stealthily will be important weapons to complete your work. Despite the good words spent, we are certainly not dealing with a masterpiece but with a game that is fun although in many respects it appears outdated. Looking forward to future productions, The Operative: No One Lives Forever is still a good buy. Pros: The gameplay is respectable Engaging Neither too easy nor too difficult Cons: It will be appreciated especially by lovers of the genre After finishing it I would not play it a second time Graphics a bit dated There is better out there. Nobody lives forAlways! After the glories of the first two episodes of Fear Effect I had almost lost hope of seeing a new heroine on a Sony console that would take the place of the beautiful Hana in my heart. However, Sierra thought about making my wish come true by introducing this new first-person shooter titled The Operative: No One Lives Forever on the Italian market. I've never particularly loved this genre, but judging by the forms of the main protagonist of the game I could not at least give him a look!", "date": "2002-06-24", "grade": null}