{"name": "Super Monkey Ball", "ref": "https://multiplayer.it/recensioni/super-monkey-ball_a.html", "text": "Monkeys locked up in spheres? Don't ask me why The game is essentially a puzzle game whose protagonists are cute monkeys enclosed in transparent spheres and engaged in a series of very amusing and very varied games. In fact, the great peculiarity of Super Monkey Ball is that of being able to count on a series of minigames, in addition to the main mode, which in the end will be of equal or even greater fun than the main game. The heart of the game will see us grappling with one of the 4 initially selectable monkeys, the aim is to guide them through very intricate paths, full of obstacles, narrow passages, jumps and much more with the aim of reaching a certain point in a time pre-established. So far it might seem very simple, but only because I didn't tell you that our task won't be to drive the sphere containing the monkey through the controller, but to tilt the plane on which the spheres must move. The control system is basically that and that's it. In fact, in almost the entire game we have to use only the analog stick and only in some minigames will we need another key! There is obviously no shortage of pitfalls and obstacles and we will have to work very hard in an attempt not to lose precious lives by leaving the plane and falling inexorably. During the routes then we will also need to collect bananas scattered along the way which will allow us to accumulate a considerable number of lives, necessary to progress in the game. There are 3 selectable difficulty levels: easy, medium and difficult. In the first we will have to face only 10 relatively easy routes that will keep us busy for a while. In the following levels, however, things change radically. The average level will see us face 30 much more complicated routes and therefore very satisfying and fun, while the expert level can count on 50 very complicated routes where the difficulty increases dramatically and the commitment to complete the starts will be very high, touching also the real frustrations for those who are not endowed with strong patience! Bringing our monkeys to their destination on the various routes will help us accumulate points with which we will be able to unlock the minigames which, a peculiarity of Super Monkey Ball, are perhaps the funniest aspect of the game. What game are we playing? The total number of subgames is 6 and they are divided into 3 minigames, and another 3 definable instead of party-games. The 3 minigames are unlockable in the main single player mode and, as I said before, you need to get a certain score to guarantee them. They are divided into a game of billiards, where instead of bowls there will always be the cute monkeys in their spheres; a bowling game where obviously we will have to try to knock down the typical pins, but guess what is in place of the normal bowling balls? Finally there is a golf game where I refuse to tell you what is used in place of the normal ball . It goes without saying that the 3 minigames, as well as the main mode, as well as being very fun and deeply playable, can also be played in multiplayer, dramatically increasing the longevity of Super Monkey Ball. As I said, the other 3 games are better defined as party-games, since they are focused precisely on multiplayer. The funniest is undoubtedly that of the race where we can face opponents controlled by the computer or 3 other friends in exhilarating Mario kart-style races, on circuits full of bonuses and power ups. The second is instead a kind of battle in which, armed with a glove, we will have to try to throw our opponent out of the ring, again thanks to the use of various bonuses. Finally there is a mode in which we will be engaged in a real flight from top to bottom, in an attempt to hit targets placed in the middle of the sea while avoiding all the dangers present in the skies. Do I buy it or not? Graphically, Super Monkey Ball stands at good levels, even if it does not present particular technical skills, but, moreover, the type of game does not require them. The image is very clean and the textures used are quite convincing. The frame rate is excellent, practically always constant in any situation. In short, nothing shocking but everything perfectly suited to the type of game. Unfortunately, sometimes the game view can be uncomfortable, in fact the movements of the plane on which the sphere moves are all based on the game camera which, however, is not salways ready to follow the movements of the monkey, causing many difficulties. As far as the sound department is concerned, the speech is more or less the same as the graphic one. Both the sounds and the music can be listened to quietly without annoying and without causing particular enthusiasm. What makes Super Monkey Ball an excellent game is the great fun, the ease with which you learn to understand the game system and the incredible ability to always keep you glued to the screen, generating a principle of videogame addiction. The minigames are absolutely fantastic and I'm sure you'll spend the first few days trying to unlock them all to try them out with some friends. Yes, because Super Monkey Ball is undoubtedly one of the best puzzle games ever created for consoles and, in multiplayer, it is among the funniest games. Longevity is very high and is kept alive by the numerous modes, by the excessive level of difficulty (it will take a long time to finish it) and above all by the multiplayer game. Nonetheless, Super Monkey Ball is not without its flaws, first of all the high level of difficulty that many gamers could find. At the easy level, the game is also quite easy, but from the intermediate level onwards, things get damn complicated, reaching the threshold of frustration for someone. This is a typical difficulty of the old arcade games so dear to Sega and, also for this reason, it could be a reason of interest for videogamers who don't like games that are too easy. It is well known that Sega is already thinking about Super Monkey Ball 2, but this is absolutely not a good reason to miss out on one of the most welcome surprises for the GameCube, also because it will take quite some time before we see the sequel. A title therefore highly recommended, especially to those who associate the term video game with that of fun! Pros: Simple and immediate The funniest puzzle-game on consoles Beautiful mini-games Irresistible multiplayer Difficult like the most classic arcade games... Cons: ... but for this reason it could be frustrating for the less experienced Game visuals not flawless But what a nice surprise! Super Monkey Ball, even if it doesn't seem like it, represents a great deal for the history of consoles. It is in fact the first Sega title to appear on a Nintendo machine, when it was released in the Japanese version. I won't deny that turning on the GameCube and being faced with the Sega logo had a certain effect on me, being the first title not produced by the big N to run on my cube for me too. Times therefore change and Sega, as everyone knows, is now dedicated solely and exclusively to the development of software for other consoles, but the release of the more famous Sonic has unjustly removed attention from Super Monkey Ball, a title whose little is said but that certainly deserves more attention than other games. The title is developed by Amusement Vision and this alone should be enough to guarantee the quality of the product. But since we don't trust it, we wanted to test the Super Monkey Ball lunge! What's the result? Perhaps one of the best surprises for GameCube!", "date": "2002-06-19", "grade": null}