{"name": "F1 2002", "ref": "https://multiplayer.it/recensioni/f1-2002.html", "text": "Arcade and Simulation For years now, console owners have been waiting for a formula one simulation worthy of the name to arrive on their favorite gaming platform. Unfortunately I fear that the wait, at least on PlayStation 2, is destined to last indefinitely, not even F1 2002 being able to represent for formula one what Gran Turismo represents for cars with covered wheels. However, this does not mean we are faced with a disappointing title but only with a game that was born as an arcade seasoned with some simulation elements that give a touch of realism to the races. In this sense, however, there are not many innovations compared to the previous edition, so much so that the impression is that of being faced with an update rather than a completely new game. F1 2002 benefits from the FIA license which allowed data and statistics relating to the season currently underway to be entered into the game. So it won't be a surprise for you to find Schumacher aboard the F2002 that is taking the German champion to the conquest of the drivers' championship. Cars, helmets and sponsors have been reproduced to perfection and represent a very faithful copy of the real counterparts. To make the game more realistic from a visual point of view and beyond, there is a vehicle damage management system (which can be deactivated) which will lead not only to the deformation of the bodywork and the loss of parts but also to engine failure. The most attentive drivers will also notice the appearance on the shiny bodywork of mud spots or anything else that could dirty the cars and grass or dirt on the tires following an excursion off the track. A non-secondary role is played by the climatic conditions which will change in real time during the races. In this way you will be able to compete under a hot sun but also to start a race under a cloud bean and to see a timid sun peeping through the clouds after a few laps. Barrichello challenges Schumacher The game modes available are really many and able to keep you busy for a long time, at least until the next season: Quick race, Challenge, Single Grand Prix, complete or customized championship, team duel and multiplayer. Quick race and Single Grand Prix will allow you to take to the track respectively in a race or in a weekend that includes free practice, official practice and the actual race. The challenge mode will instead put you in front of a series of tests of various types which, if successfully completed, will give you not medals but EA Sports cards (gold, silver and bronze) which will make up our personal medal table . The complete championship and the personalized one respectively allow you to participate in all 17 races of the formula one world championship or to create a season yourself by deciding which races to take on. In ~Duel in the team~ you can instead make Rubens Barrichello's dream come true and therefore challenge and beat Schumacher or whoever your teammate is. Finally, the classic multiplayer option could not be missing which will give you exciting head-to-head with a friend of yours. The possibility to choose between arcade and simulation game is really interesting. To tell the truth, the differences between the two driving systems are not very evident as regards the behavior of the car on the track even if in the simulation it will be much more difficult to keep the car on the track in the corners and to brake hard. By choosing to race in the simulation, you will also have at your disposal a series of simple adjustments for perfect set-up of the single-seater: tyres, (soft, wet, hard and pressure), aerodynamics, suspensions, brakes and gearbox. With joypad and steering wheel As far as the actual game is concerned, it must be said that F1 2002 lets itself be guided pleasantly thanks above all to the driving system which is rather arcadey but equally enjoyable. We are frankly far from the level of realism of the best known PC simulators, but if this is all that our consoles can offer us, then it is better to adapt while waiting for a real simulation. So let's not turn up our noses in the face of the not very credible physics of the cars that often seem to skate on the asphalt. Two positive aspects are the good artificial intelligence of the opposing drivers and the level of difficulty which proves to be rather difficult at an advanced level and therefore capable of give a hard time to the more experienced players. While it is possible to use the PS2 joypad as the default controller, the use of racing wheels is recommended(perhaps equipped with Force Feedback) such as Driving Force by Logitech or the equivalent products by Thustmaster and Act. Labs widely supported by the game. Using the steering wheel makes the gaming experience significantly more realistic and enjoyable. New game, old problems Up to this point everything went smooth as oil and almost. But now we come to the biggest flaw of F1 2001, the frame rate. Compared to the previous version, the effort that has led to a more stable graphics engine and almost free from drastic slowdowns is appreciable, but unfortunately the framerate stands at a very low 30 frames per second and probably something less. The playability is affected and not a little mainly due to the not excellent fluidity and the unconvincing sensation of speed. In the era of 128-bit superconsoles, it is no longer acceptable to go below 50 fps! It's a pity because for the rest F1 2002 performs very well thanks to the good level of graphic detail of the single-seaters, tracks and landscapes. The animations of the pilots are also appreciable, in particular those of the helmet which moves according to the stresses of the terrain and the curves and of the hand which occasionally leaves the steering wheel to detach a dirty visor. The sound also plays its part effectively with realistic engine noises, good sound effects and radio communications that will inform you of everything happening on the track. Checkered Flag! Overall, we are dealing with a good product which, although not convincing in every part, proves to be the best game of the genre on the Sony console. The decision to focus on a driving system that is not very simulative, albeit satisfying, can be considered a drawback only if you are used to playing Geoff Crammond's GP3 on your PCs. In this case I advise you to proceed further and hope for the conversion of the next GP4 on PS2, expected on XBox in August, which is also rumored to arrive on PS2. If you are looking for a simple, immediate title capable of giving you all or almost all the emotions of formula one, F1 2002 is the game for you. Pros: Simple and immediate Many modes Drivers and single-seaters updated to the current season Arcade and simulation mode Cons: Little simulation Disappointing frame rate Car physics that can be improved Waiting for the third world... In the less and less spectacular world of formula one, the team founded by Enzo Ferrari in 1929 is experiencing one of the happiest moments in its history thanks both to the 2 consecutive world titles won by Michael Schumacher (the third is not far away), and to the success sales planetarium. Despite the successes of the ~prancing horse~, I confess that I have emotionally distanced myself from a sport increasingly governed by money and technology and increasingly stingy with emotions and feelings. Gone are the days of the challenges between Prost and Senna, of the historic rivalries between the myths of the past, of the victories won in the last laps, of the frequent and spectacular overtakings. Formula one has become another sport. Fortunately, at least virtually, it is possible to relive all the emotions, and without discounts, of the magical circus of formula one thanks to the increasingly large number of simulations dedicated to it. Among well-known and lesser-known titles, however, only a few truly valid products stand out and one of these is certainly F1 from EA Sports, which this year has reached its 2002 edition, yet another in a series that has already won over many admirers.", "date": "2002-06-18", "grade": null}