{"name": "Soldier of Fortune II - Double Helix", "ref": "https://multiplayer.it/recensioni/soldier-of-fortune-ii-double-helix.html", "text": "First impact: the configuration, the videos and the Italian translation At first glance, the reconfiguration of the graphics options, setting only the lowest detail level of curvature, allowed me to play with good fluidity at 800x600x32 bit in almost all game levels (assisted however by 256 MB of ram and a respectable Athlon 1300.). The first impression one gets, comparing Sof2 to the other two ~giants~ with the Q3A engine (RTCW & MOHAA), is that of an excellent optimization work, which has brought Sof2 between the generous and extremely fluid RTCW, with Mohaa still acting as the ~master~ due to the excessive number of hardware requests. In the multiplayer field, on the other hand, the requests drop a lot and Sof2, like the other games mentioned, shows exceptional fluidity to say the least, even on computers that are no longer in step with the times (for instance, a cheap GeForce2 MX-400 with an Athlon 800, allow you to fully enjoy the multiplayer qualities of SOF2/RTCW/MOHAA, without many worries.). After a decent (and long) opening movie (staged in real time with the same graphics engine of the game), showing our Mullins sitting in a taxi traveling in the rain, I realize that in terms of tedious prose slowness we are on next levels ... to the torment! I assure you that once you have sipped the opening or interlude sequences, the second time you will by-pass them ... instantly! In fact, although the movies themselves introduce a lot of the plot into play, they are still too long and not very pressing and this makes them like a ~stone around the neck~ to the style of play that is anything but boring. Obviously, for those who prefer to enjoy the entire plot slowly, watching the movies is essential. The translation into our local language (however excellent) was limited to the sub-titles only, leaving the speech in the original language. In my opinion the choice was more than spot on; so you don't run the risk of hearing soulless speech, which ruins the game beyond any faintest thought (those who have played the Italian versions of SW-Starfighter and Black&White and then ~heard~ the original speech ones, will agree with this meter of judgment.). The only drawback is that reading the text takes your eyes off the actual footage, but you can't have your cake and wife... drunk. Flashbacks and terrorism: between past and present, the plot of Sof2 After a series of ~flashback~ levels, which dive into Mullins' past, we have the opportunity to partially ~test~ what awaits us in the following levels. It is enough for you to know that alone you need to take and protect a doctor, reconverted to the just cause by the remorse of so many merciless experiments, which will prove to be fundamental for the future intentions of a secret organization (The Shop), which will base the entire project on the ~repentant~ anti-terrorist ... of the future! I don't want to reveal too much and end up in a mere ~spoiler~ but defeating a Russian organization armed to the teeth, entering a hotel used as a military base for the imprisonment of a single man, crammed full of battle-hardened soldiers inside and out, is not something everyday. Then leaving the same hotel aboard a lorry complete with M60, with the ~protg~ driving like a madman on a slippery road, at night and in the rain, with lightning and thunder attached, while the Russians are tailing us from all the sides (and also from the sky) smacks a lot of action movies ... and we're just beginning! Of course, the initial levels themselves are a little too easy, but there is a lot of meat in the fire and it begins to take a ~taste~ already in the Colombian level of the jungle, where we are sent as support ~consultants~ of the aforementioned secret organization, which has finally kicked off the battle against terrorism. A terrorism that shamelessly resembles the ~real~ one of today (don't anthrax and the genetic modification of viruses remind you of anything?)! Obviously the first ~consultant~ mission didn't start in the best way, given that we find ourselves in the middle of an ambush, which separates us from our group of commandos and forces us, against our will(?), to take from the reins of the stainless and never tame warrior immediately! I don't know why but the plot makes everything look like Tom Clancy's ~Op-Center~ book series, which also sees here a secret organization, Op-Center to be precise, thwart terrorist attacks of all kinds (and of all factions politics) with ~secret~ military interventions directly on opposing territories. Technically speaking - part one But let's give a stop to the plot (otherwise if I tell you everything, many surprises will go to hell) and let's finally start talking about the real game. I anticipate that Sof2 is exceptionalle, but nothing on this planet is perfect, and Sof2 does not disprove this rule. After having played it for almost four consecutive days, completing it, I can certainly say that technically it is monstrous, that the graphics are superb and the sound too, but that it leaves a bitter aftertaste to indicate that a lot has been done, but that many aspects were also ... disregarded! For those expecting the ultimate single-player game well, I'm sorry to admit it, but we're not here either. For those who expect an advanced multiplayer game (it is an aspect of Sof2 that we remember had quite a few vicissitudes, given that it was taken into consideration at an advanced stage and then presented in the final version without bots) we can mention the great potential, which they really lead to competing with high-end calibres, such as Counter-Strike and RTCW. Obviously this first ~appearance~ may seem incomplete (even compared to RTCW itself, whose multiplayer counterpart is so mature and substantial as to present itself as a game in its own right, without having equals among its peers, including all ~stand-alone~ ones ~ created so far!), but I trust Raven for future free add-ons, which will improve it a lot, expanding it with other maps and gameplay modes. When we say ... ~unheard-of violence~! However, I would like to mention, going into the heart of the review, the violence inherent in Sof2. I obviously chose the ~maximum violence~ option when installing, but I never expected such rawness in the scenes! In fact, in the ~other screenshots~ section, given the nature of the images, I was forced to warn the public that the one presented must absolutely not be viewed by a minor audience! I can guarantee you that never before have I seen such (and gratuitous) violence, not only in a video game, but in so many otherhorror movies! Certainly not everyone likes to rage on corpses in video games (we should dwell on purpose) but by performing a ~test~ on a lifeless body armed with a knife I literally began to ~vivisection~ the character ... and I was horrified by what resulted out! Realize that not everyone has the stomach to observe such, how real, rawness, but everything that has been said about Sof2 is to be fully confirmed! I don't want to go into details, otherwise I risk being -rightly- censored, but to cut the throat and see the blood release in streams from the arteries that smear the jugular or literally ~detach~ the skull cap, causing the gray matter to come out in a lake of crimson liquid made a very bad impression on me! But so bad that I hope in my heart that those several thousand sales are not justified by this immense violence, otherwise we would run the risk of having potential ~sadists~ around the world! If Quake3 raised more than one eyebrow at the explosion of bodies in bloody clouds and pieces of mangled meat, unfortunately here we reach ~real~ vision levels and not purely of ... ~scene~! Screams and gestures are one thing, but the fluidity of the red liquid is so ~alive~ as to leave you amazed, especially when it is released from stumps of arms or legs! It may be a commercial move by Raven, but I still can't believe how Sof2 managed to pass the ~strict~ American censorship! Technically speaking - part two But let's leave the judgment on the violence to posterity and go back to talking about the technical contents of the game, which shows in total naturalness how phenomenal and flexible the Quake3 graphics engine is. It's true, there have been a lot of modifications and the surrounding code, but nothing at the moment can compete with such a massive ~core~ ... nothing until the release of Unreal2 and Doom3, of course. Focusing on some ~special effects~ I would like to mention the rain with the classic ~plinks~ of droplets when they crash on objects (the drops sliding on the binoculars are a real gem!), the different apocalyptic explosions, followed by the ruining of the structures that modify the design of the map (obviously only in singleplayer) or the delightful animations of the weapons, incredibly massive, with the shotgun acting as a clear pretender to the throne of the most ~violent~ weapon with the possibility of breaking the opponent's teeth ... with a rifle butt! Furthermore, how not to highlight the enormous texturing work or the animations of the ~deaths~, among the most articulated and varied of the genre. What, however, in my opinion, left a little to be desired was the attention to some details, two above all are the management of the ~hitbox~ (i.e.I was the perimeter of the body and the relative blow carried out inside it) and the intelligence of the bots, not so efficient, in stark contrast to what was repeatedly mentioned by the Raven programmers themselves. Let's start talking about the first ~neo~: more than once I've unloaded entire cartridges of bullets on characters without a defensive bodice (Kevlar) without them having had the slightest scratch! As a demonstration of this obvious inaccuracy (which I hope will be retouched as soon as possible in future patches) snipering is inevitably impaired. Occasionally, in fact, shots aimed with precision at the head (the classic headshots) are resolved in nothing, forcing you to hit the ~throat~. This is also associated with the meticulous and scarce amount of bullets for the sniper rifle, forcing you to use the single-shot M4 to ~snipe~ your opponents in the distance. It's a pity that in the long run eyesight goes down the drain, but I am counting on a ~perimeter recalibration~ of the characters with the next patches, knowing the diligence of the Raven programmers, who have shown that they fully support their products (see the case of the first Sof, still fully supported today). Furthermore, the LOD (Level of Detail) is also included, which approximates the curvatures of hills, mountains or objects in an approximate way. This translates into ~invisible walls~ between the projectile and the enemy, which act as a barrier to our shots! For example, it happened several times to hit a sentry on the head, without having the slightest response. As I approached the target, a tree branch (!) gradually appeared in front of the same sentry! Polygonal ~Spells~ that denote an exaggerated approximation, which on certain occasions negatively affect fundamental aspects of the game. Artificial intelligence ... not so much! Another negative aspect is the ~apparent~ intelligence of the bots. To be honest, compared to other games, they are smart ... but not that much! The much vaunted cover shots that are made between them are there, but they are so predictable and ~constant~ that the solution to such an artificial tactic is immediately found: they are ~teased~ just enough to attract them ~far~ from the area cover and puts them on like so many ~thrushes~ at the party! It's true that they occasionally drop a few smoke bombs to cover their advance, but more often than not it's the smoke bomb itself that warns you that they're closing in for the assault. Also, I don't want to say, but the only truly above average bots are still those... from Half-Life! In fact, although years have passed since the release of the Valve title, the ~competition~ has not yet been able to create something similar and ~variegated~ in tactics like those present in HL. I assume that only Condition Zero will be its worthy successor, to which everyone will be forced to refer for the artificial intelligence of their bots. Other small details that can be improved are the dynamism of the music, not always adjusted properly (sometimes it warns you well in advance of the threat of an enemy assault), some position bugs of some characters (in some shots some clear examples) and also some appearance in the multiplayer section, such as the unsightly flags of the completely static CTF mode (by now we are used to seeing them ~fluttering~). Obviously these and other details are also due to the nature of the ~first version~, which will ~mature~ with the usual ~piebald~ updates. Dynamic generator of multiplayer missions and maps I wanted to leave this section open until the end, to use it as a final element of the review. The dynamic generator is a clear sign of making Sof2 infinitely long-lived (in theory), but even this module needs a lot of polishing to be able to confirm a claim of such importance. The only four basic variables (game mode: assassination, demolition, etc...; type of environment: desert, hill, mountain, jungle; day/night; level of difficulty and so on) and the mathematical ~seed~ for random arrangement of the physical structures of the map, however, make them too similar to each other. Also, the great thing about auto-generated maps is that they're all outdoors! To this must be added the artificial intelligence of the bots in the mission generation section, which suffers a lot in terms of the ~scripts~, contained only in the official single-player missions, which make them more complex in this respect and give greater semblance of intelligence to the bots themselves. On closer inspection, these are all aspects that can be improved, but they highlight", "date": "2002-06-17", "grade": null}