{"name": "Streets of Rage - Recensione", "ref": "https://multiplayer.it/recensioni/streets-of-rage-recensione.html", "text": "What was it yesterday Streets of Rage, released for Megadrive in 1991, didn't have to appear exactly at the state of the art of the genre, which remained the preserve of the legendary Final Fight. The reason is of a technical nature: compared to the huge sprites, frenzy and speed of the Capcom title, Sega's first effort to successfully enter the genre was relatively slow, not very opulent, minimal. Streets of Rage, however, actually went further than Final Fight in terms of variety: if in the second the action was dictated by an endless offensive assault of button smashing, the first laid the foundation for a technical deepening of the kind that would find culmination in Streets of Rage 2. The choice between three characters, now made paradigm, was completely consistent with the genre. However, the quantity and quality of shots had increased, while the relative slowness of the action made the game more strategic. Firstly, a blow from behind was added to the usual combo of rapidly repeating blows, very useful for fighting on one front and not being discovered on the other. Secondly, the grip was enhanced by a jump on the immobilized enemy's back, allowing three different types of damage and with different effects: rapid blows, somersault effect-scenic projection and launch on the crowd of enemies. To these were added a ~smart bomb~ offered by a fellow policeman ready to devastate the crowds at a distance from a steering wheel and projections between fighting partners, which allowed each other to launch themselves against enemies using each other as a trampoline. What is it today Streets of Rage was already aesthetically old at its release, and today it appears as a particularly suggestive and archaic title. From this point of view, the technical sector has aged a lot, and this could discourage a lot those who intend to invest 800 Wii Points in it. In reality, the aesthetics of the game, however minimal from a technical point of view, is suggestive, full of filmic and typically eighties references, not particularly well animated but drawn with a hand endowed with style. To this must be added an audio proposal penalized by the Megadrive sound chip and by the scarce memory available, but in which the compositional quality and topicality stand out and the taste in using existing sounds to tackle different styles (from pop electronics to quasi- some levels of jazz). However, the strength of Streets of Rage is, obviously, compared to outwardly more fascinating titles such as Final Fight, the balance between immediacy and strategy allowed by the set of shots and the collaborative aspect of the excellent multiplayer. It is a balance that in fact represents the germ of change for the genre, destined to explode and create a new paradigm in Streets of Rage 2. All fans of multiplayer collaboration or the brawler genre will find Streets of Rage an excellent appetizer in awaiting its sequel, and certainly the best game of this genre currently available on Wii. Streets of Rage represents, especially at the most superficial and aesthetic level, the prototype of the first school massive fighting game, that of the eighties: horizontal scrolling, a substantially repetitive set of shots but to be combined and alternated, two-player mode and an infinite number of keep going to face the hundreds of enemies. In reality, the excellent brawler has a more evolved game soul, more nineties and, even if the fruits of Sega's experimentation will arrive with the sequel to this game, Streets of Rage remains - at 800 Wii Points - a good multiplayer for the enthusiast of the genre and the lover of retro aesthetics.", "date": "2007-03-20", "grade": null}