{"name": "Sp!ng", "ref": "https://multiplayer.it/recensioni/spng-la-recensione-di-un-puzzle-a-base-di-flusso-e-tempismo.html", "text": "The great puzzle games are based on extremely elementary ideas but with complex implications, something that may seem theoretically simple but proves difficult to achieve: do we find it in this review of Sp!ng? Not exactly at the levels of everlasting classics like Tetris or similar, but the idea of SMG Studio works very well, at least for a few hours, before inevitably becoming a bit repetitive. The strength of this game lies in its perfect adaptation to mobile platforms, requiring only to touch the screen and let go with the right timing: it is a game of flow and rhythm, as the developers themselves report, and there is no is a more fitting description in fact, because the important thing in Sp!ng is to maintain a fluid flow, using some basic principles of applied physics such as centrifugal force and attraction. Sp!ng is a puzzle that requires you to throw an object into a hole, going through increasingly complex levels Sp!ng's aim is to throw a strange star-like object into a sort of hole, using the thrust and trajectory imparted by a series of ~hooks~ arranged around the levels around which the object can rotate. It is the classic game case, easier to try than to explain, but imagine having various pivots to which you can launch a cable and be able to exploit them in order to make a body wandering in space change direction and speed: in a certain sense, it is apply, in a small way, the laws that are also used in space flight through the slingshot effect, trying not to hit obstacles and collect the greatest possible amount of bonuses before reaching the exit, barring further complications and additions that can intervene as you advance in the game. There are 180 levels to tackle, therefore a really important amount of content, even if keeping the interest alive to the end is not an easy undertaking. Gameplay and slingshot effect The control system is the simplest and most intuitive thing in the gaming universe, a real ~Zen~ game from this point of view: touching the screen, the ~star~ (let's call it that, for convenience) hooks onto the most neighbor present in the level, in case it is within range. At this point, the object begins to rotate around the pivot in the direction dependent on its arrival direction: by lifting the finger, the contact is interrupted and the star moves away following a trajectory linked to the accumulated acceleration and centrifugal force, just like occurs with the slingshot effect that exploits the gravitational attraction. Pressing the screen again starts a new connection to a possible nearby pin and so on: the aim is to try to cross unharmed, using this system, the levels full of obstacles and traps, at the same time trying to collect all the bonuses present to get the maximum score. Sp!ng contains about 180 levels, which vary in composition and graphical representation After the first simple learning stages, Sp!ng becomes a precision exercise based above all on rhythm and timing, on ~following the flow~ in order to exploit the uniform motion of the star and divert it if necessary, finding the best trajectories. The skill required is in the sensitivity of the touch: by pressing, releasing and pressing again with the right timing it is possible to correct the trajectories at any time, execute more or less narrow circles and arcs, up to a remarkable mastery of throws, in able to give great satisfaction. To this basic mechanics are then added the contextual variables proposed by the levels, with bouncing elements, catapults, timed passages and more capable of enriching the gameplay. From this point of view, the variations are not very many and the representation is clean and simple , although perfectly functional to the clarity of the game, it does not contribute much to a sense of progression between the almost 200 levels, which can bring out a certain monotony in the long sequence. However, the ability to also deeply customize the look of the levels and the 'star' through unlockable in-game mods works quite well to freshen up the aesthetics a bit. Besides avoiding obstacles and reaching the goal, in Sp!ng we have to try to collect bonuses", "date": "2021-03-17", "grade": "7.8"}