{"name": "Worms Blast", "ref": "https://multiplayer.it/recensioni/worms-blast_b.html", "text": "The worms land on the monolith<br> The Game Concept In WB you will guide different characters on their boats over the water of the sea that surrounds a series of islands. At various points on these islands there are levels to complete, consisting of target shooting tests against the formations of spheres, in full Puzzle Bubble style. Similarly to the Taito title, you have a cannon available to rotate left or right to aim at targets, launching colored spheres that will join those of the same chromaticity, freeing up space on the screen. A greater level of complexity is added by the fact that your character is not fixed in the center as in Puzzle Bubble, but moves on the water and with different inertia and speed depending on who you choose. This is the basic concept, then the levels are differentiated by objectives and mediate the addition of timers within which to complete them. In some cases, for example, you will have to hit moving targets, or only those of a particular color. Graphics and sound WB's graphics are very neat and pleasant. Although substantially in 2D, much care and taste have been employed in the design of the backdrops and the characters (these polygonal ones), with the use of many colors and a certain irony. Undoubtedly we are faced with a type of game and therefore of dated display, but the quality of the realization cannot be denied. The sound in turn is a condensation of jingles and catchy tunes, which never get boring and help to create a frenetic atmosphere, let's say a little ~giggles~. Playability and longevity The strength of WB is certainly the challenge against a human opponent. The rhythms of the game are very pressing in the challenge for two and can be amusing at times, even if confusion and frenzy will often be the master, rather than a real game strategy. The interest curve tends to grow in the first few games due to the feeling of carefree and the explosion of colors that you will produce on the screen without having to invest excessive mental energy. However, when you realize that you don't understand exactly who is winning during the game phases, you will soon be pervaded by the impression of wasting your time a little. The single player section has been enriched by a good number of possible tests, various in type and difficulty, but it is certainly even weaker and less satisfying. The main problem is that many levels are really difficult to finish in the allotted time and you will find yourself repeating them in bursts. The need for perfectionism and the fact that too often the game becomes a target practice that requires only aim and timing rather than strategy, make it a short-lived divertissement, which after 2/3 days you will leave in the closet to dust it off only with a friend .Conclusion While acknowledging Team 17's effort in proposing a pyrotechnic and original approach to the genre, I must admit that this game leaves no room for great satisfaction except when played in pairs. The excessive difficulty of some tests then makes it more enervating than satisfying as it was in the expectations of the developers. All lovers of the genre could give it a look, also considering the affordable cost (30 official euros, but I also found it for 15 in the Auchan stores). For non-puzzle game lovers, let's definitely give it up. The worms land on the monolith<br> The improbable paraphrase of the title sums up one of the most awaited events by PS2 users since..., well let's say... since last month, or maybe better since yesterday. In short, the Ubisoft title is not exactly a workhorse of the Sony line up, but it still represents a tribute to one of the 32-bit classics. The real surprise, albeit announced, is that Worms Blast does not reintroduce the game mechanics, based on turn-based combat, with which the saga has become famous. Instead, it is a Puzzle Bubble clone! In short, a puzzle game based on colored balls and items to be collected on the fly. At first glance, this does not excite many, but it is worth deepening the analysis to understand if and how Team 17 believed to revive a genre that has long been established and traditionally diverted to portable consoles.", "date": "2002-05-20", "grade": null}