{"name": "Blood Omen 2", "ref": "https://multiplayer.it/recensioni/blood-omen-2_a.html", "text": "Kain's Revenge After refusing the sacrifice and condemning Nosgoth to an unstoppable decline (Blood Omen) Kain became the main general of the vampiric armies with a great thirst for power (and blood) and a huge desire for conquest. During this fight Kain, armed with his invincible Soul Reaver blade, gave birth to a very powerful army formed by the most powerful vampires. Unfortunately during his fight Kain ran into the lord of the Sarafan, ruthless leader and powerful swordsman; the Sarafan used a new type of magic, called the energy of the Glyphs, with which they managed to bring down the Vampires. When Kain came face to face with this mysterious leader he engaged in an arduous struggle; however, the balance hung on the side of the Sarafan and Kain was brutally defeated, but more importantly deprived of the Soul Reaver. It is at this point that we intervene, taking control of a defeated and destroyed hero, hurled in a state of semi-death for 200 years. When we wake up we find ourselves with no memory and very weakened, our warrior spirit is initially appeased but as soon as the old bloodlust awakens and our benefactress reminds us of what happened, the desire for revenge begins to re-emerge. During the game Kain will try in every way to regain power and to complete his revenge on a population that is not worthy to sit on the throne of Nosgoth which is rightfully his. But who do you take me for? The first level of Blood Omen 2 will be practically a tutorial in which we will be explained the main features of the game (Kain doesn't like being treated like a beginner). The first thing we will learn will be how to save, in fact in Nosgoth we will find symbols on the floor which, as soon as they are trampled on by the big feet of the lord of Nosgoth, will light up and allow us, in case of death, to restart the level from that point. Later we will be instructed on the art of jumping and on the planing technique that Kain will be able to adopt, to hit the enemy from behind. Later we will also be fed, and we will be taught that Kain will be able to suck the blood from the downed creatures in order to restore his life. Furthermore, a secondary bar indicating the fiber will signal us when Kain will have the possibility to change level. What I have just mentioned is the famous RPG component of which we have heard so much: as Kain will suck blood from the opponents' corpses, the fiber bar will increase, and once the maximum value has been reached, it will allow Kain to ~go up level~; I put level up in quotes because in fact we won't be able to increase any stat, but the only thing that will increase will be the length of the life bar and the fiber itself. This aspect of the game could certainly have been treated more thoroughly, but it's still better than nothing. Subsequently, the combat system will also be explained to us, with parrying and attacking, and the method of using the special techniques of the vampires. The soul of Blood Omen 2 Blood omen 2 is an 11-level third-person action/adventure in which we will guide Kain through the darkest streets of Nosgoth in search of his revenge. The imprint of the game is mainly of exploration and combat, in fact in most cases we will have to go to certain locations, defeat the Sarafan that we will find inside and find the mechanism that will be able to activate something or open a door for us . After this brief explanation you may think that Blood Omen 2 becomes boring and monotonous in the long run, but it is not. Crystal Dynamic has managed in an excellent way to always make the gameplay varied, in fact with the course of the game Kain will acquire special abilities (we will analyze them in the next paragraph) which in some cases will make him more powerful in combat, while in others they will allow him to finding solutions to the puzzles scattered throughout the levels much more easily, thus making the development of the story much more varied. Now let's move on to analyze more deeply the fights and the puzzles that we will have to face. Initially Kain will only have the power of his claws as a weapon but over time he will be able to take advantage of the weapons of his former enemies so as to significantly increase his attack power ... remember, however, that a stronger weapon also equals a stronger enemy. The combat system is done quite well, with one button for attack, one for aiming and anotherfor the parry, with the latter you will also be able to block almost all attacks, thus increasing Kain's anger bar. As I mentioned before, Blood Omen 2 also provides the player with an RPG component that will allow Kain to increase the value of his life after a certain number of drinks; a detail that certainly could have been exploited better but which proves to be very important against the end-of-level bosses. These will mostly be old ~friends~ of Kain and will pose a real threat to our ~hero~. To defeat the bosses you will need to use unusual methods, a mixture of combat / puzzle that will alternate depending on the situation you find yourself in, a practical example could be this: punch challenge / puzzle / punch challenge. The other component of the game is the puzzle one. In this field the game turns out to be quite good even if not exciting. In the game it will be easy to find closed doors that can be activated by pressing a key or activating a lever, in both cases, however, it will be quite easy to be able to discover their location so as to reach it easily. On the other hand, the puzzles in which it is necessary to move some objects or exploit certain humans with the appropriate skill are more difficult. In any case, even these are not too worrying and certainly will not be able to block you for too long. The levels in Blood Omen 2 are all quite varied and well done; unfortunately, however, the interactivity with the objects that we will find inside will be very little, and only in some cases will our assiduous exploration be rewarded with a magical casket capable of increasing our fiber. However, a positive factor is the population of the cities themselves: the developers have not limited themselves to placing only the strong sarafans in the levels, but also defenseless humans who, if they wish, can serve as a snack for our Kain. The Dark Gifts These are practically Kain's special skills, they will be 7 in all and will include all the most varied combat and non-combat techniques. The dark gifts that we will be able to use in Blood Omen 2 will be: Fog: The first of the dark gifts that we will learn to use. It will give Kain the possibility of blending into the blankets of fog, so as to be able to launch surprise (deadly) attacks from behind the enemies, Very useful! Jump: With the jump we will instead be able to make real feline leaps that will allow us to reach previously inaccessible places. This ability can also be used as an offensive weapon to hit Sarafans from long range. Charm: With the charm we will be able to take possession of the mind of the weakest humans so as to allow us to control and exploit them as we please. Many times we will use this technique to make humans pull levers that are inaccessible to us. Telekinesis: This gift will be used by Kain to move levers from a distance, preventing him from approaching them. Fury: This boon allows Kain to unleash a more powerful and devastating attack than usual. Fury can only be used when Kain's rage gauge is at a certain level (about half). Ferocity: This attack will allow Kain to launch a barrage of blows at extreme speed against his opponents. This skill like fury also needs a certain level of rage. Immolate: This attack gives Kain the ability to kill an enemy without even touching them, burning them in a sea of flame. To use this ability Kain must have his rage gauge full. Soul Reaver 2 vs Blood omen 2: an inevitable clash! 1) The structure of the levels: Let's start by analyzing what is perhaps the most striking difference between the two titles, or rather the structure of the levels. As I said earlier Blood Omen 2 is layered. This will probably lead to think of a significant limitation of the much appreciated freedom of movement, typical of the titles in the series. In this respect I certainly can't say anything against it, but I can instead say that I prefer this style to the one adopted in Soul Reaver 2. In the latter Raziel had the ability to move freely throughout Nosgoth, but the movement area it was clearly lower than that of the first chapter, and many times the scenario was recycled (think of the multiple time travels...) with only small changes to the textures. With Blood Omen 2 this does not happen and even if some levels are similar to each other, you never find yourself always running in the same place. 2) The puzzles: As a second point we analyze the puzzles that we will find nand the two titles. I announce that in this case neither of the two games is able to embarrass a player accustomed to the more common Tomb Raider or the more selective Soul Reaver, in fact both limit themselves to inserting some easy-to-solve puzzles into the plot. The only difference in this field is that Soul Reaver 2 offers less frequent but longer puzzles, plus the possibility of accessing the spectral, which doubles the field of possibilities. Blood Omen 2 instead does the exact opposite, basing most of the puzzles on the elimination of water from some places or on the annihilation of barriers. 3) The graphics: In this respect there is little to say. Soul Reaver 2 as a detail of the characters wins, given its completeness in this field. In terms of the landscapes, however, I believe that Blood Omen 2 is little more accurate, given that the settings are very complete even if they don't allow for great interactivity with the player. However, it must be said that sometimes Blood Omen 2 (very rarely) suffers from some slowdown and this makes me incline to give Soul Reaver 2.4 the victory anyway) The bosses: But where are the magnificent bosses in Soul Reaver 2??? Fortunately they reappear in Blood Omen 2, and can be defeated with the Soul Reaver method: not with fists but simply by finding a secondary approach. In my opinion, this is a serious lack in Soul Reaver 2.5)Story: In this case the two plots follow different strategies, one based on a simpler and more linear story, also suitable for those who have not played the first chapter (Blood Omen), but which however in some points is linked to that of Soul Reaver 2, which instead offers, for its part, a more complex and articulated plot, for which you need to have at least a little basic knowledge. In this field I cannot express an opinion since it depends above all on your tastes (the lack of an end in Soul Reaver 2 is still felt). 6) Conclusion: I could write pages and pages comparing these two titles but I preferred to stop for don't risk confusing your ideas too much. In conclusion I feel like saying that for a fan of the saga it is advisable to buy both titles while for the less passionate I would recommend Soul Reaver 1... oops sorry Blood omen 2, I was confused ^_^. Polygon Nosgoth Graphically Blood Omen 2 is nothing special, even if the general graphic level is acceptable. However, the maps are full of atmosphere and the splendid volumetric mists make the town of Meridian and all the other locations truly credible and worthy of Nosgoth. The main character, or Kain will have 4 clothes available, each of which is made with skill and adapted to the place where the mission will take place. As for the number of polygons we remain in a medium-high standard and in any case more than sufficient. Even the enemies and inhabitants of Nosgoth are made convincingly. The only flaw on this aspect are the rare slowdowns that afflict the game and which in any case do not affect the gameplay. sound Blood Omen 2 from an audio point of view has very few defects. The dialogues are all in Italian, and it will be a splendor to listen to our opponents who, in the attack phase, will pronounce threatening phrases. During the game you will not miss the opportunity to hear the speeches of the inhabitants who will comment on life in Nosgoth under the Sarafan rule. Taking into consideration the sound effects (the crash of the swords, Kain's movements and the atmospheric agents), it can be said that everything has been created with a care that is unlikely to disappoint the player. Our vengeance is accomplished We have now reached the final chapter of this review and we need to draw conclusions. The game is very fun and intriguing, it certainly won't disappoint you and if you are a fan of the series it would be a mandatory purchase. Even if more work could certainly have been done on certain aspects (see the RPG component), Blood omen 2 undoubtedly remains an excellent title. Perhaps my review is a little against the tide compared to what you have read in the newspapers or on other sites, but I am convinced that Blood Omen 2, while not a masterpiece, is still a high-level title, much higher than enough. Pros: Kain Very fun RPG component Well done the dark gifts There are end-of-level bosses Cons: Some minor slowdowns Some might not like RPG component poorly used A continuous circle The birth of the First Blood Omen", "date": "2002-05-18", "grade": null}