{"name": "Economic War", "ref": "https://multiplayer.it/recensioni/economic-war.html", "text": "Allow me After the nice initial movie (which makes us understand discreetly in which place we are finished) our choice will have to fall on one of the 5 scenarios prepared by the developers for the single-player version; certainly not many, but you will admit that they differ pleasantly from each other, starting from the Food War (the only scenario in which Italy is present), passing by the Armaments Race and the Oil Crisis, ending with Telecommunications and Organ Donations. As you can see there is something for all tastes and to these 5 must be added the 3 network scenarios, such as Psychosis, Caf Culture and none other than Post-epidemic. Once you have chosen the situation to deal with, you won't need much time to figure out what to do, and HOW to do it. The learning curve of Economic War is among the fastest I've ever seen, also due to a very intuitive interface and, let's face it, the complexity of the game is not excellent. In any case, the objective of each scenario will always be roughly the same; build as many infrastructures as possible, whether they are farms rather than mobile phone factories or scientific research centres, maintain more or less peaceful relations with the other countries of the lot and pander to public opinion, an indispensable factor for surviving for a long time as a leader. Allow me The infrastructures are not very many, even if they are quite varied and perform well for their purpose, at least as regards the various factories and production centers. A greater imagination would have been more welcome with regard to the 'special' buildings, i.e. the various embassies, prison, the Media and Opposition building and so on, which greatly increase the involvement of the game and which shine for their numerical scarcity. Very important, as it is easy to understand, will be trade and the ability to place surplus products everywhere at the same time as the purchase of goods that are difficult to produce locally from countries in economic difficulty or, why not, under your threat of a missile attack. Yes, because it is also possible to attack the other states in EW, with a somewhat tacky but rather simple and pleasant half-arcade system (at least for the first few hours of the game). This section was made rather roughly, but it is understood that it was not the primary purpose of the developers, and we can be satisfied. Just like in Civilization you have to force yourself to smile wide-jawed while actually preparing the arsenal in great secrecy; the possibility of opening foreign embassies with the possibility of sending diplomats there, who you will transform from smart-ass into spies, with the obvious risk of being caught in full, with generally unpleasant consequences for the world order, is very nice. Mmm..convince me to buy it.. First of all, the graphical interface is decidedly pleasant, even if not very detailed. The maps of the nations are all very nice and almost pleasant to 'turn' far and wide, to choose the right place for a factory or a research center. The game system in general is very immediate and certainly captivating. The game will hardly bore you, because you will be too busy foiling a German conspiracy hatched against you while you sell cheese to the French and fire missiles at the Chinese. As already mentioned before, immediacy is one of EW's sure strengths, which will grab you right away. You will hardly need the various tutorials, very clear and precise as simple and sparse. The general feature that has gladdened the undersigned the most is undoubtedly the possibility of proposing various motions to international attention, ranging from proposing (or proposing) international aid to undertaking military action against a country, rather than proposing an embargo. The community will express itself with a simple vote; however, it is not possible to propose more than one motion per month, and once a type of motion has been voted for, it can no longer be proposed for 3 months. Then the models of the various heads of state are hilarious, very well made (maybe a little more animation would have been welcome). The more purely 'management' part, ie the set of various data that will help you make the various decisions, especially those of an economic nature, has also been very well taken care of. Ok..I'm going to buy it.. On the other hand, EW does not thrive on positive aspects alone. As mentioned before, the category of buildable infrastructures does not shine in terms of numbers. Furthermore, the fines that are offered to us sometimes appear unclear,generally due to lack of goods in our warehouses when some foreign country requests it. All right, we can always refuse to conclude (the whole deal), but that's very unconvincing. The whole game then lives on rather repetitive situations, even too much. Inserting a few more events would certainly have stimulated the player more, who after a few hours begins to no longer be surprised by anything. The sound effects are ultra-repetitive and after a few hours of playing they can start to seriously go astray, causing auditory and visual hallucinations you could have done better, or otherwise. A factor taken from Civilization is the absolute Chaotic of alliances, which change from day to day (or almost) and after a while you run the risk of not understanding much anymore. But this can also be seen as a positive factor, definitely. Quite incomprehensible is the mechanism that takes into account the percentage of public opinion, capable of remaining on Bulgarian percentages for months and collapsing below 50% precisely in the period of elections and the search for confirmations. The entire Research system is rather simple and far too linear; here too we could have done much better. The game also shines for its lack of configuration possibilities, both in terms of the few options and the initial choices. In fact, for each scenario it will be possible to choose only 3 out of 8 of the countries present, and this, although not so important, quite disappointed me. The music in general was rather cloying, which I found myself permanently disabling. Finally, a more detailed management of each single factory (or building) would not have been unwelcome, which is rather approximate. In short, make up your mind! In conclusion, EW is what it promises. Hours of sure fun, especially if you love management. Ability to take you for what it is, that is a good title that does not have exceptional pretensions. Perhaps it lacks above all in the originality and repetitiveness of the situations; but if you're the type who doesn't let these details scare you, and immediate games are your preference, you can play it safe. If, on the other hand, you are looking for something with more depth, and you are a Fan of Civilization or other similar titles, leaving it on store shelves could be the right choice. Introduction Have you always admired Luciano Moggi? Have you dreamed since childhood of running a state and feeling in charge of the world? Have you always been able to get by better with cunning and experience? If the answer is yes, especially to the first question, maybe you'd better see a doctor.. as soon as you leave the clinic where he will undoubtedly send you, you will discover that there is finally a game with which you can satisfy your most squalid ambitions. .. In fact, Economic War presents itself as the possibility of making you experience the same emotions as a Chirac (or Le Pen, if you prefer), Berlusconi or any leader of your liking; in practice, the hidden (and fortunately) dream of almost all of us. At MonteCristo they have well thought of packaging a very direct title, which is not lost in many subtleties but certainly goes straight to the point..if you have the patience to read the whole review, you will know if it was worth it.. Take a pinch of Civilization , mix well with Sim City and add a touch of petty cruelty .. this is Economic War, the title made on purpose, one would say, for those who are used to having their hands in the dough everywhere and, as the manual states, for those who are disgusted by spineless pacifists who fight for justice and occupation instead of aspiring to power.", "date": "2002-05-09", "grade": null}