{"name": "Fifa World Cup 2002", "ref": "https://multiplayer.it/recensioni/fifa-world-cup-2003.html", "text": "A tournament that unites the world After skipping the presentation, here we are then at the menus. The latter have been greatly simplified and now we will have the immediate possibility of being able to choose to play a friendly match or participate with a national team in the Asian World Cup. The Options are very rich as usual, you can change the formations of the national team, the severity of the referee, the level of difficulty, injuries, game cameras and commentary. It will be easy for anyone to navigate through the game's menus. Determined everything you want, you can take the road to conquering the coveted world cup. There is certainly no shortage of statistics, with the current position of the national team in the FIFA rankings, the best placement in the World Cup (Champions in '82 modestly...) and the formations. I noticed that apart from a few small flaws, the formations present are the ones that will most likely take the field starting from the end of May. Which national team could I ever choose? Certainly our beloved Italy, to be able to regain that title that has been missing in our country for 20 years now. It then starts in the elimination round together with Ecuador, Mexico and Croatia traveling to Japan, among the collective exaltation. Finally we get on the field First match of the group, unlike the previous titles, the presentation of the match was treated in every detail. The players entering the field is accompanied by a wave of applause and cheers with an unreal atmosphere. The stadium is totally dark, with a floodlight illuminating the field with the World Cup logo. The mascots on the sides of the field that move incited by the public. Finally the kick-off, the national team shirts are exactly like the originals. The graphics of the game are gorgeous, the faces of the players are faithfully reproduced like that of Zidane, Vieri, Tommasi, Nesta and Totti himself. Compared to Fifa 2002 released six months ago, player movements have been made more realistic with the introduction of dribbling, fake shooting, sudden sprints, first time throwing and the much requested triangulation. In terms of playability, World Cup 2002 has undoubtedly improved while still not reaching the levels of ~near perfection~ of Winning Eleven. There is a big difference between the various difficulty levels, so as to force the user to train hard before moving on to a more complicated level. Unfortunately, however, it is not yet possible to build actions that involve the whole team harmoniously in order to score; luckily, any possibility of starting from one's own defense and reaching the goal by dribbling the entire opposing team has been eliminated. The skills of the various players have now been tweaked, it will no longer be the case that a defender can dribble or run like any other star player. Finally we get on the field In fact, the latter are characterized by a star above their heads which identifies them in the field and makes them recognizable even when they take shots and a kind of halo forms around them. Once they reach the goal area, their shot will be highlighted by a gold stripe which will give an idea of their power. This innovation seems a little too outdated, it makes Fifa look like an arcade title but luckily for us this option can be disabled. Stealing the ball from the opponent is not easy at all, with the tackle you will not be able to get the ball but only unbalance the opponent who will continue his run towards the goal, and if you try to stop him with a slip you will very often be booked by the referee. Unfortunately, goalkeepers are still ~supermans~ when it comes to shots from outside the box that are often blocked with spectacular dives. Movements such as corner kicks or advances towards the attackers are too mechanical without that touch of humanity that distinguishes other football simulations. For the rest, we don't expect big changes in gameplay: there was an improvement, but not a clear one. Fifa World Cup 2002 focuses even more on the graphic and spectacular side than on that of playability. Stadium cheering, commentary and conclusions The soundtrack in a film is as important as in a video game; far more often the music and sound are remembered more than the game itself. The orchestral music idea for the Fifa World Cup 2002 soundtrack is very original but not very suitable. The best, in my personal opinion,it was listening during the presentation film, a catchy song (perhaps even the official anthem of the world cup) that would become the catchphrase for the entire world cup period. The music in the menus is very boring, the times are long gone when we could listen to Moby while choosing the formation to send on the field. The sound during the games, on the other hand, is very realistic, we can hear game screams such as ~careful behind~, ~pass~, ~shoot~ which associated with the graphics of the coach waving from the bench are very pleasant. The commentary of our beloved Caputi and Bulgarelli (now historic commentators of the Fifa series) has improved a lot; almost all the players are named and some of these like Totti or Del Piero are given very interesting news about their career. Furthermore, there will be some comments (perhaps a little out of place) on the various cities that host the Japanese-Korean World Cup. Summing up... Stadium cheering, commentary and conclusions Fifa World Cup 2002 is undoubtedly the best football simulation for PC around. A title aimed more at the graphic and entertainment aspect to pay homage to an important event such as the World Championship. Every year they expect those clear innovations capable of approaching and exceeding Winning Eleven, unfortunately this happens but in small steps, perhaps even deliberately; small but important steps especially in view of future football simulations. The game is perhaps limited in dealing exclusively with the world championships but it is always a good buy for all fans, especially if in the unfortunate event that the national team fails to win the world championships, we could do it again with Fifa World Cup 2002... Second Comment Given the exceptional nature of the game, we wanted to make an exception to the rule and add a second comment, made in this case by Andrea ~Logan~ Donati, who had already dealt with the review of Fifa 2001 and Fifa 2002: here is his opinion about the game! It is wrong to consider FIFA World Cup 2002 (henceforth FWC2002) as a game in itself. Considering this game as an expansion, in reality it is possible to give more positive judgments and to judge the game for what it really is... an expansion that completes the features of FIFA 2002. In the game released on last autumn, in fact, the lack of the world cup was surprising. There were yes cup qualifiers, but in order to emulate the tournament it was necessary to create it by hand. In short, it was clear, as happened in '98, that another game would be released in mid-spring that would accompany the players during the 2002 soccer world cup. What is surprising is therefore that FWC2002 is not FIFA 2002 with plus the World Cup, but it's FIFA 2002 with only the World Cup. So if once the World Cup is over (or even before) you are no longer interested in playing with national teams... you have to buy FIFA 2002 (or whoever for it). This is why FWC2002 is a real expansion of FIFA 2002 and not a game in its own right (although you can play it without installing FIFA 2002, of course). After such an incipit, it is evident that the first time I ran the game and I found myself faced with a menu with only four options, it was quite a surprise: where are the championships, tournaments and the editor of both? Where are the local teams? They are not here. However, the game menu is the classic FIFA one, less confusing than usual due to the aforementioned lack of choice. I no longer found the options to disable replays in the game, thus finding myself forced to continuously press ESC to skip a really large amount. Now let's move on to the graphics. FWC2002 clearly brings with it the FIFA 2002 models but with some truly curious and spectacular new animations, such as for example dribbling or new types of tackles, which in reality are of very little use in the game. However, if the ~bodies~ of the players are identical to those of FIFA 2002, the faces instead are almost all taken from the real ones. In FIFA 2002 this happened exclusively to a small group of players (those who own FIFA 2002 can notice that, for example, Totti's face is ~different~ from the standard graphics of the other players). This leads to a notable graphic impact, even if in some cases it turns out to be a bit ridiculous like the faces of Del Piero or Figo, bordering on caricature. As far as the sound is concerned, the matter becomes complex. Get used to rock or trendy rhythms, FWC2002 yespresents instead with a classical music that leaves a little disoriented. However, there is a greater involvement than the pop-classic mix present in F1 2000 also by EA Sports. A small group of orchestra players also appears in the usual meager theme song of the game, perhaps to make the public more aware of a courageous sound choice that gives excellent results. Still on the subject of sound, we can include the comments of our now classic Bulgarelli-Caputi. This time the duel of the worst actor goes to Caputi, whose comments on players, teams, stadiums and cities, while spot on, are thrilling. Bulgarelli, on the other hand, how are you doing? Just think that he is second only to Caputi... Second Comment To finish the gameplay. FWC2002 as mentioned before can be considered an expansion of FIFA 2002, but it has the most marked changes in the playability side. It was probably these that prompted EA Sports not to call this game an ~expansion~. Practically FWC2002 brings in itself a number of changes to gameplay very similar to what exists between one autumn edition and another of the game. In any case, the sensations experienced during the game are similar to those of other years: every time I pick up a new edition of the FIFA series, I find myself playing for a few days at the highest level of difficulty, always losing. and then, in the following days, I find myself winning more and more often, until I have total control of the game after just over a week. And this has always happened, repeating itself also with FWC2002. The changes are always aimed at playability, trying to modify some features of the game and simplifying others to ensure that those accustomed to the previous FIFA series have to start learning the new one again. So here is that the hand-to-hand tackles, which were previously the key to stealing the ball from the opponent without committing a foul, have now become enormously more difficult. If a correct tackle is made from behind, the ball is inexorably pushed forward, facilitating the opponent's play. If you do it from the side, you risk flying to the ground, leaving your opponent free to leave. Furthermore, headers can be managed better, but it is still cumbersome to be able to block the ball with the head or chest without sweeping it away. Then the master plays of FIFA 2001 return (balls from behind and rotations), but this time they can be implemented with the ~stars~ (the players considered the best by EA Sports). On the other hand, the excessive goals from outside the area, the posts and shots on the edge of offside remain children of FIFA 2002. Corner kicks and free kicks, which in FIFA 2001 and 2002 often led to goals, are difficult to manage also because there is no longer the possibility to kick a specific player (selecting him with the keyboard or pad) but only to decide the generic direction and the generic power. In short, going forward at this rate, I don't think there will ever be a perfect FIFA. Every time I find myself faced with a game in which the graphics are enormously improved, while on the playability side we are witnessing a new and innovative feature (this time it's the turn of the ~stars~), surrounded by game systems that a year they work and the following year they don't, aimed at disorienting the player of the previous editions. However, it is indisputable that between the positive and negative novelties of the game there is always a small step taken each time. But it is a step as thick as a sheet of paper and the summit is still very high. A tournament that unites the world Who among us has never dreamed of winning the World Cup since childhood? Dreams, spells that punctually return to our thoughts every four years, between fans and videogames. Since 1998, Electronic Arts has accustomed us to very faithful reproductions of the world championship, and this year too it is ready to give us a new title. In the preview together some time ago, taking a cue from the demo released by Canadian producers, we had the opportunity to foretaste the new Fifa. Let's now dive into the official game released throughout Italy on April 26th. In every Fifa, the presentation of the title has always played an important role, how can we forget that of Fifa RTWC 98 or that of 2000 among the most beautiful; strangely this year Electronic Arts has decidedly disappointed. I would have expected something truly original and astounding capable of making the player's mouth water at the moment of seeing it, instead I was disappointed to see a very ~soft~ presentation in which the orchestra and some", "date": "2002-05-08", "grade": null}