{"name": "Jane's Attack Squadron", "ref": "https://multiplayer.it/recensioni/janes-attack-squadron.html", "text": "The game The simulator examines the European theater of the Second World War and will allow us to fly classic aircraft such as the Bf-109, the Spitfire, the FW-190, the JU-88A, etc. etc. There is no revolution in terms of game modes, where we find the possibility of playing a single mission or trying our hand at a ~Quickmission~, choosing the type, number and model of planes (note that we can try to duel with planes from the same side). There is also the possibility of training in the various maneuvers with the help of a pop-up menu with instructions.. a bit awkward if you consider the various ~virtual instructors~ present in many of the recent simulators. There are two campaigns, one for the Allies and the other for the Luftwaffe: as for IL2-Sturmovik, here too there is no dynamic campaign but a sequence of consecutive missions: luckily depending on your results, the campaign seems to take different, but the missions themselves are heavily scripted. Unfortunately, the campaign is not seen as the equivalent of a ~career~ mode, but from time to time you will find yourself impersonating different pilots and therefore flying very different aircraft. The game For the briefing phase, something more could certainly have been done, in fact there is no possibility to configure the aircraft's armament or to see the map of the flight area (not even available during the flight). The types of missions you will be faced with are very varied and include everything you could imagine (the emphasis is on ground attacks: you will also be able to fly as a gunner on bombers) including attacks on ships! Once in flight you will have various tools at your disposal to facilitate aiming, such as the classic Padlock (which will activate a mini camera in a corner of the screen showing the aircraft) or a ~targeting cue~ borrowed directly from Wing Commander! Do you remember that little indicator that indicated where to shoot to make the shots land in the time it would take them to cover distances. Not very ~correct~ but certainly useful for novice pilots. Another useful tool is the possibility to jump directly to the next waypoint once the objectives are completed (there is however the possibility to speed up time). The flight model The flight model in JAS is not among the best, compared to what Battle of Britain and IL2 Sturmovik had used to. If we consider all the various possibilities that the game engine makes available, we realize that some do not work as they should. For example, it is possible to act on the engines of the bombers individually but the result does not seem to have any particular effect. You also don't feel a real difference in controls between flying a fighter and a bomber (fully loaded or not). The resistance of the controls is not modified at high speeds as in other recent simulators, not to mention the effects that the damage should cause to flight stability but which are not actually felt. It goes without saying that you shouldn't even approach this game if you don't have a good joystick, as with the keyboard it's literally impossible to even attempt to control the plane. Fortunately included in the game there is a Physics Editor which will allow the ~community~ that has formed around this game to correct the mistakes of the original developers, but it is certainly not a good sign if the game instead of being completed by those who devised it, it has to wait for user intervention. The technical aspect Time for JAS stopped at least two years ago, if not even further, the graphics do not hold a candle to what was seen in IL2 Sturmovik and even some of the polygonal models of the planes are wrong according to the experts. The game performance also seems to degrade in the presence of a large number of aircraft (but we are not at BoB levels), even on high-end computers. In the cockpits, entirely made in 3D, many of the instruments are illegible or simply ~fake~. The cockpit view is also very awkward to use as the aircraft windows are ~dirty~ making it difficult to fly properly. In conclusion Jane's Attack Squadron has evidently suffered from being abandoned and then retaken at the last minute. It is certainly a title with a lot of potential (thanks to the Physics Editor), but you can't just count on the community to improve the game. JAS should have come out in the period in which it was suspended: today it is simply a ~body~ reluctantly reanimated and thrown into the fray, ending up not holding a candle to the most modern simulators. If IL2 is no longer enough for you, wait a while to see if the game is improved by the arrival of the mods and then consider purchasing them. Jane's Attack Squadron JAS is one of those titles with a troubled history that, after being reported missing, manage to get published. In the now distant 1999 the first news regarding this title began to appear: it should have been the ~combative~ title of the Flight Unlimited series of the now sadly disappeared Looking Glass. The title was canceled the following year by Electronic Arts only to be picked up by Mad Doc Software, where many of the former Looking Glass members worked. Originally JAS was announced as the classic game that would revolutionize the genre, especially aimed at ~hardcore~ users. Now after a long time of relative silence, JAS is finally out but was it worth it? Let's find out the answer... Jane's Attack Squadron arrives in a DVD-Box, an unusual solution for a flight simulator: in fact, inside the package there is only the CD, a 16-page manual and a reference card for the keys. Once the game is installed you will find the ~complete~ manual of 80 pages in PDF format. Not an ~elegant~ choice for a flight simulator, once you get used to the manuals of hundreds of pages of other titles.", "date": "2002-05-07", "grade": null}