{"name": "Paperino: Operazione Papero", "ref": "https://multiplayer.it/recensioni/paperino-operazione-papero_a.html", "text": "The game Those who are prejudiced (like myself, mea culpa NDLatin) towards tie-ins and/or platforms aimed at a younger audience, better think again: while not boasting noteworthy innovations, stunning graphics and Grammy-worthy music, Donald Duck: Operation Duck lets you play which is a pleasure. After the initial loading (of medium duration), we will see a decent full motion movie where we will see the live kidnapping of the reporter Daisy Duck (Daisy) by the hand of the usual bad guy on duty, Merlock, already seen in the TV series starring Uncle Scrooge ( Uncle Scrooge), or Duck Tales (who remembers the excellent platform games licensed for Nes and Game Boy, branded Capcom, released a decade ago?). Donald Duck who has seen live together with the odious Gastone (Gladstone Gander, the luckiest of Duckburg/Duckburg) the kidnapping of his beloved, decides to go and free her, strengthened by the help of Archimedes' inventions (Gyro Gearloose) and the advice of his beloved pests, namely the 3 grandchildren Qui, Quo, Qua (Huey, Louie and Dewey). However, there are the famous enemies of the unfortunate duck who wears the sailor suit (no connection with Sailormoon, fortunately NDLatin), or the Banda Bassotti (The Beagle Boys) who for once will let go of the riches of the well-known step-uncle, in the same way as the sorceress Amelia (Magica De Spell), who apparently is not at the moment engaged in the recovery of the famous first cent of the stingy Scrooge. Along the twenty (approximately) levels that the player will have to face, there will be numerous enemies to be eliminated based on punches or classic jumps on the unfortunate person on duty, as the platform tradition obliges; nevertheless, it will also be the numerous platforms (mobile or not) that will give our hero more of a headache, at the beginning intent on collecting the pieces, scattered one per level, of an invention of Archimedes important to our videogame alter ego and to the next saving Daisy Duck. Each world is divided into various sublevels (replayable whenever you want to constantly improve your time), the last of which is presided over by a more or less tough boss. Although a classic platform game, therefore with a high level of fun, the few moves available to Donald Duck, the difficulty of using some special moves (as well as the indispensable methods for using them, as they are not immediately available), the level of difficulty far from irresistible (for an experienced player), the limited freedom of movement present (you scroll from bottom to top or from left to right or from top to bottom - forget Mario and Jak And Dexter, welcome back Crash Bandicoot episode 1 -) they do nothing but significantly lower the evaluation of the product in question which fortunately remains more than discreet, we dare to say even excellent if this is one of the first platformers of your life and you have never experienced the thrill of controlling Mario or Sonic in your life. Cosmetics Graphically, the Disney product does not excite but, slyly, it does not disappoint, as, among other things, did the versions intended for the 128-bit consoles of Sony and Sega: cartoonish look, well-made sprites, lots of animated frames, well-designed backdrops well-kept (cities, ruined castles, Archimedes' laboratory, forests, etc) decent special effects (only) and a perfectly fitting color palette make Donald Duck: Operation Duck very close to a cartoon (look at Donald's very smooth animations after a couple of minutes of inactivity!). The frame rate, set at fifty frames per second, does not disappoint, except in the presence of situations that are more tangled than normal which halves (25 fps) the fluency, even for 3-4 constant seconds. It is also obvious that the cause of these uncertainties in the graphics engine lies in the hasty conversion (which obviously did not benefit in the slightest from the intrinsic potential of Nintendo's 128-bit hardware), in view of the Gamecube's European debut. Therefore a slightly discreet result, cubed (it is appropriate to say it NDLatin) for the little ones who will be able to control their hero, modeled and animated in an at least perfectly fitting way. sound The music is absolutely forgettable, trivial, flat, uninspired, among the worst ever heard in a video game if it weren't for the excellent sound quality of the Gamecube audio chip which gives the latter a crystalline quality. The sound effects are not particularly different from the quality of the music, but the dubbing deserves an Oscar: first of all, there are several localizations (amongincluding, incredibly, also the Italian) but what is surprising is that the original voice actors of the TV series starring the mythical characters of Duckburg have been summoned and, with original voice actors, we mean the voices intended for the English, French and, roll of drums, Italian; over 20s like myself will shed a tear when they hear Donald Duck's voice, especially when he's pissed off, as he usually is. Conclusions Donald Duck: Operation Duck is a product that, with a few more changes in terms of gameplay, a greater number of technical features and the presence of various levels of difficulty, would have been an unmissable title for anyone. As things stand now, it's a very honest product that will keep our younger readers and non-platformers entertained for a long time; all the others (especially if grown up with Mario, Sonic, Wonder Boy, Crash Bandicoot, Shinobi, etc) will solve it in a couple of days of continuous play, given that the playability is very captivating (glaring proof: the undersigned, at night, never plays for a couple of hours in a row, especially after an intense work of finishing the thesis). Unmissable for Donald Duck fans, for lovers of good platformers and, on the other hand, for those who are interested in this genre with this Donald Duck tie-in. All the others, at least, give it a careful look lasting at least 1 hour, it could pique your interest. P.S. : The Gamecube version features the ability to change Donald Duck's clothes. Pros: Very funny, almost like the classics of the genre THE Donald Duck game THE best possible dubbing, identical to that of the TV series Very fluid animations, excellent graphics .. Cons: ..even if it does not squeeze the Gamecube video chip in the slightest forgettable music too easy for platformers Cubed Donald Duck It is customary to say that there is always a first time in life, in the case of those who write these lines, one could associate another famous saying, that of killing 2 birds with one stone, given that if on the one hand reviewing a game with protagonist a childhood myth like Donald Duck (Donald Duck) is difficult to explain with mere words, it is also true that there is also a certain emotion in reviewing a Gamecube game for the first time, among other things also Pal. For the first European day of its 128-bit, Nintendo really did things big, launching the console at an at least interesting price and with a line up of videogame genres ranging from football (Iss2 by Konami) to tie-in (Rogue Leader by Lucasarts), from the (semi) puzzle (Super Monkey Ball by Amusement Vision/Sega) to the platformer (Sonic Adventure 2 Battle by Sonic Team/Sega); for the first time in a launch of Nintendo-branded hardware, however, an episode of Mario failed, leaving those who wanted a platformer to try their hand with a bitter miccino in their mouth, if not the aforementioned second episode (a deluxe miccino in this conversion) of Sonic Adventure and the here present Donald Duck: Operation Duck (Donald Duck: Goin' Quakers), already released for platforms such as Sega Dreamcast and Sony Playstation 2. Let's see if the famous Walt Disney character will succeed, together to the ~colleague~ hedgehog, to fill the huge gap that will exist until the release of Super Mario Sunshine.", "date": "2002-05-06", "grade": null}