{"name": "Ender Lilies: Quietus of the Knights", "ref": "https://multiplayer.it/recensioni/ender-lilies-quietus-of-the-knights-la-recensione.html", "text": "We spoke to you about Ender Lilies: Quietus of the Knights for the first time in the January test, being surprised by the excellent work done by the Japanese studio Live Wire and reserving the right to verify the few doubts with the full game. We come back today not only to confirm the positive things we found months ago but also to dispel the only two perplexities reported in that article: we are facing an excellent metroidvania, which after the very first hours opens up to a very extensive map, full of secrets, multiple endings to discover and earn, a level of difficulty that gradually rises without becoming impossible and a story more tragic than the premises already led to believe. It has its flaws, however overall it is a metroidvania that we absolutely recommend to fans of the genre. We tell you our impressions in the review of Ender Lilies: Quietus of the Knights. A kingdom of the impure Ender Lilies is set in the kingdom of Finis, which fell into ruin due to the mysterious necrorain that transformed anyone who came into contact with it into an impure: a deformed and hostile creature, whose features are in rare cases similar to that of humans ( or animal) of one time but in others it is a grotesque fusion of several elements. No one, except for the vestals, is able to counter this scourge and we will embark on our journey as one of them. It is a little girl, mute and accompanied by the spirit of a black knight: neither of them seems to have memory of their past, therefore the goal of reaching the end of the kingdom is not only to look for the first, true vestal but also to understand who they are and what their job is. An adventure, if we want to define that as crossing a dead land full of pitfalls, which will lead them to discover everything both about themselves and about a kingdom that hides much more than it seems. Perfectly enclosed in the canons of dark fantasy, the story of Ender Lilies: Quietus of the Knights we can say that it reminded us of the tragedy of Hollow Knight, with the substantial difference that while Team Cherry's work left a minimal, occasional space for a smile, we won't find any here. The entire narrative rests on the drama and does not move away from there, sinking more and more roots as we continue to discover the hidden truths of the kingdom of Finis. Is there a happy ending to this journey that seems to have none? We could tell you yes, without spoilers, but it all depends on your conception of ~happy~. To create a strong contrast with what we are experiencing there is a beautiful soundtrack, often delicate to the point of being dissonant with what we are experiencing yet, at the same time, never really out of place. The artistic direction, on the other hand, in turn of great impact, concentrates around the figure of the protagonist concepts such as hope, purity and innocence, in contrast with rampant corruption, but shows us the world for what it is in all his misery. Overall, the technical / artistic sector of Ender Lilies: Quietus of the Knights stands out and remains impressed, recalling the works of Vanillaware, albeit from afar. The souls of the fallen fight for us Ender Lilies: Quietus of the Knights, threats lurk everywhere Ender Lilies: Quietus of the Knights has an almost unique mechanic on its side and that we have been able to experience, rather recently, in Oninaki: being the protagonist a child, it is unthinkable that she can fight alone. Which is why, thanks to her vestal powers, she can purify some of her defeated enemies to fight alongside her. The black knight is an exception, he has existed since the beginning and the reasons for his presence will be explained throughout the story, while for all the others you will have to defeat them and then recruit them: the interesting aspect is that not all bosses will be placed in your path, forcing you to defeat them. Indeed, to tell the truth there are very few of those necessary to reach the end of the journey but this means missing out on a large part of the experience. However, we are talking about a metroidvania, exploration and backtracking are the basis of the experience, so if on the one hand it is true that the game can be finished in a handful of hours, on the other hand the most immediate result we will achieve is also the least satisfying and allows us to just skim the surface of Ender Lilies: Quietus of the Knights. Bosses and minibosses, the only ones that can be purified, dot the map and are not always predictable. Sometimes we could understand having to face a challenging fight due to the presence of a save point immediately before or due to the extension of an area - you know, right? Those very large and very empty areas that gridano ~boss fight~ from every pixel. Others, on the other hand, and this above all concerns the mini-bosses, suddenly appear in front of us, thanks to the fact that they are identical to common enemies: when we see the red health bar and a name appear, it is at that moment that we understand that we have to commit ourselves more than usual. Purifying an enemy means gaining their strength in battle, in the form of a summonable wraith that will perform the indicated attack. There is something for all tastes and for all strategies, from magic, to poison, to melee and ranged attacks. We can equip two sets of three skills each but it is necessary to keep an eye on the charges, since each ghost, or soul if you prefer, has a limited use of its own skill: this makes the fight more reasoned especially with the actual boss fights , because for everything else we have to admit that we have entrusted ourselves to the black knight and to some sporadic intervention by the other characters. Ender Lilies: Quietus of the Knights offers you continuous experimentation and an equally constant change of pace when it comes to establishing a strategy, however a small critical point that we must move is precisely this: the excessive amount of skills means that many are not used, or turn out to be useless, and on the other hand all common enemies with a few exceptions can be faced ~hard-nosed~. This doesn't mean that the game itself is easy, in fact, just less open to variety than we expected, despite the amount of powers to discover and use. Ender Lilies: Quietus of the Knights, some rest for our tragic heroes Similar to what was seen in Hollow Knight, it is possible to change skills and relics, as well as strengthen our spirits, only during moments of rest: whether it is a bench, a chair, a bed or anything assigned to the role, here we will be able to pull a moment of breath, organize ourselves and move quickly from one save point to another if necessary. The relics we just mentioned are objects to find along the way that will make the difference between life and death, when equipped: we can't put as many as we want, we have a certain number of slots (expandable by finding, again, specific objects ) and on the basis of those deciding how to intervene on the Vestal Virgin and the souls that accompany her: some heirlooms directly influence her, for example those that increase the effectiveness or the number of soothing prayers with which to heal herself, others instead go to work on the strength of attacks or on the number of skill charges, others still, albeit rare, we need to pass almost unscathed through some areas. In this sense, equipment management is more balanced and useful than the excessive number of skills mentioned above, because especially when we have to face a boss fight it is necessary to understand what it can do for us in that particular situation. A similar argument it can be applied to upgrades: to improve a single spirit you need impurities of different types, which collect in the game world - so once again there is a huge emphasis on exploration. Considering the amount of skills, the cost to improve them and above all the fact of not being able to maximize them all, it is necessary to manage it in a very precise way because once it is done there is no going back. Ender Lilies: Quietus of the Knights leaves nothing really to chance and despite the slight criticism leveled at the management and actual usefulness of the powers of the ghosts, it sets up a perfect gameplay both for those who have chewed Metroidvania for a lifetime and for those who have just tried it approached. It's not too punitive, not at the levels of a Hollow Knight to be clear, but it doesn't spare its blows especially when you decide to explore it from top to bottom: the map is actually huge, interconnected, full of secrets, documents to read to fully understand the narrative and essential, in its entirety, to truly complete the game. Stopping at the first finish line, the easiest, not only leaves a bad taste in the mouth but gives a bit of the same feeling as NieR: Replicant or NieR: Automata: the real game has just begun. Ender Lilies: Quietus of the Knights, one of the darkest suffocating settings in the game", "date": "2021-06-29", "grade": "9.0"}