{"name": "Warlords Battlecry 2", "ref": "https://multiplayer.it/recensioni/warlords-battlecry-2.html", "text": "War breeds heroes In Warlords we have the ability to totally create and control our hero, characterizing him almost to our liking. First we choose the race we belong to (we have 12 available with different basic skills), now the hero we have created is ready to gain experience from one campaign to another, he can specialize in one or more classes (warrior, mage, etc.) and will learn spells by increasing his skills. The hero is the fundamental unit for every battle, not only because of his power and incisiveness in combat (in fact he is not always the strongest unit) and because of his magical abilities, but also and above all because of his ability in research and convert resources (let's not forget that we are talking about a management system), build buildings and heal your troops. It therefore seems clear that our pg deserves all the attention and care of the case on the battlefield, and it takes a lot of patience as the development of the experience and skills of the hero we manage will be, at least at the beginning, a slow and sometimes frustrating work. It starts from level 1 and there is the possibility of going up to level 50, it would seem complicated but in reality, thanks to an accurate way of managing experience points, it is not that much. In fact, at the beginning of each campaign (or skirmish or multiplayer game), we will be asked to choose the game mode, it is possible to choose between four of these, let's see them together: Normal: the normal game mode; Tinman: in case of victory our hero gains 25% experience but nothing in case of defeat; Bronzeman: 50% more experience for each victory but, in case he is killed, the hero loses all the experience accumulated up to that point; Ironman: the extreme mode, in case of victory our points are doubled, but if we were to die there would no longer be the possibility of going back. As far as the rest of the game management is concerned, we are faced with a classic RTS, with buildings that need to be evolved to obtain increasingly advanced units and with the classic, spasmodic race in search of the resources necessary to keep the barrack going. However, the campaign mode is pleasantly dynamic, we will find ourselves studying a map (the world of Etheria) divided into territories, each of which is controlled by a race, our goal is to expand our dominion over the continent, so as good strategists we will choose which region to attack and subject to our dominion. Whenever we manage to overwhelm a race we will subject it to our will, and it will therefore be possible to use also the subjugated units for the continuation of our expansion, of course each region conquered by us will cause our economic resources to increase, and it often happens to find ourselves play real ~bonus campaigns~. This game conception greatly elevates the longevity of this strategy, giving the possibility to replay the missions in several different ways. Levels, classes and units Once we reach the second level, we will have to choose a specialization class for our hero, there are four classes available: warrior, priest, wanderer and magician. There are also subclasses each with particular skills, such as the ~assassin~ skill and eight schools of magic. Of course, when choosing the class it is advisable to take into account the race of our hero, in fact there are races more predisposed for a certain specialization rather than another. The units in support of our hero are really many, above all considering the fact that compared to the first episode the developers have added 3 races compared to the original 9, this could suggest a jam of men and means of different types that would make the life of the player hell, but that's not really the case as many races develop units that are similar to each other (many times identical) for example the three races of elves (high, woodland and dark elves) share the same type of unit with some variation for what it concerns magical beings, the same thing can be said for barbarians and minotaurs. The authors of the game have given vent to their imagination as regards the units of races such as demons and undead, above all as regards spells and various diableries ... we can say that the ~bad boys~ campaigns are by far the most funny. Speaking of units, however, one cannot fail to mention a real gem, I'm talking about the ~titan units~, practically every race has at its disposal at a certain point in its development a unit superior toall the others, the Titans, very tall beasts often much stronger than the heroes who alone can almost halve the opposing units and who require a lot of effort to be stopped. Technically speaking If the gameplay is quite pleasant and innovative, it must be said, however, that Warlords Battlecry 2 certainly does not excite in terms of graphics; certainly the 2D artwork is pleasant and colorful, the addition of the 3D terrain is spot on, but the animations of the units and the design of the same are rather sparse. The screen is rather static except in moments when the battle is raging. Same thing for the sound, the soundtrack is impressive and varies from adequate music during battles to haunting but perfectly timed vocals during the rest of the game, while the list of phrases and words spoken by the heroes and other units is static, repetitive and often off place. The AI is respectable, we will see the enemies scrambling to find resources, but after the first skirmishes, more or less numerous squads of enemies will launch themselves in pursuit of our hero and our camps. Conclusions The management of the hero, the number of units available and the dynamic campaigns make this Warlords a more than worthy antagonist of the long-awaited Warcraft 3, not to mention the fact that if multiplayer were to catch on for this game, creating such a persistent hero ~ it could be interesting. In any case, even if this second episode presents some innovations compared to its predecessor, the leap in quality is not so evident, consequently Warlords Battlecry 2 is a good game, but advisable for less savvy players and novices of the RTS genre. Introduction When the Warlords turn-based strategy series became popular in the early 1990s, one sensed that this was something very serious, a lot of strategy in a world of swords and sorcery. In the last decade there has been an impressive profusion of strategy games that borrowed the classic elements of fantasy to decorate gameworlds of various kinds. The developers of Warlords have always preferred to focus more on strategic gameplay and extreme combat against units of various types rather than flashy graphics or story. In this sense, therefore, the second episode of Warlords Battlecry can be considered the prominent element of the series. It expands on the basis of its prequel by implementing some really interesting new features: the campaigns are absolutely more dynamic, the number of units and factions to control is greater (keep an eye on the exceptional ~titan units~ an absolute novelty) and the gameplay it is respectable. But the real strength of this sequel is still the RPG-style hero development, a feature that has always distinguished Warlords Battlecry from other real-time strategy games.", "date": "2002-05-03", "grade": null}