{"name": "Global Operation", "ref": "https://multiplayer.it/recensioni/global-operationquando-la-squadra-fa-la-differenza.html", "text": "When specialization makes the difference. ~Team based~ games are proposing more and more in the panorama of PC games. After the undisputed success of Counter Strike, the people of team fraggers have been offered some titles with a nice concept but without the necessary specifications to really make them substitutes for the team game par excellence. Now arriving on store shelves Global Operation, a product with some innovative ideas that could snatch the scepter from CS's hand. Let's start talking about the first element that characterizes and distinguishes Global Operation: specializations. While in the other games having a specialization was reduced, in most cases, to deciding which weapon to use (since our electronic archetypes are just as adept at wielding machine guns as sniper rifles) in Global Operation the choice of the ~class~ to which we will decide to belong will limit both the type of equipment we can equip ourselves with and our actual ability with it. For example, if we decide to face the battle as a Sniper we will be able to use a Sniper Rifles as a primary weapon, we will not have access to any secondary weapon, we will only put a simple pistol in the holster and we will be able to hang two grenades on the belt of our light bulletproof vest . The distinctive feature of the class will be the high-speed movement. If instead we decide that our fighting style goes better with a high firepower we will be able to opt for the Heavy Gunner class which will see us equipped with a Machine guns as a primary weapon, a Shotguns as a secondary to the canonical gun ordinance and finally 6 grenades and a medium or heavy protective jacket. Obviously, given the greater weight of the equipment, we will be penalized in terms of speed and agility of movements. Single player... but member of a group. Global Operation, as well as a team game, also tries to offer itself to single player lovers by providing 13 distinct missions in which to test one's military and strategic skills. During these war actions we will find ourselves projected in locations scattered across the four corners of the globe: we will start from Mexico and then move on to Canada, Antarctica and Colombia making passages even in Sri Lanka, Argentina and North Africa. Each location will be characterized by a detailed reconstruction of the environments and architectural elements typical of the region in which we will be sent, and a lot of attention has been spent by the programmers to give life to the most realistic places possible by inserting numerous elements with which it will be possible to interact to have roofs to adverse blows and to ambush. While under the level of detail of the maps there is nothing to object to, a separate discussion must be made regarding the behavior that comrades in arms and enemies will have on the battlefield. The A.I. of the bots present in the product is in fact at very low levels, often making the game frustrating. Our opponents will rarely be able to apply any guerrilla tactic, proposing themselves to our blows without any protection and having the sole purpose of unloading their weapons towards any target on the screen. The same thing applies to the troops with which we will have to coordinate our actions, they too will be characterized by a strong suicidal instinct, having as their maximum tacticism the following of some other member of the team to cover their backs... which often, among other things, does not they can't even do it. On more than one occasion I have found myself facing my troops who, remaining stuck in a corner, or trying to take aim, have remained helpless under the fire of a single enemy armed with a simple pistol who delighted in exterminating them as if they were geese from amusement park. Unity is strength As Global Operation is disappointing in terms of single player so it is fun and exciting in multiplayer mode. The spirit of the game is precisely that of recreating the atmosphere of an attacking team which, united, must advance towards the conquest of an objective by creating the right tactical synergies in order to defeat the opponent. Every single player will be indispensable during a game as a unique and specialized entity, and a lot of attention will also have to be spent in the ~planning~ phase of the clash in order to clearly define which ~professional~ roles will have to be assigned to the various team members. Aadditional doctor or a Sniper preferred to a Commando could make the difference during the game. All these choices and considerations will then have to be made also in the face of the type of map in which you will have to clash as different environments, obviously, will require a different type of guerrilla. War costs! A further tactical element of the game will be denoted by the possibility of gradually buying improved equipment. We will have to make the first purchase at the beginning of the battle, before getting into the action. The money available to us will be defined by a standard quantity and we will have to decide which types of weapons to put in the backpack (obviously limited in the choice based on the profession we have chosen). Once the battle has begun we will be able to collect the weapons abandoned on the ground by our opponents on the occasion of their departure; some of them, if compatible with our armament, will provide us with additional ammunition, while others will end up in the basket of objects that we will be able to sell to earn money and buy more lethal and precise equipment. The moment dedicated to ~shopping~ will be determined by the time in which we will be forced to stay out of the game after our elimination by an opponent. In fact, every time we die we will be ~expelled~ from the battlefield for a certain period of time, a period simulated by our transport on a variable means (helicopter, jeep, truck, ....) to the place of the fighting. During this ~dead period~ we will be able to access the purchase screen and therefore sell the objects we have collected and buy new ones. In this way, even the ~weapons collection~ tactics will have to be very well thought out within the team in order to avoid having players similar to tanks and others equipped with a bayonet... The big brother A great innovation present in Global Operation is that given by the presence of the figure of the ~Intelligence Officer~, i.e. a player who will not actively participate in the battle but, thanks to a camera system, will monitor the progress of the game by advising the men of his team the movements to be performed. Put simply, we will finally have implemented the figure of the ~coordinator~ in the game, which many Lan parties have been able to appreciate behind the backs of the various clans engaged in challenging each other to the last shot. Now this important entity will also be possible by playing via the Web with people scattered in the 4 corners of the world. The coordinator, in addition to being able to count on a camera mounted on the shoulder of each single unit of his group, will also be able to make use of a complex system of cameras present on the map ... but only on condition that a member of his team takes possession of it . To do this, simply direct your character near one of the control panels in the scenario located near the cameras and click on it, waiting for a variable amount of time represented by a progress bar. Once you have ~entered the system~ you will grant access to the hacked camera to your ~Intelligence Officer~ who will remain in possession of it until an adversary infiltrates the system in turn by ~stealing~ access to the resource. Report of the battle. Summing up this title we can certainly say that Global Operation is a fun and compelling product for all fans of team war simulation games, while it turns out to be disappointing in terms of single player. Currently the programmers of the product are releasing numerous patches aimed at solving some bugs and improving the gaming experience, so it is possible that the artificial intelligence of ~virtual~ companions and enemies will be improved, making even the solo game exciting. The graphics of the product are on good levels, with a note of merit towards the weapon models that can be used in very detailed and faithful reproduction of the originals and as regards the multiplayer game, good fluidity is appreciated even with machines that are not particularly powerful and standard internet connections. In conclusion, I can only advise you to download the demo of the game to launch yourself into a test battle in order to experience the thrill of a battle. Objective, win or die. Dark and hot The heat inside the vehicle was getting maddening.The smell of sweat mixed with that of the plastic of the bodices was starting to make me nauseous. We had been waiting for an order for four hours to be able to go into action... an action of the really big ones considering that there were six specialists on that damned van trained in different types of weapons. Rarely had I found myself in an anti-terrorist action with such a diverse group it scared me quite a bit; Who the hell were we supposed to be dealing with? The orders ~from above~ spoke of a cell phone carrying prisoners attacked and emptied of the dangerous load, about 7 cutthroats ready to do anything to get their behinds as far away as possible from the city. Light and silence The doors of the armored car open abruptly, 5 seconds and we are all in position. Front line assault men, medical officer ready to support and me lying near a dumpster intent on adjusting the sight of the sniper rifle... 15 seconds and here is the first fully armed ~cutthroat~. He sees us, takes out a grenade, removes the fuze... mistake... one single, sharp, hissing blow. The grenade never takes off. BUM. Noise and frenzy", "date": "2002-04-24", "grade": null}