{"name": "Herdy Gerdy", "ref": "https://multiplayer.it/recensioni/herdy-gerdy_a.html", "text": "How hard is the shepherd boy's life! Herdy Gerdy is a pleasant shepherd boy who lives on a magical island whose existence we ignore. One morning the poor fellow discovers that his father, the undisputed champion of the island in terms of cattle breeding has fallen under a spell that prevents him from waking up! Herdy immediately runs to the village to try to get information on how to wake up his father. Unfortunately, Herdy's dad is under a spell by the wicked Sardof, who concocted this plan in order to have no rivals in the annual island competition which awards the Magic Acorn to the best breeder. The mysterious powers of the Acorn appeal to Sardof who intends to use them to take full control of the island and subject the population to his will. It will be up to you, in the role of Herdy Gerdy, to try to stop the evil Sardof and prevent him from getting hold of the Acorn. Strolling around Neverland! In the game you will immediately take control of the friendly shepherd boy. In his shoes you will immediately be called to explore the first game area. On the left you can take a look at the map to always be aware of the direction you are following and where you are. During your adventure you will also be able to interact with many characters who will give you useful information for the continuation of the mission. One of the first things that will be required of you in the game will be to collect the various bells that you will find scattered in each level: if you find all 100 bells in each stage you will have a bell that you will take to the village from the cow breeder who in turn will unlock abilities that you couldn't use before. In the city you can also go and find the wise old man who will teach you how to train and bring the funny little animals that populate the island into the enclosure. There will be different animal species with which you will have to deal and it will certainly not be easy to train them all. The training game works a bit like in the movie Babe: brave piglet! If you haven't seen this nice film, don't worry: you should know that Herdy's aim is practically to bring all the little creatures into the enclosure within the set time. Logically, the less time it takes, the faster you will complete your mission. The movement control of little Herdy is entrusted to the analog keys of the pad and not to the arrow keys. All other operations such as jumping or activating dialogues are entrusted to the buttons on the right side of the pad. However, Herdy's movement control is not without flaws and many times you will find yourself making imprecise movements or taking unwanted directions, this also due to the angles of the camera which are sometimes dispersive and cause the player to lose consciousness of the place in which it is located. The view I preferred to use in the game was the one from above which allowed me to enjoy a global view of the setting I was exploring. However, it is not always possible to maintain this shooting angle of the location as in the points where the vegetation is thicker you will find yourself having to use the narrower view that puts you almost in first person. Being in totally 3D settings can make us lose our bearings and take us in directions and places we don't want to reach! The use of the map will be essential to overcome these problems deriving from the graphics. Music and tradition! The creation of the graphic sector is very interesting. The developers have in fact used a technique very similar to Cell-Shading even if the result is not too similar to what was seen in Jet Set Radio. The characters move in the settings made by a good and solid texture. The main characters are decently animated and the elements that randomly appear on the screen like birds, butterflies and fireflies enjoy good animations. The framing system offers different game views implemented through the use of the buttons positioned on the shoulder of the pad! However, the view most suited to your eye will not always be accessible and sometimes you will have to make movements with awkward views that will make you fall into error given the high risk of inaccuracy to which you will be subjected. Many times I have fallen into rivers for the sole fact of having a too subjective view that prevented me from seeing what was under my feet. Poor Herdy, how many unexpected baths have I subjected him to! The sound sector is noteworthy. The voices of the characters starting with that of Herdy enjoy a truthful tonality thanks to the excellent dubbing to which the game has been subjected. Even thesound effects have been made with care, but the thing that will strike you most about Herdy Gerdy is the music. They lend themselves well to what is the spirit of the game and underline above all in the first levels the serenity and tranquility that inspires this adventure that does not show zombies to be killed or big robots to be blown up. A more or less peaceful adventure to be enjoyed on the sofa at home. Defeat the evil Sardof! The guys at Core were certainly hoping to bring something new to the 3D genre with Herdy Gerdy, but the speed they put into developing the game made it possible to avoid the usual problems that afflict this category. The unclear view in some phases of the game consequently leads the player to error and this inaccuracy affects the fluidity of the gameplay. Although the overall graphics are decent, however, the only real sector free from significant defects is only the sound one in which you can appreciate the skill of the composers who have created engaging music that is at the same time relevant to the game. An adventure for young and old recommended to those who miss the gameplay of Ape Escape and want to come back in a 3D adventure game with somewhat unusual but appreciable features. Pros: Discreet plot Various submissions The gimmick of training the animals is very funny It is not the usual adventure Sound compartment well set The dialogues are completely spoken and subtitled in Italian and can be skipped Cons: Visual sometimes confused Inaccuracy of control Low framerate Herdy or Tarzan? When I saw Herdy Gerdy for the first time, I had the feeling of having already seen this nice character and in fact this resemblance can be found in the little Tarzan of the Disney animated film broadcast in cinemas some time ago. The eyes, the movements of the face, the way of moving: everything seems to make one think of a Disney film. In fact we are faced with a game whose graphics have been designed precisely by the talented Disney designers and the character of Herdy Gerdy as well as the landscapes of the game recall those settings that our eyes are used to seeing in animated films products from the house of Mickey Mouse! Although the developers have tried to introduce innovative elements into the game and to offer the best in terms of graphics and control, however these two components are full of the usual problems that afflict games made in 3D graphics.", "date": "2002-04-22", "grade": null}