{"name": "Dragon Ball Z Budokai Tenkaichi 2", "ref": "https://multiplayer.it/recensioni/dragon-ball-z-budokai-tenkaichi-2.html", "text": "After making three episodes of the Dragon Ball Z Budokai series, Bandai decided to take other ways to revive a license that has been guaranteeing commercial success for years, but which had been anchored to the patterns of fighting games for too long. And so Dragon Ball Z Budokai Tenkaichi was born, which bases its structure yes on fighting, but in a completely different way than our habits. The initial idea was to reproduce on the screen the spectacular actions that made the Dragon Ball Z anime exciting, therefore the ~charges~ of the characters, the high-speed movements, the long-distance energy shots and the ability to literally tear apart the theaters of battle. Z Evolution DBZ Budokai Tenkaichi, which is basically related to the previous Budokai only for the name and for most of the polygonal models, offers a different type of action from that of normal fighting games, we said. And it does so through a particular control system, relating to the screen, which allows the characters to move freely in a rather large area and to enter ~melee~ mode only when they get close to their opponent. That's when the classic rules of beat'em-up are back in force, in the form of combos and tricks. But the special moves? Those can be performed regardless of the distance that separates us from the enemy, with a lower probability of success when the blow becomes easily avoidable. In Budokai Tenkaichi 2 this feature has remained unchanged, but the developers have tried in various ways to make it more ~natural~ for the players and to improve, in general, a gameplay that is unfortunately woody and not very immediate. Without skimping, moreover, because the numbers of this new tie-in speak for themselves: more than one hundred characters, sixteen locations, many special moves, four distinct game modes and a surprising series of extras that will delight all fans of Dragon Ball. Every part of the Dragon Ball story has been dissected to be played. Dealing with giant enemies is a lot of hassle, you end up acting in patterns. Here's a fight from one of the DBZ movies resolved by Goku's Kaiohken attack. Game mode The classic ~story mode~ of this type of product in DBZ Budokai Tenkaichi 2 is called ~Adventure of the Dragon~ and sees the appearance of a new ~saga~ as you progress through the game. The innovation lies in the maniacal care with which everything has been set up: the developers have decided to show practically every fight seen not only in the animated series of Dragon Ball Z and GT, but also in all feature films, positioned moreover in a chronological way. This means that we will see the clash between Piccolo and Gohan in giant monkey version, as well as the desperate battle of Goku's father, Bardock, against the evil Freeza, or the birth and evolution of the Super Saiyans up to their last incarnation. In short, from this point of view we are faced with one of the most complete and multifaceted story modes ever seen in a game of the genre, certainly the best in many years of tie-ins dedicated to Akira Toriyama's masterpiece. The second mode that can be accessed is the ~Battle Z Supreme~, which is a progression of fights of an ever higher level, which in fact already begins uphill and aims to catalyze the attention of the most savvy players. The ~Dragon Tournament~, on the other hand, is nothing more than the classic combat tournament, which in this case is not limited to the legendary Tenkaichi Tournament but goes further depending on the percentage of unlocked secrets. And the ~Duel~ could not be missing, or rather an enhanced versus mode in this case, which allows us to also play matches with several characters at the same time, up to five against five. All the other options act as a corollary, namely the Supreme Training (to familiarize yourself with the control system - definitely recommended at the beginning), the Z Evolution (the customization of the wrestlers through the attribution of various upgrades), the Item Shop (to buy upgrades and items with the money earned in battles), the Data Center (to manage saved characters, even those from the first Budokai Tenkaichi) and finally the Dragon Library, repository for all unlocked extras and a point of reference for who loves Dragon Ball. The characters available are numerous and are also taken from the films. The representation of the special moves is always of great visual impact. There is no shortage of classic situations, in this case the fusion between Goku and Vegeta. Technical realization If Dragon Ball Z Budokai 3 had succeeded in rappreWith detailed and convincing characters, element-rich locations and an ultra-spectacular implementation of special moves, the first Budokai Tenkaichi could not compete in any sector. This sequel, however, regains the top thanks to a mix of artistic talent, ~direction~ and technical ability. The characters in Budokai Tenkaichi 2 may not be as detailed as those in Budokai 3, but they boast a progressive ~damage~ system that goes hand in hand with the level of energy available and effectively shows the consequences of each encounter. The transformation, a great unjustified absence in the first chapter of the series, is now back in an overbearing way, so we will be able to change the appearance and characteristics of some characters via key combinations, when possible. And the locations? Vast but not as much as one would expect from a game that relies on evasive maneuvers as a tactical element in fights, they contrast the general lack of elements with a surprising level of detail at times, with really clear and convincing textures (especially those relating to vegetation) and with a very high degree of interaction: your shots will have devastating consequences on mountains, buildings and so on. The real masterpiece, however, is represented by the spectacular nature of some special moves: Bardock's desperate assault, complete with a ~blur~ effect to give a sense of speed during the initial close-up, transmits anger and dynamism with a visual impact that few special moves have ever boasted: outstanding. In all of this, the sound sector tries, as usual, to play its part in the best possible way: setting the voices in Japanese instead of in English is an obligatory choice, the effects are good and the music abundant, without ever leaving its mark . Freedom of movement is sometimes a double-edged sword. If there's one thing the game doesn't miss, it's the lighting effects. To increase the distance with the opponent, charged shots are used, often decisive.", "date": "2006-12-15", "grade": "7.9"}