{"name": "Civilization 3 Versione ITA", "ref": "https://multiplayer.it/recensioni/civilization-3-versione-ita.html", "text": "The localization The first thing you will notice is obviously the isometric view and different 'panels' everywhere. Don't panic and let's start analyzing them. At the bottom left you will notice a classic map, for now almost completely obscured, given the small area we have explored (in practice, not even a meter). Still at the bottom, but on the right, we notice a window that shows us the data of the selected unit; in this case, by default, an explorer. At the top left edge of the window we find the key to end the turn, which you can always do anyway by pressing Enter or Space at the end of the movements of your units. If the last sentence seems convoluted, don't worry; you will adapt quickly even if you are not familiar with a turn based system. At the top left we will find 3 more buttons, which we will need, respectively, to activate the classic game menu, the Civilopedia and the Advisors screen. The Civilopedia is in fact the game's guide, but calling it just a guide is actually limiting. The localization In fact, there you can find everything you are looking for on game mechanics, civilizations, units, commands and anything else your sick mind can give birth to, all accompanied by explicit images. Not much to say really from the point of view of Localization ... to date I think I have not yet found even a typo, or an inaccurate translation. Everything is explained in perfect Italian (and believe me, a perfect translation is more unique than rare) and in a clear and simple way. So, passed with full marks. The adviser screen collects all the advice from your trusted vassals, who generally advise rather obvious things... The orange buttons, bottom centre, are just the de facto game control system. From there you can issue actions to citizens (which obviously will vary from unit to unit). After having founded our nice city we will automatically enter the management screen of the same, which can still be done every time by double-clicking on our city. Here we will have everything under control and I repeat everything we need for our decisions. We will be able to build structures or 'create' citizens, verify population and gold, and verify everything related to trade, food, production and culture..in short..your ~command center~. Everything is simple and well set up, and shouldn't take you too long to get used to. In the meantime, let's look around: it is full of small rivers, hills and in the distance the mountains and the sea. In the meantime, it will be better to explore the area a bit; we then send our worker up and down the hills while keeping a couple of warriors in defense of the city.. Very challenging It doesn't take long, and immediately the fun begins; we meet a gold deposit and build a mine. Meanwhile we are told that a work has been written on the greatest civilizations of the world, and we are in second place. Not bad for four huts and 3 citizens. Wandering around the area we find several encampments or various settlements; many will join our form of government (in this case, despotism), many we will instead have to fight them by simply ordering our war units to go to the square where the bad guys are stationed..simple isn't it? The basic game system is quite simple and very intuitive, without a doubt; same thing for the graphics, which do not shine for originality or particularity, but which serve their purpose very well. Meanwhile, another announcement tells us that we have distinguished ourselves particularly for Culture..yes, but what is meant by culture? Naturally, the excellent Civilopedia tells us this..in the meantime, while we are irrigating and deforesting, an emissary of Cleopatra appears, proposing that we exchange the knowledge of 2 skills..can we disappoint such a charming damsel? But of course not .. and so the pact goes through, and we say goodbye promising future business. Very challenging Unfortunately it's not so easy with everyone..and here we meet the Greeks, who are not so happy to see us. After rejecting their particular and unilateral proposal for peace, we begin to send contingents of archers and warriors to the 'front'. Not even the combat is known for its particular originality, but it keeps intact the charm it had in the 2 previous titles in the series. After a few victories, the Greeks take their revenge..and conquer the city from us, which we will reconquer only after considerable shifts (measurable in a few hundred years)... Well..I stop and look at my civilization...3 cities well initiated, trades with a couple dcivilizations, war with another, scientists in perpetual ferment, citizens who dedicate parties to me... I'd say that almost everything is going well, and I played for 4 hours almost without realizing it. That's right, you understood right away.. the involvement ensured by Civ3 is really very high, above all for the excellent artificial intelligence of the heads of the other civilizations. And what about localization? Here too we're doing very well, the dialogues are translated very happily and there is no risk of unleashing a war for a trivial miss understanding. Don't delude yourself, the difficulties will be many and will not take long to present themselves, making the game quite difficult even at the basic levels. This can only increase the longevity of the game, which if we consider the random generation of the terrain, the enormous number of civilizations, units, wonders and so on, can only make us consider Civilization as one of those games which, if it will take you, and I assure you that it will hardly do so, it will keep you busy for months, especially if you are crazy enough to try your hand at the higher difficulty levels. And now we're finally ready to answer the question we asked ourselves in the introductory hat: was it worth waiting for the Italian version? Our answer is a clear and strong yes, ready to do justice to a translation which, although not absolutely perfect (which is it?), is of the highest level, and reflects the long work behind it: for once, we enjoy the fact to be Italian. A game of Civilization 3 And here we are, finally, at the most important moment of our weekly coverage; the review itself, often focusing on what has been done to better locate this title. We will do it step by step, starting a game and dealing with all aspects. But first things first .. After starting a new game, the first thing we can choose is the morphology of the terrain. First of all, it will be possible to decide its size, in addition to the disposition of the lands with respect to the sea. For example, you can choose a structure similar to Pangea, or something closer to an archipelago. But that's not all .. we will also be given the opportunity to decide the climate, age and temperature of the world in which we will play. Once all this is decided, we can also establish the nature of the barbarians residing in our world, wandering rather than restless or sedentary. We will opt for random choices. Then you go to the character configuration screen, or rather the civilization. In fact, here we will have to choose which shoes we will step into, and the identity and number of our opponents. Here we will also have to set the difficulty (remember: don't overdo it at the beginning, it seems that Firaxis went hard) and the general game options. Everything seems well calibrated and offers various possibilities, which seem to guarantee enormous game longevity, at least from this point of view. Note the 3D models of the heads of each civilization, really well done. As soon as the Romans have been chosen, just to keep us in the banal, here we are catapulted into the game...", "date": "2002-04-11", "grade": null}