{"name": "Pro Rally 2002", "ref": "https://multiplayer.it/recensioni/pro-rally-2002.html", "text": "Once the short presentation film is over and the long wait for the loading is over, you can juggle the various options available or decide to start playing. If this is the choice, the possibilities initially offered are a time trial, in which you will compete alone trying to beat your records, then there is a sort of arcade championship and a driving school that prepares you to access the mode professional, very similar to the simulation mode of Colin Mc Rae Rally 2. Then there is a cup mode in which you will face opponents in special circuits (for example the parallel ones you see at the Bologna Motor Show). Deciding for the arcade mode you can choose the car to use from a shortlist of about 20 models (the brands involved are Seat, Peugeot, Mitsubishi, Toyota, Audi, Subaru and Citron), even if those initially available are: Peugeot 206, Seat Cordoba Sport, Seat Cordoba RACC and Toyota Celica. The choice of the geographical area is free (in the sense that there is no pre-established sequence): once the area has been chosen, the available circuits will be shown to you while others can be unlocked by winning races. By opting for the other mode, you will have to complete ten driving tests (some a bit difficult), after completing which you will be offered a contract by a professional team and from here you will access the actual championship. As already mentioned, it is structured in a very similar way to that of Colin Mc Rae Rally, that is, there will be races divided into three or four stages in which you will compete against the times of your opponents and in the end you will be awarded points based on the result obtained. Even the setup section of the vehicle resumes equal, equal to that of the Codemaster title, as well as the possibility of repairing damage, limited by a timer, at the end of each stage. If you manage to finish first at the end of the championship, you will be able to access the higher category (the categories are: private, kit car and wrc), if you are second in the standings you can try again with a new team, while finishing in the remaining positions you have to repeat all over again. But how is the game? Meanwhile, it must be said that there are many differences between the arcade version and the simulation one. In the simplest mode you will race against five other opponents and here the first flaw of the game should be highlighted: the opposing cars are almost all the same, for example three Cordobas and two 206s. Immediately after the start you will be able to detect the really high speed at which you moves your car: it's like playing Wipeout! In some situations it is even excessive: on asphalt tracks it is almost impossible not to constantly crash into the curbs! And, more unique than rare, played in two through the classic horizontal split scrren is even faster than in single. The worst thing, however, is the extreme ease with which you get to win. Just think that in some circuits it is even possible to finish first without ever pressing the brake button simply by crashing from one side of the track to the other. This compromises the good driving model which, although purely arcade, still allows a very satisfactory control of the vehicle. The simulation mode does not differ much from the arcade one as regards the control of the vehicle, but it is certainly more demanding and a little less fast. Furthermore, before each stage, it is necessary to carry out the ritual vehicle setup operations which significantly influence the control and performance of the vehicle. Too bad, and here the technical flaws begin to emerge, that the difference between the various types of terrain and climatic conditions is not felt much in terms of different driving approaches: simply on the wet or on the snow you slip a little moreover. And the negative sides continue by analyzing the graphics department more thoroughly. The cars, even if the developers declare three thousand polygons, are poorly modeled and flat when seen from behind (especially the two volumes like the Seat Ibiza) and, despite some goodies such as the view of the interiors and a discreet environmental mapping effect (which makes reflect the landscape on the bodies) applied to the bodies, I would say that the final result is below average. Even worse the tracks, really lacking in details. In this case the visual depth and the almost absence of aliasing are appreciated, but in the face of imperdonable as the bad amalgam between the various textures of the ground (you can see a striking difference between the road surface and the surrounding land), the little graphic difference between the various types of road surface (it always looks like the same texture with the colors changed if of snow or mud), the bare trackside buildings and the trees that look like a bad pixel collage up close, you just can't fly over. Another flaw is the damage to the cars which are implemented but not visible: the car gets dirty and loses performance and handling but does not get dented, taking away a lot from the simulation side of the game. Ultimately, from a graphic point of view it seems to me that I am dealing with a PSone game with a higher resolution and slightly more defined textures and this, on a console like PS2, just can't fit. The sound department suffers from almost non-existent music (it is simply a background to the game action) and from sound effects that could have been treated a little more, however it has the particularity of dubbing in Italian all the sentences spoken by the co-pilot (but the rest of the game is also fully voiced). What I have to say as a final comment is that it is a disappointment because the potential for a good game is there, but there is the feeling of a work released on the market without the necessary refinements (and perhaps this explains the price Bass). I believe that, at least from a playability point of view, a few more hours spent developing the game would have brought significant improvements (I am referring above all to the low challenge of the arcade mode and the different behavior of the car on different terrains which was almost absent). To those who just can't wait for the release of the new chapter of the rally simulator par excellence, I recommend trying it first and possibly deciding to purchase it. Pros: Attractive price Quite fun 48 circuits Cons: Graphics Extremely easy arcade mode Loads too long Little difference (both graphics and driving) between the different types of terrain Ubi Soft's decision to market a new game at a significantly lower price than the average is really to be appreciated. Now it will remain to be seen how the market will be able to welcome this promotion and, above all, if it will have subsequent developments. With this Pro Rally 2002 we are faced with yet another attempt to dethrone Colin Mc Rae from the throne of best Rally game.", "date": "2002-04-10", "grade": null}