{"name": "Grandia 2", "ref": "https://multiplayer.it/recensioni/grandia-2_a.html", "text": "Great, very great. Great!! Only after a few years, Europe had the pleasure of trying its hand at Grandia, in the Playstation version, a release unfortunately not at all optimized for the superior polygonal management capabilities of the Sony 32-bit and, even worse, arrived with the seventh chapter of the Hironobu Sakaguchi saga now in the hearts of role-playing game fanatics, among other things already ready for the (discreet, according to the writer) Final Fantasy 8. With the progressive aging of 32-bit consoles and the increasingly pressing demand for a sequel, Game Arts formalized as early as 1998 the development of a new episode of Grandia, this time for the Dreamcast. Grandia 2 was immediately acclaimed as an excellent role-playing game, thanks to an excellent character design, a partly innovative turn-based combat system, an enveloping storyline and an excellent audio-visual realization. More than two years after the first release for the 128 bit Sega (and waiting for the imminent conversion for Sony Playstation 2), Grandia 2 peeps out on personal computers in Europe thanks to Ubisoft who hopes to collect the same consensus obtained by Final Fantasy seven and eight on PC. Will she succeed? A great RPG The story of Grandia 2 is quite fascinating and will not fail to excite you and keep you in suspense from time to time; for this reason we will not reveal anything about it, except that your alter ego, Ryudo, is a geohound, a contemptuous mercenary who accepts the most difficult tasks in exchange for gradually increasing rewards and that his best friend is the falcon Skie , certainly the wisest of the duo, even if little by little kids looking for medallions, clerics divided between good and evil and big thugs who will mistake you for their enemies will join your perilous journey. At first glance, Grandia 2 looks like a Japanese role-playing game like the timeless classics signed by Squaresoft, but that's not the case: if the characters of Ryudo and Elena, for some nuances of their character, recall myths such as Cloud (Final Fantasy 7) and Tina/Terra (Final Fantasy 4/6), it is undeniable how the game system developed by the Game Arts guys goes even beyond that prepared by the rpg saga created by Hironobu Sakaguchi: while your party moves on the game map, the enemies are visible and when become entirely red, it means that they have seen you and that they are about to aim at you, worth a fight to face and, hopefully, (also) to win. Once the battle has begun, a bar at the bottom of the screen will indicate the attack turn of your heroes or enemies on duty, generating nothing short of spectacular clashes: it may happen that a member of your dying party is attacked by a flying enemy and in the meantime it is the turn of the warrior in question and one of his allies; the player can issue the order to attack the incoming enemy with the victim of the attack while the other member of your team heals him with a potion, unlike classic RPGs where the action is, time after time, in the hands of a single warrior or enemy. Great... it was the graphics. In 1999 Grandia 2 was a real cosmetic masterpiece: an excellent graphics engine that outputs constant thirty frames per second, a lot of special effects (and high-end magic made with mpg footage), a very close character design, at times, to that of the characters invented by Miyazaki and Studio Ghibli (Princess Mononoke, Nausicaa, Porco Rosso, Lupine first series, Conan the boy from the future, etc), placed Grandia 2 as one of the first real examples of intensive exploitation of the chip Dreamcast graphics (powered by Videologic, originally it was supposed to be 3dfx!). Surely you will wonder if the PC version of the Game Arts role-playing game has undergone a nice facelift to make it up to the graphic orgy of Final Fantasy 10 and 11 for Playstation 2 or Neverwinter Nights for machines with Windows inside; well, the game is identical to the Dreamcast version if it weren't for the presence of higher resolutions than the canonical 640x480 of the 128 bit Sega (but also Sony), pity that the machine required to run these resolutions must be a little bit powerful! Once the presentation has started (made first with a dubious fmv and then with the graphics engine of the actual game), one is amazed to see very evident clicks if a resolution of 1024x768 is used (a bit meno, but still noticeable at lower resolutions), although the game is identical to its 128-bit Sega counterpart, certainly not the state of the art of today's hardware power. Of the 3 machines used to test Grandia 2, the only one where Grandia 2 always ran smoothly at high resolutions is composed of Athlon xp 1800, 512 mb DDR and GeForce 3 Titanium 200 attached; on the same PC, but with a GeForce 2 Pro, the shots (a real slow motion in the intro) come back every now and then to be heard. On the trusty pc of whoever writes this review (P3 933, 256 mb of ram 133 mhz and GeForce 2 Gts), the vision of 3-4 frames per second in the repeatedly mentioned introduction raises fears for one of the worst graphic optimizations ever but luckily the rest of the game settles on more than acceptable fluidity values (about 60 frames for fights, scarce thirty in moments of pause and reconnaissance). The graphics of Grandia 2, although a bit old-fashioned compared to today's RPGs (Final Fantasy 10 above all) are not bad anyway, thanks to the wonderful characterization of the protagonists, the variety of enemies and the wonderful magic created through the use of movies. Music Maestro Rarely has a Japanese RPG of a certain mold failed to captivate our ears and fortunately Grandia 2 is no exception: the music, varied and all enjoyable, admirably adapts to what is happening on the screen: symphonies of death alternate with other more sparkling, shaking everything with cooler and more galvanizing sounds. The sound effects are very many and all very well guessed, we rarely remember such a convincing rendering of a collapsing suspension bridge or a handful of heroes running over swampy terrain to get to the nearby save point as soon as possible. The English dubbing (medium quality), is absolutely not comparable to the original Japanese one and to say it is a connoisseur of the Japanese version who would have much preferred the subtitles in the Albion language (if they really couldn't put Italian...) , fully preserving the original dubbing. Luckily all evils have no silver lining, given that Elena's wonderful original voice has remained in the now famous scene where she sings in the church, unbeknownst to her admired by the fearless Ryudo. Conclusions When a video game is a masterpiece, it remains so over the years. The biggest flaw of the game lies in the certainly dated and not at all optimized graphics, despite a graphics engine like this should have sparked (in theory) even on half a gigahertz machines, 128 mb and a video card at the levels of a GeForce 2 Mx . Japanese rpg aficionados cannot fail to try it, those who prefer the most classic rpg of the PC world (Baldur's Gate, Icewind Dale, etc) still give it a very careful look, followed by at least a couple of hours of play, very certainly more than enough to fully identify yourself in the shoes of the geohound Ryudo! An excellent rpg which, however, should have benefited from a more adequate adaptation to the high-sounding name it bears, a procedure which however apparently is decidedly snubbed (see the slavish conversions of Final Fantasy 7 and 8). Great, very great. Great!! Finally, after the preview published about a month ago, we have finished playing the review copy sent to us to review (or rather, play until you drop) the PC conversion of Grandia 2, an excellent RPG from the Japanese software house Game Arts ( creators of the wonderful saga of gdr Lunar, as well as that of shooter Silpheed). For those who have not read our preview, we remind you that the first Grandia saw the light initially on Sega Saturn (Japanese version, never in Europe due to the limited impact of the 32-bit Sega on gamers of the old continent), splitting into two ranks the fans of role-playing games: on the one hand there were the aficionados of the spot-on mix of highly refined character design (also on a psychological level) and the fascinating storyline of Final Fantasy 7 for Playstation (the bone of contention that pushed away, up to the present day , Squaresoft from Nintendo), on the other hand who was amazed by the excellent graphics and game structure of the Game Arts masterpiece.", "date": "2002-04-07", "grade": null}