{"name": "The Sims", "ref": "https://multiplayer.it/recensioni/the-sims.html", "text": "The game You can immediately immerse yourself in the gameplay thanks to a very simple tutorial that introduces us to the game very well. An automatic help system can always be left active. The game is already fully available in Italian and it hasn't even been translated badly! You can therefore choose whether to start playing with predefined families, or whether to build your own ~virtual~ family from scratch. We will be able to choose the members of the family up to a maximum of 8 (but already managing 2-3 members successfully is not easy at all!) and then choose the place where to build the house or choose an already built house to furnish. The creation of the virtual characters is done very well. There are various parameters that define his personality: Tidy, Outgoing, Active, Cheerful, Sympathetic and the zodiac sign. In addition of course to gender, skin color and age (adult or child). From what I've been able to play, the characters do not age and therefore a child will always remain a child and adults will not become grandparents. However, it is possible to create an elderly looking character with white hair. In fact, you can also choose the physical appearance among some models present, or choose to create a personalized one by downloading special programs from the internet such as Facelift (to create faces) and SimShow (to create skins). The beauty of The Sims is precisely the ability to download add-ons and free programs from the internet, such as cuckoo clocks or even create your own with the Blueprint program! Once you have created your own family, you will choose the area where you want to live. From this point of view The Sims is not very varied, the possible ~world~ is a screen with some more valuable areas and some less expensive ones. It is always the same and there is no random generator of ~worlds~ (even if it would be more correct to say ~neighborhood~ given the size!) something that would certainly have helped the game... So we will be able to choose how to build and furnish our alter's house - digital ego: there are so many choices, from the wallpaper to use to decorate the walls of the house to the plants to put in the garden. It is possible to personalize your home in thousands of different ways, and as if that were not enough, it is of course possible to make personalized objects (even if it is not very simple and requires some practice). Please The advantages of The Sims are many: I have never played a game in the Maxis series that had such depth and variety of gameplay. Sure the daily routine may seem boring (in fact the game simulates whole days of life), but there are a lot of factors that can change the course of the game (not to mention the fact that it is possible to speed up time). The Sims (virtual characters) seem really ~alive~ and will react according to their characteristics in different ways: an untidy Sim will never clean the house and will often leave litter and rubbish around. A very nice sim will have no problem making friends, and so on. There are so many possibilities and it is impossible to list them all: I will give you only a few significant examples of the care behind this title! For example, it is possible to die: once a character of mine drowned in the pool because I made him swim despite being exhausted. Other more or less accidental deaths are included in the game such as death by electrocution (if trying to fix TVs without adequate DIY value) and things like that. Another peculiar game situation: I had a couple of career women (homosexual unions are allowed in the game even if there is no marriage ritual for them) and I was asked if I wanted to adopt a child. Once he accepted, I realized that my two women didn't have the material time to look after him properly: after a short time one of the social services arrived and took him away from me forever! Of course it is possible to fall in love with other Sims, get engaged and get married. In this case we basically acquire a new character to control. However, being able to get two Sims to marry is not easy at all There is no shortage of work and there are various careers that can be undertaken, from the doctor to the thief. Naturally, one starts at the bottom, and to make a career it is necessary to develop characteristics relevant to the type of job. For example, if you choose a military career, initially the value of the Physique will be fundamental. For this purpose, a swim in the pool or a little home gym will help our sim to strengthen and continue. Later, once you are a general, you will need to increase your Charisma value and so onDefects Here we have to move on to subjective tastes. If objectively The Sims is one of the most original games of the last 5 years (at least), it has an excellent variety of situations and numerous statistics to draw on, subjectively it could have a more or less positive impact. If a game without an ultimate purpose doesn't make sense to you, then you won't like The Sims. If you hate tamagochi, even less. Honestly, never as in this case is the saying try it before choosing. Unfortunately there is no demo of the game available at the time of writing. Certainly there are some flaws, and they are usual for Maxis games: once you have seen everything there is to see, the game loses interest, however complex and varied the possible situations are! Another defect is the slow scrolling: on my PC at 800x600 (the minimum resolution provided by the game) it goes very slow and jerky, so I advise you not to buy it if you have a slower computer! Conclusions How do you judge a game that may excite some and disgust others? Well, it must be based on simple objective facts. Originality above all. If you are looking for such a game, this is the only one out there and also the best, and it will be for quite some time I think Variety: the daily grind is a bit boring, but when you have more money you can expand the house, buy new interesting items; you can interact with other characters looking for a soul mate, look for new, more stimulating jobs, and so on. Honestly there are very few real life factors not simulated in this game!! Longevity: it is the classic title that is replayed several times, even after a considerable distance of time. It may happen that after playing it for 6 hours a day for a week you get tired (after all, it is a bit like this for all games!). Then maybe in 2-3 weeks or 6 months it will be taken out to play a little game with it, perhaps inserting in the meantime other add-ons found on the internet or homemade My final vote, very high, rewards these factors. Obviously, if you don't like the game, there's nothing you can do. But I think that after so many games that are all the same, so many clones for once doing something new and different is a pleasure last aspect, but not to be ignored, the charm that a game like this can have on the female audience! This time Maxis offers us a totally innovative simulation, both in terms of concept and implementation but will it also be fun to play? Maxis has always accustomed us well, with simulations that covered various fields, from the simulation of the city (the very famous Sim City now up to the Sim City 3000 version), to that of ants (Sim Ant) and so on. However, this latest simulator differs from the previous ones, as it tries to simulate perhaps the most difficult thing of all: everyday life!", "date": "2002-03-29", "grade": null}