{"name": "Pirates: The Legend of Black Kat", "ref": "https://multiplayer.it/recensioni/pirates-the-legend-of-black-kat_a.html", "text": "Let's go! Set sail! Right from the main menu, you can see that everything is well cared for, in perfect pirate style, with very spot on sounds and options. The main mode is certainly the ~story~ one, but we are pleased to note the presence of an option called ~sea battle~. Having a minimum of knowledge of the British language you will surely have guessed what it is. It's basically the multiplayer mode. You can fight at sea against a friend or against the computer using your trusty ship and your fearless crew. After a fight to the death, the winner will be revealed. All this is quite fun and manages to make the title slightly longer lasting and also allows you to escape from the fun, if a little monotonous, story. Let us now move on to the latter which is certainly more accurate and important. After a short presentation video, we take control of a beautiful pirate girl who has nothing to envy to her colleagues of the stronger sex. Our protagonist will face thousands of dangers, at sea and on land, to try to solve some puzzles that have pervaded her mind after her father's unexpected death in battle. The adventure takes place on numerous islands that will become accessible little by little. On water and on land! As for the game structure, it must be said that it is divided into two main parts: one on the mainland and the other on the seas. These two structures are constantly spaced out a bit to break the monotony that often occurs in titles of the same genre. During the scenarios at sea, our main objective will be to sink enemy ships, conquer strongholds and continue on to other worlds. While on the mainland our objectives will be to go in search of keys and objects that will allow us to continue the adventure in some other archipelago. The controls of both modes are simple and will be illustrated several times as the adventure progresses. The game consists of wandering from one island to another in search of an object, or rather a map, which will allow us to explore another island. All interspersed with videos and some unexpected events. During the game it is possible to buy new weapons and even change ships several times thanks to some doubloons that will be obtained by eliminating enemies in battles carried out on land. Sometimes all this will be a bit monotonous but the continuous variation of the backgrounds and scenarios will allow you to keep alive the interest and the desire to progress in the adventure. The sunset seen in the bow! We are also favorably impressed by the really well done graphic aspect. Aquatic effects and explosions show us what the box we love so much is capable of and beyond. The textures are well done and quite varied the only main flaw is the lack of detail in the distance. In practice, the distant elements will appear thin and only by getting closer will they acquire better shape and color. A small flaw that however does not affect much during the adventure. The interlude videos are also well done, even if they are rare. Cannon fire left and right! Sheltered! Sore point with regard to the sound system. The effects are well done but the musical backgrounds that accompany the adventure are truly unlistenable. What is far more serious is the total lack of our language. The game is completely in English and unfortunately this is a bad habit that some software houses are still struggling to abandon. The defect is difficult to overlook, since there are no subtitles in the videos and not even the menus are translated and therefore those who do not speak much English will have serious problems understanding the unfolding of the plot. Drop anchor! To conclude I consider this Pirates: The Legend of Black Kat a good level title. We are certainly not dealing with a must, it will not have a famous name but it manages with the help of a couple of tricks to entertain and make us fully experience the emotions of leading a crew ready to do anything for the good of its captain! Pros: Well done graphics Great water effects Quite fun Cons: Sometimes monotonous Bad sound No translation at all On boarding!!! From an early age we all wished we were pirates; free in the ocean to rule the world fromthe bow of our ship. Unfortunately this is practically impossible and video games come to us to try to make us feel the same emotions. Let's analyze this title without forgetting that video games were born to make us experience in the virtual world what is difficult to do in the real world.", "date": "2002-03-20", "grade": null}