{"name": "Music Maker PlayStation 2", "ref": "https://multiplayer.it/recensioni/music-maker-playstation-2.html", "text": "Let's tune the instruments... Before analyzing the various aspects of the program in detail, here is a brief introduction to better understand what we will be able to do once we have this PS2 Music Maker. Music Maker is a loop sequencer. But what is a loop sequencer? Unlike MIDI music, where an external device (for example a keyboard) reproduces a sequence of sounds controlled by a Master device (for example a PC) translating the alphanumeric commands into notes and values, in the case of loop-sequencers the sound produced it doesn't depend on the device that reproduces them, but on the sound sample used in the tracks. This means that the same song will have ~embedded~ sounds, which therefore do not necessarily have to be reproduced from a dedicated device. This, in summary, is an explanation of what a sample sequencer does: it is a program that allows you to play a certain sample at a tempo X and that assigns values such as pitch (speed of reproduction of the sound, which modifies its pitch), volume, pan (left or right channel) and various effects such as echo, sustain, reverb. Sample sequencers generally have the ability to work on multiple channels (or tracks), thus managing multiple samples simultaneously. A channel will then be assigned to each sample you want to use, and the desired one ~pasted~ into the track editor. Once the work is finished, the mixed track obtained from the various channels can be treated as desired to obtain audio files, which are then used to ~play~ the complete piece. Music Maker PS2 offers these possibilities, but not only: in fact, once the music has been created, MMPS2 will also allow the creation of an attached video, using the same concept as the loop-sequencer in fact, it will be possible to paste ~pre-packaged~ video pieces ready for use to further enrich the created music. The joypad instead of the sheet music With the joypad it is possible to move in the various menus of the program, to select the samples to be used, set the mixer settings, edit the audio and video tracks and view the finished product. After the first half hour of effort to memorize what function the various joypad keys correspond to, you get used to using ALL the joypad keys thanks to the online help. Personally I would have much preferred the possibility of using a cursor, like all PC programs. At the top of each screen there are the various menus, in the central part the actual sequencer, while at the bottom the various objects that can be selected from time to time and dragged inside the sequencer window. Sharp, flat, natural, or rather: technical aspects But let's see some salient aspects of the Magix product in detail: Audio To judge a musical software like this, the quality of the loops included in the CD is a fundamental aspect. The samples present are more than 3000, and range between various musical genres: triphop, 2-step, techno, R&B, Hip-Hop and many others. This variety (think for example of being able to choose from at least 200 drum loops, that's not bad!) guarantees good versatility, with a respectable sound quality. The basses, for example, are full-bodied, the drum loops well paced and very varied, with a fair amount of variation for each ~theme~. Video The library of video clips from which we can draw to create the movie that will accompany our song is less varied than that of audio loops (presumably also due to the size of a video movie, which is far greater than that of a loop audio), but the video loops are still a sufficient number to allow you to edit a very varied and non-repetitive video clip. It will be possible to define two different levels (background and foreground) in which to alternate the selected clips, even overlapping them. (the presence of some damsel engaged in dancing movements is not at all unwelcome). The Sequencer Otherwise defined by some ~arrangers~, the sequencer is the heart of the software, and is the section where all the editing (audio and video) will be done. The screen space dedicated to this function has in my opinion not been optimized enough, making it sometimes difficult to have a visual overview of the whole piece (for example, there is no zoom function and there is no possibility to reduce the preview of the video below right). You will have 16 audio tracks and 2 video tracks available to be able to compose your own creations, which are much more than enough to guarantee a good polyphony. Effects The Audio Mixer will allow you to select a Master Effect to apply in selectable amounts to each trackdifferently. The Video effects available (not many to tell the truth) are made in a simple and quite intuitive way: you can transform the aspect of the movie by enlarging and rotating it, select the main and background colors, distort and create fade-ins and fade- out between several clips. Saves Note for regular memory card users: on an 8MB memory card (PS2 standard), you can store up to 60 songs (on average). Allegro con brio! In conclusion, I cannot fail to make a comparison between the Magix title and ~MTV Music Generator 2~ by Codemasters, released almost a year ago on the same platform and in fact the only direct competitor of Music Maker PS2. I will immediately say that the Magix software wins the duel with MTVMG2 as regards the variety and quality of the sound loops (a fundamental aspect, as already mentioned, for a software of this kind). From the point of view of user interface and video management, MMPS2 is much less intuitive and versatile than MTVMG2. Ultimately a good title intended for all budding DJs who own a PS2 and are not lucky enough to be able to spend a lot of hard-earned money on professional PC software. Pros: High quality sound loops... ... and they are more than 3000!! 16 audio and 2 video tracks are not a few ... Cons: User interface a bit awkward and cumbersome to use Menu and screen management that can be improved Music master! Nowadays, making music is certainly not a concept for the exclusive prerogative of a few: since computer support has forcefully entered all record production companies (including pre and post production) it has been possible to make use of sophisticated software for sampling sounds, modifying them, creating loops, pitching... everything more and more simply up to automatic drag & drop. Magix, for years on the PC market with amateur and professional software for creating music and videos, now expands the basket of buyers also expanding to the world of consoles and precisely to that of PS2 owners. Music software is a genre that still has practically no exponent on PS2, with the exception of MTV music generator, so let's see together if the new Magix product is able to outclass the Codemasters software released months ago on the same console.", "date": "2002-03-19", "grade": null}