{"name": "Free Running - Recensione", "ref": "https://multiplayer.it/recensioni/free-running-recensione.html", "text": "The techniques of Free Running! To start practicing Free Running virtually, the first thing to do is to choose your alter ego among the seven selectable characters: the choice must be made taking into consideration three fundamental parameters (sprint, agility and energy), whose level is unique for each character. The next step is to learn the mechanics of the game, and this will be possible in the gym, where the number one free runner (obviously we're talking about Foucan) will teach us all the tricks of the trade. From the first lessons of the tutorial we will realize that the control system is not the simplest and most immediate, and we will need a lot of practice to make the most of each type of evolution. The fundamental keys to use are the square with which you sprint, the triangle and the circle in combination with L1 and R1, with which you perform the tricks, and finally the X which is used for landings or as an aid to some tricks. The evolutions are essentially a series of jumps, somersaults and spectacular movements of all kinds which are divided into two types: those on the ground (triangle) and those in jump (circle). Each of these tricks is triggered whenever a combination of the L1 and R1 keys is pressed: for example, if we want to perform a Butterfly Kick, we will have to press L1, R1 and triangle in rapid sequence, and before landing, press the X to avoid falling. In addition to these free body evolutions, it is possible to take advantage of the environment to climb walls, climb poles, spin on the bars, walk on walls, climb between two nearby walls, and many other things, one more spectacular than the other. The control system requires a certain amount of practice to be exploited to the fullest, we will have to remember the key combination of all 50 tricks in the game, we will have to learn how to use the X at the right time in different situations, and we will need to make and precise all the movementsin short, it will take a lot to reach a good level, but once you reach it, fun is guaranteed. Ax Kick! Flick Flack! Double Legs! After having learned well how to ~survive~ in this sport, various challenges await us in the most unthinkable places (including mills, a port, a shipyard and even abandoned ships), structured in such a way as to allow us to make the most of every type of tricks. Each of these settings offers us different types of game, such as freestyle which allows us to freely test our skills, or to activate mini-challenges in which we need to score a certain number of points using the evolutions, or collect red objects in the most unthinkable points. There are many other modes to select, each with its own goal, for example in the time challenge we have to complete a certain path in a limited time, in the flow challenge we have to create a chain of evolutions to always keep the flow bar at maximum and win the challenge, in the pursuit mode instead we have to follow a very good opponent without losing sight of him, while in the ground zero challenge we have to follow a path without ever touching the ground. There is also a multiplayer mode that will allow us to challenge our friends. Having so many challenges to complete it will be very difficult to get bored, also if we consider the spectacular nature of some of the settings and the possibility of unlocking costumes, tricks and movies, we can say that we are facing a title that will not fail to amuse us. Graphics and sound: more could have been done! We can say that the structure of the circuits is very well studied and complex, and this is a fundamental aspect for the success of games of this type. Unfortunately, however, from a purely technical point of view, Free Running fails to satisfy 100%, showing what are its greatest weaknesses: graphics and sound. The graphics are a bit ~dirty~ due to textures that are not very defined and have dull and washed out colors. The detail of the environments and of our alter ego is rather scarce, in fact the programmers did not make an effort to use a few more polygons to make the circuits and characters more beautiful and realistic. We could have aspired to a much better result than the one achieved, but all in all we can't complain, and the slightly above average graphic quality does not hinder the possibility of having fun anyway. The soundtrack accompanies our evolutions with rhythms that are a mix of pop, electronica and hiphop. If we wanted to go and examine the qualitative level of the compositions, it could very well be asserted that we are dealing with uninspired and banal pieces, which hardly manage to involve the player more than necessary. Asoundtrack created in a more accurate way would certainly have benefited an adrenaline-pumping action title like this ... instead we have to settle for an accompaniment that leaves us indifferent. Comment The idea of converting such a particular and fun sport into a video game was undoubtedly welcome, but the idea itself is not enough, in fact it is the quality of the realization that interests us most. As already explained, Free Running reproduces the spectacular soul of this sport in a very faithful way, thanks to the presence of many tricks and various playgrounds that allow you to make the most of the athleticism of our virtual alter ego. However, the gameplay has the defect of having controls that are a little difficult to learn, since the way to perform some tricks is not the most intuitive and requires a little practice and good use of memory. Instead, much more could have been done with regard to the quality of the sound and graphics sector, which is slightly above the sufficiency. Free Running, while not free from defects, is all in all a title to be taken into strong consideration by all those who already love this sport, but also by those who would like to get to know it. Pros Spectacular and fun Good level gameplay High number of challenges Cons Technical aspect that can be improved Difficult control system The gaming world has always tried to re-propose every existing type of sport in the best possible way, to give us the opportunity to practice our favorite discipline even while sitting comfortably on the sofa. It is therefore quite common to find soccer, basketball, American football, skateboarding, and many other games on store shelves... and now, in addition to these ~old glories~, we will find a title that simulates a sport that is decidedly little known and outside from the common: free running, created by Sebastien Foucan, and evolution of the already existing parkour. Parkour is essentially an obstacle course that takes place in an urban environment, and the goal is to reach a certain goal in the shortest possible time, easily overcoming anything that could get in the way of the race. This sport is as spectacular as it is dangerous, as the obstacles can be extremely difficult to overcome, especially if you have to jump off a very high wall or jump from one roof of a house to another! Free running differs from parkour exclusively in that the goal is no longer to reach the finish line in the shortest possible time, but rather to complete the route in the most stylish way possible, through the use of spectacular athletic evolutions. Probably some of you will never have had the opportunity to witness the performance of these athletes, while others will have been able to admire Foucan's evolutions in the recent 007 film, Casino Royale, but the fact remains that now you have the opportunity to try your hand virtually in this exciting and dangerous sport through your beloved Playstation.", "date": "2007-03-20", "grade": null}