{"name": "Max Payne", "ref": "https://multiplayer.it/recensioni/max-payne-4.html", "text": "With me or against me! The gameplay is certainly one of the many strengths of Max payne, and thanks to it our revenge will be even easier and more fun. To practice the game and not immediately go into battle against enemies who would kill us without too many problems, we have at our disposal a comfortable training where the fundamental keys will be explained to us, and where we will be able to train ourselves to treat the killers of our family as bowling pins. In addition there will be different game difficulties, which will only be accessible by finishing the title, in which we will have a multitude of weapons available that will vary from the most common beretta to a grenade launcher rifle, useful for taking out enemies en masse. Proceeding with our revenge we will meet many fearsome and fully armed opponents who will not hesitate to shoot us as soon as they notice our presence. When their attack is successful we will be able to notice it in many different ways (splashes of blood and various things) but the most comfortable will be to look at the image of our max on the lower part of the screen, which as soon as we are hit will gradually turn red, until it fills up completely, the only way to regain life (as well as after the end of each level) will be to use the comfortable vials that we will find during the levels, which will give us back about a quarter of our total energy. In max payne there will be scenes in which we should face a multitude of enemies armed with uzzi and shotguns, but thanks to the convenient mode called ~bullet time~ (it will allow you to do matrix-style actions) we will be able to slow down the flow of the action , thus allowing us to perform miraculous dives in such a way as to dodge enemy bullets and to counterattack while we are in flight. In order not to make everything too easy, however, we will not be able to use the bullet time mode indefinitely, but we will be allowed to use it only until the appropriate bar is consumed, but don't worry this will automatically recharge over time. Strategy and action go hand in hand... This is another strong point of this title, in fact it has very detailed graphics down to the smallest details. Max Payne's face is that of his programmer, who chose to use his face for the character, Max will change his expression during the game and his clothes are made with great care. The settings are very vast and characterized by total interactivity with the character, in fact, shooting against a wall will not only leave the marks of the bullets, but in some cases the wall itself will crumble (it is very impressive especially when in bullet time mode and one hits the wall and the opponent in succession, seeing shards of wall and blood crumble in front of the camera), as well as some glass, furthermore when we enter the bullet time mode, we will see the movement of air caused by the bullets, and the blood coming out of the bodies of the our victims Movies (if you can call them that) are perhaps the most disappointing thing about Max Payne, in fact they are made in comics, with cartoons and speech bubbles (look at the picture for ideas). Hello...it's Payne...Max Payne... Even if the audio aspect is not its spearhead, Max Payne guarantees the player a pleasant and detailed sound down to the smallest detail, in some cases we will be able to surprise our opponents from behind and hear them talking on the phone, or to each other about things more or less important Each weapon also has a different sound However, there are two levels in which Max dreams and finds himself in his home when his family was killed, in these levels the crying of the little girl was chosen as background music it echoes throughout the level, making the player jump on his nerves (I was about to leave the level after 5 minutes of hearing that unbearable verse). ...I'm waiting for you all on XBox... This game cannot be missing in the homes of all those who will buy an XBox, and the only excuse for not buying it would be to already have a copy on PC or some other platform, after trying it, however, I can tell you that this game offers captivating and intriguing, and that the bullet time mode gives this game a boost, igniting a spark of madness when you play (it's too good to throw yourself in bullet time among enemies and see them try to hit you without success .... ..) Pros: An intriguing and engaging storyline Stunning graphics A good variety of weapons Bulet time Cons: Cartoon movies are fun but not very exciting Dream levels are unnerving Materials:Tips Let's make some history! Before starting to talk about the gameplay, it seemed only right to mention at least in part the story behind Max Payne. The game begins with Max, on top of a building who rejoices after his victory, the game then retraces a huge flashback in which our digital character, or the great Max, a policeman whose wife and daughter have been killed, finds himself entangled in a game of power and corruption that will be difficult to escape from, the only hope he has of avenging his family and bringing his life back home will be to put on his black leather jacket and arm himself with his trusty beretta. All this will be given to us on xbox by Remedy Software.", "date": "2002-03-13", "grade": null}