{"name": "Blood Wake", "ref": "https://multiplayer.it/recensioni/blood-wake_a.html", "text": "You will fight for the Shadow Clan! The game allows us to take on the role of a fighter from the Shadow Clan faction, fighting with the other two powers, the Iriyan Nation and the Iron Empire for the division of the world and the supremacy of the seas. In the beginning we will only be able to pilot small and modest battle boats but as we progress through the 25 levels we will have the possibility of commanding increasingly advanced vehicles equipped with the most innovative war instruments. Each vehicle will have its own characteristics such as speed, armor and armament for a total of 12 boats. We will face numerous missions that will lead us to fully discover the plot of the game up to the real ending. Uninvolving gameplay... One of the flaws of this title that I think is most important to underline is precisely the gameplay, let's see why right away. Blood Wake is a purely arcade game from all points of view, i.e. without implications typical of simulators or RPGs, and the ~standard~ of this category should promise a high and refined level of gameplay, so that it is enough to start the game and fun is guaranteed; unfortunately this does not happen in Blood Wake, which has a bad control system from some points of view. However, this flaw is largely rewarded with a very frenetic and also fun pace of play. Returning to the game during our adventures across the seas we will be able to ~embark~ (double meaning) in missions of different types, from the classic destroy the targets to the escort of friendly ships, which, however, become repetitive after a few hours of play. But I only see the sea... From a graphic point of view Blood Wake has been developed really well: the sea, which is one of the fundamental elements of the game, is rendered almost perfectly, with a graphics engine created specifically for the waves and ripples formed by our passage. Furthermore, the color will vary depending on the time of day: for example, if the mission is set in the morning, the water will be a crystalline blue, while at night it will be deep blue. But there is also another rather disappointing aspect: the backgrounds. The latter are made up of quite poor textures, and sometimes they look flat, and most of them are covered by a light mist that hides the furthest parts, a bit like it happened in the first Silent Hill for PlayStation where the developers due to the console's limited graphic capabilities had designed the mist system to display less things on the screen, avoid game slowdowns and at the same time create a creepy atmosphere of the console are undisputed). Also noteworthy are the boats, very well made with a high number of high-quality polygons: not to be missed are the collisions between several boats that create spectacular scenes on the water. A lackluster soundtrack! The sound of this title is neither fantastic nor poor, let's say it is average, so no great artist has created it (as in the case of JSRF): the audio sector is mainly composed of oriental ~songs~ that do not give many emotions , but the arcade mold of the title takes care of this. A praise certainly goes to the speech, dubbed really well. There's nothing left to say about the sound except effects like explosions and the like that gave me an overall positive impression. Comments and conclusions! We have arrived at the coveted moment in which I have to express my opinion on whether or not to buy Blood Wake. The game presents itself as a very impressive title at first glance, but playing it a bit, one immediately realizes that it is not a product without flaws. In fact, the implementation of the control system subtracts several points from the final evaluation, which all in all is of a good standard. Fun for arcade enthusiasts is guaranteed, especially in split-screen mode, where up to four players can play at the same time, something to try at all costs. However, the initial Line-Up of XBox is really wide and presents certainly better titles in some aspects than Blood Wake (such as Halo, DOA3, PGR), so if you are undecided about buying I suggest you try it, or the demo, or in a an XBox Demo Station. Pros: Set in a magnificent world of water Style innovation Excellent realization of the sea Cons: Control system not immediate The audio sector could be better In some places repetitive Materials: Tips Let's get ready to set sail! With the advent of next generation consoles, softwareand house, have entered increasingly sophisticated and innovative types and models of games. This is the case of Stormfront Studios, already known for titles such as Pool of Radiance for PC inspired by the world of Dungeons & Dragons and for Legend of Alon D'ar, another RPG set in a fantasy world. This software house presents us with a very particular and captivating game: Blood Wake, its first game exclusively for XBox. This title allows us to pilot motorboats armed like war machines in a world almost entirely covered by the waters of the oceans (remember the film Waterworld?).", "date": "2002-03-13", "grade": null}