{"name": "NHL 2002", "ref": "https://multiplayer.it/recensioni/nhl-2002_b.html", "text": "A sport little known in Italy but extremely fun! A self-respecting hockey game must above all respect two fundamental characteristics of the game: fluidity of movement and speed of the puck on the ice. In this case, the developers managed to reproduce these two characteristics in NHL 2002. Despite the possibility of operating various types of settings and choosing different levels of difficulty, the fluidity of the action has never been so constant in a hockey game. Player animation is proportionate to the speed of the game. In addition, players have their own characteristics and abilities that reflect the real ones. The strongest players in the league will show their ability to cut the defense in two and score incredible goals to the poor unfortunate goalkeepers. The technology used to reproduce the movements of the players is the motion capture of which EA has used to create the animations of the players of the titles of its sports series. The benchmark for making player movements that the developers have stuck to is that of the game in real life. The movements faithfully reflect real physics as well as the directions the puck takes as it slides on the ice. You also have to be careful not to make sudden movements or you risk falling on the ice like apples from a tree. The main mode is definitely the season mode which includes all the stats and rosters you can hire for the upcoming season. Teams can make changes throughout the season. Furthermore, if you want to enjoy an international challenge, you can choose to play with one of the national teams included. Each team is logically set up according to its real abilities, so that if you play against Canada, gold medalist at the 2002 Winter Olympics in Salt Lake City, you can test their valid qualities in fast passing and enveloping game. Exaggerated graphics! NFL 2002 boasts nothing short of outstanding graphics. The ice that cuts under the iron of the skates, the animation of the crowd and the shiny track on which the action takes place perfectly reflect the players and the lighting effects as if you were watching a real match on TV. The replays are truly spectacular and capture the highlights of the action from multiple camera angles. The animation is so detailed and precise that you can clearly see even the slightest movements. Goalkeepers are equipped with large gloves and a bat which they use skillfully to avoid you scoring a goal into their net. Thanks to the fact that the arenas where hockey is played are quite small compared to those where other sports take place, it was possible for the developers to compose the first rows with spectators entirely recreated with polygons and you can see them wearing strange hair and shirts of teams and cheer on the two teams as they battle it out on the ice. A game for everyone! EA created NHL 2002 with the intention of bringing a simple and fun product to consumers' homes that is suitable for all age groups. Good graphics, effective control and simple hockey rules allow the player to immediately get into the spirit of the game and experience the thrill of a real hockey match thanks to the smooth movement of the action. A game whose purchase is obligatory for fans of sports with stars and stripes and recommended for those who are tired of playing the usual football games and want to try something fast, practical and fun. Pros: All the teams from the 2002 NHL and NHLPA seasons Fast and fluid action Simple and precise control Detailed graphics Cons: If you have played other games in the series you will certainly not get excited about this new chapter The developers had the time to introduce some notable innovations in the game and gameplay that unfortunately have been missing Here comes the stars and stripes hockey! Whenever we talk about games from the EA Sports series we expect a game with the same title where only the vintage changes as if we were talking about a wine. The various NHL '96,'97,'98....until 2002. Once again the premises of the house of FIFA are to present a good title which by presenting a traditional basic concept tries to ensure a good share of the market with some innovation in the gameplay and in the graphics sector. However, the strength of each EA and NHL 2002 game lies in the official license signed with the NHL and the NHLPA which allows it to use the 30 NHL teams and 20 international teams. With a commentary in the American version entrusted to the new announcer Don Taylor and the technical commentary in parole of the popular Jim Hughson and with six game modes, Play Now, Season, Career, Playoff, Shootout and Tournament, it is difficult for this game to go unnoticed before the eyes of fans of spectacular American sports and in Italy there are many, me too.", "date": "2002-03-13", "grade": null}