{"name": "Dark Summit", "ref": "https://multiplayer.it/recensioni/dark-summit_a.html", "text": "A Mysterious Story Unlike classic sports titles composed only of normal tones and various races, Dark Summit presents a real background story, full of intrigues and twists, and this is only the first surprise that this interesting title has in store for us. It all begins at the foot of Mount Garrick, where the ranger who supervises the lifts decides to prevent the ascent, chasing away tourists and snowboarders, including a group of boys, ~commanded~ by the beautiful Ty. So they decide to find out what is hidden among the peaks of Mount Garrick, suspicious of the presence of strange helicopters, perhaps an ~obscure summit~ will be held; it's up to you to find out, I don't want to spoil this little surprise for you. However, the boys try everything to find out, and with their trusty snowboards at their feet, they enter the forbidden area, and here the trouble begins. In fact, strange individuals will do everything to stop them, by any means, and be careful, because game over in this game means death. Gameplay From the story you will have understood that it is a purely arcade title, in fact it is, there will be amazing stunts to avoid the frequent dangers on your uneventful journey, jumps to avoid falling into deep abysses. All this makes Dark Summit very frenetic and hectic, which are synonymous with fun, and this can not be missing in an arcade title. The control system is simple and intuitive, specially designed to increase playability. During the missions (because the adventure will be structured in levels) we will have the possibility to change our snowboards and also the equipment, a possibility given to improve performance and to perform more complex and scenographic tricks. The title in question won't upset the snowboard genre, because it has many features, we're talking about tricks, very similar to games already released, but this was not the goal of Dark Summit, which presents a very innovative and convincing mission mode. Graphics From a graphic point of view, Dark Summit does not represent the perfection embodied in video games and in fact presents a series of defects, let's see which ones. The animations of the characters and tricks are not very convincing, while the very well reproduced mountain environment must be praised, of course the possibility of taking shortcuts affects, which make the tracks seem not closed, therefore free for exploration. The special effects are also excellent, such as sparks, snow that rises with the passage of the snowboards, and the massive avalanches that we will have to avoid. However, sometimes there are small slowdowns, which while not affecting the gameplay, are annoying. sound Dark Summit presents a quite apt soundtrack for this genre of game, all in all pleasant to listen to, and which combines well with the sustained rhythm to which we will have to get used to to continue in the missions. Furthermore, the more difficult and decisive the situation will be, the more the music will be insistent and pressing, ready to give us the energy to overcome them. Particularly well done is the aspect of speech, very real, which guarantees total immersion. Conclusions If you're looking for a snowboard title that's a little out of the ordinary, then Dark Summit is for you. While showing an aspect in terms of good quality tricks, this title in my opinion cannot compete with a certain game called Amped (present in the Line-Up), however this ~lack~ is largely repaid by the original structure and innovative storyline, which I repeat is very intriguing and full of twists, and the presence of missions with different objectives. An undoubtedly positive factor is certainly the possibility of playing multiplayer in two, even if it could certainly have been done better. Finally I can say that this Dark Summit is an ~average~ product, with some negative aspects, but many other positives, it all depends on whether you prefer a classic snowboard title, Amped, or an original and innovative one, precisely, Dark Summit . Pros: Originality and innovation Excellent creation environment Interaction with the environment Cons: Animations Some special effects Small slowdowns Snowboarding on XBox Numerous sports titles are being planned for XBox, many of which are set in the mountains, therefore winter, such as snowboarding. In fact, two titles have been developed for this genre which are both present in the Line-Up of March 14th for the release of XBox: Amped, a kind of simulation, and Dark Summit; I will deal with the latter in the following review, but I start by saying that this is a very different title from Amped in many points of view, even unexpected for a snowboarding game. Dark Summit was developed by Radical Entertainment, already known for titles such as Independence Day and Jackie Chan's Stuntmaster, and is published by THQ.", "date": "2002-03-13", "grade": null}