{"name": "TransWorld Surf", "ref": "https://multiplayer.it/recensioni/transworld-surf-4.html", "text": "Between waves and jumps During the game we will be able to perform many stunts with our surfboards, such as riding immense waves, or jumping them with a phenomenal leap, each of these things will guarantee us points, which will affect the final outcome of the competitions, moreover during the game we will also have different objectives from these, in fact we may happen to meet dolphins trapped in the nets of tuna fishermen, and we will have to help them free themselves. we will have 13 surfers available, usable in 9 locations, with whom we will have to conclude a series of objectives, comparing ourselves with 3 other surfers, before being able to continue our adventure. Fortunately, the controls are also well done and once you get the hang of it you will no longer have problems performing all the available stunts. During the course of the game there will also be the possibility that a shark decides to have breakfast with your surfboard.... . The graphics and sound This is one of the points that differentiate transworld surf from the other titles taken from this sport, in fact the graphics are treated in detail, the sea water is very well done, and the foam effect caused by the waves gives a touch of reality in more in this respect, moreover the waves are very well made and the movements of the surfers when they perform their stunts leave you speechless, both for their spectacularity and for the splendid vision that you will have with the movement of the camera, in fact even the sky is made Very good. Furthermore, when our board will slide on the surface of the sea, the water will move to make the action even more real, and if we make a sharp turn, it will rise as in reality. after having ascertained that from a graphic point of view the game has no defects, we can say that the audio is no different, in fact even the musical effects are well done, not to mention the environmental ones, with attention to the smallest details. In addition there will also be 8 different soundtracks, for all musical tastes Conclusions This title is certainly the best of its kind, but comparing it to other titles of a different genre for xbox, I don't know how much it can hold the comparison in terms of commitment and longevity, I personally prefer an adventure/action genre, but this doesn't mean that for all those who love this style of game Trunsworld surf is certainly the best choice they can make Pros: Very nice sound Spectacular stunts Decent graphics Pros: Not suitable for those who don't like the sea Unfortunately this title does not add anything new to the genre As long as the surfer goes.... ... Let it go, after having changed the words of the famous song by Orietta Berti, let's start by saying that in addition to this title we will also be able to find other games that will bear the TransWorld acronym, or transworld snowboarding and transword skateboarding, all distributed by infogrames , but produced by different houses, however we hope that these titles will also be developed in a very similar way to transworld surf, in fact this game is complete in its genre......", "date": "2002-03-13", "grade": null}