{"name": "Oddworld: Munch's Oddysee", "ref": "https://multiplayer.it/recensioni/oddworld-munchs-oddysee_a.html", "text": "Your enemies: the Glukkons! In the game you will take on the role of a slave dissatisfied with the life he leads and eager to lead his people, the Mudokons, to free themselves from the evil corporation that enslaves them and which belongs to the name of the Glukkons. Abe's character has been retouched and now possesses many innovative abilities. Munch, on the other hand, has been implanted with an acoustic device by Vykkers that allows him to capture more creatures. With the help of Fuzzles, a creature with big teeth, Munch manages to escape and meets Abe. The two agree to find a strategy that can stop the Glukkons. If you've played the other games in the series, Abe's control should feel immediately familiar: with most of the buttons you can initiate and manage dialogues, while with another general button you can perform movements such as jumping or throwing characters. Munch's control is very similar, although he uses the special power to control mechanical objects and its use is limited in particular specific levels. Once you enter Oddworld, the game will feel more like a puzzle than an exploration. The major difference from the past is that you can now command your Mudokons and Fuzzles to attack, using your warrior troops to traverse specific points in the game. In the creation of the backdrops, the designers opted for a less extensive development of the game in favor of locations created in 3D. While in the first few episodes you ran with Abe through huge locations now you will walk in levels unusually limited in extent where you can see both the entrance and the exit. Each level of the game is extremely small and it will take you a while to complete it. Among the various tests that will be required in the various levels, you will have to free the Mudokons or carry objects from one level to access another. The gameplay is innovative by inserting new puzzles and new game techniques such as throwing bombs using a forge or making Munch and Abe cooperate to overcome certain obstacles, but this structure is more suited to a puzzle game than a real one platform. Part of the game's problems are also to be found in the control scheme which in trying to make it easier than that of the previous episodes only made it more frustrating in the end. The movement of the jump is quite eccentric and it will take longer than necessary even to perform a simple jump into a box. The beauties of Oddworld! The level of graphic detail in Oddworld is truly incredible. Locations, structures and characters have a sharp look with a density of light that makes the screen image very realistic. The clouds let the light filter through creating an incredible visual effect especially when the rays are reflected on the water and the shadows of the characters move on the surface following their counterparts. Unfortunately not all of the levels take place outdoors and you will therefore have to put up with less gratifying and dark graphics inside the factories, while enjoying the brightness and beauty of Oddworld's nature on the hillsides. Therefore, depending on the levels that you will explore, you will be able to appreciate or not the locations that you will have to explore. The viewing angles are well done even if as the game progresses you will realize that you could have done much better than ever before. Munch is graphically well done in every detail and has the same physical features seen in the previous chapters. His movements have been faithfully reproduced and compared to previous episodes are sharper and smoother on the screen. As far as the sound is concerned, the voices of the characters are incredible and reflect the brutal humor of the game with funny jokes. Furthermore, the game is all in Italian and it will not be difficult for you to follow the dialogues. Free all Mukodon! Oddworld: Munch's Oddysee is an original platformer with many elements that recall the genre of puzzle games. Its structure and scheme as well as the scenes that characterize the plot make it a title suitable for all ages of gamers. The little ones will appreciate the beautiful animated drawings that the game offers while the more expert players will be relentless in completing the various levels that make up the title. Oddworld: Munch's Oddysee is an excellent title that shows, even if not completely, the power of XBox especially in terms of graphics. An obligatory choice for those who want to experience a fun and eventful adventure completely in Italian on XBox without too many pretensions. Pros: Fans of the han serieshave waited so long for this title and now they can finally get their little hands on it The game is decently fun Some innovations are spot on Gorgeous lighting effects and really well done landscapes Cons: Control leaves a bit to be desired You will find some levels frustrating to take to term Difficulty in executing some basic movements perfectly A saga that began on PlayStation The character of Abe appeared for the first time a few years ago for PlayStation and had immediately become a mascot of the small gray box of Sony along with other characters from other titles such as Spyro, another defector who has now landed on GBA. Oddworld: Munch's Oddysee was initially developed for the PS2. Later Microsoft bought the rights and the little Mudokon was transferred to XBox. Oddworld: Munch's Oddysee attempts to bring the more adult range of gamers closer to the platform genre with a very articulated story and gameplay despite the graphics suggesting a game for younger players. Imagine the scene where you operate the giant fan that sucks and shreds one of your enemies or when you throw another from the top of a tower and see it literally burst like a water balloon when it hits the ground. But the question that all of you are wondering right now is: ~But does the final result of this game landed on Xbox meet the expectations of consumers? Unfortunately the most serious flaw is a fundamental element of the game or the gameplay.", "date": "2002-03-13", "grade": null}