{"name": "Project Gotham Racing-PAL-", "ref": "https://multiplayer.it/recensioni/project-gotham-racing-pal-.html", "text": "Drive with ~style~ We had already said that Project Gotham is an arcade game but this shouldn't make you think of the usual Ridge Racer clone. With the well-known Namco racing there is no shortage of connection points although these represent only a starting point to offer us a substantially different gaming experience. In Project Gotham it is in fact important to reach the finish line before the others but it is even more important to drive with ~style~. In fact, we will have to face a series of competitions that will test not only all the horsepower of the engine but also our ability behind the wheel. From arcade mode to speed challenges, Project Gotham offers a number of tests of various kinds such as being able to overtake a certain number of cars, complete a lap of the track in the shortest time possible, maintain a certain average speed or face a path bordered by bowling pins in the most classic of gymkhanas. However, there is no shortage of classic challenges, in this case against five fierce opponents, which at least for once are not the only attraction of the game. For the rest, nothing is really missing and as in any self-respecting arcade game, we'll have to make our way to the sound of doors and drifting curves. Looking for the Kudos As well as in Metropolis Street Racer, the phantom Kudos also make an appearance in Project Gotham. Far from being considered simple ~credits~, the Kudos are skill points that will be assigned to us every time we successfully pass one of the tests. At the same time, by obtaining the highest number of Kudos in the races, we will take home the medals (gold-silver-bronze) necessary to unlock new tracks and competitions. Companions of our exploits will be some of the most appreciated racing cars on the international motoring scene. Initially the choice is limited to a few cars but as the Kudos grow, and therefore our skills, we will also have the opportunity to enrich our fleet with new models. In addition to the ~common~ BMW Z3, Mercedes CLK, AUDI TT, we will be able to get our hands on sacred monsters of the caliber of Ferrari Modena, F-50 and Porsche Carrera GT. For the occasion, Bizarre Creations has chosen to take us along the famous streets of some of the most populated cities on the planet: Tokyo, London, San Francisco, New York (new with respect to MSR). All the cities have been reproduced with considerable care, so much so that those of you who have been able to visit them live will have no trouble recognizing elements of the route such as buildings, bridges, traffic lights and roundabouts which appear exactly as they are in reality in the game. There are many street circuits, often very linear and similar to each other, even if in most cases they are made up of only a handful of bends and straight stretches that can be covered in less than a minute. How I demolish you a Ferrari One of the greatly improved aspects compared to Metropolis Street Racer is certainly the control. Driving is in fact damned fun and simple to master thanks to very precise and immediate commands. This allows us to have total control of the vehicle even in situations of poor grip (rain), or in tighter bends or when we have to tackle particularly tortuous routes. We will also be able to perform all those ~numbers~ that will help increase the Kudos such as skid jumps and curves that very often will lead us to remain on two or three wheels for a few seconds. A devastating and visually realistic damage system also contributes to making the game more spectacular and credible. Bumping into other vehicles, obstacles placed along the way or simply brushing against the guardrails, we will gradually see the ~signs~ of our inexperience appear on the bodywork and I assure you that it will be a very sad sight to see our beautiful Ferrari covered in scratches, with broken and the bodywork deformed. Unfortunately, the effects of car damage are only a scenic component as they will not affect our driving in any way. In this sense, it was probably best seen in Digital Illusions' RalliSport Challenge. In addition to the single-player mode, Project Gotham offers a good depth multiplayer mode. Up to four players will be able to compete on the same tracks unlocked in the arcade game and the resulting fun is guaranteed despite the limitations that the screen divided into four produces. Radio or CD? Coming to talk about the technical realization, I must admit that Project Gotham has left me, at least in part, a bad taste in my mouth. Compared to the first games I had the opportunity to play at the last E3, time has passed and after witnessing the visual magnificence of Gran Turismo 3 A-Spec for PS2 and RalliSport Challenge it is undeniable that something more was expected from the game graphics. Don't get me wrong, Project Gotham is undoubtedly beautiful to look at but what appears on screen looks only slightly more definitive than what was seen in Metropolis Street Racer. In particular, the difference in terms of graphic quality between the tracks set in Tokyo, San Francisco and London (already present in MSR) and the brand new ones in New York that seem to squeeze the XBox hardware a little more is quite evident . In any case, the spectacular nature of the graphics can be attributed mostly to the splendid polygonal models of the cars, made with great detail both inside and outside where it is possible to notice the details of the dashboard and of the driver who moves with great realism . The convincing reproduction of the machines is counterbalanced by a just discreet realization of the scenarios in which a not always impeccable cleaning of the image and the use of textures that are sometimes not too defined are evident. On the other hand, only good things can be said about the sound sector. The sound effects are in fact well made and the choice of music is even better, characterized by a considerable variety. It is also possible to choose whether to tune into one of the radio stations present in the game or to listen to a CD. As already in other XBox titles it is also possible to insert the songs downloaded by ourselves on the XBox hard disk among the music of the game. Finally at the finish line... After what I've written, it would be surprising if I didn't recommend buying the game. Project Gotham, thanks to a simple gameplay but at the same time full of depth, is able to offer hours and hours of fun to all motor enthusiasts and beyond. For a Gran Turismo-style masterpiece, XBox owners will still have to wait a long time, but the Project Gotham-RalliSport Challenge pairing is unmissable for anyone preparing to buy the Microsoft console. If this is just the beginning then there is good hope for the future :). Pros: Fast and frantic Excellent Control Lots of fun alone and in company Finally the Ferraris! Excellent realization of the cars Cons: Not too many changes compared to Metropolis Street Racer The damages do not compromise the performance of the car Somewhat disappointing graphics Materials: Tips Sequel to Metropolis Street Racer? Among the titles arriving in stores on launch day, an arcade driving game could not be missing. Just as Ridge Racer V accompanied the European debut of the PlayStation 2, Project Gotham Racing arrives promptly on store shelves together with XBox. There has been a lot of talk about the new game from Bizarre Creations in recent months as everyone knows the kinship with that Metropolis Street Racer which had previously raged on the Dreamcast. Compared to the predecessor there is no shortage of innovations, first of all a renewed graphic design, yet they do not seem to be sufficient to make Project Gotham Racing a real sequel to MSR. Does this mean that we should expect the usual heated soup? The answer is fortunately no. It is in fact true that we are dealing with a game very similar to the original one, but all those small defects that undermined MSR have been eliminated, leaving room for a much more complete and immediate game.", "date": "2002-03-13", "grade": null}