{"name": "Metal Gear Solid 2: Sons of Liberty", "ref": "https://multiplayer.it/recensioni/metal-gear-solid-2-sons-of-liberty-4.html", "text": "Bzzzzzz BBBzzzzzz. Snake, are you there? Snake?<br> Home cinema The history of video games has changed, and is entering a new phase by right, tracing the first step of the symbiosis between the entertainment media that many are prophesying for the near future. Cinema brings to MGS2 its legacy of choreography, plot and psychological insight into the characters, the study of camera shots and that balance between action and reflection that will keep the player always at attention. Konami brings to MGS2 its historical background as a developer of user control interfaces, both complex in possibilities and simple in use, which give the player control of the rhythms and the feeling of immersion in this beautiful setting. In MGS2 you will find humor, action, emotion and characters so well defined that you will have to love or hate them. Starting with the opening scene of the bridge under the storm you will be bombarded with special effects. Rain and water slide off the camera lens. Impressive lighting effects appear everywhere. The blood of downed enemies sticks to the walls. The interaction with the game environment is almost absolute: you can enter the lockers and observe through the cracks in the doors, or hit and destroy an infinite number of objects in the rooms. The pathos of the story is continually revitalized by cinematic scenes made with the same impressive graphics engine as the game. You bring the popcorn instead. Feast your ears MGS2 benefits from the remix work of Harry Gregson-Williams, which starting from the classic themes of MGS ranges in electronic, symphonic and choral music to give us a soundtrack to remember among the most impressive of the video game industry. The sound changes according to the criticality of the scenes, and reaches its highest moments during the cinematic interludes. Very fulfilling, very engaging. The voices are dubbed into English beautifully, but the Italians have to settle for subtitles this time around. Gameplay Graphics and sound, although excellent, take a back seat to the impressive work of the Kojima team on game mechanics. The emphasis here is on strategy. You'll have to find a way to evade enemy surveillance rather than make a carnage. The modalities are usually more than one, and the player is granted the possibility of adopting his own style, his own tactics. Attract the guards elsewhere by causing noises, put them to sleep at a distance or attack them with karate blows: the player is free, free to explore and act as he pleases. As if to say, Kojima gave us the toy, it's up to us to use it to create our story. The AI of the enemies is really complex: they are able to identify shadows, bloodstains, objects out of place; they notice the noises and if they think you're hiding they call for reinforcements instead of being heroes. I don't remember ever dealing with harder bones. Me boss, you Snake... Boss fights are one of the crucial moments of Solid Snake's adventure, and they are damned complex. Each battle requires the use of different arsenals and a different tactic. The tension is ensured to extreme levels and your reflexes will be put to the test. The player must sometimes move from one area to another and perform some tasks before being able to get the better of the boss, it's not just about shooting wildly.  here Kojima, you land Hideo Kojima is an artist. There is no doubt that few like him have been able to express the artistic concepts and moral positions that emerge from MGS2 in a video game. Faced with the new technological frontiers reached by home entertainment systems, we asked ourselves how we could transcend the mere cosmetic upgrade that characterizes the total production of PCs towards unprecedented gameplay experiments. The first response has arrived, and we believe it is only the beginning. Now Kojima faces an even greater challenge: to renew himself to create a new story, a new virtual paradise in which to accompany us. MGS3 and ZOE2 will not be personally managed by him, and we believe that this is the right thing, because a great director must not dry up. Appointment at the cinema of your home. Pros Make your friends jealous with Xbox It's more than a video game, it's an experience that you must try at least once Graphics, sound, playability at the highest level Cons Quite difficult, will keep you thoroughly engaged Conclusion A milestone, but be careful who he hates the tactical espionage action genre, because he might get frustrated. As the saying goes? a good game lasts a long time? Bzzzzzz BBBzzzzzz. Snake, are you there? Snake?<br> MetalGear Solid 2 is finally here. After three years of waiting we will know the fate of Solid Snake and the thousand surprises designed by Kojima to raise the now historic series towards that ideal expression of total play that Hideo has been pursuing since he started working as a game designer. MGS2 isn't just a commercial sequel, released to satisfy the many requests from audiences and critics, and it's not even an adaptation to the new Sony architecture that hopes to pitch us with graphic restyling and some CG footage. It is an ambitious and impressive project, which captures the user and inserts him in what is most similar to an interactive film we have seen to date.", "date": "2002-03-08", "grade": null}