{"name": "Resident Evil Survivor 2: Code Veronica", "ref": "https://multiplayer.it/recensioni/resident-evil-survivor-2-code-veronica.html", "text": "At the beginning of the game you can choose whether to take on the role of the sweet heroine Claire Redfield or the brave Steve Burnside in two distinct game modes: dungeon and arcade. Both modes support the light-gun, which means that you can easily use a gun as a peripheral if you own it or play with the joypad even if the first is much more effective and impactful due to the nature of the game which prefers a dynamic that fits well appropriate to the movements that the light gun allows you. There will be parts of the game where you have to quickly aim and repeatedly pull the trigger on hordes of angry zombies and I challenge anyone to do this with the joypad and survive more than two minutes. In the arcade mode your task will simply be to escape from Rockfort Island. Your task will first of all be to complete each stage of the game by finding a key in each of them and at the same time purifying it from all the creatures that roam around including the annoying end-of-level boss. In addition to the bosses and the inevitable zombies you will have to deal with the slimy Bandersnatch and the mighty Nemesis. The arcade mode includes a Partner System which allows you when playing alone to use the other character who will be guided by the CPU as help. For example, if you choose Steve, you can assign Claire to the CPU and vice versa in order to fight together against the enemies that will stand in your way. The artificial intelligence that guides the character operated by the CPU is well made and you will hardly find yourself in uncomfortable situations in which your ~friend~ rather than helping you takes the side of the enemy by sitting with folded hands. The Partner System is not provided in the dungeon mode in which hordes of enemies will throw themselves against you in an attempt to eliminate you as in a survivor mode. Your task in each mission will be to eliminate the final boss but the more zombies and creatures you kill, the higher your score will be. In this mode the passage of time will be crucial for the success of your missions as every time you eliminate an enemy a combo meter will appear on the screen and you will have to shoot down as many enemies as possible to build a combo that will give you a score as high as possible. If you are fast you will surely be able to perform some valid combos that will further increase your score. This won't be that difficult for you since you will be attacked by armies of zombies who will do anything to send you to the other world. However, you are wondering since we are talking about clashes and fights with unhappy-looking creatures, how will you eliminate them effectively! This small detail will be helped by the weapons you will be equipped with to face the battles with the undead. First you will have three types of weapons to rely on. Some weapons can be used by both characters while others will obviously be used individually. The grenade launcher and the Magnum, never-failing weapons in the game, will return to help you get rid of your enemies while the flamethrower will be one of the final prizes to round off the game with a nice zombie barbecue. The soundtrack of the game is in theme with what are the ghostly environments in which you will find yourself fighting while the sound effects make the air you breathe during the various missions more gloomy than ever. Gun Survivor 2 despite being a game inspired by a famous saga like that of Resident Evil, however, is a title that is still little known on the web and by gamers. However it deserves an interest mainly because it presents a new way to experience an intense horror adventure with the charm of a first person shooter. Pros: There is no better game where you can fully utilize the resources of Namco's GunCom 2 Possibility to shoot down all the enemies seen in Resident Evil: Code Veronica Gloomy environments and music that are well suited to the horror atmosphere of the game Cons: If you have played Code Veronica this Gun Survivor 2 may seem repetitive In the long run the soundtrack may be boring Resident Evil Survivor 2: Code Veronica was unveiled in October 2001 by Eurosoft, the European division of Capcom and the PS2 version has been available on the shelves of Italian shops for a while. Lovers of this fascinating horror series will be happy to venture once again among zombies and creatures of darkness in a first-person shooter that will make you relive the events of Resident Evil: Code Veronica with the frenzy of a Doom-style shooter.r make it short.", "date": "2002-03-01", "grade": null}