{"name": "Space Race", "ref": "https://multiplayer.it/recensioni/space-race_a.html", "text": "Other than Dumbo, pink elephants fly here!! Let's start talking about the game modes: like all titles of this genre, you start with a small number of characters at the beginning which will then increase by winning leagues or even buying them, needless to say that each unlocked driver will have a vehicle with its own characteristics they will ~influence~ the driving style. In the same way it will be possible to unlock unpublished circuits and modes, cards and films about the characters. Having said that we must talk about the so-called fil rouge that distinguishes the whole title: the insaneness that comes out of every line of code, since in the end we are dealing with Bugs Bunny, Sylvester the Cat, Will Coyote and company. In short, everything was planned to arouse hilarity, and we must give credit to the guys at Melbourne House for the excellent work they have done. More than the graphics, examples of the concept are the weapons available: personally during the first few games I died laughing, seeing pink elephants, pianos, anvils, or the aforementioned Fantozzi clouds coming at you out of nowhere is really hilarious. Cell shading mon amour... The graphics are exactly what you would expect from a title of this kind: the first thing you notice is the use of the cell shading technique, so in fact you play with a real two-dimensional cartoon, even if in truth we have before the eyes a good number of polygons. Fluidity and speed are also at good levels, you don't get to splash like in Wipeout, but there are no framerate drops despite the already mentioned good number of polygons. It's a real show to see our favorites darting aboard absurd vehicles on well-designed tracks with daring and extremely exaggerated chromatisms. Nothing in terms of graphics has been left to chance: the drivers ~live~ the race, greeting and making fun of the overtaken competitors, while from time to time two screens come on where two reporters give us their enlightening opinions on the progress of the race . The sound is also of the highest level: the localization is absolutely perfect, the music is very beautiful, even if in some cases it gave me the idea of being a bit out of place. Much form little substance.... Until now we have talked about the positive aspects of the title, which despite their goodness and abundance, however, fail to mask some serious flaws that greatly affect the playability and degree of involvement of the title. However, let's start by saying that the title does not have the same audience as that of Wipeout as a target audience, therefore many of the notes to come lapse if the player who plays is, let's say, under 14. It is not possible to speak of a real physics at the base of the middle: you have the aerobrakes at your disposal as in the title of Studio Liverpool, you tail off and drift which is a pleasure, what is missing however is the concentration and attention that leads us to brush curves, to nibble on thousandths and to brake at the limit. The only real obstacle to overcome is going off the road or falling into a ravine that makes us lose many seconds, that's all. Even our opponents show poor artificial intelligence, they let themselves be overcome without batting an eye, the only thing they do is empty their arsenal on everything that moves. The use of weapons therefore becomes the only variant that gives the title a shred of challenge. In fact, it is impossible to avoid elephants, pianos and anvils that fall on our heads, we just have to get up, hit them and in turn activate our demented arsenal. So in the end the lucky one wins who was hit the fewest times during the last lap or at least as far from the finish line as possible. Ultimately the Infogrames title lends itself to a double interpretation: if you are looking for a long, complex, difficult, challenging and rewarding product in the long run, Space Race is not exactly what you are looking for. On the other hand, those who want an easy, immediate, exhilarating and technically well-made title can easily throw themselves on this title. Ultimately, the opinion on the stock is certainly negative; even hiding behind the screen of the reference target, Space Race is objectively not very funny and engaging, even if equipped with a respectable audio/video compartment, in short, after the first minutes of exaltation in the face of so much visual bombast, the shrewd player will fall in the so-called videogame hibernation. In short, a wasted opportunity. Pros High-level graphics and sound Many weapons available Immediate Cons Easy Not very engaging Fattalmost zero challenge hours Space Race Vs WipeOut(?!?).... The new Melbourne House title is a nice racing game that puts us at the wheel of amazing flying machines by impersonating historical and/or mythical characters such as Sylvester the Cat, Porky Pig and beautiful company. Space Race is certainly the first direct answer to Wipeout Fusion. Of course we cannot speak of competition in all respects, but in the end the concept underlying the two titles is the same: sci-fi flying vehicles, routes more suitable for flights of fancy than for clean and rigorous competition conduct and means of offense very disparate. The fact that in the Infogrames title the most representative pilot of the lot is a clumsy cat, and that the most technological weapon is a cloud of Fantozzian memory in a ready-to-use spray bottle, does not change the subject: Space Race = Wipeout Fusion. Provocations aside, the theory behind the two titles is the same, the practice then is clearly polar opposite.", "date": "2002-02-28", "grade": null}