{"name": "Hooligans - Storm Over Europe", "ref": "https://multiplayer.it/recensioni/hooligans-storm-over-europe.html", "text": "Storm over Europe... Units are divided into two basic categories: simple units and leaders. Each leader can command a more or less large group, gathering around him the hooligans he needs. Once a group has been created, it will automatically be assigned a number and it will later be possible to recall it by pressing a key. Very comfortable. The importance of the leader consists not only in grouping and commanding men, but also in increasing the loyalty of the ~supporters~ through his songs. And yes, because in addition to the hooligans we will find a large number of people who, under the influence of beer or other more or less legal substances, will be willing to join us and lend us a hand in the delicate operation of territorial conquest! The supporters, therefore, are normal fans who let themselves be seduced by our power, but can easily stop following us, or even switch to their opponents. Furthermore, they are not under our direct control and therefore we will not be able to stop them in case they decide to devastate something. We will be able to collect them in pubs and it is precisely here that our faithful men will have their base. A pub is conquered by entering it for the first time and, once inside, it will be possible to offer beer to everyone, increasing the loyalty of supporters. Furthermore, in pubs, we will even be able to recruit new units, provided we have enough money. Another aspect of the game is the use of money which, as in real life, is required to do almost everything. Offering a round of beer, recruiting new troops, buying various objects (we'll see later), are all actions that cost money, so we'll need to have the cash needed to pay for them. So where can we find all this money? No problem, like any good hooligan we will be able to loot shops, shop windows and even apartments and collect all the necessary ~subsidies~. Provided, of course, that there are no police around... Uligani, Pulotti and Multiplayer Earlier, I was talking about various objects. What is it about? This is the equipment that every good metropolitan warrior must have in order to cross the opposing cities unscathed. Well, times have changed and it's full of bad guys to defend against... um... Weapons can be bought in specialized shops and it is inadvisable to use persuasion ~technical notes~ with their owners, since they always have a rifle more than us... In addition to the gun shops, throughout the game we will find other interesting places to visit. Scattered through the streets of the city, for example, we will find brothels where we can send our men if morale is low (er...) and we will also be able to hire a couple of... ehr... girls to have fun with our opponents. As you can see, the resources available are there, even if they are not immediately evident, and we will be able to use them in the most disparate ways, depending on the game situation. Thus, as we have seen, we will be able to send our troops to a well-stocked shop and equip each of them with a specific weapon. Each unit, in fact, will be able to carry only one weapon and moreover of a certain type; thus, our leader will be able to get a nice flaming .45, while a common hooligan will use Molotov cocktails and explosive objects, while - again - a biker will never give up his faithful chain. Uligani, Pulotti and Multiplayer Each unit has a special ability that distinguishes it, so if a Hooligan can throw explosives, a rat, however, can force the locks of the apartments and a biker can even drive some vehicles. Indeed, during the game, we will find cars that we will be able to take possession of and which will serve not only to carry the backsides of our troops for a walk, but also to iron the opponents' clothes by passing over them (with the opponents inside, of course). The utility of the vehicles, as can be seen, is far from marginal, the important thing will always be to have a biker available who can ride them. There was talk of opponents, but who are they? With whom will we find ourselves sympathetically sharing hammer blows on the gums and fingers in the eyes? Our enemies are essentially two: the opposing clans and the forces of order. Running against groups of other hooligans is unpleasant, as they have the same resources as us and can do to us exactly what we do to them, if not more. So in this case, the challenge is high. The police, on the other hand, will not follow the etiquette of the perfect thug, when we find them in front of us, and will not try to take possession of the key points of the city or surround themselves with drunk supporters to send against us. What theand the forces of order will limit themselves to throwing tear gas at anyone who is responsible for criminal acts and does too much damage. With the police, then, we will have to adopt different tactics, especially considering that each city will have its own different public safety provision. In short, facing a cordon of men in riot gear is not exactly what we like best. A beer with friends: Multiplayer Everything we have said so far, however, concerns the single player version of the game, but it must be said that we will also be able to amuse ourselves in clashes against other gentlemen like us, on the net, both on the internet and on the LAN! The authors of the game have implemented very intriguing multiplayer modes, adapting classic schemes to a different situation than usual. Let's see in more detail:- LAST MAN STANDING: raise your hand if you don't know this mode... well, you all know what it is about, but since I like to insist, I want to refresh the memory of the most careless. In this type of game, the player who kills all opposing units and is left alone on the map wins. - STRATEGIC BATTLE: this is a points mode, which will be earned by performing ~relevant~ actions, thus devastating the city. Each match may have a time or score limit, or both of course.- HOLD THE CUP: many ardent hooligans and a solitary cup... the aim of the game is to take possession of the cup for as long as possible. Naturally, points are earned with possession and the player who has earned the most points will win. - DRINK IT: this is where we get serious!! The aim of the game is to drink and the player who drinks the most wins! Obviously, to drink you need to have money and therefore we won't simply have to sit in our favorite pub and guzzle beer, but we will also have to go out (once in a while, but not too much... ) for the usual, honest, chores... Technically speaking... Ah, the beer, the beer... It warms our hearts and clouds our minds, already dull on their own... And it must have warmed the hearts of the developers in large quantities too, since there are very controversial aspects, in this game. Let's see what happened. The sound is done very well, with good support for positional audio and very intriguing music, set on rock registers that make the game atmosphere more electric. The stadium chants during the map loading phase are interesting, when the hooligans mimic famous songs, adapting their text. The result is certainly fun and is a pleasant way to kill time during the infamous 'loading' of the levels. Equally entertaining are the videos that act as an interlude to our ~feats~ and show us moments of the daily life of a group of fans, at least during their moments of relaxation. And so far so good, but let's see why the beer must have flown abundantly during the development phases of this title. Conclusions What to say, when a strictly 2D game looks heavily jerky on a GeForce3 equipped Duron 800? With 256MB of ram, what's more? Here, then you understand where my initial doubts originated from. I realize that the developers, these unknown DarXasbre, are a small group and basically came out of nowhere. I also imagine that the budget behind them was rather limited. But I can't explain why, when I try to move the cursor on the screen, at a resolution of 800x600, I seem to be navigating in the glue. Not to mention when the seabed sprites cover the units...well that happened too. Technically I find that the Hooligans engine, which rests strictly on DirectDraw (ah... other than Diablo II), is rather poor and that, probably, this result is due to an immature presence of the game on the market. Perhaps, a few more months of testing would certainly have helped him. What about artificial intelligence? Here, another phase of the game's development, which must have been abundantly watered with beer, is just this. To say the intelligence of the units is outrageous is an understatement. You can loot shops and smash windows within a span of the police's nose and they won't see you, you can enter an opponent's pub undisturbed and burn it to the ground, but the nearby police will continue to throw tear gas at unconscious fans. Conclusions And what about when the player's units pass unscathed under the noses of enemy clans, to enter a nice weapon shop? But the best is when you put qusomeone at the wheel of a car... oh well, they're all 'mbriaghi, but the cars will systematically get stuck, in the most unthinkable ways, almost everywhere. So do you understand why I say that, perhaps, the authors focused more on the beer than on the game code? But it's not all so bad, fortunately. Playing Hooligans is fun, a sort of carefree pastime with certainly original gameplay. Commanding groups of units and not having to worry about ~building~ them, as in the more classic rts, and not having the nightmare of collecting more or less precious materials for the construction of equally important buildings, is certainly a big point in favor of the game . Being able to make use of units that are not directly controllable, such as supporters, is another idea that makes the game last longer. In the end, all the action is concentrated on the acts of vandalism that can be carried out in the various cities that will host us and on the clashes with the enemy clans, without, however, neglecting tactical planning, an always decisive factor, even when dealing with those turnip heads of hooligans. Sure, being up against opponents with such an A.I. it helps a lot, but the challenging levels are still enough to guarantee hours of healthy fun. And then, do you want to put the pleasure of playing with an open beer in front of us? I'm among us... Hooligans is a title developed by the unknown ~DarXabre Games~ and is certainly one of the most awaited ones lately, if only for the certainly original approach to the tactical/strategic genre. What we have before us is not a traditional RTS, since here we don't have to collect resources or build buildings; in Hooligans all we have to do is gather a crowd of more or less aggressive fans and push them to devastate everything that comes into our heads. The story of Hooligans is simple: we find ourselves at the head of one of the most important fan gangs and we have decided to follow our favorite team (yes, even hooligans have a heart...) around Europe, where cup matches will be held. Naturally, traveling as a hooligan means visiting the various capitals in a different way from the usual tourists and so our kids will be able to leave tangible signs of their passage and the souvenirs we will take with us will not be the usual postcards... Talking about ~missions~ and ~briefing~ in a game dedicated to little brain may seem a contradiction, yet we will find ourselves facing situations that will prove to be tactically relevant and in which we will be called to decide on real war assets, to be used ~in the field~ (i.e. by the roads we will cross). Before each mission, therefore, we will be offered a short animated briefing, through which the objectives to be achieved will be explained to us, obviously in a very colorful way. Unlike a traditional strategic game, we don't have buildings to build or troops to produce: the only resources at our disposal are our own forces, so we will have to conquer the most important areas relying only on a small group of units.", "date": "2002-02-19", "grade": null}