{"name": "Moto Racer 3", "ref": "https://multiplayer.it/recensioni/moto-racer-3.html", "text": "The specialties The modality that is undoubtedly more familiar to the average player is that of the grand prix: in fact, for years now we have been used to products that take us to the track with motorbikes, but precisely for this reason, we are driven to make comparisons with uncomfortable ~cousins~, Superbike 2001, which has plenty of graphic quality! In fact, the most striking aspect is the disappointing graphic and audio realization; we would have expected a little more accuracy in the details of the bikes and in the environmental mappings, in a game that tries to take advantage of today's powerful 3D video cards. The races take place in a somewhat monotonous way, also due to the coldness of the opponents, who seem not to care about us, even at different paces, adopting a driving style that does not take much account of the physical laws: we still have at our disposal three levels of difficulty, as well as different trim settings for the setup of our bike. The second game specialty is the one called Traffic, familiar to those who have already played the second episode of the series: particularly fun, it takes us to whiz through city traffic dodging cars and vans. However, we cannot fail to find several graphical bugs, even if, compared to the Grand Prix mode analyzed above, this seems to be better done. Here too we can set the different levels of difficulty, which will accompany us in the race in this city ring, where we will have to try to beat our opponents on the saddle of other motorbikes: it is also necessary to pay close attention to dodging cars, which are truly terrible! The specialties The third specialty is one of the novelties of this third chapter: the Cross. With the Cross we finally get to the heart of Motoracer3, and we begin by seeing the peculiarities that could justify the purchase even by those who already own the first two chapters. Fun and well done, the arenas and muddy tracks represent the setting, the pleasant environmental textures, the highly effective light sources (with active reflectors), the details of the motorcycles and the movement of their remarkable suspensions. 'other marked in the positive sides of this modality. You get on the saddle and after a short wait, for the nice introduction to the race, you're ready to open the throttle and attack every roughness of the track, trying to keep up with the leaders... Note in particular in the replay the movements that the pilot performs, really well done! Partially similar to the Cross mode, the Freestyle specialty will see us busy heading full throttle on dirt trampolines and more, to perform heart-pounding jumps with stunts included! The game system is as original as it is addictive, and also thanks to combined commands we can perform acrobatics of all kinds while jumping tens of meters above the ground, to great effect: be careful when landing, it's not always the ~sweetest~! The stadiums where the Freestyle tests take place are all full, and thousands of people take splendid photos of us, at least judging by the flashes that can be seen ... The routes to be followed will be indicated to us with arrows on the ground and at the end of our test the judges' scores will tell us the quality of our executions. The last specialty is that of the Tryal, very similar to the Cross mode except that you must never put your foot on the ground. Final conditions A note of merit belongs precisely to the environments of the races, in the cross-country specialties, they are really beautiful, above all the management of the light sources that strike the objects simultaneously, generating truly remarkable reflections. The interaction of the bikes on the ground and their ~spin~ are more than pleasant. Motoracer3 could also be sold without the specials , Grand Prix and Traffic, the other three for an arcade and original title are more than enough and fun, as well as better done in all fields. In any case, a touch of ~pista~ doesn't really hurt, if well mixed, who knows maybe with some patch that cures the ills of youth. Sore point for the replays, beautiful but totally automatic and without the possibility of saving. Overall a product that can be improved but absolutely ~ready to use~, without particular setup problems or complicated instructions, you install and start immediately, really simple! Motoracer 3: the return We could thus define it as the long-awaited title of Delphine Software, the third edition of this original genre, which combines the track, motocross and indoo motorcycle specialties in an explosive mix.r. We're talking about a fun Arcade, suitable for all users who want to try their hand in particular with acrobatics and acrobatic balances. The purpose of the main game could be defined as ~career~, as, thanks to the results of our races in the various disciplines, we will be able to sell and buy motorcycles of various engine sizes, or unlock other available circuits. Of course, it is also possible to play in different modes (Training, Against the clock, Competition, Friendly race). All those who use the ~consoles~ will be greeted by menus that they will find ~familiar~, simple and direct (the fans of simulations and thousands of adjustments are less happy!), and with self-calibrating graphic and audio settings based on your hardware . The game includes five different motorcycling disciplines: Grand Prix, Traffic, Cross, Freestyle and Trial: in the next chapters we will analyze them in more detail.", "date": "2002-02-18", "grade": null}