{"name": "Mega Man Battle Network", "ref": "https://multiplayer.it/recensioni/mega-man-battle-network.html", "text": "Lan and Megaman A morning like any other for Lan, a kid from Acdc Town. In the future (20xx), having a PC at home, knowing how to navigate the net, are habits that have entered everyone's life, thanks to decidedly advanced technology and, in what promises to be a long saga, Megaman is Lan's pet, i.e. a sort of alter ego of our little protagonist; through Megaman, it is possible to make and receive phone calls, as well as emails, as well as perform the functions of the most advanced PDAs, given that the PET can also mark important dates, buy online, receive news from the network in real time and much more. Thanks to a simulation program called Net Navi it is possible to give your own personality to your PET, from an aesthetic as well as a purely internal point of view. The last feature worthy of mention in these lines is to prevent the introduction of viruses into PCs. In the course of the game, in fact, we discover that humanity finds its nemesis in a terrorist organization named WWW (World Three) that wants to turn the network upside down and conquer the world, not for nothing since the early stages of the game, when Lan goes to school (and you'll be there often, for the most disparate reasons), the teacher teaches notions of prevention against viruses, illegal accesses, etc etc). The universe built by the Japanese programmers is well thought out, the various locations have been designed with a certain foresight without forgetting that in a short time you will begin to familiarize yourself with the various non-player characters, primarily Lan's parents and his schoolmates ( curious note: at Dex's house, owner of the PET Gutsman, there is a Gamecube, which can be interacted with!). Between the real and the virtual To explain the gameplay of Mega Man Battle Network in the most exhaustive way possible (remember that in Japan it is called Rockman Exe, recently graced with a sequel), we could say that there are two key moments of this excellent role-playing game: exploration, mainly in the real world and fights, which take place in the network; it may happen that Lan has to solve some problems in the network, or eliminate viruses that can cause malfunctions or total non-functioning, for example, of the program that manages the operation of the subway or even of the water system of the entire city! In this case, through the jack in operation, Lan introduces his own PET into the system to be brought back to its normal state (even traffic lights, if the life of the beautiful Mayl is in danger), causing Mega Man to solve the situation, breaking down the viruses that it will find along its path, also perilous due to the classic end-of-level guardians, viruses with a decidedly high resistance. Sometimes, rarely, your beloved Pet will find himself in difficulty and young Lan will help him, for example by deactivating traps or looking for certain codes that will help Mega Man in tangled situations. If so far Mega Man Battle Network seems like the usual Japanese-based RPG, the time has come to reveal the real gem of this Capcom production: the game system chosen for the fights (which happen randomly as you wander around the network) . The playing area is represented by a chessboard, half red and half blue, on which you and your opponent (or opponents) can move without invading the enemy area. Anyone who knows Mega Man may be wondering what techniques the likeable blue android can count on, apart from his buster rifle which he holds in his right arm, given that in every platform starring Mega Man, our virtual alter ego (in every sense !), has made use of the most disparate power-ups, once the various end-of-level bosses have been defeated. This time the gamer can count, in addition to power ups for health points and the buster rifle, on 175 chips, different by type: the chips can increase your attack power (medium, low or long range), being able to Mega Man take advantage of cannons, lightsabers, bubble-shooting weapons and many other devastating weapons; however, the attack alone will not be enough, so you will also have to use the defense chips (recovery of health points in primis) or those that will allow you to perform disturbing actions (how to steal precious blocks where to move, limiting the movement of enemies). These chips can be recovered by buying them, by finding them scattered here and there throughout the levels (sometimes even well hidden) or by quickly killing your enemies, without being hit (among other things). Between the real and the virtual Once the battle has begun, it is good to choose the most suitable chips for the different (and many) types of enemies; learn to knowcerli tutti will take some time, since some will attack in a straight line, others randomly, others will teleport to hit you at zero distance and therefore you will understand how it is difficult to get bored of the excellent combat system devised by the Osaka software house . If you really can't collect all the chips, you can always link the console with that of a friend of yours, also equipped with the Mega Man Battle Network cartridge, to exchange chips or have your pets fight (just like sometimes happens in the game, especially with Dex's pet Gutsman or Sal's Woodsman). A longevity of about twenty hours also ensures a certain longevity if we consider the fact that the game runs on a portable console based on cartridges. Sometimes it may happen that you do not remember what you need to do to advance in the game, perhaps thinking of the most distracted, Capcom has included the possibility of asking Mega Man (or Lan, if you are on the network) for advice by simply pressing a button. But don't think that this is why the game is easy, there will be several times that you will curse against some intricate labyrinth! Technically speaking. Graphically we are on decidedly good levels: the backdrops are remarkably detailed, the interiors are all quite different from one house to another and the labyrinths that you will face on the big network are equally well done. The sprites are made with care and are well animated, even if the amount of different sprites (school friends or monsters) is not very high, as in any case happens in the vast majority of role-playing games. Particular treatment has been reserved for our little android, beautifully animated as he moves through the various levels, and with an excellent characterization, as can be seen above all in the combat phases. Let's now analyze the audio side of the game: the music is the usual one heard in RPGs, that is discrete but repetitive within the short term, unfortunately, both if you wander here and there outside the network, and if you are engaged in battle against various viruses. On top of that, the quantity is a little less than average. The sound effects, on the other hand, are appropriate in every situation: explosions, sword blows, teleporters, the Game Boy Advance audio chip has been exploited with knowledge of the facts, especially if you have the good habit of playing with headphones, as it would almost be mandatory with portable consoles. Conclusions Mega Man Battle Network was a real surprise, fortunately delicious: for once, a spin off of the popular platform made by Capcom does not prove to be a very sad disappointment, decreeing yet another success of the popular icon of the Osaka software house, thanks to really nice graphics, a good sound sector, excellent playability and a story that manages to keep the gamer glued until its conclusion, therefore for a lot of time. One of the best rpg of recent times, undoubtedly. The sequel has just been released in Japan, let's hope Ubisoft imports it to us right away! Can't waait! Pros: Good audio-visual realization fun and very long-lived Cons: you wanted a new Mega Man platformer and you got an rpg Mega man 32 bit With the advent of Game Boy Advance, very few would have doubted that Rockman (in the West Mega Man), the popular hero of dozens of platform games (and various spin-offs) on the most varied platforms (from Nes to PSone, via Snes and Game Boy), would have resisted the temptation to grace the portable console par excellence with its presence. With the Japanese release of Rockman Exe which took place almost a year ago, the many fans of the popular blue android were satisfied, with a huge RPG, of decidedly high quality, which in one fell swoop, satisfies those who were hoping for a platformer (of the regular series or ~X~) and denies that clich according to which every Rockman spin-off is necessarily a videogame chufe; after all, after a foray into the world of football, go kart racing and 3D arcade adventures, the many fans of the famous blue robot cannot be blamed, burned with some of the worst video games in videogame history. This time, however, CAPtive COMmunication has made the coup and Ubisoft hands it to us on a silver platter, entirely localized in the Albion language; RPG lovers, get ready for a little gem!!", "date": "2002-02-13", "grade": null}