{"name": "Stronghold: Warlords", "ref": "https://multiplayer.it/recensioni/stronghold-warlords-recensione.html", "text": "Real-time strategists have always had a major identity problem. During the boom period of the genre, dozens of them were published, all very similar to each other, so as to quickly create a strong conceptual tiredness, which led to a real commercial collapse. The substance is that after years in which every publisher seemed unable to exist without having its own RTS, a period of estrangement from the general public has begun, in which the releases have become more sparse and the size of the productions has reduced. Be that as it may, lately there has been a resurgence within a fairly large and active niche, resulting in such titles as the re-releases of Age of Empires, Northgard and Iron Harvest, not to mention Total War, by the way. never decayed (perhaps precisely because they have a strong identity that characterizes them and makes them recognizable beyond the genre to which they belong). It is probably the apparently favorable market conditions that suggested to FireFly Studios that a return of the Stronghold series was a good idea. So, seven years after Stronghold Crusader 2, here is Stronghold Warlords, a successful but not very brave work, as we will see in the review. Game mode A siege in Stronghold: Warlords The first detail you notice when starting Stronghold: Warlords is the oriental scenario, completely new for the series, usually set in the European Middle Ages, albeit with some sorties in fantasy. The game offers five single player campaigns, four set in China and one in Japan, for a total of thirty-one missions, arranged over a long period of time ranging from the third century BC. until the arrival of the Mongols. Of these, four are military campaigns, while one is referred to as an ~economic campaign~ because it places emphasis on other aspects of the gameplay, such as finding resources for the population or rebuilding destroyed structures. In addition to the campaigns, Stronghold Warlords also offers other modes for solo players, such as the Skirmish mode, which pits you against one or more CPU-controlled opponents on dedicated maps, or the sandbox mode focused on the free construction of castles. In addition to the single player modes there is also the possibility of playing skirmish maps online. Gameplay The development of cities gives excellent results, but is somewhat limited The gameplay of Stronghold Warlords is typical of RTS, with some important variations determined by the saga to which it belongs and by the attempt to introduce new game systems that differentiate it from the competition. The basics are still the classic ones, with the player who must first start collecting resources (timber, iron, rocks and various types of food) to build the buildings that will give him access to other buildings or to stronger units. The economic system set up by Firefly Studios is quite light, in the sense that it is enough to have a certain structure to start automatically collecting the material connected to it, with the workers who are easily able to manage themselves. At most, new houses need to be built from time to time to supply the kingdom with manpower and crops need to be expanded to feed the new arrivals. If you wish, you can act on taxes and rations to better modulate the urgent needs of our kingdom. For example, if you are short on money, you can double or triple taxes, recovering the support of the population by increasing the per capita food rations. The aim, except in maps where something else is specified, is always to have enough resources to build a stronghold to defend against aggression and to generate the most powerful army possible, so as to set out to conquer the warlords and, in last resort, of the enemy on duty. The Warlords An artwork from Stronghold: Warlords Describing warlords is quite easy: they are personalities who control more or less extensive territories, sitting in their tower, protected by a certain number of soldiers. Conquering them not only expands our possessions, but guarantees us the possibility of obtaining extra resources from their territories, through edicts that can only be issued if you have enough diplomacy points available (generated by the benevolence of the people and by dedicated buildings). Warlord towers are also great lookout points to anticipate opponents' moves with archers and other troops attacking from a distance. In some missions, those in which the economic part is completely missing (given a certain number of troops, you have to conquer the map without losing them all), they are also the only way to get reinforcements.uncles. If we want, they also have a deeper function: that of determining the pace of exploration and expansion of the maps, given that they are often part of the main objectives to be achieved (conquering a certain number of territories), are contested by the forces in the field and are inevitable to cross while working to accumulate men and resources. Strongholds and castles Learning how to build fortresses is crucial to winning One of the most interesting parts of the game is the one dedicated to the construction of castles, using an integrated editor, which allows you to erect powerful strongholds in less than no time, made up of walls, gates and towers, useful for defending yourself against aggression and for creating more complex defenses than a simple deployment of troops at strategic points. The presence of fortifications is also essential to justify the existence of units dedicated to overcoming or destroying them, such as soldiers with ladders or catapults, which add variety to battles. In terms of design, castles are closely tied to the maps they are built on. Let's say that in most campaign missions theirs is a purely functional role, that is, it is better to erect them thinking of their usefulness, while in the sandbox mode you can indulge more with creativity, without paying attention to conquests, armies and battles. Castles are also the focus of defensive missions, those in which you win by accumulating resources and troops, because they allow you to dramatically slow down the enemy's advance, giving you really interesting tactical banks. A classic game Some missions focus on the economy In terms of game flow, Stronghold: Warlords looks like a classic RTS, in which the speed with which you gain access to resources and accumulate enough troops for defense and attack matters a lot. The CPU-driven enemy AI is well developed and manages to produce some decent tactics, particularly in castle defense, but don't expect anything too elaborate. The battles range from simple skirmishes between units to the most spectacular assaults on castles, where notable moments are missing between stairs, explosive projectiles and collapsed walls, even in the face of graphics that leave something to be desired overall in terms of style, less in terms of details (always relatively to gender). The substance is that we are faced with an overall very valid game, but which, despite some attempts at differentiation, fails to make the genre take any step forward, limiting itself to proposing a formula designed above all for fans of the same. After all, this is how you think about niches, that is, giving them exactly what they want. It is a pity that in this way we risk a long standstill, but it is inevitable in an era in which producing a video game has become a millionaire business.", "date": "2021-03-08", "grade": "8.0"}