{"name": "Salt lake 2002: neve", "ref": "https://multiplayer.it/recensioni/salt-lake-2002-neve-sport-e-spettacolo.html", "text": "The numbers of the event In addition to the colors of our beautiful homeland, we will also be able to decide to compete in the various disciplines wearing the suits of 15 other nations, namely: Austria, France, Norway, Canada, USA, Switzerland, Germany, Great Britain, Japan, Sweden, Spain, Russia, Finland, Greece and Australia. While as regards the type of disciplines in which we will have to juggle we will be called upon to demonstrate our ability in k120 jumping competitions, parallel and individual giant slalom on snowboard, downhill, 2-man bobsled, acrobatic jumping and slalom. Among these, in the first four we will have to impersonate male runners while in the last two we will take on the role of sweet and competitive girls. As for the game modes that we will be able to use, our choice will fall on 4 possibilities, which will allow us to face the game with a game play oriented more towards the arcade or in a more realistic way. In detail, the options that will be proposed to us will be: Olympic, Tornament, Classic and Freeform. With the Olympic option, it will be possible to select the events in which to participate and carry out the competitions according to the normal regulations of the Olympic Games, obtaining prizes and awards based on one's placements in the general rankings; in tournament mode instead you will have to face challenges consisting of 4 knockout rounds in which you will have to win the competitions related to the selected disciplines. The game in classic mode will provide us with the opportunity to compete in each competition having gradually increasing levels of difficulty as well as increasingly adverse weather conditions. Finally, the free mode will give us the opportunity to carry out all the training tests we want both in total freedom and by defining any time or score objectives to be achieved. You have to put this stake here in the... Remarkable in Salt Lake 2002 is the care and attention to detail with which the environments that surround the various competitions have been reproduced. Each track has been built with extreme fidelity (thanks also to the use of satellite images by the programmers) and in addition to the original tracks we will also be able to see nets, billboards, shooting positions, streets, bars and anything else that surrounds a ski slope and a ski resort. The graphic design of the athletes is also good and the implementation of facial expressions and emotional reactions at the end of a race is very pleasant. In case of victory we will be able to enjoy the incredible explosions of joy combined with ballets or cries of triumph, while in the case of a defeat we will be faced with crying, scenes of sadness or even quarrels with our teammates. A note of merit must also be spent on the management of the weather which will be determined by three variables that will have a great impact on the difficulty of the tests we will have to conduct and on the graphics of the game. The values that we can change in the case of free or classic play and which instead will be set automatically and randomly in the case of Olympic competitions will be those related to the hours of the day (light, dusk, dark), the weather (nice, cloudy, snowy, dark) and visibility (fog, snow, sun,). It is interesting that, during the races, the weather conditions can change suddenly (just like in reality) and therefore increase or decrease the difficulty for the athletes to face various tests. Ski boots and control One of the most difficult elements in a sports game is always given by being able to make the player experience the sensations of sporting activity by reproducing the dynamics of movements and problems associated with a certain activity in the best possible way. Without being a real sports simulator (that is, without reaching the extreme of realism) Salt Lake 2002 manages to convey very well the sensations related to the response of skis and snowboards, both as regards the movements you know as regards the interaction with the surrounding environment (posts, dunes, fresh snow,...). Valuable the fact that with only five keys the player is given the opportunity to make every possible movement, making the title easy to play and command while having a remarkable realism. If you love snow and the disciplines related to it, Salt Lake 2002 is certainly a title for you and able to give you hours of fun and challenge. When the snow enters the houses Despite the disappointments comesnti from the exclusion from the Olympic event of the Azzurri athletes in the Nordic combined and ice hockey specialties, the Salt Lake City Olympics promise to be really interesting and intense for the Italian contingent which will see 113 athletes present in the competition accompanied by a total of 226 members of the delegation all for the ~modest~ sum of two billion lire (about one million euros) of expenses. While we wait to admire and acclaim our local athletes on the snowy US slopes, EIDOS brings to our attention a sports game based on the Olympics license in which we will be able to juggle 6 different disciplines in an attempt to win as many gold medals as possible.", "date": "2002-01-31", "grade": null}