{"name": "WWF Smackdown! Just Bring It", "ref": "https://multiplayer.it/recensioni/wwf-smackdown-just-bring-it_a.html", "text": "Being a wrestling game you will certainly know that the aim is to fight to reach the coveted title of WWF champion, which is not the homonymous organization that protects animals but the highest existing category. Once you have chosen one of the many fighters available, you can join the fray. The list of stars also includes charismatic characters such as ~The Rock~ or the funereal ~Undertaker~, as well as a number of scantily clad girls. If you wish, you can also create your own alter ego by drawing heavily on the extensive customization possibilities that the editor offers you. It is one of the most complete and at the same time simple to use and contributes enormously to the attractiveness of the play package. Once you have chosen who to play the various matches with, you need to decide whether to face a single match or throw yourself into one of the infinite modes present. The main mode is the ~Story Mode~ which allows you to wander around the environments surrounding the ring with a first-person view in search of an opponent to challenge or a partner for a tag match (two against two); the climb to the title will be more or less long and complicated depending on the choices you make before the meetings but, in the end, you will be rewarded with stickers which are nothing more than new characters that you can use. In addition to the main one, there are many other modes, for example, my favorite is the Royal Brawl in which an endless number of wrestlers face each other in the ring until only one remains; but you really are spoiled for choice and, just to name a few, there is the possibility of fighting using unconventional weapons such as chairs, hammers, tables, etc., one that will transform the ring into a cage and one that will it will push you to fight in unusual environments (in dressing rooms, in parking lots, etc.). The control system is immediate and allows you to perform the most complicated grips simply by pressing the appropriate key plus a direction via pad or stick. Then there is only one key for kicks and punches, one for dodging and wriggling away from holds and one for running. Given the particular situations that are created in the ring, the programmers have seen fit to insert a sort of ~lock~ function in order to always keep the same opponent under control; of course it will be enough to press a button to turn your attention to another thug and, if you really find it hateful, even to the referee. The main advantage of this game is precisely the possibility of fighting against several characters at the same time. Just think of the possibility of clashing against three other friends in the same ring and laughter is guaranteed; moreover, thanks to the editor, you can recreate characters with your features (more or less) to identify yourself even more. Even in the multi-player mode, there are many possible customizations, all to the advantage of longevity. If from a playful point of view I don't feel like making particular notes, the discourse on the technical realization is different. Although the animations are of excellent workmanship and contribute to the likelihood of the characters on the screen to their real counterparts (the movements, styles and gaits of each wrestler have been recreated), the rest certainly does not make one cry for a miracle. The polygons are not many and the textures are ~washed out~, not to mention the bad audience, really too similar to that of any Psone title, even if it is possible to see the crowd moving when the wrestlers leave the ring and go in the stands. Fortunately, the fluidity has not been compromised and there are no slowdowns even with eight characters on the screen at the same time. To slightly lift the cosmetic side of the title, there are also the sequences that show the various wrestlers entering the scene, made partly through videos and partly with the game engine, which are really hilarious. The music and effects are normal: metal or very ~pompous~ songs, the screams of wrestlers and the public and the commentary (in English). In the end, however, the real Achilles heel turns out to be the absurd request for space on the memory card to make the saves. Hold on tight: over four megs! I hope it's a temporary fad but many recently released games have huge demands on the memory required for saves. Ultimately, the game proves to be fun and very long-lasting for fans of the sport; for all the others, however, it is an excellent alternative to the usual Tekken Tag Tournament and Dead or Alive 2. In addition, it offers you a mMultiplayer mode really fun and useful for evenings at home with friends. Definitely the best wrestling game ever to appear on Sony home consoles (at least in the West). Pros: Tons of modes Super fun in four Comprehensive editor Cons: Graphics not up to PS2 Memory required for saves No Dan Peterson commentary! Official site Only Americans could invent a sport in which absurd characters pretend to fight in a ring with thousands of delirious fans following them from the stands. Of course I'm talking about wrestling! Precisely because of the high rate of spectacularity, this discipline lends itself very well to a videogame transposition, so much so that there are many titles dedicated to this singular sport that come out every year on the consoles of the moment. Recently a certain WWF Smackdown! which, after having defeated the competition on Psone (read EA), is preparing to do the same on PS2.", "date": "2002-01-08", "grade": null}