{"name": "Hitchcock: the final cut", "ref": "https://multiplayer.it/recensioni/hitchcock-the-final-cut.html", "text": "Graphics and movies Since this is a ~graphic~ adventure, at the very least we need to say a few words about the game's graphics. The basic engine is composed of two-dimensional scenes rendered in programs like 3DStudio and used as bitmaps for the backdrops, while the player and the other characters encountered are made completely in 3D. From the point of view of the quality of the seabed, it is not excellent. Many scenes seem particularly unreal due to the incorrect use of materials and the few details that could instead have enriched the settings. In particular, I'm talking about the fact that almost all the objects in the game seem to have just come out of a factory and that someone has just polished them, even if they are ropes, tools of various kinds, cutlery, plates... in short... they seem completely fake. for lack of wear. Graphics and movies On the contrary, the 3D characters are carefully crafted. They use a skeletal animation system (like that of Half Life, to be clear) which allows them to move in a credible way and without producing artifacts. The game is littered with cutscenes, some taken from Hitchcock films, and some made in some 3D program. The movies taken from the 3D animations have the same flaws as the backdrops. Little care in making the objects and characters represented realistic. The quality used in encoding the movies is also quite poor. It must be said, however, that the films often help to follow the unfolding of the plot, and those taken from Hitchcock's films always fit perfectly with the situations in which we find ourselves. Even, sometimes, our character has visions when he touches particular objects. He sees situations in which a murder victim has found himself. These are all footage too. The entire game is littered with references to Alfred Hitchcock and his films. Even some puzzles have to do with the titles of the films, or with the characters. Even the shots used in the game have been created following the director's style, leaving nothing to chance. Interface and gameplay The game interface consists of a full-screen view of the environment around us, with our character represented in 3D on this background. We directly control Joseph's movements via the keyboard, while with the mouse we can select objects on the screen and access the inventory. The interface is therefore decidedly simple and intuitive and helps simplify a game that already has a rather complex and difficult plot to follow. One of the brilliant ideas is to have implemented an inventory, menu and event log in a handheld that we can activate by pressing the right mouse button. Joseph will take care of automatically annotating the information that we gradually discover on the palmtop. Even the various objects that we collect are cataloged in the handheld from which we can select them directly. Interface and gameplay Despite being a graphic adventure (the Arxel Tribe guarantee at least 30 hours of gameplay!), there are some action parts, in which we have to pilot our Joseph in such a way as to overcome obstacles, or engage in a firefight with an assassin . These situations don't hurt and keep the attention alive even in moments when it seems that there is nothing left to do or that the plot is becoming too linear. Another interesting aspect is given by the view that is presented to us when we discover a corpse. In these situations, it is possible to approach the body and use a magnifying glass which allows us to scan the corpse in search of particular signs or objects hidden in the clothes. Package and technical problems HTFC consists of 2 CDs and a rather sparse manual, with four pages in Italian and with the key mapping and nothing more. Unfortunately the game is littered with bugs. After a few hours of playing, at some point everything starts to slow down until the game crashes completely and returns to Windows leaving us without the possibility of saving the game. At first I thought it wasof a problem with my PC, but after trying it on another as well, I had the exact same behavior. It is not a problem that cannot be solved. It is possible to save the game, exit and launch the game again, and as if by magic it will work as it should again. I trust that a patch will be released soon. Another rather annoying detail is that HTFC wants CD 1 to start the game, but then wants CD 2 instead while playing. After a 600Mb install where you copied everything from the first CD, I expected to be able to leave the second one on all the time. Music and dialogues HTFC has been completely dubbed in Italian. This is a great thing, since the dialogues are very important to follow the plot which is particularly complex. However, the dubbing must have had some problems, because sometimes the dialogues are cut or are completely missing. Luckily there are subtitles that save the day. The soundtrack isn't bad. Suitable for the setting and not too invasive, let's say a fair compromise between a musical background that shouldn't annoy, and at the same time a theme that is pleasant to the ear. Conclusion ~Hitchcock: the final cut~ is an adventure suitable for those who miss the masterpieces of Sierra and LucasArts. Although it does not have that touch of class that distinguishes the two ~colossus~ of adventures, it is still a well thought-out adventure capable of offering several hours of fun. The complexity of the plot, combined with the intertwining of the events and the visions of the main character, guarantees an average level of difficulty capable of not making those not used to this kind of game nervous, but at the same time also engaging the players ~hardcore~. History I won't go into much in an introduction to ~Hitchcok: the final cut~, as the name already says it all. It is a graphic adventure that follows the style of the great director's films. Nothing more and nothing less. The game, which I will later call HTFC, puts us in the role of Joseph Shamley, a private detective with a somewhat strange family history. His parents died in a car accident the same day Alfred Hitchcock's funeral was celebrated, and since that day Joseph has acquired mediumistic skills. While leaving for a vacation, Joseph is forced to take a job from a beautiful blonde. This girl, who is mute, lives with her uncle Robert Marvin-Jordan, a pharmaceutical entrepreneur with a penchant for auteur films. During the shooting of his film, out of the blue, all the hired staff disappear, and it is up to Joseph to find out what happened.", "date": "2001-12-22", "grade": null}