{"name": "Dragon's Lair/Mc Dog Mcree", "ref": "https://multiplayer.it/recensioni/dragons-lairmc-dog-mcree.html", "text": "Laser CDs I would like my thoughts to be clear right away: these two games are the history of videogames and therefore the conversion for PC can only be an operation of great value. Half of you will shed a tear as you review these two games and think about how long it's been since way back in 1983 (for Dragon's Lair) and 1990 (for Mad Dog McCree). This does not mean that the two conversions are made in a very bad way and that in addition to the ~sentimental~ value these two products can offer very little. Let's go in order Dragon's Lair Dragon's Lair came out in June 1983 (centuries ago), after 6 years of work. The creator takes the name of Rick Dyer and in some photos you can even see his face. The cost of these 22 minutes of graphic animation was a generous $1 million. The investment proved to be a success: more than 30 million sales in the first 40 days and 32 million dollars in the first 8 months of receipts from arcade machines in arcades. The success was colossal, the earnings very high and the popularity of the game truly sensational. The game, as everyone knows, is basically made up of a cartoonish movie in which the player has to make some moves at the right time. If the input sequence is correct the movie continues to the next screen, if a mistake is made (wrong movement or too much delay) the movie ~turns~ to the death scene of the protagonist, Dirk. The interaction is really low, but the atmosphere recreated by the cartoon is really engaging (as a comparison I like to mention Paperboy from 1984.. just to understand the technological level of the other games of the period). Dragon's Lair But let's get to the technical specifications of the game. First serious problem: the game runs in the window at a very low resolution (350*240). It is true that the window can be maximized, but the amount of data always remains the same and in full screen you see the inadequacy of the resolution of the movies. Second problem: those who buy the game to have fun will have to change their minds quickly. We're used to a really high level of player-videogame interaction and going back to playing an arcade where you just have to press the right button at the right time is really limiting (after a good half hour you'll be tired of playing it). However, I can point out a positive note: the CD includes some anthology videos that explain how the game was born and what impact it had on the videogame world of the period: a real gem for enthusiasts (a pity that even in this case the resolution is outrageously low and of poor quality). Mad Doc Mcree Another famous game, which has depopulated arcades around the world. Released in 1990, it presents for the first time the technique of Space Ace and Dragon's Lair in real movies (all supported by the power of the laser disc). Now with the DVD (well made) you can enjoy the atmosphere of a hot noon. The DVD does not contain particular extras, but considering the fact that 5/6 languages are included (including Italian) and that the audio and video quality are the same as the video CD, one certainly cannot complain. I repeat once again that you must not think that this is a usable product, but you must consider it only as an archaeological find, to be kept in your display case and shown for 5 minutes to the friends you want to amaze (and with whom you want to remember the times when you were younger). Mad Doc Mcree The main defect of this DVD version lies in the fact that, while in the original game you fired with a pistol, now you use the mouse (for the pc) and due to an intrinsic limitation of the DVD the spots in which the pointer moves are very few (in practice there will be no aiming and pointing problems, but only the timing of the mouse click). The funny thing is that the game is still very difficult and it will irritate you that even if you know where to shoot and when to shoot, 50% of the time you won't be able to do it exactly (I think it's a glitch of the support used). Conclusions What to say, ultimately? If you are passionate about Laser games and perhaps you have started your career as a gamer with one of these two titles, the offer could appear rather tempting. Unfortunately the technical realization of the two re-editions is quite lacking dfrom a technical point of view, and, especially in the case of Dragon's Lair, it does not exploit the potential of today's personal in the slightest. If you are willing to turn a blind eye to this detail, then you can find in these two titles, in addition to the many long-buried memories, still a bit of fun. If, on the other hand, Dragon's Lair and McDog Mcree are titles that don't tell you anything... if you love shooters of this genre, you'd better turn to something more recent: in this case, House of The Dead 2 could be right for you. Laser CDs This time I have to talk about two very old titles, which have undoubtedly amused and amazed a generation of gamers. We are talking about Dragon's Lair and Mad Dog McCree. Now they're back and I had the pleasure/displeasure of being able to play them again on my pc, after the images of these two games had been moved to some hidden cave in my memory.", "date": "2001-12-11", "grade": null}