{"name": "Silent Hill 2", "ref": "https://multiplayer.it/recensioni/silent-hill-13.html", "text": "The silent hill breathes A long time has passed since the release of the first Silent Hill on Psone yet anyone with a minimum of knowledge in the video game sector remembers it very well. Thanks above all to the heavy and terrifying atmosphere that the game managed (and still manages) to create. The old chapter featured a man in search of his dear little girl, who disappeared after a bad car accident that happened right on the road to Silent Hill. That's where the worst nightmares of many gamers began. Period when he used to compare the Konami product with the Resident Evil saga. Nothing more wrong! It is better to specify, for the uninitiated, that in the Capcom title the dose of action is much more massive than in Silent Hill. While in the latter what prevails most is the exploratory phase. However, both games remain two milestones in the history of 3D horror/adventure and would still deserve to be purchased by those who have not yet managed to fully enjoy them. But let's go back to the present. Et voila! Here appears the second beautiful episode of the adventures that always take place in the same dark and gloomy town of Silent Hill. Turn on the flashlight! The mystery Those (but not only) who were traumatized by the heavy atmosphere that permeated the first chapter will even be marked by the mysterious experience of this new Silent Hill 2. First of all, many of the elements that distinguished the past adventure have made their return. Even the plot, for example, has some small similarities. The protagonist is new to supernatural presences, and his name is James Sunderland (and not Bond, as many of you expected). He receives a letter from his wife setting up a candlelight appointment at their usual ~special place~ in Silent Hill. What romance, you might say, were it not for the fact that Mrs. Sunderland passed away three years ago due to a bad illness. At this moment the actual game begins. You, or James, will have to go to the prearranged place and investigate the veracity of the letter. But is the beautiful Mary (this is the name of her wife) alive or not? The first chills begin to be felt The anguish What immediately catches the eye is undoubtedly the atmosphere that forms the background during the game. In fact, right from the start, you notice gloomy, narrow and desolate settings, so much so that the player feels that sense of anguish that one could feel by actually being in the protagonist's place! The game structure is classic and simple: you have to explore the various locations and solve some puzzles necessary to overcome some obstacles such as locked doors, secret passages, etc. In this respect there are no differences with the previous chapter. The control system is very simple and effective, resulting intuitive from the first game. Interesting is the possibility of choosing between a Resident Evil style control, that is, with the character moving forward only by pressing ~up~, or between a Devil May Cry movement system, with the protagonist walking and running according to the shot. The armament available is discreet, limiting itself to a spiked club, a pistol, a shotgun and similar stuff. However, we weren't expecting weapons like rocket launchers, machine guns and hand grenades as they would have been too obvious for a game that leans more towards exploring the unknown. The air you breathe in Silent Hill 2 is cold and playing alone, at night (perhaps with the lights off) is a terrifying experience to say the least. I won't deny that I often preferred not to play in these conditions for this very reason. Anyone who is not afraid of all this only means that they have never tried SH. Unclean beings Like in a horror movie, SH2 offers a lot of blood and a lot of fear. The terrible atmosphere that surrounds the ~beautiful~ town is the result of a very hard work of programmers. Both the exterior and interior of the Silent Hill buildings offer superb technical achievement. Not only the textures and polygonal solids have received painstaking care, but also the choice of colors. These, in particular, have mostly dark shades which therefore underline that sense of horror that one feels in every situation. In the Konami title, even when you're in a room with no enemies, you still feel a certain feeling of insecurity. That is, even the situations that seemor more harmless always hide that something supernatural. And, according to myself, this is no small thing for a video game. In addition to the magnificence of the aforementioned textures and the pride of the colors, a particular applause must be made for the characterization of the digital faces, really well thought out. All thanks to the motion capture with which it was possible to exploit the facial expressions of real actors. Another note of merit goes to the realization of the enemies. These are nothing more than unclean beings born from the brilliant mind of the monsters designer (a certain Ito). In addition to the peculiarity of their shape, what is most surprising are their respective movements. For example, one could compare the movement of the classic frenzied nurse to the walk of a broken-down drunkard. Really inhumane! Alongside all these cosmetic qualities, we had to find a small flaw. In fact the animations, although very beautiful, suffer a little in the updating of the image, certified on 30 fps. Honestly, a 60 fps engine was expected, but you can't ask for everything from life. A separate discussion deserve some graphic effects such as fog and shadows. The first, really fantastic, seems to ~live~ as if it were real. Try to pass through it and you will notice how it moves in the direction dictated by the wind. Furthermore, the shadows represent the strong point of the repertoire offered by the game, contributing to the creation of an already terrifying atmosphere. Certainly in terms of mere graphic power it is not that SH2 represents a peak, also due to some other small flaws such as the animations of James (which seems a little wooden in the race). However these are trifles that only minimally affect the overall assessment of a game that is an excellent product from a cosmetic point of view. Longest eight hours ever It is true that the game resolves itself in about eight hours the first time, but it is also true that there are no less than five different endings. Also, I can assure you that the first time I finished it, I felt like time was passing slowly! This is due to the multitude of different situations in which the player finds himself. That is, there are so many things that amaze and all enclosed in that limited period of time. And then what are we complaining about? This is the average completion time for all available horror games, and often we don't have such a wide range of endings available. In the game options, the possibility of choosing not only the difficulty of the enemies, but also that of the puzzles is very welcome. The higher this is, the fewer suggestions will be granted. Nice find this. To add depth to the playful experience is certainly the beautiful plot that supports the entire adventure, with dramatic implications and strange encounters to say the least that significantly increase the thickness of the product. Even the virtual direction deserves a note of merit and has a quality comparable to the most renowned Hollywood horror films. Great Konami! When silence is a sound In SH2, even silence is a sound. These are the words of the music producer of the game. Words that say it all The audio sector of the product is at excellent levels. The music, few and far between, is very evocative and perfectly suited to the atmosphere of the adventure. Sound effects such as noises, bellows, radios, etc. they are well cared for and manage to make even the most ~tough~ of players anxious. The dubbing, in English, has its ups and downs based on the situations. In fact, sometimes the actors seem neither to feel nor to experience the actual situation in which the virtual protagonists find themselves. And when in the middle of the silence you hear your radio increasing the intensity of the noise, you should take a look in your dark room In conclusion this Silent Hill 2 could be a masterpiece if played by those who have never tried the first one ; while those who have already blasted the old chapter will be a little annoyed by the poverty of innovation which, however, is balanced by the usual terrifying atmosphere that distinguishes the mythical silent hill. Everyone agrees that SH2 is a great game not to be missed both for those who love the genre and for others who could still approach the horror game with this title (but perhaps the impact would be lethal). A must buy for everyone, beautiful or ugly. Pros: It's Silent Hill 2!!! Most terrifying game ever Five different endings. Cons: Very few innovations compared to the first episode. TOanimation at 30 frames per second The package The opening paragraph is all about the well-curated game packaging. Apart from the massive dust jacket, there are no less than 2 DVDs and a nice limited edition sticker of Silent Hill 2. The first disc contains the game, while the second contains many extras such as a beautiful ~making of~ (lasting about twenty minutes) in the original language and subtitled in English, trailers of various Konami games, an art gallery and the credits of the game. Truly a package with flakes.", "date": "2001-12-10", "grade": null}