{"name": "World Rally Championship", "ref": "https://multiplayer.it/recensioni/world-rally-championship.html", "text": "WE START WELL Once the WRC DVD is loaded, we are immediately catapulted into the world of reckless rally racing by a very long (lasting more than two minutes) FMV movie, certainly simple to make, but still able to increase our excitement towards the game . From the news spread in magazines and on the web, we already knew that Sony, very cunningly, had acquired the exclusive rights to the World Rally Championship for the next five years, which, translated into simple words, meant being able to have all the tracks, the drivers, the cars, and the official sponsors. Our abundant salivation in advancing between the various screens is therefore fully justified, as well as the desire to be able to run immediately. From this point on we seriously realize that the SCEE has not told us lies. Seventy courses, divided among the 14 nations that host the races, plus 5 special tracks for head-to-head races, are just the prelude to what awaits us once we start the engines and hit the track. Just the license to be able to access all the real data of this sport has in fact meant that the Evolutions, programmers of the game, had the full faculty of orienting themselves towards something that was as close as possible to the truth. The praises that can be given from an aesthetic point of view are infinite and one does not know where to start. The cars are very detailed, and of course there are all of them, 7 to be exact, including the various Focus, Impreza and Peugeot. As in CMR2, here too they will suffer damage which, in addition to compromising the driveability of the vehicles, will considerably change their appearance, destroying any part involved in accidents and rollovers. The tracks, albeit a little bare, are faithfully taken from those of the real settings thanks also to the use of satellite photos made to know every detail: curves, bumps and jumps present in them. Despite a discreet pop-up gripping the backgrounds, the presence of a visual depth equal only to that of Gran Turismo 3 is still impressive, which manages to show us, long before we get there, the shape of the curves to come. Each track is characterized by the presence of climatic conditions and atmospheric phenomena worthy of PS2; water and snow have never been so beautiful to look at. However, without a shadow of a doubt, the most surprising graphic component in this title is the high number of shots that can be used in the game. In fact, where others (GT3 for example) only had a couple of good visuals for racing, here the choice is vast and wide in abundance, and, incredible but true, perhaps for the first time, it doesn't bother the good health of our eyesight use the internal camera placed behind the driver and co-driver. Equally dare we praise the replays, almost indistinguishable from television footage known in this sport. The inverse kinematics system on which they pivot, in fact allow you to watch every stunt we perform from almost any possible and imaginable angle. Among other things, it is very curious to admire the driver inside the cockpit while he drives in an absolutely real way, with various gear changes and braking, and the navigator reading notes and looking at the road; with both, as if all this were not enough, made thanks to a technology called Digimask, which made it possible to scan and apply their real faces to them. SOME THINGS ARE NOT FORGIVED Unfortunately not even an alleged masterpiece such as this one seems to be free from defects, in order to be able to consider it as such. First, and most serious of all, its extreme facility. The two difficulty levels (beginner and normal) that can be selected from the start are in fact scandalously simple. If the former is therefore within the reach of any child over the age of three, even the latter is no joke, in the sense that anyone who has a minimum of practicality with this kind of game finds himself, right from the first game, constantly finishing first , or at best, at worst, second. Bearing in mind that the highest level of difficulty (in which the challenge becomes a little tougher) is unlocked only after having finished and won an entire championship (that is, 70 races!), it is natural to imagine how, after seeing so much goodness to turn in front of our enthusiastic pupils, disappointment and then boredom soon come to keep us company. In fact, the qualities of WRC suddenly seem to fade into the background as you continue to win one race after another without much merit, waiting to complete all the tracks as soon as possible. But sadlyppo the list of defects does not end here, because Sony has not even thought well of remedying the extreme ease of the game at least by inserting a good multiplayer mode, reduced here to the bone, and inserted only in some tracks that can be tackled with the 'help of splitscreen, which reduces what was trying to be at all costs a simulation, to a fun arcade experience. Thing accentuated even more by the scarce and practically useless car settings (as they are automatically ~recommended~ by the CPU before each start) and secondly by the damages that magically disappear between one race and another, making us regret the detail repair system invented by CMR2. BUT AT THE BOTTOM ~THOSE WHO ARE SATISFIED ENJOY~ Studded by a series of problems that significantly lower the final quality, WRC is in any case a game that will make many happy. Son of a trivial indecision between being arcade or simulation, it offers a constant speed and certainly higher than that of GT3 (if not perhaps in the too slow external view), and able to engage those who want it at every bend and hairpin in front of. It therefore remains in the category of good games to be bought, failing to establish itself, as it could have easily done (given the premises), in that group of titles that go down in history as masterpieces; and this, I repeat, only due to some small mistakes, which however added up, suddenly cancel the perfect structure on which WRC rests. The fact is that, unless you have the patience of an Inter fan who can easily keep you waiting for the release of Colin McRae 3, the only way to immediately have a rally is worth turning on the PS2 is to get this World Rally Championship, especially if you are so convinced that.. ~no one is perfect~. Pros: graphics and sound at high visual levels in game and in replays nothing short of wonderful all official: tracks, cars and drivers sensation of speed equal to that of the legendary CMR2 Cons: low level of difficulty a cross between simulation and arcade mode totally insufficient for two players FINALLY A RALLY Many of us have spent whole days playing on the first Playstation the only real existing rally simulation: Colin McRae 2. Unfortunately, however, in the meantime no one has been able to get their hands on something that even remotely resembled it, simply because since that day nothing equally valid has been seen on the console market. However, our unbridled and never dormant desire to rally was able to boil all of a sudden, when Sony, determined to demonstrate the great capabilities of its new hardware to the whole world, showed the videogame press the first images of a game which, together with Gran Turismo 3, it would quickly become the title that would keep lovers of the genre in suspense. Today, many months after that day, the World Rally Championship comes out with the awareness of having to satisfy the fine palates accustomed to the excellent but improvable standard of the aforementioned CMR2. These are therefore the premises with which we will judge this very ambitious product.", "date": "2001-11-29", "grade": null}