{"name": "Zoo Tycoon", "ref": "https://multiplayer.it/recensioni/zoo-tycoon.html", "text": "The animals... The fundamental aspects on which Zoo Tycoon focuses its attention are basically three: animals, visitors and economic management. As for the animals that we will gradually be able to bring into our Zoo, it will be necessary not only to create a favorable Habitat for them (that is, to recreate an environment inside the cages similar to the one where they live in captivity), but also take care of their hygienic and material needs, hiring some guardians who can dedicate themselves to this activity. The first question that arises when approaching Zoo Tycoon is essentially one: how can I create suitable Habitats for each animal, considering that there are more than 40 different types? Although the game manual doesn't offer much information on this subject, fortunately the online help offered by the game offers an important contribution in this regard. The animals... Each animal is in fact equipped with a description card in which it is described in a generic way, perhaps too much, giving us the first opportunity to know the preferences of the species: in addition, once an animal has been placed in a cage, it will be enough to read the advice offers the watchman to understand if we are going in the right direction. If we have created a cage that is too small, or we have not put enough watery soil or arctic rocks, we will in fact be able to read the animal's ~thoughts~ (he doesn't like it, he is happy, he would like less water), by accessing the summary screen. The problem is that we would have preferred to know the animal's preferences first, because in most of the times we will have to almost completely reconstruct the habitat we have created by following the few indications in the above sheet... Furthermore, to make this aspect more frustrating of the game, often the animals are satisfied only for a short period of time, after which they completely change their mind. I don't think we can speak of a real Bug, as in the end this change in the animal's mood is one of the few variable elements of the game (and I certainly don't say it in a positive sense). It cannot be denied that for the first few hours of the game, figuring out how to build suitable cages and filling them with all the embellishment objects, to then observe the reactions (light, rather than observe) of the animals is a lot of fun: the problem is that for a long time going becomes more repetitive than it should, also because unfortunately the variants that could have increased the unpredictability of the game have not been implemented (the UFOs in Sim City were definitely something else...). ...visitors, the park and money. The second fundamental aspect on which to focus our attention as Managers is, as in any self-respecting management system, that of the park's visitors: what we will have to do is not only build a Zoo tailored to them, but also commit ourselves so that they never lack for anything , from food rations to places where they can fulfill their physiological needs. At the beginning of each mission (which, it is worth remembering, always sets objectives related to the achievement of the animal happiness/visitor satisfaction/zoo income criteria) when we build the cages and extra attractions, we will have to be careful to place restaurants, Hot Dogs, Sandwiches and drinks in absolutely high numbers, as visitors will be either thirsty or hungry most of the time. Benches, litter bins, toilets, picnic tables, and to a lesser extent plants and lamps for the Zoo: this is what the Zoo, in order to gain the public's approval, will have to possess in good measure. However, although the game offers the possibility of embellishing the park with these objects, most of them are completely useless, as I have never read in the thoughts of the visitors (the only way to understand how much consensus the structure collects) something regarding the aesthetics of the park: to confirm this, I managed to complete more than one mission without having to add any of the ~minor~ objects (apart from the baskets and benches, which are fundamental). ...visitors, the park and money. However, it is a different story as regards the various attractions, each with a rating scale measured in five stars, observable through a screen that also indicates how much earnings it brings for the purposes of the general budget: it is possible, of course, to modify the prices as desired of every single element of the park, from the entrance ticket to the single Hot Dog. What didn't totally convince me is the definition of which criteria visitors can satisfy, poich if five restaurants are built, with the same economic offer and demand, it will soon be discovered that only one of these, or in the best cases two, are visited: the result is that, although a large part of the economic resources has been dedicated to the construction of food structures, visitors will almost always be hungry... Fortunately, an aspect capable of significantly influencing visitor satisfaction, and on which it is possible to intervene, is the happiness of the animals: keeping the animals happy (see above, however), means making visitors happy. Finally, as regards the purely maintenance aspect of the Zoo, it is necessary to hire unskilled personnel who will take care of cleaning the streets and the various cages. Unlike what happened, for example in the now old Theme Hospital, the staff is not differentiated by any characteristic, but only by the economic engagement: this does not contribute to making this aspect varied, giving the player the impression that whatever choice he decides to do, is still valid. Graphically speaking. Although in this genre of games the graphic aspect is certainly not essential for the success of the product (even if Theme Park World and Dungeon Keeper2 have shown how the graphics are capable of attracting even non-enthusiasts), it is worth spending a few words on this side of Zoo Tycoon. Graphically speaking. The graphics engine created by the programmers, in fact, although not excellent in scrolling (especially when there are many structures), in my view it is essential but decidedly functional, offering a 2d isometric view (more or less the same as Rollercater Tycoon) , rotatable by 90, quite detailed. Also as regards the animations the result is discreet, even if perhaps the characters (both the animals and the visitors) are too small: it is also possible to zoom in at any moment to appreciate some details. A note of praise goes instead to the interface used, user-friendly and intuitive: even the less expert player will be helped by the various summary tables created ad hoc by the game programmers. In short, one certainly cannot cry out for a miracle or a visual revolution, but Zoo Tycoon's graphics do their job: exactly, as we will see in the conclusions, what we will have to do to be able to play the title... Conclusions. Why can't this Zoo Tycoon take off? The subject matter, as already seen in other management dedicated to amusement parks, is interesting and stimulating (personally I enjoyed finding many of the animals I loved during my childhood), and certainly could have attracted a good number of players. What makes any management title compelling, capable of keeping the player's attention high even with the passage of time and missions, is the possibility that uncommon events occur during the game, which transcend the simple and repetitive task of satisfaction of the established criteria. To give you an example, already mentioned in the introduction to the article, I will remind you of the UFOs of Sim City, or the ~waves of vomit~ of Theme Hospital, or perhaps the wrath of the Gods of Zeus... Well, no one in the future will remember Zoo Tycoon for such an item. Conclusions. To make matters worse, in the game it seems that you simply have to satisfy the requests of the animals (with all the difficulties described above) and the hunger of the visitors, repeating continuously (even from one mission to another) the same, identical things: of course, as I said, it's fun to build the right Habitat for each animal, the first time. The second begins to become less fun, to turn into pure boredom in the third: add to this the desire to throw the animal out when it, after having sat down, decides for who knows why that it is no longer at ease... Carrying out one's task, which is what this Zoo Tycoon seems to carry out and at the same time ask the player, may not be enough for fans of the genre, already savvy by many other similar and better made titles. For those who instead want to get closer to management software, perhaps attracted by the undoubtedly interesting topic, could find a good appetizer for their thirst for novelty. But the main meal is something else, and can be found in the Impression, Bullfrog, Maxis and Hasbro restaurants: enjoy your meal. The history of the genblack. It is undeniable that the management genre, of which this Zoo Tycoon is a part, has always exercised a rather important fascination among gamers. Without going back in memory to the times of the Vic20 and the first compatible computers (when it was fun to administer medieval fiefdoms in Only-Text titles), the first game that was enormously successful among PC owners was undoubtedly Sim City . Over the years, this was followed by countless attempts at imitation, which gave the player the possibility of administering towers, airports, pizzerias, hospitals, railway lines, playgrounds, civilizations that have disappeared for thousands of years... and even a Dungeon Fantasy full of orcs and vampires. Some more (Dungeon Keeper, Caesar, Theme Park), some less (Pizza Tycoon, Sim Tower), all of them knew how to carve out a small space for themselves in the game library of enthusiasts: each game offered, in its own way, full management power over all aspects of the subject matter, giving a demanding but totally satisfying experience to anyone who tried to get close to it. This Zoo Tycoon is certainly no exception, and is ready to show us that administering a Zoo is as stimulating as it is fun: let's find out together if the above is true...", "date": "2001-11-23", "grade": null}