{"name": "Klonoa 2: Lunatea s Veil", "ref": "https://multiplayer.it/recensioni/klonoa-2-lunatea-s-veil.html", "text": "Ecstasy of the eyes Although the game is essentially a 2D platformer, one cannot fail to be impressed by the lush and majestic cartoonish structure of the ~full 3D~ worlds of Lunatea. The ~cell shading~ is done in a workmanlike manner and gives the right imaginative and colorful atmosphere to the title. Character animations only enhance this aspect; always very fluid animations which, combined with the pyrotechnic graphic effects and the intoxicating movements of the camera, give life to a captivating and exciting experience. You will fly from one side of the screen to the other passing over immense waterfalls, you will make huge jumps bouncing on colored springs, you will flee at full speed from enemies ready to fry our fur (by the way: what kind of animal is Klonoa? I am a cat with I've never seen ears that look like hands...). Or when through the use of a pseudo snowboarder you will cross snowy mountains, rivers and lakes Surely the polygons moved by the graphics engine are rather small and the three-dimensional structures do not show the attention to detail seen in other productions, but it must be said that on this aspect we could also overlook given the context that we want to represent: very cartoony and colorful. All environments are enriched by special touches such as books flying off the shelves or machinery that flickers with intensity in the industry level. The scenarios vary from snow-capped mountains to tropical islands, and the pure cartoon-style characters too, seem to come straight out of a Japanese Anime. Klonoa and her friends are impeccably crafted and the enemy models are beautifully diverse and unique. During one of the levels of the factory you will happen to see buildings collapsing in the background raising columns of fire as a result. Probably the most shocking special effect is that of the electric shocks that shoot our protagonist into the air in the first levels of the game  a delight for our eyes. Of course there are some flaws here and there such as the decidedly sparse shadows of the characters, which are insignificant when compared to the grandeur of the graphics sector in general. It should also be noted the implementation of the much coveted 50/60 Hz option, which will make the happiness of all those who turn up their noses at the obvious differences between the NTSC and Pal formats. Thanks Namco! Even the ear wants its part The music in Klonoa 2 is downright cute and perfectly supports the happy-go-lucky theme of the game. It is incredible how the musical accompaniment of each level flows smoothly with the atmosphere of the various scenarios and the soundtrack is widely varied. The sound effects are varied and well made and the spoken dialogues are well made and similar to those seen in Rayman 2, in which the protagonists speak ~Gibberish~ (Lunatean in this case), with completely Italian subtitles at the bottom of the screen. This adds a unique feeling to the game and makes the gamer feel part of the Lunatea world! For those in possession of a Dolby Digital 5.1 system, the cutscenes offer all the quality of digital sound between music and sound effects that envelop and involve the gamer! Play me again come on!!! Klonoa's game system revolves around a ring held by our character. This object contains the other two protagonists who will accompany Klonoa until the end. The power of this ring is to emit a tractor beam capable of momentarily trapping objects or enemies that stand in front of you. The controls are simple: a button to jump and an indirect attack to use the ring. For example, once we hit an enemy with the ring beam, we will have him in our possession. At this point you can make two choices: by pressing the tractor beam key again, you will hurl the unfortunate person using him as a weapon to eliminate any other enemies or to destroy particular obstacles. If, on the other hand, your intention is to reach a platform placed too high compared to our normal jumping capabilities, you will use the imprisoned character as a sort of trampoline: press the jump once, just press direction down and the attack key to stand out a double jump. Also if in the executiontion of this move an enemy will be under you, simultaneously with the jump you will eliminate him. The combination of these simple commands, combined with the integration of our surroundings, gives life to a more complex structure than one can imagine. Klonoa moves in a completely three-dimensional environment without the freedom of exploration granted by other 3D platformers such as Mario 64. The game scheme is mainly fixed scheme, this means that you will have to follow a pre-established path. This could make one think that it is then a trivial game with a two-dimensional structure but with a polygonal graphic system, which is partly true as the programmers wanted to make the experience less linear than a common 2d platform by exploiting in this case the third dimension in a new and original way. The path will very often be littered here and there with particular cannons, in which all you have to do is slip in and then be shot out until you reach platforms at the bottom of the screen. Your flight from one side to the other will be accompanied by spectacular camera shots and all this will be further emphasized when our character is catapulted into the air several times by firing four or five cannons in a row, while explosions and fireworks flood the screen! Spectacular! It should be emphasized that this expedient not only has the purpose of making the vision more exciting but also represents a fundamental component of the game scheme. Playing this game you will also notice that some elements have been borrowed from very famous platformers of the past: with Super Mario 3, Klonoa shares the characteristic world map and the ability to fly (like the tail of the legendary plumber!); with Nights (famous SEGA platformer) the binary path structure of the levels, outside of which it is not possible to venture; with Sonic, the speed and intensity of racing circuits! The game incorporates all these features that make it unique and terribly playable and intuitive at the same time. Longevity stands at average levels even if a higher duration would have been expected for a game of this kind. In reality, the game seems quite easy and relatively short (about 8-10 hours to complete), which could suggest a game aimed at younger people, but in reality it is not. In fact, like any good self-respecting platformer, it is full of secrets and bonuses such as 2 hidden levels, in addition to the 20 that make up the game, which can be unlocked by collecting 150 gems for each level and this operation alone will take you about twenty hours! You will also unlock a photo album drawing for each level you complete 100% plus, once you finish the main game, you will have an extra character and the opportunity to confront all the bosses defeated during the adventure. In short, there is something for everyone! So..? Unlike the various Tekken and Ridge Racer, Klonoa 2 enjoyed a longer gestation and programming time which allowed the project team a development aimed at creating not a simple sequel but something that justified that 2 suffix placed immediately after the title. Summing up, I'd say that Klonoa 2: Lunatea's Veil is an excellent platformer. Even if you are not a fan of the genre, I strongly suggest you take a look! The apparent ease and the decidedly cartoonish look must not mislead the users, since this title has a gift that has now become rare: it is terribly fun and playable! Add to it a first-rate graphic design, a sound sector that does its part and you will get the right mix that will make any platformer happy and beyond! Pros: Excellent graphic design and general sound Playability at very high levels Also suitable for non-fans of the genre Cons: Initially very easy A bit short Texture not always up to par Once upon a time there was a strange little animal... About a few years ago Namco created a very good title for Psx called Klonoa: Door to Phantomile, a good 2D platformer that showed very colorful graphics and an addictive and intuitive gameplay. However, it did not meet with adequate success in relation to its potential. Despite everything, softco giapponese didn't let the verdict of the market intimidate her and decided to bring her hyper-coloured and leaping hero into a new adventure for PS2. Klonoa 2: Lunatea's Veil will catapult you into the dream world of Lunatea and its inhabitants where life takes place in perfect harmony thanks to the four bells that control the balance between good and evil. But Alas, the fifth evil bell, is ready to ring and throw the peaceful world of Lunatea into chaos. It is up to our hero Klonoa to ensure that this does not happen, so that harmony reigns supreme. Of course the story will not be the maximum of originality, but I can assure you that the title is unique in its kind. Klonoa 2 combines RPG, platform and racing elements in a superb combination perfectly balanced and embellished by the ~cell shading~ technique, already appreciated in Sega's Jet Set Radio. From the first moments of the game, one has more the impression of watching an interactive cartoon than a real video game.", "date": "2001-11-21", "grade": null}