{"name": "Yakuza: Like a Dragon", "ref": "https://multiplayer.it/recensioni/yakuza-like-a-dragon-recensione-ps5.html", "text": "The review of Yakuza: Like a Dragon for PS5 has allowed us to return to the fascinating scenarios of the last episode of the SEGA series, which as you know has cut ties with the past from various points of view: a new protagonist has been introduced, a new main setting and a jRPG-style turn-based combat system that replaces the historic (and still very valid!) action brawler approach. It is also the first chapter of Yakuza spoken not only in Japanese but also in English (complete with lip-synchronized ) and subtitled in Italian: an element not to be underestimated for those who had always wanted to approach the franchise but were held back by the language barrier. Well, now there are no more excuses: Like a Dragon represents a new beginning for you too. The PS5 version Yakuza: Like a Dragon, Ichiban and Nanba in one of the most touching sequences of the game. Let's start immediately with the most relevant aspects of the PlayStation 5 version of Yakuza: Like a Dragon, which compared to the PS4 edition boasts some important technical improvements. In fact, there are two graphics modes that allow, at any time, to run the game at real 4K and 30 fps or at 1440p and 60 fps. It only takes a few minutes to understand how the second option is substantially superior to the first: visiting the Yokohama virtual of the title developed by Ryu Ga Gotoku Studio is much more pleasant where you can enjoy the 60 frames, and the sacrifices in terms of detail appear sincerely negligible, to the naked eye. Yakuza: Like a Dragon, one of the opening sequences in Kamurocho. Of course, it is a pity that the greater fluidity cannot be put at the service of an action combat system, also based on timing and precision, like that of the previous episodes of the series, but it is a purely personal consideration. Uploads are really instantaneous: the very fast NVMe SSD of the Sony console makes the difference compared to the mechanical disk of the PS4, there is no doubt. It is therefore really a pity that, while offering a free upgrade for owners of the game on PlayStation 4, Yakuza: Like a Dragon for PS5 does not recognize old saves and therefore forces you to start the very long campaign all over again. It's not a problem for those who buy the game now, but those who perhaps interrupted it in the middle to be able to complete it on the new console will be in for a nasty surprise. History Yakuza: Like a Dragon, the new protagonist Ichiban Kasuga. Ichiban Kasuga is the protagonist of Yakuza: Like a Dragon. Raised in a Kamurocho soapland and soon ended up in bad circles, he is literally saved by the patriarch of the Arakawa family, whom the boy sees as a father but who one day asks him to sacrifice himself for the good of the clan, taking responsibility for a murder that he did not commit. Ichiban willingly accepts, but when he is released from prison eighteen years later, he is faced with an unexpected situation: the Tojo Clan has been wiped out, the dreaded Omi Alliance has taken control of the city and his The former boss adapted to the situation, betraying his ideals and the sacrifice made by his devoted subordinate. When Ichiban asks for an explanation, Arakawa even shoots him. Yakuza: Like a Dragon, Masumi Arakawa is the former patriarch of Ichiban. Waking up in Isezaki Ichijo, in Yokohama, the man discovers that someone has treated his wounds, saving his life: it is Yu Nanba, a homeless former nurse who welcomes him into his shelter. It is the beginning of a new life for Ichiban, who tries to leave the past behind and build a future in the new city, together with Nanba but also with ex-cop Koichi Adachi and bartender Saeko Mukuoda. What Ichiban doesn't know yet it's that there's a reason he was brought to Yokohama, and the counterfeit bill someone put in his pocket tells part of the story. Determined to understand what Arakawa has to do with all this and what really happened to his old clan, the protagonist of Yakuza: Like a Dragon will not stop fighting. Gameplay Yakuza: Like a Dragon, a look at the suburbs of Yokohama by day. The new setting of Yokohama represents an interesting novelty for the series, given that we are talking about a scenario about three times as large as Kamurocho and in any case not the only location that we will be able to visit during the campaign, characterized by a duration of no less than 40 hours and an intense, engaging narration, full of twists and well-drawn characters. The traditional sandbox-style structure of the series boasts many side activities and minigames with which we can try our op (in this case Out Run, Space Harrier, Fantasy Zone, Super Hang-On, Virtua Fighter 2 and Virtua Fighter 5: Final Showdown) to collecting cans on the run, from karaoke to frantic go kart races, from batting center to shogi matches, passing through the fascinating management activity in which Ichiban is involved from a certain point in the story: for more details, take a look at our review of Yakuza: Like a Dragon for PS4. Yakuza: Like a Dragon, this is what the turn-based combat system looks like. If on the exploration and interaction front a clear continuity has been maintained with respect to the past, while proposing scenarios that have never been so broad and accessible, as mentioned, it is the new combat system that strongly characterizes this chapter, with the introduction of jRPG-style turn-based battles and everything that revolves around that approach, including the inevitable need to go around grinding when certain bosses prove too strong. Our opinion hasn't changed in recent months: it's a shame that the developers have given up on such a solid and well-crafted action system, which could be made more interesting simply by resorting to action RPG mechanics. Strategy-based duels work fairly well and can count on the great depth of the job system, with its many facets, but when you have such a well-constructed narrative in loading emotions in view of a clash, it becomes a setback not to be able to fight as in the past. Technical realization Yakuza: Like a Dragon, an evening glimpse of Yokohama. The Dragon Engine is presented in Yakuza: Like a Dragon in its best form, strengthened by a substantially improved lighting system, which finally eliminates the historical flatness of the daytime landscapes and makes the evening glimpses even more fascinating, when walking through the center of Yokohama surrounded by the signs of the premises, with the Ferris wheel spinning in the distance. The new setting is certainly the highlight of the game, and as mentioned, seeing it move at 60 fps on PS5 is a joy for the eyes (below you will find a video that captured to compare the two graphic modes), but the characters are no joke either: the polygonal models of the cutscenes are extraordinary and the detachment when you switch to the in-game graphics is not as evident as in the previous episodes, a sign that even on this front big improvements have been made. Then there is an incredible visual variety, which only in terms of types of enemies expresses dozens and dozens of different solutions, which draw from the imagination of the protagonist: Ichiban is a fan of the classic Dragon Quest, and so with each encounter his imagination transforms the very normal opponents of the moment in masked buffoons, pirates, corrupt policemen and crazy maniacs with the long coat of order. Of course, there are decidedly old-gen concessions in some aspects of the level design, see for example the dungeons and some alternative sections, but in principle we are faced with the best Yakuza ever from an aesthetic point of view: a very valid opportunity to do some virtual tourism in the streets of the most important Japanese cities, accompanied by a soundtrack that has largely already been heard but always engaging, as well as dialogues interpreted with great conviction.", "date": "2021-03-01", "grade": "8.0"}