{"name": "Victorious Boxers - Ippo's Road to Glory", "ref": "https://multiplayer.it/recensioni/victorious-boxers-ippos-road-to-glory.html", "text": "Boxing made in Japan Inserted the DVD, the first thing that catches the eye is the shortage of game modes: the possible choices are the story mode and a versus mode, that's all. In the absence of a friend to challenge you just have to choose the main mode and follow Ippo in his rise to glory. Although it may seem too little, I assure you that getting to finish the game will not be a walk having to face, in addition to the opponents, also a control system which will prove to be rather difficult but which, once mastered, will allow you to juggle great in the ring. To give an example of the complexity of the controls, the left analog stick is used both to move Ippo in the ring (strong pressure of the lever forwards or backwards), and to tilt it (light pressure backwards) or lower (light pressure forwards); moreover, starting from these last two positions, you can rotate the character to dodge the blows by rotating the lever to the right or left. The four keys of the pad, on the other hand, allow you to execute direct and hooks, while for uppercuts you will also have to press the R2 key. If you feel disoriented, don't worry, as the programmers have thought of meeting us by offering us the possibility of ~customizing~ the control system (I recommend assigning the ~lean over~ command to one of the back buttons) and the game views (there are eighteen available cameras). Boxing made in Japan Having said that we can move on to the mechanics, more oriented towards simulation but with some purely arcade digressions. In this case we are not faced with the usual fighting game where you just need to press the keys at random to move forward, since each opponent needs an accurate study phase to be able to defeat him. From this point of view we can only appreciate the work done to differentiate the various boxers: in addition to the obvious difference in appearance, strength and speed, each one has its own fighting style and different special moves that increase the already considerable variety of punches. basis. Unlike the latter, the special shots, which can be performed by holding down the R1 key simultaneously with pressing one of the attack keys, must be used sparingly as they consume the energy of the character using them, but they are of vital importance in some encounters as they allow to lay down the opponent with a few blows. But the offensive techniques don't end there; it is in fact possible to bend over and launch an uppercut straight into the jaw of the unfortunate opponent, or to perform punch combos by pressing a few keys in sequence, you'll be spoiled for choice. The lack of any graphic reference relating to the energy available and the time remaining forces you to take particular account of the movements of the boxers in the ring, which are slower when your character (or your opponent) suffers many blows, or has consumed too much power. Last round! Some disappointment comes from analyzing the technical side of the game which does not squeeze the cavalry available at all, presenting itself in a ~first generation~ guise. The characters are in fact rather angular even if covered by textures of discreet workmanship, but what disappoints most are the arenas in which the matches take place, poor in details and rather similar to each other, the presence of the public created in simple low-resolution bitmaps and the frequent occurrence of some bugs such as polygon clipping. There is also little to praise for the animated sequences, which are too repetitive (especially those at the end of a match) although they can be easily skipped by pressing the start button. Thankfully the great care taken in making the boxer animations makes up for the various shortcomings listed above. As per the script for this kind of game, the sound consists of effects that emphasize the power of the shots performed and slightly repetitive music that will pleasantly accompany you during game actions. Last round! Despite all the flaws I have to say that playing Victorius Boxers is a lot of fun: the temporary moments of frustration, when you can't find the right technique to defeat a particularly difficult opponent (I'm referring above all to the fast ones that are almost impossible to hit), follow periods of pure exhilaration when you land a nice punch combo and knock your opponent down for good. Many encounters will perhaps be excessively demanding but when you manage to trOvating the right rhythm and defeating opponents one after the other will hardly make you want to turn off the console. Although the game options are few, the game is also fairly long-lived enough to lead me to recommend it as to all lovers of more tactical fighting games, awaiting the arrival of two sacred monsters such as Tekken IV and Virtua Fighter IV. Last round! Pros: Fun! State of the art animations. Available moves Cons: Difficult control system Dated technical realization Few game options Last round! Official site Boxing made in Japan The life of the young Ippo Makunouchi is hard: a high school student with an introverted character, mocked by his classmates, weak. Until his life is turned upside down by meeting Mamoru Takamura, a professional boxer belonging to the Kamogawa gym who encourages him to be strong and fight. Ippo follows his advice and begins to train under the supervision of his friend Mamoru who discovers in him a real talent for boxing. Thus begins one of the most famous Japanese manga, ~Hajime no Ippo~ by Jyouji Morikawa, from which the anime broadcast on TV (always in Japan) by Nippon TV is taken, as well as the video game in question. As can easily be understood, the game deals with the noble sport of boxing and you, in the role of Ippo, starting from the gym you will have to be able to pass the entrance test in professional boxing, and beat a series of increasingly stronger opponents, until you become champions of the featherweights. Since the game faithfully follows the comic from which it is based, at a certain point you will also find yourself checking the other students of the gym and Genji Kamogawa himself, your coach who follows you in all the meetings, giving you valuable advice.", "date": "2001-10-18", "grade": null}