{"name": "GT Advance Racing Championship", "ref": "https://multiplayer.it/recensioni/gt-advance-racing-championship.html", "text": "Only one goal... to win! Taking a quick look at the initial menu you will notice all the classic options present in other productions of the genre and its arcade setting (at the Ridge Racer to be clear). The game includes a total of 45 selectable cars, belonging to 8 different brands, all of them Japanese: Honda, Toyota, Nissan, Mazda, Mitsubishi and Subaru among others. Each car has its own characteristics, such as the speed line, so as to guarantee you a considerable variety and consequently a good longevity. You can also unlock new cars by winning the various races in the different modes. The control system is very intuitive, the arrow keys are used to move forward or backward while the A and B keys are used to accelerate and brake. The L and R keys, on the other hand, are used to change gears manually. You will also have at your disposal 32 tracks characterized by different backgrounds and levels of difficulty, but all united by pushing the user's ability to the limit. Only one goal... to win! In fact, to be able to upgrade your car, it will not be enough to place in the top three, but it will be a must to win. The money acquired can be spent to change bodywork, wheels, suspensions and much more. Don't worry if you are a beginner, you can choose from 4 types of championships: Namely Beginner's Class, Middle Class, High Speed Class, and Professional Class. There are also two hidden modes that will be unlocked as the game progresses. One of the most positive aspects is certainly the audio behavior. Each car has its own distinctive sound, you can feel the gear shifting and the sound effects that surround the game are well orchestrated and on theme. Innovative graphics! Noteworthy is the graphics of GT Advance. Despite the small size of the screen you will be able to distinguish a Honda Civics from a Toyota Celica at first glance, and enjoy the details, reproduced with almost maniacal care. The framerate always remains constant even in the most chaotic situations and slight slowdown effects only occur in multiplayer mode. But it is precisely in this mode that the game manages to give its best, allowing you hilarious challenges with your friends perhaps on the bus that will take you to school. The cars are not made in 3D, but the dense presence of sprite frames gives the game a false 3D appearance. You will also have a good number of cinematic shots available for your replays. Now GT will always be with you! Even if you are alone, you will not miss the fun. In fact, you can start a time attack to challenge yourself, or compete aboard go-karts or F1 cars, real gems that will make you play this title for hours. The only flaw is the absence of the ~battery buck up~, or the saving via batteries present in the Japanese version. This means that you will be forced to enter 16 letters as a password each time, which compromises the fun offered by this game especially when you run out of battery you have not saved, or, as happened to me, you have written the password wrong!. Now GT will always be with you! Despite the flaw I mentioned above, the game ranks at the top of the racing games on the GBA, skilfully mixing graphics and gameplay. GT Advance lays the foundations for the improvement of titles dedicated to the genre that will be developed in the future for portable platforms that are increasingly approaching and sometimes surpassing the old albeit powerful (in their time) consoles such as the PlayStation that have been able to give us as an innovation many emotions. Pros: Very precise control Graphics to scream High longevity thanks to the presence of many modes Ability to challenge a friend in the multiplayer mode Cons: Cars only strictly of Japanese brand No saving via battery Just two words, a great title...GT Advance! Since the release of the GBA we have witnessed a real proliferation of racing games, many of which are of modest caliber. THQ has not been outdone and indeed precisely to increase the interest in this genre which has evolved considerably especially in the latest generation consoles, has seen fit to bring on the remarkable portable console of the house from the big N a racing title inspired by the ben most famous GT3 which is currently leading the rankings ofsale for PS2. The final result could not disappoint the expectations of fans accustomed by now only to the progress in the GT series and so what is presented to the lucky buyers of the GT Advance Racing Championship package is a game that fulfills the dreams of all those who wanted to savor the thrill of speed even on a portable console with all the advantages of graphics and scrolling fluidity never seen before at these levels. Merit of the very good programmers of the MTO but also of the 32 bit of the GBA.", "date": "2001-10-04", "grade": null}