{"name": "Dark Cloud", "ref": "https://multiplayer.it/recensioni/dark-cloud.html", "text": "Art of recycling? Now let's talk about the similarities that are found in the game. The ~building~ part of the title trivializes that seen in Sim City, or at least derives from those played in Actraiser and Breath of Fire. It is not enough to relocate houses and shops: the requests of the owners must also be satisfied, positioning them properly and collecting all the objects (or people) corresponding to them. From Diablo comes the random generation of the structure of the dungeons (reentering one of them it is necessary to find again the map and keys relating to sealed doors); the customization of weapons also pays tribute to the Blizzard title: you can customize them by inserting gems and artifacts that give specific damage and peculiar characteristics, you can also transform and enhance them. The management of the character is heavily influenced by Zelda, including the interface. Then there are subgames, now an integral part of the latest Japanese RPGs, such as fishing. Lastly, an infinite touch of class, some clashes are displayed as one-on-one duels: we then move on to a rhythm game structure where you have to press the keys in time to progress positively in the game. That's all. As I said before, some components blend well, others remain a bit on the surface, revealing at least questionable gameplay choices. Lazy scenographers? Graphically speaking, D.C. it denounces a discreet appearance, which leaves no room for showy tone drops or astonishing aesthetic pleasures. The main characters (us and our allies) are animated well, do not lose frames and are also equipped with good textures, richly detailed. The same goes for enemies encountered in dungeons. Less good are the bosses that you meet as you progress through the game: good textures are counterbalanced by a small number of polygons. However, the backdrops and settings are made sufficiently and penalized beyond measure by a truly annoying repetitiveness. Put simply, they are all the same: the first dungeon consists of 15 levels which, apart from the plant, are identical in all respects! The valleys to be rebuilt are very well done: houses, mills, rivers, bridges, emporiums are excellently made and full of detail. Too bad for the pop-up effect of the inhabitants who appear and disappear depending on the distance from them. The effect that the different daylight casts on things and people is also beautiful: nothing transcendental, but well made and functional. Overall, a more than honest graphic design is justifiable, certainly not in step with the latest Square productions: it is still one of the first titles presented for Ps2 back in 1999, so everything is (partially) justifiable. The audio is also normal. The score varies in heaviness from setting to setting. I greatly appreciated the arpeggios that are heard in the plain of Nolun, but as we know, here we enter the realm of subjectivity. There are no spoken dialogues as the texts are imprisoned in comic balloons. Let's play the little capitalist! Playability is a rather difficult parameter to evaluate. Let's start by saying that the title L.5 promises well at first glance: the game works, it's fun, but going forward we realize that some peculiarities have not been developed properly, significantly affecting an overall positive judgment. The life of our alter ego is based on three fundamental parameters: energy, weapon breakdown and thirst. In addition to these, it is then possible to customize our weapons at will using various gems and trinkets that raise their offense values in the most disparate classes: from the classic attack, resistance, fire, ice, lightning to other more specific ones such as anti plants, anti stone, anti birds, anti witch and so on. As in Diablo, this upgrade mechanism triggers in the player, the syndrome I dubbed, ~dissatisfied capitalist accumulation syndrome~, which pushes us to visit areas already visited in order to dramatically expand our inventory. This mechanism makes us lose sight of the real reason for the game, which is not to have everything and at all costs to guide a more armored hero than Scwartznegger in Commando, but rather to carry out a mission. Fortunately, the programmers take care of bringing the player back to earth, with means, to tell the truth, that are not very honest though. And here we return to the usury of weapons and water. These two parameters tend to reset with a frightening speed and consequently here is spending a lot of money to fill uprci of water and repair powder. Implementing these two values in this way has more the flavor of a sneaky ploy to increase the difficulty level than that of a precise choice in terms of gameplay, a bit like repeating all the bosses in succession in the presence of the final boss. Too bad because the weapon upgrade mechanism is gratifying and gives rise to decisive tactical choices (we are in a forest, what increase, the offense against plants or against animals?). It is also possible to transfer 60% of the power of one's weapon into a so-called synthesis sphere, which when implanted in a new weapon will inherit the characteristics of the previous one, useful in the event of sudden breakage or in the presence of new, more performing broadswords. During the game we will take turns in the levels with allies who will join us slowly. Each of these has its own peculiar characteristics, which will help us to unblock situations that require the use of one instead of the other. Are the dark clouds clearing? Ultimately I can say that Dark Cloud is a title that can leave those who have cut their teeth in the much more substantial titles of the genre on PC perplexed and annoyed. Trying to impress by putting as many modalities on the plate as possible, has the result that none of them has been treated with precision, always remaining at a level of generalized superficiality. Certainly all this favors those who know nothing about mana, hit points, evocations and various occultisms. In short, the neophyte is at ease. In other words we can define Dark Cloud as the most arcade RPG available for Ps2. That's all. PROS Immediacy Vastness of the locations CONS Little thickness Poorly defined graphics Inaccurate gameplay Art of sampling Dark Cloud is a frankly strange title, not because it is difficult to classify or too original and ahead of the average, on the contrary it is quite the opposite: it is the state of the art in the field of recycling and reuse, in the videogame field. If we made a comparison with music, it would be like listening to a song composed almost entirely of samples from other tracks. We all know that when it comes to video games, copying, quoting or whatever we want to call it is a common, admitted and respected practice. But here it goes much further: the Level 5 title relies in its fundamental parts on game design choices typical of other titles: which, depending on the case, are perfectly integrated and functional, other times they seem to be just means put there to lengthen soup. However, this is not synonymous with bad execution and lack of fun, but using a good presenter's terminology, I can say that too much meat has been put on the fire, so there is a risk that not everything will be cooked to perfection. The plot is bare-bones: your world has been obliterated by the usual bad guys; it is up to us, with the help of the good wizard, to explore dungeons and almost similar areas, in search of spheres that enclose parts and infrastructures of the world itself. The ultimate goal will be to defeat the usual bad guys and recreate your homeland from scratch.", "date": "2001-10-03", "grade": null}