{"name": "Myst 3: Exile", "ref": "https://multiplayer.it/recensioni/myst-3-exile.html", "text": "History A game like this rests almost all of its charm on the story so I'll reveal the unquestionable minimum, you'll find out for yourself the rest! Atrus (character already known in Myst and Riven) is a member of the D'ni, a people endowed with a rather singular power: to create fascinating worlds called Ages from nothing, writing the characteristics of the world to be generated on particular books. Once this is done, the tome itself acts as a teleporter, sending those who wish to enter into the newly born world. The game continues the storyborad started with (Real) Myst and Riven and Atrus this time he will find himself face to face with the very bad Savaaedro, who will hinder the protagonist intent on looking for the D'ni people who are trying to revive their society. The beauty of Myst 3: Exile is that it leaves you with ample freedom of action and if in one Age you fail to solve the difficult puzzles it will offer you, you can always go to another of the remaining 4 to try to combine elsewhere something good. I stop here not to remove suspense for those who are about to buy the title or have already installed it, but know that the fantastic story, combined with the engaging atmosphere that reigns in the book created by Atrus, will not detach you from the monitor before 'have completed the game. Game structure Although for many it may be superfluous to lose a good fifteen minutes for a paragraph aimed at illustrating the game mechanics of a point and click adventure, I believe that there are still newbies of the genre who may have bought a computer recently or are too young to remember the 2 prequels. Therefore, as we have already said, everything, starting from moving in another area, arriving at examining a book or opening a door, is done by clicking the left mouse button. In fact, the cursor changes shape depending on where it is ~placed~, so if you place it on a book it will change shape to show you that you can browse the tome, if you place it on the glass set in a door it will change shape into a magnifying glass to be able to see inside the house. There are, therefore, myriads of function keys, a good mouse will be enough and will advance to complete this (intricate) adventure. Fortunately, you can save when you want (without limitations of any kind) and the game structure is quite open; if you really can't understand an enigma (and here I advise you to click everywhere, do all possible experiments and minutely observe what surrounds you), surely somewhere else there will be something else you can do, lightening the sense a little of frustration that brings this genre of games when you get stuck in one place because of a damn puzzle. Despite the great difficulty of the game, the satisfaction is great every time you progress but, at the risk of repeating myself, it is very important that you are always very attentive to everything around you: paintings, drawings, strange symbols, etc. Graphics and sound The minimum system requirements settle on a P 233, 64 mb of ram and any video card with 8 mb of ram which should be enough for the needs but things are not exactly like this: the beautiful graphics are rendered so by a color palette 32 bit absent in the 3dfx Voodoo 1, 2 and 3 cards, forcing the owners of these video cards to opt for the software version graphics, decidedly less spectacular and less fluid than the one obtainable with a graphics card that displays a 32-bit. I therefore advise you to have a video card like a Riva Tnt2 (but we all know that by now the GeForce 2 Mx sell like hotcakes) to fully enjoy the graphics of Myst 3, as well as to carry out the complete installation of over 2 gigabytes ( 200 mb are equivalent to the minimum installation) to avoid more onerous loading and inopportune swaps between CDs (4 in all). Finally, Sound Blaster Live owners will appreciate the presence of the EAX audio protocol to generate enveloping audio, although still free from the Dolby Digital 5.1 obtainable from Cambridge Soundworks' best-selling DTT 2200 (and of course SB Live 5.1). Graphically speaking, Myst3 remains faithful to the tradition of the saga, not bringing (as is customary these days) polygonal graphics, textures, gourad shading and so on. The first screens will strike you with the beauty of the images, it will not really seem possible to be able to admire such an accentuated beauty of seas, mountains, plains, offices, tables complete with a portrait holder and so on. Again once you click on the object you wish to examine there will be a small pre-calculated animation when you wish tomove around the surrounding area with a simple click of the mouse and voil, the game is done. Nothing more, nothing less than the prequels. Yet Presto Studios has brought some innovations: now it is possible to rotate your gaze 360 degrees, looking at the ground below your tender feet or at the blinding sun of the lands you will visit. As for the characters, they are real actors, digitized and animated through full motion video (the technology used is the good Bink Video) and it is interesting to note that Audrey Uhler, the child had by Atrus and his company, is the producer's baby by Myst3: Exile. Much better known instead Brad Dourif who here plays the bad guy Saavedro: we have seen him appear (to mention only a small part of his television and film appearances) in X Files, Jungle Fever, The Exorcist 3 and he has even had a nomination for the 'Oscar as best supporting actor. As prizes, he obtained: the BAFTA award for the category listed above and in 1977 he obtained the GOLDEN GLOBE as best newcomer. Finally, Myst 3 is entirely localized in Italian, from the beautiful manuals to the voices (among which I recognized Angelo Maggi) and for once, I was amazed by the wonderful dubbing, at the levels of a cinematic film, TV series or anime. Heartfelt congratulations therefore to the dubbing director and the excellent voice actors! Now let's move on to the sound side, pardon, to the sublime acoustic side: the music, when present, adapts perfectly to what is happening on the screen (moments of peace, tension or reflection) and the sound effects are simply exceptional. Take a walk near Saavedro's refuge and you will clearly feel the rough sea, the wind picking up as you try to open that damned door that only allows you to peek inside. As already mentioned above, if you have a Sb Live and a suitable speaker system, turn up the volume to maximum, unplug the phone and isolate yourself from the rest of the world. You won't need it anymore as long as you play Myst3. Conclusions Myst 3: Exile is a wonderful point and click adventure that is a moral obligation to buy sight unseen. The quite affordable system requirements in times that already define my P3 933 as an old cart, the beautiful story, the atmosphere that reigns in the Presto Studios game, the fascinating graphics and sound that defining perfect is equivalent to reducing its value, they are all pieces of a mosaic that explode together in an exceptional cocktail. Unfortunately, as always happens in these cases, Atrus' third adventure is indeed an exceptional game but not for everyone: if you hate exploration games, calm and without enemies to shoot down as if they were mosquitoes, forget this review immediately. On the contrary, if you are a great fan of the saga, of the point and click adventure genre and you are not afraid of (big) difficulties, it is THE game to buy now. In the shops you will find 2 versions: the regular one with 4 CD-ROMs and 2 very elegant booklets, one used as a (classic) instruction manual and the other which will be really interesting to read for those who want to know more about programmers , about the development of the game, the etymology of many terms used for Myst3 and so on. The deluxe edition includes what has been listed so far, adding: the beautiful official strategy guide (in English), a miniature of a character from the game, a CD used for the ~making of~ of Exile and another CD with the wonderful soundtrack of the game, all this with only 30,000 lire more than the standard version! 9 Curiosity: generations compared Take a look at the evolution of graphic adventures, starting with the first Myst, continuing with Riven and reaching Exile. Enjoy!! Pieces of gaming history I've always thought that a good gamer, in the most professional sense of the term, should always be well informed on the entire videogame production, from PC to Playstation, from Sega Saturn to Wonderswan and so on. As a good console owner for over ten years, I have always paid special attention, now through specialized magazines, now through the network, to games released for gaming systems not present in my very messy bedroom. This explains how a Super Nintendo owner drooled for Doom at the time when Windows windows were about to make an appearance or for the conversion of Street Fighter 2 for the tiny 8-bit portable at homeNec, that PC Engine never imported into Europe. A few years ago a game decidedly different from the usual platform and fighting game caught my attention: a never known group of programmers Cyan an adventure like I had never played or read about it before it was born, its name is Myst. Everywhere, in the gaming universe, a new star was alluded to in the world of video games and when, some time later, the conversion for Playstation came out, I began to understand why all the fuss; at the beginning the static images and the complete lack of dynamic or impactful scenes left me somewhat perplexed but despite this I continued to play with it undaunted. It was that cocktail of evocative landscape, atmospheric sound combined with the background of the game and therefore with a convincing storyline that fascinated me. Later a new version of the game was released (with a different ending and, above all, a new graphics engine, this time three-dimensional) called Real Myst. Anyone craving a sequel to Cyan's point-and-click adventure had to wait for the official sequel (which is linked to the Real Myst ending), named Riven (complete with the subtitle ~A sequel To Myst~), also in later converted for Sony Playstation. Ten million copies sold globally later, Myst is back with us, with a new graphics engine, a subtitle called Esilio (a slavish translation of the Anglo-Saxon word Exile) and a new team of programmers, Presto Studios (authors, among the other, from Star Trek: Hidden Evil).", "date": "2001-10-02", "grade": null}