{"name": "Resident Evil Code: Veronica X", "ref": "https://multiplayer.it/recensioni/resident-evil-code-veronica-x.html", "text": "Claire in the Umbrella Corporation lair Although it is the conversion of a game that appeared a year and a half ago on Dreamcast, Resident Evil Code: Veronica X is to be considered a simple port of the masterpiece which has been judged by many as the best Resident Evil of the four produced by Capcom. Actually Resident Evil Code: Veronica X is improperly classified as the fourth chapter of the series as the facts narrated rather represent the continuation of the story of Resident Evil 2. Claire Redfield, after leaving the now desolate town of Raccoon City, sets out for the Umbrella Corporation headquarters in Europe in an attempt to find his missing brother Chris and solve a series of inexplicable mysteries. Unfortunately Claire is captured and locked up in a remote prison on an unknown island. After a wonderful CG introduction, our adventure begins behind bars in a dark prison cell. The situation certainly doesn't seem the most encouraging but you don't have to worry about it. The worst is yet to come... Resident Evil marries 3D Like it or not, Resident Evil has remained the same over the years as there have been no significant changes to the style of play and the story itself. Yet this Code: Veronica X, while not radically departing from tradition, introduces innovations that can be considered revolutionary within the series. Abandoned the two-dimensional graphics of the settings, you will find on the screen the fruit of the 128 bit power of the PS2 or the entirely 3D reconstruction of the scenarios. The novelties are certainly not finished as the game is made even more three-dimensional by the fact that the camera is no longer static but in most cases follows the movements of the game's protagonist. Another feature that makes Code: Veronica X different from its predecessors is the World Real System (RWS). Claire is in fact now able to open doors, solve puzzles, archive objects and ammunition which in the second part of the game, when we will control Chris, will remain in the same position. Furthermore, compared to the Dreamcast version, the DVD was used, a support thanks to which it was possible to insert 10 minutes of additional full motion video mainly focused on the fight between Chris Redfield and Wesker, an enigmatic character with a mysterious past. The Mysterious Charm of Zombies So much more meat on the fire, but perhaps not enough to hide the defects of age. In fact, an inadequate control system and an antiquated game concept risk undermining the quality of a title that would otherwise prove to be perfect. The level of tension experienced in wandering through the semi-deserted settings reaches unheard-of levels in some cases, so much so that it is inadvisable for the faint of heart to continue the adventure when darkness arrives after sunset. Behind every corner you can hide a zombie, an albinoid or the much more fearsome Tyrant, which you will hardly be able to escape if you are not equipped with a good amount of ammunition but above all with a cool head. The undertaking turns out to be even more difficult than in the past given that the ammunition and above all the miraculous medicinal herbs are available in minimal quantities. You will therefore have to act accordingly, trying to avoid unnecessary clashes and behaving cunningly. The classic ~dribbling~ among the zombies proves to be fundamental in the most critical situations. On land, in water and even in the sky, Code: Veronica X offers a considerable number of actions to perform and locations to visit. All this contributes to making it the longest-lived Resident Evil ever, so much so that on more than one occasion, just when the conclusion of the adventure seems close to you, you will instead realize that there is still a long way to go. Fog in the Po Valley After having witnessed the audio-visual miracles represented by GT3, Onimusha and Devil May Cry, the technical realization of Code: Veronica X may seem inadequate for the times we are running. In reality, the graphics, while not qualitatively reaching the splendor of the aforementioned titles, stand at very high levels, outclassing most of the titles available for PlayStation 2. The differences compared to the Dreamcast version are to be considered irrelevant, being able to offer this texture conversion slightly less definitive but a better use of the palette. The only visible flaw is the presence of the classic effetto fog, used and often abused where in reality it would not be necessary as in some rooms of the building. The emotion engine certainly doesn't seem to sweat too much to recreate 18-month-old graphics and for this reason it seems inexplicable that Capcom has decided to keep the look of the game unchanged. No criticism is instead attributable to the sound sector, a real workhorse of Resident Evil thanks to always appropriate and distressing music and convincing sound effects. The Bible... Ultimately Resident Evil Code: Veronica X is the best Resident Evil ever and would once again be considered the best expression of Survival Horror if the innovations that Capcom had brought to the genre only starting from Onimusha and Devil May Cry had been introduced. A non-innovative game, rather dated, but still an excellent title whose only unbearable flaw is the lack of translation into Italian of the dialogues and menus. However, I would recommend the purchase to all fans of the series (and there are many), to all those who have not played it on the Dreamcast at the time and to anyone who wants to approach the horror genre of which Resident Evil represents for the first time the Bible. Pros: Perfect conversion from Dreamcast Extremely distressing experience Good graphics Atmospheric sound Cons: Few innovations Inadequate control system Lack of localization in Italian The success of the PlayStation is testified by the 70 and perhaps more million consoles sold all over the world and by a series of unforgettable masterpieces. Among these I could name dozens but my happiest memories of a gamer are linked to one in particular. You have already understood that I am talking about Resident Evil, for some time now the undisputed leader and progenitor of the Survival Horror genre on consoles born several years ago on PC with Alone in the Dark. 5 years after its first appearance on PSX, Resident Evil returns to be talked about with the fourth chapter of the most terrifying adventure in the history of video games.", "date": "2001-10-01", "grade": null}