{"name": "This is Football 2002", "ref": "https://multiplayer.it/recensioni/this-is-football-2002_a.html", "text": "Now that's football! I hope the nice Goofy doesn't take offense at my thoughtless introduction. After all, I consider him one of the best Italian strikers and for this reason I chose him to introduce you to This is Football 2002, the most simulative football game (in the true sense of the word :) ) of all time! Sony returns to the field and does it in style with the sequel to a title that has already appeared, to tell the truth without too much glory, in the past on PlayStation. And precisely due to the lack of credit attributed to the previous chapters, the development of TIF2002 was not accompanied by excessive clamor. At least that's how it was until last E3, when Team SoHo's new game made its first public appearance with a playable version, and far from definitive, which proved to be not without its flaws... Yet that demo struck a chord sign arousing the interest of the press and even of the loyal supporters of Winning Eleven. An extraordinary technical achievement and a playability as simple as it is immediate, fueled an ever-growing interest in This is Football 2002 from that day on. But what has changed since that primitive version? This is Football 2002 and Alessandro Nesta This is Football 2002 represents Sony's challenge to the excessive power of Winning Eleven and the numbers are all there to hold up to the comparison. There are 350 teams available, divided between national teams, clubs and special formations. Among the latter, the historic ones that include the historic teams that have dominated football in the last fifty years are worthy of note. It will therefore be possible to play with the Real Madrid of records, the Inter of the 60s and Platini's Juve. Thanks to the FIFPro license there are 5000 players with their real names and for 500 of these it was possible to recreate the facial features thanks to a sophisticated scanning technique. There is also a section that allows you to change the names of players, teams, to customize shirts and flags. The game modes are made up of the now ~canonical~ quick game, friendly, national and international championships. The Italian version of the game can also count on the presence of Alessandro Nesta who not only appears on the cover and in the initial menu, but also in an exclusive interview with Bruno Longhi during which he talks about his career and confesses his passion for video games. Tonight I'm throwing... However, such completeness in terms of product presentation would not be sufficient if it were not accompanied by a convincing playability. And it is precisely in this that This is Football 2002 disappoints, at least in part, expectations. Despite the changes made to the game structure of its predecessors, TIF2002 soon reveals its arcade game soul, which would not be contemptible if the result hadn't led to something similar to FIFA 2001, even if compared to the EA Sports title, one is still possible more articulated development of the actions. You won't struggle to create avalanche scoring opportunities, thanks to some effective plays (double step and various feints) and defenses that are nothing short of ~ballerinas~. However, it is at the moment of finishing on goal that the first doubts arise. The variety of shots certainly does not represent the strong point of this game and on more than one occasion you will have the feeling that the ball kicked by your attackers must necessarily end up in the ~seven~. Added to this is the fact that there is no loading bar and that between the posts the goalkeepers do not prove to be phenomenal by often carrying out interventions bordering on the unfortunate. On the other hand, the introduction of the simulation is interesting (among other things, not a novelty) which we can recall at any time thanks to the R2 key. And it is precisely to this that the introduction of the article referred. In fact, you can perform blatant dives in every area of the field, but above all in the area, in an attempt to deceive the referee by simulating the foul. However, the match officials prove to be inflexible and in most cases will notice your ~cheating~ by showing you the much-hated yellow card. However, it remains a very folkloric option that you can take advantage of at the right time to perfect your skills as a stuntman. And in fact most of the time your opponent (human) will not notice the theft. Very funny indeed! The curve heats up From a technical point of view, however, there are very few criticisms that can be leveled at This is Football 2002. The thing that immediately catches the eye is the flawless reproduction of the players' faces, soften real photocopies of the real counterparts. The faces of Davids, Figo, Rivaldo, Beckham, Nesta turn out to be downright moving for how real they seem. Unfortunately other famous players were unable to benefit from this treatment and among them our Vieri, Del Piero and Inzaghi, who look nothing like themselves. The polygonal models of the players are instead of a good level even if the junction of the arms appears a little too low, which you will notice especially during the exultation for the goals. Stadiums and the public for once do their part effectively, showing great care in the realization of even the smallest details. The fans in the stands react intelligently to the unfolding action by standing up, waving their hands in the air, applauding, waving flags and lighting undoubtedly choreographic smoke bombs. The animations of the players who do their job without too many problems are also good. In short, from a graphic point of view This is Football 2002 outclasses every other football title available for PlayStation 2, including Winning Eleven 5. Even more positive notes come from the sound thanks to both a discreet commentary by Bruno Longhi and some sensational sound effects. Applause, choirs, voices on the sidelines perfectly recreate the atmosphere of a real match and my advice is to keep the volume of your stereo speakers high in order to relive the emotions that only a packed stadium can give. Triple final whistle Ultimately This is Football 2002 proves to be a good game, which could have been a great game if the same care placed in the technical realization had also been dedicated to the implementation of a deeper gameplay. The excellent graphics are unfortunately not enough to bring Winning Eleven 5, nor the next Pro Evolution Soccer. However, we are faced with a fun title that certainly does not aspire to be considered the definitive football simulation but which knows how to offer a fair amount of fun especially if you play with human opponents. Recommended for all lovers of the fantastic sport of football, a little less for diehard Winning Eleven supporters, for whom TIF2002 can represent an experience that is all too arcadey. Pros: Great graphics Great sound effects Fun in multiplayer Cons: Badly placed defenses Goalkeepers not up to par Lack of variety in shots ~June 30, 2002, the last act of a wonderful world championship takes place in which the strongest teams on the planet compete for the 2 places for the final. France and Italy face off for the umpteenth time in a match that for the Azzurri it also represents the revenge of the final of the last European Championship. There are now only a few minutes left before the end of regulation time in a match whose score remains anchored to a miserable zero to zero. 30 seconds from the 90th minute Albertini kicks a free-kick at the height of the puck in midfield, receives Totti who frees himself from an opponent and launches deep into Inzaghi who outspeeds Thuram and appears alone in front of Barthez. Pippo lingers, feints and heads towards the goalkeeper, tries to pass him and just before losing the ball he dives like he has never been able to do before. It's a penalty! The 2002 World Cup is awarded from the penalty spot thanks to a trick by the usual Super Pippo.~", "date": "2001-09-26", "grade": null}