{"name": "Wild Earth: Africa - Recensione", "ref": "https://multiplayer.it/recensioni/wild-earth-africa-recensione.html", "text": "We visit Serengeti National Park Today the Serengeti National Park, the Ngorongoro Conservation Area and the Maasai Mara Game Reserve, which extend as far as the eye can see along the borders of Kenya, protect the most varied and vast collection of wild animals in the entire world ecosystem and help to maintain almost intact one of the most complex migratory systems in place on our planet. One cannot be afraid to be wrong in calling the Serengeti the jewel in the crown of Tanzania's protected areas. Areas that all together make up 14% of the entire national territory: a primacy of respect for nature, this, with which very few other nations could relate. The Serengeti is also, and above all, as far as we are concerned, the national park chosen by Super X Studios to set their Wild Earth: Africa, presented as a realistic simulation of the African environment and animal life capable of encouraging, as well as entertaining , to deepen their interests in natural heritage conservation, ecology, love of travel and wild life. Under the aegis of the IGDA (International Game Developers Association) the product we had the pleasure of reviewing has won several awards in its long journey towards its actual publication and culminated after two and a half years of development on our monitors . First of all the Grand Prize at the Independent Games Festival in 2003. The unbearable lightness of photography There is no doubt that at least 90% of all the work done in recent months has been dedicated to the attempt to recreate the evocative atmosphere that the spectacular African nature instills. Already from the introductory and accompanying music the echoes of that distant land discreet but persuasive voices are made, tribal rhythms involve and fascinate while with the mouse pointer we juggle the very few options available. Immediacy. This is the watchword that must have guided the development team in defining the heart of WEA, with the sole aim of not even flashing in the player's mind that he is observing a real paradise mediated by the miserable monitor of a personal computer. The unbearable lightness of photography In fact, the game controls are learned during the first 15 seconds, when, having accepted the first assignment, the journalist who will accompany us with her voice during the different phases of the game makes her appearance (sound only, you will never see her.. .) and explains to us what our goals are and the means to achieve them. We are photographers. In the National Geographic style to be clear ... and, incredible, we are in Tanzania to take pictures. Forward, backward, right, left, zoom and click. That's all: we will simply have to try to photograph the subjects that hand by hand along the continuation of the mission will be indicated to us: trees, plants, natural phenomena, landscapes, but above all animals and their behavior. Zero difficulty, maximum satisfaction We found the difficulty level to be close to absolute zero. The tasks will be carried out in strictly chronological order, the minimum primary objectives to be achieved have no time limit while the secondary ones are located a few meters from the main one. energy, in the form of an indicator of the level of interference with the ecosystem, is the only brake on our running freely between the jaws of a lion and the fangs of a cheetah. In any case, animals, however ferocious, cannot harm us in any way and, to restore the energy level above the safety threshold, it will be sufficient to hit a couple of secondary objectives without too much effort. So, in light of all this, why would we have anticipated WEA as a pleasant surprise? Well, WEA is an educational-contemplative game of rare beauty. With all the filters activated it's a real pleasure for the eyes. If it is not the landscapes that amaze (we would have appreciated more care in painting the skies of Africa and in characterizing the roughness of the terrain with a more decisive attitude), it must be recognized that the animal models have something realistic and poetic at the same time. Elephants, hippos, giraffes, crocodiles, vultures, ostriches, flamingos (let us know if a shiver won't run down your spine when, in the helicopter photography tour level, you will find yourself witnessing a flock of flamingos take off and fly from the inside...) and so on and so forth... Zero difficulty, maximum satisfaction All their action is scripted beyond belief and this will greatly lower the possibility of playing WEA again once completed. In other words, you will be faced with an interactive documentary whereeach of your photos will correspond to a comment from the journalist and an unspecified naturalist, your traveling companions, who will diligently explain to you the reason for some eccentric behaviors of the strangest animals, will emphasize their different habits and will describe you, often irreverent, their living with rare sagacity mixed with lightness. Being lazy Leaving aside our sick mind that always and only records goodies of this kind, it must be recognized that WEA perfectly achieves its goal. Beautiful, evocative, reassuring: a title that focuses more on experiencing and knowing than on acting. Of course, we are from Multiplayer.it, we play Gears of War, World of WarCraft and Command & Conquer. At least we would have liked that a minimum of strategy was needed to conquer the most daring photos of a feline hunting session or that there was a gap in the enhancement of the archived images according to the characteristics of the photos taken. Being lazy Hitting the lens well in the camera, capturing one nuance rather than another of an animal's intimacy, being rewarded for having impressed particularly rare subjects on film (see the scoring system attributed to photos in games such as Dead Rising for Xbox 360 ) should have been decisive for a decent completion of the assignment. On the other hand, although made with approximation, the idea of integrating the photos taken in each level with a similar article, web format and viewable via a default browser, which explores the immortalized topics as well as indicating various links for those who want to know, is very nice really more. System requirements Minimum Requirements: Processor: 1 GHz CPU RAM: 256 MB Video Card: 3D 32 MB DirectX 9.0-compatible Disk Space: 1 GB Test Configuration: Processor: Intel Pentium 4 3.4 GHz HT RAM: 1 GB Video Card: ATI -RADEON 9700 Mobile Conclusions In short, a delicious but incomplete game aimed certainly not at hard-core gamers but at all those who still enjoy the great miracle of life, the innate attention of a mother for her puppies and who suffer from yet another egg stolen from the own nest from those unbearable hyenas (we've adored them since the days of the Lion King). Feel free to add a percentage point to your vote for each year you are missing from reaching the legal age to have a moped: playing WEA you will learn a lot of new and interesting things and your imagination will travel beyond the equator to that dark continent, so much far away, which was once the cradle of life and is now the palette of colors of inestimable beauty favored by the gods. Pros Excellent animal models, like many of their movements Artfully recreated touching atmosphere The possibility to know more about our dear old friends: the pangolin, the procavy and the zorilla! Cons Disarming simplicity of play and zero challenge Scenarios scripted as we have rarely seen Linearity and very little variety of objectives We visit Serengeti National Park The only living beings that seem to belong to it intimately are the Wild Animals. It is as if an awareness has emerged among the animals of Africa that humans have not yet achieved. Laurens van der Post, Venture to the Interior, 1963", "date": "2007-03-16", "grade": null}