{"name": "Soldier of Fortune", "ref": "https://multiplayer.it/recensioni/soldier-of-fortune-5.html", "text": "History John Mullins, a mercenary in the service of the international peace forces (but I think he also centers a kind of organization called The Shop), will have to thwart the plans of the usual megalomaniac super villain, determined to conquer the free world as tradition dictates with the threat of nuclear warheads (and so intelligent as to know that those cunning world heads of state have not understood that, wanting to conquer the world, he would use one of his nuclear missiles at most against roccacannuccia). Starting from a simple attack by a neighborhood gang on a subway in fact, ours will find himself entangled, accompanied by his faithful companion Hawk, in a web of sabotage and sophisticated plans, starting with the discovery of a first missile stolen from a military base and transported on a train in Uganda to a freezing Siberian bunker, sightseeing through a gang war in New York, a heavily guarded city in Iraq and a tech superoffice owned by the Yakuza, a Japanese mafia made up of ninjas and assassins heavily armed. The first impact The first terrible impact. In fact, as could be expected, it will take some time - especially for those who have already tried the game on PC - to get used to controlling the character with the pad and, if initially it will be difficult to extricate oneself from the commands, even going forward it will be almost prohibitive to try to accurately aim and try to disarm your opponents, just as it will be difficult to correctly perform some simple moves such as going down the stairs located throughout the levels. On the contrary, from a technical point of view the game does not disappoint and, if the sound offers us nothing more than classic music (more than) suitable for a war scenario and sound effects most of the time, between inhuman screams and gunfire , really well done, even the graphic part features excellently animated characters and settings covered with very detailed textures. The good points... Personal tastes aside, I think that any gamer can find a very playable title in Soldier of Fortune and even now, having also tried this conversion for the Dreamcast, I can only confirm my opinions. Furthermore, the presence of three difficulty levels (perhaps even better calibrated than the 5-6 choices available on PC) ensure the game a great longevity, as well as a desire to repeat the experience with a higher level of challenge. Finally, I think it is enough to say that the variety of weapons combined with the fun caused by being able to hit the enemy in more than 20 parts of the body make the game a truly unique experience, at least for first-person shooters. ...and the negative ones With virtually no graphical glitches, aside from perhaps somewhat crude modeling of some vehicles parked on the street or clipping in crowded areas, SoF is one of those games that, while without minor glitches, are plagued by at least a couple of glitches much greater in scope. However, being able to overlook the absence of a multiplayer mode and the almost total lack of bonuses, the most serious flaw of the game emerges in the fact that it has divided the levels into many small stages which, in addition to breaking the rhythm of the action and forcing the player not being able to recover the objects left behind, make us neurotic due to the very long loading from level to level, capable of lasting for almost more than a minute. In the end... Having spent perhaps too much space to talk about one of the latest Dreamcast flagship products, I can only recommend it without hesitation to everyone without beating about the bush and of course, agree that we are facing a must for all shooter lovers. Pros: Good level conversion Excellent technical realization Long to finish ... Cons: Difficult control Music sometimes subdued Finally (applause, please) it's here! Soldier of Fortune, the acclaimed first-person shooter landed after a discreet wait directly from the PC to the Dreamcast - as well as with an upcoming conversion on PS2 - has finally managed to bring to the now unfortunately semi-defunct Sega console a shooter worthy of replacing the definitive one (although all DC owners are still keeping their fingers crossed (yours truly included, hoping for some miracle) canceled Half-Life while contending for the throne of best shooter with the highly decorated, albeit structurally different Quake 3 Arena and Unreal Tournament.", "date": "2001-09-07", "grade": null}