{"name": "Druuna", "ref": "https://multiplayer.it/recensioni/druuna-le-nuove-forme-dellavventura.html", "text": "The labyrinths of the mind However, exploring Druuna's memory will be far from easy. In fact, by connecting to the Brainholder we will have to take control of the girl within her memories and it will therefore be us, through our choices, who will make Druuna relive, little by little, fragments of her past. The connection, in addition to exhausting us (this is the reason that forced Doc to abandon the study of the girl), will produce a great expenditure of both physical and mental energies on the part of Druuna who, following too strong or prolonged emotions, could even reach to die thus making useless all the work we have done to get to the bottom of the mysteries that surround it. In order to keep the girl's health under control, we will be able to rely on the Brainholder who, through continuous monitoring of Druuna's vital parameters, will inform us of any changes in the girl's vital values; in particular, it will keep us informed on the data relating to global brain activity time (our connection), nervous tension, cognitive restructuring effort and cardiac activity. The labyrinths of the mind Too high values of these elements will also affect the visual and audio elements of the game; for example, in the case of cardiac fatigue we will hear the noise produced by the girl's heartbeat increase, while in the case of a critical increase in other works we will see colored lines, pixels or matrices buy on the screen elements used to simulate the Brainholder's difficulty in remaining connected to the girl's mind. The attention that we will have to have towards these factors will have a significant impact on the game play of the game as we will have to be careful not to continue randomly through the levels (the more one remains in Druuna's memory the more her body gets tired), not to run in a rambling way for the scenarios (bringing memories to the surface too quickly exhausts our guest) and also not to save too much (the memory of a human being is limited it is not possible to fill it with too much information without causing problems or damage.) . The images of memories The images that we receive every day then become our memories and the facts that have struck us most remain impressed with greater intensity. The same goes for Druuna's memories. In fact, in her ~little head~ we will be able to come across both vivid memories, in which we will take control of the girl trying to guide her through a thousand dangers, and in recollections that will lead us to the knowledge of terrible and dreamlike events without being able to interact with them in any way. Let us now analyze the ~invoice~ of the girl's memory. First we notice a different technique used for the realization of backdrops and characters. While the world that forms the backdrop to our adventure is made up of pre-rendered elements, Druuna and the other protagonists of the game are created in real time on 3D graphics integrated with motion capture animations and character skinning always in real time. This different implementation choice sometimes conveys a feeling of imperfect ~fusion~ of the 3D characters with the surrounding environment, also presenting us, in some points of the game, Druuna's antagonists intent on ~sliding~ on the ground instead of walking on it. Movement problems also characterize our darling. The control system adopted to maneuver its movements will not always be precise, causing many problems in the game sections in which we will have to make jumps or similar evolutions. Even visually Druuna appears a little awkward and tied up in her movements... a factor that completely disappears within the numerous videos that make up the game. The images of memories As we continue in the adventure we will in fact be cheered by almost an hour of full-screen movies that will allow us to fully understand what happened to the poor girl and her sick world (which we will discover devastated by the spread of a lethal mutagenic virus dominated by a disturbing para-religious caste called ~The Priests~). In addition to serving as interlude scenes between one memory and another, the movies will also appear in conjunction with the discovery of certain objects, in response to our actions (including those that will lead to a premature death of Druuna) and will be used to allow us to communicate with the other characters in the game. The interaction with the latter will in any case be limited and consist solely of the classic possibility of making a choice between a set of rispredefined multiple stakes. If a speech is conducted correctly, it will be possible to continue with the movie and then with the game, while in the event of a wrong answer we will see an animation showing the departure of our protagonist. In some moments of the game the movies will also form an integral part of the game-play; warned by a sound signal we will see ourselves engaged in partially taking control of the animation we are witnessing, therefore having to make Druuna perform simple movements (as happened in laser games like ~Dragon's Lair~). Worth noting is the excellent fluidity of the full-screen movies which only encounter in some moments (but perhaps it is a consequence of the editing technique used to maintain a good frame rate) in small slowdowns between one video segment and the next. A flaw, on the other hand, is the lack of rapid synchronization between speech and lip movements present in some (few) videos. The winding paths of memory. Let's now analyze what we will have to make Druuna do in the world around her. Our primary purpose will be to find a special serum for our boy to take in order to alleviate the suffering induced by a lethal disease with which he has come into contact. To recover the vital object we will have to face labyrinths, monsters and dangers of all kinds... but in a slightly different way from what the heroines of Tomb Rider and similar have accustomed us to. In fact, unlike them, Druuna does not shoot, does somersaults and does not beat her hands... she is a meek and frightened girl who, at best, runs wildly or jumps over obstacles. This choice to characterize the protagonist of the game in this way, also made in order not to distort the character of Serpieri's paper work from which it is taken, despite being interesting, often leads to a certain frustration and boredom in the continuation of the adventure. Not being able to fight or oppose the enemies in any way (if we run into one of our antagonists we can only watch the movie relating to our departure) we only have to explore the labyrinths and look for the way to move from one section of the game to the next, making occasionally, a bit of jumping on various platforms. The presence of puzzles would have greatly increased the longevity of the product, partially making up for the lack of action, but even in this respect the difficulties in which we will have to ~use~ the brain will be very few and limited. The element that pushes the player to continue in the adventure is above all determined by the plot, enthralling and full of twists and turns. A selective world Only the strongest and the smartest survive on the world of Druuna, the selection made by the sick nature that inhabits it is ruthless... as far as the game is concerned, however, the selection is made by the target to which it is addressed. Druuna is not an ~action adventure~ a la Tomb Rider and it is not a ~brain racking~ game, it is an adventure with a good story and a decent technical implementation... a product aimed at those who want to enjoy a game without going crazy to understand the function of the various keys or to configure complicated menus; a product suitable for those looking for an alternative to the ~frenetic nature~ of the titles currently on the market or for those approaching a PC game for the first time and want to discover the charm of a comic story transposed into a multimedia product . I also remember that the game is totally localized in Italian (spoken, written, manuals,...) and that it can boast of being the only product (in my memory) to have TXH certified audio, which will allow us to enjoy a soundtrack of great level and impact. Memory 0, accessing.... From Doc's diary: - ~Day 20... from the acquired memory fragments (very few actually), I deduced that Druuna's world was, or is, a dangerous and disturbing place, where the law of the strongest, the most cunning. A labyrinthine city divided into various sectors, which develops on different levels...~ - Day 26The powerful machine called the Brainholder, to which Druuna is directly connected, works! It allows her to relive her past. The fragments of memory , however, they are still insufficient. Furthermore, the memory reconstruction sessions must be short, otherwise the consequences could be fatal...~ These few mysterious words will be all the information that will be made available to us at the beginning of our adventure. For some unknown reason we have come to a remote and forgotten laboratory where, lying on a strange bed and connected to disturbing machinery, we find aa beautiful and buxom girl. The curiosity to know who the gentle damsel is and why she is in that state will lead us to use the computer that seems to manage the laboratory, a tool that will also make available a series of recordings that will form Doc's diary, a document that he will provide us with some more information about our guest who we will discover responding to the name of Druuna. Thanks to the information left us by our predecessor (whose end remains unknown to us) we quickly acquire the basics to use the ~BrainHolder~, the complex equipment that seems to keep Druuna alive. Furthermore, this tool, again based on the news Doc left us, will also allow us to make a connection to Druuna's brain in order to view the girl's memory in order to try to understand why she is currently in that semi-vegetative state and how it is possible to bring her back to a normal life.", "date": "2001-09-05", "grade": null}