{"name": "Baldur's Gate 2 - Throne of Bhaal", "ref": "https://multiplayer.it/recensioni/baldurs-gate-2-throne-of-bhaal.html", "text": "The wise Alundro sayeth.. The events of Throne of Bhaal therefore begin a few months after your victorious confrontation with Irenicus and the narrator warns you that other of the most powerful sons of Bhaal have begun to take your story to heart ... remember: the throne of Bhaal it cannot remain empty for much longer. I could say more, but after what happened in the previous preview (where I ~accidentally~ revealed the name of one of the new characters that will be able to join your party. Forgive me but like other sites I innocently made the mistake of not judging what happens as soon as ten minutes after the game starts a twist) is best avoided, plus the screenshots alone are enough for the purpose. BG2 can therefore be played in two different ways: the first consists in reliving the main story of BG2 with the additional possibility of visiting the Watcher's Keep, the new optional dungeon included in the expansion. The second way enables the new story areas of Throne of Bhaal. You can either start a new game or import from a previous save, in which case your characters will automatically be promoted to 2,500,000 xp, so you'll want to use your BG2 ~final-save~. Due to the lack of precise information about it, I assume that once you finish BG2 normal you have to manually start Throne of Bhaal, the latter being the final chapter and not a simple addition like Tales of the Sword Coast was. So what's new? In addition to the usual new monsters and spells, we find the equally usual new arsenal of weapons (some of which can be upgraded). But there's more! As the unfortunate readers who had time to read the preview will know, in TOB due to the almost virtual elimination of the experience cap (which will now be fixed at the 40th level) particular special abilities have therefore been implemented for each class, privilege of ~high levels~ of AD&D. Wizards will be able to benefit from some particular spells such as meteors or dragon flames that only affect the enemy and not the party, warriors from skills such as the Whirlwind Attack which increases the number of attacks per round to 10, clerics, on the other hand, will be able to summon extremely powerful as the Devas (Dark Devas in case of ~bad~ clerics), etc etc. Even the ~romances~ have their own continuation in the expansion, with developments that rival even the small Sapphic experience of Ultima 7 Part Two! TOB will also reward the most ardent fans of the series who have brought in their inventory for both games, apparently some of the most useless objects (namely the famous ~pantaloons~) with a fun easter egg! Bhaal's throne won't be empty much longer! Moving on to the actual game, the Watcher's Keep dungeon continues the tradition inaugurated by Durlag's Tower, the best dungeon ever in Baldur's Gate 1 for the simple reason that it was the only one to offer some enigma in which one really had to think (while all the other dungeons in the game were forced sequences of fights placed there just to delay your confrontation with the ~end of level monster~). And therefore also in the Watcher's Keep you will have to deal with puzzles of various kinds and you will therefore have to pay attention to the various books and documents that you will find around for their important clues. One enigma in particular is suspiciously taken from Ultima IV (released more than a decade ago): does anyone remember the Book of Truth, the Candle of Love and the Bell of Courage besides me? Let's hope it's a dutiful tribute (and in case Bioware should be honored) to the Ultima series more than a plagiarism... The ~main quest~ instead leaves me highly perplexed... It's strange to think that Bioware has chose this path to conclude the Baldur's Gate series. As many have said Icewind Dale was to Baldur's Gate as Throne of Bhaal was to Icewind Dale. From this ratio you can immediately understand that in addition to the fact that Throne of Bhaal equals Icewind Dale squared Baldur's Gate, that Throne of Bhaal is VERY combat-oriented. In some points it seems to play any Final Fantasy, with long sequences of dungeon crawling designed only to open the way to the sound of fighting before reaching the end of the dungeon where the object of your search will await you in the company of course the ~boss ~ to protect him. And as in any self-respecting ~good~ Japanese CRPG, enemies will often invent the most absurd excuses to start fights with you. Really strange. Fortunately the story is enoughgood enough to keep interest alive, given that between one ~end-of-level monster~ and another, interesting details will be revealed about your nature and the divine blood that flows through your veins. And if you've played the previous games, of course what more could you ask for than answering the various questions we've been asking ourselves over the years? Also in the game many of the quests can be solved in a sadistic and evil way for your personal satisfaction. The ending is perhaps a little obvious, since anyone can imagine it, after all, as the introduction says, ~the throne of Bhaal~ cannot remain empty for much longer. Moving on to the translation, I found it to be of more than fair quality (the usual blunders are not lacking of course), the only notes that can be made go to the voices of the characters. TOB like many other games of its kind suffers from having little variety of voices, as it is understandable after a while they will all look alike (since there are few voice actors). Also all seem to be recorded from the output of a radio: they seem to come from a very distant place and suffer from a strange canning effect (well you will know when you hear them). It goes without saying that the various voice actors are perhaps ~afraid~ of using dramatic tones when the situation requires it and often their interpretation will be a little forced. Sound and graphics, on the other hand, are at the highest levels, judge for yourself with the images, and trust me as regards the soundtrack (but in this field BG has never disappointed). In conclusion... ...Baldur's Gate 2 brings no big revolution, nor did anyone expect it. What it offers us is a further dose of the proven gameplay of the series, perhaps a little too prone to fighting. Therefore any advice is useless: if you are a fan of the series, you will have already made your decision, regardless of whether you appreciate its combat system or not. As already mentioned, if you have played the past episodes, could you really think about leaving the last chapter alone and remain in the doubt of never knowing how it ends? Otherwise, if the previous considerations are not for you, you just have to reflect on your degree of tolerance of the fights. Part of the fun offered by Baldur's Gate comes from these themselves and from seeing your character reach godlike levels (ooops, but you are already a demigod ..), while it is known that the story has never been one of the strong points of the series (at least in comparison to artistic masterpieces like Planescape Torment, the quintessential existentialist CRPG). Ultimately, the choice is truly yours, it being understood that we are still talking about a game of a certain class and craftsmanship and therefore it all boils down to simple personal preferences. Fighting or conscientious objection? I think that's enough now... another great series that for better or for worse will remain engraved in the history of video games has ended. Now it's time for new heroes and new adventures! The art of RPGs Judging a computer RPG is never an easy thing. The Computer Role Playing Game is a transposition from the printed version, and as such it is one of the few videogame genres that has not been built and imagined with the limitations of the machine in mind. The magic of the paper ~RPG~, understood as a role-playing game of one's own character in a fantasy context, is made possible by the master's ability to react to any circumstance, while as we know in their electronic counterpart, they do not they can deviate from the tracks that the game designers have set. For this reason, over time, various ~currents of thought~ have developed on the subject, among the most ~important~ there are those who see the CRPG as a game that should allow the player to behave as he sees fit in a world that may give him the illusion of being ~alive~ and others that put their focus more on fighting and character growth. So, should we reward CRPGs that offer many ways to solve the same problem or those that offer many ways to kill the same enemy? ~Anyone who knows me knows~ that my answer is the first, if only because after all we are talking about games of interpretation and that a magician and a warrior ~could~ have different ways of acting when faced with the same problem. Baldur's Gate is the quintessential controversial example - I remember when I first saw his images and read about what the game should be. It was supposed to be the ~second coming~ of the Messiah (whose first coming would be that of Ultima 7)!But many of those famous promises were not kept and there were those, like me, who were disappointed, seeing BG1 as a sort of ~false prophet~. Some may think (and have thought) that I may be ~biased~ in judging Baldur's Gate, but if there's one thing I can't deny it's that I criticized him because like everyone I wanted the series to benefit from the improve the parts where it was defective. Such as, for example, offering greater interactivity and perhaps even a gameplay less focused on the indiscriminate genocide of enemies. Baldur's Gate 2 was undoubtedly a huge step forward from the previous one! Indeed there was an attention to detail never seen before, not to mention that many of the quests had different ways to be solved depending on your particular alignment ... all things that just satisfied a guy like me. Unfortunately in the final part all this attention fades and we go back to the good old massacre. Not that I was looking for beholders or mind flayers to have interesting conversations with but for one thing, the game designers could have done better what is perhaps one of the ~wonders~ of the fantasy world, namely the Underdark. One cannot therefore fail to notice a certain haste in the realization of the second part of BG2, after the tremendous detail dedicated instead to the capital of Amn. After this long excursus, I hope you've got an idea of my attitude in the world of role-playing games and I'm now going to report my impressions on what is the last chapter of this famous saga. Understanding that a review is nothing but the voice of a person's particular opinions and I who could perhaps say that I have at least played almost every CRPG that has ever been produced by mankind, I am however only one voice among many..", "date": "2001-07-30", "grade": null}