{"name": "Castlevania: Circle of the Moon", "ref": "https://multiplayer.it/recensioni/castlevania.html", "text": "DRILL MY HEART... BUT WITH SWEETNESS You are Nathan Graves and you must destroy the revived Dracula and his priestess Camilla before they acquire devastating power. You are in their abode, your mentor has been imprisoned and will be addicted to the evil one; take the whip invoke your determination and nothing more until the last fight. Strange movements of fate, unexpected evolutions, deep shadows will be your traveling companions in a forest of grotesque creatures who will try to reduce you to impotence at every step. But who cares: the wind of devotion to the cause blows in your heart, your whole life is dedicated to eradicating the evil from the earth, and now you have to act, until the end and you know how. This is the game and these are the rules: the choice is yours. We are faced with an Action Game with multi-directional scrolling, solid, programmed with stability and experience. You will see smooth and overlapping scrolling, excellent command response, no bugs or flickering and this already says a lot. The backdrops have been treated with great care, infusing evocative atmospheres. Undoubtedly the sprites that regulate the characters will not make you cry out for a miracle in terms of fluidity, but this is part of the philosophy of the game which is not focused on speed, on the contrary, it transmits a certain heaviness and composure of the movements. You will have numerous slots available for saves that take place on cartridges, a very detailed character sheet that will slowly evolve thanks to the experience levels achieved and objects collected during your crusade. It will be a long, demanding but not frustrating adventure: you will have to retrace the areas of the gloomy castle several times, as you obtain new skills, but don't fret too much because with the SELECT key you will have access to the map of the places traveled at any time. GIVE THEM TO THE UNTORE DALLI The Action vocation of the title is evident at all times, yet I guarantee you that there are notable variations on the theme that always make the progress of the game a pleasure. From the outset you will be accompanied by the DSS system which allows you to activate special abilities via the LEFT button: during the game you will collect cards which, combined two by two, will be able to infuse you with special powers, drawing on psychic energy (the MP bar under the life force). Your strenuous efforts will be rewarded with magical items that will introduce you to new permanent abilities. In addition to the whip (extension of your thirst for purification), many weapons can be thrown. Bowls, flasks, medallions, gloves, hearts, chickens, armor, all sorts of trinkets await you every time you destroy an enemy or a light source. Everything can grow, from the vital energy to the number of weapons that you can hurl against the treacherous followers of the satanic (but they allow us to play...), just advance in the sacred quest. The sound vibrations will accompany you faithfully, some motifs stand out above the norm, but you will not be able to hear the voices of the participants; the advice is to equip yourself with headphones, so that you can enjoy the majestic stereophony that animates the game SAVE YOUR SOULS The purchase is also recommended because the game is filled with rooms where you can save your progress, making it easy to progress through the maze of the Lord of Darkness's mansion. You will also be driven by a pleasant determination to continue, boss after boss, hall after hall, letting yourself be captivated by this exciting adventure. On your way you will meet some magical passage that will allow you to transport yourself easily between the various areas of the boundless castle (actually there are few, but better than nothing). come on! Go and get this pearl that will give you many hours of play. Congratulations to Konami who has produced an accurate work (also considering the good manuals even in Italian), giving new elements of innovation to a classic genre: the need for a game like this was felt. Pros: Excellent technical realization Varied and long-lived Challenging Cons: You have to retrace the same settings many times Sprites and animations that are not excellent Useful links Nintendo Game Boy Advance Halifax Konami I heard a sinister howl Humanity has long been trying to eradicate the plague of dark vampires who seek to zombify the globe and always seem to succeed (or so we are told in movies, books and video games). The Castlevania epic has long since begun and like everyone has had its ups and downs. The gaming community was waiting for this title to see if it was time to recover for the coat of arms of the Japanese vampire slayernico. From now on I gladly say that this work is one of the best releases for the Game Boy Advance.", "date": "2001-07-21", "grade": null}