{"name": "Fuga da Monkey Island", "ref": "https://multiplayer.it/recensioni/fuga-da-monkey-island-2.html", "text": "The return of Guybrush One of the strengths of MI is the temporal continuity: a sort of soap opera played, each chapter starts from where the previous one ended, often complete with a summary of past episodes to make it playable even for newbies. Escape from Monkey Island is no exception, opening with a good FMW on which the story is introduced by means of the game's own characters. After countless journeys and paradoxical misadventures, Guybrush Threepwood, the undisputed protagonist of the MI saga, had once again emerged victorious from the battle with the tormented soul of Le Chuck, his longtime antagonist, and had finally realized the dream of his life. : marry Elaine, the beautiful governor of Melee Island. The adventure picks up from here, and more precisely from the return of the two lovebirds from their honeymoon. At the end of the movie, the player immediately takes possession of the controls and immediately finds himself grappling with the first of a long series of problems: freeing himself from a rope that binds him and defeating the attacking pirates. From the very first minutes of the game, one is therefore involved in the narration, comforted by the fact that Guybrush has remained as naive as ever and that, as usual, to solve the problems he will get into, once again it will be necessary to abandon any pretext of rationality, instead relying on our dementia and our instinct. The main dish will therefore be represented, as in the old days, by the insaneness of the situations and the puzzles: the only rule to move forward is to try the most improbable path and expect the unexpected. The progression of the story has the same gait that made the success of the series: the first puzzles are always well defined and clear in purpose. As one progresses, an increasing number of possibilities open in front of the player, however only one of many will be the solution that will lead in the right direction. Fortunately, there are not many cases in which one comes across blockage situations, in which one absolutely does not know what to do. The precise and meticulous exploration of all the locations is in fact most of the time able to bring to light all the elements useful for continuing the game. The difficulty is therefore dosed in such a way that only those who are not used to this kind of adventure can sometimes get involved in boring and long moments of stasis. In situations of this case, however, the supported saving system is very useful, which enables the player to interrupt the game session at any time and wherever he wants, without having to take into account the number of times it is played. Places, faces, situations, jokes: nothing seems to have changed since 1990. Among the numerous new characters present, there will obviously be already familiar faces, such as the Voodoo sorceress, the pirate Ozzie and the legendary Carla, master of swords from the first episode. As in the first two chapters of the saga, even in the latter there is no shortage of fearsome duels and insults, which will indeed play a particularly important role in the whole story. Full of quotes already heard and loved by fans of the series, Escape from Monkey Island also boasts splendid dialogues (all beautifully and grandly translated and spoken in Italian!), imbued as usual with pure madness and capable of attracting those who until now had not never had to deal with the idiotic speeches of Guybrush Threepwood and company. Tradition and evolution Although 3D is the most relevant modification of FDMI, one of the most decisive evolutions is undoubtedly the control system. Unlike the previous titles in the series, which used the mouse with the ~point and click~ system, in this one our character will be controlled using all the keys available on the Dual Shock 2. In fact now, when he approaches an object or a prominent character, his head rotates towards him, after which different choices are offered through a series of sentences, or you have the ability to perform different actions, including speaking, using, examining and picking up something, thanks to the use of various buttons of the pad. The control interface is completely devoid of menus or icons of any kind, and therefore easy to learn after only a few minutes. As far as the graphics sector is concerned, it must be said that fortunately, despite the drastic transition to 3 dimensions, the designers have masterfully managed to keep the atmosphere of the game intact. The use of bright colours, comic drawings and irregular architecture gives the sensation of being in the middle of a cartoon. The backdrops are made in two-dimensional graphicsand pre-rendered, always very colorful and well drawn, to demonstrate the great artistic qualities of the Lucas developers. The characters instead, as well as everything with which you can interact, are displayed in 3D and composed of polygonal models of not too good workmanship, perhaps also due to the use of very few textures. In fact, it must be emphasized that the entire game analyzed here is nothing short of perfectly identical to the original PC version. The negative note of this fact is that to run it on a computer, a machine with slightly more than sufficient performance was enough, while now, having been transported on a much more powerful Playstation 2, a greater effort was expected from the programmers, just to demonstrate at least the goodness of the Emotion Engine. But as we know, you can't have everything in life. Finally, applause goes to the CTO, who, despite the flood of criticisms received regarding Onimusha, has in this case perfectly dubbed the numerous dialogues, even characterizing the various characters with dialectal inflections. Therefore, the adaptation to the Italian language is excellent, which with the perfectly timed background music, make the ~sound~ part of the title reach levels of magnificence that are difficult to compare to anything else currently on the market. For many, but also for all To conclude, this Escape from Monkey Island represents an indisputable gaming experience from all points of view, both for those who have played and loved the three previous episodes, and for those who are new to the universe of graphic adventures. We won't find a DVD that ensures 30-40 hours of play (depending on one's skill) at least until the arrival of Final Fantasy X, which however belongs to a rather different category of ~video game concept~. However, the extreme longevity of the title is necessarily slightly reduced, given the total lack of the multiplayer game, but this must already be put in advance when talking about a historical saga like that of Monkey Island, extraneous to the upheavals of what made it a myth of all longtime gamers: its playability. Pros: It's the first episode of MI developed on consoles; intriguing story as always and massive doses of humour; excellent voice acting and music. Cons: graphically with the Ps2 much more could have been done; sometimes frustrating puzzles for newbies; very short but frequent uploads. The monkeys come to PlayStation 2! Take in infectious Caribbean music, a crew of wacky pirates and an irresistible sense of humour. Here is the explosive mixture that made the Monkey Island universe one of the myths of us gamers. Released in 1990 first on Amiga and then on PC, The secret of Monkey Island was the first great success of Lucasarts, followed just a year after the second episode: Le Chuck's Revenge. Only in 1997, then, was the third chapter developed, which for a series of reasons, however, did not have the success expected. Finally, the fourth and final episode made its appearance on Personal Computers last year, trying to revive the glories that were by capturing the essence of the first and updating itself to modern standards, first of all three-dimensionality. Now Lucas has finally decided that her latest effort can be converted, and, mind you, for the first time ever, on a console. And guess which one?", "date": "2001-07-16", "grade": null}