{"name": "The King of Fighters Heat of Battle", "ref": "https://multiplayer.it/recensioni/the-king-of-fighters-heat-of-battle.html", "text": "The Experience The plot is inspired by the classic tournament held to select the strongest fighter in the world. Each participant comes to the tournament with particular goals and inner motivations that are linked to the previous titles of SNK and above all to the previous GameBoy title: The King of Fighter V.'95; all this offers continuity and depth to the game, delighting those who follow the evolution of the series. As in the arcade, fixed screens with text and drawings will tell you the development of the story in which you are the protagonists. The transposition for the GameBoy is extremely immediate and fast: the various combinations are performed easily, giving pleasure and satisfaction during the game session. Each fighter doesn't have his own characteristic ~stage~, the scenarios, in fact, are fewer than the selectable characters, but all the locations are pleasant and well done. The aspiring champions have at their disposal kicks (button A) punches (button B) which differ in power and speed (Powerful&Slow with a resounding press of the button, Weak&Fast with a quick press), jumps (Super, Mid-Level, Low) and inevitable SpecialAttack (which are obtained with ~moons~ and ~crescents~ or similar); moreover, in particular situations you can perform SuperSpecialAttacks. The controls are functional and well laid out, the ControlPad reacts very well and this is what counts in fighting games: playability. There are 15 characters that can be selected immediately, but in completing the game you will be told how to choose the other 4 hidden ones. The martial heroes are well characterized, they have charm and depth in short they are beautiful and always appear ~fresh~, despite the stereotype that encloses them, even after numerous games. The graphics are sharp, the character sprites, while small, are animated well and repurposed with the classic super-deformed structure. The game picture is stable, the flickers are intentional and appear only at the right moments, only rarely are some imperfections noticed. Even the audio is successful: the sound effects are spot on as well as the music which is never annoying even after many game sessions. Unfortunately, the cartridge does not have the possibility of saving, so each tournament must be taken to the end and the ~unlocked~ champions, which represent your progress, must therefore be activated with key combinations each time. The situation is not terribly inconvenient, the only tedium is that you can not save the settings, so every time you turn on the console to enter the options menu to set your preferences. The Options Menu provides for setting the time of the Rounds, the level of difficulty (Easy, Medium, Hard) and the ability to listen to the various music and sound effects. There are 2 game modes: the SinglePlay (that is the Story Mode in which you will have to face the tournament with the chosen wrestler) and the TeamPlay (choose three heroes, decide the order of combat and hurl them against the three CPU champions until the end of the tournament). If you have a LinkCable and an acquaintance GameBoy + TKOFhob equipped, you can undertake clashes, both in SinglePlayer and in TeamPlayer against your human opponent. The game system provides vital energy in the form of a bar in the upper region of the screen, which is consumed as you are beaten, decreeing defeat when it runs out completely. In the lower part of the screen is the PowerGauge, which increases until it reaches a limit, after which you enter the MAXIMUM area thanks to which it is possible to perform SpecialAttacks with more speed and greater damage on impact, you can also perform the various SuperSpecialAttacks related to your character. To load the PowerGauge you have two options: press A+B+the ControlPad down or let your opponent repeatedly beat you. I recommend the first methodology even if the other stratagem offers very interesting field reversals: you think you are dying but with the MAXIMUM active because you have been soundly harassed, the SuperSpecialAttack succeeds and you take away an outrage of energy from the opponent who will fall lifeless to the ground. With the Select key you can ~provoke~ the opponent by reducing his PowerGauge. There is also a ComboMeter which is activated when you start carrying out your attack sequences, the idea is welcome, especially for those who want to constantly improve by developing increasingly lethal combinations. Conclusions As you may have understood, I liked the game by now: I consider it a stimulating purchase for lovers of the genre and for anyone looking for a title of this type on the GameBoyColor or smooth. In addition, the 3 difficulty levels are well dosed, so for masterering the Hard level you will have to train hard. As a last gem I inform you that the game is compatible with the SuperGameBoy (version of the GameBoy with two controllers) and with the GameBoyGamePack for connection with the SuperNes. Intro The game in question is the European version of The King of Fighters '96. I immediately inform you that the title is an excellent two-dimensional fighting game and, although it was released for GameBoy and not for GameBoyColor, it is an extremely valid product, so much so that for some sites it is the best ever on the Nintendo portable console; for this reason, a review to describe and direct readers towards this cartridge seemed necessary to me, especially for those looking for a game of this genre. The original game concept belongs to SNK, every arcade I visited had at least one station of the various The King of Fighters or Fatal Fury that seem to have a very good following of fans everywhere (SNK docet). 1", "date": "2001-07-07", "grade": null}