{"name": "Survival Z", "ref": "https://multiplayer.it/recensioni/survival-z-recensione.html", "text": "The popularity of zombies shows no sign of diminishing, at least in the field of video games, and there are now countless productions set in a post-apocalyptic scenario in which society as we know it no longer exists, fallen under the violent blows of a sudden invasion of the undead. Well, the trend is also valid on mobile, as demonstrated by the review of Survival Z: the new title developed by Ember Entertainment, available exclusively on the Apple Arcade platform, projects us into a world made up of survivors and the living dead , using a cartoon style to outline characters, monsters and locations. Gameplay Survival Z, an action sequence during the campaign. The gameplay of Survival Z corresponds to the tradition of twin stick shooters, were it not for the fact that in this case there is only one (virtual) analog stick to be used and the fire or aim are not activated by the second, but are activated automatically in moment in which we have an opponent within shooting range. A simplification in favor of touch controls, although the game also supports Bluetooth controllers, but which in reality does not change the substance of the experience very much, which after the first three maps begins to become rather tough and demanding, above all because our character feels a lot the touch of the zombies. Survival Z, the screen with equipment and upgrades. To survive the stages, set up as a series of increasingly crowded and complicated hordes, it is therefore necessary to act as a remittance, build distances, keep away from the undead and give our rifle time to thin out the enemy ranks, simultaneously collecting special weapons such as turrets, bombs and sandbags, to be used between rounds, as well as coins. The latter can only be spent at the end of each path, in the context of a menu that allows you to upgrade your equipment or change your character from a list of survivors that grows as we save others in special escort missions. There is only one problem: these are simple skins, so there is no difference between playing the role of one or the other. Structure Survival Z, one of the campaign scenarios. As mentioned above, the structure of Survival Z is characterized by a series of paths that we can select, within different areas that culminate with a specific map. Choosing one path rather than another implies the possibility of facing normal hordes, special hordes and unexpected events, or stop at an infirmary to recover some vital energy. The survival element is based precisely on this aspect: we will not be able restore health, if not slightly, until the end of the path and we will therefore have to be able to stay alive until we pass the final battle. From a certain point on it becomes quite complicated, but you can't go back and do a little grinding: you get more or less stuck and the progression suffers. Graphics and sound The cartoonish style chosen by Ember Entertainment for the graphics of Survival Z is convincing and well done, thanks to a great variety of enemies and creatures that we will have to face between one stage and another. In the cutscenes, the solution adopted by the developers for the characters does not pay much, but in-game things work quite well, thanks to a solid frame rate and nice effects. The soundtrack is surprisingly pleasant and sufficiently varied, with a series of tracks able to effectively accompany the action, increasing the degree of involvement of the gameplay but without becoming repetitive.", "date": "2021-02-24", "grade": "7.5"}