{"name": "All Star Baseball 2002", "ref": "https://multiplayer.it/recensioni/all-star-baseball-2002_a.html", "text": "Acclaim takes the leap I would like to talk to you about this subject for hours but, alas, I am not a journalist of the Gazzetta dello Sport but only the humble webmaster of this ~Gazzetta dei videogames~. I think writing about a baseball game is not an easy task since probably many of you will not even understand the fundamental concepts of the sport in question. I think the best way to start this review is to teleport to Nintendo 64. All Star Baseball 1999 was born 3 years ago on Nintendo's 64-bit console, the first chapter of a game destined to become the ~Winning Eleven~ of baseball simulations. baseball. After 3 successful editions, Acclaim makes the ~leap~ by bringing the 2002 version of All Star Baseball to the PlayStation 2. What to expect from the transition to the new super-powerful platform? Lots of beautiful graphics, polygons galore and the same gameplay that had already proved successful in the past. What is the weather like today? The game offers a number of game modes including Quick Match, Friendly, All-Star Game, Season, World Series (the finals of the championship), Home Run Derby and batting practice. The individual games offer a very large number of possible variations. In fact, we can choose the Stadium, the time of the match (day, night, sunset), the weather conditions (no precipitation, rain, snow), the sky (clear, partly cloudy, cloudy, stormy) and the indispensable level of difficulty (rookie, veteran, all-star). The seasons have the same degree of setting with the only limitation that only one player is allowed to participate in the championship. In any case, it will be possible to play all 162 matches that make up a season or, optionally, only a part of these. The challenge is certainly very long and demanding also because, unfortunately, we are forced to play all 9 innings of the match. Finally, before starting, we are given the opportunity to start the season with the ~original~ rosters of the Major League or to draft all the players in the game. A sort of fantabaseballmercato... Note that the game is entirely in English. For obvious commercial reasons, Acclaim did not deem it appropriate to undertake translations into the most widespread European languages. A diamond made in the USA The time has finally come to get off on the ~Diamond~. The more experienced will not be able to resist the temptation to set up a new tactic for each match, arranging the men on the pitch according to their own philosophy of play. The possibilities offered are truly endless and lovers of this sport will finally find something for their teeth. The defensive phase is probably the least demanding since we have to worry above all about making good pitches and hoping for the bad outcome of the opponent's innings. On the pitching mound we can alternate our pitchers each able, according to their abilities, to perform different pitches. The classic ~quick cast~ and ~cut cast~ however prove to be the most effective. As the baseball rules teach, by making 3 strikes (strikeout) we will eliminate the opposing batter and after 3 eliminations it will be our turn to move on to the offensive phase. In the event that the batter manages to hit the ball we pitch, it will be up to the base fielders and outfielders to limit the damage. The latter, to tell the truth, are often badly placed and are inaccurate to control in case of launch near the limits of the field. Once the ball has been ~harpooned~ it will be quite easy to direct it towards the men on the basis given that a specific base is associated with each key on the joypad. The attack phase is definitely the most satisfying. We cannot have the phenomena Sammy Sosa and Mark McGwire at every turn but with a little practice we will have no difficulty sending the ball into orbit. A moment before the throw we can choose the direction of the shot and the inclination of the club at the moment of impact with the ball thus determining the trajectory of the hit ball. It's not one of the most intuitive hitting systems and perhaps for this reason it will seem even more strange to be able to execute beautiful ~home runs~ without too much difficulty and to lavish yourself on the much-dreamed-of ~homerun~. Maybe a little too many for a simulation... This is where it gets serious... One of the strengths of previous versions of All Star Baseball for Nintendo 64 was the graphics and things have certainly not changed by switching to the PlayStation 2. Acclaim has done a masterful job recreating all the stadiums of the american league to perfectiona with a wealth of details unheard of for a sports title. The polygonal models of the players, on the other hand, border on photorealism thanks also to the amazing facial textures and accurate reproductions of the official team uniforms. In short, from a graphic point of view you can't complain even if I can find a defect in the use of some textures that are not quite up to the situation. The sound sector is also good, characterized by the excellent commentary by Thom Brennaman and Bob Brenly and by a series of impressive sound effects. Cheering is not exactly what you will have the opportunity to hear in a football match but it does its part with dignity. Ninth inning In conclusion, I can only recommend All Star Baseball to all fans of this sport. The convincing technical realization combined with an accurate reproduction of all the most spectacular actions make this game attractive even to those who cannot be defined as baseball fans but for the latter it will probably only be a diversion while waiting for better titles. If, on the other hand, you hate baseball, forget it and turn the page because All Star Baseball will make you hate it even more due to the high degree of simulation that you will find yourself. That's it... Acclaim hit yet another home run! Pros: Excellent graphics High realism of the actions Guaranteed longevity Cons: Some control difficulties All in English Not attractive to everyone... The curiosity of a child As a kid I often wondered why baseball hadn't yet become a popular sport in Italy. There weren't many opportunities to be able to attend matches of American sport par excellence, which I couldn't explain. My curiosity was fueled by a series of film productions inspired by baseball and in particular by the usual ramshackle Major League Baseball teams protagonists of a miraculous rise in the standings. Still nothing about real matches... Over time I realized that baseball was not of interest to the European public (Italian in particular) because it was considered a boring sport and too different from the much loved football, the only and undisputed king of our local television. This consideration did not sufficiently satisfy my curiosity and a short time later I found myself at the training camp of the neighboring town's baseball team, determined to face that adventure too. It was quite an adventure given that after a few weeks my ~American~ dream ended. However, the experience was enough for me to realize that the much-despised baseball isn't all that bad and that it's probably a better sport to play than to watch...", "date": "2001-06-26", "grade": null}