{"name": "Le Mans 24 Hours", "ref": "https://multiplayer.it/recensioni/le-mans-24-hours-5.html", "text": "Let the show begin! After this more or less exhaustive initial hat, it's better to get down to business and then talk about the graphics sector, cross and delight of all Ps2 productions. And here we stand at very high levels. The feature that immediately catches the eye, even after a distracted session at the trusted shop, is the impressive speed and the feeling that it conveys, even if you run with the most external view possible. In the long straights of LeMans you are amazed to see the incessant flow of the asphalt, and above all the very distant horizon that is always visible, without the game engine resorting to fogging or obvious slowdowns or falling into particularly showy bad clipping. Everything flows smoothly even in the case of several cars on the track. The car models are generally well made, even if their quality sometimes seems to be discontinuous, where the textures applied to the car models appear in some cases frankly poorly defined, such as in the production models, while in the prototypes there is a cleanliness and very good definition. Unfortunately, antialiasing is not present, however there is not much to complain about, given that the ominous serrations are hardly noticeable. The surrounding elements are many, and they too stand at high levels, while the representation of the pit stop deserves applause, where instead of the usual two-dimensional mechanics, we enjoy beautiful 3D models, rarely included in a title, as mere side dish. A lot of graphic quality is also found in the light effects, and in the changes in weather and environmental conditions (day/night transition). We are in front of a feast for the eyes: the rain effect is sensational, the drops of water are printed on the camera car, the stop lights are reflected on the wet asphalt, big drops fall on the track, raising splashes worthy of the greatest volcano in eruption, profusion of lens flare, at night the signal lights of the most demanding curves dazzle us already 500 meters before, then poetry breaks into the frenzy of the race with thrilling sunrises and sunsets. Exhilarating is the least that can be said. We must also commend the work done by the programmers on the car bodies, which do not get damaged and scratched, but reflect the whole surrounding landscape, and depending on whether it is day or night, sunrise or sunset, they take on different shades of color. Very unpretty, indeed decidedly inadequate, are the shadows of the car on the track: squared and not at all similar to the corresponding car. Arcade or Simulation? The Infogrames title, jumping from one branch to another, is halfway between the arcade setting and the simulation, favoring a less demanding and decidedly more immediate approach than its direct competitors. It is possible to make use of driving aids, but frankly it is more convenient to set the difficulty level high, than to immediately jump onto the track without Abs and various traction controls, since you immediately learn to govern the vehicle. The driving model is less accurate than that of Gran Turismo or at the limit of the recent F1, in the good sense of the term though. It is not superficial, given that a wet or drying track really leads to loss of grip, but the cars of the same category are all quite similar, and there is no blaze of settings of the previous racing titles, given that the only parameters to be modified are aileron, petrol, ratios, engine characteristics and type of tyres. Going directly to the heart of the matter, the title lets itself be played right away, galvanizing the player who immediately manages to paint a curve, and also proving to be very satisfying given that in any case it is not easy to keep one's head until the end, given that with the same ease with which you climb positions, in the blink of an eye, distracted for a second, you risk ruinous falls in the rear. We always remain on the alert given the bad habit of the opponents to hit the counter. Then the artificial intelligence routines of the other drivers amaze: it is not infrequent to see them in full tussle giving each other a good fight, and what is even more important, the binary effect of the cars seems to be limited, i.e. always following the same ideal trajectory, which corresponds to reality (as in the real F1), but which often translates into deadly little trains that mortify the work previously done behind it. The total lack of effects from collisions is unfortunate: the cars bounce and after a crash at 300 hours it starts again as if nothing had happened, without dentsnor scratches. I find it to be a significant defect in any case: finishing a race immediately due to breakage or an accident at the first corner would be frustrating and sincerely out of place in a title like this, but at least the deterioration in the car's performance could have been included, since in any case simulation elements are present, such as tire and petrol consumption. Last corner... Ultimately, we are faced with a title, which makes immediacy and fun its raison d'etre, placing itself almost halfway, as I have already said, between simulation and arcade. Long to play, given the many cars and tracks to unlock, a pity unfortunately for the part of the settings that lack depth, which if on the one hand helps us to extricate ourselves between parameters worthy of engineers, such as in GT or F1, on the other it limits us, having been able to try various setups and convergences, given the high variety of vehicles and circuits. To close, the work of Infogrames represents an obligatory choice for lovers of automotive titles, it is certain that those who feel like an engine mechanic inside will be partly disappointed, but anyhow if this is the price to play a long and well fact that it does not require a learning curve worthy of the most demanding management software. Pros: graphics variety of vehicles and immediacy tracks Cons: very long loading few settings available for the cars From Dreamcast to PlayStation 2 in 24 hours The new Infogrames title is the direct conversion of the previous Dreamcast version, which had impressed a lot, for its cosmetic and playability qualities. The new version is nothing more than the revised and corrected revival of the DC title based on the new Sony hardware, and consequently an excellent job is expected. After a couple of loading screens (long loading are a constant of this title, arm yourself with holy patience) from the memory, there is immediately a nice surprise, already present for DC among other things, that is the choice between 50 and 60 htz and given the shortage of PS2 titles that offer this option, the programmers of Infogrames cannot fail to have our boundless gratitude. The main screen offers us a nice range of competitions, and different classes of cars, which we can generally divide into closed, open and standard prototypes (Porsche, Corvette and Viper). The main races, Championship and LeMans, as Gran Turismo teaches, refer to the characteristics of the cars that take part in them: there is no personal garage available, but it is rare to see cars of different types (or rather different configurations, categories ) run together. However, the fulcrum of the title is the Le Mans circuit, which can also be tackled in a reduced version, petit Le Mans. In addition to all this we can carry out a quick race, customizing all the customizable items as we like, and the timed race where we will face ourselves according to the now usual trick of the ghost car, choosing between GT, Open and Closed prototypes.", "date": "2001-06-22", "grade": null}