{"name": "Train Simulator", "ref": "https://multiplayer.it/recensioni/train-simulator.html", "text": "Trains. What a passion! Let's start by saying that the version in our possession is a Beta kindly provided to us by ~mother~ Microsoft, and I must also say that unlike other times, the software in question is at an excellent level of development (I still remember with terror a tremendous Beta of FS Combat Simulator II) and therefore widely appraisable, even if susceptible to modifications. Having made this premise, let's analyze this software with the curiosity of those who do not have sufficient technical knowledge to be able to evaluate the degree of simulation, and this is why the staff of Multiplayer.it makes use of a precious external collaboration in the person of a Engineer of the State Railways, to whom we showed the game. But let's proceed in the right order and start taking an overview to see what this simulator offers us. As I said before, we impersonate the engineer and we have to take care of all those aspects concerning the conduct of a train. This is by no means simple and requires truly remarkable technical knowledge, not only to understand the right meaning of the signals and interpret them correctly, but also all those mechanical notions that will come in handy in times of emergency. For example, to brake a train you need to understand what you are doing, given that the momentum involved is enormous and with it the inertia. Don't be scared, the game, like any good simulator, provides aids and simplified models even for beginners. In Train Simulator we have steam, diesel and electric locomotives, beautifully crafted and equipped with distinctive features. We will also have the opportunity to travel some of the most beautiful routes in the world, such as the Innsbruck - St. Anton (route also traveled by the legendary Orient Express) which will see us climb up the Alps or the Northeast Corridor which connects Philadelphia to Washington A.D. To top it all off there are the atmospheric conditions that vary and give a touch of extreme realism to the whole simulation. Look out of the window of our locomotive to take a look at a beautiful 3D landscape The game is made in full 3D and the engine, even if it doesn't prove to be among the most powerful, renders very well and recreates the landscapes with the right abundance of details. The cockpits are very accurate and show off the instrumentation with which they are equipped in good detail and which varies from train to train. The views are numerous and all very suggestive and we are also given the opportunity to sit in a comfortable armchair in a passenger car and admire the show through the window. The sound sector is also well done and makes the experience decidedly valid. We were talking about trains and locomotives. We will be given the opportunity to drive the Diesel GP38-2 and KIHA 31 or the very fast Acela Express or HHP-8 electric trains with 8,000 HP, but the cream of the simulation is represented by the steam locomotives: the legendary Golsdorf Series 380 or the Flying Scotsman. It must be said that while Diesel and electric trains have similar systems, steam locomotives are a whole other world and are much more complex, but once they start up and get your face dirty with soot you know what a satisfaction!! Furthermore, in the case of steam locomotives, the simulation is almost absolute; imagine that it is possible to understand the degree of combustion of coal by looking at the color of the smoke! The word to the expert As I mentioned before, I showed the game to a technician of the FF.SS. and here are his impressions. ~The game, in terms of technical content, is well done and recreates the procedures relating to the management and running of a train in a very convincing way. I found a certain approximation in the signals, which have been reduced in number and meaning , this was a simplification, probably made in order not to make understanding excessively complicated.Furthermore, in our railway system the signals are different from those adopted in other countries, and therefore there may be marked differences, even if the meaning is substantially similar. I was struck by the care with which the locomotives and their components were built, the sand cascade on the wheels was even implemented, in case these do not have a good grip on the rails.Remarkable.Also the numerous approach and behavior procedures near the stations they were found to adhere to reality. So an excellent job that gives a perfect idea of what it means to drive a train and all the procedures and regulations that must be followed to drive it in an optimal way.~ But what is the purpose of the game? Yeah, I have a simulatortrains, but what is the purpose? The answer would seem obvious, that is, it is the pleasure of driving one of these beasts, after all, simulation is just that: the faithful reproduction of a system. In our case, this doesn't just mean driving a train, but above all, respecting the rules that underpin rail traffic. And in fact it is essential to respect the timetables, the safety rules, and those of embarking and disembarking passengers. In any case Train Simulator offers us some interesting variations represented by ~particular~ scenarios such as the one that sees us engaged in driving a train after an earthquake. It is evident that longevity is inextricably linked to the pleasure one feels in driving a train and everything that surrounds it. To complete the picture we must tell you of the numerous editors that make up the package and which give a considerable depth to the title. I talked about numerous editors, because in our Beta there was, in addition to the obvious Route editor, also an Activity editor, a Cab editor and a Geometry Editor. Unfortunately I can't express opinions about these, given their precarious functionality (we're still talking about a Beta!). Conclusions What to say? Train Simulator is a title that deserves proper consideration for many reasons. First of all, it is a new and, in some respects, innovative title, especially if we consider the fact that up to now train simulations have been based on the strategic/management aspect. Then it will delight lovers of rail vehicles who will have the opportunity to take a ride on beautiful locomotives up and down highly spectacular routes. Of course, the game can be a little too ~relaxing~ for those used to much more frenetic games, but I assure you that taking things differently from time to time can only do you good. It can also represent an outstanding tool in the hands of those people who want to use this simulator for educational purposes. In this Train Simulator proves to be a perfect title. Bye bye. Eh.. indeed Ciuff Ciuff!!! I'm talking to flight simulation enthusiasts: admit it, how many times have you imagined being on an airliner and, due to a sudden illness of the pilot, putting yourself at the controls of the aircraft, and thanks to your flight knowledge gained after hours he hours spent behind the monitor of your PC, did you manage to land the plane in one piece, obtaining, not only everyone's gratitude, but also an interesting invitation to dinner from the prettiest stewardess? (On the other hand, cinematography is full of these situations, from the various Airports to the legendary The craziest plane in the world!) Now imagine, however, that this ~inconvenience~ occurs while you are on a passenger train! And now what do we do? We run towards the locomotive and... surprise! We enter a cockpit in which we understand absolutely nothing. Well of course unless you have played Microsoft's Train Simulator, the only train simulator that puts us at the controls of a ~real~ train. Seriously, Microsoft's new simulation effort tackles the theme of trains in an absolutely unusual and extremely interesting way: through the eyes of a train driver.", "date": "2001-06-20", "grade": null}