{"name": "Kuri Kuri Mix", "ref": "https://multiplayer.it/recensioni/kuri-kuri-mix.html", "text": "SPQJ: these jappos are crazy.. The day of the Moon festival has arrived, an unforgettable day that the clan of rabbits organizes as usual except that..... the Moon disappears, it's gone!! What to do? Police? Who has seen? But noo, there are Chestnut and Cream, a couple (I think ^_^'ndLL77) who decide to walk to try to understand what has just happened, to help them with precious advice there will be the white and the black rooster. The game features 35 game areas divided into 7 large islands (unless you find the other 2 secret islands.ehm..ndLL77), before arriving in the presence of the final enemy. At the beginning of this article we talked about the originality of the game concept and the time has come to reveal the arcane mystery: you will SIMULTANEOUSLY control the two heroes who are at the 2 edges of the screen, therefore separated. In fact, the programmers of From Software will often force you to make the 2 tender bunnies cooperate with each other, under penalty of being unable to finish even the first stage alone. Let's give some illuminating examples: at a certain point Chestnut will find a stream with no possibility of crossing it while Cream will notice a big button: remaining on the huge grope, the bunny will activate platforms that her buddy can use to continue! In the presence of the first boss, Chestnust will be found on the ledge of the castle where traps can be activated in the form of rams of those used in the Middle Ages to break through the large gates of the feudal lords. Cream acting as bait can get the Golem right near the outlet points of these huge objects by hitting it. Other times it will happen to close doors that will open others for your partner, still others you will have to move a hungry crocodile by pulling the leash that is on the opposite side of the screen in a completely different direction and so on. The undersigned hopes to have made the idea and even if the examples given are only an extract of the variety of puzzles implemented by From Software, I don't think there are any doubts about the revolutionary game mechanics introduced therein. How how? Is it impossible to manage 2 protagonists at the same time in a platform/puzzle game? Well, the default configuration is the most appropriate in my opinion, after the obvious 5-10 minutes of practice, mandatory for anyone (after all, no one has ever said that Kuri Kuri Mix is an easy game, indeed!!!): with the left analog stick, L1 and R1 respectively you will move Chestnut, you will make him jump and you will allow him to perform various types of actions depending on the circumstance and with the same keys arranged on the right, Cream will perform the same actions, making the 2 characters completely independent each other. Later you will also find some delicious trinkets to best equip our big teeth, such as a cannon, a hammer and even grenades. Don't worry if the first few times you play, a character will fall into the water while another is one step away from the finish line 2 seconds from the end of the time allowed to finish the level or again, it's normal if you don't even complete the second level on the fourth attempt if you don't solve all the puzzles quickly or you don't take all the alarm clocks that will increase your time limit by precious seconds. At 24 years of my existence I have finally tried a new gaming experience and I feel pleased with it. It goes without saying that you can also solve the story mode together with another human person in order to make things easier (or worse, who knows!). Once all the levels are finished, the time has not yet come to put the game back in the Dvd package, you will have to find 4 objects that are found in the first 4 (out of 5) levels of each world that will allow you to unlock the extra characters (8 in everything) to be used in the multiplayer mode that we will now describe: you play with 3 other friends to reach the finish line with the greatest number of objects in your pocket, paying attention to the plots of your rivals: the battle mode is simply hilarious!!! Graphics and sound In games of this type, the audio-visual sector is certainly not a quality deterrent but the colorful graphics, fluid at the right point (50 fps) and with a characterization in a distinctly anime style (a la Pokemon and Digimon), are certainly pleasing . The backdrops are divided into worlds, we have the snowy one, the musical one, the desert-themed one and so on. The music is the classic rounded Japanese of puzzles, so fun, relaxing and made with care. Appropriate sound effects and the screams of the bunnies close the picture, in perfect perfectionline with the character design. Must buy in the air. Puzzle game fans, even before the paragraph on the aesthetic-sound side, will have already split the pig-shaped piggy bank to approach the game distributed in Europe by Empire Interactive. All the others who are still reading these lines are perhaps in limbo before entering Purgatory, undecided about what to do. Well, personally, I really don't think there is a lack of fun and if you are having problems just because you want Playstation 2 graphics and sound, you are very wrong: playability is the real deterrent that keeps us attached to our trusty television despite the now your girl is waiting for you to come out: in that case ... well ... a game with stratospheric fun like Kuri Kuri Mix comes out with an even lower cadence than a solar and lunar eclipse at the same time so you have no excuses, buy it and enjoy, otherwise Do you have to make a console like the Sony Black Monolith? Must buy in the air. Pros: Very funny and original Cons: someone will turn up their noses for the technical realization not up to the machine Original!!!!! About fifteen years ago, a certain game of Russian origin called Tetris made its debut in the then crowded arcades. Inexplicably, the undersigned (still in his elementary school apron accustomed to Rastan, Shinobi and super Sega cabinets) wondered what fun a game with such a bland appearance and substance could generate. Game Boy first model with a Tetris cartridge included which of course will keep me company on my upcoming vacation. After Alex Pajitnov's game (amen if I got the surname wrong ndLL77 ^_^), puzzle games (perhaps the first videogame genre greatly appreciated also by women of the fairer sex) have found new lifeblood in Puzzle Bobble (from us Bust A Move), a spin off of a Taito arcade classic that emulation fans like me occasionally pull out of their trusty hard drive. After Taitian's excursus in the field of puzzles, Capcom also arrived with the famous Super Puzzle Fighter 2 x arcade (later also converted to Saturn, Playstation, Pc and recently Dreamcast), damned fun even if played in pairs. Playing in pairs in this videogame genre has always had great success, just look at how many couples have argued in challenges to the last piece of Tetris (who remembers Super Tetris for Snes playable by 4 people at the same time?) and the aforementioned masterpieces, but the game that we are now going to analyze makes it a philosophy, artfully implemented that allows Empire to release a fun, frenetic but above all original video game, programmed by the almond-eyed minds of From Software (who remembers the King's Field saga for Psone ?)!!!! In spite of those who think that the original concepts are dead, here you are, ladies and gentleman, Kuri Kuri Mix!", "date": "2001-06-13", "grade": null}