{"name": "Crash Boom Bang!", "ref": "https://multiplayer.it/recensioni/crash-boom-bang.html", "text": "huh? The worst thing about the Dimps product is certainly the lack of intuitiveness of the menus and of the game in general. A party game must be clear right away, while Crash, through a confused iconographic language, certainly does not pave the way for the player. Once you have chosen the character you will be catapulted onto a fully polygonal board, ready to roll the dice. Unexpectedly, however, the head that will guide you during the game, instead of giving you some essential information, will advise you to use the objects at your disposal. Despite the emphasis placed on them, these elements are quite irrelevant and above all difficult to use: they do not alter the balance of the game as they should. You interact with the menu via the touch screen, which should simplify operations, but despite this it is very difficult both to understand what a particular object is for and how to use it: you must first select it, then confirm your choice and then assign it to a particular character. all obviously only after having understood its function. The commands through the stylus, although they are comfortable, unfortunately they are not very reactive and penalize the pace of the game a lot. However, the strange design decisions are not limited to confusing menus: the boards themselves, however nice to look at thanks to the polygonal design, are quite trivial and above all give life to games totally dominated by chance. A race ends only when 4 particular hidden objects are collected, unfortunately randomly, in as many boxes: hypothetically a game could go on for hours and hours without having a winner. In addition to this, all the menus and minigames are managed through the stylus, but when there is a fork in the game table you have to choose the way by pressing the classic keys, used only in this situation: why? Minigames In Mario Party at the end of each round there are minigames, the main distinctive element of the videogame board game compared to the classic one. In Crash, unfortunately, there are not many and they are not even well organized: in order to participate in these clashes, one must in fact end up in certain boxes, which are incomprehensibly very rare. On average, every five rounds you will try your hand at a minigame, and often not all the other competitors will be involved. The developers' choice not to show the movements of the CPU-driven opponents is appreciable, which would have been useless given the lack of strategy, and it was therefore rather strange to note the obligation to observe the challenges between them in the various minigames. In this circumstance your task will be to bet on one of the two contenders, hoping that it prevails over the other in order to get some points. Theoretically you could also incite your ally through balloons, but they are so difficult to compose and the way to send them is so unintuitive that you will hardly be encouraged to master the system, also given the marginal importance they have on the outcome of the game. The ~active~ minigames are divided into duels and four-way challenges. In any case, the movements will be entrusted only to the Touch Screen, which unfortunately has been exploited without much imagination and above all with poor precision, given the chronic lack of responsiveness of the controls: every time you put the stylus on the screen, about a second will pass before the your command is understood by the game. Apart from rare exceptions, even ideas are scarce, and above all, also due to the control system, minigames are decided more by chance than by skill. Particularly tedious are those in which we will be asked to move the character by tapping on the screen, because it will be boring both to repeat the movement incessantly and to direct one's alter-ego in the desired direction. Crash and the DS The Nintendo DS hardware has been exploited quite well, technically the game stands at more than valid levels. The polygonal constructions are appreciable, as is the modeling of the characters. Stylistically, a sort of Cel Shading has been adopted, with a thin black border covering the cast of Crash. The animations are quite badly done, wooden and unrealistic when it comes to the characters in particular, not very fluid in general. The sound sector for its part does not stand out too much, but diligently accompanies the game action. If the DS has been used well in these respects, the same cannot be said for its wireless potential: the game does not have a Wi-Fi mode, which would have been of vital importance, but above all it obliges you to have a cartridge head forcompete in multiplayer. This choice is quite senseless and counterproductive, given the low value of Crash in single for the reasons listed above: why should two people buy two identical titles if they cannot enjoy them individually? For party games multiplayer is essential, fundamental, it's lifeblood: the genre can't stay afloat without it. Mario Party himself, ambassador of these titles, is just enough when played solo. Crash Boom Bang! it is, by no means, a bad party game. The developers have made many wrong choices in the design phase, choices that unfortunately have been accompanied by an equally poor realization: not so much for mere graphics or sound, perhaps the only commendable elements of the game, but for the poor controls intuitive and imprecise. Another not negligible flaw is the difficulty you will have in organizing multiplayer games: absent the Wi-Fi mode, your only hope will be to find another buyer of the game. Pros Good polygonal modeling Cons Not intuitive Lack of strategy Slow and imprecise controls Poorly accessible multiplayer Dimps is a good software house born recently thanks to former SNK employees, and has made excellent games such as the Dragon Ball Budokai trilogy, the Sonic Advance trilogy and the recent Sonic Rush for Nintendo DS in collaboration with the Sonic Team. Crash Boom Bang! is a title that takes its inspiration from Mario Party, re-proposing the winning formula devised by Nintendo (which consists in the alternation between phases of a classic board game and minigame) in 2000. Given the developer's curriculum, it was reasonable to hope for a valid title, but unfortunately the realization did not live up to expectations.", "date": "2006-11-29", "grade": null}