{"name": "Summoner", "ref": "https://multiplayer.it/recensioni/summoner.html", "text": "The story of our Joseph I don't think it's appropriate to tell you the story of the game (also because an rpg must be discovered gradually), above all because it is really very long and you would certainly skip this paragraph, so I will limit myself to giving you some information about Joseph, pastor 19 year old, protagonist of the story as well as the first character controllable by the player. He is a powerful summoner (precisely summoner), a human being capable of making use of powerful allies of certainly non-human nature (such as demons), who can be recalled from other dimensions. Misfortune would have it that one day, when Joseph was still a youngster, unscrupulous brigands made their appearance in the village of Ciran, where our alter-ego was born; well, to protect it, our summoner (evidently still budding, given the results) summoned a terrifying creature which, however, razed the entire area to the ground, causing a large number of deaths, including Joseph's own parents. Left alone and saddened by what happened, the boy decides never to make recourse to his summoning arts again, preferring the more peaceful life that befits a shepherd, but not disdaining a bit of healthy training based on white blade, the sword with which you will start the game. The imaginary place chosen as the theater of battles and events bears the name of Khosos, divided into two large areas: Orenia and Medeva, 2 huge continents and, precisely in the latter, is Masad, the city where we currently lead our carefree lives of every day, until..one bad day Orenia's armies attack the city, the dead and wounded are countless, everything is set on fire and you are in doubt whether to break your promise never to use your dreadful power or not. Technical realization magical? When dealing with games that are not released on a single format but on various platforms, the aesthetic side of a video game suffers a lot, for better or for worse. The two opposing examples can be the Electronic Arts games (Fifa and Nba in the 2001 editions, for example), simply magnificent to look at, or the Tomb Raider saga, which, in spite of decidedly higher resolutions than the Playstation console is capable of ( but also Dreamcast, seeing Last Revelation and Chronicles), has to work hard to dissuade the PC user that the graphics are the same as the 32-bit Sony version with a higher resolution and little else. All this preamble serves to make it clear how the contemporary creation of Summoner for PC and Playstation 2 is decidedly positive, given the excellent cosmetics of the Volition title. As always, let's start with the technical requirements: the unquestionable minimum is a P2 400, 64 mb of ram, 8 mb accelerated video card and 800 (eight hundred!!) mb of hard disk; the recommended requirements settle on a P3 500, 128 mb of ram, 16 mb accelerated video card (api used Direct 3d, better if together with Direct X 8) and the same amount of free space on the hard disk. Technical realization magical? Personally I tried Summoner on 2 different machines: P3 500, 256 mb of ram at 100mhz, GeForce DDR with 32 mb of ram and P3 933, 256 mb of ram at 133 mhz and GeForce 2 GTS with 32 mb of ram. It is good to say right away that the installation that the undersigned recommends is the maximum one of 1.4 gigabytes, in order not to have swap and loading problems between the 2 CDs. On both machines used for the test, Summoner performed very well even at maximum resolution with full blast details even if the difference in frame rate (in any case not stable, although always up to the situation) is definitely noticeable. The screenshots used for this review were taken with a resolution of 800x600x32 and antialiasing in function (this feature is the one included in the game package, not the ~standard~ AA in GeForce 2 and 3) with the second computer used for the test and the frame rate, although oscillating between 28 and 60 fps, has always behaved well, needless to say how the performances have surged by disabling the AA or bringing the fog closer, which unfortunately, even if set to the minimum possible, is as recognizable as it sucks system resources: Volition itself recommends a 1ghz super pc with at least a GeForce 2 GTS to play with 1024x768x32 (the maximum resolution allowed) with AA activated and all the visual effects present on the screen. The characters are very well done, with more than adequate textures and a good number of polygons for the characters, whose facial animations are more than good. The backdrops (houses, castles, sewers,ships, dungeons, etc) are also well built, even if perhaps a shred of originality could have been used here and there. On the other hand, the omnipresent fog that is so reminiscent of the Nintendo 64 and some elements such as trees (made in 2D, flat as a sheet of accounting) and mirrors of water (certainly the creation of the liquid surfaces of Wave Race64 was not expected, staying on the subject of the Japanese software house, but we certainly deserved something better). Guess the effects of light and shadow, respectively when the summons are in progress or when you go through decidedly dark dungeons. Overall a more than discreet visual realization. Let's now judge what our ears will hear: music well adapted to what is happening on the screen, changing in real time depending on whether you are loitering, fighting, perceiving vital information, etc. Some sound effects seemed a bit dirty to me, others decidedly crystalline, of course if you have a Sound Blaster Live with adequate speakers (at least FPS 1500), the feeling of involvement will be much higher. The discrete dubbing in the Albion language closes the circle of sound production, not knowing if the version you will find in the shops will be in Italian. Last note: the version I tested gave a lot of identifiable problems (after multiple sclerosis, swear words and something like 10 different drivers tested for the GeForce) with the impossibility of using the 1024x768 resolution otherwise sudden system crashes, even if you will use the various patches. Tested the demo of the game, it did not give any problems, so it can be argued that it is only the review copy used for this article that is deficient in this sense. Last note before moving on to another little problem encountered: the programmers recommend using drivers no lower than 6.50 for GeForces. Again, the auto-update function only works after you've applied the 1.10 patch by hand, since Summoner categorically refused to auto-update: by applying the usual patch that hides a habitual but not appreciable little attention from beta testers, the game role Volition goes back to self-updating itself, arriving, at the moment in which these lines are written (with a full week of delay compared to expected due to the problems already mentioned), at release 1.21, essential for playing online with your friends. A somewhat unusual RPG Summoner is a role-playing game developed simultaneously for Playstation 2 and PC, so much so that the most noticeable differences (if you have a decidedly pumped-up PC) concern only the control method, the classic mouse and keyboard combination for the computer, the Sony dual shock 2 for the 128-bit Black Monolith. As soon as you start, a tutorial (skippable at any time you prefer) peeps out; rpg lovers will have no problem in the early stages of the game, since with a touch of the mouse you move, challenge an enemy in battle, chat with the enormous amount of non-player characters and much more; with the keyboard you can change the views, the camera angles, save the position, load, etc etc. If for now there doesn't seem to be a great conceptual detachment from other RPGs (at least for PCs, being Multiplayer dedicated to the world of computer videogames in the first place), well, you expect that at the beginning you will have to select your party, select the races and so on, right? Well, that's not the case with the latest Volition title, we start with Joseph and only after half an hour of play you will be able to find your first teammate, in this case the charming thief Flece and follow the others, like Rosalind and Jekhar, your friend for many years (exactly, even from the time of your youthful mistake). Once you start your first fight, a second peculiarity of this atypical RPG is immediately denoted: the combos!! No, I'm not crazy between Street Fighter 2, King Of Fighters, Tekken, etc, etc; once a hit has been successful, a symbol depicting a chain will come out indicating the moment to carry out a chain combo (a term coined in 1994 with the hilarious Vampire: The Night Warriors by Capcom), so just click at that PRECISE moment , for example, on an extra key (by default the combined keys are ~shift~, ~ctrl~, ~caps lock~ and so on) to strike a second well-aimed blow, push the enemy, dodge quickly and so on . If you want you can also remove the manual control of the combos but the computer of courseyou will never be able to mirror a human being who has mastered the reaction times, therefore able in a short time not to lose even a chain combo. During a fight, the other characters in your party will attack the enemies but always keeping in mind what you have imparted to them through some input here and there, so don't be surprised if Flece, instead of regaining new vigor through ~heal~ magic, will have to first wait for Joseph to have defeated the enemy he has attacked with combos. The ~solo~ mode is the last icing on the cake as far as the game mechanics are concerned: you can, if you wish, use only one character leaving the others stationary, if the circumstances require it: for example the thief Flece (the second character favorite of whoever writes these lines, if you didn't understand), is silent and skilled in the art of not being seen and sneaking away quickly, so if it's a question of entering areas where you have to retrieve objects and get away, the blackberry on duty is the 'ideal. The usual little things of role-playing games close the paragraph, that is that every time you shoot down an enemy you will increase in experience and that, little by little, you will reach ever higher levels of it, allowing you to modify factors such as resistance, strength, power of the sword, magic and so on. Conclusions As usual, the time has come to sum up, weighing the various parameters that distinguish a masterpiece from unspeakable crap, a decent game from a valid coaster. Graphically, the work is decidedly commendable, presenting well-made sprites, above-average quality particle effects and some decidedly alluring backdrops for our pupils, always greedy from this point of view. The sound sector is decidedly adequate (especially for those who can adequately enjoy the EAX sound system). The story is captivating, the twists are always around the corner and the numerous sub-quests will help to further increase the longevity, since an RPG is rarely solved for a second time. Personally I had a lot of fun with Summoner, but there are many opinions that differ from mine, judging by the feedback that the Volition-branded role-playing game has had and the reason, from what I have deduced, concerns the style of play chosen therein, so different from that of classic RPGs such as Icewind Dale, Baldur's Gate and so on. What does this mean? That if you are a true rpg fan (especially if you play Dungeon Master, Chtulu and company), you will certainly snub Summoner; if like me, you only buy good games, regardless of whether they obey pre-established rules or not, you will hardly be disappointed with your purchase. A game therefore more than discreet, but with a very subjective judgment, much more than the vast majority of video games on the market. Volition strikes back!! Raise your hands all those who have never heard of Volition, the software house responsible for some masterpieces such as the Freespace bilogy, a space-based shooter highly appreciated by critics and the public at the time of their release (Freespace 2 was also recently re-proposed in digital versatile disc format). Nothing else? Well, who do you think collaborated on the first real alternative to the award-winning (again rightly so) Doom and Doom2, or that Descent that made many gamers sick with their stomachs on PC and, subsequently, Playstation? Well done, you are also remembering that the sequel was once again co-produced (again together with Parallax Software) by Volition, however giving honors and duties to Outrage Entertainment for the third chapter of the saga. After this excurcus in the history of video games, let's go back to the present day. In truth, quite a bit of time has already passed since the announcement of Summoner, a decidedly atypical role-playing game, created by this American team residing 130 miles from Chicago and distributed by THQ, increasingly pressing in today's gaming market.", "date": "2001-06-05", "grade": null}