{"name": "Unreal Tournament", "ref": "https://multiplayer.it/recensioni/unreal-tournament.html", "text": "Single and Multiplayer But let's go in order. First of all, the user interface is very simple to use with linear but not too well-kept menus that could have been made better. In addition to the classic single player, you can choose to play the practical and multiplayer modes, the latter obviously not connecting to the big network, but only dividing the screen into two up to a maximum of four parts. It is obvious that this option (the one with three or four players) is practically unplayable on televisions that are smaller than 17'', in fact an early short-sightedness given by the small size of the sprites! Seriously, the use of a new generation multitap is also obvious since those of the legendary PSX are not compatible with the new games. Initially, a sort of connection via Fire Wire port was foreseen which would allow two lucky PS2 owners to be able to challenge each other in full screen, but above all without spying on their opponent's movements, which considerably lowers the longevity as well as the playability of the game. title of the Epic; no original cable has come out yet that allows this and from the options it doesn't seem that this mode has been included. Sin! In the single player you will start with the classic Deathmatch and then unlock other modes such as Domination, Capture the flag and Assault as the game progresses, all types of game that can however be experienced early by the player in training, in which it is possible among the other things change some parameters such as gravity, speed, etc At the beginning it is possible to choose between 11 different skins with the possibility of unlocking another 10. Control is everything Returning to the main theme around which the whole judgment of the title in question revolves, or the need to have a mouse and keyboard (strictly USB), it must be said that this aspect should not be underestimated. First of all, those who do not own these peripherals must necessarily consider the fact that the price of the game must be added to the price of the two little objects, which on average is 150/200 thousand lire. Oh yes, because with just using the pad everything becomes truly unplayable, frustrating and boring. There is no accuracy in aiming at all, which is fundamental in this type of game. For less frenetic titles such as Medal of Honor the Dualshock will also be fine, but for such a dynamic shooter it really isn't. The game was played with a Microsoft wired keyboard and a Logitech wired mouse and both worked great. As soon as they were inserted, even with the game started, they were recognized without any problems, thanks to the USB connection. But be careful, because I had the opportunity to try a mouse also from Logitech but cordless and moreover of the optical type (that is, without a ball but with infrared rays) and this was recognized but did not respond to commands and the reason lies in the fact that on PC these devices use drivers to work and obviously these ~instructions~ are not transferable to the PS2, at least for now. The advice is therefore to try what you are buying because it may not work on your Playstation 2. Concluding... In conclusion, after a careful observation of the graphic aspect, it can be said that the Epic guys have done a good job with fairly well made sprites even if they are not comparable to those of a PC pushed to resolutions beyond 1024*768, but so And. I was very annoyed by the loadings between one scheme and another which are very long but above all the slowdowns that the game engine suffers a little too often in case of frantic actions, with a framerate evidently below the 25 threshold, what not acceptable on such a powerful console. The music is just enough and a nice hard-rock soundtrack would have been nice. In the end we have a title that reflects the parameters of the PC counterpart in all respects, and therefore offers hours and hours of frenetic gameplay and guaranteed fun. I conclude by repeating myself for the third time: buy it only if you have or if you want to buy a mouse and keyboard, and you wouldn't hurt because from now on many games will use them PRO is Unreal Longevity Playability CONS Fundamental mouse and keyboard Long loading times slowdowns Becoming the Unreal Grand Master... will you be able to? Finally, console owners can rejoice too! The best PC FPS (First Person Shooter) ever, and Game of the Year, has also made its appearance on PlayStation 2. I'm obviously ptalking about Unreal Tournament (UT), the first-person shooter in which you will have to try your hand at bazookate with and against other players and/or bots (computer-controlled characters) with the aim of becoming the Unreal Grand Master. Strengthened by its immense playability and multiplayer quality, UT certainly did not disappoint expectations but there is only one way to truly appreciate this game: the use of the mouse and keyboard, a combo that is indispensable to say the least in the PC world and that it will surely become one as soon as possible in the consul's one.", "date": "2001-05-24", "grade": null}