{"name": "Delta Force: Land Warrior", "ref": "https://multiplayer.it/recensioni/delta-force-land-warrior-2.html", "text": "DAY TWO The missions follow one another following a kind of story line, nothing particular and compelling. If the first ones were short and easy, the further you get into the game, everything becomes more difficult (perhaps because I've also increased the AI of the enemies in the gameplay settings). In reality, the difficulty is not increased due to the increased artificial intelligence, but due to the greater number of enemies and the length of the missions. Often the mission is in cooperatives with a computer-guided soldier who, when he doesn't get killed immediately by throwing himself into the enemy ranks, offers valid help and good fire cover. Too bad he goes his own way and can't be given orders. I try to face the following missions with another character (I had initially chosen the sniper). I choose ~Gas Can~, the demolisher who specializes in the use of indirect weapons. Instead of the sniper rifle I take the ~GRENADE LAUNCHER~: a completely useless weapon, very difficult to control and unusable both for long and short distances. As soon as I manage to kill an enemy on a turret, I run for his sniper weapon. Gas holding the sniper rifle is like a sumo wrestler in a ballet tutu. While the first character chosen held the weapon still, with the breaker the crosshairs constantly move making it difficult to aim. All this to say that the idea of diversifying the characteristics of the weapons and characters is certainly appreciable, but all of the missions are designed to be tackled with precision weapons from long distances. DAY THREE The game is about to end now, this can be understood from the fact that the missions have become increasingly longer and harder. I'm starting to appreciate the ability to save during the mission. Once again, due to a very stupid oversight, I lose a dozen minutes retracing my steps due to the failure to destroy a crate. I try to change, out of curiosity, the settings of the graphics engine and set the maximum details to 1024. The game runs on my celeron 450 and on my G400. Back to the more playable (for my hardware) resolution of 800*600. I'm starting to make some general meditations on the game: average graphics, good sound, completely absent intermediate cutscenes (too bad), fun online game but poorly managed by the interface, low enemy AI, lack of real interaction with the outside world and with fellow team (the possibility, like in RainbowSix or Swat3, of giving orders and organizing tactics at the table would have been very interesting). DAY FOUR Game over, YAY! I can't complain about the longevity of Delta Force LW, it must be considered that, in addition to other missions included in the game (unrelated to the main campaign) and the multiplayer game, maps can be downloaded from the internet. The general impression is, therefore, that of a good title, which alternates between fun and brief moments of boredom. Sin. It could have been a real masterpiece if the development team had modified the original concept of the game a little more, instead of staying too faithful to the previous chapters. Therefore recommended to those who loved the first two chapters and to those who want to have fun with a military simulation with preponderant action components. A product that will have its moderate success, but not entirely deserved. Just to mention a similar title, but in my opinion much more intriguing and with more innovative features is the misunderstood and therefore little played Codename Eagle (in which it was possible to drive motorcycles, carts and airplanes). For all those who want to get an idea of u200bu200bDelta Force LW, I recommend downloading the demo, which includes the first game mission. Day One From the front page of the manual (I think Special Forces): ~My goal is to be successful in every mission - and live to be successful again.~ This is the unimaginative philosophy of the game: mission after mission to cleanse the world of evil, free the oppressed and gain access to the next dangerous campaign. You are professional soldiers of the American special forces (what more do you want, a Lucan?). I install the game and goaaaa! Right from the start it seems to be very simple and well built: the menus are clear and fast, the configuration possibilities are excellent, the paper manual is in colour, functional and pretty (what more do you want? two Lucanians?). Just to get into the technical: the game engine can run up to 1024*768 and uses a mix of Voxel and classic 3D. There has been so much discussion about the Voxel and its problems (I was never able to play the first chapter of the series due to my incompatible graphics card) that those at Novalogic have decided to use this ~engine~ only to manage the land and make viewand all the rest by means of classic 3D (even if the implementation leaves much to be desired: chairs and tables, for example, if broken, go from the ~intact~ state to the ~destroyed~ state without intermediate steps and animations). chosen the soldier to impersonate (there are 5 with different characteristics) and the weapons to use (in each mission you have to decide which arsenal to start with), I start the first mission (identical to the one you find in the demo): the graphics are not sublime , the dunes and the palmettes of the first Egyptian location are quite sad, but the engine runs without too many hardware requests and after a while you get used to the overall graphic flatness.Your entry into the scene is rather ~cool~ (I won't tell you anything for not ruin your game) and the first impact in terms of gameplay is very positive. The action is fun and focused on long-range fire. With the sniper rifle I move through the dunes, crouch and aim at unsuspecting enemies ( perhaps too unaware, even after my first shots, they don't seem to react in any way.. some of their reactions would have been appreciable; Instead they just sit there waiting for me to kill them.) But behold, some enemies wake up and try to get close to me: but they are too few and poorly covered (my scope is already above them) (I have to remember to browse through the options to try and change the AI setting some enemies: by default they are a bit stupid and zombies). During the mission you will be given instructions by the boss who will guide you along the pre-established waypoints. The waypoints help to understand in which direction to move, but it is essential to consult the list of objectives and understand their meaning and execute them correctly. It happened several times that I had to turn over a map several times because I had forgotten a small detail (like killing an enemy or blowing up something), which was not marked by the waypoints. The first mission moves inside the pyramids where the firefight slightly changes connotations, but in a couple of minutes the mission is completed without major difficulties. In this third chapter, the possibility of saving the game was introduced (someone complained that the saves make you lose a good deal of suspense). My very humble opinion is that the rescues should have been limited in number. The subsequent missions show us how the elements of the game can change considerably: in the second mission you will have a companion who will help you in the fights and give you the necessary cover, in another mission you will find yourself in a mountain forest area, in another on a marine platform in the middle of the night, in one mission you will have to, once you have found a hostage, escort him to the recovery site. The scenarios are quite diversified and the game, even if monotonous at times, overall fun: you can't wait to finish the mission to discover the new scenario and the new objectives. After a couple of missions I get bored and decide to test the game in multiplayer mode. I encounter the first difficulties in finding a server that can let me play without LAG and with a good ping: no performance information appears in the server list, only its location. The search for an Italian and therefore fast server is complicated by the fact that the list is in no particular order and difficult to manage. I find a German server (abandon hope of playing with a good ping) and dash in. The game mode is a classic Capture The Flag (we are 4 against 4, even if the game can accommodate up to 32 players at the same time, but do you think it enjoys 32 players??). As soon as I enter, I greet my comrades and immediately look for a comfortable position to be able to snipe. I follow my companions for a couple of meters (the names appear superimposed to find out where they are, look at the screenshots) and having found a good location, I set up. Here is the first enemy, there in the distance.. I take aim, but I'm already dead before I can pull the trigger. As I wait to resurrect, the map changes. I log out of the game and go looking for a busier server. I find a Dutch one. Now we are in 8 against 8 and the mode is king of the hill. The team that occupies a certain location for the longest time wins. The game is fast-paced and very tactical: two of my teammates position themselves on the highest hills to cover the valley with their sniper rifles and I attempt a frontal raid. Nothing to do, even the enemies are stationed. After being reborn, try another way. I go around the mountains and with my great happiness I manage to take the enemies from behind. My joy is short-lived: I am torn apart by another group of opponents who notice my blitz. I try to use the VOICE OVERTHE NET (Delta Force LW natively supports voice communication within the team), but the server does not support it. My ping is very high and performance suffers. I still browse the server list to find something in Italy, but the search is in vain. I will try another day the other game modes (co-op, deathmatch, team death match, king of the hill, team king of the hill, capture the flag, search and destroy, attack and defend, flagball).", "date": "2001-05-10", "grade": null}