{"name": "Resident Evil 3", "ref": "https://multiplayer.it/recensioni/resident-evil-3.html", "text": "Let's refresh your memory What is Resident Evil? It's a game with a very simple plot, with a technical realization that feels the passing of the years and with an irritating game interface. But then why is he so famous? Well, success often goes down strange and unexpected roads, and this Capcom title has taken some really unusual ones. In our country, the second episode of Resident Evil was even subject to a seizure for too violent content! After all, the horror theme dealt with is very similar to Romero's films and therefore permeated by that basic irony towards everyday life which, evidently, has not been well understood by the Judiciary. Anyway, let's get back to the actual game. The events take place in a small town by the name of Raccoon where an Umbrella plant is located which, due to a series of unfortunate circumstances, starts an epidemic that affects living beings causing them slight malfunctions. No nothing scary like pimples, or herpes: we're just talking about genetic mutations that transform us into Zombies. Trifles that weren't even worth including in the warnings. In any case, a team called S.T.A.R.S. is sent to investigate (if they called it S.C.H.I.A.P.P. it didn't have the same effect. Right?) and here our problems also begin. We impersonate the members of this team, and after the first two episodes we find ourselves in the uncomfortable shoes of Jill Valentine. Zombies, monsters and various atrocities Do you remember the legendary Alone in the Dark? RE is its son and takes over its game system and control. Basically there are pre-rendered 3D environments that the characters move around in true 3D. Unfortunately, when porting from the console, the backdrops and characters were not redesigned which, therefore, are quite angular due to the few polygons that make them up and to complete the picture, I point out the lack of all those effects to which we are now accustomed. To be honest it must be said that it is also possible to select video resolutions that reach 1600x1200 and 32bit color depth, but it is all absolutely useless. In short, if you have a Geforce 2 Ultra, RE3 is not the ideal game to test its virtues. However, in addition to killing monsters and exploring the town of Raccoon, the game requires us to solve some puzzles that are actually very, very, very easy. After all, there is a small novelty, and it is constituted by the presence, in the salient scenes, of a method of choosing between two available on video, needless to say that in any case the result of the different situations does not lead to major changes in the plot that remains , as usual, very linear. I conclude by saying that the control system, the interface and the inventory are the same as always, and it is irritating, in machines that have Gigabytes available, to find only 15 slots for saving, which happens (as usual) in some locations where typewriters are set up. PSX or PC? Said of the negative aspects of the title, we must also recognize an undoubted playability and above all a plot that keeps us glued in front of our monitors. In short, gameplay above all. And then we will return to the small town of Raccoon, even in the mythical police station, site of the first unforgettable episode. But what do we find more in this version than in the original console? Well there is a special mode, called Mercenaries, which is nothing but the same game but played by the Mercenaries and which takes place to achieve objectives. It must be said that this mode was also available in the console version, but only after solving the game. Oh I almost forgot the presence of a very useful (heh heh) animated mouse pointer depicting our dear Jilll. If I had to judge RE3 considering only the technical aspect, I'd really say that we're not there, yet if EIDOS continues to publish these portings from the PSX version without deigning to change anything, it knows that in any case success will be assured. It must already make us think that a game without many pretensions manages, thanks to a good atmosphere and a good playability, to attract all this attention. Evil is back, but I'd say it's like before! One of the biggest hits of all time for consoles returns to the PC version bringing with it the usual load of Zombies ready to feed on our poor limbs. The premises are good, but it must also be said that if it is true that the winning team is not touched, in the case of RE it was legitimate to expect something more. Anyway let's start this journey in the company of Nemesis. Don't you know who it is? Well buy the game and you'll find out!", "date": "2001-04-30", "grade": null}