{"name": "Need For Speed 5 Porsche Unleashed", "ref": "https://multiplayer.it/recensioni/need-for-speed-5-porsche-unleashed.html", "text": "The essential features The initial menu of the game has four game modes: singleplayer, through which you can compete in any circuit with any car against any opponent (after ~unlocking~ through the two modes presented below); multiplayer, with the classic network matches, via modem and via the internet: the latter, like Need For Speed High Stakes, full of bugs (confirmed by EA Sports itself): however be patient, they are working on it. Surely the reason why it is worthwhile to focus on this game are the test modes (~Factory testing~) and ~evolution~. The first puts you in the shoes of a character (whose big face you can choose from among six, a choice that will prove useless in the continuation of the game) who has the ambition to become part of the Porsche test team. Now, I don't know if the Porsche team is really like that or EA will be sued by Porsche itself, but apart from a couple of people, the testers and whoever you have to show around are really nasty, fake and hypocritical. Not that this will affect your ascent to ~Ace Test Driver~, on the contrary: the messages before and after your performance are mostly useless... but seeing yourself surrounded by braggarts makes a certain sense. :-) This mode includes multiple challenges: from slalom around the pins in dedicated arenas, to escorting Porsche members here and there around the city; from racing with other testers, to testing on snowy or wet tracks. The essential features Now, all of these tests are set in the following places: Normandy, the Alps, the Pyrenees, Monte Carlo and an obscure industrial town. Maybe I forget another setting, but in the end it's only these five or six. Well, unfortunately each setting has only one circuit, yes very long, but always the same. And doing it all over again, all or part of it, gets pretty monotonous after a while. In any case, they are designed with great care and beauty, as well as with a well-balanced degree of difficulty. The ~missions~ of the ~Factory testing~ are peppered with time trials, which put your driving skills to the test, especially for two reasons: the first is that most of the time you won't be able to scratch the car: just one light bottle and the whole race will be thrown to the wind; the second reason is that the maximum time to finish each trial is roughly based on a perfect trial plus a slight error: this means that you just need to skid more than necessary, even just once, and you won't have time to complete the trial with enough time. Therefore after a few trials you will get used to arriving 2 or 3 tenths late with respect to the maximum time: repeating the trial you will discover that the ~computerized~ cars are always in the same points and the memory of previous accidents will help you complete the trial ( usually with 2 or 3 tenths under the maximum time ... all calculated to perfection by EA Sports). The circuits made available are still quite simple, the traffic is there but not intense, and the police's artificial intelligence competes with the intellectual abilities of a ham. Frenaaa! Let me pause for a moment on the police: in the ~NFS Hot Pursuit~ series the police cars were quite well designed, there were many (in the most ~dangerous~ situations there could be five or six patrols chasing you), and fun was guaranteed . In NFS Porsche they are very rare, always placed in the same points of the route, they often go in the wrong direction, and try to block the lane by jumping on the opposite side of the road you are driving on. In short, real uselessness. If you're in front they reach you with a clearly unrealistic speed, but only once out of twenty do they seriously cause concern. The last mode present in NFS Porsche is the ~Evolution~: starting from 1950, numerous tournaments are played at the end of which, if you finish in the first three places, you will be able to unlock the following tournaments: all in three different ~eras~ (classical, golden and modern). In this mode you become a pilot and a mechanic at the same time: you practically become your own entrepreneur. Before a tournament you will choose the machine required to participate in it (you will have to buy it if you don't have it), you will buy all kinds of devices to improve its performance, you can adjust the setting, the color and you are ready to go. Now, if you go through Evolution after finishing Factory Testing, you're in trouble: the problem is that Factory Testing is so precise and complex that, once finished, you will be true masters. In the twenty years from 1950 to 1970 I always finished first, distancing the second by 2 chmeters and the last of 4. The Factory teaches you so much about driving with precision, that the first few races of the Evolution are jokes. When the tournaments get faster, with cars whose maximum speed goes from 150 to 250, things change radically, and getting into the first three places will become much more difficult. Changing cars for each new tournament is a must, buying new devices to have better performance is a must, selling old cars to have enough money for repairs is a necessity. However, all these operations are a bit cumbersome (it is necessary to navigate continuously from one menu to another): counting that they have to be done at the end of each tournament, one could think of something more automatic. Cornering, climbing... Let's now move on to the ~technical~ aspects of the game, to understand if your computer can afford the graphic wonders that NFS offers. I tell you the minimum requirements to play ~worthily~, ie with a resolution of 640x480x16 with medium / high details: 400Mhz processor up, 64Mb of RAM, 8Mb video card. Personally I tried it with a somewhat atypical system: Celeron 466Mhz, 196Mb of RAM, G200 with 8Mb: with this configuration, NFS works perfectly in 640x480x16 in Factory mode. With the Evolution, when you have 7 cars you're racing against, things get problematic, and I'm forced to reduce the detail considerably. Ultimately, counting that the systems mentioned are now of the medium / low category, I can say that NFS (like the previous chapters of the series) is confirmed as a game suitable for running on any PC from the penultimate generation up. The visuals are customizable as always, the view switches from the front of the car (which I usually use) inside, with the steering wheel and movable arms, to two views from behind: one close up and one slightly further away. In short, NFS Porsche Unleashed is a really good game, graphically well cared for, mechanically well managed and balanced with good wisdom. Longevity is probably the weak point, especially for fans of the genre, who will have already finished it in three or four days. Precisely for this reason I take the liberty of recommending its purchase when the economic version comes out. Maybe by then the internet game will be bug-free and the fun can go on for a long time. Introduction Need For Speed Porsche Unleashed can easily be classified among the games that, with a solid base, always offer new ideas every year. This time the protagonists of the fifth series of the EA Sports game are exclusively Porsches. Therefore, basing itself on the entire production of this prestigious brand from 1950 to 2000, Need For Speed can exalt, as always, spectacular graphics, decidedly good playability, engaging sound and a good longevity.", "date": "2001-04-30", "grade": null}