{"name": "Sheep", "ref": "https://multiplayer.it/recensioni/sheep.html", "text": "~However, the human race had survived...~ And here you are, with the task of guiding these cute little animals through a thousand pitfalls and through the numerous game levels until you bring them to ~Mount Mouflon~, the place where the historic contact with the alien sheep will take place. Let's try to understand first of all who we will have to play in this game. We will take on the role of a new shepherd who can be selected from 4 different characters, each with different characteristics and ways of ~acting~ with the sheep: - Bo Peep: Young shepherdess with a passion for rock and disco, a kind girl but with decisive manners, she represents the ~average~ character of the game, allowing quite good ~maneuverability~ of the flock. - Adam Half Pint : Former bank manager currently employed as a private investigator, with the herd he has a tough and peremptory way of being, which, while proving to be useful in many cases, sometimes instills fear in the ~woolly~ little animals and leads them to escape our control. - Motley: little dog with a desire to become a shepherd dog but with only one problem ... she is afraid of the more aggressive sheep towards which she often fails to make herself obeyed, while she has a good influence towards the more docile sheep who lend themselves to her commands without major problems. - Shep: Experienced sheepdog of a ripe old age with a few aches and pains that make him slower than the other characters. On his side, however, he has good control over all types of sheep, even if with his somewhat harsh ways he tends to frighten and scare away the more timid ones. Once the shepherd with whom we want to start the game has been selected, we will have to decide whether to launch ourselves immediately in an attempt to reach ~Mount Moufflon~ or if we prefer to first test our skills with training levels which constitute a small tutorial on the functions and mechanisms of the game . In both cases, our efforts will lead us to try to save the four breeds of sheep present in the game through four levels that we will have to face by gradually selecting which type of sheep we want to face adversity with. In fact, each type of sheep has different characteristics that may or may not facilitate the work necessary to overcome the levels, so let's analyze the various breeds: - Pastoral: The classic sheep that get scared by anything, are quick to move but tend to scatter to the 4 winds when you try to drive them. - Factoral: The sheep created in the laboratory for the production of wool, incredibly stupid, do not distinguish a flamethrower from a hatch of straw, which is positive when we have to make them pass near flamethrowers but negative when, left alone, they start hopping up mines and the like! - Long Wool: ~Trendy~ sheep who love metal music and extreme sports. They are brave and ~intelligent~ enough to keep away from the most obvious dangers. A little slow, they tend to ~small aggregation~ preferring to move in herds of a few specimens. - Neo Genetics: The next generation sheep created through cloning. Quick to move, they mostly move in a compact herd, which is good for movement but often leads to embarrassing mass deaths. Having selected the level and the breed of sheep with which we have decided to tackle it, we will find ourselves catapulted into a scenario that we will have to have a minimum number of sheep cross in a given time. To lead our sheep where we want we will have to run after them, yell at them and pick them up in order to overcome the various obstacles. Furthermore, we will often have to make the sheep do well-defined actions (press the key, enter the house, break down the door) which will lead to the opening of passages or the shutdown of some of the death machines scattered along the path by the perfidious ~Mr Pear~ and his henchmen who will try in every way to block our advance towards victory (for reasons that still remain unknown!) Once we have reached the minimum number of sheep saved, we will be able to decide whether to continue with our ~herd recovery~ work (increasing our score) or finish the level and go to the next one. In the various levels various power-ups will also be available for both the shepherds and the sheep which will allow us, for example, to scatter sweets along the path and then to trace a route for the greedy sheep to follow or to cover the sheep with medieval armor making them fire retardant and resistant to damage. There will be 7 worlds to overcome, divided into:  Polygon Farm  Village Festival  Mr Whoppys Jurassic terrain  Night clubs  Temple of desolation  Lost in space Each with a well-defined type of dangers to overcome according to the background in which we will find ourselves (medieval, space, citizen ...) and each composed in turn by 4 different levels. Scattered along the path there will then be useful signs that will explain how to use the objects that we will find or what dangers we are facing, also in each level there is a ~golden sheep~ which if collected 4 times will activate another level bonuses. The game therefore proves to be quite long and long-lived, longevity also increased by the 3 different selectable difficulties (easy, medium, difficult) which gradually increase the number of sheep to save and decrease the time allowed to do so. The difficulty, in general, is quite well calibrated even if already from the second world onwards the paths start to get quite difficult and in some places a little frustrating, also due to the behavior of the sheep which often do not appear stupid but real own suicide bombers. Note that during our efforts it is possible to save our position so that we can continue the game from the level we arrived at. On a graphic level we are dealing with a good product containing well-characterized characters and well-made interlude videos and also the sound of the game is pleasant and fun and the ~artificial stupidity~ engine that moves the actions of our sheep does its job very well I work by making them often act like real stupid little animals. In conclusion we can give a fairly good judgment to ~Sheep~ however finding a certain frustration in some situations of the game due to the totally senseless actions (but wanted by the programmers) of the creatures that we try to keep out of trouble with so much effort. We also remind you that the game is totally localized in Italian. ~However, the human race had survived...~ After the incredible revelations of the preview, here's the whole truth about those strange beings called sheep! Stardate 4320 Diaaaariooo of capitaaanooo Muflonix, we areaamooo approaching him to the planeeeetaaa teerraaa shortlyee pootreeemoo riaaabracciaaareee lee nooostreeee sooorelleee sendee seecooliii ago in missioooneee we are preparing to preeender contact with uuumaaaaans (who is the Shepherdeee? n.d.P ucci) These must be were the words of the commander of the sheep spaceship which, having arrived from interstellar spaces, took us from our daily chores to involve us in an incredible and vital mission... to gather as many terrestrial sheep as possible to reunite them with their space ancestors. As? Didn't you know that sheep are actually ~intelligent~ beings from another planet? Well I can understand you, in fact they landed on Earth millennia ago on an exploratory mission and, having fallen in love with our verdant planet, they forgot their duty and lost their lineage until they ~regressed~ into the sheep we are used to seeing.", "date": "2001-04-30", "grade": null}